["DREAMers are listening to every word in Washington because their lives depend on it. Today they heard the President throw insults at immigrants when a bipartisan group of senators came forward with a plan to get something done. They deserve better. We must pass the DREAM Act now."]["Primary voting in some states starts in just *two* months. @SenatorLankford and I sat down with @JudyWoodruff to get out the word about our bill to help states shore up their election equipment so we can prevent another cyberattack on our democracy. https://t.co/lGJfsgpP8Z"]["And while China is investing in Africa, this is the message from the Oval Office: Trump attacks protections for immigrants from ‘shithole’ countries in Oval Office meeting https://t.co/5MozPxdQWL"]["BREAKING: Bipartisan group of Senators reach an agreement on immigration. https://t.co/w8woeY7NL7"]["A free press is vital to the health of our democracy. That’s why this Administration’s attacks on the press are beyond worrisome. They’re dangerous. https://t.co/4JGM8RsJ8V"]["Was on @TheLastWord last night talking about DREAMers. They are watching our every word, because their lives depend on this. We must pass the DREAM Act, so they can stay in the only country they know as home. https://t.co/HHskdKPs5E"]["I was at the grocery store tonight frequented by my colleagues @SenAngusKing &amp; @senatorrounds (see amusing photo &amp; post below). I wasn’t lucky enough to see them, but I did get a good deal on some cereal.  https://t.co/w1dF8ppFxZ"]["Going to senate floor right now to give speech on dreamers.  Pass the bill!"]["Our Great Lakes Restoration Initiative (GLRI) does so much to protect our Great Lakes &amp; spur economic opportunity in MN. That’s why I’m leading a bipartisan effort to have Canada create a similar program, which could boost GLRI's effects for people in both countries."]["NOW LAW: The SAFER Act—my bill w/ @JohnCornyn, @SenBennetCO, &amp; @SenDeanHeller to help reduce the national rape kit backlog—was signed into law. It will provide more resources for our law enforcement officers to cut down on the rape kit backlog &amp; find answers to unsolved crimes."]["BIG NEWS: A federal court has struck down NC gerrymandered Congressional map as unconstitutional—violating Article I, the First Amendment, and the Equal Protection Clause. Each voter should have a voice, not be silenced by districting. Good work @CommonCause who brought the suit. https://t.co/HskeRzIrTr"]["There is no doubt that Russia interfered in the 2016 election. Sunlight is the best disinfectant in politics &amp; I called for the release of the transcript of Fusion GPS co-founder Glen Simpson's testimony. https://t.co/o4I1O4WEsI"]["The FCC's decision to repeal #NetNeutrality is wrong. Today I stood with @SenMarkey &amp; ten senators to announce that we have over 40 senators to force a vote on our resolution to restore our free and open internet. https://t.co/a1cjQa1Eja"]["We need to pass a long-term extension of CHIP *now*. The short-term CHIP funding was supposed to last until the end of March, but some children could lose their health coverage in a week and a half. Care for millions of kids hangs in the balance. https://t.co/zP6Z7GbVqB"]["ICYMI: My bill w/ @SenJohnThune to empower truckers &amp; commercial drivers to prevent &amp; report human trafficking was signed into law. This law will bring us one step closer to preventing these heinous crimes in our country. https://t.co/MZMtIdOOIw"]["Congrats to Minneapolis Mayor Frey &amp; Council being sworn in today. Here I am w Mayor @Jacob_Frey &amp; new Member Andrea Jenkins (@annapoetic). Told Andrea her shoes look great, but if she visits me, they don’t allow sparkly silver tennis shoes on Senate floor… maybe they should. https://t.co/iuMarmSg09"]["Well we now have an opponent. @Vikings will take on the Saints. I know we can pull off the win at home. Looking forward to a great game next week! #BringItHome"]["All Americans deserve safety/dignity in their senior years. In Nov. I called on Admin to do *more* to prevent &amp; investigate elder abuse in nursing homes. Instead they've been rolling back health/safety standards. I'll keep fighting to better protect seniors from abuse. https://t.co/xBdCnrEemN"]["There's Minnesota nice… and then there's going above and beyond to help out a local entertainer who lost everything to a fire. https://t.co/TT1hatdfAk"]["Skating outdoors in your neighborhood is a Minnesota tradition. In the town of Lewiston, Minnesotans raised money, donated time &amp; equipment (even a bulldozer!) and built not one, but two rinks! Happy skating! ⛸ https://t.co/0vCWYvuaGk"]["Yesterday I met Jolene Hodson, Wilshire Park Elementary School's beloved Safety Patrol Crossing Guard who works hard every day to keep students &amp; parents safe. She's been nominated for @safekids' America's Favorite Crossing Guard award. Vote for her here! https://t.co/9NemCXJoLi"]["It was great to speak at the 10th Annual Da Vinci Fest at Stillwater High School today and kick off their Science Challenge. I was very impressed! Always exciting to see so many students interested in STEM (science, technology, engineering, &amp; math)."]["It's cold out there, from Montana all the way to the East Coast. To everyone braving the cold — no matter where you live — here are some warm thoughts from Minnesota. https://t.co/haYk4pb8si"]["In case you missed this in the deep freeze....We must reauthorize the Children’s Health Insurance Program and as @ASlavitt notes here..no more excuses. https://t.co/qlAcitIVaN"]["Inspiring visit with kids and teachers at Blue Ribbon school Wilshire Park in St. Anthony this afternoon. Great STEM program! https://t.co/2NOQPMInu5"]["With Admin's “Election Integrity” Commission rightfully disbanded, we can focus on actually protecting our democracy. My Secure Elections Act with @SenatorLankford, @KamalaHarris, @SenatorCollins, &amp; @MartinHeinrich would help ensure free &amp; fair elections. https://t.co/8PO8peQHwi"]["My work to get approval for this  bridge was nothing compared to the actual workers!  See the Stillwater bridge go up in fast motion...Thnx to hard-working construction workers who built it. Cool video from MNDOT!\nMnDOT | St. Croix Crossing timelapse https://t.co/X5P1fJJAvC"]["Happy birthday to Vice President Walter Mondale, my longtime mentor &amp; friend, who is turning 90 today! Minnesota’s always been fortunate to call him our own. https://t.co/TN2WpvCu3l"]["My bill with @SenJohnThune, the Combating Human Trafficking in Commercial Vehicles Act, was signed into law. It will help train commercial drivers to better report trafficking. Truckers are often the first line of defense &amp; this will help them fight this heinous crime."]["Finally...as I said on July 3rd, the “Election Integrity Commission” always needed to go jump in the lake!  Disbanded! https://t.co/qPIThiygtl"]["More than *a third* of the U.S. Women's Olympic Hockey Team have Minnesota ties! Go get 'em Team USA! Let the North Star guide you all the way to the Gold! 🇺🇸🥇 #TeamUSA #PyeongChang2018 https://t.co/AIqZkrjEBU"]["With negativity battering the very soul of our politics, we need to stand our ground and find common ground to make our workforce stronger, bring down costs of prescription drugs &amp; combat the opioid crisis. Read my full op-ed in the @duluthnews: https://t.co/Vd8QHt1ujs"]["Today MN’s newest senator, @SenTinaSmith, was sworn into office - along w @GDouglasJones of Alabama. Tina will hit the ground running. I look forward to working with her - and Doug Jones - on the issues facing our country. Know they’re both up to the challenge."]["“Justice for all” &amp; the people who protect our democracy are not a “deep state” Mr. President. Justice is at our Constitution’s core &amp;those who protect us put their lives at risk for us every day.  Trump accuses Justice Dept. of being part of 'deep state' https://t.co/s1LH3pDZht"]["Here at Central High School at the swearing-in for St. Paul’s new mayor @melvincarter3 congrats Mayor Melvin! Joy in the house today. https://t.co/fUuun9px2X"]["Enjoy the day and remember to follow the North Star! Here's my New Year's message with some great photos: https://t.co/9BZVoMZwr6"]["What I already like about 2018...tomorrow it warms up from eleven below zero to....zero!!  Upside: can wear normal hat instead of one w/ear flaps.  Downside: Champagne bottle no longer chills in garage in eight minutes.  Happy New Year!"]["Nine minutes and counting and we can bid 2017 goodbye!"]["Another strong first half for the @Vikings (sorry Bears) and they are on their way to the playoffs with a New Year’s Eve win 🎊🎊🎊🏈🏈🏈🎆🎆🎆 #Skol"]["Following in family tradition of visiting cold weather places on vacation, our daughter is in Toronto for the holiday weekend. Oops! Miss you in MN Abigail! Happy New Year!🎊🇨🇦Toronto shortens New Year's Eve party due to coldest weather in over 100 years https://t.co/IH3jGluQvT"]["Remembering last New Year’s Eve w/ @SenJohnMcCain @LindseyGrahamSC w/Ukrainians on front line w/Russia.  Also in Estonia, Latvia, Lithuania, Georgia w/same message: U.S. stands w/allies against Russian aggression. McCain was at his best &amp; so kind to me. Happy New Year friend! https://t.co/5VCQi4t5pr"][".@jontevlin writes his last column...a good read.  You more than survived your career in journalism Jon...Jon Tevlin: 'Despite all odds, I survived a career in journalism' https://t.co/K9xIwaqNP7 via @startribune"]["Each year I visit all 87 counties to ensure I hear from people across MN. I finished my tour in Chippewa County w an agriculture meeting at Steve &amp; Lynell Sunderland’s Farm. On these tours I see MN leaders w big ideas &amp; the potential/promise of our state. https://t.co/44cp7otuK9"]["Always good to see the expansion of successful programs like this one from @YMCATwinCities, which helps Minnesota women and girls recover from hardship and find a path forward. https://t.co/kzP9JKzTow"]["What a way to show holiday spirit! Thanks to a $1 million donation to Perham area schools, teachers &amp; students will have more resources to attend enrichment programs or further their education in college, vocational or technical school. https://t.co/k5z2o8aYcs"]["Great story: when dementia kept John, a 79-year-old from Minnesota Lake, off the farm he got to work another way: making 1,000 wooden toys by hand to donate to kids who might otherwise go without. https://t.co/QS7FLjJnGj"]["Visited with Minnesotans in six western MN counties today, including the Arnold family. Joe was one of four FFA star farmer award winners in the country.  Thanks to him, his family and his FFA teacher Mr. Anderson got hosting me! https://t.co/aXe8prjBus"]["At cost of 3% of 1 aircraft carrier we can protect our election equipment—through backup paper ballots &amp; the like. Must pass my bipartisan bill to ensure WE (not a foreign government) pick our own elected officials. Joined Chris Hayes to discuss the bill. https://t.co/QXwciL8nmn"]["In 1944 SSgt Wayne Sundberg was serving in WWII when his plane was shot down. He sustained injuries &amp; was held by the Nazis as a POW for 9 months. Today I presented him with the Purple Heart he earned decades ago. https://t.co/z2GjAbu6JQ"]["Doug Meyer of Finer Meats &amp; Eats says, \"I’m going to stay till everybody’s taken care of. We’re just not going to give up.\" Heartwarming story about how Minnesotans look out for our neighbors -- even those multiple states away. https://t.co/IzzbB1rTtk"]["Drug prices are skyrocketing. That’s why @ChuckGrassley &amp; I called on the FDA to answer questions about whether they’re scaling back their policy that allows limited importation of approved Rx drugs. Americans need more access to affordable &amp; safe imported medicines, not less."]["We must do all we can to ensure people w dementia or a developmental disability make it home safely. My bill w @ChuckGrassley to increase access to necessary technology, resources &amp; training to prevent wandering and find missing people passed the Senate. https://t.co/iRgWtLFRit"]["Not only did we have a white Christmas, we had the coldest high temperature for Christmas Day in over 20 years! Stay warm and stay safe if you head outside today. https://t.co/7uYqQRZ2oT"]["The McNally Smith College of Music closed mid-semester this month. While the state govt is helping with transfers &amp; school record access, I’ve called on the U.S. Dept of Education to help these students by providing closed school loan discharge relief. https://t.co/fejRbC14VY"]["Since we know this will happen, we must pass my bipartisan bill w/ @SenatorLankford  to fund election infrastructure for 2018 elections. As in now, not later. Russia is going to attack our next election.The Trump administration may not even try to stop it. https://t.co/r2o1vvU9sj"]["Another outrageous example of drug company price-gauging, which must stop. It's past time Congress and the President stood up to well-connected prescription drug companies and their investors. https://t.co/2Npz8N2tza"]["It’s clear foreign adversaries will go to great lengths &amp; use our right to free speech to influence our elections. My #HonestAds &amp; Secure Elections Acts will bring more transparency to social media platforms &amp; protect open, fair and free elections! https://t.co/pxLxyCE1dU"]["For those planning to visit our great state for the Super Bowl: (1) don’t pay attention to the fact that the Minnesota wind chill forecast is 35 below today; (2) we have a roof on the stadium; and (3) It will be downright balmy by February #BoldNorth"]["Merry Christmas! I hope you have a day with those you cherish and that you can take some time to read, think, and reflect on faith, friends and family.  My Christmas prayer is to stay grounded in the calm, snow-covered new beginning of a Minnesota Christmas morning!"]["Merry Christmas everyone! https://t.co/gvYgqeFK3m"]["Vikings shutout Packers in Green Bay in Victory #12!  Defense..Offense...Case Keenum...The game was so cool (ok 8 degrees) and smooth that I even got all my presents wrapped.  #Skol"]["A chance to beat the Packers twice this year? That’s what we’ve been waiting for all week! And a win tonight would be a great early Christmas present! Let's go @Vikings! #MINvsGB 🏈"]["Good news for fans of ice architecture: “Winter Carnival will have a seven-story ice palace, after all”\nhttps://t.co/84PZcQDYyK"]["Good to-the-point (as in succinct) article by Tom Nides and Jack Lew:  Former Clinton deputies: How Rex Tillerson can right the State Department https://t.co/Re1cTYWIrA # via @HuffPostPol"]["My two bills with @SenJohnThune to help commercial drivers prevent &amp; combat human trafficking are headed to the President's desk to become law. They will help equip and empower truckers who are the first line of defense in prevention."]["Joseph Medina was an inspiration to so many. He was an example of why DREAMers are such an important part of our country - and why we must stand up for them now and pass the bipartisan DREAM Act. You will be missed, my friend. https://t.co/NhEo1wRYfV"]["What a great story as we head into the holiday weekend! Sheila was in a coma in hospice care when her kids and grandkids came to say goodbye. But Sheila wasn’t ready for goodbyes! She woke up and will spend the holiday with her family. https://t.co/nfT0MIj0cA"]["When Strongbridge Biopharma bought the rights to a decades-old glaucoma drug, they hiked the price to $15,001 -- for a medicine that cost $50 for the same dosage in the early 2000s. @SenatorCollins, @SenatorBaldwin &amp; I are demanding answers for these skyrocketing price increases. https://t.co/9NgJI9X3dL"]["Thanks @abbyhonold for your courage! Honored to introduce your bill today with @JohnCornyn &amp; @tomemmer  Thanks to @alfranken for the work on this bill which allowed us to introduce it today. https://t.co/364A0t65C5"]["Correct!!! https://t.co/eLA2ghNv7p"]["Dreaming of a white Christmas? Minnesota is the place to be! 🎄❄️\nhttps://t.co/bGtqClnKuD"]["My dad was a reporter, so I grew up knowing the importance of a free press. It’s the basis of a strong democracy. We must keep standing up for journalists - not only those protected in the US by the First Amendment, but those working to promote truth around the world. https://t.co/eEaSBpg4qq"]["To have your voice heard, you have to vote &amp; our democracy has to work. Last yr foreign adversaries tried to hack election systems in 21 states. My bill w @SenatorLankford, @SenKamalaHarris &amp; @LindseyGrahamSC provides states resources/cyber expertise to improve election security. https://t.co/3veZQxkAnQ"]["Thanks Rick for standing up for the First Amendment. https://t.co/IbaOs47yOr"]["Thanks Doug.  This can’t happen again.  We have both Democrats and Republicans supporting this bill. https://t.co/A6FnvETRcJ"]["Another incredible example that every vote counts! One single vote of one person will change the control of the legislature in Virginia  https://t.co/hwDUfzcfab"]["As we have seen tonight &amp; all year, voting matters. The more people vote, the healthier our democracy is. Yesterday I introduced the VOTE Act with @SenMarkey, @SenBlumenthal &amp; @maziehirono to help High School seniors register to vote."]["We are running out of time to ensure that DACA recipients are able to stay in the only country they know as home. We need to pass the #DreamActNow."]["A new CNN poll shows that 55% of the country opposes the GOP tax bill - and only 33% approves. Americans are telling Congress to go back to the table and make the tax bill better for the middle class. https://t.co/j8mUPvuZWt"]["This is an important program. Good to hear that it’s expanding and will be helping even more children succeed in the classroom next year.  https://t.co/Yzo7pWZSxL"]["Read this and tell me if you are in group one or two (and why I’m against this bill): The Winners and Losers in the Tax Bill  https://t.co/FSInthzexf"]["The Super Bowl’s getting closer, and we’re going to have a lot of ways the celebrate. Here’s one way. Are you brave enough to try this? https://t.co/5MJfQ1FN51"]["Like the 17-0 end of first quarter @Vikings /Bengals score.  Like our chances of clinching the NFC North title today at home.  Like the #BoldNorth #Skol"]["After about a month on the road, @Vikings are back at home today to take on the Bengals. Looking forward to a great game! #MINvsCIN"]["There’s NO excuse for not passing CHIP now. None.  As I said in my floor speech, last time it got 92 votes. Millions of kids without care? The republicans must bring it up for a vote!  Congressional failure on CHIP, health center funding is a disgrace https://t.co/AeVX6CGpW4"]["The @mnwild are on a four-game hot streak. Let's make today's game against the Oilers win #5! #OurIce"]["One of my favorite books this (and every) year is Personal History by Former Washington Post CEO Katherine Graham. It isn’t just about protecting freedom of the press—it’s about the power of women to defend it. Excited to see @ThePostMovie w/ Meryl Streep! https://t.co/MAwaRlm5Nn"]["A bipartisan group of governors (including Minnesota's @GovMarkDayton) are calling on Congress to fund the vital Children's Health Insurance Program -- which is running out of money. Children are counting on us. We must get this done. \nhttps://t.co/8ZVkK9sWPs"]["I know I’ve been asking you to speak out about a lot of topics this year, but I’m asking you to please raise your voice one more time. Let Congress know that this tax bill is a bad deal for America. This #GOPTaxScam is unacceptable. Email, tweet &amp; share! Call here: (202) 224-3121 https://t.co/14L0hNrnYl"]["@FCC The @FCC vote to end #NetNeutrality could stifle internet innovation by creating fast lanes and slow lanes depending on how much you can pay. That's why I've joined 16 other Senators on a bill to restore net neutrality."]["We don't know many details of the #GOPTaxPlan that'll cost $1.5 trillion and affect almost every American. What we do know is that it'll slash the top rate for upper-income households (even deeper than the Senate bill), leaving middle &amp; working-class Americans to pick up the tab."]["Today's @FCC vote to end #NetNeutrality protections is bad for consumers, businesses &amp; rural areas. These rules hold internet providers accountable &amp; promote competition/innovation. This isn’t the last word on net neutrality, &amp; I’ll keep fighting for a fair, free &amp; open internet."]["Further proof that prescription drug prices in the United States are out of control -- especially when compared to other countries. https://t.co/IghFKTaCqg"]["Another memorable headline for the day about @SenShelby Sen. Shelby channels Atticus Finch, saves the day in Alabama https://t.co/SROctoROMA"]["Tomorrow @FCC Chairman Pai will hold a vote to end net neutrality, even though the comment process included about 1 million fraudulent comments &amp; another ½ million from Russian emails. Should delay vote &amp; fully investigate these comments. Share this video &amp; make your voice heard! https://t.co/mw2R8ILgPD"]["This headline says it all.  Do you think THIS is what the voters in the red state of Alabama told the republicans that they wanted last night?  Tax package would lower top tax rate for wealthy Americans https://t.co/Y7P76Q0BAX"]["The week has temporarily returned to normal as Mike Lee and I chair a hearing on antitrust law.  Very timely with humongous mergers on the horizon and Justice Dept opposition to AT&amp;T/Time Warner"]["Lt. Gov. Tina Smith has worked tirelessly for MN &amp; with her experience she will hit the ground running. Minnesotans know that Tina will fight for them, and I look forward to working with her to get things done for our state."]["Instead of helping failed candidate Roy Moore, making sexist attack on my colleague @SenGillibrand, &amp; rolling back net neutrality, President should try new strategy for one day: Do no harm. That means coming out against tax bill that adds 1.5 tril in debt on backs of middle class"]["Poll shows large majorities oppose Pai’s rollback of net neutrality, including three out of four Republicans: This poll gave Americans a detailed case for and against the FCC’s net neutrality plan. The reaction among Republi… https://t.co/nn2F16XkJf"]["Congratulations Doug Jones! The people of Alabama have spoken and they've chosen to elect a man of integrity who will stand up for their state and country. I look forward to working with you in the United States Senate, @GDouglasJones! #AlabamaSenateElection"]["BREAKING: @GDouglasJones elected the next Senator from Alabama! Welcome to the Senate, Doug. #AlabamaSenateElection"]["Doug Jones just pulled ahead...barely but he did"]["Transgender Americans serving our country in the military should be thanked for their service, not attacked. This move to allow transgender Americans to continue to enlist and serve makes our country safer. https://t.co/rnzNJO7DO9"]["Administration’s attacks on the press and First Amendment have to stop. It’s more important than ever that journalists be able to do their jobs. We always need to respect freedom of the press."]["I just got off the Senate floor where I talked about the importance of renewing the Children's Health Insurance Program for the nearly 125,000 children in MN who rely on it. Inaction on this has very real consequences. Passing this would nearly erase Minnesota’s budget deficit."]["Alabamians: don’t forget to vote for @GDouglasJones today! If you need to find out where your polling location is or what ID you need to vote, visit https://t.co/xJyufC3VBK"]["To all friends who have friends who vote in Alabama: Tweet/text/call/email and tell them to vote tomorrow for Doug Jones.  Doug Jones is a good man...a former prosecutor...a man of integrity...someone who will stand up for the people of Alabama. https://t.co/ATbZp8XgMa"]["Walter Mondale has been a mentor &amp; friend. I've always been able to rely on his advice and counsel. And on my first day in the United States Senate, it was Walter Mondale who escorted me onto the Senate floor. I’ll never forget that moment &amp; I'll always value his friendship. https://t.co/94PO4NZdOK"]["This is an important piece of bipartisan legislation that could make a real difference in helping us prevent and locate those with Alzheimer's or developmental disabilities who wander off and go missing. @ChuckGrassley &amp; I are working to get it passed. https://t.co/iRgWtLFRit"]["Apprenticeship programs are one of the best investments we can make in our state workforce, our economy and our future. That’s why I’m leading a bill to allow people to take advantage of “529” education savings accounts to pay for these programs.\nhttps://t.co/AuW3H8Ag4P"]["Only a few weeks left in 2017. So much to get done:\n-Reauthorize Children's Health Insurance Program\n-Pass Dream Act\n-Fight for bipartisan tax bill that benefits middle class, not just top 1%\n-Finish budget to prevent a govt shutdown\n\nPeople are counting on us. Let’s get to work."]["This is fun: an ice castle in Stillwater, along the St. Croix! https://t.co/4uA3cUlux2"]["Spoke at Alzheimer’s Association about my bipartisan bill w/ @ChuckGrassley to help locate missing people w/ Alzheimer’s or developmental disabilities. It would help train caregivers to prevent wandering &amp; boost resources for law enforcement to help recover missing loved ones."]["We’ve lost a good man &amp; fierce ally for DREAMers: Joseph Medina, at age 103. Joe was a DREAMer himself. He served in the Army, gained citizenship &amp; inspired many to love our country w same spirit he did. Rest in peace, Joe. Let’s pass the #DreamActNow. https://t.co/a4kvYtRs9y"]["Come on @Vikings! Let's have a big 2nd half and make this win streak 9 in a row! 🏈 #MINvsCAR"]["Congrats to the 9-time champion Concordia Women’s Volleyball team! @CSPBearsVB Concordia-St. Paul wins ninth NCAA volleyball title in 11 years - A1.AM https://t.co/oswIH2Q3Cf"]["Thanks Emily.  Proud to be there with the 133rd airlift wing this afternoon @133rdAW https://t.co/1CGeaHgBnj"]["Here’s some good news from MN. With lots of hard work &amp; support from Shakopee Judge Chris Wilton, Jennifer has turned her life around. The Judge was such a mentor that he even performed the marriage ceremony for her wedding. Heartwarming story! https://t.co/fwPV7mLhCn"]["...why we never want to be too exuberant when Vikings are winning...but still... https://t.co/xMy1KYg8Lu"]["Congratulations to @GilletteChildrn for reaching this incredible milestone -- 120 years of helping kids and saving lives. https://t.co/ceNtKvq99W"]["Here’s my full statement on Sen. Al Franken's resignation: https://t.co/kdRH5FDqZc"]["Sexual harassment is unacceptable. This morning I spoke with Senator Franken and, as you know, he will be making an announcement about his future tomorrow morning.  I am confident he will make the right decision."]["A free &amp; open internet is essential to our democracy. The FCC shouldn't let fake comments sway their decision on #NetNeutrality. I joined with @SenatorHassan &amp; 25 other senators calling for a delay on a vote until we investigate these fake comments. https://t.co/EBqC2rAbD9"]["This is good news. As co-chair of the NextGen 9-1-1 Caucus in the Senate, I've been working to help state and local governments update their emergency communications systems to help people more easily reach 9-1-1 when they need help. https://t.co/8oTNCWa0VJ"]["As Minnesota gears up to host #SuperBowlLII, I'm calling on the @NFL to take action to combat ticket fraud. This is a huge event that has attracted scammers to sell fake tickets. Let's get ahead of this before it becomes a problem &amp; showcase the best the Twin Cities has to offer."]["11,000 DREAMers have already lost their DACA status. And nearly 800,000 students and workers who call the United States home could lose their DACA protection if we don’t pass the #DreamActNow. We should get this done before the end of the year!"]["Attended beautiful service today for Former MN AG Warren Spannaus.  Walter Mondale spoke about some great memories and the minister did a wonderful job of capturing Warren’s compassion and lifelong quest for justice. He also loved hymns and we sang his favorite ones..."]["Thanks for hosting me! https://t.co/9ilqWHKc1b"]["ICYMI: The @EPA made a good decision to maintain the ethanol volume requirements through 2019. But we can do more on advanced biofuels. Renewable fuels strengthen our rural economies and give consumers more options at the pump. I’ll continue to push the Administration."]["Good to see @theNASciences report calling for major action to lower drug prices, like allowing Medicare to negotiate on behalf of 41 million seniors and boosting competition. My bills would help make that a reality and lower the prices of Rx drugs. https://t.co/CI6sJuK2GE"]["Congrats to Col. Blomquist on his new job commanding the 148th air base in Duluth. We are very proud of our guardsmen and women pilots and personnel and leadership over the years.  It is a great base.  https://t.co/roMTIsYmuH"]["What a game! Our Vikings are on a roll: They’ve now won the last EIGHT games in a row! Let’s keep it going!  Can you say “Super Bowl?”"]["What a game! Our Vikings are on a roll: They’ve now won the last EIGHT games in a row! Let’s keep it going! Can you say “Super Bowl?”"]["Big game for our @Vikings as they take on the Atlanta Falcons today! Let’s keep this hot win streak going! 🏈"]["Congrats to Sophia Vuelo for becoming Minnesota’s first judge of Hmong descent!\nhttps://t.co/xbJUBqqZa9"]["What opioids do to people &amp; once again why the pharma cos who made money off the addictions they created must be held accountable and help pay for treatment: What the opioid epidemic looks like on the screen of a brain scan https://t.co/TXCLZkNXIg"]["All we wanted to do was review the tax bill over the weekend...that vote is going down so this guy can cash in! https://t.co/PBkyOZaE92"]["Breaking: On floor where senator Schumer asked to adjourn until Monday so that senators AND the American taxpayers can look at tax bill. We got it four hrs ago and it is 500 pgs w/1.4 tril in debt. Republicans are all voting no.  #RipoffWith NoDebate"]["So here is pg 257 of the bill with handwritten changes...the tax bill is so last minute that they are scribbling on the margins. The issue? These scribbles (all 500 Pgs of them) will set the American tax system for a decade. #ThisIsYourTaxBillAndYouDon’tKnowWhat’sInIt  #SpeakOut https://t.co/S0LOmhOusV"]["Outrageous-the #GOPTaxPlan is 500 pgs long, we got it 3 hours ago and vote is TONIGHT. How is that enough time to review &amp; debate legislation that will completely change our nation's tax system for a decade. One trillion in debt...they don’t want America to know what is in it."]["This is an important development in the investigation. Michael Flynn Pleads Guilty to Lying to the F.B.I.  https://t.co/RMo414mHs3"]["Companies that got people hooked should be held accountable and they should help pay for drug treatment (Sen Manchin &amp; I have bill to do that): Minnesota counties file lawsuits against opioid manufacturers https://t.co/9iYXweM963 via @startribune"]["For those who used to balance checkbooks &amp; for everyone living on a budget, think of the tax bill this way: they are only off ONE TRILLION dollars! That’s the official score. Imagine it: oh, this month I am just one tril short. Don’t pass the bill (or the buck) #ComeToTheTable"]["Not surprised but just wrong: Trump Pressed Top Republicans to End Senate Russia Inquiry  https://t.co/OAeT7RzbNL"]["President spending his time sending manic divisive tweets...House tax bill really bad. This is why the Founding Fathers set up checks &amp; balances! Time for patriotism and a few Senate Republicans to seize the moment &amp; work w/Dems on tax bill w/less debt &amp; more for people"]["And last time I checked this was one of our closest allies: Trump’s Tweets Manage a Rare Feat: Uniting Britain, in Outrage  https://t.co/sUKSbf1v4p"]["Just left the floor where I continued to make the case for going back to to the table to negotiate a tax reform bill that actually helps middle class families.  This bill adds over a trillion dollars in debt &amp; does nothing for America’s infrastructure"]["No hearings? Major debt?  That is what this is: It Started as a Tax Cut. Now It Could Change American Life.  https://t.co/eOd272IgDb"]["ALERT: Senate votes TODAY on tax plan. It's a bad deal that will blow up our nat’l debt, increase taxes on many middle-class Americans &amp; lead to millions losing healthcare. Call your senators now &amp; say we need a bipartisan bill that helps all Americans! 📞: (202) 224-3121"]["This week I joined 17 Dem Senators to tell the Republicans we want to work on reasonable bipartisan tax reform...bring down corporate rates &amp; bring $ back from overseas?  OK, But this bill goes too far, adds too much debt &amp; does too little for middle class. #ComeToTable"]["All Americans deserve safety and dignity in their senior years. The recent report on physical &amp; sexual abuse of senior citizens in MN nursing homes &amp; assisted-living facilities is extremely troubling. I'm calling for action &amp; solutions. https://t.co/gfIoJF9wDu"]["Senate Republicans say that they are increasing the Child Tax Credit -- but how much of that expansion will really help working families that need it? Answer: Not much.\nhttps://t.co/Gz8463HMh3"]["Good to know that @SenFranken @TimKaine @SenatorBaldwin &amp; others are there to ask the tough questions of HHS nominee Azar in hearing today—prescription drug prices (including insulin under his watch) are sky high today"]["Left Judiciary for Joint Economic Committee where Chair Yellen is making her last appearance before our Committee.  She has been a strong trusted steady presence at the Federal Reserve and has done good work for our economy and I have truly enjoyed working with her."]["We already know that Russia interfered with our 2016 election. In order to ensure that it doesn't happen again Congress must act. My bipartisan bill with @LindseyGrahamSC would be a good place to start. https://t.co/5E4Oo6zfxy"]["We need bipartisan fixes to our tax code, not a bill that would blow up the nat'l debt by $1.4 trillion &amp; repeal a key healthcare provision that could cause millions to lose coverage. That's why I joined @Sen_JoeManchin &amp; other colleagues in calling for a bipartisan path forward."]["If you want to bring down drug prices, you don’t put a former pharmaceutical company executive in charge of health care policy for our country. I'm voting no. https://t.co/O5edZiPVPd"]["Today we lost my lifelong friend and mentor Attorney General Warren Spannaus. Read my full statement here: https://t.co/bcHtYc6iWF"]["This is outrageous. The proposed Senate tax plan will not only hurt middle class families, it will also have direct effects on American's health care. It could cause healthcare premiums to rise and 13 million people to lose their insurance. https://t.co/TQyyQz1O51"]["Article re @PodSaveAmerica recounts my interview back in May (thanks to my daughter):  The Voices in Blue America’s Head,  https://t.co/na2WGYKDTT"]["Grinch Alert: The tax bill leaves the middle class with little in their stockings but a BIG lump of debt!"][".... if you haven’t seen the St. Croix bridge yet you should.  A special treat for Vikings fans visiting Packers fans ..it’s a tribute to an across-the-river MN/Wis team effort:  Early reviews are in — and positive — on St. Croix bridge https://t.co/8Hgx80QWNq via @startribune"]["These were innocent people at a place of worship: Attack on mosque in Egypt’s Sinai kills at least 235 in deadliest militant strike https://t.co/qpQObIJwco"]["Gobble gobble gobble and another great @Vikings win...9-2 Yes!!  🦃🦃🦃🍽🍽🍽 🏈🏈🏈 #Skol"]["Best Thanksgiving touchdown ever...but then it wasn’t.  But then  it was.  The Vikings ate all their turkey this morning and are ready to win!"]["Let's go @Vikings! First: beat the Lions; then: enjoy some turkey!!"]["Happy Thanksgiving everyone!  Started the day at 7:00 a.m. with thousands of Minnesotans at the Walk to End Hunger at the Mall of America. Our walkers have raised millions for Minnesota food shelves. That’s why I love our state. @mnhungerwalk"]["It’s called hotdish! https://t.co/iv6I3yezOw"]["I have long been a supporter of a free &amp; open internet. I oppose Chairman Pai's proposal that would rollback important #NetNeutrality protections. The current rules hold internet providers accountable to consumers while protecting innovation and competition. Let’s keep them."]["Thanks Bridget!  Glad you were part of our biggest Women’s Power Breakfast ever! https://t.co/kXrPEYD4pk"]["Thanks Sarah.  So glad the Mpls &amp; St. Paul JCCs are working together and it was good to see everyone at the event! https://t.co/CH5alPHC7Y"]["Keeping in our thoughts the 8 people found and 3 people still lost at sea -- as well as their families and the sailors who are searching for them -- following the military plane crash off the coast of Japan."]["Thanks to Summit Academy @saoic for having me over. Last year 700-plus students achieved &amp; received credentials at Summit for good paying jobs in construction trades. Enthusiastic students, employers...thanks also to Louis King &amp; @ThorCompanies https://t.co/8LJccaOfqW"]["Truly?  A year-long secret re 57 million people’s accounts? This is extraordinary. By that I mean extraordinarily bad: Uber Discloses Data Breach, Kept Secret for a Year, Affecting 57 Million Accounts via @NYTimes https://t.co/CqKSAB28SA"]["Wow!  This was the nicest thank you video card ever @Students7United (college students from 7 MN State Colleges).Loved the party...now it’s time to study for your exams! #StillAMom https://t.co/Juo8VEaw8j"]["Thanksgiving is coming and Abigail always makes the pies! Excited she'll be home this week! https://t.co/kWPcexgvg2"]["My new Facebook banner is a finalist from our \"Best Minnesota Fall Photo\" contest. Photographer Heather James says, “Orange you glad you went to the Ordway Gardens” in St. Paul? https://t.co/FLAIPCB8Gf https://t.co/TJdHuZuINt"]["Thanks Tim. I oppose Pai Plan. #NetNeutrality https://t.co/60hAI4ILJG"]["Senator Flake is right to be raising deficit concerns about proposed tax bill...much of the gain would go to the wealthiest...while the rest of America would be forced to shoulder the debt: After House Vote on Taxes, Spotlight Shifts to Undecided Senators  https://t.co/DGHrDDsPZW"]["It's too easy to set up fake Facebook pages to run fake news ads. Yet another reason we can’t rely on a patchwork of changes by individual platforms. We need to pass my #HonestAds Act w @MarkWarner &amp; @SenJohnMcCain. https://t.co/BVzUeQDDFX"]["Strong turnout last night at the Oberstar 8th District dinner in Hibbing. Jim would have enjoyed the speeches, including Rick Nolan’s!"]["Is this a great game or what?  450 yards! Winning Big time against Rams at home and finally a field goal @Vikings #Skol"]["Two playoff bound teams and the score is...tied.  great job @vikings"]["And my dad covered all these Vikings/Rams games for the paper...Who can forget the old Met Stadium True Hearts &amp; Purple Heads playoff games? Snowmobile suits, tailgating AND victories! Vikings and Rams Battled Throughout 1970s Postseasons https://t.co/w2bE75Rrbu"]["The @Vikings are back at home today to take on the Rams. Looking forward to watching the game with my dad. Let's keep this win streak going!"]["Emily Larson, cool Mayor of Duluth, is a first-rate example of women running and winning AND governing. Good to be at @VoteRunLead today https://t.co/Y8IFXkI1cz"]["Today we had the American Agri Women convention in the state! Over a million women work on the farms in the USA.... https://t.co/mtS0s8mLU1"]["So good to be @MNFarmersUnion convention today!  Thanks to Gary Wertish &amp; Thom Peterson &amp; all the #MFU2017 attendees! https://t.co/EqQhEHuSJg"]["Thanks amber!  Good to see you at the @MNFarmBureau 99th annual meeting! https://t.co/DTNYF6lcCF"]["Jessie—thanks for this great photo of the library room in the James J Hill house at the @Students7United event! I had never seen that room before... https://t.co/ivVRvQmV2g"]["What a great group of women leaders in the twin cities this week!  Thanks for having me https://t.co/uFgfUAMiNB"]["Welcome home @Twins !!  Ready for another winning season on @wccoradio : Twins radio broadcasts will move back to WCCO Radio https://t.co/3r0HUp1PR5"]["Here’s my statement on the need for an ethics investigation: https://t.co/YhDBrux4oj"]["Thnx to @Expo_2023 &amp; Mark Ritchie for all the hard work: Minnesota loses out but should be proud of World Expo bid https://t.co/mxxzGg8NNn"]["My new Facebook banner is a finalist from our \"Best Minnesota Fall Photo\" contest. Photographer Timothy Burt took this shot of a bridge over Shingle Creek in Brooklyn Park.\nhttps://t.co/c565Ey3uLw https://t.co/MATQNQcyoi"]["Great to speak at @RareAdvocates' #RareVoice Awards tonight about our work to fight for medical research funding and help discover new treatments &amp; cures. https://t.co/PHvkmSbyHq"]["Three Minnesotans on this list: Al, Keith and us!  Thanks for following and participating...even when we don’t always agree! \nhttps://t.co/Bl1NCK9ddT"]["This week @MarkWarner, @clairecmc and I – along with 12 other senators – urged the @FEC to take immediate action to make online political ads more transparent. We submitted comments to the FEC along with 150,000+ Americans who want to get foreign powers out of our elections."]["Here we go again…this latest attempt to repeal ACA would cause 13 million people to lose health insurance – and they’re  tacking it on a bill that would increase taxes on the middle class &amp; increase our national debt. Are they serious? Yes they are.  Please speak (&amp;tweet it) out"]["Worth a read...Federal tax reform, a hit on Minnesota cabin owners? That's not the half of it. https://t.co/tB9EvPfjsG via @startribune"]["@SenJohnMcCain @SenatorLeahy @ChuckGrassley Enough.\n\nWhen prices of the top best-selling drugs are skyrocketing, we cannot afford to put a former pharmaceutical executive in charge of our top health agency. https://t.co/wz6Ik4jj40"]["@SenJohnMcCain Enough. 87% of Americans want to make it easier for generic drugs to be released. Congress must support my bill w @SenatorLeahy to give generic drug manufacturers access to research &amp; my bill w @ChuckGrassley to stop payoffs to generic drug makers to keep products off the market. https://t.co/CTkFuIezq7"]["Enough. 72% of Americans support the purchase of prescription drugs – with the same dosages &amp; safety standards – imported from Canada. It’s time for Congress to act on my bill with @SenJohnMcCain to allow safe, affordable prescription drugs from Canada. https://t.co/IiImGtsdD0"]["Enough. 92% of Americans support allowing the federal government to negotiate prescription drug prices for seniors on Medicare Part D. We need to act on my bill (33 cosponsors so far!) to make it happen. https://t.co/rTZYx952TQ"]["The pharmaceutical manufacturing industry has a lot of influence in Washington. At the same time, prices for four of the nation's top 10 drugs have increased more than 100 percent. #enough"]["We’re so close!!! Bloomington gears up for World's Fair decision vote in Paris https://t.co/EoOoyclDpX via @startribune"]["This is the horror of human trafficking: Two Dozen African Girls Dead at Sea  https://t.co/vWnzIsgT1T"]["Really? ..When 4 of 10 best selling drugs’ prices have gone up 100%? Trump names drug exec as new health secretary https://t.co/bXIa59A3aH"]["This was a lot of fun &amp; right after the Vikings win! Purple army deploys as 10,000 Super Bowl volunteers rally https://t.co/Kue3g71tfn"]["Today I was on @MeetThePress discussing my recently-passed, bipartisan legislation with @ChuckGrassley​ to require mandatory sexual harassment training for senators and staff - because sexual harassment shouldn't be tolerated anywhere. \n\nWatch here: https://t.co/mWISmXfajZ https://t.co/PEcYfFcydu"]["Yet another sign that the Super Bowl is fast approaching! Today I cheered on a huge group of volunteers that will help ensure everything runs smoothly on game day! https://t.co/K188ZkEwv7"]["Yeh Vikings!  We hung in there despite Washington’s last minute surge.  Here’s to 7 and 2!"]["Looks like lots of people agree (including myself) that Dustin from #StrangerThings has good taste! https://t.co/HSoZnFBws9"]["Good luck to the @Vikings today as they take on Washington! 🏈 #MINvsWAS #SKOL"]["My new Facebook banner this week is a finalist from our \"Best Minnesota Fall Photo\" contest. Photographer Graham Williams of Northfield took this great shot of St. Olaf College. https://t.co/A9kkfk7RYJ https://t.co/NVdPkevnPG"]["Amazing event for @AbbeysHope tonight w/Taylor family.  It’s been 10 years since we passed the federal pool safety bill thanks to their advocacy.  According to the Consumer agency last year, since then not one child has died from a public pool drain malfunction.  Thanks Taylors!"]["What an incredible group of vets in Cloquet this afternoon and thanks to Cols.Polashek &amp; Safstrom, Duane Brownie of Carleton Cty Vets Services &amp; Thomas Whitebird of Fond du Lac for addressing vets issues today. https://t.co/P7EXqTH9eA"]["Happy Veteran’s Day to all our vets and their families.  Beautiful State Veteran’s Day program in Inver Grove Heights today. Thanks for your service."]["42 years ago the Edmund Fitzgerald sank in Lake Superior and all 29 members of the crew were lost. Today, we remember them."]["Great to be at Jordan High School's Veterans Day celebration today honoring and thanking our veterans for their commitment and service to our country. Thank you for inviting me! https://t.co/LIQwtmxeMz"]["Thanks to @JHSPrincipal1 Bizenor for a wonderful vets event at Jordan High School &amp; to my great vets staff member and MN National Guardsman Kurt Johnson. https://t.co/TBygZeHudR"]["Happy birthday to the Marine Corps! Thank you to all of the brave Marines who have proudly served or are serving our country. #USMC242 #SemperFi"]["Honoring our veterans at @BlaineHS's Veterans Day event today. It's wonderful to see the community come together to honor those who've given so much of themselves for this country. https://t.co/9vHHrZOGdq"]["So I woke up to a 12 degree morning in Minnesota.  I promise it won’t be this cold when we host the Super Bowl in February. 🏈🏈😎😎ok it is too early for emojis."]["Trouble in “election integrity” paradise!  Lawsuit by own member...Maybe now we will find out what they are doing.  https://t.co/D1XUgqHf8c"]["Good to stop by Meet the Press 70th birthday with our great staff members Evan Quinnell and Rosa Po.  Thanks @mitchellreports for reporting on senate passage of my bill for mandatory harassment training for all senators and staff...We got it done and we build from there.  #mtp70 https://t.co/Jnq4ezIkZr"]["@SenatorFischer, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenatorWicker, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenAngusKing, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenTedCruz, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenatorLeahy, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@RoyBlunt, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@MarkWarner, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenPatRoberts, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenatorTomUdall, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenAlexander, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenatorDurbin, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenFeinstein, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenSchumer, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenateMajLdr, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenCortezMasto, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenShelby, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@SenCapito, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["@ChuckGrassley, thank you for your leadership in passing the bill to mandate sex harassment training in the Senate."]["On my mandatory sex harassment training legislation for all senators &amp; staff that just passed Senate: Thanks to cosponsors @ChuckGrassley @SenCapito @SenShelby @SenCortezMasto @SenateMajorityL McConnell &amp; @SenSchumer &amp; all rules committee members"]["Breaking: My legislation requiring mandatory sex harassment training for all senators and staff just passed the Senate."]["Lots of fake stuff out there: fake tans, fake wrestling… But a foreign gov't influencing our elections w fake social media accounts? Not OK. https://t.co/n3mDxgMhfB"]["This is the latest setback in restoring relations with Cuba. 55 years of isolating Cuba didn’t work - we should be moving forward not backward. \nhttps://t.co/Ak2oiDX7e4"]["Good to be working w/Rules Com chair @SenShelby &amp; @SenCapito on mandatory sex harassment training for senate. Thanks also @ChuckGrassley for his leadership on this. https://t.co/3ZaSdvcg0W"]["Honored to be inducted into National Council For Adoption Hall of Fame w/ Roy Blunt, Trent Franks &amp; Karen Bass. Thanks Mary Landrieu! https://t.co/vuDF9MiQzB"]["Congrats to new Mpls Mayor Jacob Frey &amp; thanks Mayor Hodges &amp; all candidates for your service: Frey wins mayor https://t.co/S0TXdHLvPl"]["Another first last night: Andrea Jenkins, new Mpls city council member, is first transgender woman of color elected in major city!"]["Congrats to new St. Paul Mayor Melvin Carter @melvincarter3 !! Look forward to working w/you &amp; thanks also to other candidates for running!"]["Congrats to NJ’s new Gov (he was Obama’s ambassador to Germany&amp;good guy) Phil Murphy Elected Governor of New Jersey  https://t.co/o1cIMa8QhY"]["Ok this is a good story: Danica Roem is Va.’s first openly transgender elected official, unseating conservative  https://t.co/b0rZqEPHuT"]["Now that Syria says it will sign climate deal, Admin decision to pull out means US is the only country to refuse. https://t.co/49P8GcvCBb"]["Don't forget to vote today, Minnesota! There are a lot of local elections &amp; ballot initiatives today. #ElectionDay https://t.co/gjwJ8Xpahe"]["This mentions my bill to close loophole #Action : Domestic Abusers Barred From Gun Ownership, but Often Escape Law https://t.co/IkYARdCtpB"]["For years I’ve been trying to pass my bill for expanding domestic abuse &amp; stalking gun protections but NRA opposed. #Action"]["On carnage in Texas: This guy should not have been allowed to buy an assault weapon.  But he did."]["Wishing my colleague @RandPaul a speedy recovery. https://t.co/pEdjDyWJ5z"]["Horrible news out of Texas. My heart is with everyone hurt by this tragedy. We must take action to stop this senseless gun violence."]["Good news for consumers. Called for an investigation into potential Sprint/T-Mobile merger in Oct &amp; now they've called off plans to merge. https://t.co/i5gxryde3p"]["From protecting communities during natural disasters to leading international missions, Lt.-Gen. Nash has always given MN his very best. https://t.co/cBUiyq6O8h"]["I visited @AkerAgUs in Winnebago to see for myself the new cutting-edge tech they’re developing to help farmers feed &amp; fuel the world. https://t.co/fgsjpVPT2K"]["My new FB banner of a country morning is from Steve Masimore of Hackensack as part of Best MN Fall Photo contest. https://t.co/2PiGC0Becd"]["Here’s a new one: Trump admin keeps in oil giveaways but proposes tripling entrance fees to select national parks to $70..as in YOUR parks!"]["Of course, we Minnesotans have always known that Minnesota is the coolest place to visit! https://t.co/9izQhn8RFf"]["Details on why we should rejoin climate agreement: What the Climate Report Says About the Impact of Global Warming  https://t.co/eeVCoGF3Yy"]["I'm fighting to expand affordable, reliable broadband so our rural communities can have access to innovative tech. https://t.co/XaoBcTzD7b"]["No excuses for no action now: Trump admin report finding ‘no convincing alternative explanation’ for climate change https://t.co/JUPWfu84ai"]["CHIP expired over a month ago. We need to do better for the 9 million children who rely on this program for their healthcare. https://t.co/El8EWGGPNi"]["As cochair of Senate adoption caucus, I can’t support cutting adoption tax credit. Should be encouraging adoption so kids find loving home. https://t.co/PFplTIMHnx"]["My bills w @senrobportman to boost PDMPs &amp; help stop synthetic drugs coming into US would help reach these goals: https://t.co/Fod4rtU55j"]["The President says drug companies are \"getting away with murder\" on pricing, so when is he going to work w us to bring down Rx prices? https://t.co/sf2QVOvVX6"]["My bill to educate &amp; install safe/reliable carbon monoxide detectors would save lives from this silent killer: https://t.co/1UiFTismBD"]["Loved this!!!  I’m 10. And I Want Girls to Raise Their Hands. via @NYTimes https://t.co/dyYftfLNIx"]["Breaking&amp;Good News: Clovis withdraws his nomination for UDSA’s top scientist post after being linked to Russia probe https://t.co/8LTiFwkGCk"]["Today’s Opioid report specifically recommends passing my bill w/ @senrobportman @JoeManchinWV @SenAngusKing for prescription drug monitoring"]["After @nytimes report that nearly $3bil in unused cancer meds are wasted, @chuckgrassley &amp; I have a bill to reduce waste in single-use vials"]["Thanks @SenPatRoberts for working with @JerryMoran and I on broadband expansion in rural areas... https://t.co/rt1nLCk6NA"]["This is a horrible act of terror in NYC. My thoughts are with the victims &amp; their families. Thank you to first responders &amp; law enforcement. https://t.co/nNUf8wyY6c"]["Great point @pgogoi. And I assume google twitter &amp; FB have just a few more resources than your station &amp; all MN radio stations combined https://t.co/0S5Y10Eevg"]["Facebook witness said 90% of Russian ads were issue ads (issue ads must be disclosed for tv/radio but no rules for on-line) Pass #HonestAds"]["Twitter just announced more characters..weird timing given ad hearing today. No marketing move can shift attention. Pass my Honest Ads bill!"]["Did you catch the Minnesota reference in #StrangerThings this weekend? No spoilers: but that Dustin has good taste: https://t.co/MAxQKKiTEd"]["Saddened to hear of passing of @wccoradio legend, Roger Erickson. This morning, MN is singing good morning to you. https://t.co/7kE8nf3qFS"]["BLOCKED: Admin's ban on transgender service members — incl. West Point cadet from MN I tried to help get commission https://t.co/8sA1oJkNxG"]["Happy Halloween! 🎃 Looks like a cold one, but that's never stopped Minnesotans from trick-or-treating. 👻 https://t.co/vlwqlPReoJ"]["My bipartisan bill w @SenJohnThune will ensure that every home has access to heat this winter by helping governors address shortages quickly"]["Breaking...and  this is why we are having the hearing tomorrow &amp; why we must pass my bill re social media platforms  https://t.co/JaPKfbQasn"]["Congrats to Nathan Lodermeier of Saint Paul, winner of my \"Best Minnesota Fall Photo\" contest! https://t.co/svyUSoUTvP"]["Wow! More than 20,000 women have shown interest in running for office. https://t.co/ls2SwxQ39l"]["Watch my interview w @CBSThisMorning on Paul Manafort &amp; my bill to fight foreign influence in online election ads. https://t.co/afNIQknbx1"]["Thinking of victims in Somalia &amp; friends in MN’s Somali community as another bomb kills 23 last night in Mogadishu. https://t.co/iQUKH0lpMz"]["Exactly @WCCORosen !!  But it’s still another win for the @Vikings https://t.co/agiLu3VvXT"]["Today is the last day to vote in my \"Best MN Fall Photo\" contest! \"Like\" or \"Love\" your favorites here: https://t.co/yTBJyfA4xj https://t.co/CHuZZrNZgb"]["Come on @Vikings! Take on the Browns! They're playing in London today, so let's make this win streak international. #VikingsWorldwide #SKOL"]["Shouldn’t tax policy make it EASIER to save and not harder? Limit on 401(k) Savings? It’s About Paying for Tax Cuts  https://t.co/AfVmXwgP92"]["Let's go @GopherFootball! This is our year to bring Floyd home! 🏆 #SkiUMah"]["Can't wait for Super Bowl Prince tribute, but walk-in snow globe? Judging by recent weather, not sure we'll need it! https://t.co/4KTdiNefQy"]["Good piece by my colleague @SenFranken and Dave Durenberger about our bipartisan healthcare bill that helps MN. https://t.co/fIjgndAI4B"]["OK this is a good photo https://t.co/CQkdVOv9GH"]["thanks jay...honored to have my book in the same tweet as  @jmeacham book! https://t.co/jeksuxBoB6"]["Thousands of women in Detroit at the first #WomensConvention  in 40 years https://t.co/CImgZ8CQ6g"]["Thanks to Caitlin Ryan of Lindstrom MN for that great introduction at the #WomensConvntion @CRyanDC https://t.co/XCPtsYD4xr"]["My #HonestAds Act w @MarkWarner &amp; @SenJohnMcCain is necessary to \"maintain open, fair and unfettered elections\" https://t.co/ky4PIPwpf7"]["Appreciate Facebook taking significant steps, but we can’t rely on patchwork of changes by individual platforms. We need to pass #HonestAds. https://t.co/VuB9YhPZlB"]["...and here's another one from Rochester MN today! https://t.co/phcybABZPk"]["Enjoying the photos of the October MN snow! https://t.co/BZ2dMKj891"]["This week the GAO is looking into this commission, after @SenBennetCO, @CoryBooker, &amp; I advocated for transparency: https://t.co/UCUnq7R8KK"]["To all who’ve never been to MN: we usually don’t get pre-Halloween snow 😱Ready set, snow: Commuters treated to snow https://t.co/QkFYWbqBQ1"]["And it’s been an honor to serve in the Senate with heroes like you, John. https://t.co/2aFqC0pf6k"]["Yes the opioid crisis is an emergency. Now we must take action and the President must advocate for treatment funding."]["Like I told @mitchellreports, we need to get to the bottom of what happened in Cuba. But we can't take a step back. https://t.co/TPNh6mdCM8"]["This is a positive move from @twitter but no substitute for passing my bipartisan #HonestAds Act. https://t.co/uU0bE3A0Ik"]["Submissions to my \"Best MN Fall Photo\" contest are in! Vote for your favorite of the top 12 on my Facebook page:\nhttps://t.co/fybAP8XumX"]["These responses to @Fahrenthold are great! You should've listened to your friend @_cingraham, David: Don’t mess w MN! https://t.co/zldOwMeCpf"]["Another reason to pass bipartisan healthcare bill: CBO says it would shrink deficit. https://t.co/KtALdOUjb3"]["Missing Paul &amp; Sheila Wellstone today, as we remember losing them, Marcia and beloved staff 15 years ago. My full thoughts are below. https://t.co/KpsGayNewK"]["Thanks to my friend @JeffFlake for his service&amp;speech--he's right when he said our strength comes from our values&amp;we must stand up&amp;speak out https://t.co/pyj1lnObKP"]["If @twitter is serious about transparency they should support #HonestAds Act. Americans deserve to know no matter what platform they're on. https://t.co/wEF6g7fpwR"]["The bipartisan Alexander-Murray healthcare bill now has the support of a majority of the Senate. We need a vote."]["My bill to reduce rape kit backlog—SAFER Act—passed the Senate. We’re one step closer to helping bring more perpetrators to justice."]["Voting commission’s lack of transparency is concerning, even to its own members. That’s why I’m demanding answers. \nhttps://t.co/4vHqdvscJd"]["Vikings Hall of Famer &amp; ret. Justice Alan Page was great on @waitwait in Minneapolis! 2 out of 3! https://t.co/SbhKMQtrMF"]["Timberlake to play Super Bowl halftime show https://t.co/gRlsd9D54x via @startribune"]["I intro'd a resolution w @SenFranken to congratulate @minnesotalynx on their *fourth* championship. Let's make it five! #OddYearOurYear https://t.co/UC4Rx72KkY"]["Go @Vikings! Beat the Ravens and keep that first place position. #SKOL"]["Only Donald Trump would consider $1.4 billion spent on online political ads “tiny.” Big online cos should disclose ads they’re paid to run https://t.co/agyrv68zUP"]["Had a great tour of NW MN w @collinpeterson \nhttps://t.co/y9VH1G2k0c"]["Five living ex-presidents to attend Texas hurricane relief concert tonight https://t.co/aZnX6LJwE2 via @startribune"]["That was a good visit&amp;loved meeting your family @John_Burkel. People don’t always know that MN is #1 in 🦃 🦃 🦃 s!! And I mean actual turkeys https://t.co/8ew7V3urI5"]["Thnx to Sheriff, Chiefs, Cty Attny, Mayor &amp; all com leaders who turned out today in Thief River Falls to discuss solutions to opioid crisis https://t.co/QKbU2wdnhf"]["Voted in DC til late. But the 3 hrs of sleep was worth it for great day of farm mtgs w/Rep @CollinPeterson &amp; NW MN farmers!Farm bill ahead! https://t.co/OtOBGvONKr"]["And so good to visit Vertical Malt and ate some great sour dough bread! https://t.co/Bt5h974utF"]["Appreciate @mnwheat hosting the event today Erik!  A beautiful warm fall day in northwestern MN https://t.co/m1sCi4uRcV"]["Thanks Theresa!  @collinpeterson and I are ready to get the farm bill done and thanks for the update on soybeans and wheat today.... https://t.co/bRyHciAIUW"]["Good news. My bill w @JohnCornyn to help protect seniors by increasing oversight of court-appointed guardians has been signed into law."]["Over next 2 days, will be in Northwest MN to talk w local leaders, farmers &amp; businesses about improving Farm Bill &amp; boosting rural economy."]["OK, here’s a good weird spooky story! Mysterious giant bog is on the move and causing damage on Brainerd-area lake https://t.co/aHNXL4hUVz"]["We released bipartisan healthcare bill today &amp; I’ll keep working to get this done. https://t.co/WMr8pnA4PP"]["I spoke with @Morning_Joe team abt #HonestAds bill, yesterday's Sessions hearing &amp; Admin's attacks on 1st Amendment https://t.co/uuWxdf217y"]["Lots of interest in my bill with Senators Warner and McCain. It's called the Honest Ads Act! https://t.co/Se8J7rJL8M"]["Today's the day @MarkWarner, @SenJohnMcCain &amp; I intro our #HonestAds bill to protect democracy &amp; bring transparency to online political ads. https://t.co/mw5oKWCE0D"][".@MarkWarner, @SenJohnMcCain &amp; I put together #HonestAds bill to make public who bought an online political ad—the same rule as TV ads."]["Great chat w @chrislhayes about Sessions hearing &amp; my concerns w AG's answers on Russia &amp; press freedom. Don't want you to go to jail Chris! https://t.co/KA4C9Rq8bW"]["Happy to announce @SenJohnMcCain has joined our bill. Protecting our elections takes both parties. https://t.co/98hIp5Qmj0"]["Fed. judges in MD &amp; HI halted the Admin's latest travel ban—it's the 3rd travel ban blocked by federal courts. https://t.co/99h9xE3ObQ"]["It was good to hear that AG Sessions is willing to work w @MarkWarner &amp; me to strengthen disclosure requirements for online ads."]["President called investigation into Russia's meddling in our election a \"witch hunt.\" I pressed AG Sessions on his view of Mueller's work."]["At hearing Sessions says he will work with me &amp; others to protect natl security by putting in some rules of the road on paid on-line pol ads https://t.co/1bgqBCW1c3"]["At Sessions hearing. Asked about election \"integrity\" com &amp; request for private data &amp; whether staff for com charged w/child porn had access https://t.co/0v7wZUEinM"]["Thanks @mayorcoleman!  Now we need to pass the bill which would be great help to MN. Building cosponsors now w/sens Alexander, Murray. https://t.co/5iNACTWw61"]["I worked to include provision in today's ACA agreement that allows states like MN to apply for waivers and not lose their federal funding..."]["BREAKING: @SenAlexander &amp; @PattyMurray reached agreement on healthcare.This was my focus at @CNN debate.  Important changes for MN"]["breaking: Congressman withdraws bid to be Trump's drug czar  https://t.co/sjzVxSkpYn"]["This nomination must be pulled: Trump Says He’ll Consider Pulling Drug Czar Nomination https://t.co/pG9Pwcevpb"]["Saddened to hear that a MN father was killed in terrorist attack in Somalia. My heart goes out to Ahmed’s family. https://t.co/zIKLXjvYR7"]["POTUS said drug cos getting away w/murder. He should support Leahy/Grassley/Klobuchar/Lee bill to allow for more prescript drug competition"]["POTUS says drug cos getting away w/ \"murder.\" He should support @ChuckGrassley &amp; my bill to stop drug cos payments to keep drugs off market"]["POTUS says drug cos getting away w/ \"murder.\" Tomorrow he should support my bill w/ @SenJohnMcCain allowing less costly drugs from Canada"]["POTUS said drug cos getting away w/murder.  Tomorrow I'd like to see him come out for my bill to allow seniors to negotiate drug prices..."]["This is a good idea: Twin Cities GED campaign is worthy effort to address disparities https://t.co/q7dZRe9vwM"][".@TheAcademy did the right thing by ousting Weinstein. https://t.co/1ZouBJ3oJe"]["A quietly generous foundation that does a lot: Margaret A. Cargill Philanthropies leads in disaster work https://t.co/bMzOqiTX4c"]["🇸🇴🇸🇴Thinking of victims in Somalia &amp;friends in MN Somalian community today: Truck bombs in Somalia kill at least 189 https://t.co/0byoCrm4Ii"]["Always great to take on (and beat) the Packers. Looking forward to the game, @SenatorBaldwin &amp; @SenRonJohnson. Let's go, @vikings! #SKOL"]["There's still time to take a walk in the woods &amp; submit a photo to my “Best Minnesota Fall Photo” contest by 10/23: https://t.co/y0NPHnYe60"]["This doctor from Rochester MN should not be deported. Hopefully they will look at her file &amp; see why.... @FarrahFazal @kstp https://t.co/cosa9WQJMd"]["Joined @MNSteveSimon, @RamseySheriff, Att'y John Choi &amp; advocates to discuss my bill w @RoyBlunt to help DV survivors. Photo c/o Jack Serier https://t.co/WwXRmiRBH6"]["Thanks to @WomenVenture for 40 yrs of working with women to start businesses.  Enjoyed seeing you all yesterday. Here's to 40 years more!"]["Took this from the stage at the Governor's Pheasant Opener in Marshall! Thanks Marshall &amp; Pheasants Forever! #MNGPHO2017 https://t.co/T4McDkOWvE"]["So glad I could join @UofStThomasMN faculty, staff, &amp; students for dedication of Dougherty Family College. Great addition to MN education. https://t.co/9UL3shYVXM"]["My dad was a reporter. These attacks on the press and First Amendment have to stop. https://t.co/oWCLRpb5tr"]["Some say football’s a man's world… but @Michele_Tafoya thrives in it! Good story on MN reporter’s great work: https://t.co/D1RCAXv14p"]["Google, Facebook &amp; Twitter paid political ads are seen by millions of people. It's time the laws match that reality. https://t.co/78MbUpdbMV"]["POTUS A.M. Mean tweets completely contrary to Pence &amp; GOP pledges! Trump threatens to abandon Puerto Rico recovery https://t.co/827sUA6ly6"]["Congrats to incredible MN mom Kate Swenson &amp; her son Cooper who won @jimmyfallon’s “Everything is Mama” contest: https://t.co/fkH5yegg2Z"]["I urged DHS to ensure our election systems don’t use Kaspersky software. Here’s more proof that must happen: https://t.co/EjuEMwGcIc"]["These pictures show the ruin like words can't: Seen From Above: Entire Neighborhoods Reduced to Ash  https://t.co/0nAmaSqmVL"]["Today's #internationaldayofthegirl. Let’s strive to lift up the girls (and women!) in our communities and lives today and every day!"]["My sodsaver bill with @SenJohnThune would extend program &amp; save taxpayers $52 million over 10 yrs. https://t.co/mPXpdz8T4h"]["cool story...Somali girls make history on St. Cloud swim team https://t.co/fsGGLIF0SR"]["Kicking off “Best Minnesota Fall Photo” contest. Submit by 10/23 &amp; your picture could be my new Facebook cover photo https://t.co/pCLCVLa0L7"]["We can't step back on biofuels. @ChuckGrassley &amp; I are leading the push for a strong 2018 Renewable Fuel Standard. https://t.co/KMiOxIEaQO"]["Way to go @Vikings! I was having bad memories of end-of-game Vikings field goals (like the playoff game) but you proved me wrong! Good game."]["OK @Vikings this is it....let's see some purple pride.  Score on this drive and break the tie.  I really don't like losing to the Bears."]["Did the administration truly roll back the EPA climate change/greenhouse gas rules the same day the wildfires are raging out west? #science"]["Russian 'ecosystem of junk news' targeted the military, Oxford study found https://t.co/Jw4aWumLxO"]["Looking forward to a @vikings win tonight on @espn! #MNF #SKOL"]["There are now 32 women heading up Fortune 500 companies..in 1995 there were none. Honored to be the keynote speaker tonight! #FortuneMPW https://t.co/yeOmSxFSAV"]["WATCH: My bill w @MarkWarner to defend US elections from foreign meddling &amp; find out who buys online political ads https://t.co/1AZ2JxG2ol"]["Admin’s immigration plan is a step in the wrong direction. We need to work on bipartisan solutions, including passing DREAM Act. https://t.co/awa5xQWKc6"]["1 more reason for my bill w/ @MarkWarner to make pol on-line ad purchases public Google uncovers Russian-bought ads  https://t.co/xvQdtDYl1q"]["After urging Ethiopia to reconsider adoption ban, was great to meet w the Nortons &amp; celebrate arrival of two sons. https://t.co/qZjtxOKm2z"]["Corker (who I like a lot) \"adult day care\" line should now be the go-to response for all who get drenched by POTUS early A.M. twitter storms"]["My mom taught second grade until she was 70 &amp; her favorite unit to teach was on monarch butterflies. She would have loved this! https://t.co/fCN3tDaGyx"]["It's the perfect time for apple picking – and MN is the perfect place to do it! https://t.co/pl2p6AKRyf"]["Beautiful music tonight at the Minnesota Chinese-American Moon festival! https://t.co/DRMjRfZ6Uo"]["Read my piece published in the @washingtonpost abt Facebook political ads &amp; how to prevent Russians from buying them https://t.co/TgrSlbuvn5"]["Thnx to @ASlavitt for keeping up the daily #CHIP drum beat. There are no excuses letting it lapse. It's always had broad bipartisan support. https://t.co/v0zSZtHLFX"]["It's about more than equal pay for equal work -- women need equal opportunities in STEM to do work in the 1st place. https://t.co/0tLLDfRX7m"]["Sack cartoon: Another Minnesota Lynx title https://t.co/qrEOczdQB7"]["RT if Facebook should share the ads Russians bought during 2016 election…and listen to my @NPR interview on this! https://t.co/REAggDasMl"]["Thanks Lisa!  Good to speak this a.m. about our bill we passed last year to help those with eating disorders get treatment. https://t.co/kNFP6MVcjH"]["!!!!!  Congrats to the Lynx!  Champions again! Lynx beat L.A. in Game 5 for WNBA title https://t.co/dshyz4S9Qz"]["Questioned fmr CEO of Equifax today on their major data breach. Must get to the bottom of this and stop it from happening again."]["My heart is with the families of Minnesotan Steve Berger, who was killed in Las Vegas, &amp; MN native Philip Aurich, who was seriously wounded."]["Payroll isn't everything! The @Twins just tied it up with the Yankees in the third inning.  Good game!"]["Good luck to the @Twins when they take on Yankees tonight! Our Twins know how to win when no one thinks they can (See '87&amp;'91 WorldSeries)!"]["At Judiciary #DACA hearing. Fact: More than 97% of 800,000 dreamers (who were at avg 6 1/2yrs when arrived in U.S) are working or in school"]["My thoughts today on the horrible tragedy in Las Vegas: https://t.co/1mh84euvSQ"]["The victims of this terrible shooting, their families, &amp; the people of Las Vegas are in our prayers &amp; hearts today."]["Made this case when we passed my bill for the bridge..St. Croix bridge spawned dozens of environmental improvements https://t.co/Q2GPR09ai4"]["America’s 8-Step Program for Opioid Addiction https://t.co/xdhe8dCbKo"]["Thanks to @MNPipeTrades for a great roomful of union pipe fitter volunteers today. All there at 7 am to go out and help people in need! https://t.co/SXUOe5faOW"]["Thanks to @RHamilton542 for your support for stopping 800,000 #DACA kids from being deported &amp; for looking out for your constituents https://t.co/QkRsW9ZJ8f"]["Get well soon, Julia. I know you're a fighter. https://t.co/ddOcyPoqjM"]["Whether moving people or cargo, air travel is important to keep America moving. That's why @MSPAirport is such a critical part of our state! https://t.co/9F1MQ8PyPj"]["Announced my bill w @RoyBlunt to give survivors of violence peace of mind that their addresses are confidential as they rebuild their lives. https://t.co/xPMTQDuN4F"]["We need tax reform for all, not one that cuts Trump family's taxes by $1.1 billion, gives 50% of benefits to top 1%. How about a new plan? https://t.co/khAtElbo27"]["Expanding broadband is vital -- especially in rural areas where broadband can improve telehealth services &amp; healthcare access. https://t.co/sn1UcqpLn6"]["Was great to talk w @3M and others about importance of investing in infrastructure so it works for people today &amp; with tech of tomorrow. https://t.co/BLfhdKqxKj"]["The Rahmes did everything they could to bring their son home. I was happy to help &amp; nominate them as #AdoptionAngels https://t.co/7Jf5wL3aB8"]["!!!!!  Twins clinch AL wild card https://t.co/d9Mjxq76AT"]["Great win last night, @minnesotalynx! Another wild game! Love these #WNBAFinals. https://t.co/9brxh3z54z"]["P.R. is still largely w/o power, clean water access, food &amp; supplies. We need to help. https://t.co/edWJgAFGSg"]["Breaking: Graham/Cassidy bill pulled. Now there is an opening for bipartisan agreement to be reached to fix ACA. Let's get it done."]["ICYMI: Here's the video of my town hall/debate w/ @SenSanders, Graham &amp; Cassidy. https://t.co/nWsMYSOqe8"]["Time to bring back bipartisan talks on healthcare. Only way to get a bill that helps all Americans is by working together. https://t.co/Y2DqyTJD5K"]["Here's a good deep dive on @SenJohnMcCain's decision on Friday to come out against #GrahamCassidy: https://t.co/WemkMSo4z9"]["It'll be a tough game without Bradford, but I've got faith in our @vikings. Get well soon, Sam. Let's go Vikes! #skol"]["Happy fall! Here’s a guide of where to spot the leaves changing this weekend. 🍂\nhttps://t.co/0g0FdEwqAG"]["Introduced bill to extend education savings accounts to more vocational programs. Would help workers afford the skills training they need."]["When scams come via phone/internet, calls for help shouldn't get caught in red tape. My bill makes reporting easier. https://t.co/FLbOtI2MvB"]["Russians tried to hack into voter reg systems in 21 states -- incl. MN. I intro'd bill to protect these systems. https://t.co/GrlnxrzgCv"]["Duck hunting season starts tomorrow. Here's a good rundown of hunting dates and regulations. Good luck out there! https://t.co/uQJoYOcA96"]["There are nearly 100,000 Minnesotans of Finnish descent. No wonder President @niinisto is visiting #FinnFest! 🇺🇸🇫🇮\nhttps://t.co/y3G9BiQzcz"]["Want to see Target Field get ready for some football? See how they're prepping for the 87th Tommies-Johnnies game: https://t.co/yDfcwrvoMG"]["My thoughts are with rescuers &amp; people trapped under the debris of a Mexico City school following this week's quake: https://t.co/zQp8ZSbVaN"]["Bipartisan work to fix ACA again stymied by partisan efforts to repeal. Lincoln said \"public sentiment is everything\" Make your voices heard"]["Shana tova! To all celebrating Rosh Hashanah tonight have a happy new year!"]["Maria is a record-breaking storm that's made landfall on PR &amp; the VI. Minnesota stands w our fellow Americans as they face this threat. https://t.co/nZLTUe4mZT"]["#GrahamCassidy would mean chaos in health insurance markets, deep Medicaid cuts &amp; millions without coverage: https://t.co/toGK0iSj3T"]["I'm a big fan of College Possible! Congrats: Ex Microsoft CEO donates $20 mil to St.Paul nonprofit College Possible https://t.co/Qw8POeO5Rb"]["Much needed: New apartment complex for homeless veterans to open at Fort Snelling https://t.co/zlBv5uxtnV via @pioneerpress"]["As I said in speech, certain states hit hard by latest Trumpcare bill &amp; MN is 1 of them. Ohio Repub Gov came out against it for same reason"]["We shouldn't pass a bill to reorganize 1/6 of US economy w/o knowing the impacts #GrahamCassidy would have. Let the CBO do it's job. https://t.co/tunkfMofKQ"]["Minnesota FTW! Delano, MN artist Bob Hautman's art will appear on the annual Duck Stamp for the 3rd time! 🦆  https://t.co/HdTYNEXwLZ"]["Good news that fed govt will stop using Kaspersky Lab software. Now we must ensure state election cybersecurity software is secure."]["If #GrahamCassidy passes, would cut Medicaid and risk healthcare for thousands in MN. Need bipartisan fix instead.\nhttps://t.co/ekJEeJBK2y"]["Let's go @Vikings! Beat the Steelers and make it 2-0! #SKOL"]["Had a great time @HRC Twin Cities Dinner. It's important to protect &amp; defend rights of LGBT Americans …and celebrate progress we've made!"]["Let's go Gophers! Beat Middle Tennessee and keep that undefeated record golden! #SkiUMah"]["I'm fighting to #ProtectOurCare for those w pre-existing conditions, for MN families who rely on Medicaid, for millions who'd lose coverage. https://t.co/BEaQyyU1Wq"]["My thoughts are with the people of London, the victims, and their loved ones."]["Great story--MN helping Houston! 36 hours on road, 44 hours at stove: Cook St. Paul cooked for Houston firefighter… https://t.co/ryCT77lDUp"]["Congrats to the Lynx on playoff victory agst Mystics! Whalen goes 'vintage Lindsay' at Barn to lead Lynx to victory https://t.co/lN45qIMUu6"]["Talked this week with rare disease advocates &amp; patients about importance of research &amp; keeping patients involved in new treatment process."]["Spoke w @NCADV &amp; advocates abt preventing domestic violence/supporting survivors. It's what I did as county atty &amp; why I've fought for VAWA. https://t.co/5uIFKiqwOQ"]["My bill w @JohnCornyn to combat human trafficking has passed the Senate. We need to support survivors &amp; improve tools for law enforcement."]["Thanks to @MNFarmBureau for the visit https://t.co/fE4ftKPbNf"]["Russia attempted to interfere in '16 election. My amendment w @LindseyGrahamSC aims to protect 2018 &amp; beyond. https://t.co/u8ivOtE6Sh"]["Saddened by the death of Pete Domenici, my fmr Senate colleague. He &amp; MN's Paul Wellstone did so much for mental healthcare in the US."][".@SenWhitehouse &amp;I sent letter to so-called election integrity commission demanding answers.  Need to increase # of voters not suppress vote https://t.co/YTmzPDZ3zy"]["Thanks to Gov @TerryMcAuliffe for speaking at our rural summit. 100s here from all over country including @MNFarmersUnion &amp; @MNFarmBureau https://t.co/ummP2hA4Aw"][". @Vikings Great game &amp; strong start for Bradford! Vikings dig long ball in resounding 29-19 win over Saints https://t.co/seaE0Xpnnh win/"]["U.N. agrees to toughest-ever sanctions against North Korea https://t.co/UmT4Y2uWe6"]["#DACA renewals due October 5th!  Thanks for the correction @benwikler Renew Your DACA | USCIS https://t.co/SdbMMnhQnL"]["Irma Live Updates: Storm Pushes North, but Millions Are Without Power in Florida  https://t.co/embSrHsb6k"]["We'll keep fighting to #DefendDACA, but if your status expires before 3/5/18 you need to apply to renew by 10/15/17. https://t.co/SdbMMnhQnL"]["I am consistently amazed by the resilience of people, even in times of crisis -- especially our brave first responders. https://t.co/xMKcQVT4Ad"]["Taking this day to remember the people we lost on 9-11 and their loved ones. We'll never forget you."]["Met with @133rdAW last night as they departed to provide relief and support in the Irma response. Thanks to @SueFlemke for the photo. https://t.co/ekM0ZtFj5n"]["We don't yet know the damage Irma will do, but if you or your loved ones are in the storm's path: follow emergency orders &amp; stay safe. https://t.co/CHvO9D0ari"]["Spoke yesterday at celebration of fmr DFL State Chair Rick Stafford's life. He was a legend in politics, advocate of equality &amp; good friend"]["Thought everyone knew what booya was..until I sent out tweet..Here you go: In Minnesota, booya's more than just stew https://t.co/C10rwWvXx7"]["A sure sign of fall in MN: a corn maze in Shafer! Nothing like a good corn maze... https://t.co/8ojO2YTjXE"]["Sheet metal workers of MN know how to have a picnic: ribs, corn-on-the-cob &amp; 3 huge vats of booya!  (And that's what we ate before noon)"]["Today I met w @ArchbishopHebda, MN DREAMers and local biz &amp; ed leaders on how to #DefendDACA &amp; find a legislative path to protect DREAMers. https://t.co/5O9Rs8kpgR"]["Good bipartisan roundtable discussion yesterday on healthcare solutions w/ governors &amp; colleagues @PattyMurray &amp; @SenAlexander."]["‼️ Specialty drug prices tripled over 10-yr period says @UMNews/@AARPpolicy study. My bills would bring down prices. https://t.co/wQs0FYko6S"]["Bipartisan bill we passed yesterday will get much-needed assistance to areas affected by Harvey &amp; Irma ASAP: https://t.co/MXgLypaKbU"]["My bill with @JohnCornyn to reduce the national rape kit backlog will bring justice for rape victims."]["Good news! Minnesota ranks 1st in ACT scores among states with 100% participation &amp; 5th overall: https://t.co/XPe0StvW7e"]["As the opioid crisis worsens, we must do more to help people who suffer addiction, their families &amp; communities:\nhttps://t.co/YF5nnJhTA2"]["Good piece by fmr DHS Sec Chertoff about need to pass my amendment w @LindseyGrahamSC to secure US election data. https://t.co/OzZompmF48"]["I'm thinking of people I've met in Cuba &amp; Haiti – and the Americans in Puerto Rico &amp; the Virgin Islands – as Irma heads thru the Atlantic. https://t.co/l7Q8lG94sc"]["#DACA recipients know only one home: the United States. I strongly disagree w the admin's decision today. #DefendDACAِ #HereToStay https://t.co/ghOS4mlJOS"]["Thanks Javier for stopping by our office to #DefendDreamers. We must now past the #DreamAct. https://t.co/AuTavIebnA"]["Strongly support Durbin-Graham bill and dreamers.  Will work to pass bill. 6000 dreamers in MN alone. https://t.co/zQ0JYuOeOx"]["Last day of #MNstatefair! Been one to remember—great food &amp; people coming together from across MN. Check out our family &amp; the giant pumpkin. https://t.co/L2wUhOBoyP"]["This Labor Day it's important to remember what today is all about: the men and women who work hard every day for all of us."]["Joe came to US as a kid; became citizen to fight in WWII. We should let Dreamers serve, not deport them. https://t.co/mr05HKVbnC #DefendDACA"]["Admin will soon decide future of kids brought to US through no fault of their own, who've made this country their home. We must #DefendDACA."]["Lost DFL former party chair Rick Stafford today after long illness.Rick was a Wellstone progressive before Wellstone &amp; we will all miss him"]["Thanks to @MNFarmBureau for hosting event on Cuba and lifting Embargo.  Also thanks to @tinaflintsmith for her work! https://t.co/30rneOf8T4"]["Thanks @EllisonCampaign @keithellison for including me in your annual Labor Day weekend picnic this year!  Great crowd. https://t.co/jIZ7qWMxqW"]["I met with Alexandria FD &amp; firefighter widows about my bill to take better care of firefighters who take care of us. https://t.co/RBsDZGjHgE"]["Why we need my bill to protect elections:Russian Hacking Efforts, Wider Than Previously Known, Draw Little Scrutiny  https://t.co/Il8KqaspAK"]["Proud of MN Guard, led by Major Gen. Nash who's pictured below, sending support for TX rescue/recovery. In US, we take care of each other. https://t.co/fMQ650uOaj"]["This #MNstatefair story has it all! Skyline proposals… Pop-up weddings… Champagne on a stick! https://t.co/ds9RUwBziT"]["Good visit to @MightyAxeHops MN's biggest hop farm. Tried some great @DangerousMan7 craft beer.  Our craft beer industry employs thousands! https://t.co/E4rUdoYCZO"]["Thanks for having me on @Lynn_Ketelsen and for keeping Minnesotans informed about farm and rural issues! https://t.co/ScD8RNDjYo"]["Spoke w servicemembers &amp; veterans in Moorhead abt experiences &amp; my bills to get Nat'l Guard &amp; Reservists same benefits for same deployment."]["Nat'l praise from @NIHDirector for #UMN epidemiologist &amp; youth baseball coach @tobenfnelson who sees a crossover between those roles' goals. https://t.co/Acp0f9o1mh"]["Great to take part in the #MNstatefair's Military Appreciation Day. Congrats to the 34th Red Bull Division on their 100th anniversary."]["Studies show auto voter reg boosts democratic participation. I'm introducing a bill to make it law nationwide. https://t.co/pmUOkhHyKc"]["This is helpful...Where to Donate to Harvey Victims (and How to Avoid Scams)  https://t.co/skssdcv2be"]["Spoke w @USTravelESTO about getting more international visitors to MN &amp; the US. Tourism is vital to increasing jobs &amp; improving economy."]["Stay safe, Houston. Minnesota stands with you as you recover from this disaster. https://t.co/qlgypFQGZl"]["He was such a good guy.  Obituary: Food writer, author and humorist Al Sicherman https://t.co/BtYKBjXIDy"]["Met w/ @trushrimp leadership about plans to build new harbor in Southern MN. Will mean hundreds of new jobs &amp; big boost to MN ag!"]["My new FB banner of waterfalls is from Robert Cunningham of Burnsville as part of Best MN Summer Photo contest. https://t.co/Pv4bYihSLo"]["Spoke w/ Worthington leaders abt my bipartisan bill to boost rural call completion. For biz or emergencies, everyone needs reliable service."]["Devastating..key w/floods: following emergency orders..Water 'is swallowing us up': Catastrophic floods hit Houston https://t.co/waeG3yaQXq"]["Toured @RedAreaHospital &amp; met w staff abt major expansion. Supporting USDA funding for plan b/c rural hospitals are critical to MN."]["St. Peter just opened its new high school &amp; it was great to join students, teachers &amp; residents today. Happy kids who are ready to learn! https://t.co/OqmI8K6Fmn"]["Unprecedented. The pardon of Joe Arpaio shows disregard and contempt for due process &amp; our criminal justice system.\n\nhttps://t.co/CpNzZOJmVH"]["Keeping brave Americans out of the military who are willing to serve does not make our country safer. #ProtectTransTroops"]["Working across the aisle to make sure the next Farm Bill helps the next generation of Minnesota farmers. https://t.co/1MQCT1P0o1"]["Look forward to @mnstatefair opening  all year! Great chance to talk w Minnesotans. Here I am w Princess Kay of the Milky Way &amp; 2 finalists! https://t.co/18Wn7l8HhX"]["You've heard of photo-bombing?  Well @SenFranken radio bombed me today @wccoradio booth.  You never know who you run into @mnstatefair !!! https://t.co/q4gMOSIPQv"]["With this year's @mnstatefair just a day away, shared one of my favorite State Fair memories! What are yours? https://t.co/2g5B8in8yD"]["Exactly Noah!  Thanks for caring about people voting. If people can't vote we lose our democracy. It is a civil liberties issue!!!! https://t.co/CSAKU54zMg"]["Great fun on @TheDailyShow w/ @Trevornoah talking about voting rights, Rx drug prices &amp; more. Watch/share interview: https://t.co/hYkgs1ViJi"]["Great fun on @TheDailyShow w/ @Trevornoah talking about voting rights, Rx drug prices &amp; more. Watch/share interview: https://t.co/hYkgs1DHRK https://t.co/1xmxhgbkMH"]["Thanks for watching Iris! https://t.co/8ZesMvNIZc"]["Inspiring story of a young Minnesota boy &amp; his family who have shown incredible character in the face of adversity.  https://t.co/iqM5Budt6E"]["Joined @RepTomEmmer &amp; @Delta employees to rally for fair enforcement of Open Skies agreements--critical to keeping US airlines competitive."]["Met w MN leaders &amp; advocates about how we should keep building US/Cuba relationship &amp; ensure it helps our businesses, farmers, &amp; state. https://t.co/OfsdfUzLyH"]["Now that we're done w/the solar eclipse...Expert tips to make the most of your Minnesota State Fair adventures https://t.co/U1dhBEvSUQ"]["Catching the #SolarEclipse! Wow! https://t.co/gSnq81RGg2"]["Telemarketing fraud is a $40B industry &amp; often targets seniors. Spoke today w MN seniors &amp; advocates abt my bills to crack down on scammers."]["10 yrs since flooding in Rushford, was good to be back today celebrating the city's resilience &amp; bright days ahead."]["This 6 gen farming family is an example of MN's deep farming tradition &amp; why we're #1 in turkey production! https://t.co/uiuEikCQ3t"]["Good to be at St. Cloud State University to talk STEM. School got major grant from National Science Foundation to boost STEM education."]["Had a great time at Game Fair today talking with MN sportsmen &amp; women."]["Spoke w MN vets about my bill to expand access to prosthetics for veterans &amp; strengthen workforce. https://t.co/feq8kHqVSt"]["This week I saw the destruction at the mosque. Good to see MN stepping up to support Muslim community. Thx @MasMinnesota for the photo. https://t.co/QeULQaTA8E"]["Breaking: Trump Tells Aides He Has Decided to Remove Stephen Bannon - https://t.co/diaVflOlA6 https://t.co/cA76NDDnnB"]["3M CEO takes moral high ground while Trump equivocates https://t.co/XmzGZoCqkt"]["My thoughts are with the people of #Barcelona, the victims, and their families."]["Introduced bill w @JohnCornyn, @SenDeanHeller, &amp; @SenBennetCO to address the rape kit backlog &amp; help get victims the justice they deserve."]["breaking: FBI offers $30K reward for info in Minnesota mosque bombing https://t.co/Ljd9TT0KFW"]["Joined truckers, advocates &amp; law enforcement to discuss my bipartisan bill to fight trafficking in transpo sector. https://t.co/4iceLf9hty"]["ICYMI - My thoughts from Sunday on Charlottesville. https://t.co/GEb6nbDuRh"]["Here's a heartwarming story! 94-year-old puts in pool for neighborhood kids https://t.co/FVTwF7mnB5"]["Ruth Berg &amp; John Carlson had many friends in MN. Many mourn loss. Service held for Minnehaha Academy's Ruth Berg https://t.co/UbyFMeyV33"]["More horrific violence on UVA campus: Car plows through crowd during white nationalist protests in Va. https://t.co/sTnMBhTMBu"]["Thank you Mayor @MikeSigner for your leadership.  We stand with you, the people of Charlottesville &amp; the students of UVA against this racism https://t.co/PoZwveSOOz"]["Check out my new FB banner from \"Best Minnesota Summer Photo\" contest - photo of fireworks &amp; lightning on the 4th. \nhttps://t.co/t7gjzYte4Z"]["Last week the Senate passed my bill w @SenatorWicker to increase the role of patients in @US_FDA review of risk/benefits of new treatments."]["Happy 25th birthday to Minnesota's iconic @mallofamerica! Here's to another 25 years!"]["Introduced bill w @RoyBlunt to prevent foreign influence in elections by helping ensure online credit card donations come from US donors."]["Tons of scams target our seniors. Senate took step to help by passing my bill w @SenatorCollins to crack down on these schemes."]["Check out my new FB banner from \"Best Minnesota Summer Photo\" contest - a beautiful sunset over a lake in Waseca. https://t.co/rCV3e2uYPf"]["So glad no one injured &amp; we stand with our MN Muslim community today. Blast rocks Islamic center in Bloomington https://t.co/UJwkzKnEki"]["ICYMI: Spoke to Senate about I-35W bridge collapse &amp; need for bipartisan solutions to improve US infrastructure. https://t.co/zu1o8n8MAO"]["Was in Little Canada, MN recently. My bill w @SenJohnMcCain would lower Rx drug prices by importing safe, cheaper drugs from big Canada! https://t.co/RBfSKM766q"]["Senate passed my bill w @JohnCornyn to strengthen oversight on the guardians of American seniors."]["So much has been happening. Check out my update on what got done this week! https://t.co/DrFHPzwxIh"]["My new bill w 33 senators lets Medicare negotiate Rx drug prices &amp; use bargaining power of seniors to lower costs. https://t.co/hJWHTK11OR"]["Thanks to leaders on both sides of aisle--&amp; St. Croix River--who helped us make this beautiful new bridge possible. https://t.co/35C3kRFmk7"]["Thanks to @SenKamalaHarris on your leadership on lowering prescription drug costs and thanks for signing on to the bill. https://t.co/2szpU8MsoW"]["Thoughts and prayers are with the families and staff of Minnehaha Academy and the emergency personnel responding to the explosion &amp; fire."]["Voted to confirm new FBI director Chris Wray today.  He has the experience and integrity to lead the FBI during a difficult time."]["10 yrs after I-35W bridge collapse, Congress must take bipartisan action to keep roads/bridges/rails safe. https://t.co/sVY30xGOQR"]["Thanks @timkaine for your leadership and work on prescription drugs! https://t.co/KN0i3JUg1o"]["Already working with farmers and rural Minnesotans to make the next Farm Bill even better for our state. https://t.co/iQtSc84xhR"]["Another example of why we need to pass my bill to help states strengthen their election cybersecurity. https://t.co/VKZaqLCzua"]["Can't wait for this year's @mnstatefair. Hope to see you there! #MNStateFair https://t.co/3nCNN4ABYK"]["Proud to join WWII vets &amp; families for wreath laying ceremony for the 96th Infantry Division. They are heroes. https://t.co/C2m6fCUivR"]["Hope everyone in Olivia, MN -- \"Corn Capital of the World\" -- is enjoying the 50th celebration of Corn Capital Days. https://t.co/rxcCupwXSq"]["Visited new St Croix Crossing bridge today. I know that Aug 2 will be a great day for everyone who worked to make this project a reality."]["Let's come together on healthcare. One place to start? My 5 bills - 4 of them bipartisan - to lower Rx drug costs. https://t.co/mGTVSXD2Yp"]["Thanks to Lisa Murkowski, Susan Collins and John McCain for showing such strong leadership tonight."]["My friend John McCain just voted no and the bill is going down.  Time to work across the aisle to improve the ACA.  That's leadership."]["M"]["This is important to make it clear that we won't tolerate Russian interference in our democracy.  https://t.co/WJ6cyoOjhH"]["Talked with @maddow about the Senate healthcare bill and Attorney General Sessions. Watch and share my interview: https://t.co/utIobJqlK9"]["Glad to hear this good news. We're all pulling for Rep. Scalise.  https://t.co/I5fIPk5rG8"]["Transgender Americans serving our country in the military should be thanked for their service, not attacked!"]["This isn't over. We can still keep tens of millions of Americans from losing healthcare. Can't give up - those families are counting on us."]["MN's former Senator David Durenberger has a lot of important things to say about today's vote. https://t.co/y4Oeux2VTZ"]["This is important. I've been calling for public hearings because the people deserve to know the truth. https://t.co/hO6tce44L5"]["Last night I spoke on Senate floor about why we can't take healthcare from millions. Should work on bipartisan solutions instead."][".@SenMikeLee and I called on @US_FDA to encourage temporary importation to decrease cost of Rx drugs that have little competition."]["Americans - like these Minnesotans I met with yesterday - deserve a better deal on prescription drug costs. https://t.co/gvnk2HTDk1"]["Led Stillwater's 83rd Lumberjack Days Parade today, celebrating the new St. Croix River bridge! https://t.co/tg0s3rBs28"]["Congrats to @mnarboretum for earning this national accreditation. Only 3% of US arboretums &amp; botanical gardens have! https://t.co/sUkgGMXl7l"]["Finally! Bipartisan support House&amp;Senate:Congress Reaches Deal on Russia Sanctions, Creating Tough Choice for Trump https://t.co/rIVApCih6Z"]["Ran into @Karin_alaniz of MN! 3yrs ago she was diagnosed w/glioblastoma&amp;she's doing great! She sent her 1st tweet to you @SenJohnMcCain xox https://t.co/NYHFeF1PmM"]["Today Paul Wellstone would have turned 73. He &amp; Sheila dedicated their lives to helping our state &amp; country. They will always be missed."][".@ChuckGrassley &amp; I called on @FTC to release report on pay-for-delay Rx drug deals. Need info to tailor our efforts to lower Rx drugs costs"]["These public hearings will be essential to learning everything that happened &amp; making sure people know the truth. https://t.co/3FxwMoCOAd"]["My thoughts &amp; prayers are with my friend @SenJohnMcCain. He is a fighter &amp; we are all pulling for him."]["I don't think this is going to help w/DC heat right now, but...Hot Enough for You? Try Eating Something Even Hotter https://t.co/tnGmxd9djS"]["No evidence of widespread voter fraud, lots of evidence of foreign attempts to hack into our election infrastructure. #ShamVotingCommission"]["Congrats to two \"Best MN Summer Photo\" winners Chris Olson of Fergus Falls &amp; Jon Langan of Menahga whose photos received over 1,700 each! https://t.co/HItnGmDfVC"]["Last day to vote in my \"Best MN Summer Photo\" contest on Facebook! \"Like\" or \"Love\" your favorite before midnight. https://t.co/Wexc6cWOZz"]["Good meeting with Cuban entrepreneurs today. We need to pass my bill to lift the embargo. https://t.co/uAj5DOvKjX"]["My thoughts are w/the grieving family of Justine Damond. Family, city want answers after officer shoots 911 caller https://t.co/W4w2OBoPP6"]["Breaking: 3 Repub Sens already at no. All women! Plan C’ on Obamacare, Repeal Now and Replace Later, Has Collapsed https://t.co/JUqrJ9QMg9"]["Time to work together on bipartisan solutions - like my bills to curb skyrocketing Rx drug prices. https://t.co/fBfJBe8gO9"]["On floor w/ @SenatorShaheen @timkaine &amp; @TomCarperforDE re how we can work together on bills to improve ACA. Work w/us Republicans!"]["OK I missed this one yesterday as I was working. No, I would NOT go meet w/foreign country to get info on opponent. It is wrong&amp;against law https://t.co/PyykcRfYEo"]["Worth a read.  Intn'l tourism adds many U.S. jobs: Latest Trump proposals would actually hurt American institutions https://t.co/DLwPZuOc16"]["Time to work together! Two more Senate Republicans oppose health-care bill, leaving it without votes to pass https://t.co/m6uLkbN3cD"]["Introduced new bill w @SenJohnThune to increase awareness re human trafficking &amp; empower truckers to be eyes &amp; ears. https://t.co/ziG7AadqfK"]["Inspiring to see MN firefighters helping our neighbors in ND. They're dedicated to protecting lives everywhere. https://t.co/xplB6le6hm"]["Submissions to my \"Best MN Summer Photo\" contest are in! Over 100 amazing photos. Vote for your favorite on Facebook https://t.co/Wexc6cWOZz"]["Glad to hear my friend @SenJohnMcCain's surgery went well. He is a very strong person &amp; won't be gone for long! https://t.co/p2pqpyRlBw"]["The Tour de France is going on, but the greatest bicyclists are the Minnesotans biking to save lives this week. https://t.co/f4eGuJU8nn"]["Was good to be on the Senate floor with @SenatorShaheen and @SenatorHeitkamp talking about bipartisan solutions for healthcare. https://t.co/UalQN7tnjD"]["Two Minnesota CEOs weigh in against Senate GOP health bill https://t.co/lxJ4j5YosZ"]["!! We need a bipartisan bill that helps people! New Senate Republicans healthcare bill already in trouble | Article  https://t.co/93e0jkSccK"]["Watch my interview on @Morning_Joe today about Russia, Wray, and moving a real economic agenda forward. https://t.co/jfLycYj99w"]["Great to talk w @hazldnbettyford &amp; addiction treatment advocates at #OpioidTownHall. It will take all of us to fight this epidemic."]["This is serious. Must let investigation continue without any political interference. Have to get to bottom of this. https://t.co/nVFsQ6JPjT"]["MN is in the Top 3 best states for business! https://t.co/V6uEgMCSF6"]["Introduced legislation w @SenatorCardin, @Senator Durbin, @SenJackReed to prevent the creation of a cybersecurity unit w Russia."]["Why it matters that a huge iceberg broke off Antarctic shelf https://t.co/7GoYGJszEO via @startribune"]["Together with my colleagues, @AlisonForKY, &amp; @KristenClarkeJD, called on Admin to improve voting infrastructure, not undermine voters."]["Good to see community not just build a house for this family, but show they have a true home in Sauk Rapids. https://t.co/AcqmXW4rBq"]["Can't add much to this.  The words speak for themselves: Russian Dirt on Clinton? ‘I Love It,’ Donald Trump Jr. Said https://t.co/50go7Vywld"]["Breaking (and bad) (and the same basic bill): Senate Republicans set health care vote for next week https://t.co/ePLcifoLKZ"]["New report tonight: Trump Jr. Was Told in Email of Russian Effort to Aid Campaign, via @nytimes https://t.co/Y1crdtwKZR"]["Great story of MN farmer who's been involved in ag for over 90 yrs! Almost 100 &amp; still working to feed US families. https://t.co/H478gx5hM6"]["Went on @Morning_Joe to discuss deeply concerning news about Admin &amp; Trump campaign's interactions w Russia. https://t.co/TISBFABZZb"]["Last day to enter my “Best Minnesota Summer Photo” contest. Use link to submit your photo before midnight tonight: https://t.co/5E9WjtDb32"]["MN was just ranked as a top state for summer in the country! Hope you're enjoying it this weekend! https://t.co/2Will5QsN7"]["Russia hacked us. Now POTUS wants to join w/our hacker? Fox guarding henhouse? BEAR guarding honey? Need to guard our OWN security. https://t.co/LyMdzxirzO"]["Deal should be judged by impact to competition/consumers. Political interference is unacceptable. https://t.co/5YRpFfMRou"]["Called on 3 insulin companies to explain simultaneously skyrocketing prices. Have to bring down Rx costs. https://t.co/BubS2VC7Tg"]["Just 3 days left for my “Best Minnesota Summer Photo” contest. Use the link to submit your photo by Sunday: https://t.co/5E9WjtDb32"]["Good to see some progress on overprescribing. Need pass my bill with @robportman requiring Rx monitoring programs. https://t.co/f6FcZsUJzt"]["Honored to present Gerald Jacobsen's family w medals. He was MIA in WWII. Worked w family to identify his remains. https://t.co/JnsTsEh7Wa"][".@SenJackReed &amp; I &amp; 24 Senators called on the \"Election Integrity\" Commission to rescind its request for private voter information."]["Just because it isn't favorable doesn't make it fake. Officials won't comply w commission request for good reason. https://t.co/RzB20xAqI6"]["The American people are counting on the President to defend America's interests in meeting with Putin. https://t.co/bQpWWiNdyA"]["Do they look like brewers or what? New brew pub in Ranier: Loony's Pub.  Good beer to go with the beards https://t.co/BFeq6udgxZ"]["Photo I took today from the deck in Ranier MN where I met with young business leaders from IFalls &amp; Ranier. Visit! https://t.co/Z3Vn5Dtp4e"]["...Need stronger biodiesel provisions in final RFS rule..."]["Administration's proposed Renewable Fuel Std rule is a good start; like to see stronger for advanced biofuels. Will push for improvements."]["In Baudette meeting on tourism &amp; jobs w/Lake of the Woods leaders. Worked w/ Collin Peterson to bring new technology to border w/Canada"]["Thnx @BemidjiRita for being a great Mayor. Here we are w/ Paul Bunyan &amp; Babe the Blue Ox right before the fireworks! https://t.co/ir5Xwo9xkE"]["Great to be at @CanalParkBrew this week w @LarsonForDuluth re importance of craft brewers - more than 100 in MN. https://t.co/9jbQYPmLlW"]["Always good to run into Wonder Woman at a parade! https://t.co/HsZvEDvUfl"]["Good Independence Day reminder for all!  Can you name the five freedoms of the First Amendment? https://t.co/HxkGi2Yyjz"]["John, Abigail &amp; I did parades in Aurora, Gilbert, Eveleth, Tower &amp; Ely. W/famous Ely synchronized lawn chair brigade: https://t.co/nPYjOJ2mfb"]["Happy Fourth of July from our family to yours! https://t.co/Jd8DWy8ycW"]["Let's remember what unites us on 4th of July!  Happy 4th!!  US senator: Our declaration should be to respect one ... https://t.co/QCt3TC9kUk"]["When they ask for private voter info, time to tell the \"Election Integrity\" Commission to GO JUMP IN A LAKE! Pls RT. https://t.co/uDkaUOxuCq"]["https://t.co/bAPMBuC0LM (LeadingAgeMN: Thanks for standing up for seniors, @amyklobuchar)"]["Requesting this sensitive info is outrageous. Need to protect Americans' security and privacy and the right to vote. https://t.co/p7NBiZhm3a"]["Wrote this for @NYTMag's annotated Constitution (in print only). All of us need to respect freedom of the press. https://t.co/VE9NRP53Qo"]["Joined thousands celebrating the 57th anniversary of Somalia's independence with MN's proud Somali community. https://t.co/JFIoxzsMv9"]["Wishing our northern neighbor a happy #CanadaDay! Congratulations on 150 years. #Canada150 @CanEmbUSA"]["Happy Wedding to Jimmy and Kayla (once our neighbor, babysitter &amp; press secretary...but today the happy bride!) https://t.co/yPsjkq6WrQ"]["Today I joined @SenatorBaldwin to meet with WI and MN citizens who want to see lower Rx drug prices. Pass our bill! https://t.co/hpFseSEd6Z"]["Thnx @SenatorBaldwin for work on Rx drugs and for joining me to discuss how  to lower drug costs including allowing seniors to neg. prices https://t.co/Bbo1hliKMa"]["My bipartisan bill w @JohnCornyn to fight human trafficking &amp; support victims passed through @senjudiciary. Next step is full Senate vote."]["Kicking off “Best Minnesota Summer Photo” contest. Submit by July 9th &amp; yours could be my new Facebook cover photo: https://t.co/5E9WjtDb32 https://t.co/M9spdjQHvX"]["Led group of Senators in calling on Admin's \"Voter Fraud\" Commission to release info so we can ensure it is transparent &amp; complies w law."]["Introduced bill to help states get info/resources to strengthen election cybersecurity. Must do all we can to protect future elections."]["Congrats on the new show @NicolleDWallace! https://t.co/NHcZQMi6Vg"]["1/6 of the U.S. economy (health care) is up in the air &amp; the president is focused on this?  Each tweet squanders American leadership. https://t.co/fj6gmfT9XP"]["Spoke on Senate floor yesterday to call for bipartisanship on healthcare. Now's the time to come together to protect/improve care for all."]["Led bipartisan group of senators in urging @US_FDA to lay out how it can help lower-cost generic prescription drugs get to market."]["We need to support our allies/partners &amp; strengthen cybersecurity here at home, including election infrastructure. https://t.co/Xnl1CGuwpV"]["Breaking: Votes not there for GOP bill; Delayed 'til after July 4.  Need to work TOGETHER to improve health care. https://t.co/6Q5YbcVKbk"]["Joined colleagues speaking out against healthcare bill cuts to funding needed to fight opioid epidemic. Threatens our bipartisan progress."]["Introduced bill w @SenPatRoberts &amp; @SenatorTester that would fix tax code to help farmers replace old equipment. https://t.co/CwOxK3lzmi"]["!!! Susan Collins Confirms She Will Vote To Block GOP Health Care Bill – Talking Points Memo https://t.co/GGZXkwLzwG"]["Just took to Senate floor to speak out against this. Outrageous. https://t.co/j8F9QJQiBe"]["Devastating Medicaid cuts in GOP healthcare bill will hurt our rural communities &amp; risk our kids' health. https://t.co/q3BRdAk31e"]["Good news: I've been pushing for months &amp; Admin will resume program letting doctors stay in US if they work in underserved areas, like rural"]["Been 4 yrs since Supreme Court undermined the Voting Rights Act. Sign &amp; stand w me for restoring this vital law. https://t.co/4m7ClvGE3H"]["breaking: Supreme Court to take case on baker who refused to sell wedding cake to gay couple https://t.co/uK7FYtYfcy"]["Great time speaking at the Scandinavian Summer Fest today. Scandinavian heritage runs deep in MN &amp; this community knows how to celebrate!"]["This is why AARP opposes the bill.....Medicaid cuts in GOP health bill could take toll on Minn. seniors https://t.co/43y6I2GVJU"]["Discussed priorities for rural hospitals &amp; importance of improving healthcare policy with @NFLDHospClinics staff."]["Honor to speak in Faribault &amp; help dedicate local air field to Betty \"Liz\" Strohfus, an inspirational Women Airforce Service Pilot (WASP). https://t.co/4qF7etuSbt"]["Share this post if you agree: We should work together to improve our healthcare system, not move forward w/ a bill that makes things worse. https://t.co/eb2cGhSHCr"]["Another great small business in beautiful Houston, MN.  Visit Elizabeth &amp; friends at Barista's coffee shop next time you're in the area!"]["!!!!  5 GOP senators now opposing health care bill, enough to sink it https://t.co/vO0Hx0qTBq"]["It's easy to see why MN healthcare leaders are concerned about the Senate Republican bill. https://t.co/lMzBxb0y6r"]["Called on Ethiopia to reopen int'l adoptions. Like many US families, Nortons want to give these kids a loving home. https://t.co/Dbvx6IRY0I"]["After @SenatorRounds &amp; I led call for VA to follow the law, it's now agreed to reimburse vets for emergency care. https://t.co/xlUgo6aJ9g"]["Been 4 yrs this month since Supreme Court undermined Voting Rights Act. Congress must reauthorize this essential law. #RestoreTheVOTE"]["On floor on repub health care bill...No hearings, no input...they didn't just close the door to dem senators...they did it to all Americans"]["Ahead of Admin action on Rx drugs, want to make this clear: Best way to lower costs is to increase competition.  https://t.co/FDjxWYvg19"]["Had fun announcing the Congressional Women's Softball Game w @mitchellreports &amp; @DanaBashCNN. #BeatCancer #CWSG https://t.co/X7307KEeYl"]["Called on Rules Committee Chair Shelby to hold hearings on hacking attempts on state voting infrastructure. Must get to bottom of this."]["Human trafficking is a real problem - even in MN - and raising awareness among travelers is essential part of fight. https://t.co/m6SqikwUGA"]["My bill w @SenatorLeahy &amp; @SenatorDurbin would modernize voter registration across the country. https://t.co/EIiEtDW5Wn"]["Just finished speaking on Senate floor about healthcare. No hearings. No debates. No bipartisan amendments. No way. #ShowUsTheBill"]["On the floor with my colleagues asking why the health care bill is being drafted in secret...Americans deserve to know"]["Spoke w @ReliableSources on ensuring press at Capitol can keep doing their jobs. More important than ever. https://t.co/R9aqVCeWOu"]["Thnx Susan Collins for visiting MN &amp; great speech @womenwinning &amp; thnx for visiting Dunwoody w/me @SenatorCollins https://t.co/zKjqcrTUXS"]["Thanks to Chris Wallace for having me on @FoxNewsSunday. https://t.co/apkHDKMNEI"]["Happy Father's Day to my husband John.  Proud dad at Abigail's graduation a few weeks ago! https://t.co/Nw6DtrwgZ4"]["Was happy to offer a replacement for this stolen flag. Even happier that the original was returned safe and sound. https://t.co/64DXiOzow2"]["Happy Father's Day! Here's my dad when he was in the service in the 1950s. Thanks dad for always reminding me that service matters. https://t.co/wDXUo7ICIW"]["Doctors 'encouraged' by Scalise's improvement - https://t.co/IyBHwrGvCz https://t.co/iyjcS5HZ1N"]["My statement on today's jury verdict: https://t.co/x9OhXugBfZ"][".@BettyMcCollum04 and I at the #CongressionalBaseballGame https://t.co/IokHrMnThi"]["https://t.co/udhd7Fip0i"]["With @SenGillibrand &amp; @RepCheri @ #CongressionalBaseballGame"]["Standing O for Steve Scalise at the game https://t.co/zDrXXoWfBF"]["Spoke yesterday w U.S. Global Leadership Coalition (@USGLC) about importance of maintaining America's strong leadership around the world."]["Great news!  Minneapolis one of 3 finalists to host World's Fair in 2023 https://t.co/gc1iGhMSCV"]["As ranking member on Rules Committee got briefed by Capitol police on shooting. The police officers did their jobs and saved many lives."]["Prayers for Rep. Scalise, aides, law enforcement, and all those who were hurt. No words to describe how terrible this is."]["New sanctions agreed to by Ds &amp; Rs are important step in holding Russia accountable for interfering w our election. https://t.co/bm5hQmAyxI"]["...This is why I'm so concerned about future elections:Russians hacked election software, databases in 39 states https://t.co/2dKjyhGdKK"]["This is no time for limiting press access in U.S. Senate.  Russia hearings, Sessions testifying &amp; (secret?) health care bill being drafted!"]["Just spoke with Senator Shelby.  He said he wouldn't move forward on change to press access without consulting me and we must hold him to it"]["As ranking member of the Senate Rules Committee I call on the majority to allow reporting in the Capitol to proceed as usual."]["And all Mueller's done is hire people.....Trump allies, friends turn on special counsel Robert Mueller https://t.co/aEtc1CjtFz"]["Russia interfered with our election - and there must be consequences. We shouldn't give back the compounds. https://t.co/Jaslqn6LTU"]["Led group of senators calling on Admin to continue relations w Cuba. It's good for US businesses/farmers &amp; most Americans support it."]["Spoke at Walker Sculpture Garden opening about celebrating present &amp; respecting history. Read remarks here: https://t.co/Ir1wff8IrY"]["Today and every day, we remember the 49 victims of the Pulse nightclub shooting. https://t.co/pudNQ7vxVK"]["That is quite a photo.  Thanks DeeDee! https://t.co/Odtj3J63zo"]["'Nasty' storm hits Twin Cities, still 70,000 without power https://t.co/v7HCf83iSx"]["Annual Minnesota Wildfire Academy trains hundreds of students from 9 states to fight wildfires &amp; protect our region. https://t.co/3vYHPIx1WO"]["Spoke w MN advocates &amp; families at @justice5krun's #StoptheTrafficking 5K, which helps raise awareness on fight against human trafficking. https://t.co/QY9CJZN9d5"]["It's National Get Outdoors Day! Celebrate by enjoying some of MN's great state parks w free admission today! https://t.co/XO99n9azsk"]["Great to be at CTECH in Rochester. Educators &amp; biz leaders doing great work, helping 1600 students (in just 1st yr!) find career paths. https://t.co/56TaIHEeVi"]["Thanks @tribelaw...this week we learned that Russians tried to hack into U.S. election software contractors. We must protect our democracy https://t.co/gitguXrsBv"]["Joined Commissioner Zelle to see progress on Hwy 61 &amp; soon to be replaced Eisenhower Bridge. Critical upgrades, good for economy &amp; safety."]["Cancer is firefighters' lead cause of line-of-duty deaths. My bipartisan bill would expand research/minimize risks. https://t.co/0A578rlXUi"]["Welcome home to these brave members of the Minnesota National Guard. https://t.co/TNvuVly26j"]["My office is holding meetings across MN this week to talk about workforce development &amp; boosting the economy. https://t.co/sQqrPea6Lz"]["Introduced new bill w @JohnCornyn to fight human trafficking by getting law enforcement the right tools and victims the support they need."]["Big day w Comey testifying. What we already know is deeply concerning. Watch my interview w @BWilliams: https://t.co/JpwdaOEcsv"]["Spoke w MN @TransAlliance on importance of investing in infrastructure &amp; building modern transportation system in MN &amp; across our country."]["Led call w @LindseyGrahamSC, @SenGillibrand &amp; @ChrisVanHollen to keep MD &amp; NY diplomatic compounds from Russia. Must stand up to aggression."]["Comey's testimony for tomorrow has been released. Very serious stuff. Must read: https://t.co/6z13ubwDFt"]["Called for Rules Committee classified briefing on any attempts to breach U.S. voting systems. https://t.co/tTJvPx1amC"]["Spoke to National Network to End Domestic Violence (@nnedv) on need to keep up bipartisan work to stop this violence &amp; support victims."]["Great to be there to talk about how we can prepare workers for the 21st cen economy &amp; strengthen rural communities.\nhttps://t.co/QtlWcuBR8d"]["Thanks @SenDuckworth for joining Humphrey-Mondale Dinner. Tammy knows what it means to resist, insist &amp; persist! Photo Credit: @PhyllisKahn https://t.co/sZ3NgDM0sj"]["Must protect our democracy from foreign hackers &amp; invest in strengthening our election infrastructure. Cannot wait. https://t.co/SaUt8Mc7Y3"]["China \"capitalizing on leadership vacuum\"(aka Trump era): China Looks to Capitalize on Clean Energy as U.S. Retreats https://t.co/MN0Mv26JEJ"]["These @CarletonCollege students are continuing the tradition of strong MN small businesses. https://t.co/ZtF1na9UC0"]["MN local communities, businesses are working to combat climate change, boost clean energy &amp; create jobs. https://t.co/y7VpcfmJKP"]["\"Isolating Cuba has become increasingly indefensible,\" says @nytimes ed board. They're right. https://t.co/tseCBhDAYN"]["We stand with the people of London. My heart goes out to the victims and their families. https://t.co/ZvyWqjXxqB"]["Led group of senators calling on @FEC to investigate potential influential role of foreign money in our elections. Our democracy is at risk."]["Who's ready to try out new section of trail in Burnsville? Just another way to enjoy great outdoors in our state. https://t.co/jjhLscM8Dc"]["Happy to say my bill w @JohnCornyn to help veterans get good jobs w local police departments was signed into law this week."]["Thanks Jill!  Lots of Wayzata graduates 🎓 and friends and family there tonight! https://t.co/vPkTfyjrjL"]["Was great to get back to Wayzata High School - where I graduated from - to speak w the Class of 2017. Such an impressive group of students!"][".@SenThomTillis &amp; I led call for Admin to fund research into burn pit exposure. Our vets deserve the best. https://t.co/pBzZUHOS7n"]["Impressive story of a MN student w great character. Kaylee of Marshall High School is an example for all athletes. https://t.co/eSwo1Fuli6"]["Great Lakes Restoration Initiative helps keep MN waterways clean. Will work w colleagues to make sure it's funded. https://t.co/I1YnqRoOp5"]["As parents in MN National Guard help keep US safe, my bill w @SenatorCollins would help schools support their kids. https://t.co/jB7E6dYkH4"]["US will be 1 of 3 countries not in #ParisAgreement. Not good for our economy, security, environment. Big step backwards."]["Opening trade relations w Cuba strengthens US businesses, increases exports &amp; helps Cuban people. Shouldn't go back. https://t.co/KuQpH1oi6P"]["Russia interfered with our election. There are consequences for that. And we need to stick with them. https://t.co/vZp7gKq3QR"]["We'd join Syria&amp;Nicaragua! Really!? If US left climate agreement, we'd be 1of 3 countries in world not participating https://t.co/jAoOS0oq2u"]["175 nations agreed to combat climate change through historic agreement. Backing out is opposite of US leadership. https://t.co/zJWcKlUZDX"]["Remember: Distracted driving is dangerous driving. Stay focused on the road so everyone can stay safe this summer. https://t.co/2HK0ScnOI4"]["Administration's deep cuts would undermine work to protect our Great Lakes, including St. Louis River cleanup. https://t.co/aAWgyhfTgl"]["Joined @USRepRickNolan &amp; Cliffs employees to celebrate new Mustang pellet. Innovative new product means good jobs for Range miners. https://t.co/KazCfYMzyC"]["Thanks @learnerlisa1 That was a beautiful Memorial Day ceremony today in Chanhassen.... https://t.co/MC6m1TFjvt"]["Here's my Memorial Day op-ed on how we honor our fallen heroes by fighting for those still with us. https://t.co/h3f4fvzHaJ"]["Good to be w veterans in Litchfield, Buffalo, &amp; Chanhassen discussing solemn duty to support all who served in our armed forces."]["\"Heroes\" is exactly the right word. https://t.co/ytY18Z8fWZ"]["Grateful to join leaders from across MN for Memorial Day Ceremony at Ft. Snelling, honoring our heroes who made the ultimate sacrifice. https://t.co/ZyB7Q5ZMB0"]["Was an honor to speak w @StOlaf Class of 2017. Know our future's in good hands w these grads. https://t.co/C61gswfzWX"]["Led bipartisan group calling for swift implementation of historic eating disorder provisions to help ensure access to treatment/save lives."]["Minnesota nonprofit doing right by our veterans, honoring their sacrifice at Fort Snelling. https://t.co/gUneUIWea2"]["Have worked w state &amp; local gov leaders on replacing Eisenhower Bridge for years--major project will mean safer travel &amp; boost to economy. https://t.co/sVigxrjXdn"]["Wishing Muslims in MN &amp; around the country a month blessed with time for family and reflection. Ramadan Mubarak."]["For 75 yrs, remains of Iverson, killed at Pearl Harbor, were unidentified. Today he gets hero's burial he deserves. https://t.co/Z2fkXHOEG8"]["Introduced bill w @lisamurkowski &amp; @SenFranken to let Hmong allies - who fought alongside Americans - be buried in nat'l cemeteries."]["Sex trafficking is happening in the US. Need to keep officers cracking down on criminals &amp; getting victims support. https://t.co/w5kbV8sqHD"]["In 10 yrs since we passed safety bill in Abby Taylor's honor, no kids have died in public pool from entrapment.  \nhttps://t.co/jXiUquXhl7"]["Very good.  Thanks @justamykoch ! https://t.co/qiaCYjeuOs"]["Trust for Public Land (@tpl_org) ranked Twin Cities as having best parks in US - for 2nd straight year! #ParkScore https://t.co/6ksN3Maebv"]["Introduced bill w @SteveDaines, @SenBillNelson &amp; others to stop online booking scams that add hidden fees or make fake reservations."]["After 4 yrs of work &amp; donations from over 100 groups &amp; individuals, great to see such a worthy cause reach its goal. https://t.co/FMcSYKbNqX"]["23 million more uninsured over 10 yrs &amp; price hikes for those w preexisting conditions. That's unacceptable. https://t.co/xAFZq8vx6I"]["Introduced bill w @MarkWarner, @RoyBlunt, &amp; others to improve US infrastructure, boost our economy, &amp; help create millions of jobs."]["Learning that it's possible Russia used Facebook ads to interfere w our election. I'm urging @FEC to investigate. https://t.co/BHHMERNqv9"]["Thnx  @peterbakernyt, but as the only Slovenian-American senator, pls note: it's spelled potica! I serve it thurs mornings in DC! Stop by! https://t.co/pcGGLSI5pF"]["MN is top Midwestern state in clean energy - Top 10 in the country! https://t.co/6T5tNBX16P"]["#UMN has history as leader in health. Since the first transplant over 50 yrs ago, thousands have been saved. https://t.co/ciiXhDJ8HM"]["Trump Administration's new budget would hit the Heartland hard. Share this graphic with your friends &amp; family to show we won't stand for it! https://t.co/Ie91t24a9k"]["Our daughter Abigail graduated from college today. So proud of her! https://t.co/mbG170MaVy"]["My bipartisan bill w @SenatorCollins to strengthen apprenticeship programs would help bridge the #skillsgap https://t.co/IG2SIL0GER"]["Happy birthday to my friend, @SenFranken! Hope you have a great day!"]["Must make it harder to bring these drugs into our country &amp; easier to prosecute those who distribute them. https://t.co/pwb0H44arc"]["Congrats on your big win, @GopherSoftball. Good luck today! https://t.co/8yo7IxO4vT"]["My bill w @JohnCornyn to help vets get good jobs as law enforcement officers will be signed into law."]["Small businesses are the backbone of our country, and these crafty business leaders help boost Duluth's economy. https://t.co/OliWd4rJDi"]["They are the same thing.  It is called a special counsel under the law but a lot of people refer to the job as a special prosecutor. https://t.co/YuIEexAos8"]["Introduced bill w @ChuckGrassley &amp; @SenCoryGardner to strengthen support of rural hospitals that millions depend on. https://t.co/OAas98oxGd"]["Violence against peaceful protesters in U.S. violates constitutional rights. Admin must raise w Turkish government. https://t.co/LRr8bTzoV4"]["As I told @Lawrence, appt of Mueller brought back the rule of law. Still need ind commission to set rules of road. https://t.co/fiypgQKIqy"]["This is a truth hunt. https://t.co/elItfIPkam"]["I see that @MPRnews @CathyWurzer is up listening to my @NPR @MorningEdition interview at 5 am central..but then she's always up this early! https://t.co/VdqvJXAMcF"]["Reminder: Rosenstein can define scope of special prosecutor work. I asked him about this at his confirmation hearing https://t.co/ZLRjOfYtoN"]["BREAKING: Justice Dept. to appoint special prosecutor. https://t.co/agRlJ8n62Y"]["Spoke to state/local officials from across US about importance of bipartisan efforts to strengthen infrastructure. Critical for our economy."]["Agree w @preetbharara - Need to restore faith in the rule of law. Independent commission &amp; special prosecutor now. https://t.co/Q8NIp8zieo"]["My friend @maziehirono is a fighter and - as always - we stand with her. https://t.co/emDnjQoio7"]["As I have said before: Congress has subpoena power. Time to use it. https://t.co/I4cm8kYP5p"]["Congrats, Esther. MN is lucky to have you &amp; I'm honored to call you a fellow Wayzata HS grad. https://t.co/SNJWlS6w8v"]["Great to be at #CAPIdeas talking about everything from how we can support rural America to how we can take on Russian interference."]["Sharing highly classified info with Russian officials empowers Russia. Watch interview w @donlemon: https://t.co/zaGHicPz9n"]["This should not have happened. https://t.co/6qsWMoKPXc"]["Agree: If there are tapes, WH should hand them over. Need all the facts. https://t.co/420Uwff9kl"]["Cheers to you @StarTribune! https://t.co/2yW58AAyx2"]["Thank you for everything you do to help families affected by mental illnesses. https://t.co/rJXUMUnwQ7"]["Congrats to Plymouth's Miranda &amp; Excelsior's Ariana on recognition for service work helping young cancer patients. https://t.co/OvMxVXnUYy"]["Happy Mother's Day! Abigail took over my Facebook page today... https://t.co/gknWKzS61N https://t.co/eqv4lLbIfd"]["Good to join @PACERCenter annual benefit. Their work improves lives for parents &amp; kids w disabilities. Proud to have served on their board!"]["Spoke w @HHHSchool grads today. Their optimism &amp; commitment to public service is inspiring."][".@Macalester is a world-class school. Has prepared students to lead for 140 yrs. I know today's grads will follow suit &amp; make all MN proud!"]["Good to be on @Maddow. It all comes down to the rule of law. https://t.co/EL3qLWOjo1"]["St. Cloud really made a splash their first time hosting the Fishing Opener. Thanks to all the MN anglers who joined! https://t.co/JGPTAFwWiP"]["Great time at @UMN food, ag, nat resource commencement. Today's grads are tmw's farmers, nutritionists &amp; ag experts who'll help feed world. https://t.co/0fzxREHX5V"]["Congrats to newest members of @StPaulFireDept! Was an honor to join you for today’s graduation ceremony. Thanks for all you do &amp; will do."]["Good mtg w @Target employees. MN staple that stands on 55 years of biz success &amp; doing right by communities."]["No evidence of widespread voter fraud in last election. Should be helping more eligible Americans vote, not fewer. https://t.co/ExxysmXF8j"]["The Comey firing reminds us of a bigger danger https://t.co/lHyYiLdnRO"]["I'd say this is surreal but it's so real. Need special prosecutor &amp; independent commission now.\nhttps://t.co/cZKH8744Wx"]["With 7 other senators, called on fed agencies to investigate potential RFS-related insider trading by WH adviser. https://t.co/du1IlHgdGF"]["!!! Trump Bars U.S. Press, but Not Russia’s, at Meeting With Russian Officials,  https://t.co/TnGKa0fWnb"]["To be clear, this isn't going to happen. I RTed bc it's a good idea for Rs to think about consensus FBI candidates. https://t.co/K9NBWXcAfz"]["The govt declared Adam dead for 29 years. (He's alive.) That's absurd so we helped him fix it. https://t.co/a4B7Q4SDcJ"]["Good idea @SenMikeLee. Former prosecutor Merrick Garland for FBI Director is great idea. Need special prosecutor too\nhttps://t.co/HjMdwIGxAq"]["Breaking:While Comey's firing meant he couldn't testify as planned tomorrow, Burr &amp;Warner have invited him to testify as a citizen next week"]["Comey was to appear tomorrow before senate intel committee. Russia would have been discussed. Instead he was fired. Need special prosecutor"]["Really? Firing Jim Comey smack in the middle of a major Russia investigation is very suspect. We need independent prosecutor &amp; commission"]["18 days was too long to keep Flynn on payroll. Watch this clip of my interview on @CNNtonight: https://t.co/V3gy3YLln1"]["It's #NationalTeachersDay! Special shout out to Corey Bulman, MN Teacher of the Year. Thanks to all teachers for guiding our future leaders."]["Admin ignored fmr Acting AG Yates' formal warnings on Flynn's Russia ties. Need independent commission. https://t.co/t9OI1DTAtI"]["From my qs: Clapper agrees with Comey last week that Russia is now emboldened and will do this again if we don't protect our democracy"]["More info from my qs: Acting AG Yates at White House hour before refugee order issued &amp; no one told her it was coming."]["What I learned from my Qs:Is it material for blackmail when official is caught on tape saying 1 thing &amp; then lies to VP? Answr: yes (cont'd)"]["At hearing on Russian influence in our election w/former acting AG Yates&amp; former director clapper.  I ask questions soon. #factsmatter"]["For businesses to be competitive, need competitive workers. And 3D tech's helping recruit next gen of engineers. https://t.co/U4hI0cVbZF"]["Good news for MN. Small plane manufacturers like @Cirrus_Aircraft help our economy &amp; communities take flight. https://t.co/baiY5VUA23"]["Joined @alfranken, @peggyflanagan, &amp; Midwest tribes for #PowwowForHope. Need to keep investing in cancer research for patients &amp; families. https://t.co/xHwIjBREw4"]["Working w @RepTomEmmer, @BettyMcCollum04 &amp; rest of MN delegation to bring World's Fair expo to MN in 2023. Been 30+ years since US hosted!"]["Small biz like @twobettysgreen strengthen our economy. What's your fav MN small biz? #NationalSmallBusinessWeek https://t.co/spKoBNLFza"]["Spoke to @ConcordiaStPaul students today. Know they're ready to make good on school promise -- discover &amp; engage. https://t.co/dBhAVpYVzR"]["Crime solved. Goat back at work. Baad boys: Police recapture goat stolen from Minnesota park | MN Public Radio https://t.co/pMXoHBTL04"]["Happy Cinco de Mayo to all the parade-goers in St. Paul!"]["Early morning w @MNSUMankato grads. So many proud students -- w even prouder parents -- crossing stage to take the next step! https://t.co/W4KJzLC7RQ"]["Sad to hear MN Medal of Honor recipient Col. Leo K. Thorsness has passed. Spent yrs in Vietnam prison camp w @SenJohnMcCain. He was a hero."]["Just takes a second of distraction to become a statistic. Your text, snap, message, or tweet can wait. https://t.co/xLW3kcohvj"]["After today's Commerce hearing following United incident, I'm even more determined to improve passenger protections. Let's get to work."]["The Admin and House Republicans need to stop trying to scrap the ACA and start bringing lawmakers together to strengthen it."][".@senrobportman and I joined @jaketapper to talk about how we're working together to combat the opioid epidemic. https://t.co/C6PyNu1T2a"]["My daughter told me to go on @PodSaveAmerica. So I did. Listen here: https://t.co/M0lofoWqHd"]["Sad to hear fmr @Twins manager Sam Mele passed. Led MN Twins to 1st pennant - something our state will never forget. https://t.co/C0w0HwzLpC"]["Equality Act is an important step in stopping discrimination against LGBT Americans. https://t.co/pO6QP2fSRO"]["As the daughter of a journalist, I strongly oppose this Administration's attacks on press. #WorldPressFreedomDay https://t.co/bLr5Cs0j3M"]["Congrats to Duluth native Robb Stauber, new head coach of '18 Olympic US women’s hockey team! Let's go get the gold! https://t.co/dHW93LIthF"]["This happened: 1. Congress comes together to avert shutdown &amp; funds med research&amp;troops; 2. Trump wakes up &amp; tweets about wanting shutdown"]["Mikayla is indeed a trailblazer. https://t.co/93TzV9wyUh"]["We need to lift the trade embargo with Cuba - good for U.S. businesses/economy, good for Cuban people. https://t.co/chxiaLiGfV"]["Researchers at @MayoClinic are making MN proud through their work to revolutionize cancer screening. https://t.co/B45guC5uL9"]