["Going to be a busy day in Connecticut! Stop across the state in Enfield, Hartford, Meriden, Bridgeport and New Canaan."]["Heading to the Senate floor to talk about the upcoming budget battle next week and the Connecticut priorities I'll be fighting for. Tune in soon!"]["A wonderful piece on my friend Shawn Brimley, what he represented, and the legacy he leaves. https://t.co/F6NQgfKADa"]["In honor of #NationalMilkDay, #TBT to the time I spent a day learning the ins and outs of dairy farming. Connecticut's 150 dairy farms contribute $1 billion in annual sales and create 3,800 jobs. https://t.co/dts1tS3B2L"]["Kids in the U.S. are 70% more likely to die before adulthood than children in other developed countries. Why? One of the reasons is gun violence. https://t.co/6ywooRI0z3"]["On Friday I'll be at @gracefarms to discuss modern slavery and how we can work to end human trafficking, followed by a screening of @IAmJaneDoeFilm.  https://t.co/ufKdLGzxqG"]["We've got a bipartisan coalition working to strengthen our Buy American laws. Let's get this done. https://t.co/ZoglqCxo4p"]["What an unfathomable loss. For his beloved family. For his grateful country. And for his numerous friends, of which I counted myself. A brilliant life, indeed. https://t.co/Zb1rdJbCx9"]["The slow pace of recovery in Puerto Rico is having a ripple effect, creating a nation-wide shortage of IV bags. Yet another reason why the U.S. govt needs to step up its response. https://t.co/k0Gx9G8CQR"]["The Trump administration's attempts to sabotage the ACA aren't working in Connecticut. Enrollment through @AccessHealthCT increased in 2018, with 13,000 new customers. https://t.co/UIrUdnnGMm"]["In the face of Congressional inaction on bump stocks, Connecticut and @GovMalloyOffice are leading the way yet again. https://t.co/8FuwGVxYT3"]["Congrats to Toria Nuland on this new role - @CNASdc will benefit from her strong foreign policy experience and vision. https://t.co/szFbSQJVW4"]["I've been working on Buy American issues since I first got to Congress and I'm excited to have the Trump admin and partners like @senrobportman @LindseyGrahamSC and @SenSherrodBrown working together to get this done. https://t.co/kivHIOQVFF"]["Today we took a big step forward to strengthen our Buy American policies, introducing the https://t.co/qlBqEOXgHg Act with Democratic &amp; Republican co-sponsors. https://t.co/ZoglqCxo4p"]["I'm joining @SenMarkey and over 30 Senators to preserve the free and open internet. We will demand a vote on the #NetNeutrality CRA. https://t.co/pTaw0IOJaJ"]["#RollTideRoll https://t.co/YnhmzTckAi"]["Happy 230th Birthday Connecticut! On January 9th 1788, we became the fifth of the original 13 states to join the Union. https://t.co/XMFELWoL7O"]["We need full funding for the Children's Health Insurance Program. 17,000 kids in Connecticut can't afford to lose health care. \nhttps://t.co/M5J85thAFx"]["Seven years ago today a gunman opened fire at a grocery store, killing six and injuring 13 - including @GabbyGiffords. In the years since, Gabby has embodied courage as she leads the fight to end gun violence. https://t.co/xMXkgZ7trz"]["If the NFL doesn't care about its own players, how about the thousands of youth football players whose lives are in danger because of its horrible example? https://t.co/Vx3uRDVCXC"]["Exciting to see 195 new apartments planned in the old Hat Company/Factory Outlet Building in Norwalk. Redeveloping these spaces means more housing, more parking and better access to the train. \nhttps://t.co/4o9tx4bcop"]["The stock market is booming but most Americans aren't feeling the benefits. We need an economy that works for everyone - not just those at the very top. https://t.co/rMzXdHxsaN"]["Earlier this week, @SenBlumenthal and I spent two days in Puerto Rico hearing from folks on the ground about the ongoing hurricane recovery. I took some time to share my thoughts and a look behind the scenes.  \nhttps://t.co/8uMJ1p3xAF"]["Had a great time celebrating Three Kings Day with everyone in Hartford and Willimantic! https://t.co/TUivxEaiq2"]["How excited am I to try White Label Mountain Dew? Very. Very excited. https://t.co/m7G0HnG8CS"]["Thanks to the folks who joined us in New Haven today to talk about the recovery in Puerto Rico. We are taking your feedback back to Washington and are going to fight to help the island rebuild. https://t.co/IRUeyImyKI"]["Sat down with Connecticut homeowners, community leaders and @ctrealtors to talk about the impact the GOP tax law will have on Connecticut home values, which could fall by more than 10% as a result of the law. https://t.co/xMmBeE5eB9"]["The White House has talked a big game on opioids but no funding has followed. We need real resources to fight this epidemic. https://t.co/lh8YUygpAP"]["The pace of recovery in Puerto Rico is unacceptable. Half the island still has no power. Can you imagine having no power for 100+ days with no end in sight? I'll keep fighting tooth and nail for additional aid https://t.co/dKJ24owtV5"]["Take care of each other today - check on elderly neighbors &amp; those with disabilities. If you know someone seeking shelter there are 108 warming centers open across the state. Call @211CT for more info - https://t.co/Tgzsc6TPZb"]["Blizzard conditions for much of the state today and lots of snow for everyone. Please stay home if you can and stay safe. https://t.co/TorBMyxm61"]["New startups are taking root in Connecticut thanks to programs like @resetco_org's impact accelerator. https://t.co/QbRJzuK37h"]["Former Homeland Security chiefs under Bush and Obama agree - we need a permanent solution for Dreamers and we need it now. https://t.co/eeCsK89uE5"]["It's 6:30pm in the most densely populated neighborhood in San Juan and it's pitch dark. For the 104th day in a row. https://t.co/9CQTw6YUsg"]["Just met with FEMA and Army Corps leadership in San Juan. People are (rightly) furious here that just over 50% of island has power. https://t.co/fZHcRU23ox"]["Wheels down Puerto Rico. Here w \n@SenBlumenthal for 2 days to assess rebuild. First stop University of Puerto Rico Hospital. https://t.co/Se1hLP4phK"]["On the way to Puerto Rico with @SenBlumenthal to hear from people on the ground about the ongoing recovery efforts. It's been 100 days since Maria made landfall and huge swaths of the island are still without power."]["In just a few hours we close the books on the final fundraising quarter of this year. I'm up for re-election in 2018. Can I count on you to chip in $3 to help me win? \nhttps://t.co/uFcYIVJfEQ"]["Anyone who's ever been to a @UConnMBB game knows Big Red. He's a Husky legend. Great to see him getting recognized for his spirit at today's game. #BleedBlue  https://t.co/rTqZGYay12"]["The only place common-sense gun reforms are controversial is in Congress. Case in point - 95% of people want universal background checks. https://t.co/bOZ0GwhNq0"]["Nine million people have signed up for insurance through https://t.co/Zdw9RJfjVJ, despite Trump's attempts to sabotage the law. https://t.co/xLv1Lw6qxD"]["Merry Christmas from the Murphy family! Wishing you a holiday filled with joy, cheer and an extra large mug of hot chocolate. However you celebrate, I hope you're enjoying a day with loved ones."]["What is Donald Trump getting for Christmas? An $11 million tax cut thanks to the #GOPTaxScam https://t.co/6vhPExF3iE"]["Throwback to the time I got to meet a reindeer (and their BIG Santa) at Dzen Tree Farm in South Windsor. https://t.co/vXDTzqs0yX"]["Last night I voted against the short-term funding bill that kicks the can down the road on some major priorities for Connecticut. Here's why: https://t.co/viZHyVkJ5u"]["Today is the LAST DAY to enroll in health insurance through @AccessHealthCT. Get covered at https://t.co/0cf7WAprk8 or call 855-910-2428 to talk to an enrollment specialist. https://t.co/faq0LgIjtC"]["I usually vote yes on CRs, but I just voted no on this one. How do we go home for Christmas and leave so many Dreamers and CHIP kids out in the cold?"]["Over the course of his six deployments, Dean L. Winslow wielded weapons of war and saw what they did to the bodies of soldiers. When he said those weapons don't belong on our streets, his nomination to serve the Dept. of Defense was shut down. https://t.co/N3XCTXM3JV"]["17,000 kids in Connecticut could lose their health insurance if Congress doesn't fund CHIP. Families in our state rely on HUSKY B. We need a long-term solution to make sure that these kids get the care they need.\nhttps://t.co/u3Zo3QKSm6"]["Community health centers are a lifeline for people in Connecticut. In many areas, they're the only way for people to get care. I'm urging my colleagues to do the right thing and fund CHCs. https://t.co/lAdsxJsvgd"]["A broken background checks system allowed the Sutherland Springs shooter to get a gun and murder 26 innocent people. We have a bipartisan bill to fix it. We just need the political courage to get it done.  https://t.co/5uJpUV44W9"]["✔️Raises health care premiums\n✔️Caps state and local deductions\n✔️Lowers CT home values\n✔️Adds $1.5 trillion to the deficit\n✔️Contains oodles of giveaways for billionaires\n\nThe GOP Tax bill is bad for Connecticut. https://t.co/pv5XeU0Zro"]["The bill that just passed the Senate and House isn't tax reform - it's a giant handout for the rich and powerful. There is no shame left in Washington when the biggest piece of legislation passed by this Republican Congress is literally a windfall for their wealthy donors."]["Thanks to Geno, Connecticut and women's basketball will never be the same. Congrats on 1,000 wins. #Geno1000"]["Getting ready to go live with @maddow to talk about the GOP tax bill and why it’s a scam for Connecticut families. Tune in to watch at 9 ET on @MSNBC"]["As baby boomers age and millions of people become family caregivers, public policy needs to keep up. I proposed the Social Security Caregiver Credit Act to help make sure family caregivers have the support they need. https://t.co/4MEJwDlQlF"]["Families across the country will sit down over the holidays to talk about long-term care for their loved ones. It's a conversation that far too many of us are unprepared for. https://t.co/xvZbijf8cA"]["How we spend our money is a reflection of our priorities. Republicans are telling you loud and clear - tax cuts for billionaires are more important than our children's health. https://t.co/3WQ5XQF4kd"]["As of today, 12,641 DACA recipients have lost their status. Congress needs to pass the #DreamActNow https://t.co/9FGFplsuct"]["I'm on the Senate floor now talking about the 17,000 children in Connecticut who are at risk of losing health care if we don't fund #CHIP. Tune in to watch on C-SPAN 2"]["On the Appropriations Committee, I'm fighting for submarines, helicopters, &amp; jet engines to be made in CT. These contracts don't just create jobs at big companies - they benefit thousands of small manufacturers who employ people across CT &amp; keep us safe! https://t.co/rKrKiO2L0d"]["It's inspiring to see so many women across Connecticut getting involved and running for office for the first time. https://t.co/2iDFXuQmUx"]["The GOP tax plan gives tax breaks to millionaires, guts the Affordable Care Act and now it also makes to easier for companies to move jobs overseas.\nhttps://t.co/K3YYNr8y0g"]["Three years ago SSgt Rick Findley took his life after battling PTSD. He is loved and missed by his family and he will not be forgotten. We must make sure that every veteran is able to get the mental health care they need and deserve."]["Big social change takes time. Over the last five years, the movement to end gun violence in this country has only grown stronger. https://t.co/v2hKWSEMOx"]["On year ago @BillCassidy and I worked together to pass the largest reform of mental health laws in a generation. Last week, I urged @HHSgov to provide real resources in place to address mental health and addiction. https://t.co/lm3zFhZdEm"]["Millions in Puerto Rico are still without power. They are living in the longest and largest blackout in modern U.S. history and it is affecting every facet of their lives. https://t.co/PK2w2uA1RX"]["One of the nicest Senate traditions is our annual Secret Santa. This year I got @DanSullivan some Presidential Pez (#MadeinCT) and my friend @BillCassidy got me some holiday reading. Thanks, Bill! https://t.co/QrZrDNO7NS"]["Thousands of families in Connecticut rely on heating assistance in the winter. Despite that fact, Trump tried to cut the program entirely. I'm fighting to keep it funded so that CT families don't end up out in the cold. https://t.co/ybifT3GNz8"]["The FCC's decision to repeal #netneutrality rules opens the door for broadband providers and big businesses to call the shots instead of protecting consumers. I'm going to fight to protect the free and open internet. https://t.co/g2Ka0NySMr"]["The latest update to the #GOPTaxScam - help pay for tax cuts for millionaires by letter the meager cuts for everyone else expire sooner. https://t.co/RahWk9QQ7G"]["Today is the LAST DAY to sign up through https://t.co/Zdw9RJfjVJ. In Connecticut, you have it ONE WEEK left to enroll through @AccessHealthCT. Don't wait to get covered."]["Stopped by the @AccessHealthCT enrollment center in New Britain to hear from staff and enrollees about how the ACA has helped people in Connecticut get the care they need. https://t.co/O8uPvk8EEK"]["Joined @MayorBronin, Hartford Police &amp; local hospitals to support the gun buyback programs taking place this Saturday in Hartford &amp; New Haven. You can turn in a gun, no questions asked, in exchange for Stop &amp; Shop gift cards. More info: https://t.co/h5u5xNEeKA"]["I'm live on the air with @ChazandAJ at their annual toy drive in New Haven. Tune in to listen or stream live at https://t.co/nBCQllmVas"]["Started the day with a pancake breakfast at @StrlingHouse to hear from constituents in Stratford and collect toys for the @ChazandAJ toy drive later this morning. https://t.co/TXUhZPCH7W"]["Every child should be able to experience the joy of Christmas. Connecticut, you know what to do. https://t.co/PrqtbTUzec"]["Here's a start: universal background checks (Columbine); ban assault weapons (Newtown etc); fix NICS (Sutherland Springs); ban bump stocks (Las Vegas).\n\nI've got more. https://t.co/1X9VUPUZPP"]["I'm heading to the Senate floor to share some thoughts on the 5 year anniversary of Sandy Hook. Hope you'll take time to watch."]["Five years ago, 26 lives were extinguished in a matter of moments at Sandy Hook Elementary School. I took some time this morning to share my reflections on Sandy Hook, five years later. I hope you'll take a moment to read them today. https://t.co/UgvT4vjkww"]["5 years ago this morning, the unthinkable happened in Sandy Hook. Ask yourself today: what have I done since then, to make sure it never happens again?"]["I hope you'll take a minute today to watch Scarlett Lewis talk about her son Jesse and the work that she is doing with @JesseLewisLove on social and emotional learning. https://t.co/BIgLvKmXlr https://t.co/LCaOHVsAT3"]["Happy Birthday to the @NationalGuard! I'm grateful for all of our National Guard servicemembers in Connecticut who put their lives on the line for our safety and security. https://t.co/AeuFYxBs0d"]["Tomorrow will mark 5 years since the tragic shooting at Sandy Hook. Frankly, I'm frustrated that we haven't made more progress in fixing our nation's gun laws. But I am never going to stop trying. https://t.co/OXJ3rJrpcI"]["I reintroduced my 21st Century Buy American Act make sure that when we spend taxpayer money we're buying American-made goods. https://t.co/Ydct88tISk https://t.co/WHCM0jzyiP"]["Millions of little kids all across America saying tonight, thank you Alabama. https://t.co/3ULXBT8qOa"]["Wishing everyone celebrating in Connecticut and around the world a Happy Hanukkah!"]["Yet again, @jimmykimmel is the one calling on Congress to do the right thing. 17,000 kids in Connecticut could lose coverage if we don't renew CHIP. I'm urging my colleagues to put these kids first. https://t.co/xlwu32LpO6"]["Thank you to @SherylCrow for lending her voice to the movement to end gun violence with @sandyhook. Her new song The Dreaming Kind gives voice to the long fight to end these tragedies. https://t.co/rmC9muzb5g"]["Thousands of people in Connecticut have reached out about #NetNeutrality. I'm going to do all that I can to protect the free and open internet."]["Thousands of Connecticut commuters head into NYC each day. Grateful for the quick action of the NYPD to apprehend the suspect in yesterday's bombing and keep people safe. https://t.co/buA3tYl3y2"]["The Treasury Department's report admits what bipartisan economists have been saying all along - there's no way this tax plan pays for itself. https://t.co/nmr5GmKz4M"]["Mass shootings are not inevitable. Take a minute today to watch the latest PSA from @SandyHook Promise and #KnowTheSigns to help prevent a tragedy. https://t.co/uRZKxmSu8E"]["Thanks to everyone who came out yesterday for my town hall in Norwalk! I couldn't do this job without your feedback. https://t.co/iNCS4v2ReP"]["Not sure what kind of health care plan you need? @AccessHealthCT can help. Use their plan comparison tool and sign up before December 22nd at https://t.co/0cf7WAprk8 https://t.co/8BUdinDVUE"]["It doesn't matter if you have depression or diabetes - you should be able to see a doctor. I called on the Trump administration to enforce mental health parity laws. https://t.co/Pijxp1KXkm"]["I'm hosting a town hall on the GOP tax bill today at the Norwalk High School Auditorium. Doors open at 2:30 and we'll get started at 3:00. Hope to see you there! https://t.co/HU0GlA7IRI"]["Congrats to the Amarante family of Dayville on winning @ABC's Great Christmas Light Fight. Their display has been raising money for local charities for the last 11 years. https://t.co/pWRzMx1Lnb"]["I'm hosting a town hall on the GOP tax bill this Sunday in the Norwalk High School Auditorium at 2:30pm. Open to all - hope you can join me! https://t.co/gtViI0ok6T"]["This is what happens when you hand-write portions of the bill just hours before passage. https://t.co/gFmrlHVex2"]["Two students were shot and killed at their high school in New Mexico yesterday. When will Congress finally stand up and say, enough?"]["Every year these families come to Washington and urge Congress to honor their loved ones' memories with action. I'm not going to stop working until we do. #HonorWithAction #EndGunViolence"]["Yesterday, dozens of families, including those from Sandy Hook, traveled to DC to speak out against gun violence. https://t.co/aFjy3EBJ8X"]["When I was first elected to the Senate I lead the effort to force the Dept. of Defense to help families find closure by ID-ing those lost on the USS Oklahoma during Pearl Harbor. To date, we've identified 100 sailors. https://t.co/HyHV00iXPL"]["When I heard the VA was planning to slash funding for a program that has helped thousands of homeless veterans in Connecticut, I was furious. Glad to see Sec. Shulkin heeded our calls to reverse this decision. https://t.co/KqbcqNe4pn"]["Take a moment this Pearl Harbor Day to hear from a 93-year old Connecticut veteran. His words remind us of the meaning of service and why we cannot forget our history. https://t.co/GFFVnn62Sf"]["I've heard from more than 1,100 people in Connecticut about the President's unprecedented reduction of public lands in Utah. I'm going to fight in the Senate to keep these areas protected and accessible to all Americans."]["Proud to stand with @ChrisCoons and our colleagues to introduce a bill to end stigma, discrimination, and stereotypes associated with HIV/AIDS once and for all."]["Glad to see President Trump calling on Saudi Arabia to immediately allow humanitarian aid into Yemen. The administration must continue to make it clear to the Saudis that we will not support a campaign to intentionally starve civilians into submission. https://t.co/NOhIL6XMRS"]["A must-read today from @ShuttleCDRKelly: ‘Good guys with guns’ can be dangerous, too. Don’t gut concealed carry laws. https://t.co/hpdOEXToa9"]["The House is voting in mere hours on a bill that would make it legal for dangerous, untrained people to carry concealed guns in more public places. I would urge them to hear from even a fraction of the families gathered here today who lost a loved one to gun violence."]["Proud to stand with my colleagues, advocates and nearly 100 families of victims of gun violence &amp; demand Congress reject concealed carry legislation. Watch live: https://t.co/JPh81rFEK1"]["Why is concealed carry reciprocity so dangerous? Let's break it down. #StopCCR https://t.co/A45S2f7u20"]["What does the tax bill mean for Connecticut? Good news for the top 1%. Bad news for homeowners, universities and pretty much everyone else. https://t.co/uVTvgwKg8x"]["It's indefensible to pass a tax cut for the wealthy that adds $1.4 trillion to the deficit and in the same breath argue we don't have the money to fund health care for low-income kids."]["An estimated 11,061 #DACA recipients have already lost their protection. It’s time for Congress to pass the #DreamAct and provide a permanent solution for dreamers."]["17,000 low-income kids in Connecticut could lose coverage if Congress doesn't reauthorize CHIP. https://t.co/Cy4q9oHKJU"]["The federal response to the devastation in Puerto Rico has been shameful. This isn't how we should treat American citizens. https://t.co/yNkkE5CQKO"]["Admiral James Winnefeld's piece about losing his son Jonathan to opioid addiction is an important reminder that this epidemic touches people from all walks of life. https://t.co/KGOAQ9vzmN"]["If true, this will lead to a catastrophic downward spiral in the civil war. Only U.S. leadership can save Yemen now. https://t.co/imWOB1xfAl"]["Must-read from Sec. @madeleine Albright on the crisis taking place at the State Department and what we can do to stop it. https://t.co/ukGHxBWQme"]["Just voted no on the Republican tax plan. Giant cuts for the wealthy &amp; corporations - higher premiums, eventual tax hikes and a trillion added to the national debt for everyone else. Plus a process that laughs in the face of regular order."]["Watch my friend Jon from Montana. https://t.co/K4npXD4rDF"]["The U.S. has saved 11 million lives through PEPFAR. On #WorldAIDSDay we need to recommit ourselves to the fight to #endAIDS. https://t.co/zOGo0McXgB"]["Turn on C-SPAN - I'm on the Senate floor now talking about the #GOPTaxScam. And I am fired up."]["Unicorns are real.  Tupac is still alive.  Borrowing money to pay for tax cuts for the rich shrinks the deficit. https://t.co/UAJY01hi8z"]["We're voting in just a few hours on a bill that will leave 13 million more people uninsured and raise everyone's premiums by 10% each year https://t.co/SmXQh25Aug"]["This tax bill is literally getting worse by the minute yet Republicans are desperate to pass it - before we can even read it or the CBO can score it."]["“By 2027, people making $40,000 to $50,000 would pay a combined $5.3 billion more in taxes, while the group earning $1 million or more would get a $5.8 billion cut.” \nhttps://t.co/xcns07F6K9"]["Yup. https://t.co/2cxHd88skt"]["I'm at the #PeoplesFilibuster standing against the GOP plan to give giant tax breaks to millionaires, billionaires, and wealthy corporations. Tune in to watch live. https://t.co/TxYXGGDcYl"]["Uhhh...we're hours away from a multi trillion dollar rewrite of the tax code and the people voting for it don't know what's in it. https://t.co/DPlA8Rxnn8"]["Today is the day that the Senate is voting on this monstrosity of a tax bill, with side of ACA repeal. Pick up the phone. We need you."]["This news from the Air Force on its failure to report to the background check system is exactly why we need to pass the Fix NICS Act. https://t.co/07axDTZYxw"]["There's no dressing this up - repealing the individual mandate will drive up premiums, doubling them within 7 years. https://t.co/DVLGpOFowR"]["Just a few weeks left in open enrollment! Have you gotten covered yet? Visit https://t.co/0cf7WAprk8 to compare plans, find help and sign up. https://t.co/uDfXzoSw3p"]["Bottom line - this tax plan is bad for Connecticut. https://t.co/mobxHzU16y"]["84% of Native American women experience violence in their lifetime. But outside of Indian Country, few people are aware of this epidemic. It's time to raise awareness and show that these women are #NotInvisible."]["Your daily reminder that this isn't just a tax bill - it's a health care repeal bill. https://t.co/049Zq5TThc"]["Proud to help secure funding for the new National Institute for Undersea Vehicle Technology at @UConnAveryPoint. https://t.co/VlePwcmYCh"][".@RNicholasBurns &amp; Ryan Crocker dedicated their careers to diplomacy, serving under Republicans and Democrats. They're sounding the alarm about Trump's attempt to dismantle the foreign service. https://t.co/y8UBG6xq54"]["Need health insurance for 2018? The deadline to enroll or renew your health coverage at https://t.co/S5B2NmnCFI is December 15th https://t.co/zLbhVhzDuI"]["Today @JohnCornyn and I added 8 new cosponsors to the Fix NICS Act:\n\nMcConnell\nSchumer\nPortman\nDurbin\nTillis\nHarris\nCollins\nKing\n\nNow enough Rs to overcome filibuster."]["Proud to help secure funding for new affordable housing in New London. https://t.co/8rKcSOZwTi"]["Dismantling the State Department makes our country less secure and it puts American lives at risk. https://t.co/PAyzYupcvY"]["The math on the GOP tax bill couldn't be worse if they tried. It gives big breaks to rich people while hurting everyone else and adding $1.3 trillion to the national debt. https://t.co/j8q198y89i"]["From the time when he hired me at age 23, to introducing me on stage the night of my election to the Senate, I've had no better mentor/friend in politics/life than George. https://t.co/Nkm9hO0zcV"]["Last week I stopped by @MaryWadeNH to talk with seniors and caregivers about my Social Security Caregiver Credit Act. https://t.co/I5kvH9cwXG"]["Just a reminder - 60% of middle-class families will end up paying more in order to finance big tax cuts for rich people and corporations. https://t.co/AJgN7eyGRS"]["Nearly 2.3 million people have signed up for ACA plans on https://t.co/S5B2NmnCFI. Have you gotten covered yet? Sign up before December 15th"]["It’s Small Business Saturday! Don’t forget to #ShopSmall and support some of our great local Connecticut businesses https://t.co/MD8vQd2QjD"]["The FCC's plan to gut #netneutrality is an assault on the free and open internet. We're going to keep fighting. https://t.co/HYash7nICF"]["I'm thrilled that we were able to get some relief from the IRS for homeowners with crumbling foundations. This was a true team effort and we're going to keep fighting for additional resources. https://t.co/m3Yp8WDEwM"]["Happy Thanksgiving from the Murphy family! May you find yourself with much to be grateful for."]["Thanks to all the volunteers at New Haven's Downtown Evening Soup Kitchen for delivering hundreds of meals today. We were happy to help! https://t.co/mCuniBwaWY"]["Kudos to all of the volunteers at places like HRA New Britain who have been working hard this week to make sure that everyone is able to have a Thanksgiving meal. https://t.co/UYahmXcemH"]["President Trump tried to eliminate the heating assistance program, which 91,000 people in Connecticut rely on. I fought to keep it in the budget and I'm going to keep fighting to make sure that families aren't left out in the cold this winter."]["Visited Action for Bridgeport Community Development to hear firsthand from clients who rely on the home heating assistance program. https://t.co/m4RrsJ1FoQ"]["Stopped by @p2phelps in Norwalk to thank volunteers and help distribute turkeys to families in need this Thanksgiving. Their team does amazing work to help people in Fairfield County. https://t.co/DjtLbS4kpr"]["Joined members of the Ukrainian community in Hartford to provide an update on my work on the Foreign Relations Committee and share what I learned on my recent trip to Ukraine &amp; Estonia https://t.co/FKEDWAaTIO"]["Visited Downtown Evening Soup Kitchen to help staff and volunteers prep Thanksgiving meals for people in need this holiday. @desk_nhv will deliver 1,200 meals this holiday. https://t.co/MA8hAKwNQR"]["Sat down with seniors, caregivers and advocates at @MaryWadeNH to talk about how we can better support family caregivers. https://t.co/MyxwRAgDec"]["Proud to lead the fight to ensure that people who have been displaced by hurricanes are able to find housing. https://t.co/dBu0hJprnZ"]["I asked the kids what it takes to be a Blue Ribbon School and their answers were dead on - great teachers and principals, hardworking students and a positive community. Congrats to @norwichps for this well-deserved recognition!"]["Stopped by @norwichps Mahan Elementary to celebrate them being named a National Blue Ribbon School! https://t.co/23oF6aODCb"]["For people in this area who don’t have a car the NECTD bus is a lifeline to help them get to work, run errands and get around. They provide 50,000 rides a year for $1 a ride, but they never deny people who need the service."]["Hopped on the Northeastern CT Transit District bus in Killingly this AM to learn more about transportation challenges facing residents in the Quiet Corner https://t.co/M2zxbisDKs"]["Started the day with breakfast and conversations at Pine Acres Restaurant in Chaplin https://t.co/xssv5kRnpl"]["Joined @the_USO Connecticut at their annual Force Behind the Forces Gala in Hartford tonight. Grateful for all they do to support our servicemembers and their families. https://t.co/ufOGcXdovS"]["Stopped by HRA of New Britain to thank volunteers and help them distribute some of the 450 turkeys from @foodshare they're providing for local families this Thanksgiving. https://t.co/jxUUm9Wfhs"]["Getting ready to go live with @MyCTCommunity,  @HispanicFedCT and @PeaceCenterCT for a fireside chat on #gunviolence. Listen at 3pm on any iHeart Media radio station or stream it online at https://t.co/BlL8V5dTNR"]["With U.S. support, The Saudi blockade in Yemen is cutting off humanitarian aid and worsening the twin epidemics of famine and cholera. https://t.co/xPmwhTJhWn"]["President Trump’s attempts to ban refugees plays into the hands of our enemies and doesn't make our country safer. That's why yesterday I introduced the No Ban on Refugees Act. https://t.co/kasJarLsnW"]["Way to go Wiffle Ball! Did you know they've been #MadeinCT since 1953? https://t.co/WLAzD2H0jT"]["Connecticut startups continue to grow and create jobs. Exciting to see Triax Technologies doubling their workforce. https://t.co/ZXUepQh0u3"]["Our endorsement of the humanitarian nightmare in Yemen must end. It's time for Congress and the American people to speak out. https://t.co/UDoRvBMBO0"]["Great to see so much support for our bipartisan Fix NICS Act. Our bill will keep dangerous people from buying guns and it will save lives."]["Full list of co-introducers of Fix NICS Act: @ChrisMurphyCT @JohnCornyn @SenatorTimScott @SenBlumenthal @OrrinHatch @SenFeinstein @SenDeanHeller @SenatorShaheen  Thanks to all!"]["The Fix NICS Act is the most important piece of bipartisan guns legislation since Manchin-Toomey. 4 Dems, 4 Republicans. Reforms aren't window dressing.  Big deal."]["Today, many states/federal agencies don't submit records to backgrounds check system, allowing lots of dangerous people to buy guns. My bill w @JohnCornyn fixes that problem."]["Just introduced a breakthrough bill on background checks w @JohnCornyn @SenBlumenthal @SenatorTimScott et al. Major fixes to broken background checks system."]["Great to see my friends from @PPSNE in Washington yesterday. #IStandWithPP https://t.co/J754H93FKa"]["ACA open enrollments going strong - 1.48 million people signed up for coverage in the past 11 days. Keep. It. Up."]["Big news: super close to a bipartisan breakthrough on gun legislation.  Stay tuned..."]["By 2025 your tax cut (if you got one) is gone.  But CBO says average premium increase for family of four could be $10,000."]["Why is this now a health repeal bill and not a tax bill?\n\nThe meager middle class tax cuts expire in seven years.  Premium increases don't."]["It's not a tax bill anymore. It's a health care repeal bill. \n\nTime to mobilize. Like now."]["It was cruel enough for them to take your health care to get back at Obama. Downright sinister to take your health care to fund tax cuts for billionaires."]["This is mind blowing. It's really worth 5 minutes of your time. https://t.co/NP1tpdKBB3"]["I was honored to receive the 2017 Veterans Justice Award from @CTVeteransLegal last week. I'm going to keep working to get the Honor Our Commitment act passed into law. https://t.co/00gEBgghdR"]["Great read on @americanwoolen, one of my recent Murphy's Monday Manufacturers. They're reviving textile manufacturing in Connecticut. https://t.co/E7ij5T2edH"]["The US/Saudi coalition took out the Sanaa airport last night. Now no humanitarian relief by air. This is barbaric. https://t.co/68GfW5Sbq4"]["The U.S. has helped the Saudis do this. All this horror happens with our endorsement. We could end this nightmare if we chose to. https://t.co/SSr2Rb65Ww"]["Tomorrow is @Foodshare's annual Turkey Tuesday! Stop by the CityPlace lobby on Asylum St. in Hartford to drop off a turkey or non-perishables from 5-10am https://t.co/FdPbvirDkB"]["No one should be alone this Thanksgiving. If you need a place to go in Connecticut - give them a call. https://t.co/0db4iYgrob"]["Diagnosed with cancer or a chronic illness? Have a loved one in a nursing home? The Republican tax plan is bad, bad news for you. https://t.co/a1Dkndjlfq"]["It's been just over a week since the tragic shooting in Sutherland Springs. Take a minute today to read about the victims. https://t.co/qT6au8Y7Jc"]["Grateful that Denada Rondos has been granted a stay. The community has rallied behind her, Viron and their children because they know that we shouldn't be tearing families apart. https://t.co/YhKqJx9Ewq"]["Nice! @ryanhanrahan is a weather god. Congrats, friend. https://t.co/TUzP2hgV0Z"]["We are at $125,000!! AMAZING. Can we get to $150,000 for Doug Jones by the end of today? I think we can.  https://t.co/4Bq7XzYxJ2 https://t.co/QxyVrumA5m"]["50 faith organizations call on Congress to take action on gun violence.\n\n\"As organizations of faith, we strongly believe in the power of prayer. And yet, we know that prayer is a call to action rather than a substitute for it.\" https://t.co/mN3C5c0grc"]["So this is unreal. Roy Moore said he raised $100,000 after the Post story ran. In response to 1 e-mail and 2 tweets from me, you've donated $92,000 to Doug Jones.\n\nWe can match Moore - $100,000 - by the end of the day. Let's go.\n\nhttps://t.co/sfdHWxdrGK"]["No no no no no no. \n\nThis is a dream, right? A horrible, horrible dream... https://t.co/cbTgGg7Pfp"]["The purposeful gutting of American power abroad is mystifying. If you didn't know better, you'd think some rival government was running our foreign policy. https://t.co/YL6l40472j"]["Joined @CTVeteransLegal yesterday to announce the opening of their new office at the Newington VA. CLVC does great work to help vets overcome legal barriers to housing, healthcare, and jobs. https://t.co/pjy98O3zf1"]["A special thank you to my staffers who have served and those who work on behalf of Connecticut veterans every day."]["Happy Veterans Day to all of our vets, active duty, guard and reserve! Thank you for answering the call to serve and fighting for our freedoms. https://t.co/CXY4jCEeqm"]["Changing the date of an election bc you're going to lose represents a rabbit hole from which democracy won't escape. https://t.co/Z4rb2OkMzM"]["Moore's campaign says it raised $100,000 since yesterday. \n\nIn response to one email and tweet from me, you gave Doug Jones $36,000. Let's make it $50K. https://t.co/2rRExbNuQo"]["Started the day at Cheshire High School at the annual BRAVE club Veterans Day Breakfast https://t.co/pr79pfY08z"]["Kicking off Veterans Day weekend with events across Connecticut in Cheshire, Storrs and Hartford"]["Roy Moore should never get anywhere near the United States Senate. If you agree, click here and do something about it. https://t.co/fCKIYfEh2p"]["Honored to receive the 2017 Veterans Justice Award tonight from @CTVeteransLegal. I'm going to keep working to pass my Honor Our Commitment Act to help vets access mental health services."]["Dreamers are rallying in New Haven and across the country today. It's time for us to pass the #DreamActNow https://t.co/NK5bB57MaN"]["Over and over they admit on the record that the GOP tax bill isn't for you. It's for the CEOs and the billionaires and the Republican donor class. https://t.co/6tawZpHeN7"]["More than 600,000 people have already signed up for health care during open enrollment! Visit https://t.co/Zdw9RJfjVJ to get covered before Dec. 15th https://t.co/OW3wvARUtg"]["The GOP tax bill isn't for you. It's for their billionaire and corporate donors. And they're not even trying to hide it. https://t.co/XBlqC5Mz5R"]["The denial of science now includes the fact that heat causes things to expand. \n\nYou need to watch this. https://t.co/XaX83EU2LM"]["The GOP tax plan would be a disaster for seniors and people with loved ones in nursing homes.\nhttps://t.co/uUdET5UbqS"]["Trump is slashing outreach efforts but open enrollment numbers are up. Keep it up! https://t.co/UusBj6HnaJ"]["It's been nearly two months since Hurricane Maria and thousands in Puerto Rico still don't have access to emergency food assistance. https://t.co/548RwYQ9wE"]["When the GOP says their tax plan helps \"small businesses\" what they really mean is that it helps mega-corporations and their owners. https://t.co/yoiSFG5xVb"]["6/ Lesson is clear: voters care about gun policy now more than ever. Ds can receive a coequal bump to Rs, but only if they CHOOSE to turn people out on the issue."]["5/ Why? Because Northam ran hard on guns (universal background checks, assault weapons ban). He didn't play cute or cozy up to the gun lobby."]["4/ Of the 17% of voters for whom \"guns\" was the top issue in Virginia, 49% were Republicans and 49% were Democrats.  Motivated both sides."]["3/ And guns drove Democratic and Republican turnout EQUALLY, contrary to the conventional wisdom that guns are a driver of Republican turnout only."]["SHORT THREAD: 1/1 Yesterday's Virginia election shows that gun policy is just as big a driver of Democratic turnout as Republican turnout.  Game changer."]["It's not too soon. https://t.co/w6JKvkW4ia"]["Let me get this straight - millions of middle-class families will pay more so that the ultra-wealthy can pay much less? https://t.co/sB9jhYEefv"]["So many grassroots groups in Connecticut made today's wins possible. Special shout out to my crew at Fight Back CT. @NickMarroletti and his team were amazing."]["They flips in control from R to D keep coming...\n\nTrumbull\nNew Britain City Council\nNewtown\nNew Fairfield\nNorth Stonington\nGroton\nLyme\n\nWow.  Wow.  Wow."]["Results still coming in, but CT towns that went from R to D control:\n\nFarmington\nGlastonbury\nSouthington\nGuilford\nBristol\nClinton\nSouth Windsor\netc. etc. etc.\n\nWow."]["BIG night for Democrats in Connecticut. Flipping town control from Republicans in every corner of state. https://t.co/eRORZ91M3G"]["Exit polls show top 2 issues for #Northam voters tonight were health care and guns. Say it again. Health care and GUNS."]["If Republicans think things are bad tonight, wait until they ram through a giant tax cut for corporations and the super rich. https://t.co/6OxCEaKbu6"]["We are not powerless to stop this slaughter. Martin and Jeff are showing that bipartisanship is possible on guns. https://t.co/W9jTq57sSQ"]["Turn on C-SPAN - I'm on the Senate floor talking about Connecticut DREAMers and why we need to pass the #DreamActNow."]["Just a couple hours until the polls close in Connecticut. Did you cast your vote yet? #VoteRowA https://t.co/oTm6ZWIu8h"]["Must-read editorial from @thedayct - \"Will Congress ever do the right thing?\" https://t.co/AaXlplWayL"]["The entire world has come together to fight climate change and the United States is sitting on the sidelines. https://t.co/RdLosVyPIe"]["We are the only country in the world with this epidemic of mass shootings and the reason is clear. https://t.co/3LNHTvNVzq"]["Heading to the Senate floor to talk about the shooting in Texas &amp; why Congress needs to do something - anything - to help stop gun violence"]["As events spiral downward in the Middle East, this is one of those moments when American leadership, or the lack of it, matters most. https://t.co/3b7Of0PURL"]["Getting ready to go live with Lawrence O'Donnell on @TheLastWord to talk about the Sutherland Springs shooting. Tune in at 10:30 on @MSNBC"]["This is an argument for anarchy. If no law can prevent every single act of wrongdoing, then why have laws? https://t.co/4EbNh9k9cQ"]["Let's be clear - nobody \"stopped\" this shooting. 26 people, including little kids, are dead in one of our country's worst mass killings. https://t.co/MP2ZxrUEoo"]["Mr President, this would be an opportune time - after 11 months vacancy - for U.S. to finally have an Assistant Secretary for Middle East. https://t.co/7dk2PPWcAU"]["Campaigned w local candidates this afternoon in Westport, Stamford, Norwalk, Milford, Orange, Branford, &amp; Guilford. Great energy out there! https://t.co/0ev9A2lTaH"]["Can you sleep tonight, colleagues, when the price of gun lobby goodwill is this - blood soaked church and school floors, city streets?"]["Oh my god. https://t.co/2Crgakq8pN"]["Great slate of Democrats running in Madison - including my cousin Scott Murphy. Hope you'll get out and vote on Tuesday. https://t.co/YHV8gcqE3L"]["Lots of dots to connect in Saudi Arabia. MBS power play, quiet Kushner trip, Russia arms deal just the latest. Pay attention. This matters."]["10 more stops with local candidates today. Started w Derby and Trumbull and a pesky drizzle (not an excuse to cancel door knocking!). https://t.co/NEq4C4vann"]["I accept!! Tell me where the secret room is where you are writing the bill and I WILL BE THERE! https://t.co/PPBO1uFqwV"]["Another big GOTV turnout. This time in Manchester, my TENTH (and final) STOP. Mayor/Coach Moran fired everybody up. Go get em Tuesday! https://t.co/K5TsDl8pFX"]["Because I know you're following my travels today w baited breath: NINTH STOP is making calls for the Mansfield Democrats. https://t.co/TAubtd1bQG"]["Twilight door knocking w awesome 25 year old Norwich mayoral candidate @Wilson4Norwich is my EIGHTH STOP. https://t.co/N9OEhZjuho"]["SEVENTH STOP: Clinton, where Dems lost by 1 vote in 2015. Can't let that happen again! Christine Goupil will be a great 1st Selectwoman. https://t.co/LCyx11pozh"]["Stop number SIX is in Toni Harp territory - New Haven. Big rally at Nica's Market, one of my favorite Elm City eateries. https://t.co/07YUEfxBkb"]["FIFTH STOP today is in my hometown of Cheshire. Need to win just one more seat to take control of the Council. We can do it! https://t.co/lVmVEIrFWZ"]["In Meriden for my FOURTH STOP to support Mayor Scarpetti and a super duper team of Democrats. Get out there and knock some doors! https://t.co/3IxnYAmLTk"]["THIRD STOP: New Britain - home of UConn alum and World Series hero George Springer Jr! https://t.co/GN68lAFZb6"]["SECOND STOP: My great friend Claudia Baio deserves reelection in Rocky Hill. Joined @RepJohnLarson there for another canvass kick off. https://t.co/u2yJ8ByNQO"]["All over Connecticut today in support of local candidates. FIRST STOP: Full house for door knocking kick off in Wethersfield. https://t.co/zexKsrKlC0"]["The idea of a \"middle-class tax plan\" kind of collapses when even @WSJ says the big winners are wealthy heirs. https://t.co/Q8LoE0wFO3"]["Delaying a #DACA fix means undocumented youth could be deported from the only home they've ever known. We need to pass the #DreamActNow"]["Need to get covered in CT? Free, in-person help is available. Visit https://t.co/PWPGEE3gb3 or check out an enrollment fair in your area https://t.co/Ff9Kdegg3T"]["Great to see Ella's list working to elect Democratic women in Connecticut https://t.co/tizmuLceVm"]["There is a whole unit of the State Department to convince third world dictators not to use legal systems against their political opponents. https://t.co/gRiv05L1zd"]["The state of the American Presidency defined. A racial slur and a threat to jail a political opponent all in 140 characters. https://t.co/LyiM7RWVXF"]["The \"sandwich generation\" is growing as more people provide care to their children &amp; parents at the same time. https://t.co/eFaRK0Gw0J"]["Amendment: forgot 3rd goal of GOP tax bill: dramatically expand the deficit to force huge future cuts to education, roads, healthcare."]["At least GOP is unapologetic about the two goals of tax bill: (1) shift money from poor to rich; (2) shift money from D states to R states. https://t.co/mCh9lEvG7m"]["Happy for #Astros. Happier for hard hittin' New Britain's own George Springer. MVP right?? #SpringerDinger #AstrosvsDodgers"]["So sick. https://t.co/MUqJmIbwvc"]["Good read today from my friend @SenWarren. This is exactly why I intro'd the Supreme Court Ethics Act https://t.co/RyGCpDm6hG"]["A month after the Vegas shooting \"lawmakers have done exactly what the gun lobby wants. Absolutely nothing.\" https://t.co/tK5FGxda4C"]["Open enrollment is here and it starts TODAY. Visit https://t.co/TMAqX7iQXE to compare plans and get covered https://t.co/kSB8NRKkbr"]["Now I get it. If the killer is an immigrant you can talk about policy change, but if he's natural born, you're \"politicizing the tragedy\"."]["I await the right's condemnation of Trump's \"politicization\" of this tragedy &amp; his failure to observe waiting period before talking policy. https://t.co/Vjmmuh2W1K"]["Remember, even if Trump waits to pardon Manafort until a year from now or 2 years from now, the pardon was likely promised to him this week."]["The first family, ladies and gentlemen. https://t.co/uwgThc3OI5"]["Full bucket. https://t.co/EGfzWbwIM9"]["So awful. Our hearts go out to the victims and all those affected. https://t.co/8Lmmp9K9Qm"]["Health care open enrollment starts TOMORROW. Compare plans and enroll at https://t.co/Zdw9RJfjVJ from Nov. 1st to Dec. 15th. https://t.co/sqmcJ4K3oq"]["As GOP tax bill evolves, it's increasingly clear the intent is to shift $$ from middle class to the very rich. New idea is to tax 401Ks too!"]["Heading to the Senate floor to talk about gun violence and the need to pass expanded background checks. Turn on C-SPAN to watch soon."]["In a city that has a ton of heart, nobody's is bigger than Selim's. Pull through this, buddy. https://t.co/6ImBQVLz17"]["The lying is ascending to a new level today."]["Grateful for the transgender Americans who continue to serve our nation and glad to see the courts rejecting Trump's discriminatory ban https://t.co/DSVPGvzzMu"]["I made it clear to Mattis/Tillerson that absent imminent attack on US, a preemptive strike against NKorea needs congressional authorization."]["Just finished questioning Tillerson &amp; Mattis on N Korea. They left lots of doubt whether they would seek vote by Congress before a strike."]["Open Enrollment starts November 1st! Here's what you need to know to #getcovered in Connecticut. @AccessHealthCT https://t.co/vw6cJNydI4"]["This week I'm intro-ing a bill to stop Trump from preemptively striking North Korea without approval from Congress https://t.co/T4f7lPpMZQ"]["It's peak fall here in Connecticut. @CTvisit has some ideas for fall fun in every corner of the state https://t.co/u9xzs6YFxS"]["Wrote a behind-the-scenes account of my trip to Ukraine and Estonia last weekend. Hope you'll take a minute to read: https://t.co/WVQD7Fyok0"]["Congrats to Jessica and All Our Kin on this well-deserved recognition! https://t.co/9ZSL5J3ilk"]["I did. Then:\n\nMe: You know how u love science in school?\n9 yr old: Yeah.\nMe: The Kochs don't believe in it.\n9 yr old: What? I don't get it. https://t.co/TKmF026jUJ"]["A new help center is opening in Hartford for families who have been displaced by Hurricane Maria. Learn more: https://t.co/PBckyqq7du"]["Nardyne lost her only child to gun violence. Grateful for her courage to share her story and fight to ensure other kids can grow up safely. https://t.co/Vmw1FcAJLR"]["The GOP tax plan cuts benefits that Connecticut families rely on to finance a tax cut for the ultra-wealthy. https://t.co/Z7rJMYtkLN"]["For all the Republicans breaking w Trump, here is your chance to actually constrain his most dangerous power - to make war."]["Mistake by Trump could kill hundreds of thousands on Korean Peninsula. My bill w @brianschatz @CoryBooker will clarify Trump's war powers."]["My bill w @brianschatz &amp; @CoryBooker makes clear that any unauthorized preemptive strike on N Korea - nuclear or conventional - is illegal."]["Trump's North Korea threats are real. I will intro bill w @brianschatz &amp; @CoryBooker to prohibit any preemptive action w/o vote by Congress."]["900 ppl have been shot &amp; killed since the mass shooting in Las Vegas. That's why we need expanded background checks. https://t.co/Qs793M0pKX"]["“The political movement around anti-gun violence is getting stronger, month by month, year by year.\" https://t.co/dsgjyLWHWu"]["RT if you agree - If a person can’t pass a background check, they shouldn’t be able to buy a gun. https://t.co/Vya3TsL7xf"]["The Puerto Rico relief package passes yesterday was necessary, but it wasn't even close to sufficient. We have a lot more work to do."]["Heading to the Senate floor to talk about disaster relief in Puerto Rico and the dire situation on the island. Tune in to C-SPAN to watch."]["Today, I'm introducing legislation to expand background checks. https://t.co/cZgX0UusC5"]["\"Cheese\" was our first born's first word, BEFORE \"mama\" or \"dada\". Actually said \"Spongebob Squarepants\" before \"dada\" (not kidding). https://t.co/TGnMle1Jvz"]["Up early to talk w @Morning_Joe about the introduction of my backgrounds checks bill today. https://t.co/G69pZUfQ3w"]["As @brianschatz says, none of this is on the level. https://t.co/DpjLq953qu"]["Background checks work. In states with universal checks, 47% fewer women are shot to death by their intimate partner."]["ISIS is telling recruits to go to gun shows to buy weapons without a background check. Universal background checks = tough on terrorism."]["Around 25% of gun transfers now happen without a background check. That means tens of thousands of criminals are getting guns every year."]["Tomorrow I'm introducing universal background checks legislation that has 92% public support. Other 8% must be GOP Congressmen, NRA staff."]["My god.  Turn on C-SPAN right NOW. #Flake"]["Washington's been ripping off Puerto Rico for 100 yrs. Maria gives Trump allies new chances to continue the swindle. https://t.co/DUUIcGKKZV"]["Have questions about health insurance or need help signing up? Visit one of @AccessHealthCT's enrollment fairs across the state https://t.co/cffy3gn4CL"]["Public health professionals are calling for action on gun violence -\nagain. We cannot ignore an epidemic that kills 33,000 Americans each yr https://t.co/bmM1zbby0v"]["Don't discount how total breakdown of Senate process adds to this. 20 yrs ago, would've been relatively easy to force a Senate vote on this. https://t.co/lsU8uRb1UM"]["Just back from quick weekend trip to Ukraine and Estonia. Will send behind-the-scenes e-mail this week. Sign up at https://t.co/x3craIZWDu https://t.co/PQEIsDnzbJ"]["State of the Republican Party. Defined. https://t.co/Ehnc6Efyyq"]["Under the ACA the uninsured rate reached record lows. Thanks to Trump's sabotage it's rising again. https://t.co/Y9UKleWkCq"]["Kudos to @ClearWeave and @orourkesdiner for creating job opportunities in Middletown for adults with autism https://t.co/vJWkXobkkn"]["#ICYMI earlier this week @SenFeinstein and I intro’d legislation to block the latest iteration of Trump's Muslim Ban https://t.co/IgYCjpwdnY"]["As Ranking Member of the Senate Foreign Relations Subcommittee on Europe, these meetings will help inform my committee work"]["Wheels up on the way to Ukraine &amp; Estonia. I’ll be meeting with local officials to discuss security, Russian activity in the region &amp; NATO"]["The White House stands by Kelly's statement even though THERE IS A VIDEO proving he's wrong. \n\nDon't ever ever ever accept this as normal. https://t.co/U7vwJf03D1"]["More than 75% of people in Puerto Rico are still without power. I wouldn't call that a 10 out of 10. https://t.co/ZlR4CKb46a"]["Suck up. https://t.co/AJFxGeTzyi"]["Late budget votes tonight. #CubsvsDodgers may or may not be on the TV in the back room. @SenatorDurbin may or may not be sitting next to me."]["Wishing a joyful #Diwali to everyone celebrating in Connecticut and around the world."]["This is so cool. As a huge Alexander Calder fan, I'm fired up he's coming back to Waterbury! https://t.co/0Jsfly08CT"]["I'm heartbroken for Deon Rodney's family. His bravery in the face of gun violence saved lives. We should work to honor him with action. https://t.co/CJYe0WR6er"]["So proud to be fighting alongside @GabbyGiffords &amp; @ShuttleCDRKelly as we work to help stop gun violence. https://t.co/Cvjuenp2iJ"]["I couldn't stop watching this. https://t.co/n3tYGqS4WF"]["Uh...but you JUST campaigned for the guy in Virginia who is running a Trump inspired nativist campaign. https://t.co/nIws1k9QKk"]["If I tried, not sure I could come up w a health care bill and tax cut bill more politically toxic than what Republicans came up w in 2017."]["Play on repeat for next 3 months.\n\nGOP budget cuts Medicare to fund tax cuts for rich.\n\nGOP budget cuts Medicare to fund tax cuts for rich."]["I'm live now talking about the #IranDeal on Facebook with @IndivisibleTeam. Watch: https://t.co/fnl42BTUu4"]["Getting ready to go live on Facebook w @IndivisibleTeam to discuss the #IranDeal. Tune in to watch at 8:30 ET here: https://t.co/UGNa2RpHFI https://t.co/ivxAON3bP0"]["Yup. The data is actually overwhelming. https://t.co/HFfdo1dk1o"]["Murphy Disputes Washington Post Fact Checker On Gun Control Laws - Hartford Courant https://t.co/92rDFUOhR3"]["We've noticed. https://t.co/vvAy1oLnVO"]["Key element of Trump's strategy of U.S. global withdrawal - just sell arms to everybody so they can \"defend themselves\". https://t.co/QGOroCzTYb"]["At this point his motivation is clear - Trump seems to get genuine joy from deliberately destroying the American health care system. https://t.co/WXkPhFLpTE"]["@GlennKesslerWP @JohnsHopkinsSPH @AMJPublicHealth 11/ The data is clear and overwhelming. Smart guns laws save lives. Congress needs to wake up to that reality - soon."]["@GlennKesslerWP @JohnsHopkinsSPH @AMJPublicHealth 10/ Kessler relies on John Lott's pro-NRA research. Google him. Or just read this WaPo article debunking him. https://t.co/CP7rIdthMZ"]["@GlennKesslerWP @JohnsHopkinsSPH @AMJPublicHealth 9/ And sometimes, you don't need studies. You need common sense. If bump stocks were illegal, more people would have survived Las Vegas."]["@GlennKesslerWP @JohnsHopkinsSPH 8/ More to the point, studies show that stronger gun laws can lower suicide rates. Here's one from @AMJPublicHealth https://t.co/QwMVvIN2pj"]["@GlennKesslerWP @JohnsHopkinsSPH 7/ Here, the Washington explains how the suicide rate falls when access to firearms falls. https://t.co/qjAI9uoN7N"]["@GlennKesslerWP @JohnsHopkinsSPH 6/ Kessler says this data shouldn't count bc it includes suicides. What? Suicides are preventable gun deaths too - they matter just as much."]["@GlennKesslerWP @JohnsHopkinsSPH 5/ But those are just single states studies. What's most persuasive are studies that show states w tougher gun laws have few gun deaths."]["@GlennKesslerWP 3/ Who reported on the success of this bill when @JohnsHopkinsSPH released their study data? The Washington Post \nhttps://t.co/IgSuCVywVK"]["@GlennKesslerWP 1/ First, let's look at Connecticut. We implemented a handgun permit bill, gun homicides fell by 40%, saving 296 lives in the first decade."]["THREAD: For years, @GlennKesslerWP has been arguing that smart guns laws don't save lives. With great respect, he's wrong.  Here's why."]["Joining @IndivisibleTeam tomorrow night at 8:30 ET to talk about the #IranDeal on Facebook Live. Hope you'll tune in. https://t.co/uEc3HDbnL7"]["Experts agree, there are steps we can take to fight the opioid epidemic. I'm urging the White House to work with us. https://t.co/IyxttVyoaW"]["Want to understand how Trump's sabotage of ACA affects Connecticut families? Take a minute to read Magaly's letter https://t.co/Tvn6XntFCr"]["Health care open enrollment starts on November 1st. Here's what you need to know to #GetCovered https://t.co/vsgycSFUP4"]["If you want to believe that the military will convince Trump not to launch an attack against North Korea...history does not agree. https://t.co/SSwxUIsXs1"]["Talked with @WTIC1080 about the opioid epidemic in Connecticut &amp; how I'm working to combat it in Washington. Listen: https://t.co/mXBjYrSlyO"]["I'm urging Anthem &amp; Hartford HealthCare to put patients first &amp; agree on a contract - 60,000 consumers are waiting. https://t.co/1ETKcDm8SU"]["With the president conducting policy in 140 characters, it has never been more important for Congress to assert its role in foreign affairs"]["Spoke at @YaleLawGLC on Friday at their Congress and Foreign Policy Conference https://t.co/3fLoW87Ww7"]["Senate is back in session today. We need to pass federal aid for Puerto Rico NOW. https://t.co/dyr2P3hNMD"]["The only place commonsense gun laws are controversial is in Congress https://t.co/VHuPXqn0S2"]["This is awful. Our hearts are with Somalia today. https://t.co/pw9tQ2HkX5"]["Congress isn't focused much on Iraq right now. It should. Read this thread. https://t.co/VNgYfa07OD"]["This is neat. https://t.co/ybv71FowmY"]["The Puerto Rican community in CT has done everything possible to help their loved ones. Congress needs to step up\nhttps://t.co/HhxEmKw4nx"]["Yes. Iran (1) still gets European sanctions relief; (2) can restart nuclear program; (3) comes out looking like the aggrieved party. https://t.co/YvAZHGAhZ7"]["Ready. https://t.co/S4KL3vCxQq"]["Had a fun time knocking doors yesterday in Brookfield w First Selectman @SteveDunn_Bkfld and running mate Sue Slater. Good luck in Nov! https://t.co/W9txXzihNf"]["So if you piss off and insult the rest of the world with intentionality, there are consequences to our national security? https://t.co/xK7rsTAtxJ"]["Visited Wind Hardware in Newtown to tour the facility and talk with employees about making sure we have fair trade policies https://t.co/hMWHmvxQpM"]["There is such thing as too much Ezra. I haven't been reading any 280 character tweets in protest of new policy. Glad you're back to 140. https://t.co/2zT0TyYPEZ"]["Think Trump's advisors will keep us out of war w N Korea? They advised him to stay in Paris and Iran deals, keep paying CSRs. How'd that go?"]["Trump's decision to stop ACA payments is nuclear grade bananas - a temper tantrum that sets the entire health system on fire. My god."]["Important: if Trump stops paying insurers, rates for EVERYBODY go up - not just for people on ACA exchange plans. Get ready, America!!"]["Funny, you never said that about Houston. https://t.co/Q40gGUVZC5"]["Hospitals in Puerto Rico are running out of medical oxygen. I'm urging @fema to make it a priority to help hospitals https://t.co/KmT2241YyL"]["We might as well just relocate to another planet. Trump doesn't seem to want us to be part of this one. https://t.co/F5Qz1kPFuH"]["I intro'd the Social Security Caregiver Credit Act as just one step we can take to help family caregivers https://t.co/4MEJwDlQlF"]["Millions of Americans care for a loved one. We need to improve our laws to better care for them https://t.co/Y3KZc0PQrm"]["A must-read for today - my friend Mark Barden's powerful letter to @Calebkeeter https://t.co/AdKgRZ59dx"]["a. You've turned power back on for 15% of the island. \n\nb. Puerto Rico still has half the troops Obama put on Haiti. \n\nYou're not done. https://t.co/D0T4UBPXQy"]["Congress needs to pass a relief package as soon as we are back in session. Puerto Ricans are Americans and we cannot abandon them."]["Hearing directly from people in CT who have loved ones on the island has helped me know what to push for in Washington &amp; what families need"]["Joined @reprosario128 and members of the Puerto Rican community in Bridgeport to discuss ongoing relief efforts following Hurricane Maria https://t.co/OgAfvr7pbH"]["Stopped by Broadview Middle School in Danbury to chat with students about what it's like to serve in Congress. https://t.co/F4IoakyEXf"]["Millions without power. Many still without drinking water. This is not how we care for our fellow Americans in times of crisis https://t.co/j2yFyqhfuZ"]["Do it yourself. Stop passing the buck. The statute is unclear. You know this. And you know sending it to the ATF might bury the issue. https://t.co/V3NAD3cTto"]["Your regular reminder that the best pizza in America comes from Connecticut\nhttps://t.co/SphiUyLI85"]["There's plenty we can do to reduce gun violence that is effective and that the vast majority of Americans support https://t.co/v8KuTf36zg"]["Our #FightBackCT volunteers &amp; fellows are doing big things. Have you signed up for an event yet? Find one at https://t.co/l12FZAlotg https://t.co/C2BizXP5th"]["8/ Now is time - before it's too late - for Rs and Ds to make clear no preemptive strike against NK can happen without a vote by Congress."]["7/ Timing of Corker's comments, referencing possibility of World War III, might not be accidental."]["6/ Many of us have begun to hear whispers of more serious war talk in and near the White House. \"Calm before the storm\" comment sent chills."]["5/ The risk of surrounding himself with only military men has always been that they will only give him military solutions."]["4/ Trump keeps intentionally cutting the legs out from underneath Tillerson and any diplomatic path. There is purpose here it seems."]["3/ Experts agree (and are telling Trump) that window is closing - NK will soon have a nuclear weapon that can reach US and our allies."]["2/ Trump's war drum rhetoric seems like over the top braggadocio but why assume it's just bluster? Other bluster (Muslim ban) led to action."]["THREAD: It's time to take Trump seriously as he keeps hinting, over and over, that he wants to go to war with North Korea."]["Vote last fall was 27-71, this summer 47-53. Congressional opposition to US-Saudi war in Yemen is growing bc we have forced votes."]["Actually, Congress has had input. @RandPaul and I forced 2 Senate votes - Senate backed continued involvement. https://t.co/4JuxDgISDN"]["Cathy and I were so excited to take part in the big @SeanScanlonCT @MegForgione wedding this weekend! A Team Murphy romance! https://t.co/xTbr5m8qi1"]["Don't let these guys tell you they are fiscal conservatives. This was a multi million dollar political stunt paid for by taxpayers. https://t.co/ntnuOmIX1c"]["I'll be in that chair at 9am to join @jaketapper on @CNNSotu to talk national security, gun violence, etc. Tune in. https://t.co/5UkUUVlMvx"]["Congress shut down research on gun violence 21 years ago. It's a lot harder to solve a problem if you can't study it https://t.co/bEkaaFWj23"]["Heard directly from members of the Puerto Rican community in Willimantic about the ongoing devastation from Hurricane Maria &amp; relief efforts https://t.co/J9tjfvH6PK"]["I intro'd a bipartisan bill with @JohnBoozman to recognize Century Farms like Kasheta which have been in continuous operation for 100+ years"]["Stopped by Kasheta Farms in South Windsor. It's been family-run since 1905! And yes, I did buy a giant pumpkin to take home. https://t.co/w2gPkfZNNR"]["Sat down with @SBALinda and small business owners in Hartford to hear about the issues they face and how we can help at the federal level https://t.co/BJLcp67SUf"]["I'm sick and tired of Republicans trying to take away women's health care in 2017. https://t.co/WiP5BLq99z"]["We're giving our Republican colleagues a menu of options. All of them would help save lives. The only thing we cannot do is nothing - again."]["I'll be introducing a new background check bill in the coming weeks. And Dems have intro'd a slate of bills that would prevent gun violence"]["Standing with police, advocates &amp; my colleagues in #NewHaven to call on Congress to do something - anything - to prevent gun violence https://t.co/j1RLJsQftR"]["I'm live now with WNHH talking with Brian Slattery of @NewHavenIndy. Tune in or stream it here: https://t.co/930NkjQMta"]["Politics can't work if grudges never die. Spending the day w @Linda_McMahon visiting small businesses in Connecticut. In Torrington now. https://t.co/nIXJXQomul"]["I invited @SBALinda back up to Connecticut to talk with our small businesses. Glad to have her here for stops in #Torrington &amp; #Hartford"]["Time for GOP leadership in Congress to make clear military action cannot be taken against North Korea absent congressional authorization. https://t.co/caeWVbFjpX"]["I want to make it easier for startups to match with investors &amp; get capital. That's why I wrote the Angel Tax Credit Act &amp; the HALOS Act"]["Connecticut startups are securing record new investments to grow and create jobs. https://t.co/hP8Jn8a7qt"]["Connecticut Dreamers -- if your status expires on or before 3/5/18 your #DACA renewal MUST be received by today."]["Big news for CT jobs - great to see Charter Communications will move to Gateway Harbor Point, adding 1,100 jobs https://t.co/iUjd9vIX6k"]["My view of @SenAlexander @SGottliebFDA &amp; @NIHDirector at start of big Health Committee hearing on opioid crisis. https://t.co/NZtwMOLQgF"]["Got the chance to congratulate Clinton Parker in person today. His courage is inspiring. https://t.co/nQbIR2qyyb"]["Happening now - I'm at @amprog talking about the #IranDeal and why it would be a mistake to decertify. Watch here: https://t.co/abY9EBpcSH"]["Walking away from the #IranDeal would be a catastrophic mistake. I'm explaining why at @amprog at noon. Watch live: https://t.co/abY9EBpcSH"]["Going to @amprog today to discuss how pulling out of the #IranDeal would bolster our adversaries &amp; make us less safe https://t.co/abY9EBpcSH"]["Utter complete bs. All our criminal laws are, in part, an attempt to protect the innocent and vulnerable from the evil or ill-intentioned. https://t.co/438FFtf20P"]["Honored to be recognized with my amazing wife Cathy as child advocates of the year by the Children's Law Center https://t.co/P88chW8JMX"]["Learn their names. Read their stories. Honor their memories. https://t.co/yn2z9HrLab"]["Trump and GOP should have to explain, on the record, over and over, why they (proudly) have zero ideas on how to stop mass shootings. https://t.co/xzNSq8nLXy"]["Have 5 minutes? Check out my op-ed in today's @washingtonpost on the great American gun violence paradox. https://t.co/jYtNsaqqFW"]["In the 477 days between the horrific shootings at Pulse nightclub and Las Vegas, there were 521 mass shootings. https://t.co/FWpEymJ11q"]["Going live with @maddow soon to talk about Las Vegas and why Congress needs to do something - anything - to try and stop this violence."]["My op-ed in tomorrow's Washington Post: \"Mass shootings are an American problem. There’s an American solution.\" https://t.co/ewU2BrTsmq"]["Heading to the Senate floor to talk about the shooting in Las Vegas and how Congress' inaction has made us complicit. Watch soon on C-SPAN2"]["These are weapons intentionally designed to kill as many people as efficiently as possible. Why is anyone shocked this keeps happening?"]["I await your proposal to rescind Kentucky's laws banning assault, murder and arson.\n\nOne of government's core functions is to regulate evil. https://t.co/5cTwYts2bq"]["To my colleagues: your cowardice to act cannot be whitewashed by thoughts and prayers.\n\nNone of this ends unless we do something to stop it."]["Not again. My heart is with Las Vegas this morning. Sending prayers to the victims and their families. #LasVegas"]["Trump: No talks!\nState: We're talking!\nTrump: Rex, stop talking!\nState: Still talking!\n\nMy 5 yr old has more consistent thoughts on N Korea. https://t.co/ykVet6rlFT"]["Ummm...this is not a feud. \n\nTry again: how about \"Who Is Carmen Yulin Cruz, the Mayor Trying to Save Lives While Trump Attacks Her?\" https://t.co/Gks2MDoa35"]["Your daily reminder that THIS IS NOT NORMAL. \n\nThis time, Trump using Twitter to publicly shame &amp; undermine the Secretary of State - again. https://t.co/tUrngMYOWb"]["Congrats to all of Connecticut's blue ribbon schools! https://t.co/c0Y48OnBzL"]["Closing the book on this important fundraising quarter in just a few hours. Can I count on you chip in $3? https://t.co/6NuuEAkqcP"]["Wishing all who are observing Yom Kippur in Connecticut and around the world a peaceful holiday and an easy fast."]["I've never cared about @POTUS  golf obsession (other than the obscene $ it costs us all), but this weekend I think it matters."]["Don't ever let this become normalized. Today our President will sit in his opulent golf resort attacking hurricane first responders. https://t.co/8hOVuk3cKM"]["Taking repeated deep breaths. https://t.co/1YlSMGNVkr"]["Quick follow up/clarification: problem likely isn't capacity or willingness. It's that they didn't get the order. https://t.co/RS6KdnyE6B"]["Good. Now can we focus on the real issue at HHS - their relentless campaign to sabatoge the Affordable Care Act? Please. https://t.co/mwq8EVB1eG"]["It's worth asking why we spend $600 billion a year on the military if we can't get more than 5000 troops and 50 helicopters to Puerto Rico."]["I stopped by Fair Haven Community Health Center to talk with docs &amp; patients about why Congress needs to restore funding for CHCs https://t.co/WX0pME3imE"]["Community Health Centers are in jeopardy. If Congress doesn't act, CHCs in CT will lose $37.8M in funding &amp; 90,000 patients could lose care"]["Giving a speech next week at @amprog on insanity of Trump's threat to walk away from Iran deal. https://t.co/x3hHIPpsxA"]["This is important. https://t.co/Km4ZPEItx9"]["Where on the agenda was \"Update on Administration efforts to end insurance coverage for 30 million, cut billions from opioid treatment\"? https://t.co/4yTncv05U4"]["Data continues to show that more guns in more places do not make us safer. https://t.co/J3rHN2RgQl"]["Efforts to repeal the Affordable Care Act aren't dead, but there's an opening for us to make bipartisan progress now https://t.co/zki1W6YAIs"]["You can also donate to the Puerto Rico Hurricane Relief Network by texting UNITY to 41-444"]["If you're in the Hartford area, the Puerto Rico Hurricane Relief Network is hosting an event on Sunday https://t.co/eg85hmFAcb"]["Here Roy Moore says that the Newtown community is to blame for the Sandy Hook School massacre bc they weren't following \"God's law.\" Sick. https://t.co/Uvt1vBcPG5"]["Welcome back, friend. https://t.co/ZAmZqy1eR7"]["\"Tax cuts for the rich will pay for themselves!\"\n\n\"What? Big deficits? Oh no!\"\n\n\"Spending is too high! Cut services for poor people!\" https://t.co/6Xrz5P7COd"]["This is stunning and disgusting. If there was any doubt that Trump is trying to destroy our health care system, this is final proof. https://t.co/4pwiPuOe6d"]["Proud to see the VA in Connecticut stepping up efforts to help vets battling opioid addiction. https://t.co/tN0zAexNsE"]["Kids lose scholarships if they don't perform, get injured. CTE is ruining thousands of kids' brains. Long past time for major reform."]["And spare me the NCAA lecture on \"free education\". Big time sports schedule turns kids into full time athletes, part time students."]["College sports are a huge industry.  Everyone is getting paid - above and below the table - except the kids."]["I love college hoops, football. But it's time Congress take the exploitation of these kids seriously. https://t.co/vmbY705qlb via @ringer"]["8/ This isn't entire list of what needs to be done.  Point is to start acting boldly NOW. End the double standard of disaster relief!"]["7/ Lift cap on Medicaid funding for Puerto Rico - federal underpayments to PR weakened economy, made Maria's impact worse. Time to remedy."]["6/ Extend 26 wk limit on Disaster Unemployment benefits - entire ag economy is ruined, cities devastated. Rebuild will take more than 6 mo."]["5/ Quicken food assistance by using the Disaster SNAP program - fastest way to get nutrition to thousands of hungry kids and parents."]["4/ Dramatically expand military personnel count in Puerto Rico. Problem right now isn't money - it's man power to clear roads, rebuild, etc."]["2/ Attach supplemental relief funds to must-pass FAA reauthorization bill this week. FEMA disaster money runs out in a few weeks. Why wait?"]["1/ Expand disaster declaration for the whole island. Trump's original order only covered part - whole island needs immediate relief."]["THREAD: Freaked out about Puerto Rico? Me too. Here's a short list of what we must do right now to rescue Puerto Rico."]["8 months in. No border wall. No trickle down tax cut. No health care repeal. \n\nKEEP. IT. UP. https://t.co/DPNel9kBqt"]["File in \"Why I'm a Democrat\". https://t.co/9mLiqdO52J"]["Republicans were all for protecting people with pre-existing conditions, until they weren't. https://t.co/68vCKf0dJD"]["Food and water are not \"doing well\". In fact, the opposite. Large portions of island have no potable water. https://t.co/unxRhLgIRt"]["Mr. President, people are dying in Puerto Rico. https://t.co/YESaEViDxy"]["Going live with @Maddow at 9:15 ET to talk about the latest version of Trumpcare and why we need to do everything we can to stop it."]["No matter how many times you change it, Trumpcare is a dumpster fire. I'm headed to the Senate floor to explain why. Tune in to watch."]["Nobody believes that. Why? Because a week ago your office pulled the plug on a bipartisan healthcare negotiation that was 80% finished. https://t.co/kM6lDlgk1A"]["Saddened to hear of the passing of Rabbi Stein. He was a force for good in Bridgeport &amp; will be missed https://t.co/45Z4ikWdto"]["Trumpcare would blow a $7 billion hole in CT's budget over the next decade &amp; leave hundreds of thousands w/o care https://t.co/8w4EHNEA6B"]["Puerto Ricans are Americans and they're facing a humanitarian disaster. Congress needs to step up and provide immediate relief."]["Connecticut is answering the call for help in Puerto Rico. The federal government needs to do the same. https://t.co/BWSTIE7jNT"]["Me too. https://t.co/UJZZGIpRPE"]["Hurray! New version of Graham- Cassidy (1) sets up special deals for Louisiana, Alaska (2) targets sick people even further for rate hikes."]["\"Responsible gun owners know that gun industry profits are simply not worth putting our police &amp; families at risk.\" https://t.co/OqdKKJ4Ocw"]["He just made this up out of whole cloth. Unreal.\n\n16 states are net funding \"winners\" under #GrahamCasiddy. AK AZ ME KY are all net losers. https://t.co/67zN1uQP8e"][".@sikorsky is delivering its latest round of helicopters on cost and ahead of schedule https://t.co/dKqisYAAbV #CTmade #CTproud"]["Apple pie is not as good as everyone says. Many don't eat because it's mushy, often overcooked. Others stay away because they love America."]["Doctors, hospitals, insurers all shouting from the top of their lungs how much this bill sucks. https://t.co/FvftWT1JuM"]["Yesterday I heard from community health centers across CT about how Trumpcare would be a disaster for their patients https://t.co/g3sO5Frcvx"]["Surprise - polls show the vast majority Americans don't want Trumpcare https://t.co/WXxEcYxO7s"]["Huge news for CT jobs - a new $5.1 billion contract for electric boat will fuel more hiring and economic development https://t.co/GQ78eCWcnB"]["The plan to legalize silencers is a transparent ploy to juice the profits of gun manufacturers https://t.co/kXq1PtLA4e"]["Anna's family shouldn't have to worry about going bankrupt because of medical bills. No family should. Keep up the pressure. https://t.co/ykLXAkn1r1"]["Don't believe the hype. Don't rest. i've got 100 amendments ready to keep debate going if they call it up (not kidding). What will you do? https://t.co/nwZIEv5qXS"]["This is not normal maintenance. This is sabotage. Cold blooded. Clear. Out in the open. https://t.co/AOBVtQP1vZ"]["For those who want to donate to hurricane relief in PR, stop by Saturday's event in Hartford https://t.co/PjChezEkgE or text UNITY to 414-44"]["Yo sé muy bien que la comunidad Puertorriqueña en CT espera con ansiedad noticias de sus familiares afectados por el Huracán Maria."]["I know the Puerto Rican community in CT is anxiously awaiting news of loved ones affected by Hurricane Maria. My heart is with you."]["Let's go. #GrahamCassidyNO #KillTheBill https://t.co/wdpSMgoJJo"]["Work at @PrattandWhitney on the F-135 and Geared Turbo Fan is bringing more high-tech jobs to Connecticut https://t.co/eS4ELQy4AH"]["Seriously. This is BANANAS. \n\nYou couldn't get ALL 50 state Medicaid directors to agree any anything else in health care policy. https://t.co/mKKwbSO1dw"]["Shana Tova to all who are celebrating Rosh Hashanah in Connecticut and around the world. Best wishes for a sweet new year."]["No no no no. The choice was between finishing bipartisan health care talks or ramming this dumpster fire through. Nobody said \"do nothing.\" https://t.co/4V8ALz8BGN"]["Oh. My. God.\n\n(Commonwealth is non-partisan, respected) https://t.co/bBnocLTWxT"]["So the idea is to buy votes for Trumpcare by promising Senators that their states can keep Obamacare. \n\nIrony, meet your definition."]["Good day to repost piece from 2015 I did w @MartinHeinrich @brianschatz  https://t.co/lnmWordKNU"]["Glad that my friend Senator Sanders is joining the fight for a progressive foreign policy. Kudos! https://t.co/h6if2GtnNk"]["The outright purchasing of votes. Everyone involved in this moral and intellectual monstrosity should be ashamed of themselves. https://t.co/A5ylD4CFhZ"]["A quarter of the patients at @MidState in #Meriden are covered by Medicaid. Docs I spoke with said cuts in Trumpcare would be catastrophic https://t.co/ZzLMwIwzkg"]["First stop, the Community Health Center in #Torrington. They see thousands of patients on Medicaid who would be devastated by Trumpcare https://t.co/2xg9dZ7uxV"]["Community Health Centers are in jeopardy. If Congress doesn't act CHCs in CT will lose $37.8M in funding &amp; 90,000 patients could lose care"]["Trumpcare would be a disaster for Connecticut - over the next 10 years our state would lose $15 billion in federal funding"]["Visiting community health centers across Connecticut today to sound the alarm about the latest version of Trumpcare."]["Every single health care group is begging Republicans not to do this\n\nDoctors\nHospitals\nInsurers\nPatient groups\n\nUnanimous decision"]["ACA money doesn't go to state governments. It's attached to individuals. \"State flexibility\" robs patients to give money to politicians."]["New Trumpcare \"state flexibility\" = stealing money that now goes to patients and giving it to state politicians to spend instead."]["Let's be clear. This bill takes money that now goes to consumers, cuts total amount by billions, gives remainder to states instead. GREAT! https://t.co/P3i4SWnVvP"]["This is a lie. A horrible knowing fabrication. The bill is intentionally constructed to force states to drop this protection. https://t.co/t6z2bckyN5"]["The latest version of Trumpcare is the meanest one yet. Let me explain why. https://t.co/VGkl8uUD8r"]["6/ #GrahamCassidy FORCES states to drop preexisting condition protection. Not a matter of opinion.  Incontrovertible fact."]["5/ Every insurance expert knows this.  Which is why virtually every previous version of Trumpcare included some form on mandate."]["4/ Risk pools would get sicker and sicker - insurers will flee. Thus, states will HAVE to allow insurers to price based on medical history."]["3/ Without mandate, consumers in states w preexisting condition protection would logically wait to buy insurance until they get sick."]["2/ Bill gives \"option\" to states to charge sick people more. But states will HAVE to take the option bc bill has no individual mandate."]["1/ There is no \"he said/she said\" on whether new version of Trumpcare ends protections for people with preexisting conditions.  It does."]["The community in Connecticut stands ready to help. You can donate to hurricane relief efforts in Puerto Rico by texting “Unity” to 414-44"]["Comparto la misma preocupación de nuestros hermanos puertorriqueños en la Isla y en CT durante el azote de otro huracán"]["My heart goes out to all in Puerto Rico and their loved ones in CT who are bracing for the impact of Hurricane Maria https://t.co/wmdf4tnDMK"]["Bill Cassidy is a friend. But this is not true (CBO will confirm it) and it's so disappointing proponents are now just making things up. https://t.co/76GkNJ4dXQ"]["I watch ALOT of baseball and I can't remember the last time I saw a successful sacrifice bunt. Nobody can bunt well, fielders are too quick. https://t.co/ODcVZcH2sy"]["The idea that the White House doesn't know how insurance works is so freaking fantastic. https://t.co/W0xWkkryt0"]["Republican Govs from Ohio, Nevada, Alaska, Vermont, Massachusetts come out against new #TRUMPCARE bill. Big news."]["It is! https://t.co/7OOwpy4mFo"]["The ability to discriminate against people with pre-existing conditions is back in full force under #GrahamCassidy https://t.co/DpFvHQTGj9"]["Years from now, when your child is denied health care bc of his illness and you are facing bankruptcy, you'll regret being silent this week."]["I'm working to across the aisle to get the government to #BuyAmerican. I'm hopeful that we can get this done. https://t.co/GXlsLULiTe"]["Taking the late shift - heading to the floor now to talk about how #GrahamCassidy will be a disaster for Connecticut. Tune in to watch soon"]["What's going on with #GrahamCassidy? @CoryBooker and I are breaking it down now on Facebook live https://t.co/1cdwrtC3On"]["Yup. Because it's a car wreck of a bill and if we focus on politics only, no one will know before it's too late. https://t.co/JDvHOkjtUi"]["Just take this slice of the pending atrocity: Republicans are thinking about ending Medicaid as we know it without a CBO score."]["Put a fork in this, @SenateMajLdr. We can't blindly vote to radically reorder 1/5 of the America economy without a CBO score. Right? Right? https://t.co/eUMIktnbSo"]["If you're a Republican who says you're concerned w potential Medicaid cuts &amp; u vote for #GrahamCassidy, you've been lying. It GUTS Medicaid."]["7/ Bottom line: #GrahamCassidy, written in secret, hurts millions, makes every problem in the health care system worse not better."]["6/ Even if states wanted to keep preexisting condition protections, they can't bc #GrahamCassidy gets rid of individual mandate."]["5/ Massive funding cuts to states. $4 billion to my little state of CT by 10 year mark. States will either slash programs or raise taxes."]["4/ Premiums go up for everyone. 20% in first year alone. Gets way worse after that if you are 50+ or making under 400% of poverty."]["3/ Medicaid expansion vanishes. Millions will lose insurance, including loads of disabled and children. Many will die without care."]["2/ Lifetime caps, annual caps, charging older people more - the greatest hits of Trumpcare - all back again in #GrahamCassidy"]["1/ #GrahamCassidy eliminates protections for people who are or ever have been sick. GONE. Insurers back to denying coverage for the sick."]["Preach. https://t.co/J0HLwXGarp"]["This is happening. Drop what you are doing to start calling, start showing up, start descending on DC. Game on. https://t.co/WrNVAhXTcJ"]["If you read nothing else but this today... https://t.co/NqXj7mCQlW"]["\"Taunting and mocking\" is now part of our nation's official North Korea policy. God save us. https://t.co/ElkRsaBD1a"]["Yes! \n\nWant to know more about #FightBackCT? https://t.co/RQzJvu3Ze6 https://t.co/mugK9RQr5k"]["Dear White House, READ THE AGREEMENT. It already allows each country to set their own terms of compliance. So we good? Back in? https://t.co/jKwKWsrz9F"]["I'm getting feedback on how we can reform and strengthen the National Flood Insurance Program"]["We learned some big lessons in the wake of Superstorm Sandy. As the country recovers from Harvey &amp; Irma, it's important we implement them"]["Sat down with mayors, insurance agents, realtors, &amp; resiliency experts in #WestHaven to talk about flood insurance https://t.co/pjySIwbAXq"]["Thanks to everyone who came out to join me for Congress on Your Hike this afternoon in Orange! https://t.co/qhtOBVg4g7"]["Consumers are paying the price for Trump's sabotage of the ACA https://t.co/emA0rTBg8v"]["The DeLauro Family Table statue in Wooster Square park. RIP Luisa DeLauro. https://t.co/r34unMDwQy"]["I've been working to improve our #BuyAmerican laws for over a decade: https://t.co/GaenDO5p8I. I'm hopeful we can work together on this. https://t.co/AiFqVGB9u9"]["Want to get outside tomorrow? Join me tomorrow at noon at Racebook Tract in Orange for a Congress on Your Hike https://t.co/BmPCtJw8DD"]["CT employs thousands of engineers working on undersea technology &amp; this field will only expand in the coming years https://t.co/lJLNK1oUl4"]["Great spending time with @UConnEngineer students talking about innovative programs in undersea &amp; aerospace engineering https://t.co/cqigSmFPp0"]["My bill will help ensure that when we spend taxpayer money, we're supporting American companies and American jobs."]["ACA repeal couldn't pass w 50 vote rule. For your unpopular, hurtful agenda, you should prob be pushing for like a 20 or 25 vote threshold. https://t.co/JEOVRYSqMo"]["Research is critical to making good policy. Cutting #gunviolence research does not make us smarter or safer. https://t.co/MKIhg0TM42"]["Good to see the administration taking action. Last Congress I intro'd Casey's Law to help prevent future crimes. https://t.co/XXKoChcxLf"]["My latest bipartisan effort with @SenToddYoung to hold Saudis accountable for humanitarian crisis in Yemen.  https://t.co/JVBqxqF11g"]["Open Enrollment is just around the corner and @AccessHealthCT is opening 10 new enrollment centers across the state https://t.co/Tk0RCtLhON"]["Russia just bought DC radio station to spread propaganda 24/7 in our Capitol. But State Dept is downsizing by 10b. https://t.co/4NyUkuwFcD"]["So bizarre that in time of international crisis, the only agency plotting massive downsizing is the one that protects our interest abroad. https://t.co/fskysoYQnG"]["Today I intro'd an amendment to the #NDAA with @SenStabenow to close major #BuyAmerican loopholes &amp; support US manufacturers. https://t.co/AcYqQSsNz7"]["Students who were defrauded by for-profit colleges continue to be hung out to dry by the Department of Education. https://t.co/1qzs6cNxpm"]["Heading to the floor to talk about Sen. Paul's amendment on the #AUMF. Tune in to C-SPAN to watch around 11:35"]["6/ Bottom line: decertifying Iran deal could lead to BOTH Iran and North Korea getting ICBM mounted nuclear weapons. A catastrophe."]["5/ Oh, and backing away from Iran deal would set off a nuclear arms race in Middle East. Not a problem we need now."]["4/ Any hope of a deal with North Korea vanishes if we back out of Iran deal.  No one would trust that we would stay in the deal we signed."]["3/ Backing out of Iran deal would blow up international anti-proliferation coalition, making it harder to rally world against North Korea."]["2/ Talk is that Trump will decertify Iran deal allowing Congress to pass new sanctions. That would put Iran back on path to nuclear weapons."]["1/ Backing out of the Iran deal now would effectively end any hope of achieving a diplomatic solution to the North Korea nuclear crisis. https://t.co/tvAt7qEYdP"]["The best way to kill the ACA is to make sure people don't know it exists. That's Trump's current sabotage technique. https://t.co/oMQYmnMTeO"]["Great thread, Ben. Give it a read. https://t.co/HXRjEc5vzX"]["A heartbreaking look at one week inside the opioid crisis. https://t.co/RSTJI7MFF5"]["\"Could you get me a selfie with Cory Booker?\" https://t.co/PiIevpLOF6"]["In 1933 Luisa DeLauro penned a plea for more women to enter politics: \"Come on, girls. Let's make ourselves heard!\" https://t.co/G2ddWpjU6l"]["Never forget the heroes, the smoke and ash, those left behind, the feeling that day that no affiliation matters more than American."]["Glad we were able to help preserve funding for this critical job training program for older Americans https://t.co/SbCNcB7Xyn"]["Trump sides w Schumer/Pelosi once, world forgets he aligns w hardline GOP on immigration, climate, healthcare, taxes, spending etc etc"]["Important for CT DREAMers - if your DACA renewal is set to expire before 3/5/18, you MUST renew before October 5. https://t.co/ZleUPQb1Mx"]["My heart is with all of the families who gathered yesterday at Sherwood Island to remember loved ones lost on 9/11 https://t.co/ToUxdLGD9l"]["The Students Before Profits Act strengthens oversight and holds for-profit colleges accountable to students"]["It's not right that for-profit college execs lined their pockets while defrauding students, leaving them with mountains of debt"]["Today I reintro'd the Students Before Profits Act to help crack down on deceptive for-profit colleges https://t.co/qCe6cGTxQL"]["My thoughts are with all who are in the path of Hurricane Irma. Now is the time for us to take care of one another https://t.co/JcYo2F5g3Q"]["Attention CT college students - did you know you're eligible for free bus and train rides? https://t.co/mewMp15Sqz"]["Trump wanted to eliminate this program, which provides work-based job training for nearly 500 seniors in Connecticut."]["Big win in the approps committee today - my proposal to restore funding for the Senior Community Service Employment Program passed"]["Yesterday marked the start of our bipartisan health care hearings to help strengthen the Affordable Care Act https://t.co/wd82HQDwmT"]["I know from #WalkCT, more sidewalks would help improve safety and encourage the use of public transportation. https://t.co/Cg2BqhqEsY"]["Father Conway's heroism merits the Navy Cross. I'm going to continue working w Waterbury vets to push for this honor https://t.co/WKHcG1X2yY"]["Fentanyl is claiming lives in CT and across the country. The administration needs to step up to address this crisis https://t.co/YcbIztk70S"]["Proud to see @AGJepsen and Connecticut standing up for DREAMers and working to #DefendDACA https://t.co/zNHobdpEV6"]["Cheers to CT's beer industry, which contributed more than $1 billion to our state economy last year. https://t.co/x8fUhKEJdw"]["Agree. @Bradley_Airport TSA folks are awesome. https://t.co/R6A8NxdVGY"]["I count about 40 Senators (Rs and Ds) in this off the record coffee w state insurance commissioners. Good sign for bipartisan reform."]["As a Health Committee member, I'm thrilled we are finally in a bipartisan process. Starts today.  https://t.co/0cNxWhH8CE"]["Who are the DREAMers registered under #DACA? Most of them came here before age 6 and 91% of them are employed. https://t.co/Ez5qnqsmSG"]["To every Dreamer in Connecticut: this is a scary day, I know. But I will give every ounce of effort I have to fight for a way forward."]["Marched in the Newtown Labor Day parade this morning. One of my favorite end of summer traditions https://t.co/Go8IoTqr7d"]["No, we are not. Those counties include China, Mexico, India, Germany, Saudi Arabia.\n\nI'm fine with threats. Just make them plausible. https://t.co/1sOIJoTRcU"]["Dear Republicans, your moment has come. Every Democrat will join you. Show the courage and grace to save these children, and our nation. https://t.co/M8bGZqpYmT"]["We're looking for our newest class of #FightBackCT organizing fellows. Learn more &amp; apply at https://t.co/mvDU1c830J https://t.co/kDdkHpRfx0"]["HUSKY B provides health care for 17,000 kids in CT. I'll be pushing for its renewal when Congress returns next week. https://t.co/sC26RWzD0B"]["Technically I didn't witness my 5 yr old put on this costume, so I could plausibly be driving around Spider-Man. https://t.co/fwn9uv8LNR"]["Awesome job - @sikorsky and Teamsters local 1150 raised $90k for Connecticut veterans organizations. https://t.co/Q0Qk1ySW95"]["Foreign policy, unhinged. Find me one expert whose advice on how to deal with North Korea is \"Pick a fight with South Korea\". https://t.co/oQDi8U8cAV"]["No matter what happens, I am going to keep fighting to #defendDACA and to protect DREAMers in Connecticut https://t.co/6oQW8PZ247"]["If you're in Bolton today check out @LutzMuseum farm day at Fish Family Farm. Hay rides, barn tours &amp; ice cream! https://t.co/FJgXy5a194"]["Looking for something fun to do in Connecticut this Labor Day weekend? I have a few ideas. https://t.co/k0H7XfIUK2"]["It's too bad Ryan doesn't have the power to back up his rhetoric with legislation to protect the Dreamers from Trump.\n\nNo...wait.... https://t.co/9pOsbNW0XD"]["What am I up to in Connecticut today? Check out my Snapchat to find out. https://t.co/3gpHA9hzbC"]["Way too late for redemption. These AGs purposely poked the hornets nest, now they're running away as all hell breaks loose. https://t.co/3aBgQuPUd1"]["I've worked to bring millions in manufacturing job training investments to CT. Programs like the one at @QVCC show these grants in action."]["Stopped by the Advanced Manufacturing Technology Center at @QVCC this afternoon to meet with students and faculty https://t.co/bwlEYfdEiq"]["My goals for when Congress is back in session - bipartisan action to improve insurance markets and combat the opioid crisis"]["Talked with doctors and advocates at @lmhospital about what comes next on health care https://t.co/9GS7CL6Tr6"]["I'm proud to sponsor the College for All Act which would eliminate tuition/fees for students from families earning less than $125,000 per yr"]["Sat down with students and faculty at @SCSUtweet this morning to talk about how we can work to lower the cost of college"]["I'm speaking out on International Overdose Awareness Day and I am going to keep fighting for better access to treatment &amp; prevention"]["The opioid epidemic has devastated Connecticut and we are on pace to lose more than 1,000 people to overdoses this year. https://t.co/v3l5zwTyo5"]["S\nA\nB\nO\nT\nA\nG\nE https://t.co/3QNvBEvnE6"]["This is the most unbelievable thing you will read today. \n\n\"Anyway - press on.\" https://t.co/PRbZQADrDB"]["With the Farm Bill on the horizon, I want to make sure it addresses the needs of Connecticut's small farmers"]["Great to have @SecretarySonny with us in Connecticut today to hear from local farmers and producers at Prides Corner Farms in Lebanon https://t.co/FLk4morHjf"]["My new bill would establish a centralized online hub to increase #BuyAmerican compliance and transparency to help U.S. manufacturers."]["Stopped by Dymotek in Ellington for a tour and a conversation with employees about my https://t.co/qlBqEOXgHg Act https://t.co/ojcRPfb9gq"]["This is truly terrible. As @POTUS keeps getting publicly contradicted by his national security team, American power vanishes. https://t.co/5uVJUe815L"][".@NBCConnecticut and @GoYardGoats are teaming up to support Hurricane Harvey relief at tonight's game: https://t.co/bjFIsnA84K"]["The intentional dismantling of American diplomatic power is as big a story as exists today. Pay attention.  https://t.co/gjqe57CdUq"]["Must-read editorial from @HartfordCourant. I'm going to keep doing everything in my power to fight the opioid crisis https://t.co/P1Bmpfzhvy"]["Bar is high, but this is perhaps the most dangerous, irresponsible tweet of his entire Presidency. Millions of lives at stake - not a game. https://t.co/NSlGIIyXCb"]["6/ Result will be fraud, tuition, student debt, and investor returns go UP.  Quality goes DOWN. That is current trajectory of DeVos legacy."]["5/ Dept of Ed is turning into a simple pass through agent for federal education aid to get as quickly as possible to Wall Street investors."]["4/ Signal to her for-profit ed crowd that they can restart biz model of monetizing Pell grants/Stafford loans into big investor returns."]["3/ Now DeVos puts a person in charge of for-profit college fraud a guy who worked for one of the biggest for-profit scammers, DeVry."]["2/ DeVos's 1st proposal is to send federal elementary/secondary funding to private schools...the for-profit ones run by her friends."]["Follow what's going on at the Dept of Education. 1/ Betsy DeVos takes over.  Her family and friends made lots of $ in for-profit education."]["This is a joke, right? Basically akin to nominating influenza to be the Surgeon General. https://t.co/dxyznIfgZz"]["Welcome back Hartford students! Kids at MLK Jr. School got a warm welcome and high fives from Calling All Brothers this morning. https://t.co/lcPQaKNLbx"]["The opioid epidemic is ravaging our state &amp; it's not slowing down. I'm going to keep doing everything I can to help stem this tide. https://t.co/7y61AMaYHe"]["Bad Sons Brewing is a perfect example of turning old factory space into a new small business. Great visiting them last week! https://t.co/45FRdlrAWk"]["Heard directly from homeowners last week as we work to find solutions for crumbling foundations. https://t.co/eyYgAVVE7a"]["Got 10 minutes? Read my thoughts on how Trump can right the ship on North Korea policy.  https://t.co/cqLCVvLzKf"]["#BuyAmerican waivers are being abused. My new bill would help ensure that taxpayer money is spent on American-made products. https://t.co/FK6k8hwi6a"]["Waiting to fund disasters until they happen invites this nonsense. We need a pre-funded account - automatically accessed when disaster hits. https://t.co/U0mVDd5SIe"]["A abundance of big hearts in Connecticut.  Thanks to all who are coming to Texas's rescue. https://t.co/XAP18amqC6 via @newstimes"]["Despite threats from the Trump administration, I'm going to keep working to preserve and protect Long Island Sound. https://t.co/hpWa4FmnhT"]["Thank you to all the veterans who came to talk with me about #PTSD and #mentalhealth in Danbury on Friday. https://t.co/ZaIMjWK19r"]["Here's how you can help those struggling with the aftermath of Hurricane Harvey. https://t.co/aTBLyvByo7"]["My thanks to all the heroes in Texas right now. A long night ahead. https://t.co/Xf5nWxrehX"]["My god. At this exact moment people are dying in the worst natural disaster of his Presidency &amp; instead of leading he's attacking Democrats. https://t.co/KCenUeRDW4"]["The Arpaio pardon is basically a big middle finger to America. A loud, proud declaration that this Administration supports racism."]["I've been pushing @USDA to provide greater assistance to our dairy farmers and to support small farms in Connecticut"]["Stopped by Freund’s Farm in East Canaan to talk with dairy farmers about how I can help them in Washington. https://t.co/EiG2Xc4Nsx"]["Earlier this week I talked with @AlanChartock on @WAMCRoundtable about #WalkCT, health care &amp; more. Listen: https://t.co/GdHPKmH9Kx"]["Too many of our servicemembers struggle with mental health when they return home. I want to ensure they get the care they need &amp; deserve."]["Sat down with veterans and their families in Danbury to hear firsthand about their efforts to get treatment for PTSD https://t.co/6vU9YcyuQg"]["The https://t.co/qlBqEOXgHg Act will establish a centralized hub to help ensure fed agencies prioritizes the purchase of American-made goods"]["Over the last decade, the Dept. of Defense has spent almost $200 billion on goods made by foreign companies instead of here in the U.S."]["Today I unveiled a new bill - the https://t.co/qlBqEOXgHg Act - to improve transparency and strengthen our #BuyAmerican laws https://t.co/zpyKgGft5C"]["Proud to welcome Connecticut's newest U.S. citizens as part of a naturalization ceremony today in New Haven. https://t.co/mCjEYVh3oZ"]["Starting the day with a pancake breakfast in #Hamden honoring @WeCheckmate as my Innovator of the Month. https://t.co/M7vjLM8ONf"]["I helped owners Bill &amp; Mark get the permits they needed to turn this former 105 yr old factory into a great neighborhood brewery"]["Great stopping by BAD SONS Beer Co. in Derby for a tour, a flight of beer and snacks from @thedrunkalpaca https://t.co/oJOgI4htYK"]["There is a U.S. imprint on every civilian death in Yemen. No greater shame in U.S. foreign policy today than this. https://t.co/PdPw2PsE0N"]["My heart goes out to the Doyon family and all who are thinking of Dustin. He's a hero and a patriot. https://t.co/QSkcqU8285"]["A big thank you to Harvey &amp; his entire team at for providing the haircuts &amp; for starting an hour early to accommodate all the kids"]["I got to help kick off an afternoon of free back-to-school haircuts at Northeast Barbershop in Bridgeport     today. https://t.co/5glfyKXfoU"]["Death spiral. https://t.co/cr4RCBGqt4"]["Sat down with environmental activists &amp; local leaders in #Greenwich to discuss progress we're making to preserve &amp; protect Long Island Sound https://t.co/8o5H0Cmnxm"]["Yesterday in Tolland I heard directly from homeowners who are being impacted by crumbling foundations. https://t.co/VvUd2muUoQ"]["Great to meet the team behind @ArccosGolf today in #Stamford. I want to help startups like Arccos thrive in Connecticut. https://t.co/aqOlDZve6E"]["Busy busy today. Stops in Stamford, Greenwich, Fairfield, Bridgeport, Derby, Bristol."]["Hit the Yard Goats game tonight with my friend @MayorBronin. 8-4 loss but what an amazing stadium. Another sell out! https://t.co/Ca6nCPXWBI"]["Rajai!!!! Born in Norwich. Played little league in Willimantic. Went to New London High. Welcome back to New England @rajai11davis! https://t.co/2P79DPZSu0"]["Today in #Tolland I talked with homeowners and state and local leaders about crumbling foundations and potential solutions we're pursuing https://t.co/CLnXzMdPaw"]["Prioritizing treating #mentalhealth in kids will help us address a number of other problems these young people are facing"]["Kids and teens who experience trauma are at greater risk for mental health issues that affect school behavior and general well-being."]["Visited @CONNCAT2012 in #NewHaven today to convene a forum on childhood trauma and PTSD in our cities. https://t.co/13h6P8Qikf"]["Kudos to the improving sock game of Hartford's political leadership. Me @RepJohnLarson @MayorBronin shown here at UConn ribbon cutting. https://t.co/Y7gGtMwZSU"]["Excited to celebrate the return of @UConn to downtown #Hartford with the grand opening of their new campus! https://t.co/DStSaBQrce"]["Want to see more from me on Snapchat? Follow me at ChrisMurphyCT or scan my snapcode https://t.co/57b1Ooypcm"]["#ICYMI, Check out my @Snapchat town hall from #WalkCT. Thanks to everyone who submitted questions! https://t.co/jirmpaS8u9"]["White House staff shuffle makes good soap opera drama. But last night is reminder that Trump is not changing no matter who is advising him."]["If you're on @Snapchat check out my #WalkCT town hall before it expires in the \"Discover\" section."]["Way to go Fairfield American! #LLWS17 https://t.co/M4gqMKHjIB"][".@CTGreenBank is a national leader in clean energy. @RepEsty and I have a bill to expand their efforts nationally. https://t.co/TjTz2rzNiw"]["Predictable: Republicans planning to cut corporate taxes by raising individual taxes. https://t.co/DJPCwPVBbD https://t.co/N7xKbe4R9B"]["The only new strategy announced tonight was that strategy will no longer be announced."]["Trump rehashed the \"U.S. pullout from Iraq created ISIS\" lie tonight. The U.S. invasion created ISIS. They just rebranded in 2013."]["You can't announce a strategy that relies on complicated diplomacy with Pakistan/India/Afghanistan when you're firing all the diplomats."]["If President Trump wants to act on #BuyAmerican, I have legislation ready to go. https://t.co/S6YEJAB9rf"]["Great piece from @SeeClickFix CEO @benberkowitz on why you should live in a small city like #NewHaven. https://t.co/OU5RbyHK16"]["My lord the Red Sox bullpen has been stinky lately."]["What an adventure we've had over the last 10 years.  Happy anniversary, Cath. https://t.co/J91yuGQQo0"]["I think the most popular thing I've done this year is reveal that I'm a Phish phan. https://t.co/3dyq4F9r2N"]["Remember, Trump was hawking birtherism - the molding agent between racists and legitimate political opposition to Obama - way before Bannon."]["Strong move. Way to go, Secretary Tillerson. https://t.co/KWZ5QzhYhH"]["I met a woman on my walk across Connecticut that installed solar on her roof and cut her electric bill in half. https://t.co/SNWeavSH7C"]["105 miles and 200,000+ steps later and my second #WalkCT is officially done. Here's my final recap: https://t.co/bIaSax6uTp"]["(a) Pershing didn't do this. \n(b) Moro rebellion had nothing to do w \"radical Islam\".\n(c) 35 years after Pershing were no less violent. https://t.co/7oaJyxfroh"]["This is a lie. Total fiction. It didn't happen. It's made up. Top to bottom. https://t.co/7oaJyxfroh"]["Wow. What a thrilling week. 110 miles. 200,000+ steps. Hundreds of amazing conversations. Here's the crowd at the finish line in Danbury. https://t.co/VqVimr2I6g"]["I'm going full Dr. Doolittle for the last half mile. Look who joined me for the home stretch. #WalkCT https://t.co/zDO6NeDgF6"]["Look what Kathleen put outside her flower shop on Bethel! #WalkCT https://t.co/sw4Nk1RBpe"]["Some nice company as I enter Bethel. \"Nothing else really matters if we don't protect the climate and voting rights,\" they tell me. #WalkCT https://t.co/KPOzeHu2ux"]["People often ask what I listen to while I'm walking. So I put together my official #WalkCT playlist on @spotify. https://t.co/DoUm3gfYRR"]["Stopped to chat w the guys st Sugar Hill Auto. \"We want some adults in Washington,\" they said. \"So would I,\" I replied. #WalkCT https://t.co/zkcTTZ0KSU"]["Last day of my walk across Connecticut. Miles 95-105. Short day. Starting here in gorgeous Newtown after last night's big town hall. https://t.co/w3oaZ7QqzC"]["Day 4 of #WalkCT felt like one extended town hall with very sore feet. Here's the full recap: https://t.co/gjKIG6nGC9"]["Giant turnout for our last #WalkCT town hall in Newtown. 500 people. This little guy asked me \"What can we do to make America more kind?\" https://t.co/DRmUJu2mMC"]["My heart skips a beat as I enter Newtown. #WalkCT https://t.co/Csz37ch7wf"]["I think she and her dog are going to get to my town hall on their paddle board before me. https://t.co/Q2SS2PhT1P"]["Feel like this is a just a town hall w really sore feet. Last 60 min over a dozen people have found me on route to walk and talk. Amazing. https://t.co/08GMnJSwDY"]["Can't make it to a town hall in person? Join my Snapchat town hall by submitting your question to the \"Senator Murphy Q&amp;A\" on Our Story https://t.co/05F7FHrxjS"]["Paul &amp; Joe had Rush Limbaugh on the radio when I walked up. Not sure they ever voted for me, but we sat for a while &amp; chatted about the VA. https://t.co/xgJnqh6hvZ"]["I met Laura. She installed solar 2 yrs ago. Already paid off and cut her electric bill in half. \"I don't know why everyone doesn't do it.\" https://t.co/UA16PbzRAc"]["Just had lunch w my interns at Patty's Pantry in Southbury. Now on to Newtown. 11 miles &amp; 24,000 steps into today's #WalkCT. 11 miles to go. https://t.co/FGst6MsBgC"]["A reminder that this isn't a Democrat vs. Republican problem. It's a President who purposely coddles Nazis and racists vs. sanity problem. https://t.co/hlmo1uCbSW"]["That was cool. All these kids who didn't know each other just happened to find me at the same time.  Impromptu town hall! #WalkCT https://t.co/iqqIgwdPqo"]["Local biz owner just pulled over when she saw me. \"What the heck is going on with this President??\" she wailed. Common sentiment as I walk."]["Not sure I should take @FOX61News following me around this morning with their \"Storm Tracker\" as a compliment...  #WalkCT https://t.co/4S18tiS48b"]["Zach Brown (not the NFL player or guy w the band) opened this repair shop earlier this year. Seems like an earnest young go getter. #WalkCT https://t.co/8YBfntKt1f"]["Getting ready to call in to @ChazandAJ to talk about #WalkCT. Listen live at 8 am"]["Mayor Mike Bergin was a Waterbury legend. He passed last week and turnout for his wake here last night was appropriately massive. https://t.co/Qx7tHk3o1i"]["Just met Sev in Waterbury. He's going to school to be an electrician but having trouble affording a degree. Wants more tuition help. #WalkCT https://t.co/6FPSy510Vh"]["Maybe u don't need to see a pic of my feet at 6am but I'm pretty proud of the tape job that's got me thru 75 miles so far. Day 4 starts now. https://t.co/L1LKeYzt9W"]["Day 3 of #WalkCT involved one giant hill, two aching legs &amp; ended with an incredible town hall. Here's the recap: https://t.co/KJeAdp1Ggq"]["My legs revolted today. But I held it together for our Waterbury town hall. Tomorrow, Waterbury to Newtown. #WalkCT https://t.co/D4KrGLe3TZ"]["FYI, after today, White House staff have effectively been folded into the white supremacy propaganda operation. Your choice - stay or go."]["Just stopped on roadside to read @POTUS remarks. I nearly threw up. An American President offering a defense of white supremicists. My god."]["The hike up Southington/Wolcott Mtn, which Rochambeau and 6000 French troops put off for a day after seeing it in 1780, is finally here. https://t.co/VAMWs1Ls63"]["Dominate issue today as I walk across CT is health care. People waited for me on roadside for hours to tell why ACA repeal would hurt them."]["By and large, people I talk to as I walk across CT don't like Trump. But they talk issues, not scandals."]["fwiw, people I talk to during #WalkCT are talking about education, health care, taxes. Not Scaramucci, Mueller, Bannon."]