["Over 360,000 Maryland households will soon get tax hikes under the new #GOPTaxScam. Other states are working to protect their residents, which is why the entire Maryland Democratic Delegation wrote to @LarryHogan to demand action now. https://t.co/yXJmQgdhV2"]["I am disgusted. If you are too, take your anger and call your Republican Members of Congress. Tell them to pass the SECURE Act now. TPS recipients need us now more than ever. https://t.co/rvya1Sbtxy"]["cc: @SecretaryZinke and @realDonaldTrump, thoughts? https://t.co/IU9p7LnVDA"]["After giving massive handouts to billionaires, the Trump Administration is now attempting to rip away health care from the most vulnerable Americans? Just when we thought this Administration couldn't go any lower, they find a way. https://t.co/AeM1TngjaK"]["Hey @SenDonnelly if you were trying to stump folks with the @NYTimes crossword you wrote this morning, I’ve got two words for you: AIR BALL! https://t.co/H1A1qRHawA"]["Is this a political favor for a Republican governor, and an attempt to protect the beaches at Mar-a-Lago? Either way, how about protecting Maryland’s beautiful coastline as well, @SecretaryZinke? https://t.co/dHKDG4i2U5"]["I guess I can take a break from my New Year’s resolution for birthday cake, right? Thanks to my wonderful staff for the warm birthday wishes and sweet treats! https://t.co/CgE0UtIKmz"]["Our fight isn’t over yet. We still need enough votes to overturn the @FCC’s order revoking #NetNeutrality. Keep calling your Members of Congress! https://t.co/vkyx7qYhPA"]["Thank you to @mdnonprofits for inviting me to speak about why the recently passed federal tax plan is bad for Maryland and will be harmful to the important mission of Maryland nonprofits. Maryland's Governor and General Assembly will need to enact a measure to limit the damage. https://t.co/9nU4rq8ciV"]["In case you were wondering how much it costs to fund CHIP vs. how much it costs to give big corporations a tax cut… https://t.co/FYjzVaXKMg"]["For Marylanders like Oscar and Jaime and the over 200,000 Salvadoran immigrants that call our country home, we must fight back against the Trump Administration’s cruel decision to deport families who have lived here legally for decades.\nhttps://t.co/M6NxfiaBcu"]["Mr. President, how is deporting legal immigrants—who have lived here for decades and played by the rules—going to make us any safer? Republicans who care about standing up for the values enshrined in the Statue of Liberty should condemn this decision and support the SECURE Act. https://t.co/mpjuONDqkh"]["Trump is now calling up the FBI and asking them to use taxpayer $$ to investigate his former political opponent? This is behavior we usually see from tin-pot dictators in banana republics, not the President of the United States. Are there no Republican statesmen left to object? https://t.co/0Z3dxEMNUt"]["Here’s another example of what a con job the #GOPTaxScam is. Instead of giving windfall tax breaks to the very wealthy and special interests, we need to invest in growing our economy and creating jobs. https://t.co/l3H3YYaz8x"]["We need to both address the current crisis &amp; invest in alternative forms of pain management—NIH is key, &amp; I support the plan to double its budget. Would be helpful if Trump stopped trying to cut the NIH budget &amp; matched his rhetoric with real resources to fight this epidemic. https://t.co/C9d89nOEo1"]["In 1973, Trump the “businessman” was sued for housing discrimination by the Nixon Administration. And now in 2018, as President, Trump wants to make it harder for communities to address patterns of racial residential segregation.\n \nShameful. I will fight this in the Senate. https://t.co/glhxyIwxOe"]["We should not be using federal law enforcement resources to lock people up for the use of marijuana. In fact, no one should be jailed for marijuana use. I strongly oppose AG Session’s decision yesterday. https://t.co/TO1aDg2utd"]["We have to ensure our kids have safe—and heated—schools. As Maryland’s voice on the Appropriations Committee, I’m fighting for increased federal funding for schools across the state. In the meantime, I sent a letter to @LarryHogan and @MayorPugh about getting heating ASAP. https://t.co/UMJFfA2Y5R"]["Listen to @AaronMMaybin—he’s right, this is unacceptable. Thank you for raising awareness and raising money on your own but we need to work out a long-term solution too. Just sent a letter to @LarryHogan and @MayorPugh about how we can work together to resolve this immediately. https://t.co/ARF9iWkDj9"]["After providing huge windfall tax breaks to big corporations, Trump is now giving a New Year's gift to Big Oil at the expense of our fishermen and coastal communities. Never thought of Big Oil and big corporations as the \"forgotten\" Americans. https://t.co/3OzcAUGTLq"]["Look who I ran into today…. two newly minted senators, @GDouglasJones and @SenTinaSmith. Great way to ring in the first week of 2018. https://t.co/PoBPZUmGzf"]["…. And sometimes you get schooled on compounds by kid geniuses. Thanks for joining me to wish @astro_ricky safe travels as he heads to the @Space_Station this March, Romanieo! https://t.co/UkBMLynUfY"]["The pain associated with losing a child to substance abuse is one that no parent should ever have to endure. It takes tremendous courage, grit, resolve, and strength to speak out. Thank you, Rick. https://t.co/kSXc5eddby"]["Welcome to the Senate, @SenTinaSmith and @GDouglasJones. Looking forward to working with you both! https://t.co/16Kyp6skre"]["Our office had the opportunity to work with Anne closely throughout the years—she’ll be missed greatly by all who knew her. Thoughts go out to her family, her friends, and the entire @SenatorCardin team. https://t.co/QrfMd61I9l"]["It’s 2018. Today 14,464 Dreamers have lost their DACA status—1,464 since Congress adjourned. In the words of the Archbishop of Baltimore, the Trump Administration needs to show mercy on our Dreamers. Let's get back to work and pass the #DreamAct now. https://t.co/43aDkVjr3U"]["Today 14,099 Dreamers have lost their DACA status—1,098 since Congress adjourned. Let's get back to work and pass the #DreamAct now, @SenateGOP."]["The Trump Administration’s plans to shutter America’s refugee offices is an attack on everything our country stands for and makes us less safe. https://t.co/fvIAlB3P1O"]["In the wise words of @Pontifex, history will indeed judge climate change deniers. https://t.co/6LWuS4sAsf"]["Today 13,856 Dreamers have lost their DACA status—854 since Congress adjourned. Let's get back to work and pass the #DreamAct now, @SenateGOP."]["As of today 13,613 Dreamers have lost their DACA status—610 since Congress adjourned. Let's get back to work and pass the #DreamAct now, @SenateGOP."]["In this season of hope, our family is reminded of the saying that \"it's better to light a candle than to curse the darkness.\" We hope you will light a candle and that the joy of this season will sustain you for the coming year. Happy holidays! https://t.co/UousTMwG1O"]["We cannot remain silent as Republicans refuse to pass the #DreamAct. Just since December 1st, 2,806 Dreamers have lost their DACA status. As GOP senators enjoy the holiday season with family, I’ll be updating them about how many more Dreamers are at risk since Congress adjourned."]["Trump gives himself and his buddies a windfall tax break before heading to Mar-a-Lago? How fitting. This is all about Trump First, not America First. https://t.co/CCjIg0YS3C"]["This is a good first step in providing the American people with a clearer picture of the Trump Administration’s relationship with Deutsche Bank and their Russian money-laundering scandal. https://t.co/A7fR6dZstE"]["Here's President Trump's check writing, whoops, I meant bill signing ceremony today. How would you like to sign a check over to yourself and your family worth $11M per year? Yes, a very big Christmas gift from Trump to himself. https://t.co/D8Cy4k8FqB"]["Republicans had MONTHS to pass a long-term budget, fund CHIP, and pass the Dream Act. But instead of focusing on real priorities, they decided windfall tax breaks for billionaires was more important. We can’t just keep kicking the can down the road. I voted NO on the CR."]["We had 48 Democrats who wanted to send the bill back to committee to close the carried interest loophole. Trump wants us to believe he couldn’t find 2 Republicans to join us? Give me a break! These guys don't keep their word on anything. https://t.co/jOy6eqWZFs"]["Just got back from voting on one of the worst pieces of legislation this country has seen in a long time. It’s sad that the greatest deliberative body in the world just prioritized a windfall giveaway to corporations and billionaires while these real priorities remain unresolved. https://t.co/MdPq2ixVUd"]["Actually, people will get even madder when they discover that millions pay more while foreign stockholders get a huge tax windfall. Out of the pockets of American middle-class families into bank accounts of wealthy foreigners... not a winning result. https://t.co/DndrvzzJYE"]["Today the House GOP passed a massive handout to multinational corporations—leaving everyone else to pick up the tab one way or another. But it's not over yet. The Senate will vote tonight. Keep calling and speaking out! Senate Republicans can still do the right thing and vote NO. https://t.co/2FqacVzji1"]["As I read the fantasies and misinformation from many of my Republican colleagues about their final tax plan, I realize…. they may want to consider a second career in fiction writing."]["Under the final #GOPTaxScam, those making more than $1M a year will get an average tax cut of $70,000 in 2018 alone. Quite the stocking stuffer for Trump and his friends, bah humbug to everyone else."]["…. Unless you are one of the 8M families who makes less than $200,000 and will get a tax increase in 2018. https://t.co/xtNvDWU5vE"]["No kidding, when you borrow $$ to give big corporations a huge tax cut, their profits will go up. In fact, foreign stockholders will get a $48B windfall in 2019 while millions of middle-class Americans pay more taxes. So much for \"America First.” https://t.co/hmQVsdYnKB"]["Maryland, news! The deadline to #GetCovered is now extended until this Friday. Don’t forget to enroll, you still have a few days left. https://t.co/nSkVb6dXaN"]["Spoke to @GStephanopoulos this morning about sly last-minute additions to the Republican tax plan and how the scam is a total betrayal of Trump’s economic populist message on the campaign trail. https://t.co/FSLrV5815L"]["If Republicans are so proud of their tax bill, what’s up with the Friday night news dump? Special interest lobbyists get to review (and change it) all day before the GOP releases it on a Friday night with the intent to railroad it through Monday and Tuesday. Stop the scam! https://t.co/Z3h8rsNcfs"]["It’s time this country takes a cold hard look in the mirror and asks itself: why haven’t we taken common-sense measures to reduce the toll of gun violence in this country? Enough is enough. Inaction is complicity. #SandyHook https://t.co/n8BuIrL35b"]["Despite public outcry from throughout the country, the Trump Administration just voted to side with big corporations over the majority of American consumers. Call your Republican Members of Congress now. #NetNeutrality https://t.co/Gd9rGwxomJ"]["The GOP's big compromise is to cut the tax rate for millionaires? On top of a massive giveaway to corporations? No wonder their tax scam has an approval rating of 29%. https://t.co/z0934nHq51"]["Spoiler alert: Hope you’re ready for my Senate Secret Santa gift @SenMarkey—straight from the salty waters of the Chesapeake Bay. https://t.co/dqrS6A7DYN"]["As we learned in Alabama—every phone call and every vote counts. Keep up the energy and ask McConnell to do the right thing for the country by allowing Doug Jones to vote on their tax plan. https://t.co/tHPy7tvtw3"]["Even in this fact-free Administration, I never thought I would see the Secretary of Treasury engage in such intellectual dishonesty. Notice how not a single professional would put their name on his one-page analysis? This would make the Enron crowd blush.\nhttps://t.co/0bczECrMCq"]["Glad Grassley is speaking up—more Republicans need to. We can’t just let Trump get away with rubber stamping completely unfit judicial nominees. https://t.co/8ADLmH7H45"]["There is no reason Republicans have to rush major legislation—that will impact our entire economy—just to score a political win for their donors. https://t.co/xgzXV3DoJD"]["On @Morning_Joe I talked about Doug Jones and why McConnell must seat Jones before we vote on any tax reform plan. https://t.co/4eWYfnDxVX"]["We should be ready to make some noise if McConnell doesn’t seat Jones before we vote on tax reform. Alabamians deserve to have their voices fully heard."]["Doug Jones hasn’t even stepped foot in the Senate yet and he’s already defending the millions of vulnerable children at risk if Republicans don’t fund CHIP. https://t.co/ysKhP5htLF"]["Trump loses America wins."]["Looks like stars fell on Alabama tonight. Welcome, @GDouglasJones! We are thrilled to have a tireless fighter for equality, justice, and working people representing Alabamians in the United States Senate."]["This piece should be required reading for any of my Republican colleagues who claim that their tax plan will help working families and put America first. https://t.co/sRyxYNANSp"]["Far from the public hearing room, the AG Cttee just voted to confirm Trump’s pick for USDA General Counsel—Stephen Vaden. He has spent most of his career working on voter suppression cases and has virtually no legal experience on AG issues. Need to fight this on the Senate floor! https://t.co/UgLqfrTvu2"]["Tax scheme of the Republican fiscal hawks:\nStep 1: Pass a tax bill that blows up debt by over $1 trillion\nStep 2: Complain that the debt is too high\nStep 3: Cut Medicare, Medicaid, Social Security, and education programs\nStep 4: Pop champagne because their donors are ecstatic!"]["I’ve received over 2,000 phone calls and 7,000 letters opposing the Republican tax plan. Keep the energy up and tell your friends around the country to call their Republican Members of Congress. This fight is not over!"]["There’s only a few more days left of open enrollment, don’t forget to sign up for health care! #GetCovered https://t.co/nSkVb6dXaN"]["Enjoying today's #ArmyNavy game with my son Nick—as I did many years ago with my dad. As Marylanders, we’re rooting for the Midshipmen of Annapolis all the way. But don’t worry, we’ll go easy on the West Point Cadet fans! #GoNavy https://t.co/FFnmL4BAgo"]["Good. Keep going. Open enrollment is only until December 15th. Make sure to #GetCovered before it’s too late. https://t.co/Vzl3jWYsN7"]["Maryland, don’t forget to #GetCovered before December 15th—that’s the last day of open enrollment. https://t.co/eJ5Ih3MNmC"]["I know I’ve said this before, BUT it’s still INSANE to me that Republicans are pushing for legislation that their constituents don’t even want! All for the sake of making their donors happy. https://t.co/Xm4jbJf0bK"]["Why put innocent taxpayers—who are in the U.S. legally and continue to play by the rules—in danger? We need to pass the SECURE Act now. https://t.co/ICNPpyIvLd"]["Unconscionable and shameful that in the wake of the massacres in Las Vegas and Sutherland Springs, House Republicans voted to once again do the bidding of the NRA and allow even more guns to flow across state lines. Will do everything I can to stop this measure in the Senate. https://t.co/VHbwujdSds"]["Dear House Republicans from MD, NJ, NY, &amp; CA: If this is supposed to be a tax cut, then why is it raising taxes on our states? Congress cannot force these partisan tax increases on our constituents without your support. https://t.co/qPD0vSTS6s"]["This shouldn’t be about Democrats vs. Republicans. Repealing the state and local tax deduction means unfair double taxation no matter who you voted for. https://t.co/fs6MKyE8jR"]["Mad about this headline? Me too—tell your friends to call their Republican Members of Congress. https://t.co/Wzzmk4g47o"]["Mr. President, take a listen to the Woody Guthrie song. The lyrics are \"this land belongs to you and me\" NOT \"this land belongs to powerful special interests and oil companies.” See you in court. https://t.co/g5JYFjJsSE"]["In just a few minutes, @TimKaine, @CoryBooker, and I will rally for the #DreamAct with @FWD_us and @amprog. I’ll be live streaming it on my Facebook page, tune in: https://t.co/oalpU3Zdng"]["Congrats to one of our Hopkins physicists for being recognized for his breakthrough discovery and to @NASAGoddard for the role they played! Stories like this give me confidence that the spark of human inspiration will continue despite efforts in Washington to turn back the clock. https://t.co/7LFu4VbMiS"]["Spoke with @rachelnpr about the Republican tax heist, Dream Act, and CHIP on @MorningEdition. Take a listen: https://t.co/qEsun9NOqg"]["I’ve received over 600 phone calls, 100 letters, and 11,000 emails from Marylanders opposing the Trump Administration’s efforts to dismantle #NetNeutrality. Keep up the fight because the next two weeks are critical—I’m right here with you fighting too."]["51 Senate Republicans voted to commit one of the biggest legislative heists in history. Robbed millions of middle class Americans to give giant tax cuts to corporations—and many foreign stockholders. Their donors will clink champagne glasses while others will pick up the tab."]["It’s insane that we can’t even have the weekend to read a tax plan that’s going to impact the entire country for years to come. https://t.co/nmhzEvwqzc"]["Michael Flynn’s guilty plea today casts a dark shadow on this Administration and the Trump campaign’s actions throughout the election. My full statement ↓ https://t.co/bB7RybBZWJ"]["The best way to pay tribute to Rosa Parks is by speaking out boldly against inequality and oppression and refusing to accept, ignore, or submit to it. https://t.co/dvXma8kkL6"]["A quick update on taxes, from the catacombs of the Capitol. Hoping we can bury the #GOPTaxScam here. Keep fighting—it’s not over yet. https://t.co/LPnbk6CFFC"]["Republicans just rejected @SenatorBaldwin’s amendment to get rid of the carried interest loophole. So what about the promise Trump made in this video clip? Looks like another con job. Forgot about \"forgotten man\"—just looking out for their donors. https://t.co/RN9kM5ldaW"]["From a Republican who worked for McCain and Bush 43. This is what principled Republicans used to sound like. https://t.co/dg4XFtq1mt"]["Good morning. We’re apparently voting today on a tax bill that will have dramatic impacts for years to come. Still haven’t seen major provisions. No way to run a great country."]["Your daily reminder that repealing the individual mandate will jack up health care premiums in the individual market and result in 13 million fewer Americans having health insurance. https://t.co/pvluyHqo77"]["One of the biggest tax increases on American families in the #GOPTaxScam is the complete repeal of the deduction for state and local taxes (SALT). More than 100 million families use this deduction—including nearly half of all Maryland payers. Repealing it means double taxation."]["Headed to #PeoplesFilibuster rally—tune in, supply yourself with the facts, fight back. In that order. https://t.co/uNDkoNUfvq"]["Under the #GOPTaxScam, middle-class families who get a short-term tax cut will see it taken away when it expires in 2026. By 2027, families making less than $75,000 will be paying a total of $27 billion more in taxes to finance a permanent tax giveaway to corporations."]["It's just one giant con. https://t.co/IdYKzGLVqj"]["On the record, President Trump’s pick to head the Federal Reserve admitted that the Republican tax plan—which will explode the national debt—would make a terrible situation on the debt even worse. https://t.co/Vbd1CicEG6"]["As expected, McConnell brought the #GOPTaxScam to the floor tonight to kick off debate—we expect a vote this week, but there is still time to fight back. Tune in to supply yourself with the facts: https://t.co/bGwVBUTR1i"]["Spoke to over 9,000 @AARPMD members today about how the #GOPTaxScam will add $1.5 trillion to the national debt—eventually paving the way for huge cuts to Medicare, Social Security, Medicaid, and critical education programs. https://t.co/9cr8PFNaZI"]["It’s insane that we were just forced to vote on a motion to begin consideration of a bill that at least half of the Senate and 100% of the American public have no idea what will be in it. https://t.co/6jgmcR78CT"]["Notably, the last time Congress overhauled the tax system was in 1986—when Ronald Reagan was President. Back then, the process included bipartisan hearings with hundreds of witnesses and took over two years."]["It’s starting… Tell your friends to call their Senators. Motion to proceed is just the beginning of our battle to defeat this monstrosity. https://t.co/EqYQeeHawH"]["This headline says it all. The #GOPTaxScam gives $520B to foreign investors at the expense of middle-class Americans. https://t.co/0p8kPGuAPi"]["Gutting the foreign service will harm our national security at a time when our country needs active diplomacy to resolve conflicts peacefully. https://t.co/etfzvSEFeb"]["Can’t put deodorant on a skunk and expect it to miraculously smell like daisies. Still stinks to the high heavens. https://t.co/A7jgs3ScjV"]["Moving to a territorial system actually incentivizes companies to ship more jobs overseas, @stevenmnuchin1. This only helps multinational corporations—affiliates of an American corporation overseas—who will no longer have to pay any domestic taxes on their foreign income. https://t.co/vfna19HgBJ"]["Senate Republicans may claim that their tax proposal is good for working Americans—but don’t be fooled. Starting in 2019, their plan will raise taxes on more than 13 million middle-class families with incomes below $200,000."]["Day by day we are reminded that there is NO LIMIT to how low this President will go. And equally outrageous is Republican silence as Trump fundamentally undermines respect for America and the presidency—weakening our friends and emboldening our enemies around the world. https://t.co/HpxEaQQ0Ol"]["Good piece by @crampell about why Republicans are attempting to fast-track a tax plan. The more we learn about this, the worse it looks. https://t.co/RzqX6zxuTK"]["Like Collin, if you continue speaking out against the @AjitPaiFCC’s attempts to dismantle #NetNeutrality— we will have a shot at winning this fight. Tell your friends to call, write, and tweet to their senators. https://t.co/NKmFNc6gFu"]["I just voted NO on the Trump-Republican tax scam in the Senate Budget Committee, but it passed by one vote. As it comes before the full Senate for a vote, we must redouble our efforts to defeat it. Like the health care scam, it's likely to come down to one vote. Keep fighting! https://t.co/AmvqmRlYV5"]["Kim Jong Un’s missile test shows we need to put much more economic pressure on North Korea. The Senate Banking Committee unanimously passed the bipartisan #BRINKAct three weeks ago. I urge the full Senate to pass it without delay. https://t.co/xAR4pwO31j"]["In the Budget Committee Hearing right now… protesters are speaking out against the Republican tax scam. We’re with you in this fight, millions are counting on us to defeat it—keep it up. https://t.co/z0OHSYETHZ"]["I sat down with @genebsperling to talk about the repeal of the estate tax in the House Republican tax plan. Take look: https://t.co/V2XqZzUQlD"]["Just met with Leandra English, fellow Marylander and the rightful Acting Director of the @CFPB. Spoke about my support for her to maintain her position until Trump nominates—and the Senate confirms—a permanent Director. https://t.co/zGezIfgY33"]["Donuts aren’t going to sugar coat the fact that Mulvaney called the CFPB a \"sick, sad joke.\" He shouldn’t be the head of the CFPB right now, Leandra English should. I hope to meet with her later today. https://t.co/F5IrS7UzWU"]["Very damaging for Trump to betray our most effective and loyal allies in the battle against ISIS—the Syrian Kurds. Caving in to Erdogan is a very cowardly act. Abandoning our friends will only encourage our enemies. https://t.co/jHNPhkU2MY"]["Note to POTUS: @CFPB is very much alive (remember, they blew whistle on the Wells Fargo scam). That's why so many Wall Street banks want to kill it.  Looks like Trump’s again on the side of big banks. All that talk about the \"forgotten man\" has, well, been forgotten. https://t.co/xlCxPg9hPj"]["As we support #SmallBussinessSaturday, let's develop a tax plan that helps them, not a giveaway to big, multinational corporations that move jobs overseas. cc: @SenateGOP #ShopSmall"]["This is exactly why I’ve introduced a bill to provide security to these and other #TPS recipients who are here legally, playing by the rules, and should not have their lives put in danger. Let’s pass the SECURE Act now. #SaveTPS https://t.co/eGVbxjrkJQ"]["Congratulations to Nathan and Naomi—Maryland’s freshly minted Rhodes Scholars. And congrats to @UMBC on your first! https://t.co/Lei374v9XA"]["“The overall effect of this legislation would be to batter homeownership in general, today and in the future, while also raising taxes directly on millions of homeowners.” -@nardotrealtor on the #GOPTaxPlan"][".@SenateGOP: Stop and listen to @nardotrealtor. Do you really want to increase taxes on millions of homeowners and decrease the value of their homes? https://t.co/pIDzkKapwH"]["Just in: @nardotrealtor’s letter is a stark warning of what will happen to millions of homeowners if Republicans jam through their tax plan. https://t.co/4hsJpvbR1i https://t.co/n7fM6bcAYe"]["Thank you to @MomsRising, @SEIU, @CASAforall, @mormonweg and others for standing up for the values enshrined in the Statue of Liberty and fighting to pass the #SECUREAct—a bill I just introduced with @SenFeinstein and @SenatorCardin to protect the legal status of TPS recipients. https://t.co/O80q89moAP"]["If the House Republicans followed the rules of Truth in Advertising, this is what their bill would be called: https://t.co/0JnGq6VR4v"]["Pleased to report that today I introduced a bipartisan bill that will strengthen our partnership with farmers to protect the Chesapeake Bay, which is a national treasure and economic lifeline in Maryland. #SavetheBay\nhttps://t.co/AEYLkvi5MS"]["Don't deport thousands who have lived and worked here legally to dangerous places! Tomorrow, I’ll introduce the SECURE Act to protect individuals who fall under Temporary Protected Status (TPS). https://t.co/evcP1L8Dan"]["My staff just delivered this letter to @RepMarkMeadows. The @freedomcaucus has always been a supporter of reducing our national debt, what happened? https://t.co/Gv3N9q3YrP"]["@CFPB The next person who fills this position must be a champion of American consumers. @realDonaldTrump—do not appoint another one of your swamp monsters to replace Cordray."]["Under Richard Cordray’s leadership, the @CFPB has tirelessly fought to make sure American consumers are protected from predatory financial schemes. https://t.co/tdfrf6MINS"]["Have you ever been invited to go out to dinner and then got stuck with the bill? That's the Republican tax plan—good meal for millionaires and you pick up tab."]["Not only would repealing the individual mandate rip health care away from millions, but it would jack up premiums by 10%. Shameful to increase both premiums and taxes on middle class while padding the pocketbooks of big corporations. https://t.co/L1KBlFTRhg"]["First, Republicans want working Americans to pay for tax cuts for big corporations and the super wealthy. And now they want to rip health care away from millions? Please sound the alarm and let R senators know that is unacceptable! https://t.co/bvpR1G7F3Q"]["On @FoxNewsSunday, I spoke about the Republican tax plan and why it’s such a bad deal for working Americans. Take a look: https://t.co/gapN1jpwRb"]["Barely any mention of Duterte’s gross human rights abuses and then Trump let Duterte steamroll American journalists? I’d say I am shocked, but Trump’s embrace of dictators and animosity towards the press isn’t new. https://t.co/7EXg0stvhX"]["More than half of President Trump’s nominees, including Alex Azar, have ties to industries they’re supposed to regulate. So much for “draining the swamp.” https://t.co/QUkcFUFTwW"][".@GlennKesslerWP actually fact-checked this and found @PaulRyan’s claim to be completely false. Even @SenateMajLdr had to admit it wasn’t true. https://t.co/7CSN8FEWkT https://t.co/AyfYpzqnIN"]["Congratulations to @NASA and @NASA_Wallops on the launch of @OrbitalATK’s #Antares rocket. Next stop: @Space_Station. Great partnerships! https://t.co/ZTRRM4lBMF"]["Since Rs supported the terrible Citizens United decision that gave corporations many of the same rights as people, then at least Rs should now allow working people to have same big tax breaks they plan to give to corporations!"]["This #VeteransDay, let’s recommit ourselves to supporting those who risk their lives in service to our nation. Stand up for veterans! https://t.co/U5NQblMHNZ"]["After months of huddling behind closed doors, @SenateGOP released their tax plan. Every American deserves to know what it means for them. https://t.co/2vRoNkeN3b"]["Finally, someone in the Trump Admin who will call their tax bill what it is. But remind Gary Cohn \"trickle down\"  crashed in the real world for everyone except folks like him. https://t.co/QUongXca8Y"]["This is so infuriating. On a phone call Tuesday, senior White House officials told us they would stay out of this decision. https://t.co/H3ydaBVTJs"]["I give this “Four-Pinocchios” as @GlennKesslerWP would say. NYT just yesterday said it would INCREASE taxes on 45% of middle-class families by 2026. https://t.co/M1ATLTwzCX"]["Pat, thank you and all your staff for your hard work on the #BRINKAct. Now let’s get the full Senate to pass it! https://t.co/SbfX9n68GK"]["….This says it all: A GOP tax plan for super-duper rich donors, not the American people. https://t.co/LNQycxMuFO"]["At a time when North Korea is accelerating its nuclear program, the #BRINKAct is the best way to get DPRK to the nuclear negotiating table."]["In memory of Otto Warmbier, the Senate Banking Committee will vote on the #BRINKAct today. https://t.co/Srs0EuOjsj"]["The #BRINKAct will send a clear message: Any banks or firms that do business with North Korea can't do business with the United States. https://t.co/uPuNT8zmba"]["Repealing the estate tax will 1.) Increase wealth inequality in America and 2.) Pad the pockets of the uber-wealthy. That’s it. https://t.co/siMmf5GQJc"]["We must end massacres like Sutherland Springs and the daily toll of gun violence. Where is the humanity of those who don't take action?"]["I hope all my colleagues who tweeted about the #TexasChurchMassacre yesterday will commit to taking action to end the carnage."]["Republicans argue that their corporate tax cuts will increase Americans jobs, but it actually encourages corporations to ship them overseas. https://t.co/qj2dwRGCsJ"]["Did Rs not learn their lesson after Trumpcare? Now they want to use their tax plan as a Trojan Horse to rip health care from millions? https://t.co/E45r5KHVxO"]["Deficit hawk who had feathers plucked:\nThere’s a \"crushing burden\" of debt. –Ryan, 2011\nLet’s add $1.5 trillion to the debt. –Ryan, 2017 https://t.co/ucR6mkktaE"]["In what world does solving the student debt crisis include making it harder for student to pay off their loans? https://t.co/iL2T0kIANn"]["Finally. Clovis shouldn’t even have been nominated in the first place. Keep speaking out against climate change deniers. https://t.co/FFirGEUFhk"]["Here’s the thing: Our tax code should be simplified. But this bill isn’t really tax reform, it’s a giveaway to the wealthy and powerful."]["6. When the debt eventually explodes, Republicans will rediscover their “deficit hawk” ways and cut Medicare, Medicaid, and Social Security."]["4. It repeals the state and local income tax deduction—double taxing hardworking Americans. 43% of Marylanders used this in 2015."]["3. If you’re a couple with an estate over $11 million you just got a tax cut—leaving everyone else to pay the bill."]["2. It’s a huge giveaway to big multinational corporations and millionaires + billionaires."]["1. After years of lecturing about a looming debt crisis, Republicans are now happy adding $1.5 trillion to the national debt."]["Read the entire Republican tax reform plan, here are my thoughts/analysis:"]["The Affordable Care Act is still the law of the land, despite Trump’s efforts to sabotage it. Find out how to sign up for coverage here: https://t.co/lpHwGp76HH"]["Glad @BrianFrosh is pushing the FAA to do the right thing. Flight noise is contributing to nearly unlivable conditions for many Marylanders. https://t.co/MVwIEQGUZv"]["Disgusting. Exactly why we need more than just “thoughts and prayers.\" Congress needs to pass @SenFeinstein’s bill to ban bump stocks now. https://t.co/WywBUxVtAr"]["Today is the first day of #OpenEnrollment! Maryland, you have until December 15th to enroll. Sign up here: https://t.co/7Ivj3NdZzg. https://t.co/cp0JnVzDKQ"]["Our thoughts are with Manhattan tonight. NYC has repeatedly shown that cowardly acts of terror will never defeat its spirit. https://t.co/5NyjD3Rgit"]["Claire, you and Joe are both fighters! Thinking of you and hoping for a speedy recovery. https://t.co/NRJQ5sVUXl"]["Congress must also act to stop Russia from interfering in our elections. The integrity of our democracy depends on it."]["Every single member of Congress—Republican and Democrat—should support legislation to prevent Trump from firing Mueller."]["The news about Manafort, Gates, and Papadopoulos underscores the importance of having Mueller as a nonpartisan, independent special counsel."]["Thanks for all you do to continue the work of Frederick Douglass today! Keeping his spirit alive is more important now than ever. https://t.co/srjKbJVrVq"]["That’s quite a chunk of money. Not sure why Trump Administration officials think they’re above taking commercial flights? https://t.co/oCQup1eaH7"]["Hmm. A firm with 2 employees, owned by a buddy of Zinke &amp; financed by Trump donor, gets $300M contract to fix PR’s electricity. Very fishy. https://t.co/48WoGky258"]["As coy as Trump and D.C. Republicans attempt to be... we now know who they’re working for and it sure as hell is not working Americans."]["The one common trend with the Republican budget: They’re doing all this to give windfall tax breaks to big corporations and the super-rich."]["It will cut $800B from affordable housing, medical research, and critical education programs that benefit your community."]["Your taxes to go up b/c the Trump plan eliminates the state &amp; local tax deduction for you—but not for corporations. https://t.co/1NpxzOFWqf"]["Your health care quality will go down and your costs up. Medicaid ↓ $1 trillion and Medicare ↓ $473B."]["Your children and grandchildren will be forced to pay off $1.5 trillion in debt."]["The Republican budget passed in the House today—here’s what that means for you:"]["Sounds more like a horror movie to be honest. https://t.co/mvHJUAueqM"]["Guess I'd l feel the same way if I worked for a President who told me that I was \"wasting my time\" on diplomacy. https://t.co/PNVqOaO6rO"]["The Kurds have been strategic allies in the fight against ISIS—abandoning them undermines our credibility and interests."]["This is an important moment for American leadership and diplomacy in the region. We need to help resolve this conflict immediately."]["Our Kurdish allies in Iraq are facing imminent hostilities, but Trump remains silent—tweeting instead about Republican infighting. https://t.co/5ETpUGzXMW"]["Headed to the @plough_shares conference to talk about Iran and North Korea in the time of Trump. Tune in: https://t.co/bGwVBUTR1i."]["I know there’s a lot going on, but we need to blow the whistle on the Trump Administration's schemes at the agency that oversees big banks. https://t.co/Z5lI4dpZ9E"]["Pence cast the tie-breaking vote in the Senate tonight that stripped veterans and consumers of protections against big banks. Shameful! https://t.co/BatW2RUBjO"]["@CFPB If you aren’t protecting the rights of American consumers, then who are you really working for?"]["@CFPB Even AFTER Equifax and Wells Fargo, Senate Republicans want to make it HARDER for consumers to seek justice against big financial orgs."]["PSA: In just a few hours, Senate R's may vote to overturn the @CFPB’s rule that protects your rights to go to court when big banks scam you."]["Jeff Flake is a man of principle, courage, and dignity. It was an honor to work with him to bring home @AlanPGross, and I wish him the best. https://t.co/pVUeiDtT1P"]["Looks like Trump is screening Pinocchio at the Republican caucus lunch to explain his tax reform plan. https://t.co/PyxzJwedof"]["This bipartisan bill is critical to exploring ways to honor the work of Frederick Douglass. Hope Trump signs it so we can get to work. https://t.co/qIIsQSBxeF"]["11 states are expected to run out of funding for CHIP by the end of December. Renew CHIP now @HouseGOP."]["It's shameful that Republican extremists in the House would rather play political games than fund health care for 9M children."]["There can be no keener revelation of a society's soul than the way in which it treats its children. – Nelson Mandela"]["R's concern over debt was a convenient excuse for cutting Medicare &amp; Medicaid b/c they're now happy to ↑ debt to fund tax cuts for the rich. https://t.co/xaIMOa75MD"]["The EPA can scrub away words on a website, but they can’t wash away the facts. History doesn’t look kindly on those who deny science. https://t.co/pCzzqS21Zl"]["Teddy Roosevelt would be rolling in his grave if he saw the budget Republicans are attempting to pass tonight."]["GOP budget isn’t one for the people—it does nothing to help our economy. It hits the middle class hard and is a giveaway to the uber rich."]["Remember this fact: The Republican budget cuts Medicare by $473 billion and Medicaid by over a trillion to give tax breaks to the wealthy."]["@SpeakerRyan I am all for reducing the national debt, but the Republican budget does the exact opposite."]["@SpeakerRyan Apparently, Republicans said they cared about the debt as cover to cut Medicare and critical education programs."]["@SpeakerRyan So why now are the so-called “budget hawks” attempting to push through a budget that adds $1.5 trillion to the national debt?"]["@SpeakerRyan Ryan would repeatedly refer to the “crushing burden of debt.” In fact, he mentioned it 12 times in that one document."]["It seems like just yesterday, @SpeakerRyan was talking about his “Path to Prosperity.”"]["I’ve worked on many budgets in Congress, but I’ve never seen one as harmful to our country as the one Republicans are trying to pass today."]["The bipartisan @NatlGovsAssoc opposes it, and I urge my colleagues to support my amendment with @SenatorCantwell to protect this deduction."]["But don’t take my word for it: see how you’ll be impacted if we repeal the state and local tax deduction → https://t.co/1NpxzOFWqf"]["Almost half of all MDers use the state and local tax deduction—nearly 1.3M in 2015. This will ↑ taxes for millions of working families."]["The GOP budget and tax plan socks it to working Americans in many ways. One of the biggest is eliminating the state and local tax deduction."]["So much for what was dubbed the \"The Mnuchin Rule.\" Guess he has a new rule now—tax cuts for the wealthy at the expense of everyone else."]["\"There will be no absolute tax cuts for the upper class.” –Steven Mnuchin, 11/30/16 https://t.co/fH3TlM3jGg"]["Heartbreaking. No community should live in fear—we must do better to reduce gun violence in Maryland and across the country. https://t.co/lpYROUpZbQ"]["Everyone needs to pay attention to the disastrous GOP budget. I’m headed to the floor to speak about it. Tune in → https://t.co/XRZA5ylp8M."]["This is an important step towards justice—but our job isn’t done until our country mobilizes against hate in all its ugly forms. https://t.co/WtXntTQ2DI"]["Woah. @NASA is always bringing new discoveries. Very cool, @NASAGoddard and @NASAHubble scientists just helped spark a new era in astronomy. https://t.co/3n0TYIXs5c"]["Let every senator know: We cannot leave them behind!"]["If Congressional Republicans don't reauthorize the program, they will start denying critical care to some of our country’s most vulnerable."]["Instead of focusing on renewing CHIP, Republicans spent all of September waging their war against the Affordable Care Act."]["CHIP isn’t a controversial program. In 1997, D's and R' s worked together to ensure that the kids of the working poor would receive care."]["CHIP currently provides health insurance for over 9M low-income children, including more than 142,300 kids in Maryland."]["Let’s talk about the Children’s Health Insurance Program, commonly known as CHIP. https://t.co/FxhPqCgKbw"]["Great news. Tina, you are a fighter and Maryland stands with you! https://t.co/hhgKFr4O5v"]["Trump's reckless decisions have dangerous consequences. He is putting America's security, and American lives, at risk."]["This ↑ the likelihood that Iran will restart its nuclear weapons program and ↓ the chances of a diplomatic solution with North Korea."]["That’s why Trump’s own Secretary of Defense urged him to certify the Iran deal. https://t.co/uFEWbDjsRq"]["Trump is manufacturing a nuclear crisis with Iran when the U.S. is already facing a nuclear crisis with North Korea."]["Make no mistake: Trump’s decertification of the Iran deal is based on political grudges, not national security. https://t.co/S8KcuU1ZxT"]["No, seriously. You need to watch this now. Just like Baltimore, this choir's spirit is filled with hope, inspiration, and compassion. https://t.co/atYeK4E6k5"]["With all the negative news, this is just what I needed today. Thank you to the wonderful students from Baltimore’s Cardinal Shehan School. https://t.co/QjCNQcaK20"]["This move is pure malice. Calculated to inflict pain and collapse the ACA insurance exchanges. Sickening. https://t.co/43ibCeC4tb"]["As we celebrate #NationalFarmersDay, we must fight to expand broadband access to Maryland’s farmers and rural communities. https://t.co/c1igq4z7gi"]["Maryland’s farmers are the backbone of our state’s booming agricultural community. Happy #NationalFarmersDay! https://t.co/I9XzaJEHgy"]["Trump couldn't repeal the ACA through a democratic process—so now he's abusing his authority through sabotage. Another reason to fight 24/7! https://t.co/Z3IVTG5CL0"]["He will blame everyone but himself! Shameful that Trump is risking the lives of Americans simply to undo what Obama accomplished."]["With his Executive Order, Trump will destabilize the market. Then when it crashes, guess what? He won’t take responsibly."]["@HHSGov Our fellow Americans need proper funding, expertise, and support to ensure that they can access the health care they need. #PuertoRicoRelief"]["Our fellow Americans in Puerto Rico must not be forgotten. We must do more. Visits mean nothing without proper emergency relief."]["People are dying in Puerto Rico. Several weeks after Maria, most of the population STILL lack access to power, clean water, and food. https://t.co/76y3XWZMCq"]["Baltimore has a history of producing “geniuses” like Joyce Scott and @tanehisicoates. Excited to see the great work Greg will accomplish. https://t.co/UoK9YPcJBs"]["Great news! Congratulations to Maryland’s newly minted MacArthur Fellow, labor activist Greg Asbed. https://t.co/Y4c9KtWbtX"]["Even Mattis says the Iran deal is in our best interest. Instead, Trump is attempting to harm our country and increase the risk of war."]["We already face a real crisis w/N. Korea. Now—in a spat of reckless political petulance, Trump plans to create a crisis w/Iran? Just nuts! https://t.co/vQpk0sZPjr"]["@KamalaHarris So now tell me, @SenateGOP: Who does this budget actually help? Because the facts are pretty clear to anyone who reads the bill."]["@KamalaHarris The GOP budget cuts Medicaid by $1 trillion and Medicare by $473 billion to pay for (yup, you guessed it!) tax cuts for the wealthy."]["@KamalaHarris The GOP budget repeals the state &amp; local income tax deduction. That would INCREASE taxes for millions of working people across the country."]["@KamalaHarris The GOP budget eliminates the estate tax which helps only the top two-tenths of 1% of estates but adds $240B to our debt."]["The GOP says their budget will help the middle-class, but they voted AGAINST an amendment I introduced with @KamalaHarris to guarantee that."]["Republicans are quick to pay lip service when it comes to helping working families—but their budget does the exact opposite."]["We need to grow the rural economies across the country—one way to do that is to expand broadband access, but it must be reliable. https://t.co/Uv24hlcMAL"]["While the White House has become an adult day care center—the EPA has turned over the keys to lobbyists, swamp monsters and climate deniers. https://t.co/cdGpOsq5G4"]["When Trump said he would support the Dreamer deal, some said \"trust, but verify.\" My view has been: \"don't trust, but verify.\" Here's why: https://t.co/Lz7f46fNSG"]["I'm seriously concerned that the Republican budget will pass if we don't put the same energy into defeating it as we did with Trumpcare."]["Here’s my take: The Republican budget needs to be getting more attention. Read the fine print—it’s worse than Trumpcare."]["Congrats Leslie, you make Maryland and @TowsonU proud. Maryland has a tradition of great poets—like Edgar Allan Poe. Rooting for you! https://t.co/XGRPvKdQAF"]["@SenFeinstein We should pay tribute to the victims of Las Vegas and gun violence not only by mourning but also by action to reduce the future death toll."]["@SenFeinstein Some try to trivialize efforts to reduce gun violence by calling it \"political.\" Most Americans call it common sense."]["@SenFeinstein Let’s work together to expand universal background checks to make sure that guns don’t fall into the hands of dangerous people."]["For example, let's pass @SenFeinstein’s bill to ban bump stocks &amp; close the loophole that lets semi-automatic guns function as machine guns."]["And there are common sense solutions we can take to reduce the carnage of gun violence."]["Of course, we can’t prevent all acts of evil—but we were sent to Congress to pass the best laws we can to protect Americans."]["Those who try to stifle debate about how to reduce gun violence are not honoring the victims. They are guaranteeing more victims."]["@SenateDems @SenateMajLdr @SenJohnMcCain @realDonaldTrump @SenateGOP Don’t be shy about speaking out against the GOP’s awful #TaxReformPlan. Just like #Trumpcare, we cannot allow this to see the light of day."]["@SenateDems @SenateMajLdr @SenJohnMcCain Unfortunately, @realDonaldTrump and @SenateGOP’s #TaxReform proposal fails that basic test. Read why: https://t.co/cS81Ioluvw"]["@SenateDems @SenateMajLdr Third @SenateDems principle: #TaxReform should go through a normal legislative process, as @SenJohnMcCain has said."]["@SenateDems Second @SenateDems principle: #TaxReform should not add to the national debt, as @SenateMajLdr had promised."]["@SenateDems First @SenateDems principle: #TaxReform should truly help the middle class—absolutely no tax cuts for top 1%."]["Earlier this year, I joined @SenateDems in laying out clear principles for #TaxReform that will actually help working Americans."]["\"We must dissent, because America can do better, because America has no choice but to do better.\" – Thurgood Marshall"]["\"We must dissent from the apathy. We must dissent from the fear, the hatred, and the mistrust.\" – Thurgood Marshall"]["Let’s honor Marshall's landmark contributions to America by continuing his fight for racial justice and equality every single day."]["Today @BrianSchatz and I will be questioning Equifax’s CEO, but we sat down ahead of time to talk about the outrageous scandal. Take a look: https://t.co/BQfhZiWWt5"]["Really? People are dying in Puerto Rico and in dire need, yet this is what the President has to say while he pushes tax cuts for top 1%. https://t.co/C9IVLK4zYx"]["@SenatorTester After Wells Fargo &amp; Equifax, the fact that the GOP still wants to roll back consumer protections is a total surrender to special interests."]["@SenatorTester Here’s the fact check, Mr. Sloan. https://t.co/4gG0F2lVkw"]["Mr. Sloan told @SenatorTester that Wells Fargo was not applying forced arbitration to customers with fake accounts."]["Wow. Wells Fargo’s CEO, Timothy Sloan, just directly contradicted himself at today’s Banking Hearing. This scandal just got way worse. https://t.co/Bmpw43bXzn"]["Tina, all of Maryland is standing with you and wishing for a speedy recovery. https://t.co/28TxHJKSsB"]["Tune in as I question Wells Fargo’s CEO, Timothy Sloan, at today’s Banking Committee Hearing. https://t.co/5VGHwWPoGO https://t.co/ReGoqrRuKK"]["I’m begging my colleagues again: put politics aside. Prayers are not enough. The American people need us to ACT to stop gun violence NOW!"]["As we unite to grieve for the lives lost in Las Vegas, let us also unite to stop the terrible toll of gun violence in our country."]["Leadership isn't shown by unhinged tweets &amp; finger pointing—but steady courage in times of crisis. Trump should learn from @CarmenYulinCruz. https://t.co/DAP3Ljb2M0"]["Families in Maryland and across the country deserve much better, and we will fight this budget tooth and nail."]["Oh and don’t forget, growing debt will put Social Security, Medicare, and Medicaid on the GOP chopping block as well."]["GOP couldn’t be more two-faced: preach about lowering our debt, but then write a budget that is a recipe for galloping debt."]["Yeah right, GOP budget and tax plan written for working people. And I have a bridge to sell you. Written by millionaires for millionaires. https://t.co/btvl8bMFlq"]["I’m headed to the @UofMaryland to speak at the Sadat Forum about the American partisan divide. Tune in: https://t.co/9FSkqHdJEz."]["It’s good to have you back, @RepCummings. Your relentless passion and dedication to public service are just what Congress needs right now. https://t.co/Uhi0UVz7uC"]["@SenateGOP @SenateDems @POTUS It's time to recognize that ‘trickle down economics’ failed. The GOP tide lifts only the yachts, leaving other boats to run aground."]["@SenateGOP @SenateDems @POTUS This isn’t monopoly money—it ultimately means fewer resources for Social Security, Medicare, education and investments in our economy."]["@SenateGOP @SenateDems @POTUS Even worse, Republicans promised that any #TaxReform plan would be deficit neutral. But their plan adds trillions to the national debt."]["@SenateGOP @SenateDems @POTUS GOP’s #TaxReform plan was drafted in secret and is just another Trojan Horse to pad the pockets of the very wealthy and special interests."]["@SenateGOP @SenateDems Yet, @POTUS and @SenateGOP did not learn their lesson from the short-circuited process that failed them during the Trumpcare dumpster fire."]["@SenateGOP @SenateDems If Congress is serious about #TaxReform, we need a transparent process with bipartisan hearings, expert testimony, and rigorous debate."]["Both @SenateGOP and @SenateDems agree that our tax code should be reformed, there’s a lot of junk in there currently. #TaxReform"]["Let’s talk about #TaxReform. It may make your eyes glaze over, but it's a vital issue that impacts every American. So stick with me."]["The GOP #TaxReform plan is a HUGE giveaway to the uber rich. It will add trillions to our debt and hurt job growth."]["The GOP said the same about Bush tax cuts. Wasn't true then, isn't true now. #TaxReform https://t.co/0NOhFWtIKM"]["Tune in as I head to the Senate Floor to speak about our next legislative fight: Tax Reform. https://t.co/kDshXa0C20"]["GOP logic:\nEquifax tricks customers into giving up their legal rights.\nRs say: Let’s make it harder for consumers to hold firms accountable! https://t.co/AOcdoakHso"]["Republicans react to the Equifax scandal by making it HARDER for you to hold corporations accountable in court. That’s nuts! https://t.co/qC4pyjq8Pe"]["I agree, @BrianSchatz. Americans in Puerto Rico and the U.S. Virgin Islands are part of our family, they deserve the same federal resources. https://t.co/psKLOJSWNZ"]["Need answers on the Equifax scandal. Equifax’s CEO—who was in charge during the breach—must still testify at Banking Committee next week. https://t.co/UbhYTN3We1"]["Don't always agree with @SenJohnMcCain but he is a man of integrity. Listening to no-principles Trump lecture McCain should repulse us all. https://t.co/UjAy06gXo9"]["Let's honor their legacy by supporting the right of every American to protest injustice. #LittleRockNine"]["Sixty years ago today, the Little Rock Nine embodied the true American spirt by standing strong for justice in the face of adversity. https://t.co/zQZV62HSqs"]["Another CBO report tells the same Trumpcare horror story—but most Rs are still more afraid of their donors than harm to health care. https://t.co/AnjuT6P6fC"]["Joined @SenateDems to talk about #GrahamCassidy and what you can do to help defeat it. 4 days. We can do this.#ProtectOurCare https://t.co/k1wqwvnuH6"]["Slashing Medicaid that 1 in 5 women of reproductive age relies on isn’t a health care plan. #ProtectOurCare https://t.co/6I4znQ6zMA"]["Think about this fact: #GrahamCassidy forces pregnant women to choose between being with their newborn or keeping their insurance."]["Wow. Senate Republicans are now attempting to buy off senators with a bait and switch. How far will they go? https://t.co/WuloCHudpy"]["For many, the #GrahamCassidy could mean that your health insurance isn’t just more expensive, it’s completely unaffordable. #ProtectOurCare"]["My heart goes out to everyone in Puerto Rico and Mexico after facing such horrible natural disasters. To lend a hand, find resources here: https://t.co/AxSzERShoP"]["While GOP attempts to steal health care away from millions, they're also rolling back the progress we’ve made to end campus sexual assault. https://t.co/3yJfnYfJoj"]["Republicans:\nWe’re going to lower the deficit!\nJust kidding, we want to add $1.5 trillion to the deficit to give tax cuts to the rich. https://t.co/SAKShbL1Bi"]["Good to hear @SenJohnMcCain. Instead of blowing up the bipartisan discussions on health care, we need to return to regular order. https://t.co/aj7LcC7ydR"]["Isn’t this odd: Republicans say #GrahamCassidy gives states more flexibility while all 50 Medicaid directors say it'll impose more burdens? https://t.co/P4qjarY7ou"]["Children like Julian are who this fight is all about. Remember the human toll of the GOP bill, it’s what keeps us fighting 24/7. https://t.co/bEYQGaPApX"]["Really, Trump praising Erdogan, whose bodyguards beat up American protesters? Odd bromance w/authoritarians, esp. those w/Trump hotels. https://t.co/yduu38kBby"]["As we fight to #ProtectOurCare, let's continue to push to protect America’s 800,000 Dreamers. We must pass the #DreamAct."]["This is why Trump's overheated rhetoric elevates the North Korean dictator. It's playing on Kim Jong-un's turf. What will POTUS say now? https://t.co/uhOTlYYNVG"]["@POTUS @SenToomey If Chinese President Xi is also on board with sanctions as Trump claims, then China should not be afraid of the BRINK Act."]["@POTUS Now Trump should endorse the bipartisan BRINK Act that @SenToomey and I introduced to hold China and others accountable."]["This week, I’m remembering the words of Carol Hardaway: “Fight like hell because we will be fighting like hell right there with you.” https://t.co/ReJXcfNFCQ"]["Price won’t fund open enrollment marketing efforts so people know about their health care options, but he’s using taxpayer $$ to jet set?? https://t.co/O0JEdsSkt7"]["Governors across the country are speaking out against #GrahamCassidy because they know that it will totally shaft their states. https://t.co/gbkNIpxieB"]["Thank you @JimmyKimmel for correcting the record and making sure @SenateGOP knows: #GrahamCassidy doesn’t pass the Jimmy Kimmel Test. https://t.co/bYzMsDZGLp"]["@SenatorCardin This provision, within the NDAA, will help these communities get the boost they need to grow more jobs and improve their economies."]["@SenatorCardin HUBZones boost investments in towns that have lost manufacturing jobs. For communities in our state, the need to preserve them is urgent."]["Proud to announce that @SenatorCardin and I have extended HUBZone eligibility to small businesses in Western Maryland and across our state."]["We cannot go back to a time when people with pre-existing conditions were discriminated against. #ProtectOurCare https://t.co/ObIohWQCoi"]["Here's information on how you can help our friends in Puerto Rico and the U.S. Virgin Islands with recovery efforts: https://t.co/BGtxkGG0Zz"]["Wait, what? How do we have enough information on a bill if we don’t know how much it would cost and how many people would be left uninsured? https://t.co/lZaWo8yliu"]["I know this fight is hard and often feels like it will never end—but know that our voices have made a difference before and they will again!"]["Take the next 13 days to: Call, tweet, share your stories, attend rallies, write letters, and speak out to #ProtectOurCare."]["Which means we need to do everything in our power to make sure Republicans can’t pass their new #Trumpcare bill before the end of the month."]["September 30th is the last day that Republicans can use the reconciliation process to jam through a repeal bill with the 51 vote threshold."]["We must, once and for all, squash any #Trumpcare Trojan Horse. Here’s how we can defeat #GrahamCassidy:"]["@SenateGOP @SenateDems Especially important now since Trump launched a commission to suppress the vote masquerading as an \"election integrity\" group. Orwellian."]["Listening to a great panel of witnesses at hearing on voting rights right now. @SenateGOP didn't call the hearing, but glad @SenateDems did."]["If Senate Republicans won’t learn from past mistakes, maybe they should take a look at almost every single horror movie. Zombies are BAD!!"]["#Rocketman rhetoric won’t denuclearize North Korea. Trump needs to dial down the rhetoric and dial up the economic pressure on Kim Jong-un. https://t.co/n5rqpP5hK3"]["ALERT: The TrumpCare zombie bill is back from the dead—and ready to wreak havoc our health care system, economy, and lives of millions."]["Once again, patient advocacy groups speak out against the @SenateGOP’s latest efforts to dismantle our health care system. https://t.co/AFhgp9Mw2V"]["The #GrahamCassidy bill would cut federal funding significantly over the next decade. Maryland would lose over $4 billion by 2026."]["#GrahamCassidy = same old tired #Trumpcare story: Premiums will skyrocket, Medicaid is slashed, and tens of millions will lose coverage."]["Preview of the CBO report on #GrahamCassidy: https://t.co/VFKt1he90g"]["I’m headed to the floor to speak about #GrahamCassidy. Tune in: https://t.co/NjFz1fbFHq"]["@SenatorLeahy We're not going to let Erdogan’s bodyguards attack peaceful American protesters—and we’re certainly not going to sell them weapons to do it."]["We sent an important message. Glad to have worked with @SenatorLeahy on an amendment prohibiting the sale of arms to Erdogan’s bodyguards. https://t.co/ijKjeESPDF"]["I'll fight to reverse this decision which allows lobbyists to secretly fund legal defenses for WH officials. Transparency = accountability."]["Really, secretly buying favors from White House officials? This is the Washington swamp monster on steroids. https://t.co/PiiBxMXsS6"]["@SenateGOP Instead of another repeal bill cooked up behind closed doors, we need to focus on bipartisan efforts to stabilize our health care system."]["We’ve already been over this, @SenateGOP. Americans want to keep their healthcare. They want us to work together to fix, NOT sabotage."]["Unbelievable. Republicans are at it again with another effort to dismantle Americans’ health care. https://t.co/DTJMcyEG6S"]["@RepCummings We need everyone to speak up and tell @stevenmnuchin1 to put Tubman on the $20 immediately and stop this absurdity. #HarrietTubmanDay"]["@RepCummings Too often, our nation doesn't do enough to honor the contributions of women in American history—especially women of color. #HarrietTubmanDay"]["@RepCummings Tubman's courage, conviction, and commitment to equality represent the best of America and we must recognize her place in history."]["@RepCummings Born into slavery in Dorchester County, Maryland, Tubman escaped to freedom &amp; returned to rescue others as part of the Underground Railroad."]["To mark #HarrietTubmanDay, @RepCummings and I are going to tweet why it’s so absurd Mnuchin hasn’t committed to putting Tubman on the $20."]["Agreed @SenFeinstein. Glad to join @SenateDems to introduce a bill that would ensure #ChildCare4All. https://t.co/CpivIyd6dN"]["No parent should have to choose between having a job and ensuring that their children have quality care. #ChildCare4All https://t.co/n8xi4c6yo4"]["“She was not interrupted again.” That’s damn right! cc: @NancyPelosi https://t.co/qg6734EYIX"]["We stand in solidarity with all Londoners as we reaffirm our resolve to defeat these cowards. And we will not let them sow hate &amp; divide us! https://t.co/eS4LQ0nhsG"]["@UN Senate must pass the BRINK Act that @SenToomey and I introduced to cut off NK's economic lifeline and freeze, then end, its nuclear program."]["Current @UN sanctions on North Korea are clearly not doing the job. They need sharp teeth to enforce them."]["We must take decisive action to rein in DPRK’s nuclear program. https://t.co/3Gb0ISJBCr"]["Thank you for having me, @childrenshealth. Let me tell you, those treats and treasures were out of this world! https://t.co/9p5ZmzwysI"]["My favorite part of this week was visiting staff and patients at @childrenshealth and participating in the “treats and treasures” program. https://t.co/w6oYqNW6yd"]["This sham commission should be shutdown immediately—it’s a voter suppression tool pure and simple. https://t.co/Novh07CRlM"]["Heartbreaking news. Maryland stands in solidarity with our friends in Spokane County and Washington State. Enough is Enough. https://t.co/rHf7thtPzL"]["#Dreamers, please share your story using #HereToStay. As we've seen before, personal stories have the power to turn the tide in our favor. https://t.co/Lkr3xw9XFc"]["Congratulations to the talented @DrPollard_MC on receiving the @CarnegieCorp academic leadership award! Way to go. https://t.co/Yop3L2olEV"]["Way to step up and protect the 10,000 Maryland Dreamers, @BrianFrosh. Now it’s time for Congress to follow suit and pass the #DreamAct. https://t.co/vYIYTFkfOL"]["We must protect our infrastructure, conserve taxpayer dollars, safeguard businesses from flood damage, and keep communities safe."]["Yet, just weeks before #HurricaneHarvey and #HurricaneIrma, the Trump Administration turned back the effort to do just that."]["The destruction facing Texas and the Gulf Coast serves as a reminder that we must prepare our nation’s infrastructure to deal with flooding. https://t.co/U7UCluxqL2"]["On September 11, 2001 our country put our differences aside to support one another. Same with Harvey. Now, let's do the same with Irma. https://t.co/UCfQsBKCEM"]["Sanctions are only as strong as their enforcement. Congress must immediately pass the bipartisan BRINK Act to put teeth on @UN sanctions. https://t.co/IUS0fLNi9C"]["Thank you to all who are volunteering, including those at the #TogetherWeServe event in East Baltimore. It was an honor to be with you. https://t.co/0zDnFWFZxt"]["Our hearts were broken, but not our resolve. Let's honor their legacy by dedicating ourselves to working together as one nation."]["As we mark this solemn day through service, we remember the brave heroes we lost that tragic September morning."]["Today we honor the nearly 3,000 lives taken from us on September 11, 2001, including 69 of Maryland’s own. #NeverForget"]["Don't times like this make you wonder, @brianschatz: Why anyone would want to reverse the @CFPB's forced arbitration rule? cc: @GOP https://t.co/adRgIkdgx7"]["If you’ve been impacted by Equifax’s security breach, here are steps you can take to help secure your personal data: https://t.co/vTmri4PpLS"]["This is an outrageous scandal. I’m calling on the Banking Committee to hold a hearing immediately—we must get to the bottom of this issue."]["Equifax: \nYour data was leaked.\nHere, sign up for this free credit monitoring service.\nOh, btw, you just gave up your legal rights. https://t.co/yaxYhGGDZK"]["If #DACA recipients were to lose their work permits and jobs, it would cost the U.S. economy over $400B over 10 years. #HereToStay"]["Modeled after the Iran sanctions bill, passing the BRINK Act would help build pressure to achieve a denuclearized North Korea."]["Experts who testified all agree: We must do more to hold China accountable—the BRINK Act I’ve offered with @SenTommey would do just that."]["Had a Senate Banking Committee Hearing on sanctions enforcement and policy options on North Korea today."]["Today @SenateDems attended a briefing on #Charlottesville. We must all unite against hate—there’s really only one side."]["Instead of fighting against for-profit college shams, DeVos has decided to retreat from our fight against campus sexual assault—disgraceful. https://t.co/sRkGeoORtq"]["Approps amendment would prohibit proposed U.S. sale of semi-automatic pistols to arm those responsible—Erdogan's Protection Directorate."]["Last week the DC Superior Court indicted 15 of Erdogan's henchman for beating up protesters—Erdogan still refuses to take responsibility."]["Appropriations Committee just sent a strong message to Erdogan—don't use your bodyguards to beat up peaceful protesters in the US or Turkey."]["We all want safe and secure borders, but deporting Dreamers is not the way to achieve that goal. #ProtectDreamers"]["If we don’t pass the DREAM Act of 2017, it will cost Maryland’s economy over $400M a year. #HeretoStay"]["Good read from the @nytimes: “DACA is morally right, legally sound and fiscally smart policy.” #HereToStay https://t.co/MhUXqP7Izf"]["I’m headed to the Senate floor to speak about our fight for Dreamers. Tune in: https://t.co/ox5SgNFi6O"]["10,000 Maryland Dreamers know only one home—the United States of America. It’s time we fight like hell for them. Are you with me?"]["It’s time for all Republicans of good moral conscience to stand up and protect our country’s 800,000 Dreamers. #DefendDACA"]["It’s a fact that the majority of our country believes that Dreamers should stay where they belong—right here America. https://t.co/rZNsPDsK4S"]["Exactly right @JRubinBlogger. President Trump didn’t even have the guts to the job himself, so he sent Sessions to do his dirty work. https://t.co/F9vnlU1RYs"]["On a bleak day, I was pleased to start on a high note by spending time with Maryland students and educators on their first day of school. https://t.co/11zMFOSHom"]["@antonioguterres @UN Now, more than ever, we need partners to address global crises."]["Great phone call with @antonioguterres today about supporting the @UN and the need for more action on North Korea."]["My goodness, of course, Congress should act on immigration reform. But pulling the plug on Dreamers doesn’t move us towards that goal. https://t.co/V29KaXXSLs"]["A gratuitously cruel decision that will hurt our economy and won't fix any of our immigration issues. I will fight this in the Senate. https://t.co/Hozbk7PzA2"]["Enjoyed marching in the Greenbelt and Gaithersburg parades today. Happy #LaborDay, Maryland! https://t.co/m5WAkOiodE"]["This #LaborDay, let us rededicate ourselves to fight for the dignity of every worker &amp; an economy that works for all—not just the 1 percent."]["@UofMaryland The Trump Administration’s decision, to rescind DACA is taking our country backwards. For DREAMers like Acuña family, we must keep fighting!"]["@UofMaryland It’s important to go after gangs like MS-13, but it is an insult to decency and common sense for DREAMers to be targeted for deportation."]["And thanks to the DACA program, Steven just graduated from @UofMaryland and wants to be an orthopedic surgeon."]["I was proud to join forces with advocacy organizations, lawyers, and local leaders to make sure the Acuña family stayed where they belonged."]["But in 2012, they were yanked from their Germantown home and locked up in a detention center."]["For 16 years since arriving from Colombia, Steven and his family have lived and worked in this country as productive, law-abiding citizens."]["Today I think about Jorge Steven Acuña’s story. In 2001, his family came to the United States to seek political asylum. #DefendDACA https://t.co/Cm8dPBviLj"]["@RSimon18 @cammcwhirter Hope all my colleagues will join in passing bipartisan effort to renew and reform the NFIP."]["As @RSimon18 and @cammcwhirter point out in their article, NFIP needs to be reauthorized by the end of this month."]["Working on legislation to renew the NFIP while instituting reforms to address the waste, abuse, and mismanagement plaguing the system."]["In light of Harvey, this article is a stark reminder of why we must make sweeping reforms to the National Flood Insurance Program (NFIP). https://t.co/f1508FTSsx"]["@SenMarkey Congress must pass the bipartisan BRINK Act that @SenToomey and I introduced now."][".@SenMarkey I have said it before and say it again: China must get serious and cut off all oil exports to North Korea. Time is running out."]["Wells Fargo scandal is worse than we ever thought. @SenateDems have asked for a hearing in the Banking Committee—we need answers now! https://t.co/Ak43B784Xr"]["Congrats, Terps! Amazing game. #FearTheTurtle https://t.co/1YhwJcVK4n"]["More evidence that POTUS is deliberately setting fire to the ACA like a political arsonist. https://t.co/NzkZdBOlDx"]["Sending a letter to Mnuchin asking him to move forward, will let you all know when I hear back. Must hold him accountable!"]["Making this change in 2020, which is the 100th anniversary of the ratification of the 19th Amendment, sends a powerful signal."]["Tubman is a true American hero and deserves to be honored on the $20 bill."]["The Trump Administration is refusing to commit to moving forward with the plan to put Harriet Tubman on the $20 bill? Disgraceful... https://t.co/Z9xevNqHnw"]["Honestly @FTiafoe’s forehand is a phenomenon not to be missed—but his story about growing up in College Park is somehow even more inspiring. https://t.co/rVswsZEm23"]["Listen, @SenateDems want to work with @realDonaldTrump &amp; @SenateGOP if they will put working Americans—rather than special interests—first."]["If your last name is Trump, this #TaxReform plan is great for your bottom line—but it makes life worse for working families &amp; everyone else."]["Trump doesn't have a big and bold #TaxReform plan—it’s the same tired GOP \"trickle down\" proposal to provide a huge giveaway to the wealthy. https://t.co/63OL6tQoAz"]["20/20 move by @JohnsHopkins, @WarbyParker, @DrLeanaWen, and @VisiontoLearn to improve the reading proficiency gap in Baltimore. 👓 https://t.co/bx2dJhQDY1"]["Broke ground today on the Purple Line—will strengthen our economy &amp; help combat traffic and pollution while improving the lives of MDers. https://t.co/9cCQJT57Be"]["Thanks to @SecElaineChao and Team Maryland for their continued efforts to secure $900M in federal funding for the Purple Line. https://t.co/gR0egR0JC3"]["@SenMarkey Then Congress must pass the BRINK Act to send a clear message: any banks or firms that do business w/N. Korea can't do business w/USA."]["Just returned from a trip w/@SenMarkey to Japan, China, and S. Korea. China must immediately cut off oil supplies to N. Korea—no more delay. https://t.co/MASxzuKifa"]["Police don’t need grenade launchers to protect our communities. We should focus on community policing not the militarization of police. https://t.co/RCuzmxjHAW"]["Maryland stands with all those being hit by Hurricane Harvey. Here is how you, or friends you know in Texas, can show solidarity and help: https://t.co/3jXvBRh62L"]["This #WomensEqualityDay, let's recommit to fighting back against any effort by the Trump Administration to roll back women's rights. https://t.co/I3AWp1o7R4"]["Trump winked at racists after Charlottesville—now he pardons civil rights violator Joe Arpaio. I cry for our country, but we shall overcome. https://t.co/Xgpn46MOXD"]["Happy 101st Birthday, @NatlParkService! Some of my fondest memories include hiking, camping, and fishing in our national and state parks. https://t.co/ahZ7d0HxJT"]["2.7 million+ Americans spoke out during @Interior’s 60-day public comment period—a record-breaking response. Keep fighting! #KeepitPublic"]["W. Guthrie said it best: This land is your land, this land is my land. We must stop Trump before he gives away public land to oil interests. https://t.co/nShUXDns3e"]["Ending DACA = loss of $460.3B from GDP over 10 years and the removal of 685,000 workers. #DefendDACA"]["Over its 5 year history, DACA has helped nearly 800,000 young people pursue higher education, earn better wages, and buy homes. #DefendDACA"]["We must fight back—this would be a disaster for our communities and economy in Maryland. https://t.co/TcxOY207IV"]["Glad to see Fed Chair Yellen resisting Trump's attempt to enrich his pals on Wall Street while putting taxpayers and Main Street at risk. https://t.co/001CLnZVF5"]["My heart goes out to the families of Kevin, Timothy, and all of the brave sailors who sacrificed their lives in service to our country. https://t.co/bluYrvt7U0"]["Metro Safety Commission has cleared its final hurdle and states must act quickly to improve the safety of people riding the nation’s metro. https://t.co/noxizhQ40O"]["Really, threatening to shut down govt to build an ineffective wall that wastes tax dollars? Didn't he say Mexico was going to pay? https://t.co/h6KYD5kXJD"]["Women should decide their own reproductive health choices—not Trump, not their bosses, or anyone else. We must fight back. https://t.co/MCFNc1OjlP"]["These reports raise serious concerns about Kushner properties. Our letter must be answered for the health and safety of Marylanders. https://t.co/EVb8xHePWe"]["I call on all Americans—regardless of their political stripes—to come together as patriots to denounce hate in all its ugly forms."]["Steve Bannon may be exiting the White House, but we know from Trump's response to Charlottesville that the problem starts at the top. https://t.co/L6gXqJcyP9"]["Devastating. My heart goes out to the victims, families, and the people of Barcelona. https://t.co/8VOdgTJZBJ"]["As we work to #DefendDACA, I think about Jorge Steven Acuña’s story. For DREAMers like him, we must keep fighting. https://t.co/22c9NHcqAA"]["Cost-sharing subsidies lower deductibles, co-pays, and out-of-pocket costs for millions of Americans. Trump’s sabotage must be stopped."]["The CBO’s facts DON’T lie:\n-Premiums ↑ 20% by next yr.\n-Deficit ↑ $194B/10 yrs.\n-Counties left w/o insurers"]["Trump may think ending CSR payments is just a political soap opera, but it has very serious, real life consequences. https://t.co/onUkd14iM9"]["@afronews At a time when our country is being tested, it's vitally important that @AfroNews is a voice for the community for years to come."]["For the past 125 years Baltimore's @AfroNews has been a vital voice for Baltimore and the entire nation. \nhttps://t.co/ezvFvJ9Ujc"]["Also support taking down statue at State House in Annapolis that pays tribute to author of the notorious Dred Scott decision, Roger Taney."]["I applaud decision of Mayor Pugh to remove Confederate statues. This isn't a question of erasing history—it's part of learning from history. https://t.co/UbKO6POCTr"]["The arc of the moral universe bends toward justice. You will not succeed in reversing our journey to a more perfect union."]["President Trump, this moment demands moral clarity, not appeasement of neo-Nazis and white supremacists. The alt-right is all wrong."]["I applaud the CEO of Baltimore-based @UnderArmour Kevin Plank for stepping down from the Council to focus on what matters for his workforce. https://t.co/l8ekX0gVlD"]["Mr. President, those who are leaving your Manufacturing Council are doing it precisely b/c they care about JOBS &amp; USA, not grandstanding. https://t.co/yhWGoGUGq1"]["Amazing how quickly Tweeter-in-Chief condemns the media as \"truly bad people\" when he couldn't do that for neo-Nazis and white supremacists."]["Nothing \"fake\" about the fact that it took President Trump 48 hours to call out real evil in Charlottesville. https://t.co/SrQLYa5rZY"]["Is there anything Putin does that Trump doesn't like?"]["Just when you thought it couldn't get more warped, Trump applauds Putin for cutting staff at U.S. Embassy in Russia. https://t.co/Xsxw6sidiv"]["This is NOT a hoax, @POTUS. When are you going to #ActOnClimate? Stop putting our communities at risk. https://t.co/ZtHWm0F0aV"]["POTUS says he wants to spend \"a lot of time, effort and money\" on opioid epidemic. But his budget slashes Medicaid. Can't have it both ways. https://t.co/CB5tl8D1TO"]["I sat down with my friend @SenFranken to talk about the @SenateDems plan to lower the cost of prescription drugs. Watch ↓\n \n#ABetterDeal https://t.co/rmquSvVRGX"]["@SenToomey Bipartisan BRINK Act offers foreign firms a stark choice: do business w/ the U.S. or w/ North Korea, but you can’t to do business w/ both."]["That's why @SenToomey and I have proposed a bill, modeled after the Iran Sanctions law, to give real teeth to U.N. sanctions."]["Chinese banks and firms, along with others, have been flouting existing North Korean sanctions w/ impunity."]["The new U.N. sanctions are welcome—but U.N. sanctions are only words on paper unless they are enforced."]["Trump should dial back the war rhetoric, but significantly increase pressure through economic sanctions and diplomacy."]["The war of words plays into the hands of Kim Jong Un. It elevates him and diminishes POTUS."]["Trump Admin should offer a clear strategy for peacefully resolving North Korean nuclear crisis, not issue dangerous &amp; irresponsible threats."]["President Trump’s reckless threats of a nuclear war undermine our country’s credibility and sow fear and confusion w/ our partners &amp; allies. https://t.co/drerZiNZay"]["Nursing home residents who have suffered abuse deserve their day in court—joined my colleagues to tell the Trump Administration just that. https://t.co/NaYNIiB5Gn"]["Yes—unacceptable for the Trump Admin to strip away the legal rights of seniors who live in nursing homes that rely on Medicaid &amp; Medicare. https://t.co/D7Xckojcl0"]["A public outcry recently pressured the EPA to move forward with new ozone standards—and we can do it again. #ActOnClimate"]["Share this scientific report on the devastating impact of climate change—right now, before the Trump Administration tries to suppress it. https://t.co/cW3r5PZ3ov"][".@POTUS marked his 200th day in office the same as his 1st—by continuing his campaign to destroy the ACA. https://t.co/IPaOV86Ky8"]["With Wells Fargo cheating 1000s of customers, we must immediately demand answers from the bank’s leadership. https://t.co/98wfItfXoO"]["Photo-op won't change fact that POTUS has spent the last 7 months trying to slash Medicaid, a lifeline for those fighting opioid addiction. https://t.co/r0CW49hbG5"]["The decision to implement new clean air rules is good news, but lesson also clear: It only happened b/c of massive public outcry. https://t.co/4Xjm2grFo9"]["Thanks to all of the young women who shared their stories in @Stepthemovie. Just like Baltimore, your strength is powerful and inspiring. https://t.co/yCNgdbvkSu"]["@CommishKDavis .@SenatorCardin, @RepSarbanes, @RepCummings &amp; I called on AG to reverse this decision &amp; will fight to ensure the city gets needed resources."]["@CommishKDavis Immigration enforcement is a matter for federal government. Trump Admin has no right to trample on the rights of cities w/unfunded mandates."]["@CommishKDavis If Sessions had checked, he would know that the Baltimore City jail is run by the State of Maryland, not the Baltimore City Police."]["Sessions is telling @CommishKDavis that feds will only help Baltimore fight crime if the city complies w/unconstitutional immigration orders https://t.co/gTo1Fs4cBc"]["Very glad that the bipartisan #RACE4ChildrenAct is headed to the President’s desk. Big win for kids and families coping with cancer. https://t.co/dCM0my0GUN"]["DOJ should follow the lead of DEA and reject Trump’s comments—they do not reflect the traditions and values of American policing. https://t.co/gwf0lt6N7P"]["Salute Acting DEA Chief Chuck Rosenberg for speaking out against POTUS comments that encouraged law enforcement to use excessive force. https://t.co/dCrpSkaqHg"]["Senate's passage of the #RACE4ChildrenAct is a big win for kids &amp; families coping w/childhood cancer—will accelerate new cures &amp; treatments. https://t.co/qW3KI2ok42"]["RAISE Act is a non-starter. POTUS needs to come to the table w/@SenateDems and @SenateGOP to address immigration reform in a bipartisan way. https://t.co/TfZ2SN4l0r"]["Support a bipartisan tax reform, but @SenateDems won’t support another backdoor effort to give tax breaks to the powerful few. https://t.co/TGZjdcuHes"]["@ICEgov Maryland was stronger with Diego &amp; Lizandro contributing to our society, &amp; my heart goes out to them &amp; their family at this difficult time."]["@ICEgov Shame on President Trump for tearing apart hardworking immigrant families. We should be focused on MS-13, not scholarship winners."]["@ICEgov I’m very upset to report that @ICEgov has moved forward with deporting Diego and Lizandro despite our community’s continued efforts."]["But POTUS continues to cynically tweet about sabotaging the ACA—generating uncertainty that leads to market crashes &amp; premiums increases!"]["To stabilize our exchanges, POTUS should:\nContinue cost sharing reduction payments\nSupport enrollment efforts\nEnforce the individual mandate"]["My office is working hard to make sure @ICEgov releases Diego and Lizandro. Help spread the word—this fight is too important."]["But Diego and Lizandro should not be the victims of this Administration’s disturbing efforts to punish those who have done nothing wrong."]["Our immigration system has been broken for too long, and we must work together to fix it."]["It’s important to go after MS-13 gang members, but it is an insult to decency and common sense for Diego and Lizandro to be deported."]["They’ve been exemplary Marylanders, prioritizing their educations and giving back to their community."]["My constituents Diego and Lizandro Claros were children when they fled violence in El Salvador to seek a better life in the United States. https://t.co/gT3QEdRUK6"]["Good news. Trump should follow this bipartisan example rather continuing his efforts to sabotage the ACA on his own. https://t.co/KTGL16byB7"]["The Trump Budget schemes would make Enron accountants blush. Don't blame the referee just because you don’t like the score. cc: @USCBO https://t.co/a3CUxEB4xz"]["That’s why @SenToomey and I have introduced the BRINK Act, find out more → https://t.co/6nwW0unc8Q"]["We need to take bolder steps to enforce sanctions &amp; stop Chinese banks &amp; foreign financial institutions from doing business with N. Korea."]["The bipartisan N. Korea sanctions legislation passed last week was a good first step, but there are still big gaps that need to be filled."]["It’s time to work in a bipartisan way to improve our current system &amp; make affordable health care available to every American. https://t.co/VvNzk6GDjf"]["Small business owners in EC &amp; elsewhere need a flood insurance program that meets their needs. Working on a bipartisan bill to do that."]["A big salute to Ellicott City’s community and small businesses for bouncing back after the devastating flood last year! #ECStrong https://t.co/4gRFQGeINE"]["Tonight the country breathes a sigh of relief, but tomorrow we roll up our sleeves and work to improve health care for all Americans."]["Thanks to everyone who fought so hard to make sure the Senate did the right thing. The American people were heard."]["Just tried to ask @SenatorEnzi about the 20% increase in premiums &amp; he refused to respond. Apparently, democracy is suspended tonight."]["Premiums up 20% compared to current law. 16M uninsured. How many more CBO scores is it going to take to realize we need to work together? https://t.co/SENIQeRIYG"]["Isn't it strange for R Senators to say they will vote for the bill only if House promises NOT to vote for it? Yes, it's that bad."]["Just voted YES on Russia sanctions bill. The only question left: Will @POTUS sign it? https://t.co/1RbyKeElBJ"]["Stay ALERT—it’s likely going to be a long night of fighting back to #ProtectOurCare. Keep up the calls—do not stop!"]["Do not be fooled. There are issues w/the ACA we CAN fix, but blowing it up is not the way."]["#SkinnyRepeal will either be a Trojan horse for another bad plan or will pass the House and blow up our health care system."]["McConnell &amp; Ryan would then present this WealthCare bill to Congress for final votes in September, with limited debate and NO amendments."]["And even if we do go to a House-Senate conference—like McConnell wants—they would once again be protecting the wealthy behind closed doors."]["In fact, McCarthy is telling members to stick around so they can act before August!"]["But don’t be fooled—House Republicans could pass this bad bill right away and it could go directly to the President’s desk."]["In Maryland alone, the #SkinnyRepeal would leave 200,000+ uninsured w/an annual premium increase of $700+."]["BUT #SkinnyRepeal is still rotten:\n-Premiums will rise rapidly—20% next yr.\n-Few or no affordable plans available\n-16 million more uninsured"]["McConnell is pushing a “skinny repeal” and claiming he just wants to get a health care bill to a conference w/the House."]["There’s a lot going on today. But you need to know the scheme McConnell has been cooking up:"]["We've got to step up—in an urgent way—the economic pressure on North Korea. https://t.co/wAoLzwxN6b"]["Senate GOP is writing a bill that affects every American &amp; 1/6 of our economy in secret over lunch. What abt McCain's plea for transparency? https://t.co/Nd8aQRLXo0"]["What a con game. President Trump is trying to appease Putin by hoodwinking the American people.\n\nWe won't fall for it. https://t.co/Cm0clqR2Nn"]["Every GOP plan would squash protections for millions of women—especially low income and minority women. Joined #PowerOfPink to fight back! https://t.co/xuxwl13k8x"]["@SenateDems We must recommit to keep fighting to build a more inclusive society where all Americans can thrive. #ADA27"]["@SenateDems Millions of Americans rely on Medicaid’s vital services to live full and independent lives, especially the over 15 million PWDs. #ADA27"]["Joined @SenateDems on #ADA27 to call on our Republican colleagues to take steps to improve, not slash Medicaid. https://t.co/DZeLvPiVeQ"]["This is Discrimination. We all bleed red. 1000s of transgender Americans serve our military—by attacking them Trump undermines our military. https://t.co/SzWwn3XsxS"]["Tune in live as I head to the Senate floor to speak out against the @SenateGOP's immoral health care proposals. https://t.co/TWqvRelbR6"]["Our fight is far from over. I know many of you are tired, but keep going: march, call, show up, and talk to your friends. We can't stop now! https://t.co/2PHhbs8Isa"]["Procedural votes on BCRA/Cruz Amendment may have failed tonight, but more votes on mean &amp; nasty R amendments coming soon. Keep calling! https://t.co/AvrnlaJkCE"]["Must stop all R bills b/c all have same vile DNA—stripping affordable care from many to give big tax breaks to powerful few."]["Must stop Cruz plan which segregates mkt into those who get junk plans w/out real coverage &amp; folks w/pre-existing conditions get priced out."]["ALERT: Within the hour McConnell is calling vote on toxic mix of huge cuts to Medicaid, big tax cuts for powerful corps and #CruzAmendment"]["Our President should be a role model to our country's children. Simply put, politicizing the Boy Scouts is disgraceful. https://t.co/7J8SSTvAAt"]["@SenateGOP This is not over—and we need you now more than ever to fight for all Americans who could lose their vital care. Don’t let up!"][".@SenateGOP voted to begin process of ripping health care away from tens of millions of Americans. We have entered down a dangerous path."]["This is a 3 Alarm Fire! Email, text, tweet, and phone your friends in key states—to demand senators save our health care."]["We can't let up on our fight for affordable health care. As the great American philosopher, Yogi Berra said, “It ain’t over till it’s over.”"]["@SenateGOP @SenateMajLdr @USCBO At the end of the day, regardless of party affiliation, we can all agree that this is NOT what democracy is supposed to look like! #SaveACA"]["@SenateGOP @SenateMajLdr @USCBO We know that these unconscionable bills all have same nasty DNA—they cut affordable care for many to give tax cuts to the powerful few."]["@SenateGOP @SenateMajLdr We don’t know if there will be a new nonpartisan @USCBO score, as required by Senate rules."]["@SenateGOP @SenateMajLdr We don’t know if there are new landmines or new pork barrel deals that Republicans wrote into their plan behind closed doors."]["@SenateGOP We’re less than a couple minutes from an expected vote but @SenateMajLdr STILL hasn’t told us which GOP WealthCare proposal we’re voting on!"]["@SenateGOP Make no mistake: The @SenateGOP's proposals have nothing to do with health care; they have everything to do with Wealthcare."]["Today the @SenateGOP will start voting on unconscionable proposals that wreak havoc on our health care system and gravely harm our country."]["We all will miss Jonathan Shurberg, but his legacy is all around us, as is the power of his example to live every moment of our lives fully. https://t.co/NqY8iuqnLg"]["Tune in live as I speak with my constituent, @OlaOjewumi about what affordable health care means for her: https://t.co/a4hqOpR9s0"]["@SenatorCardin @RedCross @QueenAnneEM A big thank you to the first responders and all those working to return the community to a sense of normalcy."]["@SenatorCardin @RedCross If you need assistance or want to help those impacted, follow @QueenAnneEM and visit https://t.co/ry6L3jCTxL for updates."][".@SenatorCardin &amp; I have let local officials know we stand ready to provide any help we can to those impacted by the storm on #KentIsland."]["1 day away from voting on a bill that will impact every American. But @SenateGOP won’t tell us what we’re even voting on. Makes no sense. https://t.co/BqMupKIo1y"]["Today, Dems unveiled #ABetterDeal w/3 goals:\n→ Raise wages &amp; create jobs\n→ Lower costs of living\n→ Build skills for 21st century economy https://t.co/kS3BPsncxL"]["Tune in as I join @SenateDems and @HouseDemocrats to discuss our plan for a #ABetterDeal for millions of hardworking Americans. https://t.co/EAyGUbalng"]["Honored to address the @NAACP convention tonight. Wish Trump had come. Every other POTUS starting w/Reagan has come to speak about unity. https://t.co/NXgh4bpVou"]["We must keep fighting to make sure Marylanders like six-year-old Timmy have the care they need. #ProtectOurCare https://t.co/PRzdy3finu"]["Great meeting young Marylanders from @GirlUp this week. Thanks for advocating for young women worldwide. https://t.co/PxI3YYgcuj"]["No nonsense; tell it like it is; always on story; he loved the D.C. Area and we loved him back. We will miss you, Jim Vance."]["Senator Byrd would be proud that his \"Rule\" will hamper Senate Republican bill that \nwould destroy affordable care for millions. https://t.co/ePE5iho87X"]["I will work hard to continue having discussions like this throughout Maryland so we can share ideas on how to best serve our state."]["Took those ideas back to Capitol Hill &amp; worked successfully on a bipartisan basis to stop cuts to rural development &amp; assistance to farmers."]["This month I held a roundtable discussion to listen and share ideas with agricultural leaders and farmers in Southern Maryland. https://t.co/rxme4dKiK3"]["Yesterday, @SenatorTomUdall's amendment to prohibit horse slaughter passed on a unanimous voice vote! Thx to all MDers who contacted me."]["Happy Birthday to an incredible friend, role model &amp; one of the fiercest fighters I know. When Sen. Barb is with you, the Force is with you! https://t.co/7KeFQaKTl6"]["Another CBO tells the same rotten story:\nMillions more uninsured\nCosts will rise, benefits fall\nMedicaid slashed\nTax cuts for powerful https://t.co/VW0rjHowC0"]["Proud to join @EleanorNorton and @RepAndyHarrisMD to introduce a bill that will celebrate his legacy and help build a more perfect union. https://t.co/wLZ4NttfqF"]["Next year is the 200th birthday of Frederick Douglass, an American hero who escaped from slavery and then helped lead the fight to end it."][".@SenJohnMcCain, our family's thoughts and prayers are with you and your family. You have overcome tough battles before!"]["Trump &amp; @SenateGOP are running in circles. Plan A, B, &amp; C failed—how many more rotten proposals that would sabotage health care? Stop! https://t.co/UWF4lfCbvx"]["This just gets more rotten: @USCBO says 32 million more uninsured and premiums would double by 2026. https://t.co/IIOb5Wy7jI"]["Without Medicaid, Angela couldn’t care for her daughter Caroline who was diagnosed with autism. #ProtectOurCare https://t.co/dK9g844gpq"]["McConnell’s repeal plan would make health care unaffordable for children like Charlie who have a pre-existing condition. https://t.co/iSoLlWMHau"]["Good? Mr. President, you called House bill \"mean\" and Senate bill is even worse. The American people are smart. Only 12% support. https://t.co/TMB7KkODIs"]["Don’t forget: The CBO already scored a full repeal → 32 million Americans would be uninsured and premiums would skyrocket!"]["Do McConnell and Trump realize that a full repeal without a replacement will cause insurance markets to collapse? https://t.co/O5tLdfuT7a"]["Trump wants the ACA to fail—using the health care of millions as a political pawn. @SenateDems want to strengthen, not sabotage. https://t.co/UW7DTnbRcf"]["If Kushner is afraid to disclose what Russians already know, then he is vulnerable to blackmail. It's time to revoke his security clearance."]["Kushner has repeatedly failed to disclose his contacts with the Russians. Pattern of deceit not only dishonest, but dangerous…"]["Because you spoke out, shared your stories and didn't give up, the tide is turning. Still not over. Keep fighting! https://t.co/ZIQYBmqOyj"]["Hard to believe Trump is serious about “Buying American and Hiring American” considering he can't even do it himself. #MadeInAmericaWeek https://t.co/vewr2ZTU2E"]["Height of hypocrisy to be rolling out “Made in America” week when Trump's businesses have been producing most of their products overseas. https://t.co/R4tf874R2r"]["As I told @SRuhle on Friday: It’s time to stop this unconscionable bill and work together to improve our health care system. https://t.co/8HFDpkQ13R"]["ICYMI: @SenToomey and I introduced bipartisan legislation that'll fill an important gap in our current sanctions regime against North Korea. https://t.co/MPS1Va35a6"]["Stories like Rick’s will help save lives and give others the strength to continue fighting this immoral \"health care\" bill. https://t.co/aTe6nyhXLK"]["CBO confirmed that Trump is ignoring basic math when it comes to his budget, might be time to send him one of these: https://t.co/W5td08uRG1"]["The Cruz amendment will absolutely make it impossible for those w/pre-existing conditions to buy affordable insurance."]["Long-term cuts to Medicaid still deeper than the \"mean\" House bill in order to give big tax cuts for powerful special interests."]["Just took a look at new GOP bill. They tried to put deodorant on a skunk—but it still stinks to high heaven. In many ways smells worse."]["The GOP’s “WealthCare” plan makes health care much worse for hundreds of thousands of Marylanders—all to give huge tax breaks to the rich. https://t.co/gHrzIo7YzO"][".@SenToomey &amp; I are introducing legislation that imposes tough sanctions on those who do business with North Korea. https://t.co/cnRyOP7ujZ"]["It’s time we send a clear message: The economic consequences will be severe for those who continue to do business with North Korea."]["North Korea crossed a dangerous threshold by successfully launching an intercontinental ballistic missile capable of reaching Alaska."]["@FCC @AjitPaiFCC We must make sure the Internet is an open forum, not something manipulated by the highest bidders. #NetNeutrality"]["@FCC Last month, I submitted some questions to @AjitPaiFCC regarding the FCC’s handling of #NetNeutrality. Still waiting to hear back…"]["We can't let @FCC Chairman Pai gut the strong #NetNeutrality rules that we fought for—a free and open Internet is essential to democracy."]["Disgraceful. This is an unprecedented attack on a bipartisan scorekeeper whose chairman Republicans helped appoint. https://t.co/w2YGlqQzhI"]["Let’s not forget: #Trumpcare would weaken protections for millions of people with pre-existing conditions across Maryland. https://t.co/kym6H7tVZM"]["GOP’s #WealthCare would ↑ average premiums for hundreds of thousands of Marylanders—just to give a tax cut to millionaires and billionaires. https://t.co/qcRlzKNf4t"]["Senate Republicans’ #WealthCare bill gives a $496.6 million tax cut to the wealthiest 109,100 Marylanders."]["Russian email x-change with DT Jr. reveals collusion with Kremlin. Hard to call it \"fake news\" anymore. What's next? https://t.co/CHxz9m6sNS"]["We must continue to speak out—the next three weeks will determine the fate of our health care system. Don’t slow down, keep fighting back!"]["I'll continue working w/ federal, state, and local officials to ensure the fully consolidated FBI HQ  project comes to fruition."]["This shameful action follows Trump's firing of Comey—demeaning the men &amp; women of the FBI &amp; eliminating funding for new FBI HQ in his budget"]["Trump Admin canceling current request for new FBI HQ will put America’s national security at risk—I strongly oppose this decision. https://t.co/jAX2HpQIvO"]["To my Republican colleagues: The WealthCare bill is rotten to its core and a little deodorant will not make it better. https://t.co/L4BQlgoZVQ"]["what Trump meant when he said that Russia would be \"rewarded\" for hacking into HRC's email… he will turn over the keys to all our elections. https://t.co/0dq5d3STFH"]["Really, after Russia hacks our election, Trump says he and Putin agreed to do joint cyber security? So now we know..."]["@VP That’s why I wrote to @VP asking how the “Commission” intends to use and protect sensitive voter data of millions of Americans. https://t.co/7w9mN95LjA"]["Senate GOP’s WealthCare bill will slash Medicaid—which includes vital funding for addiction treatment centers to combat the #OpioidEpidemic. https://t.co/OPSrmxSU3J"]["President Trump must send a strong message to Putin on Friday—the United States will not tolerate his efforts to undermine our democracy."]["@BetsyDeVosED Today I’m proud to say Maryland is joining 17 states &amp; DC to take action against DeVos’ illegal efforts. https://t.co/fazISxP0Xc"]["@BetsyDeVosED DeVos has time &amp; time again sided with those for-profit college executives who have gamed the system in their favor while scamming students."]["Last month, @BetsyDeVosED quietly stopped critical protections for students who were scammed by certain fraudulent for-profit colleges."]["I commend Shaub for his service—the next head of OGE must continue to ensure that public officials serve the people &amp; Constitution first. https://t.co/X1On2lIqlb"]["T.J., my heart goes out to you and your family. It takes tremendous courage to speak out after enduring such a devastating act of violence. https://t.co/2UmBAS2k7M"]["Why are we focused on baseless claims of “voter fraud” instead of taking action against Russia for interfering in our elections? CC: @VP"]["Trump is playing a dangerous game w/ sensitive voter data. 44 states—led by Republican &amp; Democratic elected officials—share this concern. https://t.co/xdsQ1ISnky"]["Decisions like this are why EPA's role is critical. Trump's budget proposal to eliminate funding for Bay cleanup would put progress at risk. https://t.co/EAfiHf87MK"][".@SenateGOP is so desperate they are beating up the referee—don't like the truth so they want CBO to change the facts. Shameful bullying. https://t.co/j6leyNOPPR"]["I love the #4thOfJuly! Great to join MDers of all backgrounds &amp; political stripes to celebrate America &amp; the right to express our views. https://t.co/dpz7WMZaZy"]["If we’re going to have a strong economy in Maryland, it’s essential that we have a clean #ChesapeakeBay. https://t.co/R6SWojnQVW"]["@HUDgov This would sabatoge the Rental Assistance Demonstration project—let's avoid these cuts and work to expand access to more affordable housing."]["Carson says he hopes to expand public-private partnerships but his proposed budget cuts @HUDgov by $7.5 billion."]["Secretary Carson says one thing in Baltimore but does the opposite on Capitol Hill. https://t.co/jtME0jJyuU"]["The modern mode of communication is not the issue. It's the crude, false, and unpresidential content. https://t.co/liEYbhkpnx"]["Congratulations to all of Maryland's #SkillsUSA competitors and winners—you make our state proud! https://t.co/Oya0DeqIS4"]["Defunding @PPFA would leave millions without critical health care services. Proud that Maryland is the first state to protect its funding. https://t.co/ldLWy2UsqR"]["Just saw the NRA video. This is dangerous and grotesque fear mongering that only sows division in our country."]["Since when is trying to work together a threat? Time to start working across the aisle instead of sabotaging our health care system. https://t.co/kY75e6XnO1"]["Really? Trump's plan to make America more safe is to ban my friend's grandmother from visiting him? Pathetic. https://t.co/sUq8KCklY8"]["New CBO analysis today shows that when it comes to cuts to #Medicaid, GOP WealthCare bill gets even meaner the more time goes by. https://t.co/vsYFnWFc6n"]["CBO shows GOP \"WealthCare\" plan gets even meaner over time. Cuts Medicaid by 26% in 10 yrs—down to 35% in 2 decades. Millions more hurt. https://t.co/gKZXUZJwD4"]["Paul Ryan said Dems are “out of gas” when it comes to fighting GOP’s WealthCare. Has he looked out his window?\n\nWe're just getting started! https://t.co/DjNPT3bTiS"]["After Pruitt told me how important the integrity of scientific review is—I asked him why he took down the EPA’s website on climate change. https://t.co/PATTcPdCBF"]["Proud to have opened our new Baltimore Regional Office last night! Thank you to everyone who came out. https://t.co/sfTAtrdrhn"]["As someone who actually has been enduring a kidney stone throughout this 2-week health care debate, I'd have to agree @RandPaul. https://t.co/jte7ikqwnp"]["Agreed @SallyQYates: Making America scared again won’t make us safer. https://t.co/d1TNM9V04U"]["Keep fighting—your voices are being heard! We will stop this immoral bill. #ProtectOurCare https://t.co/0FrygdMcrI"]["I urge my GOP colleagues to go home &amp; listen to their constituents. We won’t stand for any bill that strips health care away from millions."]["Yogi Berra had it right: \"It ain't over till it's over.\" No time for a victory lap—it's time to redouble our efforts to stop this bill. https://t.co/41RxYhpGdi"]["On the Capitol steps today I held up a photo of Carol from Salisbury, MD. Watch her story and tell me your own using #AmericaSpeaksOut: https://t.co/rFD2KUx7XK"]["We weren’t elected to the U.S. Senate to take away health care from millions of Americans. https://t.co/9pgEb2w6FZ"]["Looking fwd to @SenateGOP releasing their numbers…"]["Since Senate Republicans released their #HealthcareBill last week, I’ve received over 2,200 emails and 2,600 calls opposed to the bill."]["Carol is a 63-yr-old teacher who has lived w/MS since 1990. Now living in MD, she is covered thru Medicaid. #Trumpcare threatens her health. https://t.co/eVd67XUsRf"]["I’m headed to the floor to speak on why the latest #CBOScore and why GOP #HealthcareBill is just plain rotten. https://t.co/zyjZxl6TUD"]["I’m fighting for 6-yr-old Timmy, whose life depends on the health care he receives because of the #ACA. https://t.co/gj5lV0DXHf"]["I’m fighting for millions of Marylanders like 20-yr-old Julia who rely on Medicaid to live a full, independent life. https://t.co/5bZE4zOnKG"]["#CBOReport proves this is WealthCare, not health care. Keep up the fight: Call, text, email—we need your help to stop this monstrosity."]["I’ll say it again: #Trumpcare is a massive transfer of wealth from middle-class and poor families to the richest Americans."]["We must stop this unconscionable #HealthcareBill, @SenateGOP. What about putting the American people first? #CBOScore"]["#Trumpcare 3.0 is still very mean:\n2018 → 15M uninsured\n2020 → 19M uninsured\n2026 → 22M uninsured\n\nMILLIONS left w/o health care. #CBOScore"]["With 3rd #Trumpcare #CBOScore, we're seeing a pattern: Millions of people losing access to affordable care to give tax cuts to millionaires. https://t.co/oEYJ1Lt8hp"]["Deep cuts to Medicaid in GOP #HealthcareBill will put the 1.4 million Americans in nursing homes at risk of serious harm. https://t.co/s5CyNqrTIn"]["Trump and Congressional Republicans love to talk about ending the #OpioidEpidemic, but their #Healthcarebill will only intensify the crisis. https://t.co/3fgxCdML7D"]["I’m ready to discuss ideas to improve our health care system—as long as the common goal is to increase access and affordability of care."]["I will fight the GOP #HealthcareBill tooth &amp; nail—but we need reinforcement from each &amp; every one of you. Time to stand up &amp; speak out."]["Yesterday I joined over 500 MDers in Bowie to discuss the devastating impact of the GOP #HealthcareBill—they’re  fighting it. Are you? https://t.co/8exqZBzlEP"]["Of course, there are some who support the GOP health care bill—those advocating for powerful special interests that get windfall tax breaks."]["Take the time to think about this fact: Not a single patient advocacy group is in favor of the Republican Senate's health care proposal."]["In Bowie to talk w/MDers about the harmful impact the GOP's #HealthcareBill would have on our community. Tune in: https://t.co/uAciX2xaKT"]["Join me TODAY to discuss actions we can take together to stop the Senate Republicans' #HealthcareBill from passing: https://t.co/uJFkqAjXtT https://t.co/2GaOvsZxzL"]["The Republican #Healthcarebill will take a devastating toll on millions of Americans, and no amount of tinkering will make it better."]["We cannot risk the lives of millions of people, just to hand enormous tax cuts to the wealthiest Americans. #ProtectOurCare https://t.co/jNpzby9Nzf"]["After a very bleak day in the Senate yesterday, meeting with students from @LibertysPromise was just what I needed. https://t.co/19kwXg6yP5"]["I will fight this monstrosity of a #Healthcarebill tooth &amp; nail, but we need everybody to stand up &amp; speak out. Let’s get to work! https://t.co/QQp26tFMaP"]["Medicaid is a lifeline for millions of Americans—and the GOP #HealthcareBill is an attack on our country’s most vulnerable, like Julian. https://t.co/EQsVeufbr0"]["Disgraceful. This isn’t a #HealthcareBill—in many ways it's meaner than the House bill. Slashes Medicaid and gives huge tax cuts to wealthy."]["My Republican colleagues are giving Carmen Sandiego a run for her money. #ShowUsTheBill https://t.co/d9IatVFOu0"]["Vital to have a healthy oyster population to help clean the #ChesapeakeBay—thx to @nature_DCMDVA for making this a priority #VoicesOfNature https://t.co/bbdSA3H1Ya"]["Fact check: Insurance companies are pulling out of states because of GOP efforts to sabotage our current health care system. https://t.co/Os23KbJypF"]["#ShowUsTheBill, @SenJohnBarrasso and @SenateGOP!"]["Glad to debate my GOP colleague on TV, but shame that we can't provide input and amendments in Committee on behalf of the public. https://t.co/okSme6UlBn"]["Ready to see the bill. \nReady for hearings. \nReady to make amendments.\nAnytime, anywhere. https://t.co/VAWUfDnK5t"]["When the @SenateGOP tells you that they’re encouraging debate and public input while trying to craft and pass #Trumpcare, show them this: https://t.co/2bnNoIvqLv"]["Never thought I’d say this, but it looks like the President and I can agree on one thing: The Republican health care bill is indeed “mean.” https://t.co/Tilkug9RG7"]["@SenateGOP @SenateDems Let’s keep up the fight to end the secret meetings and ask the @SenateGOP why they are hiding their work from constituents. #ShowUsTheBill"]["@SenateGOP @SenateDems RT If you agree: Americans' health care is too important to ram it through the Senate under cover of darkness—#ShowUsTheBill!"]["@SenateGOP @SenateDems Our founders did not intend for major legislation to be crafted and passed without public input and debate—that’s not how democracy works."]["@SenateGOP #Trumpcare 2.0 so far:\n \n0 hours of debate\n \n0 committee hearing \n \n0 amendments considered from @SenateDems.\n \n#ShowUsTheBill, @SenateGOP!"]["@SenateGOP Today—in 2017—the @SenateGOP's efforts to draft Trumpcare 2.0 have been shrouded in unprecedented secrecy. Time to #ShowUsTheBill."]["@SenateGOP In total, the Senate spent 160+ hours considering the ACA and more than 160 Republican amendments were accepted during that process."]["@SenateGOP In 2009, the Senate spent 25 days publicly debating the details of the ACA before it passed—the 2nd longest consecutive session in history."]["I just need to take a second to talk about #Trumpcare and the blatant lies being thrown around by some of the @SenateGOP."]["Trumpcare will cost Maryland thousands of jobs and likely trigger an economic downturn in nearly every state across America. #ProtectOurCare https://t.co/xbq4ObNMTQ"]["We must continue to honor her legacy—which is why I'm working to bring a statue of Harriet Tubman to the U.S. Capitol. #Juneteenth https://t.co/JnALHge4CD"]["On #Juneteenth, we remember those who fought tirelessly for freedom—including Maryland’s own Harriet Tubman. https://t.co/DE6JwUbVEE"]["Saluting Maryland's own Xavier Alec Martin, Navy sailor who gave his life in service to our nation. Our deepest condolences to his family. https://t.co/cEs2WOvFRP"]["Happy #FathersDay to all the dads out there! I will always cherish the many great memories I have with my dad—miss him every day. https://t.co/bsfuztb6Ob"]["Nothing like #BaltimorePride Parade to celebrate #PrideMonth. Let’s protect the progress we’ve made, MD, &amp; keep up the fight for equality! https://t.co/Og933xomkW"]["If Trump cared about creating jobs at home and helping Cuba open its doors, he would embrace more engagement w/Cuban people—not less."]["Not a better deal for Cuba. Bad for American business and the Cuban people—another step back from American leadership on the world stage. https://t.co/r8xtQNO1Wx"]["Important step. Let’s keep moving the needle forward to ensure all students have the opportunity to learn in an equal and fair environment. https://t.co/Oq93engmgc"]["Tonight's #CongressionalBaseballGame sends a clear, unified message: Those who seek to disrupt and divide us through violence won't succeed. https://t.co/F5IN7BJmqj"]["‘bad people’ are Putin &amp; those who interfered in our election. Why are you opposing bipartisan Russian sanctions bill the Senate passed? https://t.co/UhfTHUAJUC"]["Heard it’s #NationalLobsterDay, but with summer starting I'm more in the mood for Maryland crabs and a cold beer. Sorry, Maine."]["Trump and his national security team should be sending the same strong message to Putin—not considering loosening sanctions. https://t.co/RzvsvR4Loy"]["By passing sanctions against Russia, we sent a unified &amp; unequivocal message to Putin: U.S. won't stand idly when our democracy is attacked. https://t.co/u7Gi5O8sHO"]["@SenBlumenthal No person is above the Constitution—not even the President—but Trump is blatantly ignoring it."]["We can’t risk our democracy anymore—I’m filing a lawsuit with @SenBlumenthal to ask our federal courts to intervene. https://t.co/NOAY4EPXI7"]["As long as President Trump accepts benefits from foreign governments and exposes his Administration to corruption, our democracy is at risk."]["Thanks for all the well wishes, everyone. Feeling better already -- I'll be back on my feet soon."]["Message to Erdogan: We will not tolerate brutal attacks on peaceful protesters on our soil. Erdogan should stop similar attacks in Turkey. https://t.co/3CgWCBE4WB"]["Only a kidney stone (ouch!) could keep me from being present to vote YES on the Russia sanctions bill. We must protect our democracy! https://t.co/OsvBtACbc1"]["Marylanders deserve a flood insurance program that is sustainable and affordable. This bipartisan effort will ensure just that. https://t.co/zxD0EYetN3"]["Powerful floods devastate communities across Maryland every year, but our current program overcharges and underdelivers for taxpayers. https://t.co/6LSxXgygGI"]["An attack on one is an attack on all. Praying for a speedy recovery for Rep. Scalise and other victims. Big salute to Capitol Police!"]["@SenateGOP Americans' health care is too important to ram it through the Senate under cover of darkness. #ProtectOurCare"]["@SenateGOP .@SenateGOP plan to rush their health care bill for a vote before July 4 w/ no opportunity for Dems—or the public—to review the details."][".@SenateGOP's efforts to draft a #Trumpcare 2.0 bill have been shrouded in unprecedented secrecy."]["Don't forget: In 2009, the Senate spent 25 days publicly debating the details of the #ACA before passing the bill."]["Seems Trump’s disdain for the First Amendment has reached Capitol Hill. Our work should be open and transparent—let’s reverse this order. https://t.co/EsfN5Sbq4i"]["Looks like the troubling pattern continues, and they will try to fire anyone who doesn't pledge loyalty to Trump. https://t.co/P4GTynoXo5 https://t.co/Eo92r6rlN7"]["Have you looked at the CBO report, @VP? Fact check: #Trumpcare would strip away health care for 23 million Americans. https://t.co/jNIrMSymRZ"]["I’m opposing the Trump Admin's efforts to search for oil in the Atlantic—an oil spill would wreck our coastal communities and economies. https://t.co/QrEJEVkVKf"]["Let today serve as a reminder that what unites us is far stronger than the hate and terror of those who seek to divide us. #OrlandoUnitedDay https://t.co/dolN2wxkwR"]["I agree with Sophia—we must do all we can to fight #Trumpcare. Thank you for lifting these stories @Alyssa_Milano. https://t.co/heH8MXzX06"]["It is outrageous that @POTUS would reward Russia by allowing spies to return instead of sanctioning them for interfering in our elections. https://t.co/P5YY3oaQMq"]["Shameful move by @HouseGOP—I will fight this roll back when it comes to the Senate. Our shared economic prosperity is too important. https://t.co/3oMTFwooSR"]["The Trump Admin acts like they care about minority-owned small businesses but then they cut programs that help them. https://t.co/RUWFAsAutF"]["More hot air from someone who has had an estranged relationship with the truth. Mr. President, will you testify under oath like Comey? https://t.co/bU4rN1jfVN"]["Bottom line: Putin attacked our democracy. There's no excuse for inaction. Now is the time for all Americans to be patriots, not partisans. https://t.co/UzWiNwFXir"]["#DoddFrank reduces the risk of another financial crisis—while you were watching the #ComeyHearing, @HouseGOP voted to dismantle it. https://t.co/l2aVZqciPA"]["As we celebrate #WorldOceansDay, we must prioritize protecting the health of our oceans and coastal economies across the Atlantic seaboard. https://t.co/OVPA1UpReI"]["These students had bright futures—no parent should have to endure such a tragedy. My heart goes out to the families &amp; Germantown community. https://t.co/6Qu6uRFqe0"]["In light of the #ComeyHearing, I’m speaking on the floor about how consequential this moment in history is. Tune in: https://t.co/pFZaMThCC8"]["Important questions by @RonWyden about patronage relationships that our President constantly demands. #ComeyHearings https://t.co/u2gVKvqBdi"]["#ComeyHearings reveal a disturbing pattern by our President: An expectation of loyalty to Trump, not the U.S. Constitution."]["No, @SpeakerRyan. Anthem is pulling out of Ohio because of the uncertainty your health care sabotage is causing. https://t.co/Snl5j6wn2N"]["Maryland must #ActOnClimate since our President refuses to do so. Our planet, economy, and the lives of our grandchildren are at stake. https://t.co/vK90bX9tjy"]["We cannot afford to go back to a time when living with a disability meant that you had to live in a segregated institution. #SaveMedicaid https://t.co/S0xQdQAvLz"]["Trumpcare is not about health care, it’s about wealth care. No cuts, no caps! #SaveMedicaid https://t.co/naZrHdlC3E"]["Today we remember the sacrifice and commitment of those Americans who risked all 73 years ago to fight tyranny and support our allies. #DDay https://t.co/hRR13b8jUs"]["With your help, we can #SaveMedicaid and make sure Trumpcare doesn’t pass the Senate."]["And we must listen to and share stories about how Trumpcare will do grave harm to our fellow Americans."]["We must speak out against Trump’s “alternative facts” about his horrendous Wealthcare proposal. https://t.co/zhcCmvarkm"]["Trumpcare would strip a whopping $834 billion from Medicaid while shoveling out hundreds of billions of tax cuts to wealthy households. https://t.co/Ez09Rgs6OA"]["Trump’s cuts to the @StateDept will undermine our national security. That’s why @SenDanSullivan and I wrote to Secretary Tillerson. https://t.co/7sZWRiOuKN"]["Cowardly acts like this are a painful reminder about the urgent need to confront hatred at every turn. We must step up, speak out and act. https://t.co/kRCDBr4z5K"]["We must work to aggressively advance research and cures so that one day soon, we’ll rid the world of Alzheimer’s. #EndAlzheimers https://t.co/j4hXhoEjMT"]["While we stand with the families who've lost loved ones to gun violence, we must keep up the fight for common sense gun reform. #WearOrange"]["I #WearOrange because the level of gun violence in our neighborhoods and communities is a national disgrace. https://t.co/vkFzoRtRz6"]["This Pride Month, silence isn't an option. We must protect the progress we've made as our fight for equality for all continues. #Pride2017 https://t.co/Ngr4lnVYL5"]["Withdrawing from the #ParisAgreement will harm American jobs, economic competitiveness, and the health of our planet for generations. https://t.co/2jI2Ug0wNn"]["Trump used a backdoor scheme to replace the chief banking regulator w/someone cozy w/Wall Street. @SenWarren and I are blowing the whistle. https://t.co/oZlhFaZpD3"]["Trump should be ramping up sanctions against the Russians, not allowing them to use MD's Eastern Shore to plot to undermine our democracy. https://t.co/SNVSD88h3D"]["Maybe Putin can become Trump's new communications director? He is certainly on message here. \nhttps://t.co/vwTZfu0SGg"]["Great story about a dedicated and talented seventh grader from Baltimore. Cahree, you make Maryland proud! https://t.co/RkKHhazCI6"]["The #ChesapeakeBay is vital to the lives of MDers—eliminating cleanup programs through the #TrumpBudget would be devastating. https://t.co/xkKHYdt6I3"]["If Trump withdraws from #ParisAgreement, it's a grave threat to our planet &amp; future generations, &amp; a retreat from leadership in the world. https://t.co/mgZGHFhzKq"]["For every $1 spent that was supposed to cover people with pre-existing conditions, #Trumpcare spends $29 on tax breaks for the wealthy. https://t.co/Sozbj9TVhS"]["It’s a serious problem when one of our closest allies believes they can no longer rely on us. Trump is ceding American leadership worldwide. https://t.co/GNZnwCqeh8"]["The #TrumpBudget leaves America’s small towns and rural economies behind. https://t.co/X12RB7bVuE"]["The #TrumpBudget means big loss of treatments and cures to diseases, cutting more than $7 billion from @NIH. https://t.co/92MQ9P3sWG"]["If I were them, I would be laughing too. Since you won't act, Congress needs to pass bill to sanction Russians. They won't be laughing then."]["And while they were at White House, the Russian Foreign Min. Lavrov laughed about your firing of former FBI Dir. Comey."]