["This is job loss. Where it hurts.  https://t.co/ul8XXxaGy7"]["Huh? The President just embraced earmarks? Talk about the swampiest of swamp creatures. You gotta be kidding me."]["Welcome to Missouri! https://t.co/2yEhyi9kcO"]["30 is the magic number of cosponsors needed to get a #NetNeutrality vote in the full Senate.\n \nProud to be that 30th cosponsor of @SenMarkey bill to restore free and open internet."]["Happy New Year! Please help me get to 100,000 donors before midnight. Thank you so much. https://t.co/M9yi2GEV73."]["@Andy your home town is proud to welcome in 2018 with you. #STL #CNNNYE ❤️🎉your pal Claire"]["@Andy we are proud of your role in welcoming 2018! #STL #CNNNYE ❤️your pal Claire"]["I agree. And my stubborn husband who  thinks “anyone who didn’t play the game doesn’t know the game” agrees. Says hubby “I’m impressed”. @bethmowins https://t.co/6AlbOm9vWR"]["Freedom of speech and peaceful assembly are values our country cares deeply about. We stand in support of #IranProtests."]["Please share! https://t.co/CjzxOdFvAG"]["So here’s behind the scenes/wrap up.  https://t.co/IQOlNi4jSu"]["Nice! Thanks for this. And even bigger thanks to the thousands of Missourians who turned out to ask them! https://t.co/i7a07dQf3q"][".Knowledge. I have been lifted up by over 90,000 donors this year. Small contributions x a gajillion is how we can/should win.  Help me get to 100,000 donors! https://t.co/SPX25K1E1N https://t.co/hDDXE2h25W"]["Got my bowl shoes on. Beat Texas. #Mizzou https://t.co/3W6cdp7mmR"]["He was generous, kind, loyal and cared deeply about his fellow fire fighters and his community. I loved him. My kindest thoughts and support to his large group of family and friends. https://t.co/clSXl5Jh1E"]["Loving this. So nice. https://t.co/tJM2BplR2X"]["My grandchildren. So blessed. Merry Christmas to all! https://t.co/JkYC7DXpp9"]["Getting ready for Chiefs game. Chocolate cake in the oven.  and it’s ❄️ing. Perfect! https://t.co/1nC3akLp9A"]["Let. It. Snow. Cooking with this view today will be so fun. https://t.co/RQbAVWw92a"]["Not good. We need job growth, not loss. https://t.co/zYLO3zoCQA"]["✅ https://t.co/W33pmI6mvK"]["I’m loving this. https://t.co/ATbq4sxdyz"]["This is terrific! #MizzouMade  #MizzouProud https://t.co/iR7eRqvL7v"][".Thanks Clarice. Merry Christmas! https://t.co/Pt7ELwj4j0"]["Me to my R colleagues and President Trump when they say the tax bill is all about working families.      “Every word of what you just said is wrong”.  #LastJedi"]["So bad. Repeat. So bad.  https://t.co/x0SdhGWjJs"]["CHIEEEEEEEEFS! #ChiefsKingdom"]["Up early doing Christmas baking for grandchildren before #ShowMeTownHalls   This will be my 50th town hall this year! https://t.co/HYNxFHdV0A"]["Lord above. This sends chills up my spine. A nominee to be a TRIAL JUDGE doesn’t even know what a motion in limine is. Never taken a deposition. Never argued a motion. https://t.co/P6YdXjLetu"]["I oppose the FCC changes to the free and open internet. We should preserve, not destroy net neutrality. See my letter👉🏻   https://t.co/vPIsDoiUuE"]["Evidently House agreed to a change and Senate agreed to a change. They both agreed to lower taxes on the wealthiest....lower than either of their previous versions. JeezLouise.  #taxscam"]["So there’s no misunderstanding, the negotiations on tax bill that are being talked about at WH  right now are negotiations between Republicans. No Democrats allowed. We have no idea what they’re doing. It’s a shame. Coulda been different."]["Thank you Alabama!"]["Nope. I agree. Maybe 1.5. But I agree. https://t.co/ilWNxDhthG"]["Oh. My. Goodness. Could this be more exciting? #ALSen"]["So simple question. Only a stone cold politician would refuse to answer. @SenShelby answered it clearly:No. @HawleyMo? Well, not so much. https://t.co/DHDzLPlAlg"]["This from President Trump’s alma mater. It truly is a great business school! https://t.co/33EleHGrqV"]["This tells the story. And it’s not fake. These are the facts of the evolution of the R tax bill.  https://t.co/qS7XYQNoAn"]["As always, great to work with you. And Happy Day-After Birthday friend. @SenatorCollins https://t.co/fhae0uiP1S"]["This Minneapolis editorial captures the essence of the Al Franken accusations and resignation. https://t.co/0oBtM7yNNd https://t.co/TC5jvZ05gH"]["This is what I have been shouting about for weeks. The added complexity is a playground for legal tax avoidance. This does not level the playing field. Not simpler. Not fairer. https://t.co/5TeNT12E6x"]["Al Franken should resign."]["I agree! https://t.co/oAdf5yJTpn"]["Hoping this officer has a full recovery and thinking of him and his family. Prayers.  https://t.co/xhjluOEHZF"]["My daughter Lily, the 2L, and I on our way to watch #MasterpieceCakeshop oral arguments. https://t.co/p07EFspayC"]["On behalf of Tory,Brook,Ian,Evan,Amir,Rajan, Conner,Tom,Derek, and two grandsons on the way, they agree. O#OnNomNomNom. https://t.co/2L1riEmK0r"]["Monthly cost of silver plan goes down in Missouri next year for those that qualify for subsidies. Need to work on costs for those that don’t. Bipartisan bill will help. Need to pass it now! https://t.co/c9sgdrxsKH"]["While not perfect, our rule of law is the gold standard of the world. Bashing our premier law enforcement agency for political purposes is flat wrong. It does not make America great to bash law enforcement officers who have a great legacy of professionalism."]["For a good reason... https://t.co/6YRXLVf8cz"]["I’m mad. And sad. We need to work together, compromise, and produce thoughtful results for frustrated families. Not a one-party-behind-closed-doors-no-time-to-debate-no-hearing-jam-it-through-in the-middle-of -the-night-mess."]["Preach Michael. Please watch his informed passionate tirade. https://t.co/fIOtnTU3Vk"]["We politely asked to adjourn till Monday morning. So we could read and study the bill we were just given. Answer was no. So we are here blindly re-arranging the American economy in the middle of the night."]["I’m stealing that phrase.  Ok? https://t.co/W7vymwoa0O"]["Pretty sure we have just discovered an earmark for Hillsdale College/Betsy DeVos courtesy of Pat Toomey. https://t.co/U3XhlFsZgi   Language inserted to exempt them from endowment taxation."]["I didn’t. 😬 https://t.co/5N3ddjTuz0"]["So here’s one example of crazy-town tonight. Handwritten in the margins buried in the bill. Which we just got. Drawing is my editorial comment. https://t.co/4jVu4cafbD"]["We can learn from history. We need to read this bill. What could go wrong?"]["What he said. https://t.co/SB9lV8YrYX"]["Remember this? Read the bill. Can we have till tomorrow morning to read this @SenateMajLdr ? Please?"]["This is so bad. We have just gotten list of amendments to be included in bill NOT from our R colleagues, but from lobbyists downtown. None of us have seen this list, but lobbyists have it. Need I say more? Disgusting. And we probably will not even be given time to read them. https://t.co/Mn0i56JeZg"]["This tweet is from a Republican. https://t.co/iLMMv1vncz"]["This is what I’m talking about. Stunning. He says one thing and then behind the scenes guts every proposal that would actually help working families. https://t.co/cjfYoWuM6L"]["Well I’m partial to the Marvel gang. But that Wonder Woman....strong stuff. https://t.co/9XVyWDBz7w"]["Whoops. Bad link on last tweet. Senate Bill: Millions of Older Americans Could See Higher Tax Bills https://t.co/EHHZQjCY0J"]["Then there’s this. AARP has figured it out.  https://t.co/h8Co71UXiP"]["So, it’s been a long day. Can I confess I watched this 3 times today to lighten my mood? Can’t wait to see w/ my gaggle of grandsons.  https://t.co/Q27odrozAa"]["Not the one that’s being voted on. Absolutely anti worker. https://t.co/0mbl5f8wSn"]["This is a good straight forward explanation of who this tax bill hurts and helps.  https://t.co/ntzA6G9M6r"]["While the President is in Missouri today, let me explain why this tax bill breaks his promise to not help the rich AND breaks his promise to help working families. https://t.co/pFmCr6HcbW"]["Livestream DEA enforcement on opioids Roundtable:   https://t.co/E5RWvWheRE"]["Seriously? Score? Does anyone know what this is gonna cost? \n\nSenators Scramble to Advance Tax Bill That Increasingly Rewards Wealthy  https://t.co/4Vj6eDsKVM"]["❤️❤️❤️ https://t.co/yeXSwloEtA"]["Here’s the recipe for the cake. It was really good ( my grandsons loved it)  but I’d take it out of oven at 20-25 minutes instead of 30. Just a bit dry. https://t.co/YWvML52sZi"]["2 smoked turkeys, all the fixings, pumpkin pie and my first try at at this scratch devils food cake with roasted marshmallow frosting! #mybackhurts https://t.co/dWw8tQYbAG"]["Ahem..... https://t.co/js6PQ5I4vM"]["I’m thankful for all the dedicated and terrific teachers in Missouri! https://t.co/YmJ6I5Gt78"]["Up early today in the throws of Thanksgiving prep before I head out to work. Dressing, dressing, dressing! Here’s our favorites:\n\nhttps://t.co/9lr8W42usk"]["Honored to be part of the celebration of Frankie Freeman. 103 years young. Attorney and Civil Rights icon. Glad a statute recognizing her quiet strength is now part of downtown Saint Louis. https://t.co/Wl4hqym2Jb"]["Wonderful to be at the opening of the smart home built and adapted for Officer Mike Flamion. A real hero. https://t.co/tvgXAIib9Q"]["Traveling to Houston and West Plains for town halls #48 &amp; 49. My dad and mom’s childhood homes. Will be making Thanksgiving grocery list en route. When I get home tonight I’ll make scratch cornbread, first step for grandmothers dressing. #channelingmom"]["Rs are very worried about “phantom income” for people with high incomes, but fail to grasp the concept for graduate students. So wrong. https://t.co/JknX8datwt"]["One of many reasons the R Senate tax bill makes me angry and disappointed. https://t.co/QWfj77jGTx"]["Rachel I’m fighting for you and others as hard as I can. https://t.co/iTn2hHWGz6"]["On my way to town hall number 47 in Jasper County. And more on Monday:\nhttps://t.co/vY0IzOVAp4"]["As we prepare to give thanks for our blessings don’t forget the blessing of @StJude. Amazing research and care for children, at no cost to their families. https://t.co/f5xJOalYoT Help if you can. ❤️"]["Well that’s the best compliment I’ve had in some time. Thank you so much. https://t.co/NpulfyYo3C"]["I have donated that money to Missouri food banks. https://t.co/ovHcMqQ5tW"]["The math matters. This is NOT a lifeline to parents living pay check to paycheck, but will FOR THE FIRST TIME help lots of families who make between $200,000 and $500,000. The credit needs to be fully refundable. https://t.co/GR1zuSqZlf"]["You’re right, I’m old. But I was taught to do town halls, answer any question,knock on doors, be open and acccessible to all including anybody from the press. https://t.co/XVCK1pBgTY"]["Yes I do. This is all me, good and bad. Mistakes and goofs  too. https://t.co/mvykEhbU5W"]["Remember if the Rs were just eliminating a penalty/tax that would NOT give them 300 billion to spend on corporations. Bait and switch. Eliminating 43 billion in penalties but CUTTING  364 billion from Medicaid and ACA subsidies. Outrageous."]["I really need to ask Qs of CBO about the almost 400 billion cut to people’s healthcare that Rs put in tax bill last night. Rs refusing to allow them to come to hearing. Seriously?"]["We got this at 10:18 pm last night. Expected to work on it at 10:00 am today. This is nuts. What’s the damn rush? Why can’t we have a reasonable time to read and study? https://t.co/IcetQIjaV0"]["Took daughter Lily (&amp; boyfriend Stephen) to @DearEvanHansen for her birthday last weekend. So good. And @BenSPLATT ?well..amazing. https://t.co/bIh3zgvv2r"]["As an experienced sex crimes prosecutor I recognize the shifts in Roy Moore’s “denials”. They completely undermine his credibility. I agree with many of my R colleagues. He doesn’t belong in the Senate. Period."]["The Taylor family and Enterprise are amazing. They do so much for so many with their philanthropy. Thank you.  https://t.co/ds0lHvIHSw"]["Amen. https://t.co/50ltbm1D9D"]["HouseR tax bill kills adoption tax credit but leaves carried interest loophole for wealthy hedge fund guys.So wrong. https://t.co/mCQV4R5xxx"]["As former prosecutor this is painful.It’s not perfect,but our rule of law is envy of world.Why?Keeping politics out. https://t.co/EQu4s4dPro"]["Our thanks to the great doctors and nurses and staff at SLUH hospital for the terrific care."]["Nothing like a near death experience for someone you love to get your priorities straight. He’s much better."]["Watching my husband’s heart in his room in ICU. Working better today. ☺️ https://t.co/vX23JqryMQ"]["Thank you Tom! https://t.co/HhaD4YXWQc"]["On my way back to hospital. Still in ICU but better. Fingers crossed the worst is behind us. Thank you all for your prayers and well wishes."]["My husband has a very big heart but right now not working very well. Currently in ICU. Thanks for your prayers in advance."]["First fire. 😊#cracklingwood #smoke   Early work much more pleasant. https://t.co/s9rqnKGd2O"]["This is what it’s all about. https://t.co/ZmhQqJhweh"]["We raised just shy of 3 million. He raised less than a million. His avg contrib $2300. Mine? $59. 💪🏻We have almost 90,000 contributors!"]["😂😂😂 https://t.co/Pvs7fiexWE"]["That’s what I’m proud of. Buried in KC Star article, but as far as I’m concerned the most important fundraising number. THANK YOU! https://t.co/gcAstnlGv6"]["Under the weather today, w/cold/flu BUT MU beating KU in hoops @ half for hurricane relief makes me feel better!C’mon Tigers text ur pledge! https://t.co/sB67PfLLXa"]["Happy Wedding Alex and Allie! That’s a great group of #MoSen12 rock stars. ❤️ https://t.co/hfWkHFnR65"]["Thank you Laura. It was great to be with such a large focused group of women in KC last night. https://t.co/gs6m0rBy5j"]["What we know about the R plan so far is that it’s focused on cuts that will benefit millionaires &amp; billionaires.Can’t support w/out changes."]["Please  watch this 3 minute video. https://t.co/b6lNghL28p via @youtube\nI want to be for tax reform. Simplification.Fairness. But not this."]["I love our state. Happy Missouri Day! #showmestate https://t.co/ABJGKASxZ1"]["Uh oh. Seems some folks trying to trash bipartisan deal that will bring down ins premiums on exchanges. Why? Really. Why?"]["🎉🎉Bipartisan agreement has happened that will help people get health ins. Very exciting. Fingers crossed that politics don’t get in the way."]["@jrosenbaum 🎉🎉Bipartisan agreement that will help people get health ins. Very exciting. Fingers crossed that politics don’t get in the way."]["Thank you! Over 30,000 donors in Q3. 88% gave less than $100. Avg contribution was $59. Again shattered #MOSen records raising almost 3 mill"]["Starting my 46th townhall in a few minutes in Washington,Missouri. Trump won here in Franklin County by large margin."]["@MicahTNDC Starting my 46th townhall in a few minutes in Washington,Missouri. Trump won here in Franklin County by large margin."]["Today will be my 44th and 45th townhalls this year. Independence and Maryville. Listening &amp; learning from those that matter. https://t.co/XGkSbofnbh"]["This. Very important. Oversight of govt programs and tax dollars by Inspectors General are critical and deserve support and follow up. https://t.co/IiaRs70vmw"]["The pain of the senseless slaughter of human beings is overwhelming. Surely our great nation can do better. We can’t accept this as normal."]["There’s a few hours left in this fundraising Q. I’d really appreciate it if you would consider a $10 contribution. https://t.co/SPX25K1E1N"]["It was great to be at the Ecumenical Leadership Council dinner in STL last night. Thank you for the warm welcome! https://t.co/lGecJQI437"]["Thank you for the incredibly warm reception in St Charles. Inspiring! https://t.co/gf8nIAxVVY"]["Thank you Ben! https://t.co/gLszG4TsxS"]["Honored to speak tonight at memorial service for Steve Glorioso. A dear friend and amazing person who did so much for KC."]["St Louis and KC in top five! Nice. https://t.co/zeigfpEOeg"]["I agree with you Mr President. https://t.co/PRRb1T0TkL"]["I was there last year! Had a great time. https://t.co/KIKjHG3EjL"]["My bad. Spelling error. Sorry. https://t.co/gt0dz5yzeL"]["Heads up. I will be repelling into the dinner of the Women Lawyers Assoc  of Greater St Louis next week. 😂😂 https://t.co/Ax7Tzqp988"]["Thank you Kansas City Bar Foundation for this honor. https://t.co/xann9KuW02"]["How about those Chiefs! Yes! #ChiefsKindgom"]["No, they do not. https://t.co/dqsOJmnzlJ"]["I'll fight with everything I've got to #StopBetsy from washing away all the progress we've made protecting survivors &amp; making campuses safe. https://t.co/pD1e1AyyJ6"]["Thinking of all in FL, hopeful for your safety.#IrmaHurricane https://t.co/AfC41KrG7I"]["Nice work @RoyBlunt! https://t.co/K2JVgetxby"]["Listen. Actual fraudulent call from opoid pharma co to get fentanyl Rx authorized. See more: https://t.co/SQwalDBahh https://t.co/cHMlWgLW7L"]["One more time with corrected Whiteman twitter handle. Sorry. Thank you @SecAFOfficial for visit to @Whiteman_AFB! So proud of everyone there https://t.co/8p6k3pSJ80"]["Very proud and grateful to the men and women of @Whiteman__AFB. Thanks for the visit @SecAFOfficial! https://t.co/8p6k3pSJ80"]["So great to spend the morning with the great leadership team @Whiteman_AFB, welcoming SecAF Heather Wilson. https://t.co/Pkhac2KruJ"]["Could not agree more! Please read. \n John McCain: It’s time Congress returns to regular order - The Washington Post https://t.co/BkWSmZq487"]["Really proud of Missouri-TF1. Experts at saving lives. #HoustonStrong https://t.co/PwCvp8qH4A"]["There are lots of babies that need diapers. I'm making a donation here. #HoustonStrong https://t.co/7gkUQ7y4hm https://t.co/aGminZswht"]["Meal I made for my Hubby. Celebrating completing 25 town halls! Tuna w/tomato &amp; basil, corn soufflé, &amp; baked zucchini https://t.co/BcAeRKSOHU"]["Thank you for inviting me! https://t.co/m1GB0p3vCY"]["My coffee to go. Off to more town halls! Today in St Roberts, Camdenton, Bolivar. Details at https://t.co/o4KEWoNAvM https://t.co/jkmUFY5sU1"]["Great town hall in Ozark. Big crowds in Branson, Ozark, and Monett. Thank you! #ShowMeTownhalls https://t.co/ziFSn9daFr"]["I agree Gabe. After this week, I will have done 43 this year! For this week's schedule of 10: https://t.co/o4KEWoNAvM https://t.co/hS4hYsXFs6"]["And I love smart talented women authors who care about their community and the world! @csittenfeld https://t.co/kcWBqZ0deZ"]["Eclipse was cool, but town halls are too. 10 more this week. Details at https://t.co/5z8gcmFlwz.  #ShowMeTownHalls"]["Between Kennett and Poplar Bluff town halls had time to stop for roadside tomatoes! One dollar a pound! 👍🏻 https://t.co/5Bn3hBTO5l"]["Saturday town halls!  https://t.co/nGBAWMh4Co"]["She is special. Thanks for sharing. I miss my mother. https://t.co/wOGTqjFfPf"]["Standing room only at town hall number 29 in Harrisonville today. Thank you Cass County! #ShowMe TownHalls https://t.co/GAXuXLQDsn"]["Thanks to @SenPatRoberts for co-hosting round table on Ag terrorism/food security in KC this morning. Impt stuff. https://t.co/Q0MtFf4LGz"]["This shouldn't be hard. Condemn hate. Condemn neo Nazis and white supremicists. Condemn domestic terrorism. Period."]["When we defeated the Nazis and all the evil they stood for. https://t.co/hQ6qq8KZRL"]["Town halls for Wednesday, which will complete 26 for the year. We will be on the road for the next two weeks. https://t.co/OhxZJWMWED"]["Awww. Sweet. Congratulations Jo. https://t.co/1QhMVulm4B"]["The hate on display in VA is ugly, and morally repugnant. And it is the essence of anti-American. Shame on them."]["Also did town halls in Potosi and Farmington today. All terrific. #showmetownhalls"]["Started the day in Cuba in Crawford County. Great turnouts all day in small communities. Thank You! https://t.co/gRqhoGTOSA"]["Town hall in Sullivan. Thank you for the great welcome and good conversation. https://t.co/cwO8X9mAvA"]["It was my honor and privilege. Thank you Arla. https://t.co/u8oPsXY4sV. https://t.co/c299O2bW92"]["Very proud of this. Please listen. U.S. Moves To Amend Secret Mustard Gas Tests On Veterans : NPR https://t.co/3tAlKJsLpL"]["Now that would be some powerful oppo. Answer is I still don't watch in spite of incredible pressure from my kids who keep me up on storyline https://t.co/j9GWzfddvP"]["I think I have only had one so far in a county that Clinton won (Ashland in Boone Co). Same for August. All places I'm not very popular. https://t.co/lx2tCMVdRq"]["Um. I've had 14 town halls this year. And will have 25 more this month. https://t.co/GCykWOxnhg"]["On family vacation and just found out we are having our NINTH grandson in a row. Eleven grandchildren total. #purejoy https://t.co/T8oIhcPSkJ"]["Whoops. Fake. But could have true. That's how nice people in West Plains are. Sorry. https://t.co/cPgRu5POkf"]["Trying. Have been trying for years. I think we will now that the repeal and replace failed. https://t.co/mUzuRaA6Ie"]["That's correct. I do not accept my employer contribution. I buy on Missouri individual exchange. https://t.co/x11jnC5SBP"]["Hey @JakeTapper. Got it done! https://t.co/0xFLe8g7uN"]["I'm so happy for Arla. 3 words. We believe you. https://t.co/5liaW0Ex7n"]["@Morning_Joe in a few minutes."]["This article does NOT mention hearings or bipartisanship.No lessons learned. Trouble ahead.  https://t.co/hOkoeuJn83 https://t.co/zIboZxmUTb"]["Started in Mo 1993 by a young determined Jackson County prosecutor. Just sayin....\nDrug courts work for public safety and public health. https://t.co/uog269uYi2"]["No celebration. Time for hard bipartisan work to fix problems in ACA. We've already begun meetings, now please let's schedule hearings."]["Here we go...."]["Not sure how vote will turn out, but we have a shot."]["There is now a glimmer of hope that we stop this and hopefully start over in a bipartisan way to stabilize ins markets and bring down costs."]["We're in legislative twilight zone.Some of my R colleagues are saying they'll only vote for the bill if they're promised it won't become law"]["Painfully obvious that no Rs besides the bill handler wants to speak since he is the only one taking time.They know this is a bad bill."]["What he said ⬇️➡️\n\nSTATEMENT BY SASC CHAIRMAN JOHN McCAIN ON TRANSGENDER AMERICANS IN THE MILITARY  https://t.co/THzJblgnJ5"]["And then there is this. Rural healthcare on the line. Missouri hospital to close - St. Louis Business Journal https://t.co/cWlrtl7S1y"]["It is beyond weird that we have a big vote today but once again wrapped in secrecy. They won't even tell us what proposal we are voting on!"]["Sweet. Really nice. Thanks all! https://t.co/LtyYJRV9Ud"]["My family surprised me tonight. Great dinner at Elaia in STL. Birthdays are great at my age with family. ❤️ https://t.co/puAAeQJIyK"]["Breaking From Campaign Rhetoric, Trump Brings Terrorism Suspect to U.S. for Trial - The New York Times https://t.co/B2NSFoKZDt"]["Tyler took care of me. Nice and efficient. 45 minutes but lots of friendly Missourians. Thanks all! #dmvdone https://t.co/pHmg0oKIjM"]["😂😂😂 https://t.co/L0cmDhZfPl"]["Almost to the front of the line. #talesfromthedmv https://t.co/kpwShS9Lor"]["Why do I always dread the guy asking my weight? How many women my age fudge? #dmvstress"]["I came here from a workout. This will be the ugliest photo ever. Not a stitch of makeup. Yikes. #baddriverslicensephoto"]["This one is. Run by a private contractor. https://t.co/vFeK7UWsw8"]["Part of the line. I don't get to sit down yet. https://t.co/nirLLAMeit"]["It's that time. Hello DMV. Have to renew my license. Stay tuned. https://t.co/Il6bXO1PvF"]["🥊🥊let's go John! @SenJohnMcCain https://t.co/oKeRFWzDA4"]["I can assure you that we had 10s of thousands calls &amp; letters from home over last 6 mos.No exaggeration. Not counting the 18 town halls. https://t.co/FN4FfginOF"]["So many people, 10's of thousands in my state, spoke up and showed up to stop tax cut for wealthy paid for by cut to Medicaid. THANK YOU!"]["Worried about this. https://t.co/rNqCLOckVm"]["Feel better John! @SenJohnMcCain"]["That makes me so happy. Family favorite. https://t.co/4YtdIts4xZ"]["Re: frittata recipe. Sorry. Vidalia onions or any other onion. 350 oven temp."]["Here's my leftover frittata recipe for all those who asked. https://t.co/OqDY36hCM5"]["Made my guy a frittata from leftovers this morning. Happy Saturday! https://t.co/maGvbyKeu9"]["Let's do it @SenatorCollins. We know how to find common ground together. #friends https://t.co/ahOwBYR1OP"]["Seriously. We can't fight terrorists by cutting the very programs that protect us. https://t.co/pf9tnrkkiY"]["Another record broken! We raised almost 3.2 million last quarter with an average contribution of $57. Thank you. Really. Thank you. So much."]["You were right! Great movie. Now if I could just find one of those golden lassos to take back to DC on Monday! 😬😬"]["The winner by a mile! https://t.co/Reu9fgIXPy"]["Taking my husband to a movie this afternoon. Wonder Woman or The Big Sick?"]["In the control truck of @roadshowpbs!  https://t.co/CG2U1gwX3B"]["I'm incredibly sad.My dear friend James Nutter has passed away. There'll never be another one like him. Kind,generous,loyal,very big heart."]["That's a home run! Beautiful summer night at Busch. #STLCards https://t.co/IzektICHfe"]["@xychelsea @TransEthics Well I was at the Lake of the Ozarks in mid-Missouri on July 3. Again, not me. 👍🏻"]["@TransEthics @xychelsea I'm in St Louis today. But I agree. She looks similar."]["@TransEthics @xychelsea Nope. Not me. She's thinner!😍😂"]["Still pulling Q2 numbers together but looks good! 90% of our donations under $100. #staytuned"]["Town hall in Paris,Missouri  in one of the prettiest courthouses in the state. Check out the Missouri Seal tile work. https://t.co/1fBWbOiMau"]["Big crowd in Macon. On to Monroe City! https://t.co/64vF7KcQJG"]["So honored to meet Arla Harrell today. Hero I'm fighting for. See here: https://t.co/obxpdhj74V    Amazing story. https://t.co/XnqARMBLGd"]["Seriously adorable. #VoteMoose https://t.co/NYKW0ethTE"]["Great townhalls today. Thank you to so many Missourians for coming out. Five more tomorrow... https://t.co/OC219U6HfT"]["https://t.co/4LDRgmFWq8"]["God Bless this great country on her birthday! https://t.co/6KAUqRlm13"]["https://t.co/EU8dBcQrw0"]["https://t.co/a00epgD910"]["Thank you to the thousands and thousands of people that helped make our fundraising this quarter so strong. I'm very grateful."]["So the fundraising quarter ends in an hour in MO. I would really appreciate a $5 contribution. Thank you so much. https://t.co/SPX25K1E1N"]["Great news. New entry into ACA markets in MO.Centene will be offering insurance in 40 counties &amp;all 25 bare counties https://t.co/rOihQuUHuM"]["Looking forward to ten, count 'em ten, town halls next week!"]["I am always grateful for the nurses. Keep speaking out ! https://t.co/XCjP3BIg8l"]["Will #MoLeg who fought RealID &amp;won't pass PDMP because of privacy concerns be ok w/federal commission demanding personal info on everyone?"]["Just what I suspected as a former auditor. https://t.co/3yWlBFG2X1"]["I got riled up at R objection to letting people in counties w/no insurer buy what Congress and staff get.  https://t.co/ntcaujHVUh"]["Ds on the Senate floor begging for Rs to work WITH us to fix healthcare. Not cut taxes for rich folks, but rather fix healthcare."]["The plans available to members of Congress &amp; their staffs are national. Can be used in every state. MOians w/no plans should be able to use. https://t.co/aF6ShrOOZ7"]["You got this Mazie. Welcome to our cancer survivors club! ❤️❤️#fightlikeagirl https://t.co/hO0fANkGFT"]["What he said. https://t.co/0syN0PMIZ7"]["Thank you Kathleen and the great crowd of folks who care deeply about their country! #KC #TeamClaire https://t.co/EX337WvE4M"]["I will not quit till I get this done. For Arla and the other veterans who deserve nothing less. https://t.co/b7mQlms9ri"]["I'm almost afraid to look. #AHCA"]["Bet this will make you smile. My grandsons trying to say hello to me (CC) in the tv. 😂😂❤️❤️ https://t.co/NjqJcx56t1"]["This is NOT winning. \nFord Chooses China, Not Mexico, to Build Its New Focus, via @nytimes https://t.co/18SiV5abkD"]["So let's get it done already! Help! https://t.co/V5HxrYT9cU"]["Some info circulating about what's in R healthcare bill. Guess where it's coming from? Lobbyists on K street. #verybadsign"]["One of my favorite things at Father's Day celebration. Happy Father's Day all you fathers and grandfathers! #grandson https://t.co/eO3gE9D1AO"]["Thanks for the LOLs, @sethmeyers. Fwiw:@senorrinhatch &amp; @GOP are welcome over for healthcare dinner debate anytime. https://t.co/yIvwibxMIl"]["Nope. I wish. I'm sitting on runway on my regular Thursday night @SouthwestAir  waiting to take off from DC for STL. Bring home a win! https://t.co/Sr8Zj9TTlX"]["D and R Senators having lunch together today. Nice. https://t.co/HoSD5V9GTe"]["Please people. No partisan politics over this. Let's come together against evil. United by our common decency."]["Just talked to Capitol police, they indicate officers will be ok. Thank God. Hope true for anyone hit."]["@Morning_Joe in a few."]["And Missourians are very proud to claim you! https://t.co/cNoQlLl0Cr"]["Yes. You. Are. \n“We’ll let you see the bill when we finally release it,” McConnell said. “Nobody’s hiding the ball here.”"]["Ok. For those who've forgotten the public hearings on ACA &amp; R amndmnts,here they are(161!)from just one committee. https://t.co/UJ6j7sgKEN"]["Huh? Maybe worried you will catch the group of guys writing health care bill in back room somewhere. https://t.co/tp5u2dFldh"]["New insurer coming to Missouri ACA markets! https://t.co/jqYM9dm01t"]["We agree.  https://t.co/sHTFRoccWl https://t.co/ThyHgEnNm9"]["I love your hashtag! #rantlikeMcCaskill https://t.co/ippd7LVyHJ"]["So Rs saw the video &amp; said I was \"ranting and raving\" https://t.co/B1P4PlBhbB Help me in 18 if you liked my rant! https://t.co/SPX25K1E1N"]["@NovicSara @SenateDems https://t.co/kvmJmFC1TU"]["https://t.co/kvmJmFC1TU https://t.co/vjIY5lAdXY"]["Um. Yes he did. @senrobportman and I passed this law last Congress. See letter we sent President together. https://t.co/jA9H4836v0 https://t.co/Ap8jV43YDO"]["No question. A dark day for our democracy. Full stop. https://t.co/Ev8OvZdduM"]["In case anyone wants a reminder on the hearing process for the ACA. https://t.co/mkMxcQJ942"]["Simply false. Many hearings. Dozens of amendments added in committee. Many by Republicans. All on CSPAN. https://t.co/FLFe0VptH0"]["And there they are. My daughter and her husband. The newlyweds. Wishing them love and friendship. https://t.co/RqQCwCphll"]["This is my daughter and her fiancé right before her rehearsal dinner last night. I love them both! https://t.co/pQKW0n7t2D"]["For my very non traditional daughter/bride. Her bouquet. That's Mads. https://t.co/HDnWHaR1bH"]["Anyone who pays close attention to audits understands oversight. It's a big deal. https://t.co/GzZL5I8LuY"]["My daughter and her fiancé as we get ready for their wedding. #family #madsaboutphil https://t.co/WpFRjdl0E2"]["He was a national treasure. Much love Mika. @morningmika https://t.co/gMhKpwwr77"]["Some bipartisan action! Proud to work on this with my colleague from Kansas. https://t.co/NmsYofU0Wn"]["Thank you @FCC for acting on my request to shut down phone scam targeting vets by disabling the fraudulent number: https://t.co/0m145EWYBw."]["I have 3 important hearings at the same time this morning. Frustrating. Wish I could be 3 places at the same time."]["See you Friday MSU! https://t.co/WqVxNmzvhX"]["Look who I ran into in basement of the Capitol...awesome kids from Montgomery City, Mo. Welcome to your Capitol! https://t.co/91SwuH7H92"]["Gov Greitens said he didn't want to give names of donors of his dark $ account to the govt. No Gov, you would be giving it to the PEOPLE."]["Thank you Jeff! https://t.co/8sz0OsNZiw"]["I agree Patrick, hello to your family. https://t.co/ks4EtIjBNA"]["What a treat. Honor flight from Mid-Mo on my Southwest flight to DC this morning. #respect https://t.co/9ppKmFC8ZZ"]["Thanks guys. Great crowd, amazing energy. #teamclaire https://t.co/Jc8ol3IUQo"]["Change law to allow people who don't have insurer in their county to pick plan/use their subsidy on the D.C. exchange where Congress shops https://t.co/aoECGLflyM"]["Check out my idea for letting folks buy where Members of Congress buy health ins if they don't have plans available. https://t.co/XFZHPyLxo2"]["DC exchange has national plans, they insure  Cong staffers in all 50 states.Thats why letting folks buy there makes https://t.co/g1ULhU0EBw https://t.co/9rRkQJjMeH"]["It is a very bad idea to appoint a politician to head the FBI right now. We need a law enforcement professional. #bipartisan support."]["She deserves it. Party shouldn't  matter. She's working hard to save lives. https://t.co/KCaI033YCJ"]["I agree with @SenJohnMcCain.Unacceptable. They were assaulting these people on US soil.Turkish Ambassador should be kicked out of country. https://t.co/PtCS1qG51K"]["Senate Democrats honored to host law enforcement leaders from all over the country. #policeweek #respect https://t.co/knspW4kJYI"]["Welcome to the club of cancer warriors! You got this Mazie. ❤️#fightlikeagirl\nHirono Diagnosed With Kidney Cancer https://t.co/ocm6ggFBVI"]["Intelligence on ISIS is our most valuable asset in war against terrorism.Extreme caution must be used to protect it &amp; allies that provide it"]["Whoops. Forgot link. Sorry. https://t.co/9bix38VDty https://t.co/AA9JcBT4iO"]["Thanks Miss Dazey. Here's a link to the op-ed. https://t.co/AA9JcBT4iO"]["Proud of Boeing.Shelley Lavender and Leanne Caret are their high powered leaders(CEO Defense,Pres Boeing Military)#TX https://t.co/J0AMS5z1eW"]["I agree. Give Grant a break. The source he cited was just wrong. Thanks all! https://t.co/fK52o2N0my"]["Um. Not true. It's been a couple of weeks. https://t.co/pQ9HTBpHVj"]["Today is military spouses appreciation day. From the bottom of my heart I salute you and the many sacrifices you make for our country. 🇺🇸🇺🇸"]["Simple fact.When fewer people have health care coverage it makes it more expensive for those that do. 24 mil lose care,premiums will go ⬆️"]["Thank you! It was an honor to be there. https://t.co/GCelMNlTYJ"]["On my way to interview Sheryl Sandberg about her book. #KC https://t.co/LgF3S3H3Gi"]["Wow. Big turnout. #TeamClaire #KCwomen https://t.co/ozX1ZFvMnQ"]["Great to see the entire Kander family! https://t.co/hwmgEKF0nb"]["Eureka.  https://t.co/zflTBT0248"]["That's not supposed to be an island. https://t.co/4idA23aswX"]["Flying along Missouri River.  https://t.co/YfguN1ShbI"]["Taking off.  https://t.co/y8M31BP8av"]["Preparing for our flood survey this morning. https://t.co/9iYfJ9Z7c3"]["Grateful to Coast Guard for taking me along this morning. Missouri floods. https://t.co/B6kV4TOVss"]["It will dramatically cut Medicaid. It will cut treatment for addiction. https://t.co/3kmL1n7onF"]["Just got off phone with FEMA regional administrator re:devastating flooding across our state. On it. Tomorrow will tour with Army Corps."]["Yup. It's a tax cut bill for the wealthy that cuts Medicaid and increases premiums for older Missourians. So bad. Let's fix what we have! https://t.co/YHbt2hR2Wx"]["No CBO score but the doctors in America say this about Republican healthcare plan. https://t.co/wFHrFkfGvx"]["Talking to CEO Gail McGovern of the Red Cross today. Thank you to all the amazing volunteers who sheltered 750 Missourians last night. https://t.co/4Xt7j8vhc2"]["Want to make sure all Missourians know resources available to deal with our devastating floods. https://t.co/5jrVqzcUyU"]["Nope. It's a victory for those hard working folks who earned their healthcare &amp; pension. Now let's fix truck drivers pensions.#centralstates https://t.co/mWjA61SgA5"]["Worried about all of our flooding. https://t.co/tNe7aJmpAA"]["We celebrate in Busch as Blues go up 2-1 in 3rd period. #StanleyCupPlayoffs2017 https://t.co/jjDT1a2wOg"]["Daughter Mads and I at the Cards game. Go Cards! Let's Go Blues! Big night for STL. https://t.co/apzQIQtE8R"]["Wrong. Along with @Sen_JoeManchin the Ds have been fighting for months to get this done. McConnell has been blocking. #asktheminers https://t.co/qSkQ42P04q"]["Please Mr President. Help us help them! Miners Lament Trump’s Silence on Imperiled Health Plan https://t.co/swrEp79TIP"]["Jerry was the consummate professional, even when all our hearts were breaking over the death of Gov Carnahan. RIP. https://t.co/Bj2famC9yW"]["Thanks to all who came out. Good questions. https://t.co/iL3oGPjKT7"]["Wish him well but still wrong that college campuses are now 6 mos NBA training camp. \"student athletes\"? Nope. #NCAA https://t.co/e2iFdj6Hk8"]["Way bigger than him. Love my youngest grandson. Go Chiefs! https://t.co/wb1YvREyQZ"]["Sorry @amyklobuchar but...LET'S GO BLUES! #StanleyCupPlayoffs2017"]["With over 5,500 BRAND NEW Missouri donors and avg donation of $58! Thank you! https://t.co/isszV0APk5"]["Yikes. https://t.co/KB8fKfG9jM"]["Thank you Steve. That means a lot. https://t.co/z4cW5uDcz5"]["Great townhall in Sikeston. Lots of folks came on their lunch hour. Different opinions, good questions."]["Thank you! https://t.co/x9X8noTKyD"]["No, Thursday afternoon.  Hillsboro,Sikeston, and Fulton tomorrow. https://t.co/DuScREROoy"]["The almost Bride, along with Maid of Honor , and me. Mom. #mygirls https://t.co/Vz26Q2UXN7"]["My statement on strike against Syria:\nhttps://t.co/BjOcEgULqX"]["Hope this is a blip and not a trend. Not good. Job Growth Loses Steam. We only add 98,000 in March, via @nytimes https://t.co/fiDCh0B5cO"]["Nope. The town halls will be all over Missouri. https://t.co/IQfa1uxr71"]["Eight townhalls next week. Places, dates, and times coming soon."]["Assad=war criminal. His ally Putin=aiding and abetting."]["Good audit. MO state budget 1/3 federal money. Audit shows MO not paying attention to waste fraud and abuse. https://t.co/G2tyXqr6W8"]["Hate to miss opening game but #CapsOn. Go Cards. #Cardinals #OpeningDaySTL https://t.co/HSg4e1L2LQ"]["Sunday morning. Grandchildren. Standing at attention while watching Return of the Jedi. Perfect. #StarWars https://t.co/Fk6hvoxUt3"]["Sad! \nCaterpillar shuts plant in Aurora, Illinois, that employs 800 | Reuters https://t.co/HvKH68c7lf"]["Gorsuch: Good for Corporations, Bad for Working People https://t.co/HH8FVzUr1Z"]["No on Gorsuch: \n https://t.co/LfP5n4QyNC"]["Very bad: Trump's travel ban could cost $18B in U.S. tourism, analysis shows https://t.co/HuEHjBFoXw"]["We have 5% of world population. 80% of opioids.  https://t.co/7nxfOCvJup. Time to get to the bottom of it."]["Time for investigation into manufacturer &amp; distribution of Opoids.Why is US alone in being flooded with these drugs? https://t.co/kgGWbAkHTV"]["It's a tax cut bill for the wealthy that takes healthcare away from everyone else. https://t.co/7v0IgT5Zpj"]["Trumpcare is more of a tax cut bill than healthcare bill. Powerful chart that shows priorities.  https://t.co/MfcOAZP6XT"]["This is just wrong. How the Rich Gain and the Poor Lose Under the Republican Health Care Plan - The New York Times https://t.co/sbwWtSFop4"]["https://t.co/oymuXEXSp0"]["Trump healthcare bill 300 BILLION  tax cut for wealthy AND cuts access to treatment for heroin addiction. https://t.co/5wVIKbuZdW"]["Trump healt https://t.co/5wVIKbuZdW"]["Seriously? Unbelievable. Exclusive: Tillerson plans to skip NATO meeting, visit Russia in April - sources | Reuters https://t.co/vQNmpybPaY"]["Lucky to have so many thank you notes to sign. So grateful. How about $5? https://t.co/XP5h4rmIAT https://t.co/C81W3N2jbK"]["A St Louis icon who will be missed. Thank you Chuck for the legacy of your music. https://t.co/VOnatAOEzF"]["Impressive. Congrats to a fellow Kewpie! #Mizzou https://t.co/hsU1q4k7uB"]["Down by 13 at half, women Tigers make it happen at the buzzer!  🏀#Mizzou"]["Remember these budget cuts being delivered AT THE SAME TIME President is working to pass a 300 billion dollar tax cut to wealthy."]["Sorry Frank. The seniors who need  Meals on Wheels are not following your twitter feed. And can't afford broadband/smartphone/laptop. https://t.co/nmKr9DzIne"]["Turns out that the President's idea of \"taking care of people\" is a 300 billion tax cut for the wealthy and eliminating Meals on Wheels."]["2 certainties. 100s of billions of dollars in tax cuts for wealthy and it will be brutal for Missourians b/w 50-64.  https://t.co/EbTn8BQTDZ"]["Great advice. You're right. https://t.co/GPdQ3CWN0R"]["Taking 15 minute recess to fill out office bracket. Wichita State or Kentucky?"]["So much for taking care of the forgotten Americans.  https://t.co/E1BXaZaM3O"]["Is anyone really surprised?So wrong.Wealthy Would Get Billions in Tax Cuts Under Obamacare Repeal Plan, via @nytimes https://t.co/E1BXaZaM3O"]["Thank you Sarita. Means a lot to me. https://t.co/Tpx1WPLFgB"]["Thank you! Right back at you. I really enjoyed Elgible. https://t.co/xssk4Jp7uh"]["@SFofStL Re: prob w/FAFSA u tweeted about last https://t.co/ptBfcv300W's work around. https://t.co/RyCgZf1dIb"]["Happy for Kim. And great for the team. M I. Z. https://t.co/VuzTtMGEsp"]["Great group of 9th graders from Central Reform Congregation St. Louis visiting DC Thnx 4 stopping by!@WakeUp2Politics https://t.co/Gy0bzbv7t9"]["Ironic that Trumpcare hurts older Missourians in rural areas and helps younger in urban areas. #hurtsTrumpvoters"]["I'm on it. You will hear from us first thing in the morning. https://t.co/pAs7lFlQH8"]["Trumpcare: \"1. This is a major tax cut for the rich. 2. Lower-income workers are going to feel the biggest squeeze\"(From WashingtonPost)."]["We made mistakes on process of passing Obamacare. Trumpcare repeating those mistakes on steroids. Jamming bill, no cost estimate, no D votes"]["Great to visit with a warrior for women being treated with respect and dignity. @GretchenCarlson. Watch for her book! https://t.co/hJFZAYNCNd"]["Good luck to all the candidates in St Louis City municipal elections tomorrow. If you live in the city don't forget to vote!"]["WHERE IS THE BILL? G.O.P. Accused of Playing ‘Hide-and-Seek’ With Obamacare Replacement Bill, via @nytimes https://t.co/ZWW7Jtsuhs"]["As the chief law enforcement officer in this nation,he should resign.He sets the example,good prosecutor knows better https://t.co/R0uO4DcPxy"]["Again, As senior member of Armed Serv, never received call or request from Russian Amb for meeting. Never met one on one w/him."]["I've been on the Armed Services Com for 10 years.No call or meeting w/Russian ambassador. Ever. Ambassadors call members of Foreign Rel Com."]["So good to see my friend Michael J Fox in the Capitol.He was a big help in my first campaign. Remember the ad? https://t.co/9IgkN6zGN7"]["Deadly tornado in MO this evening, touched down near Perryville. Lives lost. My prayers for their families."]["Insulting to Missouri Rs. They don't need help figuring out critical tweets about me. 😬Besides those tweets are lame. https://t.co/6cjl222nIo"]["Totally nuts. DeVos pretending that establishment of historically black colleges was about choice not racism. https://t.co/gROpItxRx4"]["It was an honor to be there. Lots of good questions! https://t.co/cMazRTWUnn"]["First costumes to arrive at family Oscar party. I made Manchester by the Seafood casserole. 😊 https://t.co/xyBMRcf1Pk"]["At PBR in St Louis tonight. Exciting and great fun. With my sisters, one of which is PBR fanatic. https://t.co/dKj6AOGc9H"]["These men worked hard &amp;played by the rules. They were promised a pension. I will fight for them. #pensionpromise https://t.co/jOszZ3aeMI"]["‘It wasn’t right,’ says Olathe man wounded at Austins while trying to stop shooter https://t.co/PHIZwtypWi (2/2)"]["Pure hate &amp; one hero in KC. Murderer bragged to bartender about shooting men from \"Middle East\". They were 2 engineers from India.(1/2)"]["Wonderful to meet and learn from the Border Patrol. Our night crew. https://t.co/6osibS0OuZ"]["Please catch the hateful, evil people who did this. This is not normal. Or acceptable. This is not what America stands for. https://t.co/qjv22Db1dg"]["Last night on the Mexican border in Rio Grand Valley with the Border Patrol. Learning about their challenges &amp; needs. https://t.co/ZeY8GuEInL"]["Thanks Jason. @Let_AmericaVote  matters too! https://t.co/X6G35Pnme4"]["Proud to work with Ashton Kutcher @aplusk to wipe out evil child sex trafficking. His software &amp; people at @thorn are making big difference. https://t.co/sq5lltv7zq"]["Well this is quite a turn of events. Rs said\"Repeal and Replace\" for 7 years. Sounded simple? https://t.co/hBjU4MjVdC https://t.co/DwtkagDrVp"]["This is Darrell Issa's former spokesman stating the obvious. Are you paying attention @jasoninthehouse? Hello? https://t.co/m9BuzrmFAJ"]["Please call, write your Senators &amp; Reps asking for select bipartisan investigative committee on Russsian involvement in admin &amp; election."]["It's time for a select bipartisan committee on the involvement of Russia in this administration and election. Period. Stop. Public hearings."]["Not so fast my friend. Cardinal Nation will have something to say about that. You guys aren't due for another 100 years.  😬 https://t.co/BNP8AQsPl6"]["List of Things Progressives Should Do Before Primarying Joe Manchin – Medium https://t.co/kluZlZpPi8"]["Woody Overton proved that you could have a true and loyal friend in politics. I'm so sad. Love to Jane and his daughters."]["Sweetest guy in the world, with a giant heart,now has a better functioning heart.He says thanks for all good wishes. https://t.co/Vie6b9XyPU"]["As I announced yesterday,I needed to be home with my husband for his heart surgery this am which is happening right now. I would've voted no https://t.co/oiLgxs3Xyw"]["At the hospital early for husband Joseph's surgery. Thanks to everyone for all the good wishes."]["It may be the biggest political fraud of all time if Republicans do not move to repeal AND replace."]["On a day when we show support for law enforcement in DC,my thanks to Capitol Police &amp;all Senate staff 4 round the clock work last 72 hours"]["McCaskill on DeVos: I don't understand how you can give the back of your hand to rural America - YouTube https://t.co/DJXdrXftR4"]["Thank you Dorothy! https://t.co/yGQOcEhozW"]["DeVos is so out of touch.Parents in rural Mo don't have choices b/w public &amp; private schools.They rely on strong public schools. #NoOnDeVos"]["Here for the screening of this important documentary. Our work shutting down Backpage child sex trafficking included. https://t.co/yskepn72x3"]["Had my one year follow up for #breastcancer. All good!👍🏻thanks for all the hugs&amp;prayers from strangers the last year. #fightlikeagirl"]["1)Gov Greitens is a politician. 2)He is totally making up that budget shortfall due to Obamacare. MO blocked Obamacare expansion."]["Oh yes, there is definitely a repeal coming. But as it turns out the replace part was a cruel fraud. https://t.co/jWsqrAkn05"]["In case you haven't figured it out yet, there is no replace."]["From St Louis to you. AB Super Bowl ad for Sunday. https://t.co/1AYMU9NlrX via @youtube"]["Unbelievable.We should be INCREASING sanctions against Putin who's shown his goal: break the back of every democracy https://t.co/vbdjfOLFfh"]["Be careful #moleg. Look at Kansas. RTW just hurts worker pay. (Bureau of Labor Statistics data) https://t.co/7xB8y39UhH"]["Beyond infuriating. Let's get to work.As opioid deaths rise, pharma firm hikes price of antidote more than six-fold https://t.co/vXSneZw6Q1"]["Why would anyone think that because I support confirmation hearing &amp;60 vote threshold for SupCt nominee that means I'm folding to Trump?"]["For the umpteenth time....No. https://t.co/HfWWB5E0dR"]["Filibuster = 60 votes procedurally.Different ways of saying the same thing.I support requiring a 60 vote margin for all Supreme Ct nominees"]["We should have a full confirmation hearing process and a vote on ANY nominee for the Supreme Court."]["This is the former Communications Director for Reagan. I would add ....and making us less safe. https://t.co/7pBsK04azD"]["All Democrats on Homeland Security sign letter to General Kelly asking for answers and immediate meeting.   https://t.co/kLyGqSt7s6"]["Sorry for the technical glitch. I traveled to Jordan to observe extreme vetting currently in place! Please watch. https://t.co/OMLYTfMO4p"]["No,visa is not always required. Many countries have visa waiver status.We changed law:require visa 4 those who'd traveled to some countries. https://t.co/4ZWohGAGev"]["The executive order doesn't make us safer.Jihadist groups hail Trump’s travel ban as a victory - The Washington Post https://t.co/ocDftOSLna"]["To be clear, the only identification of certain Muslim countries prior to executive order was requiring a visa, not banning."]["You can't make this up...Who Hasn’t Trump Banned? People From Places Where He’s Done Business - The New York Times https://t.co/IuDOKrKZkA"]["Keeping the leader of our active military out if the National Security Council is outrageous.Putting political hack in his place even worse. https://t.co/qTzxm4KCEJ"]["This makes me want to throw up. https://t.co/R7Gf9Yc5Js"]["My statement. https://t.co/3qE3d4AdJ7"]["I'm guessing his business interests. https://t.co/AcIfcmymjz"]["He actually said this last week on Morning Joe. https://t.co/Xo4tXEiMzO"]["The Statute of Liberty is a patriotic symbol of our values, including these words that appear on it. https://t.co/RAKHVq8mZ2"][".High praise from one of St Louis's finest and one of the funniest women on the planet. @kathleenmadigan https://t.co/LKHDW69Epz"]["I love the hater on my twitter feed today that keeps telling me to take Midol. Does he know I'm 63? 😂😂😂😂😂"]["I'm not going anywhere. Time to fight. But thanks for the kind words. https://t.co/WW57jnhBYm"]["It's wrong for the leader of our closest ally to be partisan.Speak to our country. Not just one party.Disappointing. https://t.co/UdRr85Dbbe"]["Any federal employee who wants to visit, we will listen. We will protect you. whistleblowers@mccaskill.senate.gov\n202-224-2630"]["Thank you. I love my staff. They really care about serving the public. https://t.co/oPeuNJJAwZ"]["So sad about Ventura. What a tragedy. #RoyalsFamily"]["Thanks to all the police officers around the country who assisted an enormous outpouring of peaceful protest. #safe https://t.co/jedocEZMqQ"]["I have not regained a pound in six years. Period. #SpicerFacts"]["Thank you Denton. Let's do this together! https://t.co/ORQs5MKGgz"]["History.Millions of women stood strong today. Now it's time to fight.2018 is soon!Please give $5 https://t.co/XP5h4rmIAT #Marchers4McCaskill"]["Marching today in St Louis reminds why I fight. It was inspiring. I was proud. And it was YUGE! #WomensMarch https://t.co/9kMJetxQCN"]["This doesn't even show the entire crowd. It was amazing. Inspiring. Thank you all! #WomensMarch https://t.co/9WWP7TQCCv"]["Wearing my mom's name around my neck today as I join women across the country in historic day of marching &amp; protest. https://t.co/6UzhcJAVhl"]["Raising premiums on homeowner insurance right out of the gate. Yikes. https://t.co/UvY0XX8AXs"]["Amen. I agree. And I didn't make that assumption. https://t.co/umyiA4KsVd"]["Stop already. I love protests. Hate violence. Quit twisting my words. https://t.co/eu5cWeJz0R"]["Is this draining the swamp? https://t.co/0x7CusYrKT"]["I understand the angst out there today for all of you throwing stuff at me. Sorry, but I believe  peaceful protest is always the right way."]["Seriously? MLK and John Lewis were and are the role models for peaceful protest. https://t.co/hI2HfvtX1D"]["But the small group will get all the attention. Sigh. https://t.co/WI1SohDTb2"]["This. Yes. And proud to be just that. https://t.co/Bz62kqUjKI"]["Nothing is more unAmerican than protesters who are not peaceful. Disgusting."]["2 things needed  today in DC, along with a determination to fight for what I believe are American values. https://t.co/j55ra9cVZs"]["Even though I don't watch it anymore...apt analogy to winter. https://t.co/V8iYdJ2Jck"]["Umm, for most of the hearing there was just one. And honestly I'm not angry, just worried. https://t.co/NNF5zZOC1g"]["Thank you to one of St Louis' favorite sons! @Andy. Trying to channel  \"Give'em hell\" Harry. https://t.co/KaYqpHHZ7W"]["So proud of Missouri's Whiteman AFB and the 509th for taking it to ISIS. Thank you! https://t.co/kHedb7uAvv"]["I appreciate that Mr Mnuchin recognized the validity of my ?s about foreign investment in Trump's business as relates to nat'l security."]["Some of Trump's cabinet picks have been good, others.....terrible."]["Hmmmm. And she acknowledged her family has given 200 million dollars! Swamp cabinet? https://t.co/z15Q2Ux0N9"]["After watching my colleagues question DeVos it is now crystal clear why the Chairman limited questioning. See previous tweets."]["Well that's weird. What's up with that? https://t.co/PmABPz141y"]["Am I living in a Tom Clancy novel? \n\nhttps://t.co/UyC6X0GiSP"]["I recommend seeing Hidden Figures this MLK weekend. Inspiring movie. #courage"]["Because there is no replace I voted no  on repeal. This is called repeal and run. Chaos is coming."]["Showing off my grandson as we FaceTime in the cloakroom. #voterama https://t.co/uTfL1CGXXM"]["Amen sister! https://t.co/Ntrf30qUcb"]["Strong leaders set an example. If Gov Greitens is serious about ethics he would immediately disclose where 1.9 mill in secret $ came from."]["It is unimaginable that Rs would talk about replace for SEVEN YEARS with no idea how to do it. Where is the plan? Chaos is coming."]["General Kelly is good choice for Secretary of Homeland Security. I believe him when he says he \"will speak truth to power.\" Good answers."]["After our report last night. BACKPAGE SHUT DOWN ITS SEX CLASSIFIEDS.  Investigations matter. Hearing this morning w/ Backpage execs."]["We issued report last night showing Backpage knowingly assisted selling children for sex.Backstory on investigation: https://t.co/kuCBSTFf6w"]["Stay tuned. BIG REPORT out tomorrow. It pays to never give up. Congressional investigations matter. https://t.co/21VERf7KkJ"]["Happy to be with Mayor Tergin of Jefferson City on inaugural day. https://t.co/h0pl8B9SvZ"]["Gosh almighty I wish every American would take 10 minutes to look at this data.  2016 in Charts.  https://t.co/iIiN0sRecN"]["Intelligence community is the FIRSTLINE in our war against terror. The disrespect shown them by Trump is stunning.They're the best in world."]["AFC WEST CHAMPS! @Chiefs #ChiefsKingdom  So fun."]["So lucky to be with my family on NYE! Hope you are with yours. https://t.co/vugm8vXSAo"][".@KurtEricksonPD Thats me as a new mom at my desk in Jeff City in 1988. Didn't slow me down,&amp; still waiting for the father in office story. https://t.co/wZup4Vwuie"]["Our ENTIRE cyber intel community,best in world btw, agrees that this guy tried to mess in our election &amp; the Russians are RT TrumpPutin love https://t.co/sCYfytrwMF"]["Proud of this:    To Stop Price Spikes on Prescription Drugs, a Widening Radar - https://t.co/WhbmDdQGAf https://t.co/4QswhpPJ96"]["The best present is always the empty box. MERRY CHRISTMAS TO ALL and to all a good night.! https://t.co/MLMguH1JUe"]["Whistleblowers deserve protection. Those who retaliate against them should be held accountable. https://t.co/q4uzph6UXn"]["Amen Harry! https://t.co/iDCHNarBAU"]["That thing could come in handy for dealing with people who cheat and scam seniors! Feel better friend! #agingcommittee https://t.co/A9euh88p83"]["Thank you. So much more to do.... https://t.co/4VH4sHxTpr"]["For 3 years I've been working to get providers to give available tech to consumers to block robo calls: https://t.co/kGOraCk964. AT&amp;T first!"]["I'll be snapping holiday fun with my family for next week or so. clairemccaskill. There will be no repeal of fun but there will be chaos!🎅🏼"]["Will continue my oversight work as new Ranking Member,Homeland Sec &amp; Govt Affairs Com.Also will continue on Armed Services and join Finance."]["Talk about PAY TO PLAY. This is unbelievable. And so,so wrong. Corrupt. https://t.co/3OFjsDUWZv"]["Oh you're wrong Rand man, the dark side will never prevail. Remember....\"Hope\" https://t.co/1D7Tt1oYMK"]["I am with the force, the force is with me."]["National Champions. AGAIN! Congrats to the unstoppable @NWBearcatsFB."]["Proud to have worked with my Republican colleagues to strengthen the powers of Inspector Generals throughout govt. They're your eyes &amp; ears. https://t.co/xNiBgy8Ot6"]["Hey @Andy Look who I ran into Christmas shopping over lunch!You're in trouble, we're now besties. #Andy'smom https://t.co/siybaFtw81"]["My dumb thumbs. Lindsey. Friends forgive misspellings."]["I'm down Lindsay. https://t.co/OaNW1KAAOo"]["I am lucky to have a hard working,smart, and creative staff! https://t.co/WqPd9Q4bl8"]["Unbelievable. But not fake.    https://t.co/INxRMigk1G"]["Nice. https://t.co/qRHLP0YPbf"]["Fun interviewing @Andy about his book Superficial tonite in DC. St Louis love. https://t.co/E8xMfSqX37"]["The Democrats are fighting hard RIGHT NOW for coal miners and Buy America that the Republicans in House took out of bill.Crickets from Trump"]["Weird. No. https://t.co/WOX4Rw5cFH"]["I am hoping yes. This is a big bipartisan deal. https://t.co/b3HRWM3k7p"]["No place like home for Christmas. Pi pizza in DC for our office holiday party. https://t.co/gcmj8Eh494"]["Funniest secret Santa gift? Al Franken got a Chia Donald Trump. https://t.co/ZzMJfMDaOB"]["Seriously. The miners and their widows thrown crumbs, after Trump said he was their champion. We should not go home until we fix this. https://t.co/zXiuxrCleE"]["Just came from classified briefing on Cyber from Admiral Rogers. Very proud of our cyber warriors. So skilled, on defense and offense."]["Best news of week. My whistleblower protection bill passed.All whistleblowers,even contractor employees protected. Pretty impt right now. 😳"]["Completely unacceptable. On it. Pentagon buries evidence of $125 billion in bureaucratic waste - The Washington Post https://t.co/vgGIFIlwUb"]["Now's the time for Trump to stand up for coal miners. Ds trying to fix their health &amp; pension problem &amp; we're facing a fight from other side"]["Ridiculous that we're sitting around guessing what's in bill to fund entire government that they want us to vote on in less than 3 days. https://t.co/WDzuWC4MtQ"]["Remember \"read the bill\"? Rs are not even allowing us to read the legislation that will fund the government come Friday. Regular order? BS."]["No worries. It will be on TV in a few weeks. Don't miss it. CBS. https://t.co/kAdJlPFehp"]["Nope. Pacino this year. https://t.co/R1IidqcQeT"]["Snapping Kennedy Center awards."]["Whoops. It's Pacino getting recognized. De Niro already won this award. I'm pretty sure I'm not the first one to confuse them."]["This will be a good one. James Taylor, Eagles, Di Nero, Mavis the amazing,and more.... https://t.co/ikV7dXmMwq"]["Ok. Listen. @Chiefs have won 20 of their last 24 games. Time for some respect. #ChiefsKingdom #getnorespect"]["Wow. Thank you! Some of my twitter followers call me something else......😬 https://t.co/PXOhMkbFHI"]["There appears to be some confusion. https://t.co/6Q88BcmmaW via @youtube"]["Anxious to find any swamp drainers in Trump cabinet nominees. So far all Wall Street and consummate DC insiders. #fillingswamp"]["Whoops. Previous tweet had mistake. Johnnie Johnson got Congressional Gold Medal, not Medal of Honor. Sorry."]["In honor of Johnnie Johnson getting Medal of Honor for being Montfort Marine,how about some of his amazing music?  https://t.co/BE8PrzWoux"]["Ceremony was very special,I was honored to be part of it.Every veteran should receive the recognition they earned.\nhttps://t.co/LzlqjadrUS"]["Tonight first time @retreatgastro. STL folks need to check it out. Serious good food. And fun."]["If this doesn't make you smile your heart isn't beating.My grandsons.All 7 of em.Crazy fun.Let the Santa stuff begin! https://t.co/5Ee283TbB9"]["Not a good thing that I'm very excited over my football team winning one game. #Mizzou #nextyear?"]["That is so very nice of you. Have a wonderful day! https://t.co/9XO0sjWdvY"]["Transfixed by Thanksgiving parade. https://t.co/sOYQxdmIpn"]["Maddie home! Lily soon! Love when my kids all here (&amp; they've grown into wonderful sous chefs). Fun times in kitchen, heart of the home. https://t.co/3Z6UMhASfJ"]["And this is the finished product. https://t.co/ObLUKuafLD"]["So here's the Fall Sangria recipe. This year you may want to triple the recipe. https://t.co/jvJJc3AcLa"]["My seriously delicious recipe for fall sangria coming up later today."]["Serious prep for feast beginning late afternoon. How many are you cooking for? 24 plus for me. Follow the journey  on Snapchat.#gobblegobble"]["I might actually be for it if I knew what it was. Can anyone find replace? https://t.co/E8dNoiiUPz"]["Wow. Big congrats to our Kirkwood Pioneers on the state championship! Impressive win. 🏉"]["And to top off the day, catch this in Washington Post: https://t.co/KdfhsduQQR\n\nWhat happened to Trump promise to protect Medicare? https://t.co/DpvTmYWoAt"]["Well I'd hope it would be done in public. #NOTdrainingswamp https://t.co/ZqGD7DY5XL"]["Well we nailed em.Rs tried to bring back earmarks with secret ballot in closed door meeting. But watch,now Ryan says gonna try in the open. https://t.co/p1bGT3LXjw"]["I fought them from the day I got here. I will fight them coming back with everything I've got. https://t.co/36C3aTuEpg"]["Birth control does not make women crazy. A man who allows that headline in his publication is. Unacceptable choice. https://t.co/v3MVWsJipb"]["Drain the swamp?Week after election Republicans meeting behind closed doors to grant lobbyists dream of bringing back earmarks.Hello swamp."]["I'm trying to get a grip. But this took my breath away. https://t.co/6FZnGZBq8k"]["Well then. On my way to airport for SW flight to D.C. Song on radio? \"Ready to Run\" by Dixie Chicks."]["Honored to be here with Wash U veterans tonight. Great panel discussion to come. https://t.co/wyT0hYT8km"]["Veterans deserve  more than our kind words on Veterans Day. They deserve respect and support everyday of the year. #VeteransDay"]["Congratulations to President-elect Trump. I will do my level best to work with him for the good of our great country."]["For the first time wearing my mother's charm bracelet today. This one's for you mom. #luckycharm https://t.co/cmrXlGMKAM"]["I love voting. And today I really really miss my mother. https://t.co/2MJSArKdaM"]["I do too. https://t.co/hCjRreBKji"]["No question that if Trump were a Cleveland fan he would say it was rigged."]["Holy Cow! We have a game! Great baseball in this Series. Gonna be exciting ending, no matter what."]["Going too fast cause Sec Carter was speaking and missed spell correct from Wood to Ward.Grew up around here/know the name! Sorry FLW!"]["With Sec Defense at the great Fort Leonard Ward.To soldiers: \"What you do is the noblest choice an American can make\" https://t.co/a7BQZrTrZq"]["And West Virginia. https://t.co/1LLKMWQLxE"]["Amazing civil rights icon &amp; lawyer Frankie Freeman,on her 100th birthday. Over 1,000 fans here for the celebration. https://t.co/V1QtXFHQDv"]["So proud of these great Missourians who are keeping us safe every day. https://t.co/UopVI3mtxf"]["Want to take this opportunity to agree with WSJ. Bigly. https://t.co/wQ7xITQpyo"]["Obama Tells Trump: Stop ‘Whining’ and Trying to Discredit the Election, via @nytimes https://t.co/njxJgnqPH0"]["Amen.\nIf Hillary Clinton Groped Men, via @nytimes https://t.co/wbxd7RNlHA"]["And believe me the FBI is not a bunch of liberals. https://t.co/aZsxsDD6yV"]["We teach our children that only true losers complain about the rules or refs when they are losing fair and square."]["Missed #777x cause at Ft Greely AK gathering facts on our anti ballistic missile system. GBI integrated by @Boeing. Impressive."]["Dear Donald Trump: I played in the NFL. Here’s what we really talk about in the locker room. - Vox https://t.co/5hmQ25YKvJ"]["Always good to be back on campus! M I Z! https://t.co/HEegWt9Vu0"]["That's not fair to Todd Akin. No comparison. This much worse. https://t.co/3a9EYqkoKT"]["Network row. https://t.co/hKnutcWvan"]["Getting started. https://t.co/Oe8FtkpxXO"]["I love Wash U students! #WashUdebate2016 https://t.co/FHr3sMogl4"]["So sorry Jason. @RepJasonSmith. It's what happens when no one checks your tweets and you're going too fast. And he's a really nice guy! https://t.co/N8KXkPqvp3"]["Anne? Vicky? Eric G? Josh? Roy? Eric S? Jay? Mike? Billy? Justin? Blaine? Sam? https://t.co/w4ChFKdTcN"]["Those were the exact words used in Hawley and Greitens statement. Blunt was more measured. Haven't heard from the rest... https://t.co/BJvNvgIH5e"]["All together now Mo R candidates \"And we support this man who did this shocking, disgusting, repulsive, wrong thing\" Wagner &amp; Hartzler too? https://t.co/82TzB6NVnm"]["And \" I continue to support this man who did this shocking, repulsive, and utterly indefensible thing\" Jeez. Give me a break. https://t.co/972hEhwyMe"]["How long till Mike Pence says \"He didn't say that....\"? #TrumpTape"]["My pleasure! https://t.co/yzHnHTrG1M"]["156,000 new jobs in Sept. AND \"the labor force itself jumped by nearly half a million\" Good stuff."]["We should never forget the danger our police face every day.God Bless them. STL Co police officer killed in S County https://t.co/JJgwcEb3sH"]["So offensive on many levels.But most impt is idea that people know who you voted for. Someone tell him that WE DON'T REGISTER BY PARTY! https://t.co/62W9F5MIdq"]["My staff tells me it's #OctoberThird. Here's some \"fetch\" advice for @realDonaldTrump. No #MeanGirls. https://t.co/G12lAFT4w8"]["So this makes me so happy. https://t.co/7K81uGEcWD"]["Uhhh, really? He did it? All by himself? https://t.co/6g21xwhch5"]["Happy to be in NC today campaigning for @DeborahRossNC and the first woman President of the United States! #StrongerTogether"]["Good stuff. Needed infrastructure and jobs!  Unused 'earmarks' being re-directed into St. Louis area roads projects https://t.co/VofQQMQygG"]["Ummm. Yes. Obviously. A pointed one. https://t.co/HdczZUK60g"]["The D women Senators have talked &amp; we're concerned about Donald's weight. Campaign stress? We think a public daily weigh-in is called for."]["Hey Donald, that's what you call special interests and lobbyists. https://t.co/Fjwyrm1If8 #fraud"]["Nope. https://t.co/SXZhFQ7oH6"]["clairemccaskill https://t.co/UzNRWMQNes"]["At debate, here is giant press filing room. I'm snapping this big night. https://t.co/2bmv59kk0Q"]["Holy Smokes is right! https://t.co/B0TA5JI9g7"]["How could Mickey not fall in love with #mygrandson? https://t.co/polV1WUhBs"]["A defeat for Backpage: Let the inquiry into possible child-sex ads begin - Pittsburgh Post-Gazette https://t.co/ytb7EDHwYU"]["We are loving this lead! M-I-Z! #zousocial https://t.co/g6y4ewWSn2"]["Sometimes when people are very nice on Twitter it kinda chokes me up. Thank you! Bunches! https://t.co/5FMB76M5M3"]["Z-O-U! https://t.co/KlMLplv91k"]["My college buddy Kim with her friend. On our way to game...#Mizzou https://t.co/mNmR7I6mtW"]["Rose I can assure you I did not mean it in a good way. Context. https://t.co/GiLnBiLnDn"]["Remember, \"Dr\" says you can take a pill to get thin.'Dr. Oz Effect': Senators Scold Mehmet Oz For Diet ScamsNBC News https://t.co/uphbFGWTyz"]["No kidding. \"Calling Putin, “a thug and a butcher,” Mr. McCain said Mr. Trump’s embrace of the autocratic ruler was unacceptable\""]["YES PLEASE! \nCourt: Missouri voters can decide if they want to bring back limits on campaign contributions https://t.co/7oelHGZZQL"]["One snake oil salesman makes promises to another. \"Dr. Oz pledges to avoid questions Trump 'doesn't want to have answered\""]["fastest growth 4 middle class ever.Middle class incomes had their fastest growth on record last year - The Wash Po https://t.co/xlTn5twxWw"]["Good news. The Supreme Court has rejected Backpage's request for a stay from producing documents in our child sex trafficking investigation."]["@Chiefs have an amaaaazing come from behind victory. LA @RamsNFL get crushed. Perfect. Simply perfect first week."]["Am I small and petty because I want the Rams to get crushed tonight?"]["So sad.She was passionate and fearless.She lived a life devoted to hard working people.Proud to have been her friend https://t.co/itoZiiWxYg"]["Seriously @ESPNFantasy this is not good. Opening day? Really? #fail"]["This is a day to recognize and respect the courage and sacrifice of all first responders and their families in this great nation."]["She's so talented. And strong. And smart. Fan. 🐝🐝🐝🐝🐝 https://t.co/ZYTPv12Cry"]["I Slay. https://t.co/1SWjCswNhm"]["True confession. On my way to Beyoncé with some of my family. Very excited, snapchats coming. #runtheworld  #QueenBey"]["Oh My Godness. Two of a kind. #frauds. \"Gonna build a wall\". \"This pill will make you thin.\" https://t.co/dYODdMnr3o"]["Sen Graham also said Trump's calculation on Putin \"unnerves me to my core\" and that's coming from a Republican military expert."]["Graham on Putin:\"..dismembering neighbors through military force and being the benefactor of the butcher of Damascus, he’s a good guy,”(2/2)"]["Sen Graham about Putin:\"Other than destroying every instrument of democracy in his country, having opposition people killed,(1/2)"]["And I was happy to do it!  https://t.co/hVACTtdnQm"]["Not sure that a candidate for VP has attended a hearing in the Senate after Labor Day,but this one did. #workethic https://t.co/POZK5JiU48"]["So good to see my friend as surprise guest at Dem Senate caucus lunch. https://t.co/c6sqPx1ixV"]["Brought to you by Sen McConnell and the Republicans. Fewest days in session in 60 years. https://t.co/9G2Yqb9199"]["We have no Zika funding, we have no budget, we have no hearings on Supreme Ct nominee. Here's why. #DoYourJob https://t.co/dO4YRkyEXl"]["As usual, we woke up early at the lake to see the sun come up. Glorious. Blessed. https://t.co/Yw9wpqlyFg"]["Big win in court today against company refusing to cooperate in child sex trafficking investigation. https://t.co/KYAXOxfEUF"]["Wall? What wall? #weak"]["So impressed with the men and women in the final stages of their basic training at Fort Leonard Wood. Grateful. https://t.co/ccJXbOaArY"]["TASMG in Sprngfld today seeing how Mo Nat'l Guard is saving real money as they repair &amp; maintain our aircraft. https://t.co/4MDHFKKKu0"]["This week checking in with military in Mo. Our nations finest. Yesterday Whiteman AFB #ShowmeSecurity https://t.co/cI6Bo7IHFS"]["WHOOPS. In her new book @AnnCoulter says Trump can be forgiven for ANYTHING except a \"change his immigration policies\"."]["Only one reason @realDonaldTrump is holding rallies in deep red places. He NEEDS to feel the adulation. NOT HEALTHY! #UnfitToLead"]["So here's to @KellyannePolls on the 4 year anniversary of her other client's famous gaffe. @ToddAkin @realDonaldTrump #2peasinapod."]["Today I'm feeling especially thankful for my husband and best friend. https://t.co/niMo4vLuz4"]["Republicans hate all regulations, until they don't.  https://t.co/4ezoaXDmZ8"]["😂😂😂😂😂😂 https://t.co/oHCiH02Ikz"]["That Stan Kroenke is really a man of the people, huh? LA such an affordable market for fans.... https://t.co/RaRrzEHVuS"]["For a history guy,you don't know much about Harry Truman.He'd call out Trump as a phony bloviating god damned fool.  https://t.co/p8EXLfGvTl"]["So proud of our Simones! USA! @simone_manuel @Simone_Biles #Olympics2016"]["I am very excited that Constitutional Amendment 2 made the ballot in Mo. Effort to limit campaign contributions. YES!"]["I hate to admit this makes me smile.  https://t.co/R0QB5trJgC"]["That's so weird. So have @chuckschumer and @jontester! #Olympics https://t.co/7xqUZzt1zp"]["Court orders https://t.co/DyKJn2shdD to comply with our subpoena for sex trafficking investigation.@senrobportman https://t.co/2938FlTGu3"]["All the Rep women running for statewide office in #MO lost yesterday, even with big $ from Rex. All the Dem women won. Come on over!"]["Thank you DeAnn. There will never be another like her.  https://t.co/UG3AOcH8jR"]["Above average Joe very happy watching grandchildren play. #familyvacation https://t.co/tOxEqzHcpR"]["From Re Senator Lindsay Graham. “This is going to a place where we’ve never gone before, to push back against the families of the fallen,”"]["Double rainbow! Never seen this before. #familyvacation https://t.co/Mm1oHkChYl"]["My very favorite cowboy. #familyvacation https://t.co/RNPjkS3kLH"]["On family vacation. Daughter Maddie caught her first fish while fly fishing. https://t.co/PrBJTQFiad"]["Family vacation in WY. Reminds me how great and beautiful our country is. https://t.co/fkhEOwtGU8"]["Amen sister!  https://t.co/jr4yFLefKu"]["I'm snap chatting with my fellow women senators backstage at the #DNC. Come on over. clairemccaskill"]["My friend &amp; VP candidate came to Mo delegate breakfast this am.Started his speech with M  I Z! #Mizzou #DemsInPhilly https://t.co/KJtDe1ZYnh"]["Best part of my meeting with Missouri Bernie delegates? There were a lot of hugs at the end. https://t.co/McHCfNUZWb"]["So grateful to Missouri Bernie delegates for meeting with me.I listened and learned. Statement to follow. https://t.co/k3HWMIE7MC"]["Carole King! My buddy. https://t.co/SA199rfqS5"]["Rex call your office.  https://t.co/8NYZLfY57P"]["Checking out former Senate Chamber(1790-1800) with former presiding VPs Jefferson and Adams. https://t.co/xD2ctcgpxg"]["🎼One of the rooms where it happened. 🎼 where Dec of Independence written. #compromise https://t.co/pr4VGi0n79"]["Check out my snapchat. clairemccaskill https://t.co/xi1JGZl9fL"]["Made me nervous. Interviewed today by the incomparable Tom Brokaw. #thrilledandhonored https://t.co/s3lULAvBXj"]["Ok, going to do some snap chatting in Philly. check it out #DemsInPhilly"]["Nothing like serious grandchildren help blowing out the candles! https://t.co/Wh1jvJarAE"]["Thanks Amy, one of my besties!  https://t.co/dYtuUBKroH"]["Our Harry is grinning in heaven and sayin' \"give em hell Tim\".  Kansas City proud.  #ClintonKaine"]["Please Marlon, don't rub it in. That's what I would call fail. See you at #DemsInPhilly #ClintonKaine  https://t.co/mv3kcXaJAZ"]["Not his fault...he was brought up on the Kansas side of the line. Happens. Going to have to overlook that flaw.  https://t.co/mJSmYQnooV"][".@PonderOnThat Yes! Grew up in Kansas City and went to Mizzou!"]["He's humble.He's incredibly smart.He's a joyful warrior,a kind &amp; thoughtful person.He'll be a wonderful VP! Congrats to my friend. M. I. Z!"]["On my way to Springfield for round table on opioids and heroin deaths in our state."]["American exceptionalism went missing last night in the Republican Party. Replaced by darkness,fear, and anger...and a towering ego."]["😂😂😂😂 https://t.co/8ifA0otxlf"]["It will not surprise me if Trump enters the arena on a jet pack. #unfit"]["Second question,how can you claim to be great negotiator if you can't negotiate endorsement from a speaker YOU invite to YOUR convention?"]["First question of the day. How can you run a country if you can't run a convention?  #RNCinCLE"]["No legitimate ethical prosecutor would have ever done what Christie did last night. Ever."]["These are the vets I know. Not ones who shoot police.  https://t.co/TMJfLDrjRp"]["So if these were Navy Seal donors, let's see the list and the amounts given. The Navy Seals I know would never hide. https://t.co/wX9Ykda05K"]["Hard to pick most ironic today. Mrs. Trump's #plagiarism of Michelle Obama or removal of Roger Ailes from @FoxNews for sexual harassment."]["Scott Baio, \"Chachi\" speaks to full arena. Woman US Senator &amp; veteran put at end of program. Arena empty. Hmmmm. https://t.co/BE2PVF1ypU"]["I think they were https://t.co/z6Fcnr6uKI whole interview.I was saying they were requiring compromise.Hard for you?  https://t.co/AJw74hWG63"]["https://t.co/sVwyfEEDLM"]["Precious children at summer lunch program at Emerson Family YMCA. https://t.co/9L8AIu5fRW"]["On my way to meet with North County business leaders and city managers."]["Why do opening new Barbie dolls still make me smile at 62? And these are special! #imwithher https://t.co/meEOzAlDk3"]["No words. Just heartache. We must heal this gaping wound with trust and respect for all. So much work to do."]["Race between Sinquefeld &amp; Humphreys to buy Mo state government would be funny if it weren't depressing &amp; dangerous. https://t.co/SK9Y5k9nDn"]["https://t.co/wzVIDESsNQ https://t.co/5k8uRuaxWz"]["So many great suggestions,unfortunately many I have read. But several suggested Maise Dobbs. Haven't read, so I'm off to London in the 20s."]["Looking for good book to read over 4th weekend. Ideas? Want a light read,page turner. Love historical fiction and detective. Thank you!"]["Infuriating. @DeptVetAffairs testifies against my bill to help WWII vets exposed to mustard gas,&amp; demonstrate they HADN'T EVEN READ THE BILL"]["And despite all efforts to hide it, Hanaway is bankrolled by Sinquefeld. Period."]["Just saw LG PAC ad against John Brunner. I would bet some serious money that came from the Greitens camp. Just sayin.  #MOgov"]["Trying now for bipartisan compromise on barring no fly list from gun purchases. Will enough Rs vote with us? #Enough #NoFlyNoBuy"]["We are. Next hearing in fall. Investigating now.  https://t.co/9oD3JGUhQA"]["Funny. But pay tv customer service is not. https://t.co/Of1WHD7O7r https://t.co/bCTACkb5re"]["Was proud to visit House Chamber to support Ds who are asking for a vote on barring no fly list from buying guns. Just a vote #NoBillNoBreak"]["In Russia and China they turn off the cameras when people say things they disagree with. Not in America.#1stAmendment"]["House Ds staging sit in on House floor,demanding vote on barring no fly list terrorist suspects from buying guns.R reaction?Turn off cameras"]["This Trump supporter may go in my \"Hall of Fame of Haters.\" https://t.co/kexkuk30EB"]["Someone better tell the faux \"self funder\" to write a check. Must be broke. #fraudsterinchief https://t.co/REhSgzmZDY"]["Looking good! Love to both your mom and dad.  https://t.co/2Bn6D6V1EF"]["He gave me wings. At one of my first campaign events in 1982. Here's to fathers who encourage daughters to be bossy. https://t.co/lkF9lQA1Si"]["ICYMI.  My speech in  #filibuster today. #Enough  No guns for terrorists &amp;background checks. Simple common sense. https://t.co/nU1svnoQtd"]["On my way to floor to help with #filibuster. No guns for terrorists."]["To quote JohnMcCain:\"I know Huma to be an intelligent,upstanding,hard-working, &amp; loyal servant of our country &amp; our government.”#StopTheHate"]["There really are no words. But my attempt. Please America don't get used to this. We cannot treat this as routine. https://t.co/3KoFY6ZAbW"]["Tim is lucky,@Koster4Missouri is lucky, I was lucky. Erika is the best! #McCaskill12crew #BriesNieds #Bestwishes https://t.co/fdDlFOLNjT"]["We have given away all our hats. More on the way, we have reordered. Get yours! https://t.co/VKK3esWKKB https://t.co/1E8AUzLHnF"]["Get the facts on major reforms re: sexual assault in military. We continue to hold them accountable. https://t.co/VAYxUNoqxO"]["This is nuts,Rs complaining about Citizens United secret $ while they block reform. Can't complain if you won't fix.https://t.co/Jn70gR7nQN"]["Battle is joined. @realDonaldTrump vs  \"scripted by others Trump.\" I'm betting that the real guy continues to show up. #riskyandreckless"]["\"If you run for Pres you shouldn't be allowed to use teleprompters,because you don't know if guy is smart.\"Donald Trump.Tonight?teleprompter"]["And won't this year. Let's get rid of them.  https://t.co/HZjq74h2y4"]["Awkward pause of the day. Moment after @morningmika asked my friend Bob Corker if @realDonaldTrump is fit to be President. #heisnot"]["I think Oh should be our closer. There I said it. #stlcards"]["Fun https://t.co/WE1gtoyPo5 away my Cards tickets to deserving worker &amp; veteran I met while at Cochran VA this am. https://t.co/lQhcvka9Xw"]["Great morning at Cochran VA in STL with Dr Shulkin, Under Sec of Health for VA. Solving problems w/local partners. https://t.co/Ed4BI4k1rl"]["It was a pleasure to be there. Proud to be a product of Columbia public school system.And amazing crowd yesterday! https://t.co/a54KZoa30w"]["Want one? Get it here: https://t.co/RSL13y5jem https://t.co/dnSnLyQJdx"]["Want your own red hat, but believe the R party is going down a #RiskyandReckless path? Get em here! https://t.co/RSL13y5jem"]["Our report on Mustard Gas Experiments on soldiers.Going to work hard to make sure our gov finally does right thing https://t.co/Tou4wbqZ72"]["It is time to right this wrong that has been over 75 years in the making.  https://t.co/CbsNQR9wXL"]["As I lay my head on my pillow tonight I am full of gratitude to those who served and sacrificed, with special thanks to their families."]["@AmerenMissouri Any idea when power will be restored in Camden County?"]["Risky and Reckless hats coming soon! Perfect pic says it all.  https://t.co/LJ6jfjvklU"]["Watermelon mojito. Lake of the Ozarks. Family. Lucky. https://t.co/3jpKePpsNx"]["So tell us how you really feel. https://t.co/0jykKvXD3C"]["WA state,Bernie wins caucus,where many can't attend because of work. Primary w/open mail in ballot Hillary wins,w/twice the turnout.Rigged?"]["Five years ago today devastation hit Joplin. Today we celebrate the people of Joplin and its recovery. https://t.co/yMUaomdFEv"]["bravoandy's photo https://t.co/OG9713bmiW"]["Great to spend time with STL's own @andy helping out @JasonKander. Good to see #1 #STLCards  fan back in STL. https://t.co/tf8gJCBpxm"]["The #Risky&amp;Reckless hat will be available next week on https://t.co/rqawiGmIhY.I will tweet as soon as you can order https://t.co/SQSYLT4VFk"]["My gift to Jackson County Dems tonight at Truman. The right hat for @realDonaldTrump. #Risky&amp;Reckless #DontheCon https://t.co/ZpaeEe9d3D"]["No not together just giving @SenJohnMcCain a hard time about his team's ugly uniforms. #STLCards  https://t.co/gG1vfydwom"]["So @SenJohnMcCain  trying to figure out why @Dbacks didn't wash the bottom of their uniforms.Playing in the mud? https://t.co/X94KV37bWc"]["Great to be at Cochran VA today for opening of Women's Imaging Center.The best technology available for the best. https://t.co/aizIGhk0KN"]["Always good to get home on Thurs nights. This banner in airport. #ourteamourtown #LGB #stanleycupplayoffs https://t.co/dnbrhkpUBD"]["Whoops. Embarrassing brain freeze. Forgot that Ky Republican primary was in March and not today. Apologies to GOP."]["When I posted this before,many didn't believe it was real. It is. This is the R idea of a work schedule. https://t.co/ik2KsX7PIr"]["Mooooooose! #STLBlues #StanleyCupPlayoffs"]["And the date for Rs to pass a budget was in April. After all that outrage about passing a budget? Crickets. Nothing. https://t.co/ZLhJd14OS7"]["If Trump is not going to have billionaires like Adelson and Wall Street pay him back, why did he LOAN his $ to his campaign?"]["For today. \nTrump rules out using campaign contributions to repay himself via @POLITICO  https://t.co/4Hm8PvGONj https://t.co/hdUNvGFF5S"]