["Taking off now for a helicopter survey of Puerto Rico with the Lt Governor. https://t.co/D1tizF1fjH"]["Had a very productive meeting in Washington DC with Governor Rosselló earlier this week to discuss Puerto Rico’s continuing recovery needs. Here on the ground in PR today seeing for myself. So much more the federal government must do to help our fellow Americans. https://t.co/oNqpJn4I6N"]["I am excited and grateful for this opportunity. https://t.co/FLQc76Ln1D"]["Thank you Vanita for your kind words and for your extraordinary leadership for civil rights and justice in America. https://t.co/yiyFcNe4y0"]["Excited to join the Judiciary Committee. It'll be my mission to check awful actions by Trump &amp; Sessions; keep working to advance the cause of reforming our broken justice system; and to bend the arc of history closer toward equal justice for all. https://t.co/dvq4vdTkQa"]["Thank you @ACLUNJ &amp; @AmolSinha for working with us on this important matter and taking quick action. https://t.co/y2oYLQE1v6"]["I'll be sitting down with one of my heroes – @repjohnlewis – tomorrow morning to talk about #goodtrouble and how we keep making progress in the fight for justice. \n\nReply with any questions you have for him – I'll do my best to ask! https://t.co/KgkCCBlrcp"]["Amidst the chatter, half-truths &amp; out right misrepresentations, those supporting the deportation of El Salvadoran people who have lived in this nation 15+ years, ripping apart families, should do their own research about what role America played in the nation’s instability. https://t.co/kcN8T6OBel"]["This decision is just plain cruel &amp; undermines our nation’s values. \n\nPres Trump will rip apart families, separate parents from kids &amp; take 20 year residents &amp; economic contributors out of our nation &amp; deport them into violent perilous places. \n\nThis is tragic and morally wrong. https://t.co/oFUHloAYkC"]["@Marihoho @JonathanTamari @MelissaHartwig_ Been a vegan for years."]["Already vegan (since 2014, vegetarian since 1992). Just layering on Whole 30 reset. https://t.co/QXxMX4peYB"]["@RobbySumner @JonathanTamari @MelissaHartwig_ https://t.co/iAs9BA5j8C"]["Try this for The Whole 30 Vegsn style: \n\nhttps://t.co/iAs9BA5j8C https://t.co/kNAOGLj4xB"]["@SpunkybyChance @JonathanTamari @MelissaHartwig_ Been a vegan for years now (2014) and vegetarian since 1992. Thank you for your kind words."]["Yes, I’m 8 days into the Whole 30 (vegan style) and loving it. A good number of my friends are doing it with me. Join us @JonathanTamari and thank you @MelissaHartwig_ https://t.co/XwWwmO0ZL2"]["Proud to join @senmarkey’s effort to restore #NetNeutrality as a cosponsor of his bill https://t.co/K3OFywo3Pm"]["Wages stagnant, income inequality growing &amp; Trump tax plan makes things worse. We must focus on wage &amp; job growth: \n\n“Trump's donors are doing spectacularly well. But Trump's base in West Virginia and Kentucky hasn't really enjoyed much of the recovery,”\n\nhttps://t.co/6JVfVqbpwz"]["Thank you @ShaunKing, This is an urgent matter of fundamental justice - justice being denied to millions of Americans. The opposite of justice, particularly on this issue, is inaction, apathy and silence. We who believe in equal justice for all must act. https://t.co/cSSWXGt4kq"]["Jeff Sessions is reviving a losing war on marijuana that is devastating low-income Americans &amp; our communities of color and dashing our ideals of equal justice. We can't let this happen. \n\nThat's why I introduced the Marijuana Justice Act to legalize marijuana. Who's with me? https://t.co/OUe10vRbHs"]["Sessions' determination to revive the failed War on Drugs is fiscally wasteful, morally bankrupt, unjust—and won't make us safer. This backwards policy is wrong for America, and on the wrong side of history. https://t.co/KgoEtz3MrK"]["Trump's Voter Fraud Commission was an offense, based on a lie, blatantly seeking to suppress votes. \n\nI introduced a bill to disband the commission. I am so glad it is no longer necessary. Now that this step backwards was stopped, let's restore the Voting Rights Act. https://t.co/S4GiN0FzvA"]["Looking forward to working with my new colleagues @SenTinaSmith of Minnesota and @GDouglasJones of Alabama who were officially sworn into the Senate today!"]["More pro athletes going vegan: https://t.co/bQmSdIlpcO"]["@stardate73 So are you."]["@Raj_Jonwal Been a vegan for years."]["@vegansprinkles7 Yes, I’m sure."]["@SteveRobinsonNJ We already have. And I’ve been an architect of the resurrection of the project. With Trump a lot of challenges have arisen.  Reach out to my team for details George Helmy @ghelmy"]["@Jupey71 Nope. Been one for years."]["@cctopple @JohnOberg Wishing you the best on your food journey."]["@BrianWelfle Yes. It is so good."]["@UptownGirl_xo I’m sorry I don’t have a recommendation. I hope you find something."]["@KarryE12 Wishing you the best on your food journey."]["@njsaferatios @Donaldknottz @WholeFoods I’ve tried it. It is so awesome!"]["@dodyroller I’m far from it but thank you for your kind and encouraging words."]["@MaggieTonyGinge @bethjack2012 Thank you. You are awesome!"]["@JohnCarmack I am so deeply grateful John. Thank you!"]["@cerista I don’t mind at all. Respect everyone’s right to eat what you what."]["@billythewicked You inspire."]["@lscain3834 You inspire!"]["@ClarenceGraham2 @KamalaHarris There are other programs and people that might be able to help you. Reach out to my team - George Helmy 973 639 8700 @ghelmy"]["@ricknajera Wishing you the best on your vegan journey."]["Congrats to Atlanta’s 60th Mayor @KeishaBottoms on her Inauguration. Wishing you much success as you continue the progress made under Mayor @KasimReed."]["@KECS13 I wish you the best on your plant based journey!"]["@Blakely44 So happy to hear that. I bet there are more things we agree on. So important to focus on common ground."]["@dempsey_sandy So awesome!"]["@ginagrodzki Thank you for your encouraging words."]["@luke_harold Thank you Luke for the grammar policing. I wish you a great and mistake free 2018."]["@DrStaceyCahn I’m so grateful for your kind and encouraging feedback."]["@Deana_BG @Angela4769 Please don’t blame my very competent and capable interns for my mistakes. I appreciate you serving as grammar police. I wish you the best and a mistake free 2018."]["@jacyreese @vegan So grateful for your reply. I’ve been a vegan for years now and the evidence in this (dated) video point to truly important national and global issues. I wish you the best."]["@omaidh Great book!"]["@MyVeganJournal You inspire me! Thank you for your kind words."]["@tonynovak @BaySave I’d love to learn more about what you are doing. Can you be in touch with @ghelmy George Helmy on my team to help us learn more?"]["If you are thinking about your diet for 2018, this is a very good TED talk to watch - I found it to be very helpful and compelling:\n\nhttps://t.co/nDT9TD0vGT"]["If your thinking about your diet for 2018, this is a very good TED talk to watch - I found it to be very helpful and compelling: \n\nhttps://t.co/nDT9TD0vGT"]["@BabyGapGlobal Thank you!"]["@willow_lopez Feel free to reach out to @ghelmy to find out about our internship program."]["@kenner116 I’ve done a lot on this issue. The “vote” you talk about was a non binding resolution that would have changed nothing even if it passed. Here is an example of the legislation I am working on: https://t.co/rEYEHofO5C"]["@Action2getherNJ Thank you so much for your kind words."]["@Rose_Grundy2 Thank you for your kind words."]["@srosendorf1014 Thank you so much! Give that rescue dog a hug for me!"]["@PatriciaLWilso6 Thank you!"]["@KathyAMorelli Thank you so much for your kind tweet."]["@MeganAnne2015 Thank you!"]["@LMWalz Thank you!"]["@patty_kerr Thank you !"]["@KarenKaptures Thank you!"]["@WinnKhuong You are truly kind. Thank you for sharing this and for encouraging me with your gracious words."]["@JuliaSimonedeBe Thank you so much."]["@NoFascistsPls Thank u for your constructive criticism about my reform efforts. Always room for improvement. Hope you take time to read about the incredible progress made for Nwk kids. \n\n“the turnaround in New Jersey's largest district is nothing short of remarkable. “\n\nhttps://t.co/tSaYGnpxTf"]["@FamilyMan1927 Please give your daughter my best. And thank you for your kind tweet."]["@LincolnDebehnam I’m so grateful for your kind feedback."]["Yes I did. And continue to. \n\nAnd thank you for making the valuable point that we should do it much more than we speak it or tweet it. \n\nI wish you well. https://t.co/MhT3Zc9kA5"]["@deborah_kallick Thank you so much. You encourage."]["@ryanfinnegan Thank you! Wishing you a merry Christmas too!"]["@KenneyLive60 Thank you so much."]["Thank you for your gracious words and encouragement. Merry Christmas and may your 2018 be full of growth, prosperity and increasing opportunities to serve others. https://t.co/3ByrVColaC"]["@ohthatcarols God bless you and your the light work you do."]["I give you love today and every day Jessica. May both you and I be better, do better and live better in 2018. Merry Christmas. https://t.co/TSrucfeVqn"]["To all who celebrate: Merry Christmas. \n\nMay the reason for the season inspire us to celebrate redeeming, unconditional love and also practice it. \n\nMay we serve the poor, relieve suffering, welcome the stranger, visit the imprisoned &amp; love our neighbor (we are all neighbors)."]["Love this https://t.co/29mnPyc83a"]["Disturbing and chilling short film by @marshallcurry - The Night the Nazis Took Over Madison Square Garden: https://t.co/25GtdA1id4"]["I sure did vote NO. People’s lives are literally in the balance. DREAMers, CHIP. Enough is enough. My full statement here: https://t.co/n0FoBcKGeW https://t.co/iX5gDMRDpq"]["\"There is a dream in the land\nWith its back against the wall… \nTo save the dream for one \nIt must be saved for all.\"    \n–Langston Hughes\n\n#DreamActNow https://t.co/T7xAkX52Yt"]["Thank you @dewamavhinga for your insightful testimony at our Congressional hearing and for your commitment to a brighter future for the young people of #Zimbabwe https://t.co/oyVVSCOhB4"]["Make no mistake –– the #GOPTaxScam bill is a big Christmas present to the wealthy, the big donors, and the 1%. https://t.co/Gi5kOtFtU1"]["Pharmacies in at least 25 states have refused to fill prescriptions for birth control. That's unacceptable. And that's why I'm introducing the Access to Birth Control Act. https://t.co/R0Y74DKSpo"]["It's an absolute travesty that Senate Republicans chose corporate profit over the American people tonight. We will not forget. #GOPTaxScam"]["No clearer message for folks that every single vote counts. As always, incredible work by @marceelias and the team at Perkins Coie.\n\nhttps://t.co/q7xVH2pEJU"]["In about 5 minutes I'll be joining @RonWyden to discuss my bill, the Marijuana Justice Act, and answer your questions about the bill. \n\nWatch live on my Facebook Page starting at 6:30pm ET: https://t.co/3EiQvuGPQ8"]["Ron, I am so grateful for your co-sponsorship of this legislation. I hope folks will join us for our Facebook live session at 6:30 EST. https://t.co/gr3T3STfR9"]["Spread the word! Today is the LAST day to #GetCovered at https://t.co/vzCFCQG0U1. #EnrollYoSelf https://t.co/2yT5sthTw2"]["Spread the word! Today is the LAST day to #GetCovered at https://t.co/vzCFCQG0U1. #EnrollYoSelf https://t.co/g3nwFyub0C"]["Doh! https://t.co/u6RXN2zYVn"]["President Trump’s failure to take seriously the threat to our nation is a dangerous dereliction of duty. https://t.co/uB3LGsPNBo"]["This is an outrageous assault on a fair and open internet. Mark my words, this decision will not last! We will reverse it by winning future elections. https://t.co/J6QXOXfwAm"]["Thank you Alabama and thank you Doug Jones. I am so proud tonight that the great state of Alabama gave the whole country a needed renewal of hope and the first ray of light of a rising sun and a coming new day. Let’s savor this victory and then let’s get back to work. https://t.co/2xJtkyyQ3u"]["Congratulations Alabama!!!! https://t.co/jfgPTMqYPp"]["Wishing all who celebrate a joyous #Hanukkah full of light and love!"]["Tonight I'm joining @allinwithchris to talk about tomorrow's critical #Alabama election—tune into @MSNBC during the 8pm ET hour."]["With @GDouglasJones, visiting churches in Birmingham this morning. So grateful for the rousing greeting we are receiving at every church. The energy is so uplifting. Alabama votes on Tuesday. https://t.co/6xero2ZLSU"]["So grateful to @conniebritton for recording this. I am already a huge fan and this is huge help with the campaign. https://t.co/WEsDivkNQj"]["Since my earlier tweet, I’ve heard from former Senate Pages I’ve had the honor of serving with &amp; heard their horror at Roy Moore possibly winning. These teens are valuable parts of the Senate &amp; deserve better. \n\nCaroline Saba, thanks for sending me this: \n\nhttps://t.co/0ySWeanzZp"]["I hope your head stays safe and intact no matter what. I also hope that no matter what, both you and I find ways to return more civility and grace to our nation’s politics. We are both works in progress. May we better be the change our nation needs. https://t.co/VzuxyRskph"]["Well I am in the United States Senate &amp; I don’t want to be next to you wondering if Senate Pages will be safe from your advances.\n\nYour bigotry, ignorance, and hate has no place in the Senate. I’m going to my ancestral home state of Alabama today to lend a hand in defeating you. https://t.co/BiFmLP549I"]["@PlanetLandsman No, nor do I intend to. Their contributions from years ago when they were Dems to dozens and dozens of other Dems and dem organizations and causes should not be returned. I wish you well. Thanks for your activism &amp; engagement."]["Roy Moore thinks America was greatest during slavery: “Our families were strong and our country had a direction.”\n\nWhat direction is a nation headed when families are ripped apart, women are routinely raped &amp; bodies viciously tortured and mutilated. https://t.co/zSTJGAbdTY"]["@jimgh141 I don’t know. If you would like my team to look into it further, reach out to my state director George Helmy 973 639 8700 @ghelmy"]["@WesBridgesEsq I am deeply grateful for you sharing those encouraging words."]["@bhayes1 Thank you!"]["@Rhaj_the_wonder @RepAmyNielsen @TheDLCC I no longer take big pharma money and: https://t.co/rEYEHoxpuc"]["Thank you John. https://t.co/a1so6KcuG6"]["While getting an impossible burger #vegan, just met a group of Georgetown grad students working with @foodandfriends to help bring food to deserving folks who are struggling with life threatening diseases. Follow them and help. https://t.co/ysAoZ63iVB"]["“When life descends into the pit\nI must become my own candle\nWillingly burning my self\nTo light up the darkness around me.” \n― Alice Walker"]["“Resistance is the secret of joy!” \n― Alice Walker\n\n“Activism is my rent for living on the planet.” \n― Alice Walker\n\n“The most common way people give up their power is by thinking they don't have any.” \n― Alice Walker\n\n“we are the ones we have been waiting for” \n― Alice Walker"]["A tax farce passed the Senate Saturday. We must turn our anger into work. It’s not law yet. Continue to pressure lawmakers to vote against a bill that will grievously harm people, our economy &amp; our nation. https://t.co/NfTQJfJe1o"]["A tax farce passed the Senate Saturday. We must turn our anger into work. It’s not law yet. Continue to pressure lawmakers to vote against a bill that will grievously harm people, our economy &amp; our nation. ://www.nytimes.com/2017/12/02/opinion/editorials/a-historic-tax-heist.html"]["“The most common way people give up their power is by thinking they don't have any.”\nAlice Walker https://t.co/zyHtDzQbyp"]["I’m glad civil rights activists didn’t take your position or I wouldn’t be here. From the labor movement to the suffrage movement, folks who understood that, the power of the people is greater than the people in power, are the ones who make change despite the odds. https://t.co/zyHtDzQbyp"]["Thanks for that throw back pearl. https://t.co/D3jGMa0c70"]["Thanks Chas. I appreciate you. https://t.co/USR46M0Tsr"]["I love you and send you and your family encouragement and kindness. Thanks for your critique of my words I will take them to head and not to heart. https://t.co/CHirqMtCFM"]["Never, ever give up hope. Hope is the active conviction that despair will not have the last word. . . The active conviction... Hope works, hope sweats, hope never gives up. https://t.co/F0vAcGk6Xr"]["Sorry Chris, when I haven’t slept I sometimes slip into freestyle poetry. Look, all positive change in the US came from the average citizen. Change doesn’t come from Washington, it comes to Washington. We all need to fight. It is the obligation and blessing of citizenship. https://t.co/fDzGM1drwm"]["We didn’t invite the fight \nAnd\nIt ain’t right\nBut we all must fight \nAround the clock, day and night. \nFor those that don’t have the might\nThrough anger, frustration, &amp; fright\nFor our ancestors who set this dream alight \nUntil we end injustice and hatred’s blight\nWE MUST FIGHT. https://t.co/fDzGM1drwm"]["Unfortunately, the rules do not allow a Filibuster for the coming final vote. https://t.co/EUT1HBZe5I"]["I must and I will. We must all. https://t.co/peDDZGgFCF"]["Yes. Please. https://t.co/u4XiTSkt2J"]["@julie_nicholasi I don’t know where you live exactly. But there are NJ Congress people we need to press to vote against this."]["No it wasn’t. The ACA went through dozens and dozens of open hearings, the President went on live TV and debated republicans defending it, the process allowed Republicans to amend the bill over 100 times and it was open to public scrutiny, all before passing. https://t.co/uABSbRU1vA"]["@MLCrt01 Thank you for your kind and gracious words of encouragement."]["@chelliehylton Than you for making me smile."]["Funny, I wish you were my president. https://t.co/nZGRfghKwh"]["Kelly, I went to bed last night angry and sad. But never once have I stopped being grateful that I get to represent you and all of NJ. We must accept some defeats but never let ourselves be defeated. Thank you for giving me the honor to represent you and to fight on. https://t.co/wypxSzOtWA"]["New Jersey here ... coffee consumed, thoughts gathered and fight will continue. Thank you. https://t.co/IEdUk5qdBn"]["Yes. This no goes to a conference to reconcile the differences between the House bill and the Senate bill. Then that final bill goes back to the Senate and House for a final vote. We must work to block it then. This isn’t over. The fight continues. https://t.co/2GTDMzbPSe"]["I will never give up the fight. Thank you for the encouraging words. https://t.co/2fNZZ0rxz5"]["I broke up with sleep last night and I’m dating coffee this morning. . . I appreciate her warmth and stimulating company. https://t.co/UgQw3IUbWt"]["@BarbFalk @RepBonnie Thank you for your activism and engagement."]["@jimgh141 We continue the fight. The House and Senate will have to vote again after conference."]["@MoSilkyMo Wrong, I voted to expand the child tax credit last night. Just not the anemic one put up by Rubio that excluded legal immigrants who pay taxes."]["Thank you, so am I. https://t.co/yns1b8OcKj"]["No I didn’t (I wasn’t in Congress then). No I won’t, I was elected to speak on behalf of my state and finally... I sincerely wish you well. https://t.co/qw5ksW1Ixd"]["Scott, I wasn’t in Congress when the ACA passed. And even when it did there were days for analysis of that bill, plus, dozens of open hearings AND over 100 republican amendments added. This process was a sham and shame. No transparency or public input. https://t.co/d4EOHOuLul"]["This bill will now go to conference and have to be voted on again in the House and Senate. Please let NJ Congress people know you stand against this bill. https://t.co/Z4I2O7r6sT"]["@Wokeosaurus_Rex @pugnaciousjew 1. I wasn’t in Congress when the ACA past. 2. With that bill there were many days for reading, expert analysis &amp; more between its completion and the time the Senate voted. 3. This is NOT how Congress works. And we shouldn’t be silent when something is wrong. 4. All the best to U."]["The @SenateGOP just gave us their 500 page tax bill reshaping our tax code with just hours to read before vote. I'm going to try to read it now LIVE. Watch: https://t.co/3EiQvuGPQ8"]["Senate Republicans and their wealthy donors are trying to make Christmas come early with their tax giveaway bill. It's absurd. https://t.co/79FheG86ro"]["And outrageously they are handwriting edits into it and still expect us to vote on this in a matter of hours from now. https://t.co/PUZ84oXb9e"]["84% of Native American women have experienced violence in their lifetime. This is unacceptable. #NotInvisible https://t.co/n8BAFvHngS"]["🚨 The Republican tax bill is a morally bankrupt slap in the face to the middle class but @SenateGOP wants to pass the bill tonight. \n\n@SenSherrodBrown &amp; I need you in this fight. https://t.co/zqpvikDoaz"]["We must all speak out against the president's anti-Muslim rhetoric that serves to incite hate and division within our country. https://t.co/Wjj6qQMUsT"]["I joined incredible educators from around the country for The State Sex Ed Summit. Comprehensive science based sex ed works: 50% lower rates of teen pregnancy. 31% less likely to contract a STI &amp; more likely to delay sexual activity. Thank you to the leadership. Our selfie: https://t.co/uDXcxMaFUY"]["I've joined @SenSanders to introduce legislation that will provide our fellow Americans in Puerto Rico with the necessary resources to overcome this humanitarian crisis. https://t.co/GYEfHyd8pr"]["🙋🏾‍♂️ #BlackVegansRock https://t.co/JYbnlhHviM"]["RT: New non-partisan @USCBO report proves the GOP tax bill targets low-income Americans for tax increases – and they want to pass it by the end of the week... ⏰\n\nTime to call. 202-224-3121. https://t.co/w9P8n0XoMP"]["\"As we express our gratitude, we must never forget that the highest appreciation is not to utter words but to live by them.\" John F. Kennedy\n\nWishing everyone a Happy Thanksgiving. May we express our gratitude, and give back to those who are in need. #GiveThanks"]["@Snucka242 Thank you!"]["@PaidProtester69 @eclecticbrotha @FCC I will be fighting VERY hard. If you want more info, please talk to @ghelmy in my office: 973 639 8700"]["@AlexStandngBear Thank you Alex. I no longer take money from big pharma. I have worked consistently to not only keep drug prices down but to get medical justice for all. Thanks for your support."]["They came for our healthcare.\n\nThey took our rights to sue corporations by reversing Obama arbitration rule.\n\nThey're trying to raise taxes on middle &amp; low income Americans.\n\nAnd today, they're giving corporations power over the once neutral internet.\n\nWe must keep fighting!"]["This is a dark day. The internet as we know it is under threat and this action opens the door for large corporations to determine what we see, have access to and possibly what innovators are able to succeed or not. We must fight this decision and ultimately overturn it. https://t.co/RTow6fK7uZ"]["@aggie_m1 Thank you."]["@patch1000 Thank you for reaching out. Please call @ghelmy 973 639 8700."]["@vbab26 Thanks Victor. May we both continue to make each other think. I wish you the best."]["@brent_chism @CoreyBooker You tell me. I’ve stopped taking their money and I continue (as I always have) to support and write legislation to bring down costs. https://t.co/rEYEHofO5C"]["@carrie_j1975 Yes"]["@KathleenGlueck Thank you."]["@WalkerCeleste Thank you."]["@carolyn_magier Carolyn, please call @ghelmy my State director for an update 973 639 8700. Also, I’ve been fighting that shelter since I was mayor. I had a plan to build a new on under diff management but moved on to Senator. Talk to George about this too."]["@MFJEEB We have a process in our office. Find out about it. Call 973 639 8700. Or contact my state director @ghelmy"]["@Halcyon270 Thank you for being demanding of your elected. This is what we need. I hope you will take one more step and take time to learn what I am doing in this fight. Please call my NJ state director @ghelmy 973 639 8700"]["@arun_changa I am doing a lot on this issue: to find out more call @ghelmy 973 639 8700"]["@SwamileeSports I no longer take money from big pharma. Be the change."]["@BertzFredrick I’m sorry you believe something so wrong. If you want to discuss please call my team leader @ghelmy at 973 639 8700"]["@TruthProtected I will! I am!"]["May our outrage get us out working; for nothing will change unless we do. \n\nWhen angry, work. \nWhen worried, work.\nWhen sick and tired, work.\n\nThe opposite of justice isn’t injustice; it is inaction, indifference, apathy, and ignorance.\n\n“No struggle, No progress!” F.Douglass"]["In their tax bill that overwhelmingly benefits the wealthiest, the Senate GOP will now also endanger the healthcare of millions. https://t.co/quxN9Rc6XG"]["Every American should have a right to clean air, water and an environment free of toxins. Sadly this is not the case. #EnvironmentalJusticeNow https://t.co/LC2D1qVui7"]["@loril56 Thank you for your kind words. Thank you for persisting in kindness."]["@audreyzavetz Love! And happy birthday!"]["Thank you for your service and continued leadership. It was an honor to sit with you and work with you for our veterans. https://t.co/qCPdGjjg6B"]["So grateful to have met 93 yr old Vincent \"Vince\" Wells, yesterday. He is a WWII veteran who served aboard the USS Edwards. Happy Veterans Day to all our Veterans. May we honor them with words and even more so, our actions. https://t.co/SpN8cLAvxr"]["I will not support it. I will do everything i can to stop it. https://t.co/xm3Bap60sk"]["@francescadomin8 So grateful for your work!"]["I’m looking forward to meeting with you also. Thank you for your service. https://t.co/NSN0C4qX8y"]["I am so grateful for all the work you all do in preventing gun violence. https://t.co/gyqxdOES3s"]["Thank you so much for having me there tonight and for the generous honor. https://t.co/A9XHlw3qeV"]["ALERT: I'm talking with courageous airport contract workers on the front lines fighting for better wages &amp; real benefits. Their fight is our fight. I'd love to get any questions or thoughts you may have on their fight for economic justice? https://t.co/QNey0UKg2n"]["Thank you to all who voted &amp; made their voices heard! Thanks also to all Americans who worked, volunteered, and got involved in the election. Pundits predicted voter turn out would be at \"historic lows\" in NJ. We proved them wrong. Let's stay vigilant and stay involved."]["Advice to me as a teenager from my high school football coach after a game: “Don’t get too high on your highs or too low on your lows and always, the day after, get back to work.”"]["I do support DC statehood. Have for years. I was born in DC and feel strongly about the issue. https://t.co/MQRdP00DLX"]["@carmencusido Thank you."]["@dawnjersey @NJTVNews @PhilMurphyNJ Sorry Dawn . . . I will try to tone it down next time."]["I would tell you more about him but he has a pretty amazing girlfriend. Either way, I will pass on the compliment. https://t.co/QIptNpXJRq"]["Democracy is not a spectator sport. New Jersey, please get out &amp; #VOTE today! Find your polling place: https://t.co/BdJRnilE7M"]["Heartbroken for the victims in Texas and their families. We are not powerless to reduce gun violence in our nation. Congress must act."]["Fairlawn, NJ Diner: I️ had the honor to meet 92 yr old Irving Bienstock a WWII Combat engineer who landed on Omaha Beach. Thank you sir! https://t.co/qNU2LFgpJj"]["My friend @RaviBhalla is running for Hoboken mayor. This vile hateful flyer was put out. I️ condemn it! We all must condemn bigotry &amp; hate! https://t.co/3Wz5Io9kNZ"]["Amidst it all, don’t forget the power of extending a small, unexpected act of kindness, decency, or love to another."]["@JaySJoshi @PreKOurWay @ACNJforKids Thank you!"]["@ltgins Thank you for your activism and advocacy. I️ appreciate you being vigilant with your elected officials."]["Thank you Amy for teaching our youth. https://t.co/Gn34jv7hUQ"]["Our diversity is our strength. This is outrageous and unacceptable. It is cowardly &amp; disgusting. 🚮 https://t.co/j1iYqauGrH"]["Money bail is an urgent issue—grateful to Senators Harris &amp; Paul &amp; @essie4justice for addressing this injustice: https://t.co/KlG1H9382K"]["“The degree of civilization in a society can be judged by entering its prisons.” Dostoyevsky"]["This is big news! https://t.co/w9RLQMYS6x"]["What are your questions on environmental justice? I'll be talking w/ environmental activist &amp; advocate for the voiceless: Catherine Flowers https://t.co/o1jWdRH6l2"]["@TammyKosiancic @BenJealous @wusa9 https://t.co/rEYEHoxpuc"]["I am. Not sure if I can pull away to connect but call Adam Topper 202 224 3224 to see if we can connect. https://t.co/Hzy2Y4bYeI"]["Respectfully u are misguided on this. Tax cuts for the most wealthy don't mean economic opportunity for the poor. History exposes this lie. https://t.co/IQfSdeLs8b"]["@MartySeam1 Glad you did. I posted it too. https://t.co/AnxpbARb73"]["Many asking me for the source on my statement that thousands of locals having higher lead paint levels than flint: https://t.co/AnxpbARb73 https://t.co/IbtFnHZO4q"]["@Ohiomom6 @PLTBKR @maddow @allinwithchris Reuters. Include them in your search."]["@MartySeam1 This is from Reuters. You could find it in a google search. Sorry I can’t send link. Running."]["Thank you. Many activists  around our nation worked to shape this bill. https://t.co/634GBXubPT"]["@Caroline_Pugh Such a pleasure meeting you."]["@EllynThomps @EdKrassen Yes. That is why I’m fighting to drive down costs: https://t.co/rEYEHoxpuc"]["@MaryAnneKolton @marshallcurry That data point is from 2 election cycles ago &amp; misleading as I had 2 election in in cycle. And I’ve now stopped taking them altogether"]["@PollsterPatrick @SenBooker Lol"]["@brandenberger Thanks for your kind feedback Nic."]["Lol. I’m a work in progress. Thanks for the input. https://t.co/G4oiyXE5Mh"]["@SweetReunion22 Thank you."]["@NoMoreGames100 @ChavezPolitics @jcschmieder @VICE https://t.co/rEYEHoxpuc"]["@seventeenblack My honor to follow you and represent you."]["@kokolele Thank you. May God bless you and our world."]["Thank you for stopping by and inspiring, informing and strategizing with me. https://t.co/BKVTM2xSB8"]["@msshopper2 Thank you!"]["I gave up on that show a long, long time ago. https://t.co/76akKzUjv6"]["@mistermarr @Yale Thank you for the kind feedback."]["@Constapale Thank you!"]["Those were good ole days my brother. So good seeing you this weekend. https://t.co/ZUsFjimIJ0"]["@luisitafernanda Gracias!"]["Amen to that. https://t.co/OLOfx20M55"]["Thanks for watching the documentary. @marshallcurry did a great job. https://t.co/Jv3i9LmUnM"]["@kcactusnm Uncle B is the man!"]["@SoAustinTx Much gratitude. Thanks."]["Further, we honor them by thoroughly investigating how they were killed &amp; addressing the ongoing terrorist crisis in Niger &amp; the region. 3/3"]["Another disappointing chapter for Trump. He again disrespecting Gold Star families &amp; now an honorable congresswoman #IStandWithFrederica 1/3 https://t.co/1RUGPfVCF8"]["Right now, someone in your world needs an act of generosity, a kind deed, or just an empathetic ear. Changing your world changes the world."]["@jackandkatesmom Gratitude!"]["@lori_alvord Thank you Lori, all the best to you."]["@TheDaveOtto Thanks Dave."]["@CPILesley Thank you for sharing that."]["Clearly you are free to block me PB. Either way, I sincerely wish you well. May we both be better instruments of justice. https://t.co/8LTIx7FP2r"]["Erick, sorry I couldn’t join you for that beer (or vegan milkshake), had to get back to work. Thanks for your help though! https://t.co/0UxVfm5LW9"]["Today, may we not let the hate of some stop us from extending love to many. May we not let magnified meanness stifle our continued kindness."]["@scottflevin https://t.co/Y4yi2SB8jM"]["@QueenCityLib @BenJealous Sorry you believe that. Don’t mistake non binding resolutions with legislation like this: https://t.co/rEYEHoxpuc"]["Proud to see that our efforts are showing real results and tangible progress for Newark kids: https://t.co/nOQo7FSGct"]["Awfully Good? https://t.co/DmTnvzLFow"]["Well look what I found: https://t.co/CqpJRFAYxi - And I played in that game. It is on. See you on Nov. 25th. https://t.co/fGa8qFs2UR"]["@CitiSam Please reach out to @ghelmy if you know the person and have more information."]["@mcbyrne @RutgersU @NJ_Spark If we can make it work. Please call @ghelmy and see if we can get it set up: 973 639 8700"]["@LIveFreeDieAt12 Thank you. All the best . . . I know we will win this fight, we are on the right side of history."]["@reallykinds https://t.co/Y4yi2SB8jM"]["@carlhasopinions Sending you virtual vegan gratitude!"]["Clearly careful tweeting is not a prerequisite for the White House. https://t.co/dxqYs5ax64"]["Been working. Thanks for your kind words . . . important to remember: \"Tweet others like you yourself would like to be tweeted.\" https://t.co/vTcSSZx6Wl"]["But I'm trying to lose weight. https://t.co/HVlmJpEXNR"]["NJ Loves You Back. https://t.co/9f6tjIEFIV"]["Thank you Jose for your star. I hope u'll take a look at my years of work &amp; leg in this area. May we both do more in the cause of justice. https://t.co/TZqjWXgxcL"]["Thank you! https://t.co/txeehZrSd3"]["I do them. All mistakes are mine. Thanks for the grammar policing - May we both make more strides to the unattainable goal of perfection. https://t.co/Tnjho6aJEy"]["I proud to be working with a great team and coalition to make this happen. https://t.co/mon48oQM06"]["Very good thread on the sabotage of stopping ACA cost sharing payments. https://t.co/dhEQI1aUI0"]["Looking forward to Facebook Live with @just_shelter to discuss his book Evicted. Join us at 11am ET: https://t.co/wzFy3Shwfg"]["Very excited to discuss the book Evicted today with author Mathew Desmond.  Join the conversation: \n\nhttps://t.co/SAKjdiRCQL"]["These laws are unacceptable and I will continue to work against them. https://t.co/Bmr3ROet4x"]["@VeganOnAScooter @Vegan4EvaBlog Thanks for your kind words and encouragement."]["“They always say time changes things, but you actually have to change them yourself.” – Andy Warhol"]["Amidst an abundance of grief: keep going; keep helping; keep comforting; keep loving; and, by all means, keep demanding justice."]["We are not powerless against such evil. We must take common sense, widely supported, steps to reduce such violence, agony and grievous loss."]["It is not enough to ask how could someone do this. We must also ask ourselves how can I prevent something like this from happening again."]["“The only thing necessary for the triumph of evil is that good people should do nothing.”"]["I talked to the Governor of Puerto Rico tonight to discuss the crisis. The challenges our fellow Americans face are dire. We all must help. https://t.co/ufqHMIn6eF"]["@cldols @chrislhayes @MSNBC Sending you love and gratitude back."]["@rgilbertmusic Thank you for your kind feedback."]["@kaane217 @allinwithchris Thank you. I am proud to represent you and our state."]["@RichVisotcky Thank you so much, I am proud to represent you and our state."]["@AnneliHerbig Thank you."]["RT: Everybody's new morning routine must include saving health care for millions 👇🏽 https://t.co/sT7lau84C8"]["Thank you Dr. Hotez, grateful for all you done on this health crisis. Honored to work with you on legislation. https://t.co/4pn3Eas3QV"]["Thank you Marcia. The battle to protect healthcare is not over. We must keep the pressure on. https://t.co/mILXZuSGFf"]["Blasphemer! You've sinned against one of the Patron Saints of NJ. There's no coming back. And by that I mean don't ever come back to Jersey! https://t.co/hEFrONogBO"]["@jessicakathryn Welcome!"]["This is a craven and cruel bill. All 50 state directors of Medicaid agree it will hurt millions. https://t.co/56uTlVZiPU"]["L' Shanah Tovah to all of those celebrating #RoshHashanah"]["RT If you like having affordable health care AND you also like ppl w/ pre-existing conditions having affordable health care. I know, radical https://t.co/nrR3FPw75J"]["My prayers are with Puerto Rico - and as with Texas and Florida, I will support federal assistance in recovery. https://t.co/wd4uPiAe0A"]["I will be on @allinwithchris tonight at 8PM on @MSNBC to talk about the latest Republican efforts to repeal the ACA - please tune in!"]["The threat is real! We must let our voices be heard. Don't be silent. Help stop this craven repeal of healthcare for millions. https://t.co/4ewSb8eKmr"]["@atrayalhale Well, I like you and appreciate your words. May we both fight for justice and lead with love."]["@justinkc2gik I've said a lot. Call my office for statements and actions I've taken."]["@maggiecmurphy @RoseAnnDeMoro Wrong. I do not take big pharma money anymore. And https://t.co/Am2ZCopARN"]["@Landreo55 https://t.co/Am2ZCopARN"]["@nievesthad @rudepundit @armandodkos Yes, gotta get a grip on a slice."]["@notsofiacoppola @KamalaHarris Ohhh Cinnamon B, I've been talking about this for years. There is no suddenly about my position."]["Kelly, you are a wise and discerning soul. https://t.co/LekxHMoqEL"]["They do it well. But for the same reason NY football teams play in Jersey - it is better East of the Hudson. https://t.co/V8Ywx3Y8bk"]["And you are a serious person with dignity and kindness. May we both grow in our authentic desire and efforts for more justice in our world. https://t.co/rIXDyxsTzd"]["NJ &gt; NY .... reason #37: Is New York’s Best Pizza in New Jersey?\nhttps://t.co/MZ1GWOmqit"]["\"There may be times when we are powerless to prevent injustice, but there must never be a time when we fail to protest.\"\n\nElie Wiesel"]["RT if you believe health care is a RIGHT. #MedicareForAll https://t.co/cPuDuCJAmM"]["Quality health care should be a right not dependent on wealth—that's why I'm cosponsoring the Medicare for All Act: https://t.co/6CgdrHPwZl"]["We will never forget. #September11th https://t.co/xszKupoTbX"]["Please follow this thread by The Phoenix New Times so you further understand how outrageous &amp; offensive to the rule of law this pardon is. https://t.co/rR0l4JFA76"]["I am willing and ready to give my full support to the affected people and communities of Texas if needed. https://t.co/7XZWBB6sC2"]["\"Either America will destroy ignorance or ignorance will destroy the United States.\"\n\nW.E.B. Du Bois"]["This is important. I have a bipartisan bill that would allow such access. For many veterans it can be a life saving drug. https://t.co/mF912kz6XE"]["Our team is working on this and fighting for this every week. There is no more important infrastructure project in America. https://t.co/K46V6BzFBH"]["@neby_G @DanWebbLC https://t.co/Gl6CWJxbhR"]["@NancyEpstein7 Great book. My favorite is The Fire Next Time."]["@strongforu https://t.co/Gl6CWJxbhR"]["@LauraSpencerOne https://t.co/Gl6CWJxbhR"]["@loriehollaway Sorry if you are not aware. Clearly this is a problem that demands action for all Americans. Again thanks for your feedback."]["@loriehollaway Ah, I see where you're coming from. Been working on criminal justice reform 4 years &amp; done much work, interviews w/ folks of all backgrounds"]["@loriehollaway @realDonaldTrump You have it regardless. La Verdad Sin Agape es una Mentira. Thank you for your truth."]["@KellyCo01394829 @kavl @GreenMan207 https://t.co/Gl6CWJxbhR"]["@KellyCo01394829 @kavl @GreenMan207 Both are wrong. It was to protect us from pop up pharmacies intending to send us bad drugs. Other senators agreed &amp; changed the legislation."]["@meremaids Proud of my stand on pharma issues and glad other senators joined me in good legislation. https://t.co/Gl6CWJxbhR"]["@loriehollaway @realDonaldTrump Thank you for your feedback. I sincerely send you love."]["In a world where many couldn't care less, aspire to be someone who couldn't care more."]["@chrismusic89 @chelseahandler Thanks for your generous words."]["And the defiant healing and revealing power of laughter loses another titan. RIP Jerry Lewis \nhttps://t.co/P3LtOI8i0M"]["Had a great conversation with @chasejarvis on #cjLIVE discussing everything from creativity to leadership. Watch: https://t.co/reMNW5dtvN https://t.co/rw3UOkCqTY"]["Dick Gregory's unflinching honesty &amp; courage, inspired us to fight, live, laugh &amp; love despite it all. #RestInPower\nhttps://t.co/RQjmQBjob6"]["I will be introducing a bill to remove Confederate statues from the US Capitol building. This is just one step. We have much work to do."]["Don't lose sight of Trump's efforts to sabotage Health Care for millions. Be informed. Raise your voice. Don't be silent. https://t.co/Qg4AqePIVG"]["\"You can't lead the people if you don't love the people.\""]["There is no question who he is. The critical moral question is: who are we? We can not surrender America to Trump. We must fight."]["Trump showed himself to be more of an ally of the Alt-right/white supremacists than our country and our most cherished common values."]["Disgracefully, today Trump was not the Commander-in-Chief but the Alt-Right-Apologist-in-chief."]["Once again Trump leaves me outraged &amp; disgusted. He betrays the office &amp; the people he has sworn to serve. #SickAndTiredOfBeingSickAndTired"]["Today is the last chance to make your voice heard—tell @CommerceGov @NOAA to save marine monuments &amp; sanctuaries: https://t.co/ScgsFQTKh1"]["\"Not everything that is faced can be changed, but nothing can be changed until it is faced.\"\nJames Baldwin"]["https://t.co/ReJVkKH2JK"]["Trump demonstrated a hateful hypocrisy in failing to name the white supremacist hate for what it is. My statement: https://t.co/byrFAsBIrb"]["@ocla1_ocla12 Thank you for extending kindness. May we both continue in this way despite our politics. I wish you the best."]["@kavatar36 I stopped taking it. I wish you the best."]["@smginla Sending you my best. Thank you for the feedback."]["@Smarteee_Pantzz Thanks for making me smile!"]["@HIRESTYLE Thank you for your generous encouragement"]["@wanderlust5 Thank you for your gracious feedback. Sending you light and gratitude."]["My family is so excited about your candidacy. Please let me know if I can come to help you in any way. My parents lived in GA for 17 years. https://t.co/3PEV9DrSRM"]["So grateful to hear this!@staceyabrams https://t.co/vTHI7CzdYz"]["Having courage doesn't mean you don't know fear or stress or worry or even shame and regret. It just means, despite it all, you keep going."]["I proudly support Stacey Abrams, a Governor for all of Georgia. https://t.co/5CeEMNJnPE"]["Jeff Sessions’ intention to jumpstart War on Drugs 2.0 will do nothing but balloon our already overflowing prisons: https://t.co/hXOJWmBVWU"]["Dear Annie, thanks for writing to me! @RepJoshG &amp; I introduced bills to make sure we invest in safe drinking water: https://t.co/d2iT5bUQM2 https://t.co/AvL3YpnR8p"]["My op-ed on my ending the War on Drugs starting with my new bill that will end the prohibition on marijuana: https://t.co/9iEFNiK7Tu"]["Right now, women in prison aren't afforded basic human needs. @SenWarren &amp; I introduced the Dignity Act to fix that: https://t.co/mgbHw22Dc4"]["It's disturbing that @customsborder employees were told by superiors to ignore members of Congress during #TravelBan https://t.co/0T2ONJ5PPH"]["@NO2USPLUTOCRACY https://t.co/Gl6CWJxbhR"]["@sinistra00 Sorry I missed you."]["@Rorak11GGD https://t.co/Gl6CWJxbhR"]["Happy Birthday President Barack Obama. https://t.co/qcp01IanXp"]["@mzbedelia You are overly kind. It was nice to sort of connect. Thanks for the kind words."]["@leesology @KamalaHarris @Nissan @SenSanders Actually I do and just met with union leaders where we discussed this and more actions to help workers."]["Our bill helps Americans with skyrocketing drug costs &amp; saves taxpayers billions per nonpartisan @USCBO. Senate Republicans should join us. https://t.co/EwMzipvKpD"]["“Not everything that is faced can be changed, but nothing can be changed until it is faced.” James Baldwin"]["RT: It's time to legalize marijuana, and end the War on Drugs. #MarijuanaJustice https://t.co/blPCd8tcx9"]["@Michaelnyc21 @FortuneMagazine https://t.co/Gl6CWJxbhR"]["@GSand1804 @mozamm @cannabist As a guy who still lives in Nwk, loves Nwk, and started everything from drug courts to jobs for formerly incarcerated, I disagree."]["Thank you Shaun. Grateful for your all your work on justice issues. Now we must make this the law of the land. https://t.co/alZYxFWbGf"]["Mike, I wish you well. May we have more courage of our convictions and the courage to still be kind. https://t.co/6rhOhpY8WC"]["@5StarChris1010 @katiecouric @realDonaldTrump https://t.co/j8ydDyiImv"]["@goodnewsgoddess The almost dozen other bills I've introduced over 4 years to end the war on drugs. For communities like mine it is about urgency not favor."]["@goodnewsgoddess Where do you live Pamala? I live in a poor minority community. My neighbors and I know the evils of the drug war. This bill is in line with"]["I’m about to introduce critical criminal justice reform legislation called the Marijuana Justice Act. Watch live: https://t.co/9ysc7nXI4S"]["I joined @katiecouric on her podcast to talk about health care &amp; @realdonaldtrump admin—listen here: https://t.co/57TQwcEzjJ"]["Thanks for your support https://t.co/oVsmqP0JL2"]["@NooglesNYC Lol."]["@_barretme Lol!"]["@lavieatelier22 Thank you!"]["Still pretty under the weather. Thanks for asking. I couldn't cancel the town hall. https://t.co/STxVUMlGKv"]["I'm pictured there with the two owners. I'm grateful for this very fun small business in our State. Made me want to play D&amp;D again."]["After a town hall at St.Peters in Jersey City, Went to Hoboken to grab vegan burgers at BareBurger &amp; discovered the awesome Aether Game Cafe https://t.co/PRx43VIB4C"]["@doscious1967 Thank you for your voice and activism as well'"]["@jeanneljordan @Action2getherNJ Thank you Jeanne. A good victory tonight."]["@MaureenBurke1 Thank you Maureen!"]["May we all stand up for the Endangered Species Act. https://t.co/yIZLXKQiF8"]["Transgender Americans in military are heroes like anyone else risking their lives to defend us. @POTUS is wrong: https://t.co/3bGVPCdzMI"]["You can still reach out to others in Congress. Also: Get Folk Woke.  Advocate to others in other districts and states to fight too. https://t.co/zCyKPU7OWj"]["Thank you for listening and for being a part of the resistance to this legislation. https://t.co/UXqdKbfyoz"]["If such a bill passes the mortality rate in our country will rise. We must kill this bill and save the lives of our fellow  Americans. https://t.co/hVS52NV8NO"]["When my father died and I was swallowed by grief, New Jersey Dems &amp; Repus reached out to me. I love all my state not just those in my party. https://t.co/gcg1Aux2IN"]["Thank you but today was a grave &amp; awful day. The clock is now ticking. We must all take responsibility to stop this craven Republican bill. https://t.co/SOIsz7R6VI"]["Kindness isn't weakness or lack of conviction. Kindness doesn't weaken an argument. U don't need to be mean or cruel to be strong or tough. https://t.co/m7azYVSIVI"]["I love you too. And I try to live up to my ideals of also loving my enemy. https://t.co/PzH0Emmbtl"]["I too am engulfed with anger. But I will never let them rob me of my decency. You either submit to the darkness or fight it with light. https://t.co/m41w56mLAH"]["And you too need a hug. We should all show kindness &amp; decency to one another even when our disagreements couldn't be greater. #IHuggedMcCain https://t.co/k37RquyfmV"]["We all must continue the fight in these hours before the vote. Let your voice be heard. https://t.co/V7aAnClYoU"]["Thank you for fighting for us. We are all in this together. We must defeat this craven bill. https://t.co/0p2WQo9hNv"]["The public &amp; other Senators. No deliberations, no transparency, just a rush to rip healthcare away from millions with only hours to review. https://t.co/2jaY1L1A2t"]["@JD_SBNC Thanks for the feedback. I hope you consider it."]["One of greatest threats to our democracy is rising income inequality—we are all worse off from this growing divide: https://t.co/MYma8T5VGN"]["Kindness has never weakened one in pursuit of righteousness, undermined the pursuit of justice or lessened the strength of an argument."]["Why won't the @FCC fight for lowering intra-state prison phone call rates? This has a devastating impact on American families. https://t.co/nfIjViTiqv"]["My thoughts and prayers are with @SenJohnMcCain, a true hero. Cancer is up against one of America's toughest fighters."]["My thoughts and prayers are with @SenJohnMcCain, a true hero. Cancer is up against one of Anerica's toughest fighters."]["@SenJohnMcCain My thoughts and prayers are with @SenJohnMcCain, a true hero. Cancer is up against one of Anerica's toughest fighters."]["My thoughts and prayers are with @SenJohnMcCain, a true hero. Cancer is up against one Anerica's toughest fighters."]["Thank you for your activism! https://t.co/IgEPFqH5fG"]["@jjmc112002 @realDonaldTrump https://t.co/j8ydDyiImv"]["@ihateericwilson And you are a good person. I wish you the best."]["@ikvasager @Desb65 Thanks for pointing that out Isaac"]["@jdocmartin We fight on!"]["@jdocmartin Thank you. We fight in!"]["@jenimus @ghelmy In the meantime I hope you will read up on my work to fight pharma 's high prices: https://t.co/j8ydDyiImv"]["@jenimus U dont know much about my life's work. I sincerely invite u to walk w/ me where I live &amp; talk to my community. Reach out to @ghelmy to do so"]["@kevin_walat Great. Keep following: https://t.co/j8ydDyiImv"]["Trump's ill conceived, American value violating travel ban continues to rack up legal losses. Again from conservative leaning Supreme Court: https://t.co/4je4rXEBey"][".@RealDonaldTrump's #ShamVotingCommission is nothing but a shameful attempt at suppressing the vote in vulnerable communities #RespectMyVote"]["@KRO_Yankee @ChristinaRealNJ Thank u both though 4 being engaged. This is a good platform 4 sincere engagement. Whether u live in NJ or not, I benefit from the feedback"]["@KRO_Yankee @ChristinaRealNJ U can't vote for me John, u are not a Jersey resident. Christina I have stopped taking money from big pharma and am proud to represent you."]["\"If they don't give you a seat at the table, bring a folding chair.\"\nShirley Chisholm"]["Yeah, if ramming through is having over 200 bipartisan meetings and hearings and taking over a year to gather input, then yes he rammed it. https://t.co/oEuYDTLhzo"]["Wrong! For example:I want the govt to not tell women what to do w/ their bodies, stop incarcerating so many ppl &amp; keep the internet neutral. https://t.co/6lgLqEh4lw"]["Dozens of Republican amendments were included. They ultimately didn't vote for the bill but they shaped it. https://t.co/BKLVMN6JwS"]["@suppello Come to Jersey. We'd be happy to have you."]["@Bexmich Thank you. I'm proud to be your senator."]["@JossRuckus Thank you for your kind words."]["@MaryFrei8 @InSpiteOfTrump @bizzle_scott @CNN @donlemon I'm cool with losing credibility for standing up for safety and my principles. I was right and happy other senators joined me."]["@eddelagarza @donlemon Our joint bill will prevent people from subverting even Canadian safety precautions. I will let people rake me and stick to my principles."]["@eddelagarza @donlemon I can't support legislation allowing pop up pharmacies in Canada to sell unsafe drugs to our country. Sanders agreed to my safety additions."]["@bronaego Agreed and my other legislation address men and overall issues for parents."]["Respectfully Obama not only held healthcare meetings with GOP but aired one on CSPAN, and Dems held dozens of bipartisan hearings. https://t.co/8LI9m9zfn2"]["@Humanbeing1973 @donlemon https://t.co/j8ydDyiImv"]["@bizzle_scott @CNN @donlemon What?! I voted against a non binding amendment that would have changed nothing &amp; wrote legislation that would have: https://t.co/j8ydDyiImv"]["@Bw_alker Thank you Beth."]