["Preach https://t.co/yeTMJ31HQ4"]["Amen. https://t.co/utCkQmMBVk"]["Former PM of Haiti. \n#EnoughIsEnough https://t.co/c4yIi5XxfU"]["Proud to defend and support the ppl of #Haiti, #ElSalvador, #Honduras and the entire African continent. We are all human beings. And to every single member of our military and first responders, please know we stand with you and your families. Geez, Mr President. Get a grip!"]["Thank you @ChrisCuomo. https://t.co/vaSYlm39VO"]["A day with some remarkable women in Sacramento. We kicked off #MLK weekend. @sfpelosi and other @TheDemocrats in attendance to pay tribute to King’s legacy. https://t.co/eHm6lYENzs"]["Have we lost a sense of compassion? Where’s our empathy for the poor? This is outrageous. https://t.co/52oP28nZuQ"]["With stores across the country, let’s hope #Walmart will find jobs for those they are laying off. https://t.co/9bbqpCOa0Z"]["Listen to the @TheView https://t.co/2zzIKznscl"]["@naretevduorp @EricGreitens @clairecmc Damn"]["Hold your comments..... President Donald Trump Signs Bill (@repjohnlewis ) Upgrading Martin Luther King's Birthplace to National Historic Park https://t.co/SKhfZ2si0Y via @BreitbartNews"]["Thoughts and prayers for those still missing in the #SantaBarbara mudslides.\n\nRace to find survivors of fast-moving SoCal mudslides - CBS News https://t.co/zixggaWUyx"]["Mueller adds veteran cyber prosecutor to special-counsel team https://t.co/rL6psSevKs"]["25th Amendment: How do we decide whether the president is competent? https://t.co/opk8cOMW3f via @BrookingsInst"][".@SenFeinstein is a woman of valor. Read below. \n\nTrump is mad that “Sneaky Dianne Feinstein” debunked a key Republican theory on Trump and Russia https://t.co/ibB9VHGaCZ via @voxdotcom"]["She is worthy of this award. Tina Turner is “simply the best.” https://t.co/Kpn6h4aTnx"]["Please...... https://t.co/bLMOY8LtUw"]["#AmenCorner https://t.co/3QHdJjC0rE"]["Thank you @brhodes. https://t.co/9ZQ2tMa3DV"]["Newly released Senate testimony debunks a key conservative theory on Trump and Russia https://t.co/FtAfqcC3aR"]["Thank you @SenFeinstein https://t.co/Ve7KPeQkxO"]["#AmenCorner https://t.co/qYZhvo0JTm"]["Steve Bannon and I. We both ended up pissing off a lot of people. But I’ll say this for myself—at least I did it with my own book."]["Thank you .@TomSteyer for inspiring a better future. https://t.co/rpsIKUmjwD"]["#DreamActNow https://t.co/sztPCc9TM7"]["Congratulations @AlabamaFTBL @UofAlabama \n#RollTide #NationalChampionship https://t.co/CkDUhZVnPM"]["#NationalChampionship....\nPlease"]["Power Rising: Building an Agenda For Black Women\nFebruary 22-25. Please help to get the word out for this amazing gathering of Black Women to take place in Atlanta, GA. It's time!  #BlackGirlMagic #BlackWomenLead  \n#StillWithHer"]["What is the best part about Oprah running for president? She can announce it by telling everybody to look under their seats!\n#Oprah2020"]["Talks underway about Trump interview in Mueller's Russia probe https://t.co/pejVgEsDXK via @nbcnews"]["@dmcguire13 Thanks for sharing Ms #RECYTAYLOR story and homegoing."]["Read @OprahWinfrey’s #GoldenGlobes Speech https://t.co/mM6fjaHfXR"]["Thank you @Oprah for saying her name. Ms Recy Taylor, Who Fought for Justice After a 1944 Rape, Dies at 97 https://t.co/CsNWFk0lML"]["Ouch.....\n\nStephen Miller had to be escorted off CNN's set after his interview with Jake Tapper went off the rails https://t.co/ib23GPzAn0 via @PoliticsInsider"]["Thank you @Saints! Team spirit and lots of beer left over for the #GoldenGlobes."]["My entire family is doing the #WhoDat dance. https://t.co/eoAf5vVGaX"]["Taking a mini football break. https://t.co/XtnGw4HxdQ"]["Geaux @Saints! #WhoDat"]["Team Trump post #SloppySteve apology. https://t.co/mtfZtIi6FW"]["#SloppySteveBannon has formally apologized to the #stable genius and his family. Maybe we should see if we can get Fox &amp; Friends to just show calm and soothing videos with puppies and kittens."]["Good luck @TinaSmithMN. https://t.co/dp51ATcClQ"]["Earlier, POTUS just called himself a “very stable genius.” It would be less disturbing if he was just tweeting “covfefe” repeatedly.\n\n#Can we agree that the best retort to being called unstable is not to refer to yourself a “very #stablegenius”?"]["Led by the Mercers, Bannon’s Allies Abandon Him https://t.co/KahNIQI5gx"]["Speak! https://t.co/8i11LFJKze"]["This is real leadership.  https://t.co/WEj7WJQGHr"]["Steve Bannon is the latest to say that there's no longer any doubt about collusion with Russia, @GrahamDavidA writes https://t.co/ZcVK8PkNUl"]["Okay, let’s admit the truth: Breakups are rough. You end up binging on junk food and TV… but then that’s how President Trump lives his life already."]["Trump attorney sends Bannon cease and desist letter over 'disparaging' comments  - ABC News -  via @ABC https://t.co/r1mD4DMqHn"]["It keeps getting wilder between Trump and Bannon. \n\nTrump splits from Bannon. Now he’ll do that breakup thing where he calls and cries to other exes. Be ready, Paul Manafort."]["This is mind blowing.\n\nTrump slams Bannon: ‘When he was fired, he not only lost his job, he lost his mind’ https://t.co/ziSMePqcNp"]["Thank you @sfpelosi.\n#Women stand with London Breed for San Francisco interim mayor https://t.co/AFsdJ3dwpj via @sfchronicle"]["@cmclymer Thank you for sharing your story and lending a hand to others. Bless you. Keep Hope Alive!"]["We still have a long way to go. Glad @GDouglasJones selected an outstanding public servant to help lead his office. https://t.co/1fWYyBelDX"]["#Resistance https://t.co/YeUFeNyjMq"]["Thank you @BetteMidler. This is so powerful. Please watch it soon. https://t.co/gCHscU2fDh"]["#HappyNewYear!\n\nPowerful Hollywood Women Unveil Anti-Harassment Action Plan https://t.co/wpprDLtuL8"]["#HAPPY NEW YEAR to everyone! Bless you all."]["Thanks @cspan for allowing me to share my book and insights. https://t.co/WMEgsLFVgx"]["Dear Tweet hearts:\nAs 2017 comes to an end, let’s remember those who have decided to run for office next year. Please give a little now so you can rest comfortably in 2018. \n\nThe #BlueWave2018 will rise with your help &amp; support. Thank you. #HappyNewYear @TheDemocrats #Resistance"]["@NomikiKonst @Vote4Pedro2018 @EdB2630 @rookee_baekr @TYTPolitics @DNC Correct. I am not a DNC consultant or a paid staffer. For over 30 plus years, I have given my time and talent to the party. Paid staffer for Gore 2000. Peace and best of luck in 2018. Now, let’s keep our eyes on the prize."]["New voices, new vibrancy and a new vocalist. She combines @NinaSimoneMusic with #BillyHoliday. \n\n#omg best album ever:  https://t.co/V9huX8KWB0"]["This sums it up.\n\nIncoherent, authoritarian, uninformed: Trump’s New York Times interview is a scary read https://t.co/yW2azeBxW2"]["This is wise advice. We have to be prepared for the next round of cyber attacks. The Trump Admin and GOP controlled Congress will not take steps to protect our elections from foreign meddling. https://t.co/tDKPbyqcv5"]["Trump displays delusions in his New York Times interview https://t.co/e1wXCU9whK"]["Analysis | In a 30-minute interview, President Trump made 24 false or misleading claims https://t.co/9pYNGQWan7"]["@HillYes1 Grow some happiness and spread the joy. Don’t get caught acting like a bot when you troll on others. #Peace"]["@JaimePrimak So true."]["FACT CHECK: Where Roy Moore's Voter Fraud Claims Fall Flat https://t.co/mWfxZ0uEWV"]["Fuel, broadband technology and more.  Message to Mr Trump: Russia will not help us. https://t.co/XdzGA4bb2C"]["Awards for best, worst of 2017: A year of living nervously https://t.co/WWCCsAOZZs. #Hacks"]["Really? You know what is so disturbing about this headline? Does anyone care about protecting our democracy from foreign meddling?\n\nTrump Says Russia Inquiry Makes U.S. ‘Look Very Bad’ https://t.co/ZA4fo8mEt9"]["Mueller investigation looks into whether the Trump campaign helped Russia use data to target U.S. voters https://t.co/PrcZE1wXgn"]["The Bible states that “weeping may endure for a night, but joy cometh in the morning.” My solemn prayers dor the Garner family. May Erica rest in eternal peace. @es_snipes will not be forgotten. #Peace https://t.co/OLzOi3VGQW"]["@silveraa There’s a great lot to choose from. National or State level?"]["Stop and think.... is this the new norm? Read the @BostonGlobe analysis. https://t.co/Ntl0FQGe3C"]["Wait... expectations to do what? This is why we needed an independent investigation following Russia’s interference in the 2016 US election. https://t.co/KRqh9cGfpK"]["Oh please. https://t.co/Cfa4oWe6jD"]["New York’s Attorney General in a Battle With the President https://t.co/Cy6FT0nBxH"]["These two special dogs brought joy and happiness to my life. 2017! https://t.co/yRW04a6SDx"]["Chip’s beloved canine soul mate has passed. Liberty was playful, clever &amp; extremely generous with her kisses. She welcomed strangers and could hold her own in public. Most of all, Libs loved children and running with Chip for the ball. Libs can play in Canine peace with Chip. https://t.co/MnXN3xcaUU"]["@AuntLulie It’s on the list of items to do in the coming year or two"]["#HappyKwanzaa \n\nIf you want a few cooking ideas, please review this selection.\n\nhttps://t.co/gmis0MXEFn #NYTCooking"]["Bit by bit, Trump is taking apart the New Deal’s glorious legacy | Heather Richardson https://t.co/3GpmVq5ibY"]["Opinion | Russia never stopped its cyberattacks on the United States https://t.co/LZ9iKEX6Qv"]["This Prominent Actress Launched A New Orleans Art Exhibition Celebrating Black Female Power And Beauty | BLAVITY https://t.co/vQU9rLEXUH via @blavity"]["More joy on #ChristmasDay!\nAn Explosion Of Small Donations Powered Democratic Wins In Virginia House - HuffPost https://t.co/aBJqmmx6X6"]["What are we going to do about it?\n\nKremlin trolls burned across the Internet as Washington debated options https://t.co/yeO34lbat8"]["#MerryChristmas https://t.co/eLvL1e8R6z"]["I have fond memories of meeting your Dad. He was a wise man, a generous soul and warrior for peace, justice, freedom and equality. #RIPMarcusRaskin. https://t.co/QICIWstwTO"]["Bannon Puts Jared Through the Grinder https://t.co/1LLUMoPdvz via @politicomag"]["This is the best Christmas present ever. #MerryChristmas https://t.co/phFz36936W"]["Former Louisiana Gov Kathleen Blanco is one of my sheores. Please continue to lift her up in prayers. She’s a fighter. #LouisianaStrong \n#Resilient\n#Warrior\n#Catholic\n\nThanks @tegbridges for telling her story. https://t.co/a1DmnAaFfn"]["It will place the entire nation in peril. https://t.co/9tZ5hDmeWO"]["#MerryChristmas tweet hearts. https://t.co/PmaQYZuCBa"]["ACA deadlines:\n \n·         CA: 1- 31, 2018\n·         CO: 1- 12, 2018\n·         CN: 12- 22, 2017\n·         DC: 1- 31, 2018\n·         MD: 12- 22, 2017\n·         MA: 1- 23, 2018\n·         MN: 1- 14, 2018\n·         NY: 1- 31, 2018\n·         RI: 12- 31, 2017\n·         WA: 1- 15, 2018"]["Hopefully in a city led by a female Mayor, they can find a few women to add to the mix. https://t.co/OVH8cCRbO1"]["Truly sad. We must uphold one standard. https://t.co/Xt9c6O1xBx"]["Breathe gently and release pain and anxiety. Inhale peace and happiness. 7 Times with eyes close.\nGood night sweet Joy. https://t.co/GL8t2FRbZA"]["Sign of tomorrow."]["https://t.co/9QyeDaLbfG"]["After reading this piece, please consider reading my book Hacks.\n\nRussian trolls went on attack during key election moments https://t.co/nX9KwmF6hN"]["A sign up of the future. Like 2020. https://t.co/GXcAQI8hj5"]["#History https://t.co/zXNhcinIa6"]["#byebye https://t.co/pUEHg42Sq2"]["Romanians hacked DC surveillance cameras @CNNPolitics https://t.co/ZwnIZaJpGP. \n\n#Hacks"]["#AmenCorner - Please read. If the tone offends you, don’t read it now. Save it for another day.  Open your mind and heart.  We have to help each other. \n\nRead: Dear Black Women: It's Ok To Save Yourself Instead Of The World | BLAVITY https://t.co/5ijyLizPrM via @blavity"]["How right-wing media are laying the groundwork for an assault on voting rights in 2018 https://t.co/MbRxHxF1Y7"]["Everyone needs prayers, especially now when we must look out for and protect our most vulnerable citizens. Mr President, you also need our thoughts and prayers. I am praying for acts of goodness and kindness for ourselves, family, friends, animals and the entire global planet. https://t.co/JRqJt0u6P2"]["Congratulations to @MSNBC. Hard work paid off in viewers. https://t.co/L5zQcwrI0U"]["Honorable and decent public servant. As President, he set a wonderful example. Thank you President Obama. https://t.co/bsCNYF9VXC"]["#ProtectMueller https://t.co/AYqeMHiard"]["#ProtectOurDemocracy https://t.co/TwT5nYO0BO"]["Is this what true conservatism looks like? Explode the national debt on the backs of the poor, the elderly and children. \n\nNext year, the GOP will attack social security, medicare and medicaid to try to pay for their irresponsible tax bill.\n\n#Sad https://t.co/dXvWCA5S5m"]["How many bills will the GOP sign this year to protect the 2018 elections from foreign meddling and intrusion? Zero\n\nWhen it comes to Protecting Our Democracy and ensuring we can withstand another wave of cyber attacks, the Trump Administration and GOP Congress is AWOL. \n\n#Sad"]["Americans oppose the #GOPTaxScam by a 2-to-1 margin. Republican lawmakers claiming the #GOPTaxScam will grow on the American people are counting on a pipe dream. \n\n86 million American middle class families will see a tax hike. Are you one of them? #StayWoke!"]["The #GOPTaxScam is the definition of terrible policy that will hurt American families.\n \n-Poor children\n-Seniors on fixed incomes\n-Suburban families\n-Workers\n-Teachers\n-Police Officers\n-Firefighters\n-Veterans\nAmericans from coast to coast will suffer under the #GOPTaxScam."]["@AngeloRayGomez. You seem so sad right now. When you cannot engage in civility, you start to attack. Stop trying to silence me and other women. We are not going to move off our platform. We are standing strong. So, close your shades and open the windows."]["@Heritage selection of a Black woman is one of the strongest political positions I have seen religious, social and economic conservatives start to make. \nDon’t forget Trump asked us “what do you have to lose?”"]["Congratulations to a thoughtful and knowledgeable leader on some many fronts. Another Black woman being elevated this month. #AmenCorner https://t.co/TtWugOJwbP"]["The #GOPTaxScam:\nStep 1: Give tax breaks to the wealthiest and corporations. Rewards Outsourcers.\nStep 2: Explode the deficit and inflate income inequality.\nStep 3: Force American middle class families to foot the bill.  \n\nCall Congress and say vote nay."]["FBI told Trump Russians would try to infiltrate his campaign https://t.co/8iNGLsSf1l via @nbcnews"]["Tune-in TONIGHT!  The season finale of #FindingYourRoots with @HenryLouisGates is airing with guests @amyschumer, @azizansari and @mayarudolph on @PBS at 8/7c!  So excited!"]["We’re witnessing the wholesale looting of America - Vox https://t.co/eY28sAuv8r"]["A flawed plan promoted by the President who has adamantly refused to release his taxes to the American ppl.  Read: 7 reasons why Republicans may have made a bad bet on the tax bill - @CNN https://t.co/3js5E28U8N"]["Thank you for purchasing Hacks and for passing on your comments. Also, honor to have been given a chance to discuss my views on 2016 and more on so many TV and radio programs. Over the holidays, I will review your comments and reflect on how to serve in the future. #Peace"]["#BlueWave is coming to a state near you. Get off the sidelines. Time to #ProtectOurDemocracy! https://t.co/hdxk0dT1av"]["#AmenCorner from @SallyQYates. Who are we as a country? Time to decide: Sally Yates https://t.co/3f42y5rLs9 via @USATODAY"]["Capitol Hill Watchdog Refuses to Release Sexual Harassment Data https://t.co/0Uj9ZlxEox via @thedailybeast"]["What We Know About the Trump Campaign’s Collusion With Russia, by @RepAdamSchiff https://t.co/mUmpVztKzL via @WSJOpinion"]["Thanks @RealTimBlack. Tough but fair interview about my latest book Hacks. https://t.co/39RhF1yKFG"]["Prayers for the victims of this tragedy. Let’s also keep those injured in our thoughts and prayers. https://t.co/ElppnIsSOS"]["Yes, what is she hiding? Everyone should cooperate with the investigations into the hacking of our democracy. https://t.co/ipUL3f6Ock"]["The Senate’s Russia Investigation Is Now Looking Into Jill Stein, A Former Campaign Staffer Says https://t.co/qBG0hjBEtO via @LoopEmma"]["From Mr Trump: “I’m not” considering firing Robert Mueller via @axios https://t.co/l9odhjskk7"]["Great game. #WhoDat https://t.co/FWdzyPme4T"]["@MoveOn: “If you choose to attend an event, you agree to engage in nonviolent, peaceful action, to act lawfully, and to strive to de-escalate any potential confrontations with those who may disagree with our values.”"]["@MoveOn needs your help. Spread the information. https://t.co/Db1sE2S4DH"]["Thank you for your service https://t.co/dBWlgVWZI8"]["A journey through a land of extreme poverty: welcome to America https://t.co/TzasaIfMut"]["It’s time we paid attention and stop being in denial. #ClimateChange is real. https://t.co/oPdlOzADbb"]["How Putin's proxies helped funnel millions into GOP campaigns https://t.co/WnknB4nfC8"]["@JRubinBlogger’s Opinion | The public sides with Mueller https://t.co/K4LGjeUGbe\n\nCan we allow him to complete his job?"]["Who dat? #LouisianaStrong!This video of jubilant students at a small-town Louisiana school inspired millions. Here's why. https://t.co/2yO4tNjKaO"]["There’s no place like home! There’s no place like New Orleans! Who Dat?"]["You are a phenomenal woman. Keep speaking your truth. https://t.co/hxLpFxAkCg"]["Thanks Boo,\nI’m celebrating this day with family and friends down in the Bayou. Who Dat! https://t.co/vVGV8kf8eK"]["Opinion | How Democrats can reward black women right now for their votes in Alabama and Virginia https://t.co/MMFIaV8nTb"]["#BlackWomen voted in record numbers this year. We kept the faith, opened new doors and believed in the power of our vote. 2018 is our year to soar. #RunSistersRun!\nGet ready y’all. https://t.co/g9NkR651l0"]["Painful to watch. https://t.co/JN3zDL0svh"]["Special Counsel Mueller requested Trump campaign data firm to hand over employee emails  https://t.co/KXSk4RSBxZ via @WSJ"]["And protected #BlakeFarenthold https://t.co/yQJxY5VLBV"]["Good read from @benjaminwittes: Thoughts on Rod Rosenstein’s Testimony https://t.co/pKOCi5mHKi"]["#AmenCorner https://t.co/lGUdEqhRiJ"]["Thank you @donlemon @CNN https://t.co/tBgC6bL7Lw"]["@Lawrence interviewed Lisa McNair tonight. Rejoicing. Thank you @MSNBC"]["Here are the excuses (so far) right-wing media figures are using for Roy Moore’s loss https://t.co/MkSK2Wygvu"]["Thank you @rickhasen https://t.co/rL3TDieXI1"]["Help @TheDemocrats defend @GDouglasJones victory. Please help.Alabama election official skeptical that outstanding ballots will tip Senate seat to Roy Moore https://t.co/uSp6tZ9vVn via @usatoday"]["@wusa9 Thank you @brucejohnson9 for a great interview."]["8 numbers out of Alabama that should terrify Republicans - CNN https://t.co/xcZJz3aM6q"]["Why is this man still in the White House? Let’s get our voting groove ready for 2018.\n\nPolls: Majority of voters believe Trump guilty of sexual misconduct - CBS News https://t.co/Y33yxxehH5"]["Why is this man still in Congress? \n\nExclusive: Ex-Farenthold aide shares new details of vulgar and abusive behavior - CNN https://t.co/TqNB1htxnb"]["The only reason to cross over into Alabama is watch football. Stop the nonsense. Black voters came out in record numbers to send a message to Trump and the GOP: No Moore.... https://t.co/cRSjQqMiZ3"]["As Russia probes progress, one name is missing: Bannon's https://t.co/og5Tr72Ode via @politico"]["#AmenCorner https://t.co/PvftUG1rBb"]["Thanks Jimmy. https://t.co/5zwB4fwOO3"]["OMG https://t.co/QpZuRCgHw7"]["With Alabama Loss, Trump and GOP Face Political Reckoning - The Wall Street Journal https://t.co/9XAllX3rZe"]["Plans on https://t.co/AcgQhZLxJ2 are more affordable than ever.  Many consumers can find plans with $0 premiums or plans with premiums of $20 a month or less.  Deadline is Friday. #GetCovered  [more affordable than ever graphic]"]["Opinion | Doug Jones wins for Alabama and Democrats, and sends a message to the world https://t.co/E4ZkI3QenX"]["#OMG. https://t.co/aeHorjx7VO"]["Fox News throws Steve Bannon to the wolves over Roy Moore’s defeat https://t.co/fIZ6Mr4TMA...."]["#AmenCorner https://t.co/9S0SvRm7pm"]["@morningmika is speaking truth to power. We will not be silenced. #SupportForSarah"]["Thank you @repjohnlewis!"]["Please support @Sifill_LDF and the mission of the NAACP Legal Defense Fund as they work to protect the vote. https://t.co/n3kEXMPcOE"]["Let’s support these fearless organizations. #ElectionProtection. https://t.co/5n2MLiAuJJ"]["The GOP’s Soul searching should have started long before last night.#AlabamaSpecialElection https://t.co/EGmfrF3HJV"]["Proud to be a Woman who votes! https://t.co/0uG9rrFOxM"]["As you can see from the comments now on @CNN from the #Alabama Secretary of State, we need a 21st century voting rights act that allows every eligible citizen to have their votes counted."]["Yep https://t.co/8R064MaQbD"]["Tonight, Rosa Parks is resting in peace. Along with so many others, the work continues. Thank you #Alabama. You did it. #Onward. #ForwardTogether."]["@TheDemocrats funded organizers and helped to organize HBCUs and college campuses and in the faith community. Their work focused on organizing and mobilizing, including volunteer recruitment, community engagement events and GOTV efforts. Help us going forward."]["Congratulations to @GDouglasJones and all those who helped you @RepTerriSewell @repjohnlewis. And @TheDemocrats who sent resources, staff and donations. Geaux Democrats."]["With great power, voters elected the first Democratic senator from Alabama in decades. @GDouglasJones will need your help, your support to come to Washington, DC to help forge common ground. Please respect the voters of Alabama. Yes, #Alabama."]["@realDonaldTrump should send a message to @GDouglasJones. “ Senator elect, I was wrong. We need to work together for the common good.”"]["Fifty years after the murders of Addie Mae Collins, Cynthia Wesley, Carole Robertson and Carol Denise McNair at the 16th Street Baptist Church it was Doug Jones who made sure that the last of their killers faced justice. Now, Doug is going to Washington, D.C. as a U.S. Senator."]["#AlabamaSenateElection https://t.co/Bwes1bxiaC"]["Weeks ago, I told friends in Alabama to use the power of the vote to change the course of history. #AlabamaVoted. You buried the past. You open doors to the future. Welcome to the future that you will help lead. Bless you. Bless you."]["Alabama elected a man who will serve the ppl and not just the special interest of Donald Trump and his cronies. Thank you Alabama."]["Alabama... #Alabama."]["Who would have thought that we would be spending tonight discussing the returns in #Alabama."]["#DearAlabama.... every vote counts."]["#AlabamaSenate...Too close to call and too important to take our eyes off the prize."]["Alabama Senate Race Between Roy Moore and Doug Jones Ends With More Controversy https://t.co/xo1JJgOmXR"]["#EnrollByDec15 https://t.co/7mTCUJivgX"]["#DearAlabama,\n\nGet out and vote. \n\nLove your neighbors and friends from across the United States and globe."]["Call @SpeakerRyan (202-224-3121) and tell him #BlakeFarenthold must go. As a former Hill staffer, I can tell you his behavior is obnoxious. Taxpayers should not have to pay for this.\n\nTawdry Tales Depict a Texas Congressman’s Frat House on the Hill https://t.co/MJS9FyONR3"]["We do harm to ourselves, our aunts, daughters, mothers and sisters when we fail to speak our truth. \n\nWhile Democrats call for resignations, conservative women stand by colleagues accused of sexual misconduct https://t.co/73GfAlHq5t"]["CNN's @ChrisCuomo calls out White House press secretary Sarah Sanders for routinely lying to the American people https://t.co/IfvjIv7pva"]["@SenGillibrand is a serious lawmaker who deserves to be respected. She is an amazing leader. We will not be silenced. We will be heard. https://t.co/wAJ08zhnlZ"]["Amen https://t.co/1MnfGn3yew"]["Final thoughts. Alabama you can do the right thing.  After all the state has done to bury the past and to move forward — it’s time to go forward. Please vote for @GDouglasJones. Let’s bring back civility, rule of law and the respect for women and girls. Bless you."]["#AlabamaStrong...Yes, I know Alabama. I know people there judge others by their deeds, not by their words. And we all can see the difference here. Vote for @GDouglasJones."]["#Alabama...... The world needs to hear your strong voices saying that the lives of Addie Mae Collins, Cynthia Wesley, Carole Robertson and Carol Denise McNair still matter. Please get out and vote. Thank you. @GDouglasJones needs your help."]["Alabama, I have visited you twice this year.  Tomorrow, \nI urge you not to stay home on Election Day. Come to the polls and come in record numbers. Show the country and the world that you stand up for justice, civility, and the sanctity of little girls."]["Trump asked the black community last year what we had to lose if we chose him over Hillary, acting like as though with him in power we'd get a better deal.  Now we know the cost the country paid, and all that we lost on Election Day last year."]["We have in @GDouglasJones a public servant who lives his values, who puts what he believes into action, and fights hard for what he believes in. And then we have this other man who was once banned from the mall for stalking young women."]["50 years after the murders of Addie Mae Collins, Cynthia Wesley, Carole Robertson &amp; Carol Denise McNair,  it was @GDouglasJones who made sure that the last of their killers faced justice. He knew that there should be no statute of limitation on that horror, and he saw it through."]["Ahhhh... the old playbook has to be updated. No more last minute appeals. If we are not at the table, it means someone else is on the menu. #KeepHopeAlive https://t.co/dFaJHX0AN0"]["The Republican Party is ready to serve as an accomplice to obstruction of justice. https://t.co/Sk1kgYRKsr"]["Thank you @ShorensteinCtr @HarvardIOP students and fellows along with the Kennedy School for a great semester."]["Why Team Trump Needs to Lay Off the Mueller Probe https://t.co/jndWdIZVDw"]["Women who accused Trump of sexual misconduct: 'Let's try round two' - NBC News https://t.co/9skttL5onb"]["Yep, it’s time for President Trump to step down. His accusers should be heard, and believed. https://t.co/sBS0sOPAZZ"]["#AmenCorner to @RepGwenMoore https://t.co/zPgQKB7zNy"]["#Sickening https://t.co/twOBvtkPch"]["#Surprise https://t.co/rQ347vlt5e"]["Jailed Russian hacker says the FSB coordinated his cyber-attacks on Hillary Clinton and the DNC https://t.co/lkKxZNgL9C via @meduzaproject"]["A genius and generous hero. Rest in eternal peace #Simeon Booker, intrepid chronicler of civil rights struggle for Jet and Ebony, dies at 99 https://t.co/5NHNpfMzfD"]["God loves you. Sending you my love. Bless you. Your nose is perfect and you are loved by so many. \n#StandwithKeatonJones. Stop the bullying. Teach tolerance. https://t.co/omJtHPPeF9"]["The country never understood the Russian meddling and political interference. This was a major cyber attack on every American voter - including those who didn’t bother to vote. One political party was hacked and its nominee was attacked daily. Where’s the outrage? https://t.co/wSZMeObx5B"]["Horrible. Three Arrested After Firebomb Attack on Swedish Synagogue https://t.co/GtnV1jOzNe"]["Could Roy Moore cost Alabama the $1.6 billion Toyota-Mazda plant? https://t.co/Aw4HvHraPB"]["Worth a read before you comment. https://t.co/2xgIXNByeK"]["#AmenCorner https://t.co/XwQIMsAqRD"]["#AmenCorner https://t.co/SCwdKKReN9"]["#AmenCorner: #Respect #CommonGood #Service\n\nLet’s also add #Justice #Fairness https://t.co/YYNDtPppTe"]["Back in the 1980s, folks questioned Jesse Jackson’s attempts to expand the Democratic Party and re brand it after years of litigating civil rights and voting rights. We have to set a table for everyone. But, once you are in, you can’t demand others leave the Party. https://t.co/x043OFGnWX"]["“You wanna fly, you got to give up the shit that weighs you down.”\n― Toni Morrison, Song of Solomon"]["Thank you @RepSwalwell for breaking down the importance of the congressional investigation into #TrumpRussia. https://t.co/bTQHYc7ZYX"]["The #CivilRights of all Americans should not become another partisan football. Those who marched demanded freedom and equal justice under the law."]["#ChooseHope https://t.co/pEW0NJt6gP"]["#FannieLouHamer... https://t.co/L7OILuGKFH"]["#Sick https://t.co/0wSekxGGHz"]["Well.... women of color beware. https://t.co/TYsnHIPsIq"]["NO DEAL: How Secret Talks With Russia to Prevent Election Meddling Collapsed https://t.co/Y9IfldLRTM via @John_Hudson"]["Study: Hillary Clinton’s emails got as much front-page coverage in 6 days as policy did in 69 https://t.co/Tr2K2hL2aD"]["Hey Mr Speaker, why are you standing by this man? Farenthold should step aside.\n\nEthics Committee launches investigation into Farenthold sexual harassment allegations https://t.co/anP1GFDF8e"]["Most Americans want Trump investigated for alleged sexual misconduct, poll finds via @axios https://t.co/EnQX6JhHBh"]["You still care about collusion? Stealing documents and forcing the candidate, the campaign and even the DNC to respond to hacked, stolen emails. The Trump campaign was too busy pointing fingers and hiding behind Russian propaganda.  https://t.co/K4klYQ0fMI"]["#WhiteWomen must help lead the way forward. Moore has not repented and apologized to women he abused. Why reward a man once banned from your local Mall? https://t.co/VPkz9N1ebb"]["Do we really want someone who was banned from the mall because he preyed on young women in the U.S. Senate? What’s so conservative about that? https://t.co/1TaZDjnrXx"]["The G.O.P. Is Rotting https://t.co/7bcMeclDhf\nRotting to the core"]["@sswestfall Thanks. Chip was so special."]["Russian social media executive sought to help Trump campaign in 2016, emails show https://t.co/3JEAWGhxkh"]["Stark Partisan Divisions Over Russia Probe, Including Its Importance to the Nation https://t.co/cUOw6V4kob"]["Good night.... Stark Partisan Divisions Over Russia Probe, Including Its Importance to the Nation https://t.co/cUOw6VlVfJ"]["In loving memory of my Pom Diddy Chippy Chip Gumdrop Booty wipes Marvin. He bought joy to our lives... This is the first bDay/holiday season without his woof woof manners in years.\n\nBoots, I miss your fun loving playfulness. Still celebrating Chip’s Birthday ( and Sis Chloe 2). https://t.co/NX0uo7YDxu"]["Republicans need to address urgent priorities:\n-Keep government open\n-Immediately reauthorize the Children’ Health Insurance Program\n -Funding Community Health Centers\n-Emergency disaster funding for hurricane- &amp; wildfire-impacted communities\n-Passing the #DREAMAct \nPass it on."]["Democrats are doing the right thing in showing support for the victims of sexual mis conduct, harassment or assault. Meanwhile the Republican National Committee is helping to elect an alleged child sex predator in Alabama. Please help support @TheDemocrats. We have work to do."]["#SenatorAlFranken’s entire speech should be a must read, must listen for all Americans. https://t.co/uDq1W4ADGy"]["#SenatorAlFranken: “all women deserve to be heard.”"]["GOP faces a reckoning on their sexual harassment stance https://t.co/VUUD63Pyin via @msnbc"]["This is totally wrong. https://t.co/HgfuD2ENSX"]["Interesting move. https://t.co/obMi290KEz"]["What’s happening?  https://t.co/EDQV1vKFpC"]["Be safe. Praying the wind calms down and firefighters can gain control. https://t.co/uISFX9re28"]["Thank you @JoeBiden https://t.co/EnH9f2Go4D"]["And #RoyMoore should be rejected by your party. https://t.co/0lBNKYkUq7"]["Thank you for this thread. https://t.co/KSVuxKfbgh"]["Doug Jones attacks: Moore belongs in prison, not the U.S. Senate https://t.co/muKznp3axS"]["@NomikiKonst @WorldTaiChiDay @TYTInterviews @TYTPolitics Our focus must be to educate, advocate and begin to agitate for the kind of change we want to see in the world. This is no longer an issue of top down, but bottom up grassroots folks raising hell and stirring the pots. Party politics is about electing our leaders. More.."]["Thank you @ShorensteinCtr. https://t.co/XtHFRdJVSU"]["Flynn Said Russian Sanctions Would be ‘Ripped Up,’ Whistle-Blower Says https://t.co/M0N6LqqM4c"]["You did extremely well. Enjoyed the interview. Best of luck! https://t.co/iVHipN5O1G"]["I like https://t.co/02VlTPMwLR"]["@thehill: the late Chip Joshua Marvin Brazile was full of canine class. #PetLover #AnimalLover forever. https://t.co/BNMEaaZvYk"]["@thehill Pets are wonderful. https://t.co/lD5a23xs33"]["Thank you @Beyonce for honoring @Kaepernick7! https://t.co/VojRB1Ff3G"]["#Woof him https://t.co/eStfiKSI4u"]["Speak your truth! Thank you for your service. https://t.co/7TeUmjZzY1"]["Russia probe tests Pence in-the-dark defense - CNN https://t.co/cqI1ft5KeV"]["What is the standard we are going to use to determine who should step down? Should tax payers demand what is being big done? https://t.co/NbyGLgb6Gx"]["My reply to Trump calling pet owners low class: woof you! https://t.co/iB33jihBPD"]["The @TheDemocrats are working hard to elect good candidates like Doug Jones. Please support them with a financial donation and commit to help in 2018. Thank you!"]["GOTV https://t.co/Enx2KEAbdQ"]["Former Sect of Labor https://t.co/FyQ3873sHy"]["Every attempt to distract from getting to the bottom of the Russian meddling only leads to more spotlight on what the Trump campaign did to help them sow discord and discredit Hillary Clinton. https://t.co/VcXdRYYNMY"]["Another day, another explosive story. #SexualHarassment is wrong. https://t.co/BMun1hFC6r"]["Russian told Senate Trump Jr. wanted info on Clinton Foundation money https://t.co/7rBzk0bis8 via @nbcnews"]["From old-school flirts to after-hours lechers, these are the types of sexual predators women encounter on Capitol Hill, writes @mcottle https://t.co/QAaUQ4lYdm"]["Take off the gloves. https://t.co/XdHLG7DLB9"]["#AmenCorner https://t.co/KksdpG1JsY"]["Hot damn! https://t.co/kddBa7mXXH"]["Opinion | Billy Bush: Yes, Donald Trump, You Said That https://t.co/qcwlThjren"]["Representative John Conyers has resigned his seat in Congress."]["Mueller subpoenaed Deutsche Bank records on Trump several weeks ago, source says https://t.co/OlKsgTmg2Q via @bpolitics"]["#AmenCorner https://t.co/OHOdNJFN30"]["What is the definition of shame? https://t.co/vxLX86RnuN"]["The #GOPTaxScam is great if you:\n-are excited to raise taxes on middle class families\n-want to ransack Medicare &amp; Medicaid\n-love to reward companies that send jobs overseas with massive tax breaks\nKnow the facts. It’s bad for the economy and your wallet."]["Wait, so if you live in a blue state, the #GOPTaxScam will hurt even more?  https://t.co/FyXmkSwRAb"]["Walked out with my children in tow. https://t.co/l2drG1LBGv"]["Good. Taxpayers should not be held responsible for this non sense. https://t.co/GaiJuDsMIO"]["@KateBrown16 I visited Alabama last week. Uphill battle, but Doug Jones is running hard on kitchen table issues."]["“https://t.co/kJBZvdiPAn: A New Example of Foreign Disinformation Aimed at the US” by @tchambers https://t.co/fBXkcs1uaJ"]["What’s on my menu? Will catch up on my favorite football teams later. I am looking forward to conversation with New Yorkers @92Y with @greenfield64. https://t.co/FmdprWiRT6"]["My guess is North Korea has gotten plenty of help from both China and Russia. https://t.co/lwoh8f0353"]["Every taxpayer must ask their member of Congress two questions: how will Donald Trump’s tax plan impact my life? Will the Trump’s tax plan pay for itself? Trump has refused to release his tax returns, but has no problem forcing you to bail out wealthy taxpayers. #SAD"]["Now would be a good time for the Trump Administration to wake up and acknowledge the Russian meddling in the 2016 election. Will they help defend American democracy from future cyber attacks? Hybrid warfare is still war. #ProtectOurDemocracy"]["Jared Kushner failed to disclose he led a foundation funding illegal Israeli settlements before U.N. vote https://t.co/eW9rcAjDcW"]["Thanks Jeff. I’m going to discuss the hacking of our election and why Congress must complete its investigation into Russian meddling and interference. https://t.co/jcKaWlRTeA"]["They are simply mean spirited. https://t.co/hhWQnmJglz"]["#ProtectOurDemocracy https://t.co/1Fd0lAO3ur"]["In response to the morning tweets of President Trump: \n\n“Nothing in all the world is more dangerous than sincere ignorance and conscientious stupidity.\" - Dr. Martin Luther King, Jr."]["Victims of harassment, assault triggered by recent events   https://t.co/VZJbIzmDYe"]["Shameful. https://t.co/0ymPnmRlvi"]["Flashback from the @nytimes: The Perfect Weapon: How Russian Cyberpower Invaded the U.S. https://t.co/G9MV6yNQ7x."]["........”The sanctions could also make it much harder for Mr. Trump to ease tensions with Russia, “which has just thrown the U.S.A. election to him,” she wrote. Her emails ..”Dispute White House Claims That Flynn Acted Independently on Russia https://t.co/M4w4t6nzUs"]["Sorry @AuburnTigers, it’s time to celebrate @Bulldogs. Congrats on winning #SECChampionship!"]["#SilentNoMore #MeToo https://t.co/Fxf5dEeeWG"]["Trump keeps playing nice with Mueller, for now https://t.co/Owiwq3lq9W via @politico"]["#Karma"]["Before we give another tax break, credit or cut to the wealthy, tell the President to release his tax returns. #TrickleDown only benefits the top. #GOPTaxReformScam https://t.co/M95djHDuYR"]["#WAKEUP https://t.co/0A1gcGRmAT"]["@MalcolmNance @allinwithchris @matthewamiller @MaddowBlog @CNN @MSNBC @JoyAnnReid @Isikoff @SRuhle"]["@92Y .... this coming Sunday."]["#GOPTaxScam is being rushed through because it can’t stand up to public scrutiny. https://t.co/y6jAF6tKnj"]["The Latest: AP sources link KT McFarland to Flynn papers   https://t.co/3YWklv9p5F"]["Gowdy, Benghazi panel settled wrongful firing suit with $150,000 in public funds https://t.co/rwqxRGL1rK"]["#WorldAIDSDay. Read this Opinion | Trump wants to gut America’s progress against AIDS https://t.co/bAOyjOTFZX"]["Lawmaker behind secret $84K sexual harassment settlement unmasked https://t.co/i8tzecr9x9"]["Paging Vice President Pence. https://t.co/89sNHC3Ec3"]["The case for normalizing impeachment https://t.co/EVwzyDTibw"]["We must fight for every vote. #DougJones https://t.co/OS0K0jrJMx"]["#BelieveDat. They must rise above partisanship and #ProtectOurDemocracy https://t.co/2CNdCNYFJE"]["@MaddowBlog is telling it like it is. @MSNBC"]["@ItsTheBrandi 🙏🏿"]["This is how we roll! I’m glad Hillary can speak her truth. https://t.co/9hTSdeg2jZ"]["#Obstructionist https://t.co/Iwa2POAzcf"]["Oh hell no! Congress, we are watching you. Please go forward with investigation until every question about Russian meddling has been answered. What is the President afraid of? Tell him that you work for the American taxpayers. https://t.co/GFTi7T4nII"]["Hope everyone is okay. https://t.co/BG3EkGolJV"]["#AmenCorner https://t.co/vTS1z5cjTd"]["@GrahamDavidA @sharkgirl73 @TheAtlantic You are a citizen. In my humble opinion, that is the best title in a democracy."]["@GrahamDavidA @sharkgirl73 @TheAtlantic We must continue to raise our voices, resist and register more Americans to vote next year."]["#Rigged — on no, not again. Read @EKamarck take on this controversial topic. https://t.co/oGDJ5XR83H"]["Trump's public displays of bigotry, hypocrisy, and detachment from reality are not an act, writes @GrahamDavidA: https://t.co/0OTQhInjln"]["The #GOPTaxReformScam will hurt you and your family. Please take action now. \n\nIt Started as a Tax Cut. Now It Could Change American Life. https://t.co/64xDoVwWuh"]["How is this good for average taxpayers? Republican Senate tax plan hits lower incomes the hardest, increases deficit $1.4 trillion: Congressional Budget Office - ABC News - https://t.co/mDqsJmtTay via @ABC"]["Russian trolls pushed graphic, racist tweets to American voters - NBC News https://t.co/bzLWqhPP0e"]["Wow.....The Trump allegations – a list https://t.co/JdZTlc1Wzh"]["Trump’s Russian Schizophrenia https://t.co/BHiaDpd4yc via @politicomag"]["Think. This... https://t.co/NHUYEqQyN6"]["Consider yourself lucky. https://t.co/bh5XZatNIf"]["Welcome to Twitter. https://t.co/UZCKm3yCkK"]["@eJoelWatts Agree"]["President Trump should delete his tweet. https://t.co/1isSkI0zy3"]["Instead of prioritizing American workers, the #GOPTaxScam gives companies a tax break for outsourcing jobs while penalizing Americans caring for children with disabilities or parents with Alzheimer’s."]["The #GOPTaxScam will slash taxes for the wealthiest Americans and big corporations. Who foots the bill? Middle class families, small businesses, and future generations.\n \nDemocrats want tax reform that puts the middle class first and spurs economic growth."]["Bye https://t.co/1HheAgXWzk"]["#TrickleDown economics that will widen income inequality and hurt the middle class. Just say no. https://t.co/qH6cChxHF0"]["#GivingTuesday https://t.co/slbEGOiP8A"]["@MARCMORIAL: “For over a century, the National Urban League has been a prominent voice for equality – working with people of all ages and backgrounds to exceed their limitations in achieving the American dream.” #GivingTuesday"]["Exclusive: Accuser to Roy Moore, 'Where does your immorality end?' https://t.co/E9hIlCeKNj"]["@BrennanCenter #GivingTuesday\n“Fight for solutions that will strengthen our election infrastructure and protect us from threats like Russia’s attack on our elections.\nDefend the right to vote and shut down the Trump administration’s sham “voter fraud” commission.”"]["I’m excited to share what @HenryLouisGates taught me about my ancestry again tonight. Watch #FindingYourRoots on your local @PBS station at 8|7c!"]["Here we geaux #Tigers! @AuburnTigers meet @lsu Tiger! https://t.co/2kaSmhIL5v"]["In plain sight. Yet, it still maybe happening now. Read and decide. https://t.co/uaiurs9rVA"]["Looking forward to seeing old friends and meeting new ppl. https://t.co/JYcJvKXETx"]["Tonight, my episode of #FindingYourRoots will be replaying on @PBS. It was fascinating to discover my ancestry with @HenryLouisGates – tune in at 8|7c on your local station!"]["Another great organization. #GivingTuesday @NAACP_LDF https://t.co/AsNUcxReVf"]["@neeratanden “Let’s use this #GivingTuesday to help take back our country, and build toward the America that we all believe in.” @CAPAction"]["Opinion | Odds Are, Russia Owns Trump https://t.co/O5O7HOoPnY."]["For those who might be interested in my roots — all the way back to the 17th century here in America, tune in tonight. @PBS #FindingYourRoots https://t.co/ie1d2ZEt6B"]["#KitchenTableIssues #GivingTuesday2017 https://t.co/lU710Tdo7h"]["The sinister screw-ups of James O’Keefe https://t.co/UocX5u16CP #ProjectVeritas"]["#AmenCorner https://t.co/TJEjfsx0rN"]["#ProjectVeritas is bad for democracy. https://t.co/h0AE1DQ5OT"]["#ProjectVeritas is bad for democracy. Think about it. https://t.co/G0F58K1g6Q"]["Mr President, someone needs to inform you that this is insensitive and wrong: \"You were here long before any of us were here. Although we have a representative in Congress who they say was here a long time ago. They call her Pocahontas.\""]["Introducing the current Brazile scholars. Paying it forward. Congratulations! More to come. #LouisianaStrong. Stay positive. https://t.co/FVkzquKLs4"]["A key witness in the Russia probe had 'a lengthy conversation' with Trump at Mar a Lago https://t.co/MELkGxb1Sd via @PoliticsInsider"]["A key witness in the Russia probe had 'a lengthy conversation' with Trump at Mar a Lago https://t.co/MELkGxb1Sd via @PoliticsInsider"]["CBO: Senate GOP Tax Bill Favors High Earners Over Low Income Taxpayers https://t.co/uAmeWkNze5 via @TPMj"]["#Hacks https://t.co/wAxJy8bq9r"]["No eligible American citizen should be denied the right to vote. The right to vote remains the lifeblood of our democracy. https://t.co/8bPjZjc7fT"]["Catch me on the following podcasts: @davidaxelrod @Bakari_Sellers @SusanPage @CapehartJ"]["Thanks for reading Hacks and for a great interview last week. #RolandBookClub https://t.co/hj3zni8l2J"]["Ready to run for office? Why you? Because there is no one better. Let’s figure out how to register more voters, motivate some new voices to run and get out the vote. It starts with having more voices in the arena. https://t.co/MYldZWdimZ"]["This is a good combination of the facts. Alabama, you deserve better. https://t.co/5UCXzIhdJc"]["Trump is quietly making it even harder to report sexual harassment and discrimination https://t.co/0XW0mMV3Lo # via @HuffPostPol"]["#HardTruth https://t.co/tfclsaGeOW"]["FBI didn't tell US targets as Russian hackers hunted emails   https://t.co/848Lb6T1TZ"]["Thank you @cwclub. Enjoyed visit to #SanFrancisco. https://t.co/Yk9G6Ecoic"]["#AmenCorner https://t.co/NE8phpAeiI"]["#AmenCorner https://t.co/w2NRh48Pvx"]["#TrumpRussia https://t.co/TUoXvVDVC1"]["@SenWarren goes off on Trump over CFPB defense https://t.co/aqPo4F8F4n"]["From one Tiger to another, Congratulations Auburn! https://t.co/5TSq3Rw4hl"]["“While everything around you is changing, you are also changing. Trust your new self to adapt in all things you do.” @AngelouQuotes"]["What’s next? @Twitter suspends 45 Russian propaganda accounts that shared messages on Trump, Merkel and Brexit https://t.co/9ZSAcnMVkV via @IBTimesUK"]["“Kelly Has Clipped his Wings”: Jared Kushner’s Horizons Are Collapsing within the West Wing https://t.co/wkHEvb176k"]["Maya Angelou: “There is no greater agony than bearing an untold story inside you.” Many thanks for reading Hacks. \n#BlackFriday https://t.co/6QBtQDvcQt"]["#BlackFriday2017 https://t.co/dHgjt0ppZ9"]["@DearAuntCrabby @thehill @TomPerez @keithellison @dccc @TheDemCoalition #Alabama  @GDouglasJones for US Senate, #Atlanta @KeishaBottoms for Mayor"]["Thoughts and prayers https://t.co/AjTZKCiKzD"]["Exclusive: Manafort flight records show deeper Kremlin ties than previously known https://t.co/8TVJrGjFXc"]["Please pray for the Carville family down in Louisiana. James’ sister Bonnie passed away this morning. Rest in eternal peace."]["Congressional Russia probes likely to head into 2018 - ABC News -  via @ABC https://t.co/qkG6AKiNmx"]["Through acts of goodness and kindness https://t.co/GcxJlMEKjf"]["https://t.co/gGQfkhOqGj"]["A Russian Journalist Explains How the Kremlin Instructed Him to Cover the 2016 Election https://t.co/53iDZsPb7F"]["@terridonovan12 Respect yourself and rest will follow. Read the book"]["What about the greens and potatoes? #HappyThanksgiving to our men and women in uniform. We thank you for your service, https://t.co/6iN9d0rC1m"]["Week 26: Donald Jr. and WikiLeaks Talk Dirty https://t.co/FkH0M002xF via @politicomag"]["@terridonovan12  HappyThanksgiving to all.\nPlease find some joy to share with others."]["🙏🏿 https://t.co/bHYoUcRJk4"]["Bless you Jose. #HappyThanksgiving2017 https://t.co/lEwZt9bldU"]["“Abuser”: Doug Jones’s brutal new ad against Roy Moore https://t.co/CYLYUm6mr2"]["“Abuser”: Doug Jones’s brutal new ad against Roy Moore https://t.co/CYLYUm6mr2"]["Oh Lawd. https://t.co/csvVPcX5Lt"]["Sexual harassment is a persistent and pervasive problem across our society. It’s nonpartisan!"]["Journalist Investigating Trump And Russia Says 'Full Picture Is One Of Collusion' https://t.co/MzYSatZBFG"]["Facebook Plans to Let Users Know if They Followed Russian Pages  https://t.co/3K5QY61YAG via @WSJ"]["Mueller probes Kushner’s contacts with foreign leaders and possible role in Comey’s firing https://t.co/fS0EYEI4kf via @WSJ"]["By the numbers: The Trump orbit's contacts with Russians @CNNPolitics https://t.co/C0OBRCay0i"]["Book signing at Politics and Prose in Washington DC https://t.co/IfE4YS2k2k"]["Russia probe: Trump's tweets could be evidence against him, legal experts say https://t.co/RqWD9gMPYU via @usatoday"]["Wow..... This is serious. We need to know more.\n\nUber Concealed Cyberattack That Exposed 57 Million People’s Data - Bloomberg https://t.co/oHBzt2ZNbP"]["Opinion | ‘Hardball’ anchor Chris Matthews on what today’s politicians can learn from Bobby Kennedy https://t.co/Las8z4UeAQ"]["Wake up America! There’s a little-known fund that goes to victims of sexual harassment on the Hill. You pay for it. - Vox. https://t.co/A88zKUugQD"]["Don’t forget the roux! Happy Thanksgiving https://t.co/y3shXBEwt7"]["Thank you for your service. https://t.co/bhkr30C63J"]["#BanMoore https://t.co/TrAErIDHik"]["Donna Brazile says Russians destroyed ‘critical’ DNC data https://t.co/GVhGBGwZcY"]["Join the conversation. https://t.co/GG1CHIjdUg"]["I am waiting for the day when this headline make the news: DNC Hack results in criminal charges against those who colluded with Russia to meddle in the 2016 election. Can’t wait. https://t.co/n8zZCoJ3oX"]["Donna Brazile in Atlanta: ‘Don’t Step on Me When I Tell You My Story’ https://t.co/MK6JNsUpig via @TheRoot"]["TONIGHT #FindingYourRoots with @HenryLouisGates featuring @TeaLeoni and #GabyHoffmann is happening on @PBS at 8/7c!  Get excited!"]["What’s on your menu? About to discuss my latest book “Hacks” on @MadisonSiriusXM. Joe, “the Black eagle” is one of the best political mentors of all time."]["Young Turks and reporter abruptly part ways following sexual assault allegations https://t.co/Tj9JBjHupo by @aidachavez"]["Ex-DNC chief Brazile in Atlanta: Answers still needed about 2016 election https://t.co/TGsTk00P3f"]["Heaven has another angel. Rest in eternal glory #DellaReese https://t.co/JOA5DHl5cg"]["One of the finest angels. Love to #DellaReese https://t.co/UBfAddvHbN"]["Sources: McMaster Mocked Trump’s Intelligence At A Private Dinner https://t.co/23pN8hnLuP via @bernstein."]["We talk about the hacking of the election, the expansion the number of Democratic and much more including Rev Jesse Jackson’s historic campaigns. https://t.co/s9UnXadr9O"]["Opinion | Stop the sniping, Washington Democrats. Learn from the grass roots. https://t.co/mcVI0fpR3p"]["Why evangelicals are again backing a Republican despite allegations of sexual misconduct https://t.co/lTjZXpKhqw via @BostonGlobe."]["What’s the plan? #EqualPay benefits both men and women. https://t.co/hGCU0XxWS3"]["What’s on your menu? @TJMShow @tvOneNews @rolandsmartin live at 7:15 amET. Roland will bring the funk and I plan to bring some tabasco. #StirringThePots https://t.co/s12BMKC12z"]["John DeShazier's analysis of Saints wild 34-31 OT victory https://t.co/chwJOh484e via @Saints"]["#WhoDatNation https://t.co/lTJj1IF2gA"]["#SpotOn https://t.co/szwctIA7t2"]["Who Dat https://t.co/qsJbl7umSC"]["Last year, very few ppl believed the story. @JoyAnnReid along with others did. https://t.co/t1np4QJwmf"]["Thank you #Atlanta for your southern hospitality. Great conversation about my new book “Hacks” with Mo Ivory. Special thank to the #ZucotGallery for hosting this special event."]["What else do you need to know? The country was attacked by cyber warfare last year. Now read: Russian trolls boosted voter fraud fears months before election https://t.co/FkzfqtcDhw via @nbcnews"]["“Russia if you’re listening....” The G.O.P.’s “Boil the Frog” Strategy to Save Trump https://t.co/7o1OxbEMtH"]["“My wish for you is that you continue. Continue to be who and how you are, to astonish a mean world with your acts of kindness. Continue to allow humor to lighten the burden of your tender heart.” Maya Angelou"]["Special thanks to @lsu and the Louisiana Leadership Institute for hosting my book party in Baton Rouge. #GeauxTigers."]["As Maya Angelou once wrote: And Still I Rise! https://t.co/bVmhdxwHs3"]["Thank you my beloved #New Orleans. Over the weekend, we made history and what a celebration on the eve of our tricentennial. Congratulations to Mayor-elect Cantrell. Now,  #WhoDatNation must lead us. @Saints"]["If you live outside Alabama, there’re multiple ways to help Mr Jones:\n1. Donate a few dollars\n2 Volunteer to make calls or canvass\n3  Urge your friends and family to vote in Alabama\n4  Be positive\n12/12/2017 is Election Day https://t.co/wwDCRyVG5v"]["Female former staffers of Al Franken come to his defense https://t.co/oimkQhCTSI"]["Thanks Claude. My lifetime as an activists, a grassroots organizer and much more allows me to get up every day to choose hope, choose action. https://t.co/Q2G4XDv8eJ"]["#AmenCorner https://t.co/Wcqk2M0uvB"]["Haters! Go find your joy. New Orleans made history. Go find your peace. Women are helping to lead forward."]["#TellYourStory https://t.co/EfGHTYmgX9"]["Be careful what you wish for! https://t.co/cIBZsMzX22"]["#NewOrleans make history. Congratulations to Mayor-elect #LatoyaCantrell."]["#Sickness https://t.co/t4xBk7wNyY"]["It’s #ElectionDay here in the State of Louisiana. Tonight, New Orleans will join Baton Rouge and Shreveport in having a female chief exeuctive. #WhoDatNation! https://t.co/JMOtDYBlOI"]["Russian ambassador says he won't name all the Trump officials he's met with: 'The list is so long\" https://t.co/esv35vBjTm"]["Remember what the great American writer and poet taught us: “There is no greater agony than bearing an untold story inside you.” @AngelouQuotes \n\nTell you story\nSpeak your truth\nDare to make a difference\n#MeToo"]["What baseline do we set now? Because this issue is not going away.  Our voices will not be silent. Our story will be told. https://t.co/cOUnXuWmg4"]["#AmenCorner: Hillary Clinton on Trump's election — \"There are lots of questions about its legitimacy\" https://t.co/fliHHXAeWl via @MotherJones"]["When Has Trump Been Accused of Rape or Attempted Rape? Allegations Include a Child, His Wife and a Business Associate https://t.co/0upYGlbh8w"]["@WWLTV welcomes me to discuss my new book “Hacks.” https://t.co/PC3Wm1uSC7"]["The Ex-Spy Behind the Trump-Russia Dossier Left a Clue for Mueller https://t.co/SWTAtQqrhc"]["Who Dat? Great evening with @TeamKCP to discuss this weekends mayoral election in New Orleans.  Together we rise!"]["Low down and dirty....... Jared Kushner got emails about WikiLeaks, Russia in 2016, lawmakers say https://t.co/ywljxWrAtw"]["#Bucketlist...opening act for this amazing woman. #DivaDish https://t.co/lDgcsrZWHq"]["#AmenCorner https://t.co/DR7SblobdY"]["#IBelieveTheWomen \nTwo more women describe unwanted overtures by Roy Moore at Alabama mall https://t.co/Hdc9I4msC5"]["Get in line https://t.co/W5mWh3oNDd"]["Thank you @MiamiBookFair @ananavarro @cspan for a delightful evening. Next: #WhoDat?"]["Prayers for this officer. https://t.co/dGoGS1ctwM"]["Sorry I missed this important lecture sponsored by the @ShorensteinCtr https://t.co/9AAjYoFty9"]["Lawd have mercy....#IBelieveTheWomen! https://t.co/olVBg5OKvq"]["Roy Moore was banned from the mall and its time to ban him from entering the U.S. Senate. Vote @GDouglasJones! https://t.co/oZAsZ5oEUy"]["Thanks @DLHughleyRadio. https://t.co/AZTIl9oAQ0"]["Christopher Steele believes his dossier on Trump-Russia is 70-90% accurate https://t.co/miv8CSIJ7P"]["Show me the money ... and Together we will find the collusion. Secret Finding: 60 Russian Payments ''To Finance Election Campaign Of 2016” https://t.co/KsT431buHQ"]["“[Brazile] does have a story to tell that the Democrats shouldn’t dismiss, if they intend to win the White House in 2020…. The book is a fun read… The conjunction of Brazile’s indiscreet book. A dose of [Brazile’s] Dolores might even help.”\n—Amy Davidson Sorkin, @NewYorker"]["Why the Democrats Should Listen to Donna Brazile https://t.co/a7b3z5A2tH"]["Same man, different story. Sessions again changes his account of what he knew about Trump campaign’s dealings with Russians https://t.co/a1nSn69DDI"]["@DiscoPotential: please go find your joy. Long before i wrote my book, my weekly columns stirred things up. Thus, you can simply repeat after me: joy cometh in the morning. #AmenCorner"]["Thanks. #GoRead https://t.co/OHarCPlH8q"]["Ahhh... https://t.co/xD9uXK2GCC"]["Just say no to #RoyMoore https://t.co/aAcRWNNL4Z"]["Wait, you mean Dems won in a red state? #Bluewave https://t.co/EiaEP87pPx"]["#AmenCorner: Thank you. Thank you. The top 10 audiobooks on https://t.co/T5bEJ8BqyL https://t.co/arL07ChQ2v."]["Fox News' Shepard Smith debunks Uranium One lie peddled by his own network https://t.co/jlGwhl24pD"]["We can’t simply pray for the victims and those murdered without doing something to help prevent the next one from happening. https://t.co/kBPViG0J49"]["Thank you @CapehartJ for a great discussion and interview regarding “Hacks.” | ‘The condescension was amazing’: Donna Brazile unloads https://t.co/YK1nSFbz7I"]["How much sway does Fox News have over the Justice Department? https://t.co/goA62YafLW @MattGertz"]["Secret Finding: 60 Russian Payments \"To Finance Election Campaign Of 2016” https://t.co/0QsJjlb26m via @jasonleopold"]["Gwen Ifill was a trailblazer. We miss her voice, her compassion, wisdom and laughter. Bless you Sister. https://t.co/MZG8fjyPk4"]["https://t.co/K9MkmUIZkP"]["Team Trump promoted the hacked, stolen emails and more like it came straight from the gospel. https://t.co/K1BgQFSIxD"]["Outrageous. The country was under attack and the Trump team did nothing but help the enemy. Shameful and sad. https://t.co/45YWVF3fSf"]["Eric Trump should testify about Russia, a House Intelligence Committee member says https://t.co/YwBa8U093S"]["The @HouseGOP Shell Game:\n$1.5 trillion tax cut to corporate America\n$1.5 trillion cut to Medicare &amp; Medicaid\n#GOPTaxScam"]["So, #Wikileaks is upset that the emails are  \nbeing made public......really?"]["Please help Doug Jones and the Alabama Democratic Party. https://t.co/qrIG5P6WNn"]["Donald Trump Jr's WikiLeaks communication was flagged to Kushner, Bannon https://t.co/U4b4wfCzOw"]["The Secret Correspondence Between Donald Trump Jr. and WikiLeaks - The Atlantic https://t.co/YsaXTeKzV7"]["George Papadopoulos contacts Stephen Miller after Clinton 'dirt' promise https://t.co/595YVdlKNI"]["@AmandaJuneBell: Timing is everything. Everything is in divine order."]["What Mueller's org chart reveals about his Russia probe https://t.co/EEfXr9pgib via @politico"]["Congrats  to Lt. Governor elect Justin Fairfax of Virginia — former colleague in the Gore campaign. @vademocrats @TheDemocrats #BlueWave https://t.co/SPc1CWx8ns"]["This is why they blocked many of Obama’s judicial nominees— to install their own conservative firebrands. https://t.co/OAhQn7z9FP"]["What about “I will defend the integrity of the Americsn electoral system against foreign aggression by Russia or any or nation.” #ProtectOurDemocracy @cspan in the next hour. https://t.co/goU3QvmGTt"]["#AmenCorner https://t.co/eRME5V5Ral"]["Thankful for #LaDavidJohnson’s service &amp; sacrifice. U.S. soldier in Niger ambush was bound and apparently executed, villagers say https://t.co/kVoxGGKKrg. #HappyVeteransDay."]["@AngeloRayGomez In a few years, we will celebrate the 100th anniversary of suffrage for women. We no longer need permission to run for office, vote for women or tell our story. We are empowered to write, speak, run and win. Victory!"]["Speak @tanehisicoates: He has an incredibly clear explanation for why white people shouldn’t use the n-word https://t.co/qz5nuYqsg6"]["The press should ask the White House to explain the President’s comments. https://t.co/MkDvkd9hZJ"]["Women racked up victories across the country Tuesday. It may be only the beginning. https://t.co/KsIGLfzwyL"]["Where is the outrage? In 2016, the US was attacked by Russia to discredit one political party (Democrats) and destroy one presidential candidate (Clinton). Where’s the patriots now? https://t.co/Yn9VkNOQc1"]["#HappyVeteransDay https://t.co/P5znpJXQL6"]["Tracking the Russia investigations https://t.co/GDo18EhQVv"]["When it comes to geopolitics and national security, Putin will look out for #Russia. #ProtectOurDemocracy https://t.co/Vz5SQqciX9"]["Aide who pleaded guilty to lying about Russia helped write major pro-Russia Trump speech https://t.co/ZpLOZeXDjN via @shareblue"]["Trump absolves Putin and shoots himself in the foot - CNN https://t.co/mPiEJ7njVD"]["The One County In America That Voted In A Landslide For Both Trump And Obama https://t.co/rA0BNNypPr"]["All the proof we need: Data firm’s WikiLeaks outreach came as it joined Trump campaign  https://t.co/Q6oSsl9uB7 via @WSJ"]["Speak https://t.co/J1ElquBs9e"]["Sow discord and chaos. Deliberately went at @TheDemocrats and our own democracy. #staywoke https://t.co/XPuGMcg26A"]["Good news: @JoeBiden and @greta have new books out this weekend. More to come."]["Read this excellent Perspective | Could Russian trolls have helped elect Donald Trump? https://t.co/8TD54JnyrP"]["Rep Nunes attended a breakfast with Flynn, Turkish foreign minister just before the inauguration https://t.co/HKe3FZPuOl via @PoliticsInsider"]["Bombshell Roy Moore Report Could Reshape DC's Political Landscape - NBC News https://t.co/yniXKG51kY"]["One of the busiest websites in the U.S. in 2016 regularly linked to Russia propaganda https://t.co/jMCjaIXuGn"]["Where’s the clergy? Who is organizing them to speak out now? Get these Trump apologists off TV, no more talking heads decrying the obvious truth. Business ppl, where are you? We must hear from you. \n\nMy fellow Americans, the world is watching. #MLKWeekend."]["Preach https://t.co/yeTMJ31HQ4"]["Amen. https://t.co/utCkQmMBVk"]["Former PM of Haiti. \n#EnoughIsEnough https://t.co/c4yIi5XxfU"]["Proud to defend and support the ppl of #Haiti, #ElSalvador, #Honduras and the entire African continent. We are all human beings. And to every single member of our military and first responders, please know we stand with you and your families. Geez, Mr President. Get a grip!"]["Thank you @ChrisCuomo. https://t.co/vaSYlm39VO"]["Have we lost a sense of compassion? Where’s our empathy for the poor? This is outrageous. https://t.co/52oP28nZuQ"]["#AmenCorner https://t.co/cFZYcDQA6E"]["With stores across the country, let’s hope #Walmart will find jobs for those they are laying off. https://t.co/9bbqpCOa0Z"]["Listen to the @TheView https://t.co/2zzIKznscl"]["@naretevduorp @EricGreitens @clairecmc Damn"]["Hold your comments..... President Donald Trump Signs Bill (@repjohnlewis ) Upgrading Martin Luther King's Birthplace to National Historic Park https://t.co/SKhfZ2si0Y via @BreitbartNews"]["Thoughts and prayers for those still missing in the #SantaBarbara mudslides.\n\nRace to find survivors of fast-moving SoCal mudslides - CBS News https://t.co/zixggaWUyx"]["Mueller adds veteran cyber prosecutor to special-counsel team https://t.co/rL6psSevKs"]["25th Amendment: How do we decide whether the president is competent? https://t.co/opk8cOMW3f via @BrookingsInst"][".@SenFeinstein is a woman of valor. Read below. \n\nTrump is mad that “Sneaky Dianne Feinstein” debunked a key Republican theory on Trump and Russia https://t.co/ibB9VHGaCZ via @voxdotcom"]["She is worthy of this award. Tina Turner is “simply the best.” https://t.co/Kpn6h4aTnx"]["Please...... https://t.co/bLMOY8LtUw"]["#AmenCorner https://t.co/3QHdJjC0rE"]["Thank you @brhodes. https://t.co/9ZQ2tMa3DV"]["Newly released Senate testimony debunks a key conservative theory on Trump and Russia https://t.co/FtAfqcC3aR"]["Thank you @SenFeinstein https://t.co/Ve7KPeQkxO"]["Not that Donald Trump hasn’t attacked me viscously and repeatedly. It’s just that, on my side, that just counts for bragging rights.\n \nIn fact, among Democrats, if Donald Trump isn’t attacking you, it’s really a sign that you need to step up your game."]["Steve Bannon and I. We both ended up pissing off a lot of people. But I’ll say this for myself—at least I did it with my own book."]["Thank you .@TomSteyer for inspiring a better future. https://t.co/rpsIKUmjwD"]["#DreamActNow https://t.co/sztPCc9TM7"]["Congratulations @AlabamaFTBL @UofAlabama \n#RollTide #NationalChampionship https://t.co/CkDUhZVnPM"]["#NationalChampionship....\nPlease"]["Power Rising: Building an Agenda For Black Women\nFebruary 22-25. Please help to get the word out for this amazing gathering of Black Women to take place in Atlanta, GA. It's time!  #BlackGirlMagic #BlackWomenLead  \n#StillWithHer"]["What is the best part about Oprah running for president? She can announce it by telling everybody to look under their seats!\n#Oprah2020"]["Talks underway about Trump interview in Mueller's Russia probe https://t.co/pejVgEsDXK via @nbcnews"]["@dmcguire13 Thanks for sharing Ms #RECYTAYLOR story and homegoing."]["Read @OprahWinfrey’s #GoldenGlobes Speech https://t.co/mM6fjaHfXR"]["Thank you @Oprah for saying her name. Ms Recy Taylor, Who Fought for Justice After a 1944 Rape, Dies at 97 https://t.co/CsNWFk0lML"]["Ouch.....\n\nStephen Miller had to be escorted off CNN's set after his interview with Jake Tapper went off the rails https://t.co/ib23GPzAn0 via @PoliticsInsider"]["Thank you @Saints! Team spirit and lots of beer left over for the #GoldenGlobes."]["Taking a mini football break. https://t.co/XtnGw4HxdQ"]["Geaux @Saints!\n#WhoDatNation \n300 years old!"]["Geaux @Saints! #WhoDat"]["Team Trump post #SloppySteve apology. https://t.co/mtfZtIi6FW"]["#SloppySteveBannon has formally apologized to the #stable genius and his family. Maybe we should see if we can get Fox &amp; Friends to just show calm and soothing videos with puppies and kittens."]["Good luck @TinaSmithMN. https://t.co/dp51ATcClQ"]["Earlier, POTUS just called himself a “very stable genius.” It would be less disturbing if he was just tweeting “covfefe” repeatedly.\n\n#Can we agree that the best retort to being called unstable is not to refer to yourself a “very #stablegenius”?"]["Led by the Mercers, Bannon’s Allies Abandon Him https://t.co/KahNIQI5gx"]["Speak! https://t.co/8i11LFJKze"]["This is real leadership.  https://t.co/WEj7WJQGHr"]["Steve Bannon is the latest to say that there's no longer any doubt about collusion with Russia, @GrahamDavidA writes https://t.co/ZcVK8PkNUl"]["Okay, let’s admit the truth: Breakups are rough. You end up binging on junk food and TV… but then that’s how President Trump lives his life already."]["Trump attorney sends Bannon cease and desist letter over 'disparaging' comments  - ABC News -  via @ABC https://t.co/r1mD4DMqHn"]["It keeps getting wilder between Trump and Bannon. \n\nTrump splits from Bannon. Now he’ll do that breakup thing where he calls and cries to other exes. Be ready, Paul Manafort."]["Thank you @sfpelosi.\n#Women stand with London Breed for San Francisco interim mayor https://t.co/AFsdJ3dwpj via @sfchronicle"]["Mr. Trump claims “Democrats are doing nothing for #DACA.” \nWrong. \nDems are trying solve the problem. \nTrump IS the problem.\n#Dreamers deserve better.\n#KeepHopeAlive"]["@cmclymer Thank you for sharing your story and lending a hand to others. Bless you. Keep Hope Alive!"]["We still have a long way to go. Glad @GDouglasJones selected an outstanding public servant to help lead his office. https://t.co/1fWYyBelDX"]["#Resistance https://t.co/YeUFeNyjMq"]["Thank you @BetteMidler. This is so powerful. Please watch it soon. https://t.co/gCHscU2fDh"]["#HappyNewYear!\n\nPowerful Hollywood Women Unveil Anti-Harassment Action Plan https://t.co/wpprDLtuL8"]["#HAPPY NEW YEAR to everyone! Bless you all."]["Thanks @cspan for allowing me to share my book and insights. https://t.co/WMEgsLFVgx"]["Dear Tweet hearts:\nAs 2017 comes to an end, let’s remember those who have decided to run for office next year. Please give a little now so you can rest comfortably in 2018. \n\nThe #BlueWave2018 will rise with your help &amp; support. Thank you. #HappyNewYear @TheDemocrats #Resistance"]["@NomikiKonst @Vote4Pedro2018 @EdB2630 @rookee_baekr @TYTPolitics @DNC Correct. I am not a DNC consultant or a paid staffer. For over 30 plus years, I have given my time and talent to the party. Paid staffer for Gore 2000. Peace and best of luck in 2018. Now, let’s keep our eyes on the prize."]["This sums it up.\n\nIncoherent, authoritarian, uninformed: Trump’s New York Times interview is a scary read https://t.co/yW2azeBxW2"]["What’s new? \n\nMueller Probing Whether Trump Team Aided Russian Trolls https://t.co/LWtGWtGGmX via @intelligencer"]["This is wise advice. We have to be prepared for the next round of cyber attacks. The Trump Admin and GOP controlled Congress will not take steps to protect our elections from foreign meddling. https://t.co/tDKPbyqcv5"]["Trump displays delusions in his New York Times interview https://t.co/e1wXCU9whK"]["Analysis | In a 30-minute interview, President Trump made 24 false or misleading claims https://t.co/9pYNGQWan7"]["@HillYes1 Grow some happiness and spread the joy. Don’t get caught acting like a bot when you troll on others. #Peace"]["@JaimePrimak So true."]["FACT CHECK: Where Roy Moore's Voter Fraud Claims Fall Flat https://t.co/mWfxZ0uEWV"]["Fuel, broadband technology and more.  Message to Mr Trump: Russia will not help us. https://t.co/XdzGA4bb2C"]["Awards for best, worst of 2017: A year of living nervously https://t.co/WWCCsAOZZs. #Hacks"]["Really? You know what is so disturbing about this headline? Does anyone care about protecting our democracy from foreign meddling?\n\nTrump Says Russia Inquiry Makes U.S. ‘Look Very Bad’ https://t.co/ZA4fo8mEt9"]["Mueller investigation looks into whether the Trump campaign helped Russia use data to target U.S. voters https://t.co/PrcZE1wXgn"]["The Bible states that “weeping may endure for a night, but joy cometh in the morning.” My solemn prayers dor the Garner family. May Erica rest in eternal peace. @es_snipes will not be forgotten. #Peace https://t.co/OLzOi3VGQW"]["@silveraa There’s a great lot to choose from. National or State level?"]["Stop and think.... is this the new norm? Read the @BostonGlobe analysis. https://t.co/Ntl0FQGe3C"]["Wait... expectations to do what? This is why we needed an independent investigation following Russia’s interference in the 2016 US election. https://t.co/KRqh9cGfpK"]["New York’s Attorney General in a Battle With the President https://t.co/Cy6FT0nBxH"]["For God’s sake: Koch Network To Launch Multimillion-Dollar Campaign To Try To Convince Americans To Support The New Tax Plan https://t.co/bTMdzq8C5Y"]["These two special dogs brought joy and happiness to my life. 2017! https://t.co/yRW04a6SDx"]["Chip’s beloved canine soul mate has passed. Liberty was playful, clever &amp; extremely generous with her kisses. She welcomed strangers and could hold her own in public. Most of all, Libs loved children and running with Chip for the ball. Libs can play in Canine peace with Chip. https://t.co/MnXN3xcaUU"]["@AuntLulie It’s on the list of items to do in the coming year or two"]["#HappyKwanzaa \n\nIf you want a few cooking ideas, please review this selection.\n\nhttps://t.co/gmis0MXEFn #NYTCooking"]["Bit by bit, Trump is taking apart the New Deal’s glorious legacy | Heather Richardson https://t.co/3GpmVq5ibY"]["Opinion | Russia never stopped its cyberattacks on the United States https://t.co/LZ9iKEX6Qv"]["This Prominent Actress Launched A New Orleans Art Exhibition Celebrating Black Female Power And Beauty | BLAVITY https://t.co/vQU9rLEXUH via @blavity"]["More joy on #ChristmasDay!\nAn Explosion Of Small Donations Powered Democratic Wins In Virginia House - HuffPost https://t.co/aBJqmmx6X6"]["What are we going to do about it?\n\nKremlin trolls burned across the Internet as Washington debated options https://t.co/yeO34lbat8"]["#MerryChristmas https://t.co/eLvL1e8R6z"]["I have fond memories of meeting your Dad. He was a wise man, a generous soul and warrior for peace, justice, freedom and equality. #RIPMarcusRaskin. https://t.co/QICIWstwTO"]["Bannon Puts Jared Through the Grinder https://t.co/1LLUMoPdvz via @politicomag"]["This is the best Christmas present ever. #MerryChristmas https://t.co/phFz36936W"]["Former Louisiana Gov Kathleen Blanco is one of my sheores. Please continue to lift her up in prayers. She’s a fighter. #LouisianaStrong \n#Resilient\n#Warrior\n#Catholic\n\nThanks @tegbridges for telling her story. https://t.co/a1DmnAaFfn"]["It will place the entire nation in peril. https://t.co/9tZ5hDmeWO"]["Thank you @POLITICOMag.....\n Thank you Lord.\n\n#AmenCorner \n\n#humbled \n\nOur Most Popular Reads of 2017 https://t.co/BjkpApXPg0 via @politicomag"]["ACA deadlines:\n \n·         CA: 1- 31, 2018\n·         CO: 1- 12, 2018\n·         CN: 12- 22, 2017\n·         DC: 1- 31, 2018\n·         MD: 12- 22, 2017\n·         MA: 1- 23, 2018\n·         MN: 1- 14, 2018\n·         NY: 1- 31, 2018\n·         RI: 12- 31, 2017\n·         WA: 1- 15, 2018"]["Hopefully in a city led by a female Mayor, they can find a few women to add to the mix. https://t.co/OVH8cCRbO1"]["Truly sad. We must uphold one standard. https://t.co/Xt9c6O1xBx"]["Breathe gently and release pain and anxiety. Inhale peace and happiness. 7 Times with eyes close.\nGood night sweet Joy. https://t.co/GL8t2FRbZA"]["Sign of tomorrow."]["https://t.co/9QyeDaLbfG"]["After reading this piece, please consider reading my book Hacks.\n\nRussian trolls went on attack during key election moments https://t.co/nX9KwmF6hN"]["A sign up of the future. Like 2020. https://t.co/GXcAQI8hj5"]["#History https://t.co/zXNhcinIa6"]["#byebye https://t.co/pUEHg42Sq2"]["Romanians hacked DC surveillance cameras @CNNPolitics https://t.co/ZwnIZaJpGP. \n\n#Hacks"]["#AmenCorner - Please read. If the tone offends you, don’t read it now. Save it for another day.  Open your mind and heart.  We have to help each other. \n\nRead: Dear Black Women: It's Ok To Save Yourself Instead Of The World | BLAVITY https://t.co/5ijyLizPrM via @blavity"]["How right-wing media are laying the groundwork for an assault on voting rights in 2018 https://t.co/MbRxHxF1Y7"]["Everyone needs prayers, especially now when we must look out for and protect our most vulnerable citizens. Mr President, you also need our thoughts and prayers. I am praying for acts of goodness and kindness for ourselves, family, friends, animals and the entire global planet. https://t.co/JRqJt0u6P2"]["Congratulations to @MSNBC. Hard work paid off in viewers. https://t.co/L5zQcwrI0U"]["Honorable and decent public servant. As President, he set a wonderful example. Thank you President Obama. https://t.co/bsCNYF9VXC"]["#ProtectMueller https://t.co/AYqeMHiard"]["And the President still refuses to release his taxes. \n#Sad https://t.co/y8zVryZU3E"]["Is this what true conservatism looks like? Explode the national debt on the backs of the poor, the elderly and children. \n\nNext year, the GOP will attack social security, medicare and medicaid to try to pay for their irresponsible tax bill.\n\n#Sad https://t.co/dXvWCA5S5m"]["How many bills will the GOP sign this year to protect the 2018 elections from foreign meddling and intrusion? Zero\n\nWhen it comes to Protecting Our Democracy and ensuring we can withstand another wave of cyber attacks, the Trump Administration and GOP Congress is AWOL. \n\n#Sad"]["Americans oppose the #GOPTaxScam by a 2-to-1 margin. Republican lawmakers claiming the #GOPTaxScam will grow on the American people are counting on a pipe dream. \n\n86 million American middle class families will see a tax hike. Are you one of them? #StayWoke!"]["The #GOPTaxScam is the definition of terrible policy that will hurt American families.\n \n-Poor children\n-Seniors on fixed incomes\n-Suburban families\n-Workers\n-Teachers\n-Police Officers\n-Firefighters\n-Veterans\nAmericans from coast to coast will suffer under the #GOPTaxScam."]["@AngeloRayGomez. You seem so sad right now. When you cannot engage in civility, you start to attack. Stop trying to silence me and other women. We are not going to move off our platform. We are standing strong. So, close your shades and open the windows."]["@Heritage selection of a Black woman is one of the strongest political positions I have seen religious, social and economic conservatives start to make. \nDon’t forget Trump asked us “what do you have to lose?”"]["Congratulations to a thoughtful and knowledgeable leader on some many fronts. Another Black woman being elevated this month. #AmenCorner https://t.co/TtWugOJwbP"]["The #GOPTaxScam:\nStep 1: Give tax breaks to the wealthiest and corporations. Rewards Outsourcers.\nStep 2: Explode the deficit and inflate income inequality.\nStep 3: Force American middle class families to foot the bill.  \n\nCall Congress and say vote nay."]["FBI told Trump Russians would try to infiltrate his campaign https://t.co/8iNGLsSf1l via @nbcnews"]["Tune-in TONIGHT!  The season finale of #FindingYourRoots with @HenryLouisGates is airing with guests @amyschumer, @azizansari and @mayarudolph on @PBS at 8/7c!  So excited!"]["We’re witnessing the wholesale looting of America - Vox https://t.co/eY28sAuv8r"]["A flawed plan promoted by the President who has adamantly refused to release his taxes to the American ppl.  Read: 7 reasons why Republicans may have made a bad bet on the tax bill - @CNN https://t.co/3js5E28U8N"]["Thank you for purchasing Hacks and for passing on your comments. Also, honor to have been given a chance to discuss my views on 2016 and more on so many TV and radio programs. Over the holidays, I will review your comments and reflect on how to serve in the future. #Peace"]["#BlueWave is coming to a state near you. Get off the sidelines. Time to #ProtectOurDemocracy! https://t.co/hdxk0dT1av"]["#AmenCorner from @SallyQYates. Who are we as a country? Time to decide: Sally Yates https://t.co/3f42y5rLs9 via @USATODAY"]["Capitol Hill Watchdog Refuses to Release Sexual Harassment Data https://t.co/0Uj9ZlxEox via @thedailybeast"]["What We Know About the Trump Campaign’s Collusion With Russia, by @RepAdamSchiff https://t.co/mUmpVztKzL via @WSJOpinion"]["Thanks @RealTimBlack. Tough but fair interview about my latest book Hacks. https://t.co/39RhF1yKFG"]["Prayers for the victims of this tragedy. Let’s also keep those injured in our thoughts and prayers. https://t.co/ElppnIsSOS"]["The Senate’s Russia Investigation Is Now Looking Into Jill Stein, A Former Campaign Staffer Says https://t.co/qBG0hjBEtO via @LoopEmma"]["New Tax Policy Center analysis: \"In 2027, however, taxes would increase for 53 percent of taxpayers compared with current law.\"\n \nFifty. Three. Percent."]["From Mr Trump: “I’m not” considering firing Robert Mueller via @axios https://t.co/l9odhjskk7"]["Great game. #WhoDat https://t.co/FWdzyPme4T"]["@MoveOn: “If you choose to attend an event, you agree to engage in nonviolent, peaceful action, to act lawfully, and to strive to de-escalate any potential confrontations with those who may disagree with our values.”"]["@MoveOn needs your help. Spread the information. https://t.co/Db1sE2S4DH"]["Thank you for your service https://t.co/dBWlgVWZI8"]["A journey through a land of extreme poverty: welcome to America https://t.co/TzasaIfMut"]["It’s time we paid attention and stop being in denial. #ClimateChange is real. https://t.co/oPdlOzADbb"]["How Putin's proxies helped funnel millions into GOP campaigns https://t.co/WnknB4nfC8"]["@JRubinBlogger’s Opinion | The public sides with Mueller https://t.co/K4LGjeUGbe\n\nCan we allow him to complete his job?"]["Who dat? #LouisianaStrong!This video of jubilant students at a small-town Louisiana school inspired millions. Here's why. https://t.co/2yO4tNjKaO"]["There’s no place like home! There’s no place like New Orleans! Who Dat?"]["You are a phenomenal woman. Keep speaking your truth. https://t.co/hxLpFxAkCg"]["Thanks Boo,\nI’m celebrating this day with family and friends down in the Bayou. Who Dat! https://t.co/vVGV8kf8eK"]["Opinion | How Democrats can reward black women right now for their votes in Alabama and Virginia https://t.co/MMFIaV8nTb"]["#BlackWomen voted in record numbers this year. We kept the faith, opened new doors and believed in the power of our vote. 2018 is our year to soar. #RunSistersRun!\nGet ready y’all. https://t.co/g9NkR651l0"]["Painful to watch. https://t.co/JN3zDL0svh"]["Special Counsel Mueller requested Trump campaign data firm to hand over employee emails  https://t.co/KXSk4RSBxZ via @WSJ"]["And protected #BlakeFarenthold https://t.co/yQJxY5VLBV"]["Special Elections So Far Point To A Democratic Wave In 2018 https://t.co/ykOIHLbrVe\n\n#BlueWave2018 \n#IWillVote\n#GetCovered \n#Hope"]["#AmenCorner https://t.co/lGUdEqhRiJ"]["Thank you @donlemon @CNN https://t.co/tBgC6bL7Lw"]["@Lawrence interviewed Lisa McNair tonight. Rejoicing. Thank you @MSNBC"]["Here are the excuses (so far) right-wing media figures are using for Roy Moore’s loss https://t.co/MkSK2Wygvu"]["Thank you @rickhasen https://t.co/rL3TDieXI1"]["Help @TheDemocrats defend @GDouglasJones victory. Please help.Alabama election official skeptical that outstanding ballots will tip Senate seat to Roy Moore https://t.co/uSp6tZ9vVn via @usatoday"]["@wusa9 Thank you @brucejohnson9 for a great interview."]["8 numbers out of Alabama that should terrify Republicans - CNN https://t.co/xcZJz3aM6q"]["Why is this man still in the White House? Let’s get our voting groove ready for 2018.\n\nPolls: Majority of voters believe Trump guilty of sexual misconduct - CBS News https://t.co/Y33yxxehH5"]["Why is this man still in Congress? \n\nExclusive: Ex-Farenthold aide shares new details of vulgar and abusive behavior - CNN https://t.co/TqNB1htxnb"]["The only reason to cross over into Alabama is watch football. Stop the nonsense. Black voters came out in record numbers to send a message to Trump and the GOP: No Moore.... https://t.co/cRSjQqMiZ3"]["As Russia probes progress, one name is missing: Bannon's https://t.co/og5Tr72Ode via @politico"]["#AmenCorner https://t.co/PvftUG1rBb"]["OMG https://t.co/QpZuRCgHw7"]["Black voters just saved America from Roy Moore https://t.co/K4DkTcSRbn via @thinkprogress"]["With Alabama Loss, Trump and GOP Face Political Reckoning - The Wall Street Journal https://t.co/9XAllX3rZe"]["Plans on https://t.co/AcgQhZLxJ2 are more affordable than ever.  Many consumers can find plans with $0 premiums or plans with premiums of $20 a month or less.  Deadline is Friday. #GetCovered  [more affordable than ever graphic]"]["Opinion | Doug Jones wins for Alabama and Democrats, and sends a message to the world https://t.co/E4ZkI3QenX"]["#OMG. https://t.co/aeHorjx7VO"]["Fox News throws Steve Bannon to the wolves over Roy Moore’s defeat https://t.co/fIZ6Mr4TMA...."]["#AmenCorner https://t.co/9S0SvRm7pm"]["@morningmika is speaking truth to power. We will not be silenced. #SupportForSarah"]["Thank you @repjohnlewis!"]["Please support @Sifill_LDF and the mission of the NAACP Legal Defense Fund as they work to protect the vote. https://t.co/n3kEXMPcOE"]["Let’s support these fearless organizations. #ElectionProtection. https://t.co/5n2MLiAuJJ"]["The GOP’s Soul searching should have started long before last night.#AlabamaSpecialElection https://t.co/EGmfrF3HJV"]["Proud to be a Woman who votes! https://t.co/0uG9rrFOxM"]["As you can see from the comments now on @CNN from the #Alabama Secretary of State, we need a 21st century voting rights act that allows every eligible citizen to have their votes counted."]["Yep https://t.co/8R064MaQbD"]["@TheDemocrats funded organizers and helped to organize HBCUs and college campuses and in the faith community. Their work focused on organizing and mobilizing, including volunteer recruitment, community engagement events and GOTV efforts. Help us going forward."]["A victory for the good people of Alabama… in every sense!\n \nDoug Jones is a good man—what the people of Alabama said yes to was more important than what they said no to.\n \nDoug Jones—the longshot heard ‘round the world!"]["Congratulations to @GDouglasJones and all those who helped you @RepTerriSewell @repjohnlewis. And @TheDemocrats who sent resources, staff and donations. Geaux Democrats."]["With great power, voters elected the first Democratic senator from Alabama in decades. @GDouglasJones will need your help, your support to come to Washington, DC to help forge common ground. Please respect the voters of Alabama. Yes, #Alabama."]["@realDonaldTrump should send a message to @GDouglasJones. “ Senator elect, I was wrong. We need to work together for the common good.”"]["Fifty years after the murders of Addie Mae Collins, Cynthia Wesley, Carole Robertson and Carol Denise McNair at the 16th Street Baptist Church it was Doug Jones who made sure that the last of their killers faced justice. Now, Doug is going to Washington, D.C. as a U.S. Senator."]["#AlabamaSenateElection https://t.co/Bwes1bxiaC"]["Weeks ago, I told friends in Alabama to use the power of the vote to change the course of history. #AlabamaVoted. You buried the past. You open doors to the future. Welcome to the future that you will help lead. Bless you. Bless you."]["Alabama elected a man who will serve the ppl and not just the special interest of Donald Trump and his cronies. Thank you Alabama."]["Alabama... #Alabama."]["Who would have thought that we would be spending tonight discussing the returns in #Alabama."]["#DearAlabama.... every vote counts."]["#AlabamaSenate...Too close to call and too important to take our eyes off the prize."]["Alabama Senate Race Between Roy Moore and Doug Jones Ends With More Controversy https://t.co/xo1JJgOmXR"]["#EnrollByDec15 https://t.co/7mTCUJivgX"]["#DearAlabama,\n\nGet out and vote. \n\nLove your neighbors and friends from across the United States and globe."]["We do harm to ourselves, our aunts, daughters, mothers and sisters when we fail to speak our truth. \n\nWhile Democrats call for resignations, conservative women stand by colleagues accused of sexual misconduct https://t.co/73GfAlHq5t"]["Thank you Morra. I recommend listeners also purchase your new book. Bless you. https://t.co/W45EYEr4Xl"]["CNN's @ChrisCuomo calls out White House press secretary Sarah Sanders for routinely lying to the American people https://t.co/IfvjIv7pva"]["@SenGillibrand is a serious lawmaker who deserves to be respected. She is an amazing leader. We will not be silenced. We will be heard. https://t.co/wAJ08zhnlZ"]["Amen https://t.co/1MnfGn3yew"]["Final thoughts. Alabama you can do the right thing.  After all the state has done to bury the past and to move forward — it’s time to go forward. Please vote for @GDouglasJones. Let’s bring back civility, rule of law and the respect for women and girls. Bless you."]["#AlabamaStrong...Yes, I know Alabama. I know people there judge others by their deeds, not by their words. And we all can see the difference here. Vote for @GDouglasJones."]["#Alabama...... The world needs to hear your strong voices saying that the lives of Addie Mae Collins, Cynthia Wesley, Carole Robertson and Carol Denise McNair still matter. Please get out and vote. Thank you. @GDouglasJones needs your help."]["Alabama, I have visited you twice this year.  Tomorrow, \nI urge you not to stay home on Election Day. Come to the polls and come in record numbers. Show the country and the world that you stand up for justice, civility, and the sanctity of little girls."]["Trump asked the black community last year what we had to lose if we chose him over Hillary, acting like as though with him in power we'd get a better deal.  Now we know the cost the country paid, and all that we lost on Election Day last year."]["We have in @GDouglasJones a public servant who lives his values, who puts what he believes into action, and fights hard for what he believes in. And then we have this other man who was once banned from the mall for stalking young women."]["50 years after the murders of Addie Mae Collins, Cynthia Wesley, Carole Robertson &amp; Carol Denise McNair,  it was @GDouglasJones who made sure that the last of their killers faced justice. He knew that there should be no statute of limitation on that horror, and he saw it through."]["Ahhhh... the old playbook has to be updated. No more last minute appeals. If we are not at the table, it means someone else is on the menu. #KeepHopeAlive https://t.co/dFaJHX0AN0"]["The Republican Party is ready to serve as an accomplice to obstruction of justice. https://t.co/Sk1kgYRKsr"]["Thank you @ShorensteinCtr @HarvardIOP students and fellows along with the Kennedy School for a great semester."]["Why Team Trump Needs to Lay Off the Mueller Probe https://t.co/jndWdIZVDw"]["Women who accused Trump of sexual misconduct: 'Let's try round two' - NBC News https://t.co/9skttL5onb"]["Yep, it’s time for President Trump to step down. His accusers should be heard, and believed. https://t.co/sBS0sOPAZZ"]["#AmenCorner to @RepGwenMoore https://t.co/zPgQKB7zNy"]["#Sickening https://t.co/twOBvtkPch"]["#Surprise https://t.co/rQ347vlt5e"]["Jailed Russian hacker says the FSB coordinated his cyber-attacks on Hillary Clinton and the DNC https://t.co/lkKxZNgL9C via @meduzaproject"]["A genius and generous hero. Rest in eternal peace #Simeon Booker, intrepid chronicler of civil rights struggle for Jet and Ebony, dies at 99 https://t.co/5NHNpfMzfD"]["God loves you. Sending you my love. Bless you. Your nose is perfect and you are loved by so many. \n#StandwithKeatonJones. Stop the bullying. Teach tolerance. https://t.co/omJtHPPeF9"]["The country never understood the Russian meddling and political interference. This was a major cyber attack on every American voter - including those who didn’t bother to vote. One political party was hacked and its nominee was attacked daily. Where’s the outrage? https://t.co/wSZMeObx5B"]["Horrible. Three Arrested After Firebomb Attack on Swedish Synagogue https://t.co/GtnV1jOzNe"]["Could Roy Moore cost Alabama the $1.6 billion Toyota-Mazda plant? https://t.co/Aw4HvHraPB"]["In 2015, Louisiana rejected David Vitter and we now have a good man @JohnBelforLA in the state house. #Alabama, it’s your turn. We urge you to vote on Tuesday, December 12th.\n#DoTheRightThing https://t.co/DUtSIOxt4T"]["#AmenCorner https://t.co/XwQIMsAqRD"]["#AmenCorner https://t.co/SCwdKKReN9"]["#AmenCorner: #Respect #CommonGood #Service\n\nLet’s also add #Justice #Fairness https://t.co/YYNDtPppTe"]["Back in the 1980s, folks questioned Jesse Jackson’s attempts to expand the Democratic Party and re brand it after years of litigating civil rights and voting rights. We have to set a table for everyone. But, once you are in, you can’t demand others leave the Party. https://t.co/x043OFGnWX"]["“You wanna fly, you got to give up the shit that weighs you down.”\n― Toni Morrison, Song of Solomon"]["Thank you @RepSwalwell for breaking down the importance of the congressional investigation into #TrumpRussia. https://t.co/bTQHYc7ZYX"]["The #CivilRights of all Americans should not become another partisan football. Those who marched demanded freedom and equal justice under the law."]["#ChooseHope https://t.co/pEW0NJt6gP"]["#FannieLouHamer... https://t.co/L7OILuGKFH"]["#Sick https://t.co/0wSekxGGHz"]["Well.... women of color beware. https://t.co/TYsnHIPsIq"]["NO DEAL: How Secret Talks With Russia to Prevent Election Meddling Collapsed https://t.co/Y9IfldLRTM via @John_Hudson"]["Study: Hillary Clinton’s emails got as much front-page coverage in 6 days as policy did in 69 https://t.co/Tr2K2hL2aD"]["Hey Mr Speaker, why are you standing by this man? Farenthold should step aside.\n\nEthics Committee launches investigation into Farenthold sexual harassment allegations https://t.co/anP1GFDF8e"]["Most Americans want Trump investigated for alleged sexual misconduct, poll finds via @axios https://t.co/EnQX6JhHBh"]["You still care about collusion? Stealing documents and forcing the candidate, the campaign and even the DNC to respond to hacked, stolen emails. The Trump campaign was too busy pointing fingers and hiding behind Russian propaganda.  https://t.co/K4klYQ0fMI"]["#WhiteWomen must help lead the way forward. Moore has not repented and apologized to women he abused. Why reward a man once banned from your local Mall? https://t.co/VPkz9N1ebb"]["Do we really want someone who was banned from the mall because he preyed on young women in the U.S. Senate? What’s so conservative about that? https://t.co/1TaZDjnrXx"]["The G.O.P. Is Rotting https://t.co/7bcMeclDhf\nRotting to the core"]["@sswestfall Thanks. Chip was so special."]["Russian social media executive sought to help Trump campaign in 2016, emails show https://t.co/3JEAWGhxkh"]["Stark Partisan Divisions Over Russia Probe, Including Its Importance to the Nation https://t.co/cUOw6V4kob"]["Good night.... Stark Partisan Divisions Over Russia Probe, Including Its Importance to the Nation https://t.co/cUOw6VlVfJ"]["In loving memory of my Pom Diddy Chippy Chip Gumdrop Booty wipes Marvin. He bought joy to our lives... This is the first bDay/holiday season without his woof woof manners in years.\n\nBoots, I miss your fun loving playfulness. Still celebrating Chip’s Birthday ( and Sis Chloe 2). https://t.co/NX0uo7YDxu"]["Republicans need to address urgent priorities:\n-Keep government open\n-Immediately reauthorize the Children’ Health Insurance Program\n -Funding Community Health Centers\n-Emergency disaster funding for hurricane- &amp; wildfire-impacted communities\n-Passing the #DREAMAct \nPass it on."]["Democrats are doing the right thing in showing support for the victims of sexual mis conduct, harassment or assault. Meanwhile the Republican National Committee is helping to elect an alleged child sex predator in Alabama. Please help support @TheDemocrats. We have work to do."]["#SenatorAlFranken’s entire speech should be a must read, must listen for all Americans. https://t.co/uDq1W4ADGy"]["#SenatorAlFranken: “all women deserve to be heard.”"]["GOP faces a reckoning on their sexual harassment stance https://t.co/VUUD63Pyin via @msnbc"]["This is totally wrong. https://t.co/HgfuD2ENSX"]["Interesting move. https://t.co/obMi290KEz"]["What’s happening?  https://t.co/EDQV1vKFpC"]["Be safe. Praying the wind calms down and firefighters can gain control. https://t.co/uISFX9re28"]["Thank you @JoeBiden https://t.co/EnH9f2Go4D"]["Thank you for this thread. https://t.co/KSVuxKfbgh"]["@CasMudde You should spend more time reading than smearing. Where were you last year during the hacking of our democracy? Go find your joy canvassing for Democrats, raising money and working for justice.\nMy story had to be told. 👌🏾"]["Doug Jones attacks: Moore belongs in prison, not the U.S. Senate https://t.co/muKznp3axS"]["@NomikiKonst @WorldTaiChiDay @TYTInterviews @TYTPolitics Our focus must be to educate, advocate and begin to agitate for the kind of change we want to see in the world. This is no longer an issue of top down, but bottom up grassroots folks raising hell and stirring the pots. Party politics is about electing our leaders. More.."]["Thank you @ShorensteinCtr. https://t.co/XtHFRdJVSU"]["Flynn Said Russian Sanctions Would be ‘Ripped Up,’ Whistle-Blower Says https://t.co/M0N6LqqM4c"]["You did extremely well. Enjoyed the interview. Best of luck! https://t.co/iVHipN5O1G"]["I like https://t.co/02VlTPMwLR"]["@thehill: the late Chip Joshua Marvin Brazile was full of canine class. #PetLover #AnimalLover forever. https://t.co/BNMEaaZvYk"]["@thehill Pets are wonderful. https://t.co/lD5a23xs33"]["Thank you @Beyonce for honoring @Kaepernick7! https://t.co/VojRB1Ff3G"]["#Woof him https://t.co/eStfiKSI4u"]["Speak your truth! Thank you for your service. https://t.co/7TeUmjZzY1"]["Russia probe tests Pence in-the-dark defense - CNN https://t.co/cqI1ft5KeV"]["What is the standard we are going to use to determine who should step down? Should tax payers demand what is being big done? https://t.co/NbyGLgb6Gx"]["The @TheDemocrats are working hard to elect good candidates like Doug Jones. Please support them with a financial donation and commit to help in 2018. Thank you!"]["GOP senators grumble over Trump, RNC backing Moore - POLITICO https://t.co/IF5RXWdR2Z"]["GOTV https://t.co/Enx2KEAbdQ"]["Former Sect of Labor https://t.co/FyQ3873sHy"]["Every attempt to distract from getting to the bottom of the Russian meddling only leads to more spotlight on what the Trump campaign did to help them sow discord and discredit Hillary Clinton. https://t.co/VcXdRYYNMY"]["Another day, another explosive story. #SexualHarassment is wrong. https://t.co/BMun1hFC6r"]["Russian told Senate Trump Jr. wanted info on Clinton Foundation money https://t.co/7rBzk0bis8 via @nbcnews"]["From old-school flirts to after-hours lechers, these are the types of sexual predators women encounter on Capitol Hill, writes @mcottle https://t.co/QAaUQ4lYdm"]["Take off the gloves. https://t.co/XdHLG7DLB9"]["#AmenCorner https://t.co/KksdpG1JsY"]["Hot damn! https://t.co/kddBa7mXXH"]["Yes, this is what Democrats do. We don’t hide behind the curtains. We open the windows. https://t.co/0Slbmx6vdA"]["Representative John Conyers has resigned his seat in Congress."]["Mueller subpoenaed Deutsche Bank records on Trump several weeks ago, source says https://t.co/OlKsgTmg2Q via @bpolitics"]["#AmenCorner https://t.co/OHOdNJFN30"]["What is the definition of shame? https://t.co/vxLX86RnuN"]["The #GOPTaxScam is great if you:\n-are excited to raise taxes on middle class families\n-want to ransack Medicare &amp; Medicaid\n-love to reward companies that send jobs overseas with massive tax breaks\nKnow the facts. It’s bad for the economy and your wallet."]["Wait, so if you live in a blue state, the #GOPTaxScam will hurt even more?  https://t.co/FyXmkSwRAb"]["Walked out with my children in tow. https://t.co/l2drG1LBGv"]["Good. Taxpayers should not be held responsible for this non sense. https://t.co/GaiJuDsMIO"]["@KateBrown16 I visited Alabama last week. Uphill battle, but Doug Jones is running hard on kitchen table issues."]["The Odds of Impeachment Are Dropping - The Atlantic https://t.co/QbXeyWmoTH"]["What’s on my menu? Will catch up on my favorite football teams later. I am looking forward to conversation with New Yorkers @92Y with @greenfield64. https://t.co/FmdprWiRT6"]["My guess is North Korea has gotten plenty of help from both China and Russia. https://t.co/lwoh8f0353"]["Every taxpayer must ask their member of Congress two questions: how will Donald Trump’s tax plan impact my life? Will the Trump’s tax plan pay for itself? Trump has refused to release his tax returns, but has no problem forcing you to bail out wealthy taxpayers. #SAD"]["Now would be a good time for the Trump Administration to wake up and acknowledge the Russian meddling in the 2016 election. Will they help defend American democracy from future cyber attacks? Hybrid warfare is still war. #ProtectOurDemocracy"]["Jared Kushner failed to disclose he led a foundation funding illegal Israeli settlements before U.N. vote https://t.co/eW9rcAjDcW"]["Thanks Jeff. I’m going to discuss the hacking of our election and why Congress must complete its investigation into Russian meddling and interference. https://t.co/jcKaWlRTeA"]["They are simply mean spirited. https://t.co/hhWQnmJglz"]["#ProtectOurDemocracy https://t.co/1Fd0lAO3ur"]["In response to the morning tweets of President Trump: \n\n“Nothing in all the world is more dangerous than sincere ignorance and conscientious stupidity.\" - Dr. Martin Luther King, Jr."]["Victims of harassment, assault triggered by recent events   https://t.co/VZJbIzmDYe"]["Shameful. https://t.co/0ymPnmRlvi"]["Flashback from the @nytimes: The Perfect Weapon: How Russian Cyberpower Invaded the U.S. https://t.co/G9MV6yNQ7x."]["........”The sanctions could also make it much harder for Mr. Trump to ease tensions with Russia, “which has just thrown the U.S.A. election to him,” she wrote. Her emails ..”Dispute White House Claims That Flynn Acted Independently on Russia https://t.co/M4w4t6nzUs"]["Sorry @AuburnTigers, it’s time to celebrate @Bulldogs. Congrats on winning #SECChampionship!"]["#SilentNoMore #MeToo https://t.co/Fxf5dEeeWG"]["Trump keeps playing nice with Mueller, for now https://t.co/Owiwq3lq9W via @politico"]["#Karma"]["#WAKEUP https://t.co/0A1gcGRmAT"]["This is irresponsible. President Trump has refused to release his tax returns, but is pushing Republicans in Congress to increase our taxes and the federal deficit. #WakeUp"]["@MalcolmNance @allinwithchris @matthewamiller @MaddowBlog @CNN @MSNBC @JoyAnnReid @Isikoff @SRuhle"]["@92Y .... this coming Sunday."]["#GOPTaxScam is being rushed through because it can’t stand up to public scrutiny. https://t.co/y6jAF6tKnj"]["The Latest: AP sources link KT McFarland to Flynn papers   https://t.co/3YWklv9p5F"]["Gowdy, Benghazi panel settled wrongful firing suit with $150,000 in public funds https://t.co/rwqxRGL1rK"]["#WorldAIDSDay. Read this Opinion | Trump wants to gut America’s progress against AIDS https://t.co/bAOyjOTFZX"]["Lawmaker behind secret $84K sexual harassment settlement unmasked https://t.co/i8tzecr9x9"]["#Speechless. https://t.co/JTVi7a06FA"]["The case for normalizing impeachment https://t.co/EVwzyDTibw"]["We must fight for every vote. #DougJones https://t.co/OS0K0jrJMx"]["#BelieveDat. They must rise above partisanship and #ProtectOurDemocracy https://t.co/2CNdCNYFJE"]["@MaddowBlog is telling it like it is. @MSNBC"]["@ItsTheBrandi 🙏🏿"]["This is how we roll! I’m glad Hillary can speak her truth. https://t.co/9hTSdeg2jZ"]["#Obstructionist https://t.co/Iwa2POAzcf"]["Oh hell no! Congress, we are watching you. Please go forward with investigation until every question about Russian meddling has been answered. What is the President afraid of? Tell him that you work for the American taxpayers. https://t.co/GFTi7T4nII"]["Hope everyone is okay. https://t.co/BG3EkGolJV"]["#GOPTaxBill is a rip off. It should be called the Trump Relief Act. Call the U.S. Congress and oppose this tax give away to the top 1 percent and more. https://t.co/7RxFY54UWY"]["@GrahamDavidA @sharkgirl73 @TheAtlantic You are a citizen. In my humble opinion, that is the best title in a democracy."]["@GrahamDavidA @sharkgirl73 @TheAtlantic We must continue to raise our voices, resist and register more Americans to vote next year."]["#Rigged — on no, not again. Read @EKamarck take on this controversial topic. https://t.co/oGDJ5XR83H"]["Trump's public displays of bigotry, hypocrisy, and detachment from reality are not an act, writes @GrahamDavidA: https://t.co/0OTQhInjln"]["The #GOPTaxReformScam will hurt you and your family. Please take action now. \n\nIt Started as a Tax Cut. Now It Could Change American Life. https://t.co/64xDoVwWuh"]["How is this good for average taxpayers? Republican Senate tax plan hits lower incomes the hardest, increases deficit $1.4 trillion: Congressional Budget Office - ABC News - https://t.co/mDqsJmtTay via @ABC"]["Russian trolls pushed graphic, racist tweets to American voters - NBC News https://t.co/bzLWqhPP0e"]["Wow.....The Trump allegations – a list https://t.co/JdZTlc1Wzh"]["Trump’s Russian Schizophrenia https://t.co/BHiaDpd4yc via @politicomag"]["Think. This... https://t.co/NHUYEqQyN6"]["Consider yourself lucky. https://t.co/bh5XZatNIf"]["Welcome to Twitter. https://t.co/UZCKm3yCkK"]["@eJoelWatts Agree"]["#AmenCorner https://t.co/mxkoe3da59"]["Instead of prioritizing American workers, the #GOPTaxScam gives companies a tax break for outsourcing jobs while penalizing Americans caring for children with disabilities or parents with Alzheimer’s."]["The #GOPTaxScam will slash taxes for the wealthiest Americans and big corporations. Who foots the bill? Middle class families, small businesses, and future generations.\n \nDemocrats want tax reform that puts the middle class first and spurs economic growth."]["Bye https://t.co/1HheAgXWzk"]["#TrickleDown economics that will widen income inequality and hurt the middle class. Just say no. https://t.co/qH6cChxHF0"]["#GivingTuesday https://t.co/slbEGOiP8A"]["#WakeUpAmerica. https://t.co/wYumtKUctp"]["Exclusive: Accuser to Roy Moore, 'Where does your immorality end?' https://t.co/E9hIlCeKNj"]["@BrennanCenter #GivingTuesday\n“Fight for solutions that will strengthen our election infrastructure and protect us from threats like Russia’s attack on our elections.\nDefend the right to vote and shut down the Trump administration’s sham “voter fraud” commission.”"]["I’m excited to share what @HenryLouisGates taught me about my ancestry again tonight. Watch #FindingYourRoots on your local @PBS station at 8|7c!"]["Here we geaux #Tigers! @AuburnTigers meet @lsu Tiger! https://t.co/2kaSmhIL5v"]["In plain sight. Yet, it still maybe happening now. Read and decide. https://t.co/uaiurs9rVA"]["Looking forward to seeing old friends and meeting new ppl. https://t.co/JYcJvKXETx"]["Tonight, my episode of #FindingYourRoots will be replaying on @PBS. It was fascinating to discover my ancestry with @HenryLouisGates – tune in at 8|7c on your local station!"]["Another great organization. #GivingTuesday @NAACP_LDF https://t.co/AsNUcxReVf"]["@neeratanden “Let’s use this #GivingTuesday to help take back our country, and build toward the America that we all believe in.” @CAPAction"]["Opinion | Odds Are, Russia Owns Trump https://t.co/O5O7HOoPnY."]["For those who might be interested in my roots — all the way back to the 17th century here in America, tune in tonight. @PBS #FindingYourRoots https://t.co/ie1d2ZEt6B"]["#KitchenTableIssues #GivingTuesday2017 https://t.co/lU710Tdo7h"]["The sinister screw-ups of James O’Keefe https://t.co/UocX5u16CP #ProjectVeritas"]["#AmenCorner https://t.co/TJEjfsx0rN"]["#ProjectVeritas is bad for democracy. https://t.co/h0AE1DQ5OT"]["#ProjectVeritas is bad for democracy. Think about it. https://t.co/G0F58K1g6Q"]["Mr President, someone needs to inform you that this is insensitive and wrong: \"You were here long before any of us were here. Although we have a representative in Congress who they say was here a long time ago. They call her Pocahontas.\""]["Introducing the current Brazile scholars. Paying it forward. Congratulations! More to come. #LouisianaStrong. Stay positive. https://t.co/FVkzquKLs4"]["A key witness in the Russia probe had 'a lengthy conversation' with Trump at Mar a Lago https://t.co/MELkGxb1Sd via @PoliticsInsider"]["A key witness in the Russia probe had 'a lengthy conversation' with Trump at Mar a Lago https://t.co/MELkGxb1Sd via @PoliticsInsider"]["CBO: Senate GOP Tax Bill Favors High Earners Over Low Income Taxpayers https://t.co/uAmeWkNze5 via @TPMj"]["#Hacks https://t.co/wAxJy8bq9r"]["No eligible American citizen should be denied the right to vote. The right to vote remains the lifeblood of our democracy. https://t.co/8bPjZjc7fT"]["Catch me on the following podcasts: @davidaxelrod @Bakari_Sellers @SusanPage @CapehartJ"]["What are we waiting for? The time to hack-proof the 2018 election is expiring — and Congress is way behind https://t.co/PuPnlZR92w via @politico"]["Ready to run for office? Why you? Because there is no one better. Let’s figure out how to register more voters, motivate some new voices to run and get out the vote. It starts with having more voices in the arena. https://t.co/MYldZWdimZ"]["This is a good combination of the facts. Alabama, you deserve better. https://t.co/5UCXzIhdJc"]["Trump is quietly making it even harder to report sexual harassment and discrimination https://t.co/0XW0mMV3Lo # via @HuffPostPol"]["#HardTruth https://t.co/tfclsaGeOW"]["FBI didn't tell US targets as Russian hackers hunted emails   https://t.co/848Lb6T1TZ"]["Thank you @cwclub. Enjoyed visit to #SanFrancisco. https://t.co/Yk9G6Ecoic"]["#AmenCorner https://t.co/NE8phpAeiI"]["#AmenCorner https://t.co/w2NRh48Pvx"]["#TrumpRussia https://t.co/TUoXvVDVC1"]["@SenWarren goes off on Trump over CFPB defense https://t.co/aqPo4F8F4n"]["From one Tiger to another, Congratulations Auburn! https://t.co/5TSq3Rw4hl"]["“While everything around you is changing, you are also changing. Trust your new self to adapt in all things you do.” @AngelouQuotes"]["What’s next? @Twitter suspends 45 Russian propaganda accounts that shared messages on Trump, Merkel and Brexit https://t.co/9ZSAcnMVkV via @IBTimesUK"]["“Kelly Has Clipped his Wings”: Jared Kushner’s Horizons Are Collapsing within the West Wing https://t.co/wkHEvb176k"]["Maya Angelou: “There is no greater agony than bearing an untold story inside you.” Many thanks for reading Hacks. \n#BlackFriday https://t.co/6QBtQDvcQt"]["#BlackFriday2017 https://t.co/dHgjt0ppZ9"]["@DearAuntCrabby @thehill @TomPerez @keithellison @dccc @TheDemCoalition #Alabama  @GDouglasJones for US Senate, #Atlanta @KeishaBottoms for Mayor"]["Thoughts and prayers https://t.co/AjTZKCiKzD"]["Exclusive: Manafort flight records show deeper Kremlin ties than previously known https://t.co/8TVJrGjFXc"]["Please pray for the Carville family down in Louisiana. James’ sister Bonnie passed away this morning. Rest in eternal peace."]["Congressional Russia probes likely to head into 2018 - ABC News -  via @ABC https://t.co/qkG6AKiNmx"]["Through acts of goodness and kindness https://t.co/GcxJlMEKjf"]["Our meal is done. Family and friends are all gathered. It’s my time pray a word of gratitude. We have been through a storm. Many of u could have blocked, throw shade or simply un follow. Yet, here we are —together on #Thanksgiving day. #peace. https://t.co/sP9XtjK9xv"]["A Russian Journalist Explains How the Kremlin Instructed Him to Cover the 2016 Election https://t.co/53iDZsPb7F"]["@terridonovan12 Respect yourself and rest will follow. Read the book"]["What about the greens and potatoes? #HappyThanksgiving to our men and women in uniform. We thank you for your service, https://t.co/6iN9d0rC1m"]["Week 26: Donald Jr. and WikiLeaks Talk Dirty https://t.co/FkH0M002xF via @politicomag"]["@terridonovan12  HappyThanksgiving to all.\nPlease find some joy to share with others."]["🙏🏿 https://t.co/bHYoUcRJk4"]["Bless you Jose. #HappyThanksgiving2017 https://t.co/lEwZt9bldU"]["“Abuser”: Doug Jones’s brutal new ad against Roy Moore https://t.co/CYLYUm6mr2"]["“Abuser”: Doug Jones’s brutal new ad against Roy Moore https://t.co/CYLYUm6mr2"]["Oh Lawd. https://t.co/csvVPcX5Lt"]["Sexual harassment is a persistent and pervasive problem across our society. It’s nonpartisan!"]["Journalist Investigating Trump And Russia Says 'Full Picture Is One Of Collusion' https://t.co/MzYSatZBFG"]["Facebook Plans to Let Users Know if They Followed Russian Pages  https://t.co/3K5QY61YAG via @WSJ"]["Mueller probes Kushner’s contacts with foreign leaders and possible role in Comey’s firing https://t.co/fS0EYEI4kf via @WSJ"]["@AlBernstein: Please go find your joy, tell your own truth and help us #ProtectOurDemocracy. Peace out. https://t.co/QZGitHV3xI"]["Book signing at Politics and Prose in Washington DC https://t.co/IfE4YS2k2k"]["Russia probe: Trump's tweets could be evidence against him, legal experts say https://t.co/RqWD9gMPYU via @usatoday"]["Wow..... This is serious. We need to know more.\n\nUber Concealed Cyberattack That Exposed 57 Million People’s Data - Bloomberg https://t.co/oHBzt2ZNbP"]["Opinion | ‘Hardball’ anchor Chris Matthews on what today’s politicians can learn from Bobby Kennedy https://t.co/Las8z4UeAQ"]["Wake up America! There’s a little-known fund that goes to victims of sexual harassment on the Hill. You pay for it. - Vox. https://t.co/A88zKUugQD"]["Don’t forget the roux! Happy Thanksgiving https://t.co/y3shXBEwt7"]["Thank you for your service. https://t.co/bhkr30C63J"]["#BanMoore https://t.co/TrAErIDHik"]["Donna Brazile says Russians destroyed ‘critical’ DNC data https://t.co/GVhGBGwZcY"]["Join the conversation. https://t.co/GG1CHIjdUg"]["I am waiting for the day when this headline make the news: DNC Hack results in criminal charges against those who colluded with Russia to meddle in the 2016 election. Can’t wait. https://t.co/n8zZCoJ3oX"]["Donna Brazile in Atlanta: ‘Don’t Step on Me When I Tell You My Story’ https://t.co/MK6JNsUpig via @TheRoot"]["TONIGHT #FindingYourRoots with @HenryLouisGates featuring @TeaLeoni and #GabyHoffmann is happening on @PBS at 8/7c!  Get excited!"]["What’s on your menu? About to discuss my latest book “Hacks” on @MadisonSiriusXM. Joe, “the Black eagle” is one of the best political mentors of all time."]["Young Turks and reporter abruptly part ways following sexual assault allegations https://t.co/Tj9JBjHupo by @aidachavez"]["This says it all. Wait until another hostile nation launches a cyber attack. Don’t wait, agitate for change from the top down. https://t.co/tpnuaVk7Ku"]["Heaven has another angel. Rest in eternal glory #DellaReese https://t.co/JOA5DHl5cg"]["One of the finest angels. Love to #DellaReese https://t.co/UBfAddvHbN"]["Sources: McMaster Mocked Trump’s Intelligence At A Private Dinner https://t.co/23pN8hnLuP via @bernstein."]["We talk about the hacking of the election, the expansion the number of Democratic and much more including Rev Jesse Jackson’s historic campaigns. https://t.co/s9UnXadr9O"]["Opinion | Stop the sniping, Washington Democrats. Learn from the grass roots. https://t.co/mcVI0fpR3p"]["Why evangelicals are again backing a Republican despite allegations of sexual misconduct https://t.co/lTjZXpKhqw via @BostonGlobe."]["What’s the plan? #EqualPay benefits both men and women. https://t.co/hGCU0XxWS3"]["What’s on your menu? @TJMShow @tvOneNews @rolandsmartin live at 7:15 amET. Roland will bring the funk and I plan to bring some tabasco. #StirringThePots https://t.co/s12BMKC12z"]["John DeShazier's analysis of Saints wild 34-31 OT victory https://t.co/chwJOh484e via @Saints"]["#WhoDatNation https://t.co/lTJj1IF2gA"]["Special Counsel sends wide-ranging request for documents to Justice Department - ABC News -  via @ABC https://t.co/bKoUnXyfFo."]["Who Dat https://t.co/qsJbl7umSC"]["Last year, very few ppl believed the story. @JoyAnnReid along with others did. https://t.co/t1np4QJwmf"]["Thank you #Atlanta for your southern hospitality. Great conversation about my new book “Hacks” with Mo Ivory. Special thank to the #ZucotGallery for hosting this special event."]["What else do you need to know? The country was attacked by cyber warfare last year. Now read: Russian trolls boosted voter fraud fears months before election https://t.co/FkzfqtcDhw via @nbcnews"]["“Russia if you’re listening....” The G.O.P.’s “Boil the Frog” Strategy to Save Trump https://t.co/7o1OxbEMtH"]["“My wish for you is that you continue. Continue to be who and how you are, to astonish a mean world with your acts of kindness. Continue to allow humor to lighten the burden of your tender heart.” Maya Angelou"]["Special thanks to @lsu and the Louisiana Leadership Institute for hosting my book party in Baton Rouge. #GeauxTigers."]["As Maya Angelou once wrote: And Still I Rise! https://t.co/bVmhdxwHs3"]["Thank you my beloved #New Orleans. Over the weekend, we made history and what a celebration on the eve of our tricentennial. Congratulations to Mayor-elect Cantrell. Now,  #WhoDatNation must lead us. @Saints"]["If you live outside Alabama, there’re multiple ways to help Mr Jones:\n1. Donate a few dollars\n2 Volunteer to make calls or canvass\n3  Urge your friends and family to vote in Alabama\n4  Be positive\n12/12/2017 is Election Day https://t.co/wwDCRyVG5v"]["Female former staffers of Al Franken come to his defense https://t.co/oimkQhCTSI"]["Thanks Claude. My lifetime as an activists, a grassroots organizer and much more allows me to get up every day to choose hope, choose action. https://t.co/Q2G4XDv8eJ"]["#AmenCorner https://t.co/Wcqk2M0uvB"]["@DomMitchell Go find your joy! It’s time to ban bots, trolls, and haters."]["#TellYourStory https://t.co/EfGHTYmgX9"]["Be careful what you wish for! https://t.co/cIBZsMzX22"]["#NewOrleans make history. Congratulations to Mayor-elect #LatoyaCantrell."]["#Sickness https://t.co/t4xBk7wNyY"]["It’s #ElectionDay here in the State of Louisiana. Tonight, New Orleans will join Baton Rouge and Shreveport in having a female chief exeuctive. #WhoDatNation! https://t.co/JMOtDYBlOI"]["Russian ambassador says he won't name all the Trump officials he's met with: 'The list is so long\" https://t.co/esv35vBjTm"]["Remember what the great American writer and poet taught us: “There is no greater agony than bearing an untold story inside you.” @AngelouQuotes \n\nTell you story\nSpeak your truth\nDare to make a difference\n#MeToo"]["What baseline do we set now? Because this issue is not going away.  Our voices will not be silent. Our story will be told. https://t.co/cOUnXuWmg4"]["#AmenCorner: Hillary Clinton on Trump's election — \"There are lots of questions about its legitimacy\" https://t.co/fliHHXAeWl via @MotherJones"]["When Has Trump Been Accused of Rape or Attempted Rape? Allegations Include a Child, His Wife and a Business Associate https://t.co/0upYGlbh8w"]["Tomorrow, we will make history in my beloved hometown of New Orleans, Louisiana. https://t.co/FjRJxoGzrD"]["The Ex-Spy Behind the Trump-Russia Dossier Left a Clue for Mueller https://t.co/SWTAtQqrhc"]["Who Dat? Great evening with @TeamKCP to discuss this weekends mayoral election in New Orleans.  Together we rise!"]["Low down and dirty....... Jared Kushner got emails about WikiLeaks, Russia in 2016, lawmakers say https://t.co/ywljxWrAtw"]["#Bucketlist...opening act for this amazing woman. #DivaDish https://t.co/lDgcsrZWHq"]["#AmenCorner https://t.co/DR7SblobdY"]["#IBelieveTheWomen \nTwo more women describe unwanted overtures by Roy Moore at Alabama mall https://t.co/Hdc9I4msC5"]["Get in line https://t.co/W5mWh3oNDd"]["Thank you @MiamiBookFair @ananavarro @cspan for a delightful evening. Next: #WhoDat?"]["Prayers for this officer. https://t.co/dGoGS1ctwM"]["Sorry I missed this important lecture sponsored by the @ShorensteinCtr https://t.co/9AAjYoFty9"]["Lawd have mercy....#IBelieveTheWomen! https://t.co/olVBg5OKvq"]["Roy Moore was banned from the mall and its time to ban him from entering the U.S. Senate. Vote @GDouglasJones! https://t.co/oZAsZ5oEUy"]["Thanks @DLHughleyRadio. https://t.co/AZTIl9oAQ0"]["Christopher Steele believes his dossier on Trump-Russia is 70-90% accurate https://t.co/miv8CSIJ7P"]["Show me the money ... and Together we will find the collusion. Secret Finding: 60 Russian Payments ''To Finance Election Campaign Of 2016” https://t.co/KsT431buHQ"]["“[Brazile] does have a story to tell that the Democrats shouldn’t dismiss, if they intend to win the White House in 2020…. The book is a fun read… The conjunction of Brazile’s indiscreet book. A dose of [Brazile’s] Dolores might even help.”\n—Amy Davidson Sorkin, @NewYorker"]["Why the Democrats Should Listen to Donna Brazile https://t.co/a7b3z5A2tH"]["Same man, different story. Sessions again changes his account of what he knew about Trump campaign’s dealings with Russians https://t.co/a1nSn69DDI"]["@DiscoPotential: please go find your joy. Long before i wrote my book, my weekly columns stirred things up. Thus, you can simply repeat after me: joy cometh in the morning. #AmenCorner"]["Thanks. #GoRead https://t.co/OHarCPlH8q"]["Ahhh... https://t.co/xD9uXK2GCC"]["Just say no to #RoyMoore https://t.co/aAcRWNNL4Z"]["Wait, you mean Dems won in a red state? #Bluewave https://t.co/EiaEP87pPx"]["#AmenCorner: Thank you. Thank you. The top 10 audiobooks on https://t.co/T5bEJ8BqyL https://t.co/arL07ChQ2v."]["Fox News' Shepard Smith debunks Uranium One lie peddled by his own network https://t.co/jlGwhl24pD"]["We can’t simply pray for the victims and those murdered without doing something to help prevent the next one from happening. https://t.co/kBPViG0J49"]["Thank you @CapehartJ for a great discussion and interview regarding “Hacks.” | ‘The condescension was amazing’: Donna Brazile unloads https://t.co/YK1nSFbz7I"]["How much sway does Fox News have over the Justice Department? https://t.co/goA62YafLW @MattGertz"]["Secret Finding: 60 Russian Payments \"To Finance Election Campaign Of 2016” https://t.co/0QsJjlb26m via @jasonleopold"]["Check out @Lupita_Nyongo, @ananavarro and @carmeloanthony TONIGHT on #FindingYourRoots with @HenryLouisGates on @PBS at 8/7c!  Can’t wait to see my friend Ana."]["https://t.co/K9MkmUIZkP"]["Team Trump promoted the hacked, stolen emails and more like it came straight from the gospel. https://t.co/K1BgQFSIxD"]["Outrageous. The country was under attack and the Trump team did nothing but help the enemy. Shameful and sad. https://t.co/45YWVF3fSf"]["Eric Trump should testify about Russia, a House Intelligence Committee member says https://t.co/YwBa8U093S"]["The @HouseGOP Shell Game:\n$1.5 trillion tax cut to corporate America\n$1.5 trillion cut to Medicare &amp; Medicaid\n#GOPTaxScam"]["So, #Wikileaks is upset that the emails are  \nbeing made public......really?"]["Please help Doug Jones and the Alabama Democratic Party. https://t.co/qrIG5P6WNn"]["Donald Trump Jr's WikiLeaks communication was flagged to Kushner, Bannon https://t.co/U4b4wfCzOw"]["The Secret Correspondence Between Donald Trump Jr. and WikiLeaks - The Atlantic https://t.co/YsaXTeKzV7"]["George Papadopoulos contacts Stephen Miller after Clinton 'dirt' promise https://t.co/595YVdlKNI"]["@AmandaJuneBell: Timing is everything. Everything is in divine order."]["What Mueller's org chart reveals about his Russia probe https://t.co/EEfXr9pgib via @politico"]["Congrats  to Lt. Governor elect Justin Fairfax of Virginia — former colleague in the Gore campaign. @vademocrats @TheDemocrats #BlueWave https://t.co/SPc1CWx8ns"]["This is why they blocked many of Obama’s judicial nominees— to install their own conservative firebrands. https://t.co/OAhQn7z9FP"]["What about “I will defend the integrity of the Americsn electoral system against foreign aggression by Russia or any or nation.” #ProtectOurDemocracy @cspan in the next hour. https://t.co/goU3QvmGTt"]["#AmenCorner https://t.co/eRME5V5Ral"]["Thankful for #LaDavidJohnson’s service &amp; sacrifice. U.S. soldier in Niger ambush was bound and apparently executed, villagers say https://t.co/kVoxGGKKrg. #HappyVeteransDay."]["@AngeloRayGomez In a few years, we will celebrate the 100th anniversary of suffrage for women. We no longer need permission to run for office, vote for women or tell our story. We are empowered to write, speak, run and win. Victory!"]["Speak @tanehisicoates: He has an incredibly clear explanation for why white people shouldn’t use the n-word https://t.co/qz5nuYqsg6"]["The press should ask the White House to explain the President’s comments. https://t.co/MkDvkd9hZJ"]["Women racked up victories across the country Tuesday. It may be only the beginning. https://t.co/KsIGLfzwyL"]["Where is the outrage? In 2016, the US was attacked by Russia to discredit one political party (Democrats) and destroy one presidential candidate (Clinton). Where’s the patriots now? https://t.co/Yn9VkNOQc1"]["#HappyVeteransDay https://t.co/P5znpJXQL6"]["Tracking the Russia investigations https://t.co/GDo18EhQVv"]["When it comes to geopolitics and national security, Putin will look out for #Russia. #ProtectOurDemocracy https://t.co/Vz5SQqciX9"]["Aide who pleaded guilty to lying about Russia helped write major pro-Russia Trump speech https://t.co/ZpLOZeXDjN via @shareblue"]["Trump absolves Putin and shoots himself in the foot - CNN https://t.co/mPiEJ7njVD"]["The One County In America That Voted In A Landslide For Both Trump And Obama https://t.co/rA0BNNypPr"]["WTF: Trump sides with Putin over intelligence agencies on Russian meddling via @axios https://t.co/VD5za2HFD5"]["Speak https://t.co/J1ElquBs9e"]["Sow discord and chaos. Deliberately went at @TheDemocrats and our own democracy. #staywoke https://t.co/XPuGMcg26A"]["Good news: @JoeBiden and @greta have new books out this weekend. More to come."]["Read this excellent Perspective | Could Russian trolls have helped elect Donald Trump? https://t.co/8TD54JnyrP"]["Rep Nunes attended a breakfast with Flynn, Turkish foreign minister just before the inauguration https://t.co/HKe3FZPuOl via @PoliticsInsider"]["Bombshell Roy Moore Report Could Reshape DC's Political Landscape - NBC News https://t.co/yniXKG51kY"]["One of the busiest websites in the U.S. in 2016 regularly linked to Russia propaganda https://t.co/jMCjaIXuGn"]