["I would like to welcome Alabama native &amp; former Asst. Secretary for Governmental Affairs at @USDOT Dana Gresham, who will be joining our team as Chief of Staff. https://t.co/Fo8lNQGupP"]["Recy Taylor's courage to fight for justice in the face of oppression &amp; violence helped pave the way for the Civil Rights Movement. We must honor her legacy by working to make AL &amp; the U.S. a place where everyone is treated w/ dignity &amp; provided an equal opportunity to succeed. https://t.co/D8wPw7Es4f"]["Today marks a new day for Alabama and our nation. https://t.co/iPgt4D1jPw"]["Merry Christmas and Happy New Year from our family to yours! https://t.co/taGIyE8Hh4"]["\"Politicians talk enough... I want to listen and understand.\"\nhttps://t.co/5ofy9m1hCe"]["\"People were looking at someone to be true to who they are... we were also able to pivot back to the kitchen table issues like jobs, education &amp; healthcare.\" - Doug on why people responded to his message. https://t.co/l0Ax1eezPT"]["Today we announced the launch of our new transition webpage. It contains portals to submit scheduling/press requests &amp; for interested applicants to submit their resumes to join our staff. Check it out here: https://t.co/1AbBu0Dj5c"]["Louise &amp; I were thrilled to join @LateNightSeth tonight to talk about my goal to find common ground in the Senate to make our nation stronger. https://t.co/HlbxB335At"]["“This is a big economic win for the people of Montgomery &amp; shows what can be accomplished when officials work together for what is best for the people of Alabama\" said Senator-elect Doug Jones https://t.co/vAbn3WZZ1E"]["It is absolutely unacceptable that Congress has allowed partisan fighting to delay renewing funding for the Children's Health Insurance Program. https://t.co/LrH22IXGje"]["\"I'm going to consider anything,\" said Jones, explaining that he doesn't plan on labeling himself a progressive or a conservative Democrat but a \"Doug Jones Democrat.\" https://t.co/EsbYExtA7g"]["\"It doesn't matter what the issue is. There's always opportunity to find common ground.\" https://t.co/5YN3ggNLaF"]["“I think there’s an opportunity at every turn,” he said on “Fox News Sunday” before adding such cooperation is a “two-way street.” https://t.co/b8CVmgvQG5"]["\"I can work w/ the President... when I talk about reaching across the aisle there's probably a fair amount of issues that I want to reach inside the Dem caucus... to make sure they know the people of AL might need a little bit of a different direction\" https://t.co/07mod5Wa3e"]["\"I have resisted trying putting labels on myself. I'm going to be looking at the issues on both sides and I'm going to do what's in the best interests of the people of Alabama and the nation.\""]["\"I think there's opportunity at every turn to find common ground with my colleagues in Congress and the President.\""]["Up next: Doug joins Chris Wallace on Fox News Sunday to discuss his plans to work across the aisle to make Alabama and America stronger. #TuneIn"]["\"Everyone needs to hit the political reset button and examine issues in a way that best helps the people of Alabama.\""]["\"I'm going to talk with people on both sides of the aisle to do what's in the best interests of the people of Alabama and across America.\" - Doug on how he will vote in the Senate"]["Watch Doug live w/ Jake Tapper on @CNNSotu discussing his campaign victory &amp; his plans to find common ground in the Senate. #TuneIn"]["It was great to join Don Dailey on @APTV to talk about the campaign and our plan to bring Alabamians together. https://t.co/jDklhaQm6g"]["Getting ready to join Savannah Guthrie on the @TODAYshow. Live at 6am. https://t.co/M7hWnSTbaH"]["“On a very personal level, I want to thank each of you for fulfilling a lifelong dream to serve in the U.S Senate.\n\nWe have work to do in this state. \n\nThank you all, god bless you.”\n\nDoug Jones, election night victory.\n#RightSideOfHistory https://t.co/mpgFGAqofg"]["To Washington: “Take this election from the great state of Alabama. Take this opportunity and find common ground, go ahead and fund that CHIP program!”\n\nDoug Jones, election night victory.\n#RightSideOfHistory"]["“At the end of the day this entire race has been about dignity and respect. This campaign has about the rule of law. \nThis campaign about common courtesy and decency and making sure everyone in this state gets a fair shake”\nDoug Jones, election night victory.\n#RightSideOfHistory"]["“We have come so far and the people of Alabama have spoken.\n\nIt has never been about me, it’s never been about Roy Moore, it’s about you.”\n\nDoug Jones, election night victory.\n#RightSideOfHistory"]["“I have always believed that the people of Alabama have more in common than divides us. \n\nWe have shown the country the way forward.”\n\nDoug Jones, election night victory."]["“Today has always been a special day, today is mine and Louise’s 25th wedding anniversary”\nDoug Jones https://t.co/jg2TIwRUkz"]["Thank you ALABAMA!!"]["If you’re in line now, stay! If you got in line by 7pm, you can vote. Your vote could be the difference. https://t.co/oEKlthCTOj"]["This race could come down to your one vote- if you are in line, stay in line! https://t.co/LDuwUgijZr"]["Polls in Alabama are now closed. If you’re in line now, stay! If you got in line by 7pm, you can vote. https://t.co/xfAWkNLI60"]["Polls close in 30 minutes. Make sure to get to your polling place by 7pm. As long as you’re in line, you can vote. Check https://t.co/MKWnG58S8r to confirm where to vote. https://t.co/TG8K1MeklJ"]["Polls close in ONE HOUR. Make sure to get to your polling place by 7pm. As long as you’re in line, you can vote. Check https://t.co/MKWnG58S8r to confirm where to vote. https://t.co/dSmbI7AYq7"]["Less than 2 hours until polls close in Alabama! Don’t forget to vote\non your way home. Call us at 1-800-682-2793 with all your voting questions!” https://t.co/q8MzOfOhfy"]["3 hours until polls close. There’s still plenty of time to vote! Don't forget, you must vote at your precinct's polling location. Have any questions on where to go vote? Call us at 1-800-682-2793! https://t.co/E7gxvCIM75"]["Students at UAB getting rides to the polls from @allyssamillano &amp; @PiperPerabo https://t.co/ADm1d7Ztqa"]["@AyeyoKEJO Thanks for the support from one of the best running backs in the nation!"]["Students, Alabama native @channingtatum has a special message for you. \n\nThere is still time to vote, go to https://t.co/5dkGHic81c for details.\n#RightSideOfHistory https://t.co/NRdwefXzje"]["“Strolls to the polls” at Tuskegee University today. https://t.co/P34b8XAzVb"]["We are halfway through the day and there's still plenty of time to vote! Don't forget, you must vote at your precinct's polling location. Have any questions on where to go vote? Call us at 1-800-682-2793! https://t.co/xiVMpLLx6F"]["Have any questions? Call us at 1-800-682-2793 and we'll get you answers! https://t.co/xCk8IhNOVx"]["Happy 25th anniversary, Louise!\nIt’s been a quarter of a century, and I wouldn’t be where I am today without my best friend, partner, and running mate on this journey. https://t.co/WstPeZo0X8"]["Today, let’s get everyone to vote.\n\nThank you, @JoeBiden https://t.co/2BdAWBZin9"]["Thank you, @BellamyYoung for your kind words and endorsement!\n\nHave voting questions? https://t.co/5dkGHic81c https://t.co/e57fPXEvls"]["Thank you @kerrywashington for your support and endorsement!\n\nDon’t know where to vote? Go to https://t.co/5dkGHic81c https://t.co/fdv5q9Rbo9"]["Don't forget to take an ID with you when voting! Have questions on what types of IDs are acceptable? Call us at 1-800-682-2793 and we'll help you out! https://t.co/QZwkj3L7Pu"]["Our friends across Alabama have already started voting! Share this graphic to let your friends know you supported Doug today and send us a selfie with your \"I voted\" sticker. https://t.co/aNjhNXJ0la"][".@MarkRuffalo asks college students in Alabama to vote for a better future with Doug Jones as US Senator. Polls are open from 7am to 7pm today Tuesday, December 12th. \nFind your polling station here: https://t.co/5dkGHic81c https://t.co/M2HzJFCMhJ"]["Today, #RightSideOfHistory\nGo vote! https://t.co/HAWYiHqiez"]["Have questions about voting today? Call the voter hotline at 800-682-2793. https://t.co/tpIrsck9qi"]["Polls are now open! \nHave you made your plan to vote? Visit https://t.co/1UMDa6L8To or call us at 1-800-682-2793 to help find your polling location or answer any other voter questions!"]["Polls are open in Alabama! Find out where you vote at https://t.co/5dkGHhUwCC and head to the polls before 7pm today. Got a voting question? Call the voter hotline at 800-682-2793. https://t.co/prZQ3FuAjS"]["Today is incredibly important for the future of Alabama and we need your help encouraging your friends to vote. \n\nThe link below will enable you to find and email your friends that are voters in AL and remind them to vote.\n\nhttps://t.co/LxE9CDmI5T https://t.co/VqWPxhZjDe"]["It’s Election Day! Polls open at 7am. Confirm your polling place at https://t.co/5dkGHic81c and make your plan to vote now, Alabama. https://t.co/5SMD0aWNMp"]["Doug shaking as many hands as he can, and meeting as many as possible after his final #GOTV4Doug rally. https://t.co/3PDDtO5TTb"]["“We are on the #rightsideofhistory, folks.\n\nIf we have ever had a year of courageous women, it is 2017!”\n\nDoug Jones final #GOTV4Doug rally https://t.co/cgrNaWDZSI"]["“It’s time to put our state, our decency before political party.\n\nWe say no more to discriminating against the least fortunate among us.  It is time to say no Moore!”\n\nDoug Jones final #GOTV4Doug rally https://t.co/8TTYFiZ1wc"]["“This is the most significant election our state has seen in a long long time.\n\nIt is time that we take a road to get us on the path to progress.”\nDoug Jones final #GOTV4Doug rally https://t.co/kR2xgXhm94"]["“The hay is in the barn. All we have to do is make sure we get out the vote tomorrow!”\nDoug Jones final #GOTV4Doug rally https://t.co/x4gCC7E6uY"]["“What are the odds of Doug Jones winning? It’s like getting five inches of snow in Birmingham the first week of December!”\nDoug Jones final #GOTV4Doug rally https://t.co/UaWXMiq9e5"]["“I know what it’s like to climb an uphill battle against people who say there is no way in the world to win- let me be the first to tell you... it can be done.  Doug is going to do it.”\n@WoodfinForBham \n#GOTV4Doug final rally"]["“We are here with the new mayor of Birmingham @WoodfinForBham and the next Senator from Alabama- Doug Jones.”\n\nGOTV4Doug final rally\n#CharlesBarkley https://t.co/j9GR3veAzD"]["“I am begging you to call, text your friends. At some point we got to draw the line in the Sand.”\n#CharlesBarkley\n#GOTV4Doug final rally https://t.co/D9RwltV4m6"]["“You know if somebody told you guys, put this election in a movie script you would throw it in the trash. You would say there is no way possible this other guy can be leading in the polls.”\n\n#CharlesBarkley\nFinal #GOTV4Doug Rally"]["Backstage with Louise and me at the final #GOTV4Doug rally! @Alyssa_Milano @WoodfinForBham @UzoAduba #CharlesBarkley\n#RightSideOfHistory https://t.co/bgvK5pPedi"]["Honored to have Sir Charles join the Jones family before our Birmingham GOTV rally &amp; help us share our campaign's message of bringing Alabamians together https://t.co/RrxOktX610"]["BREAKING: Charles Barkley, Uzo Aduba of Orange Is The New Black will join Doug tonight to host our GOTV rally in Birmingham at 6 p.m. Check out the event details below: https://t.co/s0M4GOTKwk"]["Tomorrow is incredibly important for the future of Alabama and we need your help encouraging your friends to vote. \n\nThe link below will enable you to find and email your friends that are voters in AL and remind them to vote.\n\nhttps://t.co/LxE9CDmI5T"]["Thank you to great Alabamians Mike Cooley and @drivebytruckers for your support and endorsement! \n#VoteDec12 #GOTV4Doug https://t.co/gwyejuNwUB"]["\"Please go out and vote, vote for Doug Jones on Tuesday. Do it, it's the right thing to do\" Jason Isbell\n\nhttps://t.co/blORXRcJeM"]["\"I wouldn't vote for Roy Moore. I think the Republican Party can do better\" Republican Senator Richard Shelby \n\nhttps://t.co/Xz3dWR2Xzu"]["\"We've got to quit playing political football with our health care... But we can only do it if we work together to find common ground.\" https://t.co/07szXggwVT"]["\"Voting for Roy Moore just because he has an 'R' next to his name, ignoring his record of personal and official misconduct, is neither wise nor careful.\"\n\nhttps://t.co/jEizcDfDpF"]["Tomorrow is the deadline to postmark and return your mail ballot! Haven't received the ballot you requested yet? Worried it won't be received by noon on Election Day? Give us a call at 1-800-682-2793 with all your mail ballot questions!"]["\"When it got to the 14-year-old's story, that was enough for me .. I said, 'I can't vote for Roy Moore,” Republican Senator Richard Shelby on the \"drip drip drip\" of credible allegations against Roy Moore. https://t.co/VEmkQWYTqi"]["\"We can't sit back with the blessings of this democracy. We have work to do.\" - Senator Booker https://t.co/CsE2Uz3u5F"]["\"We have folks across the state rallying around our campaign because they share the same Alabama values that we do.\" - New Hope Baptist Church https://t.co/ns0rXlpiG6"]["\"Let us go to the polls to do our own work and remember that our life depends on it, because it does.\" - Congresswoman Sewell https://t.co/yVnZ8KwjtO"]["Doug &amp; Louise join Senator Booker, Congresswoman Sewell, &amp; State Senator Rodger Smitherman at More Than Conquers Church in Birmingham to share their message of bringing Alabamians together. https://t.co/vlXVhP1d6I"]["\"This is probably the best reason I've had to play in Huntsville in a while\" Jason Isbell said in supporting Doug, encouraging people to vote Tuesday December 12th. https://t.co/Pz2DfdOPcG"]["Thank you to a great Alabamian, @JasonIsbell, for a great show, and a great endorsement!\n\nhttps://t.co/brAlrgAEGp"]["With a capacity crowd inside, some fans even stood outside in almost freezing temps to hear Jason Isbell at the GOTV concert for Doug https://t.co/PbBMEWFCXb"]["Thank you @StP_BrokenBones for your endorsement and an amazing night!\nVote December 12th.\n#GOTV4Doug https://t.co/LnnCp5p1IG"]["“Each of us in our time is supposed to do what they can to make things better for those who come behind us. \nThis is a generational responsibility. We have a chance to take a step in the right direction w Doug Jones”\n\n@DevalPatrick with @StP_BrokenBones #GOTV Rally in Birmingham https://t.co/twHPbTU9SF"]["Doug Jones greeting the crowd after @StP_BrokenBones #GOTV Rally in Birmingham https://t.co/cMfz7AqjLJ"]["“We have an opportunity on December the 12th for hope and history to rhyme-\n\nWe have our history, but we also have our hope. Thank you so much!”\n\nDoug Jones closing with @StP_BrokenBones #GOTV Rally in Birmingham"]["The question of this election is not ‘who do we want to be?’\nThe question is- who are we?\n\nWe are not the Alabama of Roy Moore’s divisiveness.\n\nDoug Jones with @StP_BrokenBones #GOTV Rally in Birmingham"]["Roy Moore will be a disaster for this state, I don’t need to tell you that by this point. You know it.\n\nI want to represent every man, woman, and child and not just a select few.\n\nDoug Jones with @StP_BrokenBones #GOTV Rally in Birmingham"]["I don’t care what party you belong to. The first question you need to be asked when you run for office is “what is your purpose?” Not what party do you belong to-\nDoug Jones with @StP_BrokenBones #GOTV Rally in Birmingham"]["I sound like a broken record, but we are going to finish this campaign the way we started it, talking about kitchen table issues. Healthcare, education, jobs. \nDoug Jones with @StP_BrokenBones #GOTV Rally in Birmingham"]["We are going to the people. \nThanks to you, I know you’ve been on the phones. This week we crossed one million phone calls. That is thanks to you and your commitment!\nDoug Jones with @StP_BrokenBones #GOTV Rally in Birmingham https://t.co/fQHg6LtXbw"]["Waiting for the show to begin with @StP_BrokenBones &amp; having fun! https://t.co/sfqHHwNJjz"]["\"I encourage you to go out and vote Tuesday for Doug Jones\" Alabama's own Jason Isbell to capacity crowd in Huntsville https://t.co/CtI0BVRLag"]["There's still time to register! Come see St. Paul and the Broken Bones in Birmingham for a FREE Get Out the Vote Concert on Saturday, December 9th at 7:00pm! \nhttps://t.co/U3Cc9LOnoA"]["\"We need leaders to unite us and a leader to remind us that we have more in common than we have differences.\" -Senator Booker https://t.co/mKvpnFsHb4"]["\"Now is our moment, it's our time because we are on the right side of history...Together we can make Alabama a better place for all of her residents.\" - Doug https://t.co/7eF7x2h7lm"]["\"I need a partner and Alabama needs a partner like Doug Jones in Washington D.C.\" Congresswoman Terri Sewell kicks off the rally at Alabama State University https://t.co/VCYrsESSnc"]["Are you ready to vote December 12th? https://t.co/bJrVI0SMHe"]["Thank you @conniebritton for the kind words, and the support! https://t.co/0LiuswlpdF"]["Thank you @KeeganMKey for your support! https://t.co/fHp43U8k13"]["Another divisive and disturbing passage from Roy Moore’s legal course. In the Senate, I’ll fight to represent all Alabamians. https://t.co/ULNEiJLv2x"]["Have you requested a mail ballot, but not yet received or returned it? Between yesterday's bad weather and the deadline on Monday, we want to help you make sure your vote counts! Give us a call at 1-800-682-2793 with all your mail ballot questions."]["“Roy Moore is lying...again.” https://t.co/LjbkxhXEDs"]["BIG announcement: Jason Isbell is playing a FREE Get Out the Vote Concert in Huntsville on Saturday, December 9th at 6:00pm! Get your tickets here:\nhttps://t.co/vTUcvpQBmJ"]["Hey Birmingham! Come see St. Paul and the Broken Bones for FREE at our Get Out the Vote Concert on Saturday, December 9th at 7:00pm! https://t.co/U3Cc9LOnoA"]["Hey Huntsville! Come see Jason Isbell for FREE at our Get Out the Vote Concert on Saturday, December 9th at 6:00pm! \nhttps://t.co/vTUcvpQBmJ"]["There's still time to register! Come see St. Paul and the Broken Bones in Birmingham for a FREE Get Out the Vote Concert on Saturday, December 9th at 7:00pm! \nhttps://t.co/U3Cc9LOnoA"]["\"This disturbing comment is part of Roy Moore's terrible history on civil rights including fighting the removal of segregationist language from the state Constitution...”\n\nhttps://t.co/fP6lLKTVau"]["One of my beautiful granddaughters and a friend putting my yard signs to use on the snow! https://t.co/D9m8ErxVeP"]["Join Jason Isbell in Huntsville for a FREE Get Out the Vote Concert on Saturday, December 9th at 6:00pm!\n\nhttps://t.co/n4ShuxQYH4"]["The clock is ticking to get your absentee ballot request in. Make sure your request is postmarked with today’s date. You can call us with voting questions at 1-800-682-2793. https://t.co/fl4kXjKe7g"]["Our dedicated volunteers have made more than 1 MILLION phone calls in the last seven weeks! https://t.co/CrUUcFHGSs"]["\"We want to talk about the issues we have in common and the issues that will move this state forward.\" https://t.co/8oetpNi1TM"]["Doug makes a stop at our Huntsville office to fire up volunteers &amp; share his message of bringing Alabamians together to talk about the kitchen table issues. https://t.co/mt5qCBhri2"]["This is not a partisan issue. \n\nhttps://t.co/WMuevrimIY"]["Don’t forget: today is the last day to request your absentee ballot. All ballot requests must be postmarked with today’s date. If you have questions, go to https://t.co/1UMDa6L8To or call the Voter Hotline at 1-800-682-2793. https://t.co/3gwzXVoamZ"]["Thanks Bakari for your support and for inviting me to join you on your podcast to talk about our efforts to bring Alabamians together by addressing the kitchen table issues. https://t.co/IauAXoeoBi"]["Today is the last day to request an absentee ballot! Your request must be postmarked with today’s date in order to receive an absentee ballot. Have any voting questions? Visit https://t.co/1UMDa6L8To or call the Voter Hotline at 1-800-682-2793. https://t.co/1onOqvMpFe"]["76 years ago more than 2,000 Americans lost their lives in the attack on Pearl Harbor. Today we honor their sacrifice in service and defense of our nation. https://t.co/1zoU5DBw0O"]["\"The bad news is that, win or lose, Roy Moore hurts Alabama when it comes to attracting multinational corporations to the state.\"\nhttps://t.co/mXUla2BAei"]["“Doug Jones is someone who understands the importance of justice and fairness,” Ledbetter said. “That’s all I’ve ever expected. Justice and fairness.”\n\nhttps://t.co/UsBJMxs7uV"]["“If Jones wins, middle-class Alabamians will have a fighter on their side. Poor Alabamians will have a champion for their cause.”\n\nhttps://t.co/Z7tWn1cbq3"]["“I’m here this evening to support Doug Jones because he is the only candidate who will put the interests of working women and their families first,’ she said, further citing her work on the Lilly Ledbetter Fair Pay Act.”\n\nhttps://t.co/wfeGRfIBqA"]["“Our responsibility - our duty and obligation - is to work for the people, \nnot to drive self-serving political interests.”\n#RightSideOfHistory\nhttps://t.co/DIgY5BjJ3B https://t.co/RClWZ2oWeT"]["“CHIP funding helps more than 150,000 Alabama kids have access to healthcare that couldn’t otherwise afford it.”\n#KitchenTableIssues \nhttps://t.co/DIgY5BjJ3B https://t.co/A6TINrmka3"]["“Jones’ intelligence, track record of consensus-building and experience as an attorney and former federal prosecutor commend him to the role of U.S. senator.”\n\nhttps://t.co/NySVt3B3nQ"]["Come to think of it, Bannon and Roy Moore have something in common. Neither of them can hold down a job. https://t.co/TslajBCD5E"]["We don’t need an outside agitator like Steve Bannon carpetbagging in Alabama."]["“Will we tell our daughters that if you are abused and if you speak out, you will be believed and Alabama will stand with you regardless of when you come forward?”\n#OneWeek \n#RightSideOfHistory https://t.co/EbV7yqcfF7"]["“As I have said before - I believe these women. And so should you.”\n#OneWeek \n#RightSideOfHistory https://t.co/T4W7JQIryy"]["“It is crystal clear that these women are telling the truth and Roy Moore is not.”\n#OneWeek\n#RightSideOfHistory https://t.co/8G71NFqOD5"]["“I believe the contrast between myself and my opponent could not be clearer.\n \nI have never been fired from any job I have held...”\nhttps://t.co/DIgY5BjJ3B https://t.co/gDdkRsB4tG"]["“Roy Moore in the United States Senate would be a disaster for business in Alabama.”\nhttps://t.co/DIgY5BjJ3B https://t.co/SPeQX1M1zI"]["I am as convinced today, as when we began, that the people of this state have more in common than we have that divides us and that the next Senator from Alabama can impact \nthe arc of our state in an amazing way.  \nhttps://t.co/DIgY5BjJ3B https://t.co/9IFiNx7hzx"]["“Despite the silly name calling my record as a prosecutor speaks for itself and I am a supporter of the Second Amendment.  \n \nWhen you see me with a gun,\nI will be climbing into a deer stand\nor a turkey blind, not prancing around on a stage in cowboy outfit.” https://t.co/3NDhoqAjJD"]["“I believe women are every bit as capable as men, that they deserve to be elected to public office, and I damn sure believe and have done my part to ensure that men who hurt little girls should go to jail -- not to the U.S. Senate.” https://t.co/dQG6fYdHU4"]["Thanks Jeff. I hope others will donate too!\n#OneWeek\n#RightSideOfHistory\nhttps://t.co/DIgY5BjJ3B https://t.co/thnRT4omRM"]["This is the seventh rural hospital to close in Alabama in eight years, devastating those communities &amp; forcing people to drive several counties away for care, with other hospitals on the brink. Doug supports health care plans that assist these hospitals.\nhttps://t.co/nwGpz9hmqO"]["“We need to look at this as parents, as grandparents and not through the jaded lens of politics.\n \nThis is about decency not a political party and anyone who thinks otherwise, should be ashamed.”\n#OneWeek https://t.co/xQLhuRGmn0"]["Roy Moore won’t talk to the media, won’t talk to voters, won’t campaign, won’t debate, and couldn’t even handle me calling him embarrassing- he thinks he gets a free pass to the senate even with his disturbing history.\n#NoMoore https://t.co/x4JKYdvLtz"]["We are one week out from a very consequential election that will impact EVERYONE. Help us win this thing! \n#OneWeek \nhttps://t.co/DIgY5BjJ3B"]["If you need to apply for an absentee ballot for the Dec. 12 special election for the U.S. Senate, THURSDAY IS THE DEADLINE TO APPLY.\n\nhttps://t.co/peNAn4Sa8L"]["“...knowing we have done our part \nto leave our state better than we found it, \nknowing we answered the call to move Alabama forward, and knowing that we were on the right side of history.”\nDoug Jones, one week before Election Day speech."]["“A better Alabama that we can be proud to have built, and be proud to pass on to our children and grandchildren, particularly our daughters and grand daughters...”"]["“I want an Alabama with a first class education system for all children, world class vocational training, and a vibrant, innovative economy that attracts quality jobs and new industry.”\nDoug Jones, one week before Election Day speech."]["“I believe women are every bit as capable as men,\nthat they deserve to be elected to public office,\nand I damn sure believe and have done my part to ensure that men who hurt little girls should go to jail -- not to the U.S. Senate.”\nDoug Jones, one week before Election Day speech"]["“This is about decency not a political party &amp; anyone who thinks otherwise, should be ashamed.\n \nIt is the people of AL, the parents of AL, who will hold Roy Moore accountable.  \n \nThis is about Alabama's honor\nand doing what is right.  \nNothing more. &amp; certainly nothing less.”"]["“As I have said before -- I believe these women. And so should you.”\nDoug Jones, one week before Election Day speech."]["“By any objective standard or review that examines the extensive corroboration of the statements of these women and significantly, the inconsistencies of Roy Moore’s denials, it is crystal clear that these women are telling the truth and Roy Moore is not.”\nDoug Jones."]["“Despite what you hear in his TV ads, Roy Moore has never, ever served our state with honor.  \n \nHe has never been a source of pride for the people of this state, only a source of embarrassment.”\nDoug Jones, one week from Election Day speech."]["“Roy Moore in the United States Senate would be bad for business in Alabama, bad for the economy, and bad for our country.”\nDoug Jones, one week from Election Day speech."]["“The CHIP funding helps more than 150,000 Alabama kids have access to healthcare that couldn’t otherwise afford it.\n \nThese programs are in jeopardy and I will fight for their funding,”\nDoug Jones, one week from Election Day speech."]["“When I talk about kitchen table issues, I mean the challenges that we deal with each and every day.”\nDoug Jones, one week from Election Day speech."]["“I want to go to Washington to address the issues that every day Alabamians are facing and to fix the institutions that our vital to our health and our economy.”\nDoug Jones, one week from Election Day speech"]["“Alabama is at a crossroads and it is more important than ever that we rise to meet the challenges both in our great state and across our nation.\n\nBut we can only do it together, not divided, and with a measure of civility\nthat has been absent from our political discussions.”"]["This is a season of opportunity -- an opportunity to come together, to realize an Alabama that will make us all proud.\nDoug Jones, one week from Election Day speech."]["“I am as convinced today, as when we began, that the people of this state have more in common than we have that divides us and that the next Senator from Alabama can impact the arc of our state in an amazing way.”\nDoug Jones, one week from Election Day speech."]["WATCH LIVE: Today At 12PM CST, One Week From Election Day, Doug Jones To Give Major Speech\nhttps://t.co/f5a9aJgN1k"]["WATCH LIVE: Today At 12PM CST, One Week From Election Day, Doug Jones To Give Major Speech\nhttps://t.co/vpD3qopG1K"]["\"Jones is appealing to voters on what he calls \"kitchen table issues\" including health care, jobs and education, the church bombing prosecution is always in the background.\" \n\nhttps://t.co/AhQUxku6mZ"]["“Incumbent upon me to vote Republican, but to write in some distinguished person's name rather than Judge Moore. I will not be voting for Judge Moore,\" said Richard Shelby, Alabama's Republican U.S. senator. https://t.co/4JjW9fbjM6"]["“When you lose health care in your communities, you lose your community.”\n-Doug Jones speaking at US Steel Mill he, his father, &amp; his grandfather worked. https://t.co/6gwZ9wq29P"]["“Our campaign is going straight to the people of Alabama, that’s who our voters are.”\n-Doug Jones speaking at US Steel Mill he, his father, &amp; his grandfather worked at. https://t.co/4n63VEG2yW"]["The Doug Jones campaign is running the largest GOTV push in Alabama in a generation and neighbors are coming together to share our message. https://t.co/UQDBGUTar5"]["\"The fear is that his (Moore’s) presence will tip the scales causing the business to choose somebody else,\" Hamill says. https://t.co/ax9xBO5GmF"]["\"For too long we've let politicians divide us. I've spoken with Alabamians all across this state and I can tell you, we have more in common than we have differences.\" - Band of Brothers Brewery fish fry https://t.co/chQtBE2x5N"]["\"We're not going to use the pulpit to put people down. We're going to bring people together to talk about the issues.\" - Beulah Baptist Church https://t.co/7IAaM1lVUV"]["\"We don't need a Senator whose character we'll question from day one. We need a Senator like Doug Jones who will work to make Alabama a better place.\" -@RepTerriSewell at Elizabeth Baptist Church https://t.co/M5KZWSOFYu"]["\"If we can get to polls, we can change Alabama. You'll wake up on December 13th with more than a Senator, you'll have a partner.\" - Bethel Baptist Church https://t.co/oGgsIim8vx"]["\"We can only have progress in this state if we are willing to sit down and have dialogues about the issues that we all face.\" - Plum Grove Baptist Church https://t.co/lTqxqM1pEE"]["\"Roy Moore doesn't want to talk about the issues affecting Alabamians. He wants to talk about the issues that divide us because that's all he knows.\" - St. John Baptist Church https://t.co/RgwKNU9ejV"]["\"We have an opportunity this election to show the nation that Alabamians can come together and find common ground.\" - Doug speaking at Hightown Church of God https://t.co/vAR4gAsJ2H"]["\"We've got to decide what kind of Alabama we want to have,\" Jones said. \"Do we want to have an Alabama in which everyone is treated with dignity and respect and equally and we try to get good jobs and we keep our healthcare?”\n\nhttps://t.co/4pfJ9HVMGP"]["@JakePeavy_22 Really cool day hanging out in Selma w/Cy Young winner Jake Peavy! https://t.co/nx5vIXKa7Y"]["Louise phone banking &amp; visiting campaign headquarters in Anniston! https://t.co/s5mfifYQfw"]["Doug joins the city of Selma for their annual Christmas parade to continue his message of bringing people together https://t.co/UKxUngkYDO"]["Great to see Mobile native and baseball great @JakePeavy_22, a World Series and Cy Young Award winner, at this morning's parade in Selma. https://t.co/cky351bwnW"][".@Bakari_Sellers energized students at Alabama State University. Then he was at our Montgomery field office rallying volunteers, &amp; he wrote words of encouragement for Doug to read during his trip down to Montgomery! https://t.co/jlTRioqFXl"]["Roy Moore talks tough to a comedian 2,000 miles away, but doesn't have it in him to debate Doug, hides for as many as 10 days at a time, and can't even answer questions that are submitted in advance https://t.co/7tk6yLf4gR"]["\"We've got 11 days, I'm excited about this campaign. I'm excited where we are. We're gaining momentum because Alabamians are ready for change.\""]["Doug in Montgomery, his third city of the day, to talk to folks about kitchen table issues https://t.co/3qLbh6du8R"]["\"I want you to know when I'm elected, the people of Bullock County &amp; Alabama will have more than a Senator, they'll have a partner.\" - Doug speaking in Union Springs https://t.co/XpvpSTWn8q"]["Doug joins Mayor Tony Haygood visiting area businesses and talking education in Tuskegee. https://t.co/gaNCxMobQS"]["Every day brings more examples of how Roy Moore’s extreme and divisive agenda would make Washington worse, and why he should not represent Alabama in the Senate. https://t.co/bFgAwNHiRT"]["Today we remember Rosa Parks for refusing to give up her seat on a Montgomery bus. Her courageous actions galvanized people across Alabama to stand against discrimination and fight for equality. https://t.co/7eDpZPdTNk"]["Doug joined volunteers in Huntsville tonight &amp; called voters to talk about the kitchen table issues that Alabamians are facing. https://t.co/T43F6XYL7U"]["\"We've let political officials try to divide us. It's been an 'us against them' mentality and for the last 10 years that movement has been led by Roy Moore.\""]["\"I felt it was time for someone to stand up and speak for those who felt that they didn't have voice.\" - Doug on why he entered the race"]["Doug kicks off the rally at University of Alabama at Huntsville talking about his goal to bring Alabamians together to talk about the issues that matter. https://t.co/35N4n1FQza"]["Doug joins students from Oakwood University for a roundtable discussion about making college more affordable and finding good-paying jobs for recent graduates. https://t.co/ayYaMCknNZ"]["Wonder what Governor Kay Ivey and Supreme Court Chief Justice Lyn Stuart think about this extreme and divisive view.\nhttps://t.co/XlswlbubSF"]["Doug joins @JANICEROGERS6 on #GDA to talk about his campaign's goal to bring Alabamians together by talking about the issues affecting them the most. https://t.co/ynrJ5UYK8o"]["I want to thank all of the educators who allowed me to listen and learn from them about how we can empower our students and strengthen our schools. https://t.co/O0nRitKrCo"]["Doug registers volunteers during our weekly Woman to Woman phonebanking event at the Montgomery field office https://t.co/WhpNYxlLnh"]["\"We've got to find the money to help our states create early childhood ed &amp; pre-K programs. Interaction with kids at an early age is critical for their development.\""]["\"Our education in this state has been treated like a political football. Tell me what I can do as a senator to make our schools better.\""]["Doug joins Montgomery area teachers to talk about the needs of students and what he can do as a Senator to make Alabama's schools the best they can be. https://t.co/W5T4kdFcbT"]["Flowers said that Shelby is \"embarrassed\" by Moore and may be concerned about the ex-judge's candidacy giving Alabama \"a black eye\" when recruiting industry and \"bringing home the bacon.\"\nhttps://t.co/NS2BL4Q5rI"]["“Moore has limited his campaign appearances and largely avoided interactions with reporters since he was accused of committing sexual misconduct with teenagers when he was a prosecutor in his 30s.\" https://t.co/czfp84wCmf"]["I strongly support #NetNeutrality and believe every Alabamian should have access to a free and open internet.\n\nhttps://t.co/3XZ9ikWGaa"]["\"I will support the bipartisan efforts already taking place in the Senate to make our health care stronger and preserve vital programs like Medicare, Medicaid &amp; the Children's Health Insurance Program.\""]["Doug joins the staff at Northport Medical Center to discuss making health care more affordable &amp; protecting Alabama's hospitals https://t.co/MihqQKokkf"]["It is unacceptable to jeopardize the health care of 150,000 Alabama children. https://t.co/vO4FYvcuzC"]["\"I didn't vote for him\" Alabama's senior U.S. Senator Richard Shelby said of fellow Republican Roy Moore https://t.co/iFtDehhPPw"]["Only 6 hours left to register to vote, Alabamians. Go to https://t.co/vdAz1LQb8F to check your status and register now by midnight!"]["6,000 miles \n140+ events\n400,000 phone calls\n1,600 pieces of fish\n15 days left https://t.co/Gj8oQgoPjL"]["Doug joins students from University of Alabama at Birmingham to discuss his record as a prosecutor &amp; his role prosecuting the men responsible for the 16th Street Baptist Church bombing. https://t.co/eCOk0Rqdbl"]["Alabama, today is the last day to register to vote! Go to https://t.co/vdAz1LQb8F to check your status and register online by midnight tonight. https://t.co/wNmgiRfUSx"]["@DigitalKristen Thank you!!!"]["We are 49th in education. It’s time we make a change for our children.\n#AlSen\n#KitchenTableIssues https://t.co/UqTnQVVV7p"]["“We've lost several rural hospitals because our leaders put politics before our health. We're going to fix health care by bringing costs down &amp; expanding access to coverage.”\n\nDoug Jones- Greensboro at the Hale County Banquet.\n#ALSen"]["“Alabamians have more in common than we have differences. For too long we've let self-serving politicians like Roy Moore divide us.”\n\nDoug Jones- Greensboro at the Hale County Banquet.\n#ALSen"]["\"It is time Alabama gets beyond men like Roy Moore. In order to move forward we must put state and country before our party\" \n\nDoug Jones- Greensboro at the Hale County Banquet.\n#ALSen"]["Doug speaking to hundreds of people in Greensboro at the Hale County Banquet.\n#ALSen https://t.co/adoedmpEuC"]["Reminder: 1 day left to register to vote.\n\nYou can use the mobile app (Vote for Alabama) to register to vote up until 11:59:59 on Monday, November 27!\n\nYou can also register and get more information at:\nhttps://t.co/SvogxZwWbC https://t.co/iW97akoks5"]["Had an amazing day meeting great people at the #IronBowlِ https://t.co/72hZIVwFkl"]["Also, you can continue to use traditional registration by completing the form and mailing it, but they have to be postmarked by November 27 or received in the office as the walk up by November 27."]["Reminder: \n\nYou can use the mobile app (Vote for Alabama) to register to vote up until 11:59:59 on Monday, November 27 as long as you have a valid Alabama drivers license. \n\nYou can also register and get more information at:\nhttps://t.co/s0PQ0IJNIe https://t.co/98SKUrPyX6"]["Tailgating and meeting voters on the biggest Saturday in Alabama. https://t.co/eWlHXhEPur"]["Make sure to register to vote before November 27th! https://t.co/kTz89nVtk0"]["Today, we take a moment to count our bountiful blessings, reflect on our lives, and those who matter to us.\n\nWe’re grateful for everyone who has supported our campaign to bring folks together in Alabama.\n\nLouise and I would like to wish you and yours a very Happy Thanksgiving. https://t.co/gXfVJDA4Vx"]["“Immoral” https://t.co/92qemMYK3Y"]["Yesterday I visited Christmas Charities. Started in 1949 by Walter Cummings,\nthey support families in Huntsville and Madison County. \nThank you for all you do in your community! https://t.co/VDUEcrN3bs"]["\"You can't change your stripes. I am who I am.\"\n\nDoug Jones- Madison County Town Hall  #RightSideOfHistory https://t.co/kyt8oeGm7Y"]["\"My view about public service is that it can be and should be a force for good.”\n\nDoug Jones- Madison County Town Hall  #KitchenTableIssues https://t.co/SMqjNRGbZJ"]["Thank you to everyone who turned out at Chez Lulu in Birmingham for Women for Doug Jones, and Sugar Belle in Huntsville for the “Coffee with Louise” event! https://t.co/fxXXHXXeqY"]["@Timodc @jonlovett I’m pretty happy about it!\n\nThis campaign is all about bringing people together, and talking about the #KitchenTableIssues we all face. Your support matters!"]["Thanks, Tim!\n#GOP4Jones https://t.co/aqWsK5kzSX"]["Doug in Talladega talks fixing health care &amp; lowering taxes for the middle class with a group of voters. \n-DJFS https://t.co/py1r8THzkS"]["Always an honor to be in historic Brown Chapel AME Church in Selma, the starting point of the Selma to Montgomery Voting Rights Marches in 1965. People bled in this church for the right to vote. https://t.co/n3B3gV4Cid"]["Thanks to all six congregations that welcomed @RepTerriSewell and me in Selma today. I appreciate your prayers and you opening your doors. https://t.co/H9cbrHUJHd"]["Honored to meet Mary Liuzzo Lilleboe, daughter of civil rights heroine Viola Liuzzo, Saturday at the Fred Shuttlesworth Human Rights Awards at the Birmingham Civil Rights Institute. https://t.co/XwtmfoIwy1"]["I am honored to have the endorsement of the Birmingham News, Huntsville Times, &amp; Mobile Press-Register.\n\nI plan to keep talking about the issues that impact our lives &amp; finding common ground to make things better for all of Alabama. \n#KitchenTableIssues \n\nhttps://t.co/JRnJxvp3Ly"]["Watching this trial inspired me to fight for justice and finish the job of convicting the last two murderers of those 4 little girls. https://t.co/b1QstBODRo"][".@WoodfinForBham wants you to vote. Are you ready? https://t.co/BHp5TYejvX"]["Thanks for the support, Mayor-Elect @WoodfinForBham \n\nWe are all looking forward to your inauguration on November 28th! https://t.co/4FGKG8YiJn"][".@WoodfinForBham “Doug Jones has a servants heart, but each of you have to believe that. This race won’t be won on tv. We have to knock on doors. We need to be making phone calls. We need to have someone in D.C that represents all of us, and that is Doug Jones.” https://t.co/4PA2e6R91Z"][".@WoodfinForBham “Doug Jones is our candidate. We are excited about what can happen in the next 24 days. We are here to talk about the importance of Democrats turning out Dec 12.”"]["DJ- This an important election, folks. We are at a tipping point. We can either elect someone divisive and who will take us backwards, or elect someone who will find common ground. We all want the same things."]["DJ- It doesn’t matter where we are in this state, our message is healthcare. \n\nWe want to make sure that the CHIP program is funded as soon as possible!\n\nFund the CHIP program now, don’t wait for me to get up there. Do it now for our children."]["DJ: We have had such an exciting run, and it’s thanks to all of you! We have the wind at our backs! https://t.co/fWM8Ccs87Z"]["Excited for the Fish Fry and Rally with @WoodfinForBham \n\nIs Birmingham ready for us?! https://t.co/mRDKLxC1V3"]["Alabama, can you canvass, can you make calls, can you help on social media? The moment has arrived, we are near the finish line, and we need you and everyone supporting us!\n\nhttps://t.co/YaU5txuNir"]["Alabama-\n\nOur campaign is gaining momentum &amp; Alabama wants to talk about #KitchenTableIssues that impact their lives.\n\nWe’re 25 days out and preparing for Election Day.\n\nIf you’re voting for me on December 12, we need you to verify!\n#AlSen\n\nhttps://t.co/0ghwIr2OM8"]["A full house at Hunt’s restaurant in Dothan! What an amazing and energized group ready to work on #KitchenTableIssues! https://t.co/VJ73q4cP0N"]["This is a unifying campaign. But getting endorsements from both the Crimson White &amp; The Plainsman is awesome and proof of #ALComeTogether!\n#RollTide #WarEagle\nhttps://t.co/neId0GAAxa"]["If you support #KitchenTableIssues &amp; are on the #RightSideOfHistory then take the challenge.\n1. Record a selfie saying why you support us, &amp; challenge 2 friends to do the same.\n2. Go to the website and fill out the form.\n3. Show everyone where you stand!\nhttps://t.co/pop0iLA3jq"]["Sign up if you’re in Alabama and ready!"]["Our campaign is gaining momentum &amp; supporters from every corner of Alabama.\n\nWe’re 26 days out and preparing for the final push.\n\nIf you’re voting for me on December 12, can we count on you?\n#AlSen\n\nhttps://t.co/0ghwIr2OM8"]["I attended the Women in Action phone bank tonight in downtown Birmingham. I joined and made some calls.\nThanks for your support! https://t.co/4lwGJlM2e0"]["Greeting students and staff at UAB Hill Student Center. What an amazing group! We talked about higher education and the importance of voting on December 12th. https://t.co/y1OMoFavT4"]["A powerful endorsement from Steve Duncan. \nThank you, Steve. I won’t let you down!\n#AlSen #RightSideOfHistory https://t.co/Dn35mUIdls"]["“I’m a Republican for Doug Jones.”\n#GOP4Jones\n#ALSen https://t.co/ZTfXzaAJN7"]["Thank you everyone for ALL of your support and for fighting for #KitchenTableIssues. This campaign is about real Alabamians and the issues we face everyday.\n\nWe are on the #RightSideOfHistory and from the bottom of my heart- thank you for standing with us."]["I’m here to talk about the #KitchenTableIssues that real people face everyday.\nHealthcare, education, jobs. \n\nIf you want to make history and do the right thing; help us for the final 30 days.\n\nLet’s shock the world December 12!\nhttps://t.co/ssxxzm09JB"]["I need you now, we can make history.\n\nThe numbers:\nNew poll has us up 4.\n30 days out.\n158,328 on children’s healthcare.\n1 million on Medicaid\n968k on Medicare\n\n30 days out for the next 30 years- help us:\nhttps://t.co/ssxxzm09JB"]["@GeorgeTorresNYC @USMC Good luck, and thank you for serving!"]["Today we celebrate our veterans &amp; their willingness to sacrifice for us.\n\nWords aren’t enough when we are speaking about heroes. Let’s honor them &amp; ensure they receive quality health care &amp; benefits.\n\nThank you to those currently serving &amp; who have served. We are indebted to you."]["\"We can and will elect Doug Jones as the next U.S. senator from the state of Alabama\" Congressman John Lewis @repjohnlewis https://t.co/MFB2V5sqxR"]["\"He will never let you down. He will not embarrass you\" Congressman John Lewis on Doug Jones in packed gym in Prichard. https://t.co/B18DJpvpS2"]["Louise and I with Congressman John Lewis, a true hero and friend. Thank you for your support Congressman. I am truly honored. https://t.co/gGr3NLl0I1"]["Doug and one of his heroes, Congressman John Lewis, greet volunteers in Mobile. \nDJFS- https://t.co/urtrOJ0sip"]["I’m excited for my friend @repjohnlewis to join us in Mobile to talk about #KitchenTableIssues tonight!\n\nhttps://t.co/kfGofBBs1W"]["Mobile Veteran's Day Parade w/ Bill \"Cannonball\" Landry. \nHe Joined Marine Corps on Nov. 15, 1950 and has been a pipefitter since 1953. \nHappy 242nd birthday to the Marine Corps! \n#HappyBirthdayMarines https://t.co/2avew7EgGq"]["Great crowd tonight in Alex City.\nThank you Tallapoosa County! https://t.co/qF3feCbJ6G"]["Roy Moore is afraid to debate because:\n\n1. He doesn't support health care for 150k AL kids.\n2. He doesn't support health care for almost 1 mil seniors.\n3. He doesn't want to answer questions about the $ he took from his charity.\n4. His extreme views will hurt businesses.\n#ALSEN https://t.co/qjCRKjpODG"]["I may have the honor of serving Alabama as your senator, but the most important thing I have done is prosecuting those klansmen who killed 4 little girls at 16th St Baptist Church.\n\nhttps://t.co/b2CkvVdA0h"]["Thank you! Proud to have the endorsement of the great folks at the Crimson White &amp; the University of Alabama!\n#RollTide \n\nhttps://t.co/gBv31rTRgm"]["Roy Moore:\n1. Hiding from voters.\n2. Hiding from the media.\n3. Refuses to answer questions about the 1 million he took from his foundation.\n4. Even refuses to answer if he supports Medicaid/Medicare or CHIP’s.\n\nNo wonder he doesn’t want to debate. https://t.co/OmX0UH0QEB"]["Louise and I with our biggest little supporter! https://t.co/YMG3kS9hX1"]["With Sia Sanneh w/Equal Justice Initiative talking to college students about criminal justice reform at A Touch of Soul Cafe in downtown Montgomery. https://t.co/ah9JeIbPJ7"]["Live on air now on Praise 96.5 FM in Montgomery with Bishop Clarence Stewart talking about the #ALSEN race, time as US attorney, &amp; health care. https://t.co/cmafOwiOCF"]["“Our veterans are coming back and still not getting care.” Doug talking about importance of care for veterans."]["\"As we approach Veteran's Day again, we need to do more than celebrate our veterans once a year\" -Doug speaking to community leaders in Montgomery."]["\"I will tell you this -- I will learn and I will listen\" Doug to ministers and community leaders in Montgomery. https://t.co/yQ7G7z03RZ"]["He's hiding from voters and dodging reporters. Where's Roy? https://t.co/cFkUIJtdLy"]["Defense spending is very important &amp; making sure we have a capable and modern military to protect this country is incredibly important.\nhttps://t.co/Rc1MmMdGkm"]["400 people at BBQ in Fyffe. \n\nHundreds attended events in DeKalb, Calhoun &amp; St. Clair counties today https://t.co/Gm7r0YAaKE"]["#AllHatNoCattle https://t.co/zT85dzo44k"]["“I’ll be honest with you folks, I’m tired of the damned speeches. I don’t want to talk TO people, I want to talk WITH people.”\n\n-Fyffe, with the DeKalb County Democrats. https://t.co/CtFl3BIu8u"]["Another full house. Excited to speak here in Fyffe with the DeKalb County Democrats! https://t.co/TWMvbkSWxF"]["“It’s not about me, it’s not about Roy Moore, it’s about Alabama. It’s time we have dialogues, not monologues.”\n-Classic too, Anniston https://t.co/yyYDqwOlv8"]["@amylousou Thank you for all you’re doing!"]["Packed lunch crowd at City Market Grill in Pell City. https://t.co/qt383QZutC"]["It takes a special type of cowboy to pull a pistol out on stage and then hide from everyone when they ask questions. https://t.co/rd5gy9uh35"]["Build a strong fleet + build jobs= a strengthened community.\n\nhttps://t.co/iyDAzTSeX2"]["\"We will find common ground, just like you do in labor negotiations,\"\n\nhttps://t.co/Fb0hlToVLG"]["With my friend Dr. Will Boyd outside St. Mark Baptist Church, est. in 1859. Thanks for showing us your church &amp; talking about its outreach. https://t.co/cmankIpst4"]["“One of the things that made me comfortable about Doug is he talks like us\" Steve Stutts. Meeting today w/labor leaders in Muscle Shoals https://t.co/O1Xm3A2Aui"]["Great crowd at the meet and greet at TVA Community Credit Union in Muscle Shoals! https://t.co/uj6wQmqgaj"]["We appreciate the staff &amp; students of Northwest-Shoals Community College  for showing us their impressive workforce development programs! https://t.co/co8lHLnBaO"][".@MooreSenate won't say where he stands on healthcare. I will work with both sides to fix our broken system.\n\nhttps://t.co/djDXsyXL2f"]["Please donate to help us keep ads like these on the air.\nhttps://t.co/6afPBKHSoN"]["We have a new ad out today about healthcare. Simply called, Fix It. https://t.co/vsmVBT66RQ"]["My statement on the hateful act of violence committed at the First Baptist Church in Sutherland Springs. https://t.co/9Dcqrhzk4H"]["Louise &amp; I are deeply saddened by the loss of Judge Arthur Murray, a thoughtful &amp; caring servant to the residents of Calhoun County."][".@mooresenate puts his personal agenda before the people of Alabama. Every. Single. Time.\n@reckonalabama https://t.co/PsoXCCONP3"]["Tailgating in Tuscaloosa before the big game! #RollTide #BeatLSU https://t.co/4V9sd7VsIr"]["We have the support of business leaders and organized labor. That hasn't happened in a long time in Alabama. @reckonalabama https://t.co/Vd8xEtcXwL"]["Meeting people, checking out classic cars at Jackson Fall Festival. Thanks Commissioner Moye. Great to see Mayor South. https://t.co/4CHMbCenea"]["The entertainment for our fish fry. Thanks for the music and the support! https://t.co/cYEbhDBlsi"]["Reminder:@mooresenate still refuses to tell Alabamians where he stands on Medicare, Medicaid &amp; AllKids.\n\nhttps://t.co/2BCGFnNYjL"]["Young supporter Jace Thompson, 11 months old, joined his grandmother Helen McRand for our fish fry in Grove Hill. https://t.co/vScOhpi3Ci"]["Great crowd for a fish fry on a beautiful morning in Grove Hill. Live music. Great food. Amazing people! https://t.co/4r4XWC6PMQ"]["Help us here:\nhttps://t.co/6afPBKHSoN"]["@PooksMoher Love you back!"]["@dubyone1 Thank you for standing with us!"]["We have a chance for a better Alabama on 12/12. Are you ready? https://t.co/Gr7p5sIgOM"]["Shot / Chaser https://t.co/YOcbwkd7Ky"]["@ShawnCFowler Thank you!"]["Thank you SoS for clarifying this confusion, please keep it up! https://t.co/B4iIziFIB6"]["“Moore’s campaign did not respond to follow-up questions on his voting intentions for renewing CHIP...”- as usual.\n\nhttps://t.co/BqO4KYNFV4"]["“We assume that funding will be continued. What if it’s not? There would be real disruption.”\n\nhttps://t.co/ePzWZJrZxr"]["“We reached out to the Moore campaign for comment about this, but have yet to hear from them.”- Sounds familiar.\n\nhttps://t.co/5HO1xnerhe"]["Honored to have the support of @chicmadesimple and all Republicans crossing over to ensure a better future for Alabama! https://t.co/rpKqQAM0ue"]["This is important. #CHIP https://t.co/gQzyUFe8Pb"]["\"He came here to learn from us, but we also learned from him. He is obviously very well informed on health care issues\" Dr. David Drenning. https://t.co/xA9swBtSE8"]["It’s time for @MooreSenate to leave the swamp and talk with Alabamians about #KitchenTableIssues\n#ALSen https://t.co/HZYuyEZqOc"]["“It's time for Roy Moore to come out of hiding.”\n\nhttps://t.co/IvqW8YKApR"]["Roy’s back from begging McConnell for money with a new set of tweets. https://t.co/8bUlHuAQvL"]["Judges can’t follow personal agendas. That’s why you were removed twice. https://t.co/KEVkYAqwzx"]["\"I want somebody in Washington who's going to represent all of Alabama, not just the segment he deems OK.\"\n\nhttps://t.co/1U7hjxQmli"]["@TerriGaal Thank you!"]["Moore promised he would take down McConnell &amp; now he’s begging for money as we close in.  All hat and no cattle.\n\nhttps://t.co/OqgtxLExVc"]["“A ‘Sen. Moore’ will severely damage the state’s economy and its ability to rewrite its image.\"\n\nhttps://t.co/FyG09hkLdl"]["Not only does @MooreSenate want to undermine Medicare &amp; Medicaid, now he refuses to commit to funding #CHIP for 150k Alabama kids. https://t.co/9i4tsSrODo"]["“He’s not afraid to get his hands dirty and he’s not afraid to get a little sunburn.”\n\nhttps://t.co/DoaVNMDkb4"]["Louise &amp; I are devastated to learn about the terrorist attack in NY. Our hearts go out to the victims &amp; families. Thank you 1st responders."]["The people of AL need leaders who prioritize issues like children’s health care. Our campaign is calling on @MooreSenate to support CHIPs."]["Wishing everyone out there a happy, safe Halloween!! https://t.co/py8v2rufmn"]["Today, we say that there is honor in compromise. Real leaders work together to get things done. https://t.co/h5f6zfma84"][".@RepTerriSewell &amp; I joined the presidents of Alabama State University &amp; Alabama A&amp;M on the field before  #MagicCityClassic2017 https://t.co/D6lgRQ9PRC"]["Attending the #MagicCityClassic2017 with Louise and our friend @RepTerriSewell https://t.co/LgADkfQiZO"]["Louise and I at the Classic in Pink Affair with our friend and Birmingham's next mayor @WoodfinForBham \n#MagicCityClassic https://t.co/ft5mShtgzs"]["https://t.co/s3OsuuGWSB"]["Thanks, Shea!"]["A talented supporter carved this pumpkin!\n\nShare yours and my profile pic could be your design! https://t.co/nzVGj08PIr"]["Proud to have Joe Biden’s support. I will fight for all Alabamians. https://t.co/qe9pmOCfzQ"]["You are the reason for the embarrassment, Roy. #Sad. \n\nLet’s focus on #KitchenTableIssues that will help people. https://t.co/7aBlQabRsL"]["I’ll be on CNN at 1:50 pm CT. \nIt looks a lot different recording it!\nTune in!\nDJFS- https://t.co/hwaC2HdJoN"]["Excited we made it happen! Recording with @PodSaveAmerica \n\nListen in to the latest episode later!\n-DJFS https://t.co/2NGaZVEuK6"]["Today, we have a story to share. https://t.co/OxT0yfEKxQ"]["@JoyAnnReid @DavidYankovich Thanks, Joy.\n\n“There was never a night or a problem that could defeat sunrise or hope”\n\nIt’s time to believe again."]["Speaking in Daphne at Macedonia Missionary Baptist Church was a very powerful moment. We are on the #RightSideOfHistory https://t.co/gxaLbXelEY"]["About to go live with @chrislhayes https://t.co/EIkHe0Qbvp"]["Looking forward to speaking with @chrislhayes tonight. Watch! https://t.co/D9IoaC7NDY"]["Amazing to speak to so many excited supporters at the meet and greet on Dog River in Mobile.\n\nAnd more are still arriving! https://t.co/x5I9Dw3eZs"]["With @FOX10News in Mobile at 5 pm before the start of a fish fry on the Dog River! https://t.co/RkwiVyuFAm"]["Stories like these aren’t unique to Alabama. They are devastating to entire regions, all over America. \n\nThis is important. https://t.co/2QJJjX8qls"]["I visited Courtland &amp; spoke to some who were impacted by the closure of the paper mill. This is our story.\n#KitchenTableIssues\n#ALSenate https://t.co/nFOHcmahMU"]["Yesterday was a packed day w/5 stops in North Alabama. We finished with Dem Club dinner in the Shoals. It was great! https://t.co/1AOl9xj82W"]["It shouldn't be a big ask for people have clean air &amp; clean water. Honored by your endorsement! https://t.co/PGZDHbrSjz"]["@jtudor2002 @HRC Thank you, Jon!"]["Honored to have the endorsement of @HRC\n\nI've spent my life fighting against discrimination &amp; injustices. Equality is not up for debate. https://t.co/fOshfjN3av"]["You talk a big game for someone that can't keep a job. https://t.co/H7xBGoLQ6E"]["Great crowd, great people at the Montevallo meet and greet!! https://t.co/oApocH6bqJ"]["Just another crooked career politician.\n#MooreForHimself\nhttps://t.co/rKzLiFJl4Z"]["@sloppyjonite Thank you!"]["Today, our campaign put its first ad up on TV. Your support means everything, watch below.\n\nhttps://t.co/8WZQvLeBxP https://t.co/l28igzquG5"]["So, if you want to see us fight off Moore, Bannon, &amp; all the extremists of Washington, we need your help! \n5/5\nhttps://t.co/6afPBKHSoN"]["The choice voters make on December 12 WILL define this generation. We have to be on #TheRightSideOfHistory\n4/5"]["While this race is not about me, &amp; it's  certainly not about Roy Moore- it is about what we stand for. \n3/5\nhttps://t.co/04qVHyzPJf"]["If you're embarrassed that Moore could be the nominee for Senate from a major party then we need your help. \n2/5\nhttps://t.co/ZXESsP8NIM"]["We have a lot of work to do &amp; just over 60 days to do it. We have to show the world that Alabama refuses to be embarrassed any longer.\n1/5 https://t.co/1k99VyKvMR"]["@lbweaver Thank you, Lynda!!"]["Our thoughts are with all those on the Gulf Coast as #HurricaneNate makes landfall &amp; urge all of those in the path to be careful. https://t.co/zgRvUBmL6H"]["@sharpstick5 @TuscaloosaDems Thank you, Adam!"]["Women are the backbone of our families, the economy, and our workforce. This reversal is cruel &amp; hypocritical. This isn’t who we are. https://t.co/mk7WuDa9oY"]["#RightSideOfHistory https://t.co/ZwSMWLynUy"]["Nearly 1/3 of children are living in poverty in AL. \n\nThese are literally #KitchenTableIssues I want to fix."]["We have two choices in politics.\n\nHelp people.\nHelp ourselves.\n\nTake a look at Roy Moore’s record and it becomes clear what he cares about."]["#RightSideOfHistory https://t.co/Ii4EVcLsxM"]["Over the last 20 years your income hasn’t grown much, but the cost of everything else has.\n\nI am tired of watching AL get hung out to dry."]["“As you might have noticed, Alabama has become ground zero for the political universe.”\n\nhttps://t.co/B9WbbIehLa"]["Congrats to @WoodfinForBham on his win to become the mayor of Birmingham. Thank you to @WilliamBellSr for your years of service to this city"]["#BidenJonesLive today. https://t.co/Lq5B0Pasi3"]["#BidenJonesLive https://t.co/ihE2MYzHFY"]["@ChelseaBrentzel @whnt Happy Birthday, Nash! https://t.co/NyOy9BR7bH"]["Doug Jones helped remove 40yrs of stain &amp; pain from this state...The Klan needed to know that justice would follow them.\"- @JoeBiden"]["“Doug gives you a reason to believe again.”- @JoeBiden"]["“We are on the right side of history.”  -Doug Jones."]["“They have told me this race is a long shot. It wasn’t the first time someone had told me something was a long shot!”- Doug Jones"]["Watch the event live here!\n-DJFS \n\nhttps://t.co/LpGnRYgYjQ"]["#JonesBidenLive https://t.co/FFUrSfsOvq"]["The crowd waiting for the rally to start!\n#BidenJonesLive\n-DJFS https://t.co/kKaYLeMdnt"]["We are going to go live on facebook for our event with @JoeBiden at noon CT!\n-DJFS\n\nhttps://t.co/6kkCumWUS4"]["So, who is ready for our general election kick-off today? Are you with us? This crowd is!!\n-DJFS\n\nhttps://t.co/FukZubqYoW https://t.co/8f5ptcU1Tk"]["Thanks to the brave first responders who quickly reacted placing their own lives in danger to confront the suspect and save countless lives."]["Louise and I are devastated by the horrific attack in Las Vegas. Our hearts go out to the victims and their families."]["If you’re in AL &amp; around on Tuesday, make sure you come out to see @JoeBiden help us kick off the general election!\nhttps://t.co/Zsz722JDPT"]["Great friends, Sue and Greg from San Diego with us at #BAMAvsOLEMISS https://t.co/Jry9JNClix"]["A fun day at the #BAMAvsOLEMISS game. I met some awesome people! https://t.co/Ud6V4zqI2e"]["I am wishing all those observing Yom Kippur a solemn &amp; reflective day."]["My defining values are “respect and dignity” as well. \n\nWell stated! https://t.co/FhwFCjjumD"]["@MuseofIre @AmyMcGrathKY I’m sorry about your week. Hopefully, it’s better now that the weekend is here!\n\nThank you for your support."][".@JoeBiden is joining me in Birmingham on Oct 3rd. Someone bring the ice cream and aviator sunglasses!\nRSVP⬇️\nhttps://t.co/Zsz722JDPT https://t.co/b74aDuG4LO"]["“The faint jagged scar, about an inch long, is still visible between his eyebrows”\n\nWorking hard leaves its mark!\n\nhttps://t.co/1k6GGqFen6"]["@BaldwinDemocrat Thank you!"]["We just started up our volunteer page on twitter. Follow this page if you want volunteer updates &amp; information! https://t.co/LNJI4KyXwH"]["@Jrwoke Thank you!"]["This race isn’t about me, it’s about us &amp; the type of society we want to live in.\n\nWe have only 74 days. Want in?\n\nhttps://t.co/FukZubqYoW"]["I met some great people yesterday. Nobody should have to “hang their head in shame”.\nWe’re going to change things.\n\nhttps://t.co/bM3qqEjRld"]["@bpmurphree I’ll be sure to live up to that!"]["@charliegus2 @au_grad Thank you, Sandy!"]["@alsmith1966 @MeetThePress That means so much. Thank you.\n\nWe won’t let you down. 1st contribution is a lot to live up to."]["“Doug Jones has spent a lifetime battling for the values of our Pledge of Allegiance”\n\nAnd I will never quit!\n\nhttps://t.co/ZVGKhUyH1k"]["Just spoke to @JamesCarville &amp; invited him to the BAMA/LSU game. He declined because of the whoopin’ they’re going to take from Bama! https://t.co/MYKpNN4md2"]["“I think we all should be investing energy into a seat that we can win,”- @SenBooker \n\nhttps://t.co/j7RIkOoofn"]["@jimv4nde Thank you!"]["“I don’t think that’s the future,”\nWe agree! https://t.co/wnmVUuQ1u7"]["@denisesaturn Thank you for donating to our campaign, and thank you for your service to our country. We won’t let you down."]["I want to take a moment to thank everyone for their overwhelming support. Here is a video we shot today for you. https://t.co/3X8MJSPFu0"]["@chucktodd @MSNBC Also, this is what it looks like behind the scenes. https://t.co/2WjQd70NC6"]["I spoke with @chucktodd today on @MSNBC about important issues in our race. You can watch here.\n\nhttps://t.co/hoTz6yfSDD via @msnbc"]["I am going live with @chucktodd right now. Watch me talk about the Alabama Senate race.\n\nIt begins now. Are you ready?"]["Very excited to join @chucktodd today at 4pm CST &amp; talk about my campaign here in Alabama. Voters have a clear choice 12/12. @MeetThePress"]["This just got real.\n\nWill you join our campaign? \n\nHere is how to do it.\nhttps://t.co/ZXESsP8NIM"]["I stood up to the KKK, I will stand up for Alabama. I will not embarrass you.\n\nIt begins right now.\n\nDonate:\nhttps://t.co/6afPBKHSoN"]["My statement regarding Alabama Republican Senate runoff. https://t.co/olSGrgivyj"]["I want to be crystal clear here, I support the right to protest, &amp; freedom of expression. #TakeAKnee focuses on inequality &amp; injustice."]["For the rest of the week let's focus on unity in sports rather than division. Support our wounded warriors competing in  #InvictusGames2017"]["Proud to be w/AL Rep Anthony Daniels as he accepts a Champion of Women's Health from Planned Parenthood #WePersist https://t.co/tSWqdraQMR"]["Sat in on a great voting rights panel w/Rep Terri Sewell at #CBCALC2017.  Tues 9/26 is Nat'l Voter Reg Day.  Do your part!  #restorethevote"]["Honored to have my old friend VP @JoeBiden to campaign in B'ham Oct 3! #ALSEN #alpolitics #DougJonesforSenate https://t.co/TXJEWVOApy"]["(end) we must heal,not divide; build bridges,not walls &amp; seek justice for all.  Divisions started in the South. Healing can too. #WeRemember"]["(3/?) where we are and where we are going. But today, in light of Charlottesville, there was a sense of urgency that we must do more"]["(2/?) Each year on this day we honor the lives lost -Addie, Cynthia, Carol &amp; Denise- and reflect on where we have been, how far we have come"]["(1/?) It was an honor to escort the wreath set at 16th Street Baptist where a bomb exploded 54 years ago today https://t.co/hdVxncrjCb"]["A monumental case, and life - thank you Edie! https://t.co/Q4blNtbf2L"]["It's 8:46 EDT &amp; even in the wake of Irma we must pause to remember our loss on 9/11, 16 years ago, &amp; renew our vow to stay strong together."]["Really proud of friend and fellow and Alabaman Judge Alan King for calling out the so-called voter fraud commission https://t.co/zOKofv19kv"]["First Harvey, now Irma.Take time to remember our friends in FL as they prepare for the worst &amp; we all pray for the best. #ALSEN #alpolitics"]["My statement on today's DACA action. It's time Luther Strange steps up to do the right thing. #ALSEN #alpolitics https://t.co/7POrpUg1zy"]["(2/2) McConnell's Senate Leadership PAC sinking millions of $$$ to hold on to Luther's no questions asked vote. #ALSEN #alpolitics"]["(1/2) Roy Moore doesn't know DACA but is McConnell teaching Russian to Big Luther? #ALSEN #alpolitics  https://t.co/9qH5XFYVGL"]["Happy to be part of the oldest Labor Day celebration in the country with the Shoals Labor Council #ALSEN #alpolitics https://t.co/cwMDLznTib"]["(3/3) Luther Strange &amp; President Trump to support families &amp; children. #alpolitics #ALSEN"]["(3/3) Luther Strange &amp; President Trump to support families &amp; support children.  #alpolitics #ALSEN"]["(1/3) I am speechless that a candidate for US Senate does not know what DACA is.  I know what DACA is &amp; I support it https://t.co/r1oWlqZGAB"]["Thanks to all for your support. But tonight, let's put politics aside and focus our thoughts and prayers on our fellow Americans in Texas"]["THANK YOU from the Jones family!  It was a remarkable night for us thanks to all of you! And now on to Dec 12! https://t.co/4BK7sRl8F5"]["Very proud of another endorsement! #dougjones4senate Jones, Brooks for Senate | Editorials | https://t.co/h2V6NoErio https://t.co/CPn77DxZPJ"]["We must stop using the term \"white nationalists.\" They are not patriots, but bigoted white supremacists. Call them what they are!"]["Thanks Cathy!! Let's keep our momentum going!"]["Join the movement! Birmingham lawyer and former Clinton appointee Doug Jones seeks Democratic nomination for Senate https://t.co/KfQiEGnFvh"]["Email referencing monkeys angers black Alabama legislators | https://t.co/vaGQmK9c6B https://t.co/3WDDvDKGbe"]["New Blog Post: Historic Birmingham: A Legacy of Lessons https://t.co/0OR6XxkrQZ"]["New Blog Post: John Glenn: A Tribute https://t.co/2GkJIWyzRe"]["New Blog Post: The 16th St. Baptist Church and the Case for National Recognition https://t.co/s73Zl7DcAZ"]["Sad to learn news of the passing of my former boss &amp; 1st female Attorney General, Janet Reno https://t.co/2syDnQMzMJ https://t.co/yeBFQo0wvd"]["I was interviewed this week by NPR about Blanton's denied parole https://t.co/RTMoETy25t"]["Very pleased with the court's ruling: 16th Street Baptist Church bomber Thomas Blanton denied parole https://t.co/vChW3dOsCD"]["@gbdawkins You're absolutely right that the La election is a start.  We'll see what the future hold for Bama.  Thanks!"]["Appreciate the opportunity to comment on @POTUS' important speech within this @csmonitor article. https://t.co/OzPZ1rJ9u8"]["This very important issue about state of our criminal justice system is receiving media &amp; Congressional attention - https://t.co/MwtJGsBNsg"]["Very proud to be included in @B_Metro Magazine's 2015 Fusion Awards list along with my fellow Birminghamians http://t.co/rsIvzEttgk"]["Andrea Taylor will be an asset to the Birmingham Civil Rights Institute having lived the history that BCRI celebrates http://t.co/rwDLzg1mtB"]["I'm honored to be quoted this morning by The Associated Press about the passing of civil rights great Julian Bond http://t.co/6Mfl7WkZWU"]["Today marks the 50th anniversary of the signing of the Voting Rights Act - Lets make sure it remains the law for all! http://t.co/bn8C2QP8hd"]["Alabama lost a great public servant today in the passing of Etowah County DA Jimmie Harp and I lost a dear friend and colleague.  #RIPjimmie"]["Great post by Garden &amp; Gun about South Carolina's decision to remove the Confederate Flag from State House grounds. http://t.co/LUQNkzGk9T"]["I am proud to have been included in this look at the impact that Harper Lee's classic novel had on our culture. --DJ https://t.co/3aDnfgC8LC"]["I'm proud of Governor Robert Bentley's decision to take down the Confederate flag and say so in this Reuter's article http://t.co/rJM6tClqvl"]["Mo'ne Davis and barnstorming Anderson Monarchs tour Birmingham's iconic Civil Rights sites  http://t.co/RDaw5PEIKe via @aldotcom"]["My comparisons on @CNN of 1963 Birmingham church bombing to terrible shootings in Charleston http://t.co/PNyldRVY71 #CharlestonShooting"]["My recent interview on NPR about the tragic event in Charleston http://t.co/uFrKvyTj2b #CharlestonShooting [AUDIO]"]["Beautiful ceremony at Mother Emanuel.  A service of faith, love &amp; forgiveness, exactly as it should be, reflecting the spirit of Charleston."]["We in Birmingham understand the heartache of innocent lives lost in a house of God. Prayers to the victims and families #CharlestonShooting"]