["Promising new estimates predict that more than 90% of American workers will see more take-home pay due to #taxreform.\n \nhttps://t.co/l7dQ6rOBcZ"]["Study: 43% of 2017’s Fortune 500 were founded or co-founded by an immigrant or child of an immigrant. My #StartupAct w/ @MarkWarner, mentioned below, will help immigrant entrepreneurs like Carol Espinosa in KC continue to create American jobs &amp; succeed. https://t.co/RZc79yQPDa"]["Today is #HumanTraffickingAwarenessDay. If you or someone you know is a victim of human trafficking, please call the confidential 24/7 hotline, 888-373-7888, or report it online at the URL below. #EndTrafficking https://t.co/kawujdyu9Q"]["Headed to the Senate floor to discuss my reappointment to @BankingGOP. Pleased to rejoin the committee and look forward to working with my colleagues to oversee and strengthen our financial system. \n\nhttps://t.co/zDBkGlEgpv"]["From the United States Capitol https://t.co/FM16SQFsNw"]["@Marple82 The United States Capitol https://t.co/kJoMP0lxur"]["Met with Secs. Mattis, Tillerson &amp; Chao today to discuss national security, USAID &amp; infrastructure.\n\nMore from Mattis meeting: https://t.co/NOib5rVP6p"]["Live now. Tune in: https://t.co/KKt8JeREhh https://t.co/DEUuZwHfEv"]["SOON: Heading to Senate floor to recap @FarmBureau annual meeting, discuss #NAFTA &amp; highlight importance of getting a bipartisan farm bill to @POTUS's desk.\n\nWatch live ↓\nhttps://t.co/KKt8JeREhh"]["Congratulations, and thank you to everyone @KUMedCenter &amp; @NIH working toward breakthroughs, treatments &amp; cures. https://t.co/CcSimDb8OH"]["With @FarmBureau's annual convention &amp; @POTUS's agriculture speech, there’s a lot going on in the ag world this week. My staff is hosting a booth at the Topeka Farm Show today through Thursday at the Kansas Expocentre – I hope you’ll stop by.\nhttps://t.co/5s9oJ4qla3"]["Great to see you all. Thank you for your constructive insight. https://t.co/TABYGW4eAr"]["I’m glad the women of the 6888th Central Directory Postal Battalion are receiving the dedication they deserve, and I am grateful for their service to our country.\nhttps://t.co/RheuXqzovt"]["Thanks for having me! I appreciate all you do to help Kansans find meaningful employment. https://t.co/KnFNY7A5dy"]["Enjoyed touring @workforcecenter to learn about how it helps develop a competitive workforce by offering veterans services, assistance to people with disabilities, GED resources, resume reviews, mock interviews &amp; skills assessment and testing for Kansans.\nhttps://t.co/IvZzzOrD4e"]["Happy New Year! This is what every rural community wants: a local, fully-stocked grocery store. Congratulations to Iola community leaders and G&amp;W Foods on the opening of this new store. https://t.co/XcM8ka4rUT"]["Good read from @NPR on the reality of early-onset Alzheimer’s. Thanks to the Doolittles for sharing their story &amp; inspiring others to talk about this disease. \nhttps://t.co/rkNrCkg6TG"]["Live now with @Melissa_Brunner on @WIBW's red couch discussing 2017 and what’s on deck for 2018. Tune in! https://t.co/Mxlrq9eD68"]["A thrill of hope, the weary world rejoices.\n\nFrom my family to yours, Merry Christmas. https://t.co/SATdUUXS4w"]["Our nation is blessed with dedicated public servants who work tirelessly to keep us safe. The prevented terror attack in San Francisco reminds us of the importance of the @FBI, law enforcement &amp; our intelligence agencies. They deserve our utmost respect &amp; gratitude."]["Pleased the Senate passed my legislation to designate the Memorial to Fallen Educators at @EmporiaState as a national memorial. This memorial commemorates the sacrifices made by educators who have lost their lives while performing their jobs. https://t.co/gKTNmEb3IP"]["I voted in favor of extending #CHIP funding to ensure no child who relies on CHIP is left without insurance. When the Senate reconvenes in the new year, we must prioritize long-term CHIP reauthorization. https://t.co/3H7d4uUSvj"]["I’m pleased @DHSgov listened to Kansans' concerns and suspended plans to conduct chemical &amp; biological tests near the Kansas border. Kansans deserve a thorough explanation when an event of this magnitude occurs so close to where they live &amp; raise their families. https://t.co/hX3GcuOjdm"]["Congratulations, @SenatorDole. We can’t wait to honor you. https://t.co/1vxEyWGyhD"]["I questioned panelists in a Senate Environment &amp; Public Works Subcommittee hearing yesterday on the importance of remaining in #NAFTA and what the consequences to freight, trucks &amp; waterways might be if the U.S. pulls out of this agreement. https://t.co/e7KITfDOYI"]["@POTUS Pleased to support #taxreform that will encourage businesses to stay in America &amp; create more jobs, better jobs &amp; higher-paying jobs. These jobs &amp; increased paychecks will have a direct impact on middle-class &amp; lower-income families. 2/2"]["The Senate passed historic, pro-growth #taxreform that is fair, simple and works for Kansas families and businesses. I look forward to this bill reaching @POTUS's desk for signature. 1/2"]["I’ve long fought to make certain rural communities are not left behind as technology continues to advance. This op-ed in @TheHill includes my Viewer and Listener Protection Act as one way to close the #DigitalDivide. \n\nWorth a read:\nhttps://t.co/CBM8qbonsA"]["Glad to see @HouseVetAffairs agrees this proposal, similar to S.2193 I opposed in #SVAC, is not the best path forward for veterans. @DeptVetAffairs must transform into a 21st century healthcare system &amp; my bill w/ @SenJohnMcCain takes VA in that direction: https://t.co/1gqQ4QVdaV https://t.co/Pk8qBJwbY7"]["\"Veterans require and deserve the best our nation has to offer, and the VA must not shy away from changes that help them achieve that outcome.”\n\nMore from my joint @USATODAY op-ed w/ @SenJohnMcCain:\nhttps://t.co/hc9T2nSo1P"]["Congress enshrining #NetNeutrality protections based on clear &amp; certain rules into law is necessary to guarantee the internet remains free &amp; open. My colleague @Sen_JoeManchin &amp; I believe there is a bipartisan consensus to be found. https://t.co/JqoZsGmVFL"]["CHIP helps provide healthcare coverage to children in low-income families, and while there are sufficient funds in Kansas to fund CHIP through March, that’s certainly not the case for all states. The time to reauthorize #CHIP is now. https://t.co/Tsq1uHDqdp"]["Working with @SenJohnMcCain to transform the @DeptVetAffairs into a 21st century healthcare system that would increase veterans’ access to care. More on our efforts in our joint @USAToday op-ed: https://t.co/hc9T2nSo1P"]["Good piece from @thehill on importance of immigrant entrepreneurs. My bipartisan #StartupAct, mentioned below, would help make certain America remains the land of opportunity for innovators and job creators from around the world. https://t.co/y0oR0qJTwi"]["My #MGTAct with @SenatorTomUdall will save taxpayers billions by modernizing outdated federal IT systems and strengthening government cybersecurity.\nhttps://t.co/tubm3lqDPi"]["Take a look at the tech &amp; cybersecurity industry leaders who support the #MGTact. Pleased @POTUS signed this vital bipartisan legislation into law to bring our federal IT systems into the 21st century. https://t.co/WocYmnge0q"]["NEW: @POTUS just signed the bipartisan #NDAA to give our troops their largest pay increase in eight years. https://t.co/MZPNQkamiT"]["Good jobs news: '@SpiritAero to hire 1,000 new workers in Wichita’ via @ICTBizJournal https://t.co/xAHHgbSP6q"]["Today, we honor those who fought and died 76 years ago during the attack on #PearlHarbor. This day will forever be “a day in which will live in infamy.” https://t.co/pShVNywTjM"]["Had a productive discussion w/ @SecretaryRoss &amp; members of @SenateCommerce today regarding the ongoing NAFTA negotiations &amp; the potential consequences of NAFTA withdrawal to the Ag community. #Farmers4NAFTA https://t.co/pFHdXxVGfp"]["Last month, I wrote an open letter to farmers &amp; ranchers regarding the threat of NAFTA withdrawal &amp; urging Ag groups to rally folks to speak up regarding the importance of trade in your industry. #Farmers4NAFTA Read the full letter in @agripulse: https://t.co/VJCqB4Kb0L"]["On NAFTA Grassroots Day, I encourage farmers and ranchers to make your voices heard about the importance of trade to the future of a livelihood in agriculture. #Farmers4NAFTA #JustGrowIt https://t.co/x8UvewS77Y"]["While it doesn’t always make for flashy headlines, bipartisanship in Congress is imperative – and it still exists. I’m proud to join this bipartisan financial reform effort with 10 of my Republican &amp; 10 of my Democrat colleagues. https://t.co/LYkzM1wz4Q"]["More on my bill with @SenJohnMcCain to reform the @DeptVetAffairs, via @CJOnline: \nhttps://t.co/PzosyMG3kD"]["Intro'd bill w/ @SenJohnMcCain to transform @DeptVetAffairs into a modern, veteran-centric system that will increase veterans' access to quality care inside the VA &amp; in the community. Proud to have support of @AmericanLegion, @ConcernedVets &amp; @AMVETSHQ. https://t.co/1gqQ4QVdaV"]["Senate #TaxReform plan strengthens the economy by: \n▪️incentivizing companies to stay in America;\n▪️encouraging local businesses to grow;\n▪️creating good-paying jobs."]["Senate #TaxReform plan works for families by: \n▪️doubling &amp; strengthening the #ChildTaxCredit;\n▪️creating an employer credit for paid family &amp; medical leave; \n▪️preserving the adoption tax credit."]["Pleased to support a fiscally-responsible, pro-growth tax reform bill that benefits middle-class families and enables businesses to compete in a 21st century economy. https://t.co/j8cGJJpRU9"]["An open letter to Congress signed by 137 economists supporting the Senate’s tax reform bill: “The enactment of a comprehensive overhaul – complete with a lower corporate tax rate – will ignite our economy with levels of growth not seen in generations.” https://t.co/F6XTZjuXps"]["2.2 million babies, who would’ve otherwise been infected, have been born HIV-free thanks to @PEPFAR’s work to #EndAIDS. #WorldAIDSDay https://t.co/tMBanncgaU"]["Officer Arterburn, you are the embodiment of a true public servant. Welcome home! https://t.co/u6jITdG4bR"]["I look forward to continuing the tax debate in an open &amp; transparent fashion. I am still discussing ways to improve this bill before final passage &amp; expect to support a bill that grows the economy, protects taxpayers, creates jobs &amp; helps Americans keep more of their money. (2/2)"]["I have spoken with hundreds of Kansans at townhalls and meetings across the state regarding #taxreform and ways to build a tax code that works for them. Today’s vote signals a significant step forward in achieving tax relief for families in Kansas and across America. (1/2)"]["Disappointed by today’s outcome in VA Committee markup. My amendment to the base bill would improve vets’ access to timely, quality healthcare within VA and in the community, enhance care coordination &amp; correct payment rates to critical access hospitals (key in rural America)."]["Had a productive discussion at my townhall in Clay County, including the need to preserve graduate student tuition waivers. As a former GTA, I know how tight money can be for grad students, which is why I’m pleased the Senate’s tax plan maintains this waiver. https://t.co/YzT0ku4PMc"]["Good read: A growing number of young Americans are leaving desk jobs to farm via @washingtonpost https://t.co/SstcDZ4J24"]["Kansas kindness on full display this #GivingTuesday. Proud to represent a great state full of such generous people. https://t.co/1JMUihjKGS"]["Seeking answers regarding reports of an @Uber data breach – involving personal info of 57 million customers including names, email addresses and mobile phone numbers – w/ @johnthune, @OrrinHatch and @BillCassidy. https://t.co/sDzqXTfrzz"]["It’s #SmallBusinessSaturday — make sure to #ShopSmall and support local business."]["MORNING READ: U.S. Growth Forecasts Are on the Rise via @WSJ https://t.co/CQLGyElCLP"]["Good #jobs news in Wichita: https://t.co/lMguaddeZa"]["@SenatorTomUdall More on the bill: https://t.co/HiDjG9QA0A"]["My bipartisan #MGTAct w/ @SenatorTomUdall passed the Senate in #NDAA to propel our outdated federal IT systems into the 21st century to promote productivity &amp; strengthen cybersecurity. These improved efficiencies save billions of taxpayer dollars by reducing long-term spending."]["Passed ✅ cc: @SenatorTomUdall https://t.co/HiDjG9QA0A"]["Soon → I’m chairing a Senate Appropriations Subcommittee hearing on @DeptVetAffairs efforts to prevent and combat #opioid overmedication. Watch live at 2:30 p.m. CST:\nhttps://t.co/iEECNfjqxb"]["Imagine what you could do with an extra $2,500 in your pocket each year. #TaxReform https://t.co/tQcEQ9jSad"]["Important #taxreform read: “Middle class biggest winners in Senate tax plan, study says” via @politico https://t.co/pcDzVnZ2nP"]["To our veterans: a grateful nation offers our salute to you today. Thank you for answering the call to defend our country. We respect you, we thank you for your service and we love you. #VeteransDay https://t.co/3vjCrx8Kva"]["Our tax code should work for Kansans, not against them. I am committed to creating a fairer, pro-growth tax code that helps Kansas families keep more of their paycheck. #TaxReform https://t.co/T9wA4IE0y7"]["Bipartisan #MGTAct would modernize our outdated federal IT systems and strengthen our cybersecurity capabilities, all while reducing our long-term spending."]["Pleased Senate &amp; House conferees reached a consensus on my #MGTAct to bring our federal IT systems into the 21st century. Look forward to this legislation receiving the consideration it deserves on the Senate floor. https://t.co/ARMZFKHCWQ"]["“Sen. Jerry Moran...pressed the Yahoo and Equifax executives on whether consumers can expect their data to be safer today in the wake of the breaches. Verizon's chief privacy officer, Karen Zacharia, stumbled and stopped short of saying yes.\" More: https://t.co/yIpjI7aWUs"]["Me too – thanks for setting such a great example, Rachel! #ElectionDay https://t.co/X057wr7bse"]["It's #ElectionDay – I hope you'll exercise your right to vote and make your voice heard today. More info here: https://t.co/Tc4rrUkjwx"]["\"There wasn’t a person that just stopped for a handout. It was just roll up your sleeves and get to work.” https://t.co/tWrpBNXl69"]["KS ranchers' stories &amp; resilience helped @RogerMarshallMD &amp; me craft legislation to aid them in times of need. More: https://t.co/tWrpBNXl69"]["It's imperative to the Kansas aviation community that we reject calls for privatization. https://t.co/HYuZ6NKtI9"]["@RogerMarshallMD @usdafsa This legislation would ease the burden on Kansas farmers &amp; ranchers in future disasters &amp; improve recovery programs. https://t.co/qOf0xqXj42"]["@RogerMarshallMD @usdafsa Bills would also create the option for upfront fencing payments through the Emergency Conservation Program + raise the ECP payment limit."]["@RogerMarshallMD These bills would allow partial payments from @USDAFSA's Livestock Indemnity Program to help w/ lost cattle + double the payment limit."]["@RogerMarshallMD Thanks to @RogerMarshallMD for joining me to work on behalf of our KS ag community &amp; make sure our federal recovery programs work for them."]["Intro'd bills w/ @RogerMarshallMD to help KS farmers and ranchers recover and rebuild from natural disasters. https://t.co/d54RQvIYgC"]["Proud to sponsor this resolution. https://t.co/CMS3hFhk6g"]["Grateful to Officer Nash &amp; first responders who stopped this cowardly attack. My prayers are with New York. https://t.co/HDiveLK9tD"]["Looking forward to watching the @Chiefs honor our local service members &amp; @FightingFirst on #MNF tonight. #StrongEurope #ChiefsKingdom https://t.co/GOApYPjhZK"]["Heartwarming.\n\nhttps://t.co/eFlVNtyntq"]["@POTUS Our work isn't done until we stop losing our loved ones to addiction. Will continue working w/ my colleagues &amp; admin to curb opioid abuse."]["I commend @POTUS for declaring #opioidcrisis a public health emergency &amp; am encouraged by his commitment to address this epidemic head-on."]["Across America, the #opioidepidemic is ripping families apart, and far too many Kansans have lost loved ones to overdose. https://t.co/dnJjRWN4jr"]["Meeting with these impressive young Kansans is always one of my favorite events of the year. https://t.co/OBLg3MAM04"]["Science has the power to change the world. Thanks for the productive discussion today, @scicoalition. https://t.co/jRllrvNvTe"]["The U.S. has the largest &amp; most efficient capital markets in the world. New bill to help renewable energy companies access these markets. ↓ https://t.co/jrjMISBC80"]["Closing the #DigitalDivide is key to retaining &amp; recruiting businesses. More on my ValuNet tour via @emporiagazette: https://t.co/4tapOW1K0r"]["Impressed by the young Kansans who applied to our U.S. Service Academies. Take a look at their inspiring stories: https://t.co/Na8ZLB1Kek"]["Led KC-area colleagues in sending bipartisan, bi-state\nletter to @amazon, urging it to consider KC for #AmazonHQ2. https://t.co/Ym64pPZ5mu"]["The #StartupAct is \"a valuable initiative to help reduce many barriers for...small biz owners” -- @kcchamber https://t.co/h9w3tlYKqx"]["Glad I could spend the lunch hour with Kansas Cadets @WestPoint_USMA while here for Board of Visitors meeting. Proud of them. https://t.co/jDqJh7S1rL"]["Our tax code should work for American families, not against them. #TaxReform https://t.co/GCMWunTEnx"]["Tonight I voted for and the Senate passed the FY2018 budget as first step to accomplishing tax reform. My statement: https://t.co/pXdtUUFEtb"]["Thanks to @FortHaysState Finance &amp; Econ Club students for stopping by my office today for a Q&amp;A. https://t.co/H1pgQHT1f1"]["Sent a letter to @Amazon with my KC-area congressional colleagues today urging company to consider Kansas City for #AmazonHQ2. https://t.co/1YEngrq0k3"]["Well-deserved, @SenJohnMcCain. Thank you for your decades of service to our great nation. #LibertyMedal https://t.co/qIYmDGYB17"]["NOW: Introducing Kansan Holly Teeter at @senjudiciary confirmation hearing. Watch live: https://t.co/8cT8leiXWY"]["This is a non-starter. https://t.co/ZW5Hq1rcWj"]["Nearly 1 in 6 Kansans live in hunger. Intro’d bipartisan bill to help get healthy food to Kansans' tables. #WFD17 https://t.co/bTEyz14x07"]["What an impressive group of students – thanks for having me! https://t.co/tGM7ayuPpy"]["Eradicating hunger is key to worldwide economic stability. Kansas will continue to feed the world to promote peace. #WFD2017 https://t.co/MG8oYifsyy"]["On #NationalFarmersDay, I am especially proud to be a Kansan and to represent farmers who feed the world. https://t.co/cmNWP6BjIg"]["Robocalls are irritating – and often, illegal. Working w/ @SenJohnThune to identify ways to curb this behavior. https://t.co/IjKXmmGBrB"]["Afternoon read: ‘Kansas’ software industry outpaces nearby states’ via @KCBizJournal https://t.co/2P3ye2AQam"]["Impressive partnership between the @Chiefs, @TheVFoundation &amp; @KUHospital to battle cancer. WATCH: https://t.co/z1BXzdBvnq"]["As a Kansan, I've always seen the opportunity for agriculture in America to feed not only ourselves, but our world. Thank you, @WFPUSA. https://t.co/ij3OOIG3TE"]["Great news! Glad to see you home, @SenatorDole. https://t.co/p004RK3Yt0"]["Honored to meet KS veterans this morning at the #WWIIMemorial for an Honor Flight. Always inspired by our heroes' stories and sacrifices. https://t.co/zWejrRA8Tf"]["Eradicating hunger is not a partisan issue – it's a humanitarian issue. Thank you, @WFPUSA &amp; @WFPChief, for fighting to achieve #ZeroHunger. https://t.co/0SK0SQuKtT"]["Privatizing the world's most complex air system is nothing more than a solution in search of a problem. CC: @Garmin https://t.co/d5Chs33NPJ"]["Why we need #StartupAct: \"China is now closing the gap w/ the US when it comes to minting new $1 billion startups.\" https://t.co/mIGAACJgpV"]["Companies less than five years old yield almost all new net job creation, per @KauffmanFDN. More on my #StartupAct: https://t.co/XTmWCWHYqF"]["Congratulations to KS native, @AjitPaiFCC, on @FCC confirmation. Look forward to working together on expanding rural broadband nationwide."]["A native of Parsons, @AjitPaiFCC brings a unique understanding of challenges facing rural America in a quickly-evolving telecomms world. https://t.co/RsuvyFXuL9"]["Headed to the Senate floor to talk about why @AjitPaiFCC is the right choice for the @FCC. Tune in → https://t.co/5a1go5ZiwQ"]["Robba and I extend our deepest condolences to the #LasVegas victims. Our prayers are with you and our thanks are with the first responders."]["Time to drop controversial proposals to privatize air traffic control system &amp; end habit of short-term FAA extensions. https://t.co/F5MvtiYRPR"]["Thank you for the support! Look forward to working with you on #StartupAct. https://t.co/GIHnDJvBNr"]["Asked @SecShulkin why @DeptVetAffairs has so many mental health job vacancies – VA must fill vacancies to help vets. https://t.co/b4RtzAuOH1"]["Intro'd bipartisan #StartupAct w/ @MarkWarner, @RoyBlunt &amp; @amyklobuchar to encourage innovation and help startups grow &amp; thrive in America."]["America is in a startup slump. Intro'd bipartisan #StartupAct to encourage creation &amp; growth of new businesses. https://t.co/m6Tv9kso5e https://t.co/gBpwfWCgTA"]["#TaxReform is long overdue. I look forward to discussing ways to fix our broken tax code w/ my colleagues and Kansans over the coming weeks. https://t.co/jFNBc3g0mL"]["Americans deserve:\n✅more jobs,\n✅fairer taxes,\n✅bigger paychecks.\n\nThe time for #TaxReform is now. https://t.co/lcwn4RzmxW"]["Met with KS Principal of the Year, Benjamin Jimenez, on importance of career &amp; tech ed. Thanks for all you do for @OberlinUSD294 students. https://t.co/mqBMHXdkHE"]["Reminder: Service Academy applications due to my office this Friday. More info: https://t.co/0UFZD83Gi7"]["Great piece by my friend and @FCC Chairman @AjitPaiFCC on importance of bridging the #DigitalDivide: https://t.co/cqnnzDklHf"]["Held a Conservation Tour – my 12th – in Riley, Wabunsee, Geary &amp; Pottawatomie Counties last week. Take a look: https://t.co/xpZeD5QHDy"]["@SalvationArmyUS More on my work to eradicate food deserts and fight hunger in KS: https://t.co/TAE04UTaWD"]["Nearly 1 in 6 Kansans are food insecure. Appreciate @SalvationArmyUS reminding policymakers/biz leaders to #FightForGood against poverty. https://t.co/qKDxxbzMmT"]["Congratulations, Allen County! What an honor. Thanks @ThriveAllen &amp; @RWJF for including me in #CultureofHealthPrize celebration this week. https://t.co/vDCIA3vxi4"]["Thanks, @tonyscottcio! #MGTAct is a great bipartisan solution. Will modernize gov't IT while reducing long-term spending. https://t.co/M24wHsh1mg"]["We must remain vigilant in protecting Americans from fraud in wake of recent hurricanes. Letter to @FTC w/ my @SenateCommerce colleagues: https://t.co/iCfFdsG1KR"]["My #MGTAct w/ @SenatorTomUdall is \"a way to both strengthen cybersecurity &amp; reduce federal spending.\" via @thehill https://t.co/rmT55nAqB1"]["Included in #FY18NDAA → my amendment permitting #veterans to have access to military records regarding exposure to toxic substances. https://t.co/3hBjdSIWGp"]["BREAKING: #NDAA included my MGT Act w/@SenatorTomUdall to modernize outdated federal 💻, eliminate wasteful 💲 &amp; strengthen cybersecurity."]["Met with midshipmen from KS @NavalAcademy. There are 29 Kansans currently enrolled, and I'm pleased with how well they represent our state. https://t.co/gNLDtSm7Wx"]["New video filmed during my time in Afghanistan w/ @UnderSecArmy to assess our current #Afghanistan strategy. https://t.co/cepc8ZRzcE"]["Congratulations, @SenatorDole! Can't thank you enough for your leadership over the years, but I hope this is a good start. https://t.co/AKURuFGHeO"]["Grateful to see members of the @FightingFirst arrived safely in Poland to boost @USArmy deterrence. #StrongEurope https://t.co/II1ruIAXQd"]["On #POWMIARecognitionDay, we pause to remember all who have served and those who were captured or remain missing. #YouAreNotForgotten https://t.co/ugTQgAVUYc"]["An aggressive exercise by Russia, worth a read: Russia’s War Games With Fake Enemies Cause Real Alarm via @nytimes https://t.co/xVSrttkP46"]["Robba and I are praying for this solider's family. Kansans are grateful to this solider for their selfless service.\nhttps://t.co/WYToOHZnva"]["Thanks for stopping by to discuss @NIHFunding. I'm proud of the progress being made in the quest to cure cancer. #CancerProgress17 https://t.co/9jU43H7m4G"]["NEWS: @DeptVetAffairs is a opening Veterans Crisis Line call center at the Topeka VA. #BeThere\nhttps://t.co/YatDIJULSC"]["As Senate Aerospace Caucus co-chair, aerospace cybersecurity &amp; managing increasing threats are a top priority. More: https://t.co/YTdVTfBMHv https://t.co/7VVmyeYqra"]["In times of extreme devastation, Kansans refuse to shy away. Thanks to those who traveled to help recovery efforts. https://t.co/dSSHylu5gD"]["Today we remember those who tragically lost their lives 16 years ago. Thankful for our heroic first responders. #NeverForget https://t.co/drQkEcCe0i"]["Spoke with @kansashospitals leadership in Wichita this AM. Access to and quality of community care impacts the well-being of every Kansan. https://t.co/IbotQZfdCE"]["Had a great time thanking Kansas veterans at an Honor Flight this morning. These guys are popular – check their paparazzi! https://t.co/X9zwibdUoo"]["Glad to see @POTUS nominated Wichitan John Broomes to be Federal District Court Judge for Kansas. More:\n\nhttps://t.co/46o3aHfxVg"]["Please keep our deployed Kansas guardsmen and women in your thoughts as Irma approaches. \n\nhttps://t.co/JaIMvYJ30C"]["There are 21 separate terrorist groups we're fighting in Afghanistan. We are making a difference there.\n\nhttps://t.co/DrUYmpg13L"]["I hope we can all learn from the kindness exhibited by these Kansans – appreciate their “pay it forward” attitudes. https://t.co/hIn6Fg8BP5"]["“Moran sees progress in Afghanistan, but also the need for more U.S. troops” via @MilitaryTimes  \n\nhttps://t.co/DrUYmpg13L"]["Met &amp; thanked KS soldiers in Europe last week: SSG Nilges, SSG Lawson, SGT Throener, SGT Comer &amp; SPC Gianelloni. You make Kansas proud. https://t.co/V8QcBgPk9m"]["The annual Patriot Day Career Fair is Thursday in Junction City. Doors open for servicemembers &amp; veterans at noon, general public at 1 p.m. https://t.co/Q9ssl4Wb2y"]["Visited @USArmy at Bagram with @UnderSecArmy. Thank you, @MarneCG, for hosting us and providing important updates. https://t.co/zvbbLAljFW"]["More on my visit to Poland with @UnderSecArmy. #StrongEurope \nhttps://t.co/ryseIFRvrv"]["Spent #LaborDay weekend in Afghanistan meeting with brave men &amp; women of our @USArmy. It was an honor to listen &amp; learn from them. https://t.co/LKdkqsNozK"]["I have been extremely impressed with the men &amp; women I’ve met with of @USArmyEurope. cc @UnderSecArmy #StrongEurope https://t.co/iXxtPhaEcO"]["More on my trip to @USArmyEurope with @UnderSecArmy here: https://t.co/jmJKG9ARw7"]["We must attack opioid epidemic holistically: sustaining NIH funding, investing in mental health &amp; improving healthcare. #OverdoseAware2017"]["TONIGHT: My friend and Kansas farmer Justin Knopf will be featured in @Discovery's #RFFDiscovery documentary. Tune in at 8 p.m. 🌾 https://t.co/fBjlRKoduV"]["On #OverdoseAwarenessDay, let's remember those we've lost and remain steadfast in our commitment to face the opioid epidemic head-on."]["\"We still have work to do.\"\n\nGreat read by @CoachBillSnyder. https://t.co/ZHAJ6i6v13"]["Had an informative visit at @USArmyEurope with @UnderSecArmy and Commanding General Hodges. #StrongEurope https://t.co/5IwoaIVmCd"]["Great to join you! #StrongEurope https://t.co/5bT4ueVMrw"]["Headed overseas to meet with deployed Kansas servicemembers. Looking forward to thanking them on behalf of all Kansans."]["In this week's #KCS: Hosting @ArmyChiefStaff at @FightingFirst, Kansas Listening Tour stops in Goodland &amp; Healy. https://t.co/DwPgAHBMS6"]["I’m always moved – but never surprised – by Kansans' compassion and kindness in times of need. #HoustonStrong https://t.co/nk4jPFy7Y1"]["Yet another reason why sustained @NIH funding is imperative -- a #Zika vaccine is coming soon. https://t.co/w2sk51JBxk"]["My thoughts &amp; prayers remain with Houston. Visit https://t.co/3InhuD8SXu for info on how to help. #HoustonStrong https://t.co/U0CFcdTMHl"]["Thanks to all who attended my Listening Tour stop in Goodland today. We had a good discussion about healthcare, tax reform &amp; foreign policy. https://t.co/NIMaRvCQkq"]["Thank you for visiting @FortRiley and for your commitment to the well-being and care of our soldiers and their families, @ArmyChiefStaff. https://t.co/DKjVEvfos9"]["Great KC jobs news! This report further proves why Congress must support startups. Graph ↓ courtesy of @KCSourceLink https://t.co/5QkX9YifEb https://t.co/74jA5REL1z"]["Sustained #NIH funding is imperative to curing diseases &amp; improving the lives of those we love. My @LJWorld op-ed: https://t.co/g6shb0PX2B"]["Received classified intelligence briefing on the growing threat of North Korea's nuclear capabilities today. MORE: https://t.co/pmOJ7LlVYh"]["SOON: #SolarEclipse2017 makes its way through Kansas. Marysville's black squirrel statues are ready to go – “eclipse shades” and all. https://t.co/Lq3pjgduBH"]["I appreciate that even when Kansans disagree on issues, we still have good dialogue. More from my Topeka townhall: https://t.co/tCRCQZwXEI"]["White supremacy, bigotry &amp; racism have absolutely no place in our society &amp; no one - especially POTUS - should ever tolerate it. Full STMT: https://t.co/dufC1MGWgB"]["Hosted townhalls last week in:\n✔Barton\n✔Cheyenne\n✔Rawlins\n\nWe discussed veterans &amp; health care, research. More: https://t.co/mo5FWjywLQ"]["What happened in #Charlottesville is a sobering reminder of the hateful element that exists in America. Bigotry &amp; racism have no place here."]["Great Bend Tribune: \"Moran supports extending Veterans Choice Program\" https://t.co/wWBaNKdCDx"][".@newspressnow on my bill to help Kansans access healthy food: \"Food needs real in desert\" https://t.co/Oky8fB2VHC https://t.co/PrGPRW7wgi"]["Met with KC entrepreneurs &amp; startups today to discuss recruiting/retaining talent &amp; tax reform. Thanks @KauffmanFDN for helping organize. https://t.co/UwWciTT09b"]["Saddened by the news of my friend Bob Schmidt’s passing. Bob was a staple in the Hays community. He will be missed. https://t.co/kt9YevAFb7"]["Early morning respect at the Korean War Veterans Memorial in Johnson County. https://t.co/ddPuW0t280"]["Encourage you to read @ScottCanon article. Access to food is vital. See my bill on helping food-scarce communities → https://t.co/oLYJevofae https://t.co/aWwlhEfmnF"]["Congrats to Kansan Brian Boisvert on joining @FCC working group to streamline broadband infrastructure on fed lands. https://t.co/6ykWmb6VaX"]["Great tour of Topeka Regional Airport this morning. Runway serves heavy military aircraft &amp; can land heavy civilian aircraft when needed. https://t.co/B4lSCqIZZz"]["Great meeting w/ reps. from disability developmental agencies to discuss how healthcare policy must prioritize individuals w/ disabilities. https://t.co/LhjSUCyvhe"]["Had a productive discussion today at my Geary County townhall regarding Ft. Riley &amp; local vet issues. Thanks to the 80+ folks who attended. https://t.co/82ZD28ncxY"]["Insurance fraud hurts insurers &amp; consumers. Convened @SenateCommerce subcommittee hearing today on curbing fraud. https://t.co/FjWrlkphnj"]["BREAKING: The Senate just voted to award the Congressional Gold Medal to @SenatorDole. Looking forward to the House following suit."]["Convening hearing in 5 minutes. Tune in! https://t.co/2Ed6OEJOsq"]["SOON: Calling to order my @SenateCommerce subcommittee hearing on insurance fraud in America. Tune in live at https://t.co/2vEsWTwKFK."]["NEWS: Last night, the Senate unanimously passed Veterans Choice legislation. A timeline of my work on the program → https://t.co/okboyRhY5u"]["Happy #StartupDay to the Kansans who relentlessly pursue new ideas and strive to improve our communities, nation, and world."]["👊 https://t.co/3wtmWLRgRZ"]["#KansasCommonSense: healthcare update, advocating for veterans' care, honoring @SenatorDole, Wilson townhall meeting https://t.co/BFi5FWml4r"]["Speaking on Senate floor shortly about the importance of the @DeptVetAffairs Choice program in helping veterans nationwide access care."][".@GovSamBrownback has long been a fighter for the persecuted - will be tireless, effective Ambassador for International Religious Freedom."]["I support a full repeal of Obamacare &amp; will continue to oppose the BCRA. Here is my full statement: https://t.co/96EnYVVf8m"][".@SenatorDole dedicated his entire life to public service &amp; it's hard to imagine anyone more deserving of this honor https://t.co/AC8uv3byna"]["Happy 94th birthday, @SenatorDole! Thank you for your continued service to Kansans and for spending your time with our nation’s heroes. https://t.co/PdRmlXAETj"]["Had the chance to introduce friend &amp; fellow Kansan @AjitPaiFCC to my colleagues on @SenateCommerce yesterday. https://t.co/zMTqtNOSjq"]["If anyone can beat this, it's John McCain - whose bravery has shown he can overcome any obstacle. Robba &amp; I will be praying w/ John &amp; Cindy."]["My full statement opposing this version of BCRA: https://t.co/CUq4Kibe0I"]["For the same reasons I could not support the previous version of this bill, I cannot support this one. #HealthcareBill"]["My colleague @SenMikeLee and I will not support the MTP to this version of BCRA. #HealthcareBill"]["Deeply saddened to hear of the fatal plane crash in Atchison County. Please keep their families in your prayers. https://t.co/XmYvUo6Zm8"]["Thanks to @RepThompson, @repdonyoung &amp; @RepWalterJones for introducing this important amendment in the House. https://t.co/yVthnEPSqR"]["The Senate Approps committee approved my bill to construct a new combat arms facility at McConnell Air Force Base: https://t.co/tveeb1UB1t"]["More well-deserved accolades for @joeskc – might have to stop in for a Z-man to celebrate. https://t.co/7KE9eWXayg"]["Looking forward to having you back in KS! https://t.co/8ECmqfjek8"]["I support the decision to delay the August work period so the U.S. Senate can accomplish the work the American people expect it to."]["Honored to serve on the @WestPoint_USMA Board of Visitors. #GoArmy https://t.co/P51S26MNTU"]["This week I attended my first board meetings at West Point led by Lt. Gen. Bob Caslen, the 59th Superintendent of @WestPoint_USMA. #GoArmy https://t.co/2CqtPECMX1"]["Honored to be presented w/ the Vietnam Veterans of America Legislator of the Year Award from Natoma resident Larry MacIntire. https://t.co/gbkYkG0JMZ"]["My full statement regarding reports of cyberattacks targeting nuclear power plants, including Wolf Creek in Burlington, KS: https://t.co/dfFr7LGXtZ"]["Reports of cyberattacks on the Wolf Creek power plant in KS are concerning &amp; a serious threat to national security. https://t.co/xNmPCbzAlh"]["Last week I questioned reps of @NIH on the status of research in regard to Alzheimer's &amp; ways we can help to #ENDALZ https://t.co/bzyx0I6e7E"]["Full statement on Senate healthcare legislation: https://t.co/R9XFCa5p1F"]["I am pleased with the decision to delay the vote – now is the time to take a step back and put the full legislative process to work."]["The Senate healthcare bill missed the mark for Kansans and therefore did not have my support."]["Calm before the storm. Ready to get to work. https://t.co/YAq73Kg4hs"]["ICYMI: I joined @MariaBartiromo on @FoxNews to discuss the Senate #HealthcareBill. Take a look: https://t.co/if7lKpevEl"]["Thanks for having me. Enjoyed the important discussion. https://t.co/tKJlM7nSra"]["If this bill isn’t good for Kansas, it isn’t good for me. #healthcarebill https://t.co/gkjI3WK9Gx"]["I will continue to press the @DeptVetAffairs as we work toward preserving the Veteran Choice Program. cc @hopeyen1 https://t.co/YTkt69IRiz"]["Today marks 242 yrs of service for @USArmy! Thx to all who serve including the brave men &amp; women at @FortRiley &amp; @FortLeavenworth! #ArmyBday"]["Shocked &amp; saddened by this AM's shooting, praying for all impacted. Thankful for efforts of those working to keep Congress &amp; staff safe."]["Pleased the House passed my @DeptVetAffarirs Accountability &amp; Whistleblower Protection Act. Important step to help earn back our vets trust."]["Questioned @StateDept Secretary Tillerson &amp; @SecretarySonny today during two critical Appropriations hearings on the FY18 budget. https://t.co/bLEksEyadD"]["USCP will not request $$ via phone to settle warrants. If you receive call, alert the FCC at 888-225-5322 or here: https://t.co/D6MRMHJHak"]["Scammers reportedly impersonating @USCapitol Police (USCP), targeting victims to settle fictitious warrants. https://t.co/WlrrQbJD6l"]["China offers great potential for beef sales. New opportunity in this market will boost ag community &amp; nat'l economy. https://t.co/AaWnuIvCiu"]["Thanks to all who joined my townhall meeting in Johnson County this morning to share feedback. Appreciated the passion &amp; perspectives. https://t.co/ChuNRQukgs"]["Happy 100th to the @FightingFirst! Today we honor the sacrifice and efforts of all who have served and continue to serve @FortRiley. https://t.co/DeFTIakkDN"]["Enjoying meeting students from Rock Creek Jr. Sr. High School in St. George &amp; Smoky Valley High School in Lindsborg touring D.C. this week. https://t.co/xr8qbRF4R0"]["When it comes to Air Traffic Control, I trust Congress to represent interests of the American people more than a 13-member corporate board. https://t.co/LYoYJEwDkE"]["This week’s #KansasCommonSense: completing visits to all 127 Kansas hospitals &amp; experiencing a Scorpion demo flight. https://t.co/9WJDOgRjhH https://t.co/pBwcFySj91"]["God bless all those who served on #DDay and were successful in bringing World War II to an end. Their sacrifice made all the difference. https://t.co/I558ifA2F2"]["Proposals to privatize #ATC threaten reliable transportation options provided by small airports &amp; general aviation for millions of Americans https://t.co/rgssKpr464"]["Honored to introduce Brigadier General Pat Frank as he threw the first pitch at the opening game for the @jcbrigade tonight. https://t.co/8f68MytiyD"]["Celebrated hard work of @SpiritAero employees on the B-21 Raider –continuing Wichita's legacy in safeguarding our military's superiority. https://t.co/sq5viwP7vY"]["Airborne at @TextronAviation in Wichita - thanks to Lyons native Aaron Tobias for piloting my flight in the new Scorpion jet. https://t.co/GLUIML143f"]["Through global agriculture development, we can expand opportunities for Kansas farmers &amp; combat world hunger. More: https://t.co/xNOtw7TORf"]["Engaging discussion at the Leawood Rotary Club this morning – focused on local community projects and efforts to eliminate polio globally. https://t.co/ii4zeWbxwj"]["Getting advice from a guy who knows how to get things done. https://t.co/Y8IDD34uHP"]["House's bill is not the solution. Shared my vision for #healthcare reform the Senate must craft on the floor today: https://t.co/omV9ODxnrm"]["Congrats to @KUnews' new Chancellor Dr. Doug Girod. Have enjoyed working with you at @KUMedCenter &amp; look forward to your strong leadership. https://t.co/05uYjjZUgs"]["Veterans who serve other veterans are to be cherished – look forward to commemorating @AmericanLegion’s centennial. https://t.co/x7u8ZdzYJW https://t.co/IhfnNR833Y"]["Met with former Secretary of State @Madeleine Albright this week – we share the view that America is a force for good in this world. https://t.co/umT0rhDVKC"]["It was an honor to spend time today w/ WWII, Vietnam &amp; Korean War veterans visiting D.C. from Kansas &amp; share my thanks for their service. https://t.co/F15CEbCn9I"]["Kansas' economy depends on strong trade relationships. Full statement on the administration's plans to renegotiate #NAFTA. https://t.co/VyoWJrs85Q"]["Remembering Det. Brad Lancaster, Capt. Robert “Dave” Melton and MDS Brandon Collins as we commemorate National Police Week. https://t.co/kWkFtq5WL8"]["Praying for all those impacted by the Barton County tornado last night - thankful for the first responders pitching in to assist. https://t.co/CIv4iqg3tq"]["This week’s #KansasCommonSense – meeting w/ healthcare providers, discussing veterans’ care w/ @SecShulkin &amp; more. https://t.co/9Ka4DaQCvr"]["Kansas' economy relies on our ability to export products we grow and manufacture around the world. Strong trade agreements help create jobs. https://t.co/czUztQy7Kl"]["American food aid has the potential not only to save lives, but also to prevent the need for military intervention across the globe. https://t.co/ThRKYLQ8RX"]["Asked @SecShulkin to stop by despite canceled hearing—partisan games won’t impede our efforts to improve care for our nation's #veterans. https://t.co/HPyi7A8BVw"][".@SecShulkin Impeding the Senate's ability to get work done on behalf of the American people in committee hearings hurts us all."]["Political theater now stopping VA Committee from hearing @SecShulkin answer Qs on future of veterans' care &amp; #Choice. Hurts veterans."]["This week’s #KansasCommonSense: my take on #AHCA, importance of @NIH investing in the future &amp; a weekend in Kansas. https://t.co/eMmQF9gZN3 https://t.co/0h6RwTSrPF"]["Honored to preside during Heather Wilson's confirmation to be the next @USAirForce Secretary—I look forward to hosting her soon in Kansas."][".@NIH funding that passed this week brings new possibilities for @KUMedCenter doctors &amp; researchers working on cures. https://t.co/AklALLKCB6"]["Convened a hearing yesterday on VA telemedicine w/ @SenBrianSchatz—hopeful it will ease access to care for vets. https://t.co/VYJJsn2o6k"]["Enjoyed the group discussion at @KCTechCouncil this morning—proud to have so many innovative leaders in Kansas. https://t.co/InLb3BuJw8"]["Convened a hearing w/ Gen. Scaparrotti this week to discuss Russia &amp; the European Reassurance Initiative. More here: https://t.co/omEzEaioef"]["Today we mark the 10-year anniversary of the @GreensburgKS tornado – we honor the lives lost and we celebrate the spirit of the recovery. https://t.co/gwQzN7uj5B"]["Last weekend’s snow storms remind us all of the challenges faced each day by farmers &amp; ranchers. https://t.co/ps1S1nwe5B"]["Pushed for omnibus provision to aid in fight to eradicate oak mites impacting Johnson County &amp; Kansas communities. https://t.co/1g6Ga55gCN"]["A Leoti horse named “McCraken” is off to the races. Best of luck to the Whitham family in the #KentuckyDerby. https://t.co/SvRD0qgWI3"]["Members of my staff will be in five more communities around the state to assist those experiencing difficulties w/ federal issues this week. https://t.co/9UDJd6O1Ix"]["Funding for @NIH is absolutely essential to investing in the next generation of Americans. https://t.co/IwZpzT9sQB"]["Monday is the first work day for @dfamilk at new headquarters in Kansas. Welcome to KS &amp; thanks for your work on behalf of dairy farmers!"]["Convened a hearing yesterday to examine the disturbing trend of #veteran suicide. If you or a vet you know needs help, call 1-800-273-8255. https://t.co/XctTKkBhs0"]["Trade with Mexico &amp; Canada is crucial to the success of American farmers. Renegotiating #NAFTA must not threaten access to these markets."]["Looks pretty peaceful this evening but we live in a troubled world. Briefed today on North Korea by the White House. https://t.co/B7bPz9u90F"]["What a difference ten years can make! Glad to be (re-)acquainted with Jared Austin from McPherson in D.C. to advocate for @pheasants4ever. https://t.co/WbhLIE0zFT"]["Examining #nationalsecurity this a.m. w/ Chiefs of @USNationalGuard, @USArmyReserve, @navy_reserve, @USAFReserve &amp; Commander of @MarForRes. https://t.co/cA2k0xA7EO"]["Proud to support this bill to assist service-disabled #veterans—it shows our gratitude for protecting our freedoms. https://t.co/akaQuGZRrj"]["Latest #KansasCommonSense: working to save St. Francis Hospital, learning about @NASA + more. https://t.co/RQnf8dMdG6 https://t.co/YO9kYdcJP7"]["Witnessed the swearing in of new @USDA Secretary Sonny Perdue just a few minutes ago at the @USSupremeCourt. https://t.co/tkkjX0HZ8k"]["Just confirmed by the Senate, new @USDA Sec. Sonny Perdue has got a lot to tackle. I look forward to working with him on Kansas ag issues. https://t.co/me4XFT5b3I"]["If you're experiencing difficulty w/ a federal issue and would like help, come speak with a member of my staff at the times/locations below: https://t.co/XRKMjpY3p0"][".@FoxNews @SenJohnMcCain @SenatorIsakson @SenatorTester @POTUS We still have a long way to go to live up to the promise we made to our nation's veterans, but this new law is an important step forward."]["Joined @FoxNews to discuss my VA bill w/ @SenJohnMcCain @SenatorIsakson @SenatorTester that @POTUS signed into law to improve Choice. https://t.co/t3SGlcIMr6"][".@POTUS just signed my bill w/ @SenJohnMcCain @SenatorIsakson @SenatorTester to improve veteran healthcare into law. https://t.co/nK0HIKFxlp"]["Latest #KansasCommonSense: celebrating the opening of Junction City’s Seitz CBOC Clinic + 7 listening tour stops https://t.co/rqnRvPbyWB"]["He is risen. Wishing you and your family a blessed Easter. https://t.co/hZdDnryXID"]["With the opening of the Seitz CBOC, Junction City-area veterans have another option to access the care they earned. https://t.co/UdkXUiQg2m"]["Fewer empty stomachs = greater worldwide stability. The proposed cuts to food aid are a mistake. https://t.co/w3RzbIsVP7"]["The Grant Prairie Townhomes development in Ulysses will bring much-needed affordable housing to Kansas families for generations to come. https://t.co/IxnMWrTl8D"]["Americans are forever indebted to the brave soldiers of the @FightingFirst, which celebrates a century this year. https://t.co/92tkz0Yk5B https://t.co/WDU2GwIPc6"]["#KansasCommonSense — discussing tax reform &amp; Syria w/ @TeamCavuto, advocating for rural aviation + more. https://t.co/9MHTDnX70W https://t.co/MNy8yHGXjc"]["Discussed tax reform &amp; missile strikes in Syria w/ @TeamCavuto—further military action requires a strategic plan &amp; Congress must approve. https://t.co/MdEt5IxNji"]["Looks like it was a great time at Wichita's Support Law Enforcement parade this morning. Community togetherness. https://t.co/WBOGxwTDdl"]["Congratulations to Judge Gorsuch on his confirmation as an Associate Justice of the Supreme Court of the United States. #SCOTUS https://t.co/FeKBXt9kBw"]["Kansas City honoring the sacrifice of so many on the 100th anniversary of our nation’s entry to World War I — tune in. #USWW100 https://t.co/JhZqqDKxxJ"]["These exceptional @KUSenate &amp; @kstateSGA student leaders represent the future of our state―I enjoyed meeting with them while they're in DC. https://t.co/iY7aVvMYUU"]["@RachelsPinkHous Great to see you and your mom today! Thanks for bringing friends to help advocate for @NDSS. https://t.co/dotoECcNbr"]["Good news: My bill w/ @SenJohnMcCain @SenatorIsakson &amp; @SenatorTester to extend access to healthcare for veterans heads to @POTUS’ desk. https://t.co/F16srz1t9L"]["#KansasCommonSense: meeting our next SCOTUS Justice, chairing a hearing at @ArlingtonNatl &amp; Dodge City town hall https://t.co/hLwvIiheCQ https://t.co/mqazOI23fN"]["Appreciate @USDA's continued attention on wildfires—today's announcement allows grazing on CRP acres for livestock. https://t.co/rhMP429ajg"]["Happy birthday to @wibw's @RalphHipp — Topeka wouldn't be the same without you &amp; I hope you have a great day!"]["Senate passage of my bill w/ @SenatorIsakson, @SenJohnMcCain &amp; @SenatorTester makes strides to preserve the #Veterans Choice Program."]["Today’s the day the Boys in Blue are back! Let’s go, @Royals. #OpeningDay #RaisedRoyal https://t.co/5B6IHMa9de"]["Discussed importance of international food assistance, which promotes global stability &amp; reduces suffering w/ @WFP’s David Beasley this week https://t.co/8BqXtkNijM"][".@ArlingtonNatl has challenges ahead, but I welcome the great responsibility to help preserve &amp; protect this sacred site. https://t.co/giRKsA2t8T"]["Despite severe weather in parts of Kansas tonight, after a dry spell and devastating fires out west, we’re grateful for the rain. #kswx"]["Gone but not forgotten. Paid my respects to Army Spc. Thomas Moffitt. Native son of Wichita, paid the ultimate sacrifice in Afghanistan. https://t.co/5o6R54Kh5M"][".@marineband &amp; @theusarmyband were truly inspiring at the @whitehouse last night. 🇺🇸 https://t.co/MVxeZQljrP"]["I look forward to supporting Judge Gorsuch’s confirmation as an Associate Justice in the days to come. #SCOTUS https://t.co/Y1d98bKqGE"]["Prior to our meeting, I knew Neil Gorsuch is an undeniably qualified nominee. I now know he is fully prepared to serve on the Supreme Court. https://t.co/53bPprZYya"]["If we’re committed to putting America first, we must lift the trade embargo with #Cuba. https://t.co/dxKPh8NFn2"]["Proud to honor Fort Scott-native Gary Deloney's memory &amp; will work to declassify records proving exposure to toxic substances."]["Joined @jontester to intro leg inspired by KS (Gary Deloney) &amp; MT (John Olsen) vets to improve acces to VA benefits. https://t.co/HM9ddHoUFs"]["Not your typical spring break – impressed to see young Kansans helping to build fences burned out by the wildfires. https://t.co/4pp187VKZn"]["The House bill was not the answer, but Obamacare is still failing too many. We must keep our promise &amp; continue working to provide relief."]["Special moment in the @uscapitol Rotunda today with the Great Bend High School A Capella Choir singing “God Bless the USA!” https://t.co/EIXZO44pMR"]["Honored to have @SenatorDole in the office today to speak with my staff. What a Kansas inspiration for us all! https://t.co/uFtNGtoDZl"]["Appreciated meeting students and hearing Eugene, one of my office’s interns who is a veteran &amp; a TRIO participant, address the group. #ksed https://t.co/DL92embekm"]["Hearing now from @DeptofDefense Sec. Mattis &amp; Joint Chiefs Chairman @GenDunford about defense funding &amp; readiness. https://t.co/qSYLt1QqLT"]["My hearing today examined consumer scams &amp; how to fight back―featured testimony by @FTC Commisioners, @KWCHMichael, @OhioAG &amp; Frank Abagnale https://t.co/Sp468qhaBA"]["Tune in—@KWCH12’s Mike Schwanke is testifying before my @SenateCommerce Subcommittee about fighting back against scams. #FactFinder12 https://t.co/rpnNSp7Dxa"][".@USDA is making funds available to those devastated by the recent wildfires—I’ll continue to push for assistance. https://t.co/Ikydzw24hz"]["Happy #NationalAgDay―I'm partnering w/ @SenJoniErnst &amp; @RepMcCaul to encourage America’s next ag generation. https://t.co/GN9Pkj3sWr"]["The average age of our nation's farmers is 58 and trending upward. Our future depends on engagement of young American farmers &amp; ranchers."]["Proud to co-chair the Senate Down Syndrome Caucus on @WorldDSDay &amp; every day to promote awareness, education, research &amp; opportunity #WDSD17 https://t.co/bTXzd7JIe9"]["Well-deserved recognition for Allen County residents' decades of work to drive change &amp; focus on health in their community. https://t.co/VnEfqZlEKt"]["Glad to see VSOs being brought into the fold to help restore veterans’ trust in the VA.\nhttps://t.co/0gun79VhCs"]["Met w/ @USDA Acting Secretary Young &amp; asked about eligible federal assistance programs for farmers rebuilding after #kswildfires. https://t.co/l6zI7q2Pxg"]["Congrats to @AmericanLegion on 98 years of #veterans serving veterans. Kansans have the utmost gratitude &amp; respect for their hard work."]["Witnessed firsthand the devastation left in the wake of the recent #wildfires. Watch the video below to hear my thoughts. https://t.co/ffEDuXfioA"]["At a time when our farmers and ranchers need new markets, it’s time we change course &amp; lift the Cuban embargo. https://t.co/2JmD4Afx1P https://t.co/zVsdpEthTX"]["What a good update on @WichitaPolice Officer Arterburn. Prayers are being heard. https://t.co/Ja61HtBNba"]["Congrats, Tel Wittmer of @WeAreHolton &amp; Jack Campbell of Mill Valley HS―Kansas’ delegates to @SenateYouth #USSYP2017. A real accomplishment! https://t.co/kjfzsE0NLv"]["Although it’s not a big, national news story, Kansas is ablaze. I shared one Clark Co. family's story today. @Pearceoutdoors @Kansasdotcom https://t.co/W4EzncM11u"]["We can streamline the VA Choice Program &amp; support community providers. How? Learn more: https://t.co/1foAKDCecm https://t.co/FZH5rTWYKn"]["Follow @NWSDodgeCity for updates as winds continue to shift &amp; affect the fires moving quickly across portions of Kansas."]["One of many Kansas women worth recognizing as we kickoff #WomensHistoryMonth https://t.co/SKPOCfubpW"]["Proud to see a Kansan recognized for his incredible drone film capturing wheat harvest. https://t.co/27tNEhLQ3Y https://t.co/mV1ASqV4rE"]["Appreciated hearing from Kansas veterans (@VFWHQ &amp; @AmericanLegion), @ksbroadcasters, @KsMedSoc, postmasters &amp; co. commissioners yesterday. https://t.co/3QRvtNRWg1"]["My full statement in reaction to @POTUS’s #jointaddress: https://t.co/KF0mEPoKMC"]["Appreciated hearing @POTUS acknowledge attack in #Olathe. This senseless act, motivated by prejudice, will not be tolerated #jointaddress"]["Proud to welcome @VFWHQ Kansas State Commander Gerald Marvin of La Crosse to the @uscapitol for the #JointAddress tonight. https://t.co/JthHCr5ZvV"]["#WOTUS badly missed its mark. Rolling it back is a victory for rural America. https://t.co/WfJHAXfGMV"]["I reiterated a sentiment best expressed by Alok Madasani: This tragedy doesn't reflect the true spirit of Kansas, the Midwest &amp; the USA. https://t.co/D2SmbgfryO"]["Met w/ German, French, British officials this week &amp; reiterated US commitment to alliance against threats worldwide. https://t.co/7dFA7oZDpS https://t.co/UIq4d61V4Z"]["I strongly condemn violence of any kind, especially if it is motivated by prejudice &amp; xenophobia―my statement on the tragedy in Olathe: https://t.co/4Nn079Q3Wv"]["Thanks to DefSec Fallon &amp; his staff in London. Cooperation w/ our allies is critical to keeping us safe against the complex threats we face. https://t.co/VO7ADvVOvq"]["Awesome ― every veteran should have the opportunity to see the memorials dedicated in their honor.\nhttps://t.co/lj76yNufOQ"]["I'm hopeful the new admin. will recognize &amp; keep in mind the unique challenges facing rural healthcare providers. https://t.co/Pi4AsheIiI"]["As we celebrate #BlackHistoryMonth, I encourage Kansans to learn more about Nicodemus. https://t.co/IeEeRePA0M https://t.co/kklzE3kt6X"]["Joining the Blue Valley community in praying for Coach Driskell, his family, and his students. https://t.co/ELxSPRcJ5b"]["#KansasCommonSense—update on @FortLeavenworth, ongoing recovery efforts from last year's Anderson Creek fire + more. https://t.co/PtoeILTiz2"]["Our next #farmbill must address the crisis in the High Plains impacting wheat &amp; sorghum farmers. My full op-ed: https://t.co/jQzxFEVR7c https://t.co/ONVhCdvmyo"][".@washburnlaw is offering a free clinic next Saturday for veterans with legal questions. Feb. 25, 10 a.m.-Noon.\nhttps://t.co/CismC4Ke1e"]["Just joined all 99 of my colleagues to confirm Dr. David Shulkin as our 9th @DeptVetAffairs Secretary. My statement here: https://t.co/OiLeKWJvsx"]["Kansas producers know these challenges all too well. Look forward to working w/ Gov. Perdue to defend rural America. https://t.co/f6HGHneeTS"]["Wishing @CoachBillSnyder a swift, speedy recovery – see you on the sidelines soon! #SnyderStrong #EMAW https://t.co/wOoyZEgWc4"]["Wrote the president to request an immediate hold on #GITMO detainee transfers—safety of Americans must come first. https://t.co/EknD0eQTrp"]["Good song with an even better message. https://t.co/7zsqYWNK8n"]["Joint-service exercises are critical to keeping Kansans &amp; Americans safe—great to have @FlyKSLN involved in this important training. https://t.co/DJX74d1Rbn"]["I appreciated hearing from Commanding General LTG Lundy about @FortLeavenworth's integral contributions to the mission of the @USArmy. https://t.co/U7FzfRwRdC"]["Praying for @WichitaPolice’s Officer Brian Arterburn, and joined @kfdinews in wishing him a full and speedy recovery. https://t.co/IZFUDkBo5A"]["Pushed @DeptVetAffairs nominee Dr. Shulkin this week to end VA habit of narrowing Congress' laws &amp; work with #VSOs. https://t.co/uecMBu8VOo https://t.co/cs48NafsMl"]["#NationalPrayerBreakfast—a time to put politics aside &amp; pray. Proud two Kansans had a part in its founding. https://t.co/megoXBHKjz"]["Met with Sonny Perdue today to hear more about how he would lead the @USDA. Believe he understands challenges facing rural America. https://t.co/34nqsLmrR6"]["I look forward to examining his legal writing &amp; meeting with him to discuss his views on the judicial branch and the Constitution."]["Judge Gorsuch is an impressive &amp; well-qualified #SCOTUS nominee who has already received bipartisan support in the Senate."]["#KansasCommonSense—my new role on the MilCon + VA Appropriations Subcommittee, joining @EPWMaj &amp; visiting @Airbus. https://t.co/LirrMGTzKn"]["Enjoyed this profile of Independence. A good illustration of the daily routines, struggles &amp; rewards of life in small-town USA. https://t.co/fiu3Eu8PmK"]["Far-reaching national security policy should have input from Congress. Full statement: https://t.co/yw089rqYyo"]["Happy #KansasDay! 🌻\nhttps://t.co/ZnVFQVptzT https://t.co/S7uBnn6OZc"]["The Holocaust revealed to us humankind's darkest elements, yet also bravery, unexpected kindness &amp; self-sacrifice.\nhttps://t.co/zhmn6EwRmc"]["Wonderful to have so many Kansans in DC for #MarchForLife—I will continue working in Congress to defend the fundamental right to life. https://t.co/vgaCBbzzJB"]["Without the hard work/advocacy of Rachel &amp; her mom, this day might not have come. Looking forward to seeing Kansans benefit from ABLE accts!"]["Well, a yr after we passed the #ABLE Act, Rachel officially opened the 1st ABLE account in Kansas this morning w/ her mom &amp; dad by her side. https://t.co/2bkHkRljz6"]["I was impressed by Rachel’s desire for something so central to the American Dream – to be able to save and make her own way through life."]["When I met @RachelsPinkHous in 2012, she told me I needed to get the ABLE Act passed so she could live in a pink house when she grows up. https://t.co/iLy1BbwIYg"]["Overregulation is among the greatest threats to rural America. My seats on #EPW &amp; #Ag Approps enable me to advocate for farmers &amp; ranchers. https://t.co/7TaD2Xlauq"]["#KansasCommonSense – A peaceful transfer of power, confirming qualified Defense &amp; Homeland Security noms and more: https://t.co/05dG6CQ9Ki https://t.co/OOUBWUrSOI"][".@RepLynnJenkins is the consummate Kansan &amp; an exceptional congresswoman—whatever's next, our state is better off because of her leadership. https://t.co/XZaBfKHx0q"]["Welcomed a group of middle school students from St. John Catholic School in Lawrence to the Capitol yesterday. https://t.co/eb7E7PFhd4"]["The memorial is the only one of its kind &amp; deserves the national attention a designation would bring to @CityofEmporiaKS &amp; @emporiastate. https://t.co/F1qeEANchG"]["Called on @USFWS today to request an extension to latest #LPC status review comment period. Letter here: https://t.co/qb3F5NIXYp"]["Interested in a summer internship in Kansas or DC? The application deadline for our intern program is February 17. https://t.co/X7rgqqzN8o"]["Parsons native @AjitPaiFCC is an excellent choice to lead @FCC. Capable, talented leader uniquely qualified to advocate for rural America."]["Early morning sunrise from I-70 in Wabaunsee County on my way back to work in Washington. https://t.co/rZzMfwjERE"]["I’ve fought against #WOTUS b/c it’s unnecessary &amp; stifles job creation in Kansas. Encouraged to see this on the new https://t.co/trBKUUncaR: https://t.co/q58WMllwWG"]["Swiftly confirming the secretaries in charge of our national security is critical to keeping us safe as we face threats at home and abroad."]["Foreign adversaries looking to challenge America will be rethinking their plans with Gens. Mattis &amp; Kelly at the helm."]["The peaceful transition of power further reminds us of the strength of our democracy—honored to be there to represent Kansans. #Inauguration https://t.co/7WPXcPLo0P"]["What an opportunity for Sophie Schneider, young Kansan from Olathe, to serve as @GMA's “kid correspondent.” Something she won’t soon forget. https://t.co/9mDmpuVqro"]["I joined @MorningEdition's @nprgreene to discuss @SenateCommerce's hearing on the Commerce Secretary nominee. Listen—https://t.co/MdZHtG0rig"]["The Ag Secretary serves as an important voice for rural Americans. My statement on Gov. Perdue's nomination here: https://t.co/4iMTQgr4XU"]["Great to welcome the @FightingFirst Mounted Color Guard to the @uscapitol—they'll represent Kansans with distinction at the Inaugural Parade https://t.co/NAu4sqVHjH"][".@MilitaryVetera's @MelissaJarboe is an incredible advocate for #veterans—glad she could make the trip to DC. https://t.co/0NRQy7Yjy3"]["This week’s #KansasCommonSense – voting to set up a critical step in repairing damage of #Obamacare &amp; more. https://t.co/z1Z7CI9cEJ https://t.co/gUIDEs9ENT"]["Great to be at @KansasINBRE #KINBRESymposium this weekend. More about my vision for STEM research in Kansas: https://t.co/BZ1g9DLHCm"]["With icy weather due to hit Kansas this weekend, stay safe, stay aware and stay off the roads if possible. #kswx https://t.co/5hsOSfqEDq"]["Kicked off the morning talking jobs and American competitiveness on @SquawkCNBC with @JoeSquawk and @BeckyQuick. https://t.co/aMovnIAwte"]["Look forward to building on consumer protection successes &amp; continuing to chair the @SenateCommerce Subcommittee. https://t.co/8vN5pVMkkR"][".@jsiebenmark—They're right. It will remove unnecessary hurdles while preserving safety standards in our skies."]["The Senate’s vote tonight gives us the opportunity to begin repairing #Obamacare’s damage. My full statement here: https://t.co/4ek0MVDZkO"]["Our next Secretary of #Agriculture will have a huge job to do. I spoke with @KansasAgland about my expectations. https://t.co/U7lKf4hSwu"]["During his confirmation hearing, I was encouraged to hear AG-nominee Jeff Sessions recognize the important mission carried out at #GITMO."]["Added my name to the #REINSAct – let's give Congress the ability to make certain regulations promote economic success, not impede it."]["Back at the Capitol for week two of the 115th Congress – hard at work on behalf of Kansans. 🇺🇸 https://t.co/hPNviTD7zy"]["Today is National Law Enforcement Appreciation Day. Please share your gratitude if you see a law enforcement officer #supportblue #thankacop"]["Joined @FoxNews yesterday to discuss confirmation hearings &amp; Pres. Obama’s plan to release more #GITMO detainees before Inauguration Day. https://t.co/QjOjFhx45u"]["I took a few moments after being sworn in to another term in the Senate this week to reflect on this responsibility Kansans have given me. https://t.co/1HiFR3klSA"]["Laid out my priorities for #healthcare this week as we work to repeal and replace #Obamacare. Watch my remarks here: https://t.co/lnQqdWA1Ma"]["Latest #KansasCommonSense – mapping out 2016 travels, standing with #Israel, &amp; visiting @IACHPAO at @FortRiley. https://t.co/IdMAqGIHDE https://t.co/bGQ56yAytu"]["Thanks, @SenPatRoberts – Look forward to continue working alongside you &amp; our colleagues to make good things happen for Kansans."]["Let the game begin. @KStateMBB https://t.co/fUIFpK6oaP"]["I'll be introducing a resolution to stand with #Israel &amp; disapprove of U.N. action on first day of #115th Congress. https://t.co/zCdM7uErvh"]["Good luck to @KStateFB in the @TexasBowl tonight going for their fifth win this season vs. a team from Texas. Go Cats!"]["Did you get a drone for Christmas? @KStatePolytech has a list of essential tips to help you fly safely. https://t.co/a4bSU5SOPs"]["Administration is transferring more detainees out of #GITMO—putting a campaign promise ahead of Americans' safety https://t.co/oAD2AOqXbd"]["Wishing my Jewish friends in Kansas &amp; around the globe a joyous #Hanukkah starting tonight at sundown."]["I will work to make certain the UN is not used as a tool against America, its allies, or its interests. https://t.co/Ubc6sHVURG"]["The president's decision to abstain today in the UN vote further chills relations w/ #Israel &amp; may lead to increased violence in the country"]["Heartwarming to be with vets today at Colmery-O'Neil VA in Topeka. I wished those who served &amp; their caretakers a very Merry Christmas. https://t.co/948DfrdyRO"]["Chase County Courthouse has decked the halls. https://t.co/xbzcf02o4V"]["FAA’s small airplane certification rule empowers general #aviation to innovate while improving safety. Statement—https://t.co/ndnFJdduwz"]["Didn’t throw away my shot—#BOTSAct is law &amp; fairer ticket prices for that game, musical or concert are on the way. https://t.co/hsxwHzU1y3"]["The Manhattan High School Pops Choir really got us in the holiday spirit at yesterday’s rotary club meeting! https://t.co/t9zVKiJLCE"]["@hannah_piros Saw your letter &amp; wanted to let you know I share your passion for ending Alzheimer's &amp; sponsored #PCHETA last week!"]["#KansasCommonSense—supporting medical research, meeting w/ Transportation Sec. nominee Chao &amp; visiting @NavalAcademy https://t.co/aPmgUnruHO https://t.co/HMaMcqyBJk"]["Proud the Senate passed my bill to ensure people who violate the trust of our nation's vets are not rewarded w/ unjustly guaranteed benefits https://t.co/D5pJUDmcXp"]["I was on @SquawkCNBC this morning w/ @andrewrsorkin &amp; @joesquawk to discuss the state of American competitiveness and the @CompeteNow Forum. https://t.co/5BZleu5fSm"]["✔️ Senate\n✔️ House\n🖋 POTUS?\n\n#BOTSAct just passed House &amp; headed to the president—it would level playing field &amp; curb online ticket fraud 🎫"]["FY17 #NDAA makes certain those working tirelessly to keep us safe at home and abroad can keep doing their jobs – and prevents #Gitmo closure https://t.co/LVOPHCJLlU"]["#CuresNow passes Senate with bipartisan support &amp; heads to the president’s desk. It will give hope to millions of Kansans and Americans. https://t.co/azjFDHKcBv"]["Today, we remember the attack on #PearlHarbor 75 years ago. May God bless our WWII veterans &amp; all who served or serve in our Armed Forces."]["After nominating him to the @NavalAcademy, I broke good news to Topeka-native Dawson Podlena over the weekend. #USNA https://t.co/yRY4hTURyk"]["Visited with Kansas midshipmen at the @NavalAcademy yesterday – this group reminds me that our nation’s future is bright. https://t.co/NnYrm5Uapp"]["#KansasCommonSense—Catching up w/ Mike Pence &amp; Reince Priebus, advocating for #CURESNow &amp; supporting disabled vets. https://t.co/Q7HkPnQyUQ https://t.co/N0DC676wYK"]["Quite an experience leading the first @USCapitol Dome tour since its restoration. Here's a behind-the-scenes look: https://t.co/lAro0Kdlou https://t.co/psAdSvsK56"]["The 21st Century Cures Act has the power to improve the well-being of millions of Americans &amp; Kansans. #curesnow #path2cures https://t.co/BY9n1npGdp"]["As the Middle East faces continued instability, it is critical that we reaffirm sanctions authorities against #Iran. https://t.co/jGBCWn7gDS"]["I supported the #ECHOAct today to help expand rural Kansans' access to specialty health care. https://t.co/yIL4YG8RkN"]["This week’s #KansasCommonSense – Thanksgiving, highlighting pioneers in Kansas City, @FortLeavenworth honors. https://t.co/P5gZlkhb1y"]["Today is #SmallBizSat—great day to remember the impact your investment at local stores makes in communities across Kansas. @ShopSmall https://t.co/uu9GLHPp7B"]["Praying for #Neodesha, Airosol employees &amp; their families—I've been in touch with Maj. Gen. Tafanelli to prioritize usable drinking water."]["This week’s #KansasCommonSense–standing up against abuse at the VA, helping Gold Star families &amp; disabled vets https://t.co/CQ2FRTCeLg https://t.co/Nc3cFC8xqp"]["November is Nat'l Family #Caregivers Month – let’s honor those who work tirelessly to care for loved ones. #nfcmonth https://t.co/ZNrOmfU74y"]["Just finished @candice_millard’s most recent book. Impressed by her distinct gift for storytelling. A great Kansas author. https://t.co/bdGHlbJdnC"]["Let’s #WageHope this World Pancreatic Cancer Day by committing to support research, education and screening. @PanCAN @PurpleOurWorld #WPCD https://t.co/SNQ16sRytX"]["Fallen &amp; MIA servicemembers’ families’ stories ought to be a part of @librarycongress’ Veterans History Project. https://t.co/POw3GCYBV4"]["This week’s #KansasCommonSense–commemorating Veterans Day, election results &amp; opportunities in a new Congress. https://t.co/DE8qDXXVtQ https://t.co/6HPvscr6C9"]["Congrats to @KState and Gen. Myers on making it official. Your leadership and the continued success of #KState will help our state prosper. https://t.co/Gfp4liih3k"]["Philanthropic efforts like Bob Lane's make Kansas an even better place to call home—his support for @RMHC helps many https://t.co/hhXkSbVrYZ"]["I joined @1350kman on Friday to thank our vets, chat about the elections &amp; my recent visits in Kansas. Listen here:\nhttps://t.co/JHdTYadvaB"]["241 years of service &amp; pride – happy birthday, @USMC. #SemperFi #USMCBirthday"]["The #VA must be trustworthy &amp; accountable to the men &amp; women it serves. I will press for answers regarding this potential breach. https://t.co/v9m9Vw2VU6"]["Visited with juniors and seniors at Stockton High School today. Thanks to Superintendent Shelly Swayne for arranging my visit. https://t.co/YfctJN9OJ5"]["Went back to school yesterday to surprise @KState’s Dr. Barry Flinchbaugh &amp; his ag policy class. https://t.co/ETgak3uR5n @kstatecollegian https://t.co/AbKHTn0FEU"]["Proud that the Kansas tradition of excellence in air mobility missions for the @usairforce will continue at @22ARW with the #KC46A! https://t.co/bsDRJNgUpu"]["#KansasCommonSense newsletter: Joining Gen. Myers at @KState to talk ag research, G&amp;W Foods groundbreaking + more. https://t.co/2ZZSkO7XaD https://t.co/dWfcruiyTi"]["Congratulations to the winner of today's Marine Corps Marathon in Washington, D.C.—Samuel Kosgei of Junction City. https://t.co/wTxq7k8tSI"]["Saw today the Olathe Advanced Technical Center where local students receive training for high-skilled jobs after graduation. @olatheschools https://t.co/IPvpmQTEzB"]["New businesses create ~3 mil new jobs each year &amp; are a major key to economic growth. Be an #entrepreneur &amp; take the first step Nov. 11-13. https://t.co/uay5N5ye3T"][".@SecDef suspending collection of CA #nationalguard bonuses welcome news. I'll keep pushing @DeptofDefense to find a permanent fix."]["Welcome to Kansas, @AmericanRoyal! Here’s to a bright future as part of our state's tradition of agriculture. https://t.co/fvw1CadDCz"]["When a federal agency is at fault, its wrongdoing should not put the burden on soldiers. https://t.co/UOmSrD9BcN"]["Hey, @RachelsPinkHous—sorry I missed you yesterday. I heard from Robba &amp; am glad the @NDSS event went well. Look forward to seeing you soon! https://t.co/sE7D1s2PPe"]["Atchison-area residents: please heed the instructions of emergency response personnel &amp; shelter in place or evacuate if possible. https://t.co/dRCYps4yA6"]["Enjoyed my visit to @Meridian_Way_WF this week. Good conversation with dedicated employees &amp; view from top of turbine not too bad either. https://t.co/jvkl8i2G84"]["Joined @FortHaysState today to dedicate the College of Business and Entrepreneurship in the name of W.R. &amp; Yvonne Robbins. https://t.co/9GupZS4ecJ"][".@repcostuco Thanks for showing me around! A lot to be proud of in Republic County. #GoBuffs"]["The spirit of Kansans helping their neighbors lives on through inspirational young people like Brooklyn. https://t.co/3PXJVO5Z4Y"]["This week’s #KCS—doors open at @FortRiley's #Irwin Army Hospital, hosting @NIH officials &amp; stops in southeast Kansas https://t.co/IXFzzAnCSu https://t.co/7XtPpFPLVe"]["Always an honor to be with the @FortRiley community – today to celebrate MG Joseph Martin’s assumption of command of the @FightingFirst. https://t.co/Dkc1LbkVgD"]["Honored to speak this morning at the #Eisenhower Pilgrimage held every October at the @IkeLibrary in Abilene to honor our 34th president. https://t.co/OIdSbiOLtL"]["Interested in a spring ’17 internship in DC, Manhattan or Olathe? Deadline is Oct. 28.\nhttps://t.co/Ov8zW0mRVD https://t.co/X7rgqqRnZW"]["Proud to see this Hutch native and fellow KU alum working to combat the #Zika virus. https://t.co/xKt4zMEKLA"]["Thankful @GENMarkMilley &amp; @USArmy staff could come to aid of bus crash victims in DC last night. Heroes. #ArmyStrong https://t.co/XYZ77Yjc82"]["Great to see Kelly Lenz inducted into @ksbroadcasters Hall of Fame — well-deserved after decades as the voice of Kansas ag. https://t.co/mheipAeARj"]["Disgusting, discouraging and damaging. Everyone is worthy of being treated with dignity and respect."][".@Missmorgan_mm Great to meet you too! Keep up your hard work and let me know if I can be a partner in helping you feed the world."]["A @cfbhall career &amp; a HOF life. Happy birthday, @CoachBillSnyder—no better example what Kansas values are all about. https://t.co/h3UnxNZd81"]["There's severe weather across #Kansas this afternoon through the evening — be alert &amp; stay safe! https://t.co/MjUJbgNeWV"]["Great news – @KState BRI announced a promising step toward fighting the #Zika virus with their new vaccine. https://t.co/GkjerQ6YE3 https://t.co/cWu94T3caY"]["Thanks to Shawnee Mission South’s @SMSouthTDain &amp; @TonyBudetti for hosting me–you’re doing important work to prepare future Kansas leaders. https://t.co/HtKFBf1sKi"]["Warm wishes for health, happiness &amp; clarity of mind in the coming year to the Jewish community at home &amp; abroad celebrating Rosh Hashanah."]["Joined by WY @SenJohnBarrasso in Wichita today to talk with local healthcare, energy experts &amp; show off our neck of the woods – err, plains. https://t.co/gktpzqpDs8"]["Enjoyed meeting more than 40 bright Kansas students interested in attending our nation’s service academies last weekend. https://t.co/VWTb1wGJmz"]["Good to visit w/ Chairwoman Onnen &amp; Vice-Chair Pahmahmie from @PBPNation about tribal issues for PBPN &amp; Indian Country as a whole. https://t.co/EU1824KM9h"][".@PresidentPeres was a force for Israel throughout his lifetime of public service. His leadership influenced both his country and the world."]["#KansasCommonSense—examining generic drug approvals as #EpiPen costs skyrocket &amp; pressing #WellsFargo CEO https://t.co/2TGrH5duJa https://t.co/Mj4iXzIBFH"]["Thanks to the generosity of @ericstonestreet &amp; other proud alums helping @KStateCancerRes work to put an end to #cancer once &amp; for all. https://t.co/IEH8DzPpuX"]["Great read from @KansasAgland on KS farmer Joe Jury’s #cornharvest. Despite strong harvests, conditions remain tough https://t.co/Ez428M26tS"][".@emlord I'm with you! We must support @NIH &amp; invest in medical research—it's why I co-founded the Senate NIH Caucus https://t.co/G4czZ3uj87"]["Chaired a hearing to examine @US_FDA’s role in approving generic drugs—we need to get more to market to create competition &amp; lower prices. https://t.co/H8mIhxNWGJ"]["Thanks for your leadership at the University of Kansas, Chancellor Gray-Little! @KUNews https://t.co/fzWynUEILy https://t.co/c896Un8REY"]["My Washington, D.C., Manhattan &amp; Olathe offices are accepting internship applications through Oct. 28 – more info: https://t.co/Ov8zW05h45"]["Two lifesaving organizations teaming up to end #breastcancer – perfect match. @kumedcenter @susangkomen #kshealth https://t.co/gCuoXnHF7v"]["I pressed the @WellsFargo CEO for answers yesterday about the misconduct carried out by employees on his watch. https://t.co/PsATC76KeO https://t.co/lji1e25h8C"]["#NorthKorea’s nuclear weapons program is a clear threat to global security—we must impose secondary sanctions. https://t.co/gXidUXEHBm"]["This week's #KCS — opposing giveaway of Internet oversight, trip to @KansasStateFair + more: https://t.co/ujeWJmc4Dk https://t.co/V8WpGHiOXh"]["As the @usairforce celebrates 69 years serving our nation, @SecAF23 reveals the official name of the next-generation B-21 bomber: #Raider. https://t.co/VjZrRli2MV"][".@KevinCase253 @Emporia253 Thanks for the conversation &amp; your dedication to making a difference in students' lives. https://t.co/SykeFOCTHG"]["Two more former #GITMO detainees are engaging in terrorist activities, endangering American lives https://t.co/m9dW2sgZSQ]"]["Thinking of Master Deputy Collins’ family &amp; the @JOCOSHERIFF community as they honor his life today. https://t.co/aVtvVrUwgM"][".@AjitPaiFCC, appreciate your support of rural broadband dev. In our economy, Americans—urban &amp; rural—need #gigabit opportunity to compete."]["Pleased to join @AIAspeaks to support #aerospace, which safeguards our future by building a strong economy + defense https://t.co/27S4PFxIoM"]["United States must enforce current rules to hold China accountable &amp; protect American workers, farmers &amp; #smallbiz. https://t.co/hngpR8F8Qf"]["Tune in at https://t.co/SGqQ7mkb4P to hear about how we can make online ticket buying better for consumers. #BOTS https://t.co/56HKnLXHM7"]["We may no longer settle in w/ a print edition &amp; a.m. coffee at the kitchen table, but local newspapers still matter.\nhttps://t.co/cs22psCEqe"]["Today we reflect on the lives lost &amp; honor our first responders—here's what I saw visiting ground zero. #NeverForget https://t.co/0XJ2jpBFOl"]["This week’s #KansasCommonSense: demanding justice for Kansas veterans &amp; understanding food safety from farm to fork. https://t.co/I4CtamuQ33"]["Chairing a hearing next week on my bill to ban online ticket #bots driving up prices &amp; preventing consumer access https://t.co/wG6VDTmNKr"]["For any veteran to experience abuse by a VA employee is an outrage. I am pushing the VA to provide answers. https://t.co/VH6x9s0VKV"]["Since Kansans first sent me to DC, I've worked to regularly visit &amp; hear from every county I represent. Here's why: https://t.co/RqTriPQJno"]["In Hoisington &amp; Chapman this #LaborDay to reflect on something Kansans know well: the dignity of a hard day's work. https://t.co/NTtBGfINhz"]["Thanks to @US_FDA Comm. Dr. Robert Califf &amp; the Denver District Laboratory staff for the informative tour today. https://t.co/Hcaz7513dt"]["Farmers need every tool available as they deal with the poor ag economy – access to credit is critically important. https://t.co/PTpsi9abUa"]["Congrats to SMSgt. Rebecca McNelley of Clearwater—named one of @USAirForce’s Twelve Outstanding Airmen of the Year. https://t.co/pRl5EHRcjN"]["With #Kansas Cadets at the @AF_Academy—proud our state produces such smart, hard-working &amp; civic-minded individuals. https://t.co/ZfHfQVw13L"]["Disturbing to see Iranian boats harass a U.S. Navy Vessel. https://t.co/060dDCh3nz"]["From Lenexa to Sharon Springs w/ 103 stops in between—wrapped up my third 105-County #KansasListeningTour yesterday. https://t.co/zx5cHmWsx4"]["It’s a new school year at Hays High – great to visit w/ new @USD489 superintendent John Thissen &amp; student leaders. https://t.co/R1xoLqRRb2"]["Proud of @FortRiley on a job well done! #BigRedOne https://t.co/cDuFsjCU8z"]["I appreciate the efforts of those at @KState's Biosecurity Research Institute who are fighting the threat of #Zika. https://t.co/5X2k35VUFz"]["Toured #Sabetha Community Hospital yesterday and met many of their dedicated staff members. https://t.co/u8zP5qf38T"]["This week’s #KansasCommonSense: latest on Obama administration’s #Iran ransom &amp; how wheat farmers feed the world https://t.co/JWc7s0Gp4u"]["On the heels of the largest #GITMO release under Obama, a previously released prisoner who joined ISIS was arrested. https://t.co/xi9L1im5Vw"]["Packed house at my Oskaloosa listening tour stop this morning – thanks to participants for sharing feedback. https://t.co/m3nAMkgquJ"]["The KC-46 tanker program means a secure future for @22ARW for generations to come. https://t.co/8z44dZFm0Z #airforce https://t.co/ctNEKcssnx"]["Visited with @ShawneeChamber last night &amp; @ShawneeRotary this morning to discuss job creation and entrepreneurship https://t.co/83zeKHBqp6"]["Joining Jeff &amp; Rich on @1150KSAL in just a few minutes - tune in or listen live https://t.co/jZeJzC51b4"]["The White House is displaying a disturbing lack of judgment w/ largest single release of #GITMO detainees yet https://t.co/4POEiR9yrj"]["This week’s #KansasCommonSense: ideas to alleviate rural poverty &amp; recap of my time at home https://t.co/NReQvs2XVE https://t.co/croZrKRJdI"]["Congrats @JackSock! You make Kansans proud. https://t.co/D2D9vn9glW"]["Congrats to Wichita-native @NicotheBoxer on his Bronze medal! Making Kansas proud. #rio2016 https://t.co/RpcUwcejDS"]["People in Bird City are very helpful. #Kansas https://t.co/bkQdnZFSf7"]["Heard from locals in WaKeeney today about caring for our vets, commodity prices &amp; @EPA overreach https://t.co/Z2VJSyphM8"]["#KansasCommonSense—Caring for #veterans, promoting reading among young Kansans &amp; more. https://t.co/DzhUF8mHYl https://t.co/MEMBh2sCcS"]["Proud of the humanitarian work being done in Armenia by @KansasGuard members as part of a State Partnership Program. https://t.co/5Zi0TxpiTC"]["I'm joining Cathy Dawes on @1350kman momentarily. Tune in or listen live! https://t.co/X23BbXbD78"]["Congrats to Wichita's own @NicoTheBoxer for moving on to Monday's second round. #GoTeamUSA #Rio2016  https://t.co/0fkltyFW3E"]["Congrats to the @KSUFishingTeam for winning the national college bass fishing championship! #collegebass #KState https://t.co/88wY6MjxiQ"]["The #OpeningCeremony of the #Rio2016 @Olympics is tonight. Congrats to all the athletes—particularly the proud Kansans—representing @TeamUSA"]["There are more than 244,000 small businesses in Kansas—in honor of #StartupDay, share your story #KansasStartups https://t.co/GQlJLrNrxv"]["Thinking of the Carliles &amp; the @LiberalBeeJays family on this difficult day. Please send a prayer their direction. https://t.co/tTGeTCEFMS"]["#KansasCommonSense–Welcoming @SecAF23 to @22ARW, KS athletes headed to @Rio2016_en + more https://t.co/m37Uq8c1pZ https://t.co/QgRRV6XKSa"]["I'm joining Mike Adams on @AgriTalk at 10:15 a.m. CT/11:15 a.m. ET — tune in or listen live! https://t.co/jq3i7cSIrx"]["Honored to welcome Secretary James of the @USAirForce to McConnell Air Force Base @22ARW this evening https://t.co/PhQE6jmjxu"]["Proud of the Tokach Family &amp; @Kansas4H for working together to educate &amp; help improve the lives of others. https://t.co/9WPnZE7kcs"]["The Flush Picnic has been a St. George tradition since the 1930s, and it never disappoints! https://t.co/O8kGzuXTHO"]["Thx @butlercc for hosting today’s El Dorado #Rotary mtg. Appreciated Sarah Coffman's update on @WAALrescue’s efforts https://t.co/BfRCib8Z1B"]["I hope all Kansans will join me in wishing @FightingFirst a safe &amp; successful tour overseas defending our nation. https://t.co/GQ5BbmTWIJ"]["Stopped in McPherson to tour @Pfizer, which employs more than 1,000 Kansans—thanks for the informative tour! https://t.co/0OWxlIGvPz"]["Reading has always been a hobby of mine. Books are a great opportunity to learn &amp; escape the summer heat! https://t.co/Uae1G7U85B"]["#KansasCommonSense – Mourning @KCKPDHQ Cpt. Robert Melton, relief/wariness over #LPC + more. https://t.co/qlHEJ0fhU9 https://t.co/MtIXQ6FCeN"]["Happy birthday to one of Kansas’ greatest native sons &amp; someone I am beyond honored to call my friend – @SenatorDole https://t.co/v6gp3smuoV"]["In Johnson &amp; Sublette for #KansasListeningTour stops today—met with local residents &amp; 4-Hers at the county fair @4H https://t.co/pIG20u0aT1"]["RIP Captain Robert Melton. Extending my prayers &amp; support to his family, the @KCKPDHQ community &amp; all grieving. https://t.co/unOQfRPEkp"]["Delisting the lesser prairie chicken brings a sigh of relief, but we can't let our guard down yet. https://t.co/1NlVi6PodS"]["#KansasCommonSense – A proposal to reform government IT, the Cuba Harvest Festival + more. https://t.co/hSIz9lMhur https://t.co/FBJd620BoT"]["I'm urging NDAA Conferees to protect housing benefits of military families, women &amp; junior Armed Forces members. https://t.co/YaEb8ZHko2"]["Sponsored new legislation that would take steps to reduce the number of drunk drivers on American roads. https://t.co/8Dq0ou6Bsg"]["Praying that we can find a way to come together to reject the ugliness of hatred &amp; heal the wounds of the grief-stricken. #BatonRouge"]["See you soon! https://t.co/eiGt5951jM"]["Deeply saddened by attack in Nice, France tonight. We must provide our intel &amp; law enforcement agencies the tools needed to stop terrorists."]["Introduced #MOVEIT Act today to reduce wasteful spending, enhance info security &amp; speed #cloud computing transition. https://t.co/pLX27lvdKt"]["Proud to pass legislation to help communities fight back against epidemic of opioid abuse. Click link for more info. https://t.co/Pz67yz6g1Y"]["Critical progress for the KC-46A Tanker today! https://t.co/TsApZyIlTs"]["Disappointed critical #FAA reforms to streamline certification, improve efficiency &amp; focus resources were excluded. https://t.co/Yi5RdgSDQz"]["My take on the latest #FAA extension, which ignores the need for significant aviation reform to create Kansas jobs https://t.co/97tltssi1G"]["Tune in to @KBUF in a few minutes - I'll be on to share details about my upcoming southwest Kansas town halls. https://t.co/wywDxngmzD"]["Frustrated this administration continues to put campaign promises ahead of keeping Americans safe. #GITMO https://t.co/K95mqEzyet"]["The FCC’s complicated and unfair new regulations put the delicate balance struck with #PrivacyShield in jeopardy.\nhttps://t.co/XPIhJXySUr"]["Glad to express my support #4specialeducation to @KansasCEC reps this morning. Thanks for the important work you do. https://t.co/XAvBS17OKw"]["Good news: new @NIH grant will help @KUnews expand biomedical research in KS, save lives &amp; keep us safe. https://t.co/TXajSelJSw"]["Heartbroken over the murders of police officers in Dallas. Pray, pray &amp; pray again for the entire #DallasPD family. https://t.co/1hjfXpx3IO"]["All my life I’ve been told no one is above the law. Apparently, for some, that’s not the case. https://t.co/OGpXu1dK35"]["Released #GITMO detainee whereabouts unknown as @Rio2016 #Olympics approach—detained terrorists must remain at GITMO https://t.co/aUjPsldXk8"]["#KansasCommonSense—Commemorating our nation's independence &amp; #KansasListeningTour continues https://t.co/P5biZaWeqG https://t.co/Dh2Fm3eL4g"]["Good to see VA finally listening to #veterans &amp; their families to address the devastating effects of #AgentOrange. https://t.co/Y9f2FHZyx9"]["Had the privilege of hearing from Chanute residents today about community banks, #HigherEd, #WOTUS &amp; natl security https://t.co/hxgHAA2acX"]["Happy #IndependenceDay. 240 years ago, our founders laid out the self-evident truths that make ours the greatest nation on earth. 🇺🇸"]["Robba and I were happy to be back in Hays this morning for their 22nd Annual Wild West Festival Parade. https://t.co/0Qd7BcgVjP"]["Enjoyed being with Salina residents today as part of my KS Listening Tour. Discussed #healthcare, #VA reform &amp; #2A https://t.co/QKCbqLDR8g"]["It’s harvest time in Kansas. #WheatHarvest16 #KansasWheatHarvest\nhttps://t.co/2m3kbp7LcE"]["See you soon! https://t.co/VGK1XZMt9R"]["Check out @BradSmi &amp; my @kansasdotcom op-ed re: the importance of computer science education https://t.co/s6L9J3u2sO https://t.co/xJsBonIWxs"]["The VA must make certain vets get the life-saving help they need—one missed call or unanswered text is one too many. https://t.co/5GZ6Mrwuoy"]["#KansasCommonSense – Urging aviation certainty, greeting @KSHonorFlight in DC + more. https://t.co/B91u7bwzt1 https://t.co/ZBbibcQKNk"][".@SenatorDole, welcome to @twitter where RT does not mean \"Red Tape\" &amp; can actually be a good thing. https://t.co/iXeuSAF7EZ"]["Toured Overland Park Medical Center's new ER &amp; impressive new trauma rooms this morning. Friendly, passionate staff. https://t.co/DzquXvCTg5"]["We've increased #VA resources 86% since 2009, yet wait times are 50% longer than they were in 2014. Unacceptable. https://t.co/fT0qdExmIF"]["Proud to partner this week w/ @defensecomm to honor the Flint Hills Region as a \"Great American Defense Community.\" https://t.co/eSYHmcB3PO"]["I'll keep pushing the House to take up Senate-Passed #FAA Reauth to improve safety &amp; address general aviation needs. https://t.co/bzkVHpUkEC"]["The #VeteransFirst Act will address toxic exposure and improve #VA service for all – time to pass the bill."]["One of the real joys of my job as a Senator is hearing from Kansans—yesterday was a good reminder of that privilege. https://t.co/DknoXVrqVL"]["We must change the culture of the @DeptVetAffairs and hold VA bureaucrats accountable #VeteransFirst https://t.co/oQGsKuSXXm"]["Congrats to all the #WoundedWarriors who competed in this year's @warriorgames &amp; thank you for your sacrifices to our nation."]["Congrats to MG Eric Wesley on his promotion to two-star general. A great leader and most deserving of this honor. https://t.co/D7W3nbuzzc"]["VA Sec asks for tools to improve #VA → Congress provides tools → VA Sec refuses to use tools to protect bureaucrats. https://t.co/7dOlWGsQEI"]["Obama continues to put American lives at risk by releasing #GITMO detainees. https://t.co/Rcc6leRt7A"]["#KansasCommonSense – Visiting @NavalAcademy, fighting for Kansas ranchers and farmers + more https://t.co/SoxEie5aUy https://t.co/5Hp49xJ7KG"]["I AM committed to making the impossible possible for pancreatic cancer research. @PanCAN #WAGEHOPE #ItsTime2016 https://t.co/dc1z96P6nY"]["Started my day at the #WWII Memorial visiting with Kansans on an #HonorFlight. Thankful to all those who serve. https://t.co/WMW3xOkh6z"]["I joined @MariaBartiromo on @SundayFutures to discuss the CIA Director's concerning update on the fight against ISIS https://t.co/nJ4fHTfwYg"]["Had a great time meeting Edgerton area residents for the Annual Frontier Days Festival and Parade this morning. https://t.co/T7fNB5NJVI"]["For rural America to thrive, we need a new generation of young leaders — like these capable @KansasFFA students. https://t.co/io2QZvroMS"]["Pleased #SCOTUS ruled in favor of veteran small businesses &amp; agreed w/ my amicus brief to support Kingdomware. https://t.co/CacAFjSaku"]["Interior Approps Bill protects Kansas farmers from government overreach, #LPC listing &amp; #WOTUS rule https://t.co/dvZJBWI46f"]["Emporia is a finalist for @USATODAY's \"Best Main St.\" of 2016. Voting ends Sunday — join me in showing your support! https://t.co/aUhYSSwAHF"]["The willingness of Kansans to help friends &amp; neighbors is what makes our state such a special place. @KansasAgland https://t.co/i5QggWKZc2"]["Today, @FlyGreatLakes makes their first flight out of @SalinaAirport as round-trip service from Central KS resumes. https://t.co/OFHbgEXGC1"]["Pleased the Senate passed #NDAA today to authorize defense funding &amp; support armed forces. More on my amendments: https://t.co/fRGGRk9tVm"]["Had the privilege of meeting 46 young Kansans visiting DC today with the @KansasYouthTour. Excellent questions! https://t.co/8lAPk4ORED"]["Read #KansasCommonSense—#PrayersForOrlando, meeting w/ leaders from @22ARW &amp; more. https://t.co/FIMsOdDBCH https://t.co/gftTuUvOeU"]["Fall 2016 internship app. deadline is July 1. I encourage you to click here to learn how you can serve Kansans: https://t.co/xzPIkUTvtP"]["I met with impressive Kansas Midshipmen at the @NavalAcademy today &amp; got feedback about my nomination process. #USNA https://t.co/X2es5PzVTM"]["Reports indicate POTUS has finally given up ambition to close #GITMO by executive order—awaiting WH for confirmation https://t.co/gVoc52Zodw"]["When #VA executives put veterans' lives at risk, they must be held accountable. Period. https://t.co/p0qjUuRyyE"]["Robba &amp; I join Kansans &amp; the nation in grieving for the victims of the unthinkable violence in Orlando last night. Pray for the families."]["Good luck tonight, @MattBesler — #ForClubAndCountry, you’re making Kansans proud. #USMNT #SportingKC #CopaAmerica"]["Congrats to BG Jim AuBuchon on his induction to the @ArmyROTC Hall of Fame after decades of leadership &amp; service at @pittstate. #armyrotc100"]["Happy Birthday, @RepLynnJenkins. Looks like you've got the Snickers covered — in your honor, I'm having some M&amp;M's!\nhttps://t.co/4W1PxRU48g"]["#TBT when my Wildcat daughters brought this Jayhawk to a @KState football game &amp; taught me how to #WabashCannonball https://t.co/ivU8PfCIc6"]["#Kansas is in good hands this week with the young leaders of @ksgirlsstate &amp; @KSBoysState at work. Shout out: #ksboysstate #ksgirlsstate"]["30% of released terrorist detainees return to battlefield. More evidence of need to leave detainees at #GITMO: https://t.co/GlFFtIYXhe"]["Nice to meet you, too! https://t.co/hcCnAP9Bp7"]["Releasing #GITMO detainees is an avoidable risk – my #NDAA amendment would prevent these transfers https://t.co/glDApejLZk"]["I'll check this out next time I'm in northwest Kansas! https://t.co/uiNRN5DM8G"]["Great to visit with the Riley, Osage and Franklin Counties @Kansas4Hers who came by my office today. #trueleaders https://t.co/PMADeP0K5s"][".@topekalibrary @ginamillsap, Thanks for making good things happen for Kansans &amp; congrats on #libraryoftheyear!"]["Stand with me &amp; @SenBobCasey, @VFWHQ, @iava, @BlueStarFamily, @military_family + more to support #militaryspouses. https://t.co/NN8fJsKMPG"]["Our health approps committee today passed a bill to support medical research for diseases inc #Alzheimers &amp; #cancer https://t.co/eXeEh4UTDj"]["Congrats to Kansans Vaithish Velazhahan &amp; Andrés de Avila who are @UnitedHealthGrp #DiverseScholars &amp; in D.C. today. https://t.co/B4ZZfwQRCX"]["#KansasCommonSense – Recognizing World War II heroism, 1,393 miles in 6 days + more. https://t.co/BjJUaFkpIo https://t.co/QDnPrnM2Ws"]["72 years since #DDay, join me in saluting the 156K Allied troops who risked their lives to protect our way of life. https://t.co/EQuFT8pupQ"]["Was an honor to be with Harry 'Kit' Beatty &amp; family today in Sabetha to present his POW medal and celebrate his 90th https://t.co/pwmKRV9zvD"]["Like many #Kansas kids, @GoShockers' @RDB_sh31ox learned hard work from an early age. Wishing him all the best.\nhttps://t.co/gLehvbvfL1"]["I'll be joining Steve &amp; Ted on @knssradio 1330 AM shortly — tune in or listen live. https://t.co/pK2fYQJyqL"]["We have a duty year-round to provide quality care to our vets, which is why the VA must research toxic exposure https://t.co/u3XcAe0Rzx"]["Enjoyed catching up w/ @HighPlainsJrnl Publisher Tom Taylor &amp; Editor @hollyrmartin in Dodge City this morning! https://t.co/63IGtHU620"]["Our fallen officers are true heroes. The @KCKPDHQ memorial dedicated today in @CityofKCK honors their sacrifice. https://t.co/9iSYlOkN9P"]["#KansasCommonSense—Memorial Day ceremony, advocacy for vets receiving care under ARCH + more https://t.co/fmvlYIqF6h https://t.co/slERQa739J"]["Working together, we can make Alzheimer’s a preventable, treatable and curable disease. #ENDALZ https://t.co/bUYQeWtm8L"]["Great to be with veterans and 2,000+ local residents at the 58th Annual Resthaven #MemorialDay Service in Wichita https://t.co/RIZvIqEP2k"]["Today we honor the men and women who paid the ultimate price for our freedom. Their acts of valor will not soon be forgotten #MemorialDay"]["Started off #memorialdayweekend with a town hall meeting this morning in beautiful Jewell, #Kansas. https://t.co/5yWg71SmPn"]["Thankful Chapman residents were unharmed by last night’s #tornado. Please stay safe tonight. Preparedness tips https://t.co/VWbXEeZaRs #kswx"]["Pleased to get assurances from VA leadership that ARCH veterans will not experience a lapse in health care. https://t.co/r8mdf7HaQW"]["As severe weather continues across Kansas, I'm grateful for our meteorologists &amp; emergency personnel—stay safe #kswx https://t.co/1LNRG72wJQ"]["Regulatory activism is a hallmark of this admin. Today I joined my colleagues to fight DOL's harmful #fiduciaryrule. https://t.co/mkdS4j6iqz"]["Honored to receive National Retail Federation’s Hero of Main Street Award – our economy depends on success of retailers big &amp; small @NRFnews"]["My #NDAA amendments strengthen prohibitions on #GITMO detainees &amp; increase end-strength levels in armed forces https://t.co/obTWiwO5ZN"]["We all benefit when we give #veterans the resources they need to start small businesses and create jobs https://t.co/hYfEAkFWb6 #smallbiz"]["#KansasCommonSense—Honoring @KCKPDHQ Det. Lancaster, greeting #rftw in Junction City + more. https://t.co/Eeb2e8KFiC https://t.co/MJ9fXJ742S"]["Great news – this is a win-win for @Cargill &amp; @CityofWichita. Keeping Cargill in Wichita protects ~900 Kansas jobs. https://t.co/qSMhFzMYHO"]["Proud to pass the #AdamWalsh Act, which helps law enforcement track known sex offenders and prevent recurrences.\nhttps://t.co/dPKBznn9tV"]["Comparing theme park wait times w/ VA health center wait times highlights why failures continue to plague the VA. https://t.co/fRMxUntERB"]["Consistent support of cancer research is essential to saving lives—we must not let our commitment waiver. #endcancer https://t.co/JdfqpO6QA2"]["Flags flying proudly on I-70 near Wabaunsee Rd early this morning to honor veterans as part of #runforthewall https://t.co/rOBXdXnPv5"]["Appreciated the opportunity to honor our nation's veterans tonight in Junction City. #RunForTheWall https://t.co/hcvUolH23I"]["To all current &amp; former members of our military, a heartfelt thank you for your service &amp; courage #ArmedForcesDay https://t.co/1cyKPNpCwN"]["Well, folks, the secret's out: @CityofWichita loves #smallbiz. @bryan_horwath @ShopKeep https://t.co/LKqMmLdOzt"]["Thanks to @Siemens for representing Hutchinson, Kan., at yesterday's Competitiveness Caucus briefing on the manufacturing workforce. @ITIFdc"]["This #NationalPoliceWeek, we honor the officers who made the ultimate sacrifice in communities across the country.\nhttps://t.co/EKS0AWfHo5"]["#KansasCommonSense—Progress delisting lesser prairie chicken, visiting @DiscoverAtEP + more https://t.co/pBHAPj1Gpl https://t.co/nB7VsxMSbE"]["Tune in to the @SenateFloor—I'll be paying respect to fallen Detective Brad Lancaster &amp; thanking all law enforcement this #policeweek."]["Amazing story—@HOACBSA #EagleScout Nate Reichmuth heroically put his #scouting skills to action &amp; saved lives. @kmbc https://t.co/gaO2wUSxPE"]["Enjoyed touring two cinema-industry @IolaKan companies this morning: @SonicEquipment &amp; Kneisley Manufacturing. https://t.co/XxP12TVWzM"]["In Overland Park this AM to see Sorenson Communications's VRS interpreting service for hearing-impaired individuals https://t.co/FZEuhgV3ic"]["Congrats, @KUDeanNeeli. Great choice &amp; best wishes to the new provost. https://t.co/cLxa1yIMGC"]["Great to be at #McPherson All Schools Day Parade this morning and visit with so many in the community. https://t.co/NoafODsSlE"]["Engaging conversation with @kansasrealtors yesterday about working together to create an opportunity economy https://t.co/U4bMCq3Ix0"]["Whether our kids grow up on a Kansas farm or in a Maryland city, @4H enables them to reach their full potential. https://t.co/JJeCE8x4wy"][".@TallgrassBeer in #MHK &amp; @Boulevard_Beer in #KC bring home 3 medals at the World Beer Cup. #craftbeer #smallbiz 🏅🏅🏅\nhttps://t.co/7PQ7R4GRDY"]["Encouraging to see the progress on new housing for our airmen and their families at McConnell Air Force Base @22ARW https://t.co/rLYuLotT9U"]["I'm asking USFWS for answers re: dropping appeal of #lesserprairiechicken decision &amp; will work to prevent re-listing https://t.co/HlT1FQJrT3"]["Glad to see Sprint commit to hiring 2,500 #vets in 5 years—those who served deserve the best our nation has to offer https://t.co/Wn6YB8QLFH"]["Congrats to #PBSDigitalInnovator Todd Flory on being recognized for his innovative approach in the classroom. @WheatlandVC @AndoverSchools"]["#KansasCommonSense—Protecting ARCH #vets, talking #UAS @FortHaysState, visiting @PittsburgKS https://t.co/zducAt1PLn https://t.co/R0E4lmvMgd"]["This fourth-generation Kansas farmer finds an innovative way to protect his business from ag economy’s ups &amp; downs: https://t.co/5ZNvN7jflY"]["My sincere condolences to the family &amp; friends of the fallen @KCKPDHQ detective—we must honor those who risk all to protect our communities."]["Happy birthday, Sarah! It's great to see Kansans coming together to celebrate one another. https://t.co/z1UTLoZES6"][".@KansasWheat #wheattour16 brought welcome news — farmers expecting near-record wheat yields this year.\nhttps://t.co/jVasQ3lJXj"]["It's encouraging to know so many individuals are praying for their elected officials, Kansas &amp; our country. #NationalDayofPrayer"]["Armed Forces members know the value of hard work &amp; leadership — grateful to @amazon for their commitment to #Vets. https://t.co/bW0CcKGxiq"][".@SpeakerRyan #POTUS has put a campaign promise ahead of what’s in the best interest of Americans—a promise his own admin agrees is illegal."][".@SenatorTester &amp; I called on the VA today to confirm ARCH veterans won't experience any interruption in their care. https://t.co/UpwT7LGYXL"]["#KansasCommonSense—McConnell AFB preps for #KC46, #VeteransFirst bill, Lyons Co Honor Flight https://t.co/KhzDuGZTgw https://t.co/muinR50D7n"]["Thank you for your contributions in Kansas and continued service to our nation! https://t.co/3CXZgl8MSW"]["Sending my thoughts and prayers to @koamnews' Tawnya Bach and her family! https://t.co/A6tpGdNAnt"]["Glad to hear everyone is safe—always grateful to our first responders. https://t.co/GahkBYrFFp"]["I’m proud to support #VeteransFirst—it's full of commonsense provisions to benefit those who served our nation. https://t.co/Kn6Lsurf9D"]["#KansasCommonSense—Restoring TSA screening @SalinaAirport, visiting @FortLeavenworth + more. https://t.co/ev2ouhC5Qi https://t.co/pOETLqLdSm"]["Turns out you can teach an old dog new tricks. @CoachBillSnyder, welcome to @twitter! https://t.co/FUAdDLirwK"]["Severe weather is rolling in to Kansas w/ hail, tornadoes possible. Stay safe &amp; stay aware: https://t.co/sFlsaowyd3 https://t.co/RuwTI5Vmgh"]["I'm always humbled to spend time w/ Kansas veterans at the memorials built to honor them in Washington, D.C. https://t.co/4TikgYsTnI"]["Thanks for having me – it was an honor to address these inspirational #BoyScouts. https://t.co/cb7SAdj1Z3"]["Happy #Passover to the families and friends gathering for seders around the world tonight!"]["At Leavenworth National Cemetery, a solemn reminder. RIP to those who served and sacrificed. https://t.co/ENUmxn70R1"]["LTG Brown of @usacac at @FortLeavenworth's msg today: Teach soldiers to solve complex problems w/ creative solutions https://t.co/8kXemGBZBO"]["Looking out over the Missouri River on the #Kansas border under a full moon. https://t.co/AJrKWtU8Oh"]["#SCOTUS decision underscores need to put full justice for terror victims ahead of cash for Iranian government. https://t.co/pI5ezvK0QZ"]["My bill holds sponsors of terrorism accountable before transferring U.S. funds to #Iran : https://t.co/tkDDbUtbCk https://t.co/xMUb9S6H3m"]["Innovation is key to defense &amp; it thrives at @WichitaState—hope to get answers from DoD on their partnership today. https://t.co/2Bq8G1zg8u"]["My legislation to ensure Wichita-area residents have a safe drinking water supply just passed the U.S. Senate. https://t.co/On84AxytE9"]["Congrats! https://t.co/srXGgmzzhe"]["Great news—TSA will resume federal screening at #Salina Regional Airport. https://t.co/lT7ce7wTVH https://t.co/T7Hf4zGcBS"]["On FAA, @SpiritAero: \"We appreciate Sen. Moran's leadership on this bill that addresses certification reforms w/ a greater focus on safety.\""]["On FAA, @FlyICT: \"ICT greatly appreciates the efforts of Sen. Moran...taking the lead on another issue of great importance to us in Wichita\""]["Proud to pass #FAA Reauthorization strengthening KS aviation industry &amp; making travel safer, cheaper for passengers. https://t.co/1HQaP20EWk"]["Lenexa-based nonprofit @Heart_to_Heart responds after tragedy in #Ecuador—Kansans know how to lift up those in need. https://t.co/GV6yrIE139"]["It's past time for the #VA to address these systemic failures &amp; put veterans 1st—I’ve called on #GAO to learn more. https://t.co/HLfYiuidL2"]["Big portion of Kansas breathing a sigh of relief for the rain today. Already 3\" in Sublette and more on the way. #kswx"]["Check out my @USATOpinion piece on why we should replace our convoluted tax code with the #FairTax — https://t.co/txrQMdOV8E"]["Thank you, @SusanGKomen, for inviting me to speak. Investing in medical research is critical to curing #breastcancer https://t.co/QWMZgqwthP"]["I remain opposed to closing #GITMO &amp; the full approps committee joined me in reiterating this message today: https://t.co/Vbrb6tLNIo"]["In addition to serving as a trusted mentor on my Mil-Vet Advisory Committee, pleased to learn Gen. Myers will be taking over as @kstate_pres"]["Proud to lead the effort to invest in Kansas military construction projects at McConnell AFB &amp; @FortLeavenworth. https://t.co/DEtD4jgCTW"]["savings =&gt; increased financial stability + mobility. My bill w/ @CoryBooker can help Americans save for a rainy day https://t.co/wkxI1DfrtU"]["I appreciate @kcchamber inviting me to speak to members this afternoon. I’m glad to see KC continue to grow &amp; thrive https://t.co/TeKL1osMOz"]["Here's a write-up on my bill to give Congress oversight as the admin transfers detainees &amp; attempts to close #GITMO https://t.co/qSP6vMHckq"]["Proud to join @SenJoniErnst in introducing legislation to encourage a new generation of #agriculture producers. https://t.co/qKARq1TpUG"]["As co-chair of the #DStaskforce, I am proud to stand w/ the #downsyndrome community during the @NDSS #BWW2016. https://t.co/nYEEh7QTJI"]["I introduced a bill today to give Congress oversight as the admin transfers detainees &amp; attempts to close #GITMO https://t.co/SVRmyWPElw"]["We must lower barriers to access #naloxone—a critical resource to protect against overdose. https://t.co/2VH0HXzxLG https://t.co/wXZjseC1qy"]["Honored to receive @USNationalGuard's Charles Dick Medal of Merit Award from such committed, brave men &amp; women https://t.co/dcNz5y5w7W"]["#KansasCommonSense — #vets in ag., medical research funding, #FAA reauthorization + more. https://t.co/nuZzB4DIK1 https://t.co/WcMtfTS3UL"]["Bravo to @ksuchoirs student musicians for their excellent \"Rhapsody\" performance @KauffmanCenter last night in #KC. https://t.co/ebFLybEqOQ"]["\"Day is done, gone the sun...\" https://t.co/QEKf2Gt5l3"][".@ALZIMPACT I am proud to be a strong advocate to #ENDALZ &amp; was glad to visit with Kansas ambassadors this week. https://t.co/tmqSEIRuJF"]["Kansas is an aviation state — that's why I spoke on the floor urging reauth. of the #FAA to make our skies safer.\nhttps://t.co/EH3mZMQmwd"]["I chaired an Ag Approps hearing &amp; heard from SAVE’s Gary LaGrange about opportunities for #veterans in #agriculture.\nhttps://t.co/27RqIi7mrW"]["As crews survey damages from previous fires &amp; new ones develop across #Kansas &amp; neighboring states, pray for rain. https://t.co/nWvxxY91K9"]["Veterans who have a desire to farm &amp; ranch should have that opportunity. Learn more here: https://t.co/GpX1TfKws8 https://t.co/gjEJPyDIaU"]["I signed on to a brief contesting President Obama’s executive actions on immigration. Learn more here: https://t.co/qyAn66Vg9j"]["Tune in! https://t.co/HE3enqEKR0"]["#KansasCommonSense — Emergency fire assistance, checking up on Irwin Army Hospital + more. https://t.co/3TqDgmSuvr https://t.co/vA5Rac0hji"]["Simultaneously caring for our #veterans and developing the next gen. of #Kansas farmers – way to go, Gary and Shari. https://t.co/J5slBz7HW0"]["Enjoyed meeting staff @NexStepAlliance &amp; @Goodwill_Kansas. Thanks for working to create brighter futures in Wichita! https://t.co/qJrTh8RBAR"]["#KansasCommonSense — Pushing to expand coverage for veterans exposed to #AgentOrange + more. https://t.co/fESxGMGD5O https://t.co/gHBmFl9A0K"]["Great read—neighbors come together amid the largest wildfire in Kansas history. This is the #Kansas I know and love.\nhttps://t.co/XCe04mxWJV"]["I am opposed to President Obama’s Supreme Court nominee. To read my full statement, click here: https://t.co/vy68sHoOkv"]["With state of emergency declared, please keep the firefighters &amp; all affected residents close to your thoughts today https://t.co/9bvVpWkgnb"]["#KansasCommonSense—Speaking out for improved veterans' care &amp; against murders in KCK + more. https://t.co/eoeBkUhjm0 https://t.co/ethYPvOOEx"]["TUNE IN: I'll be joining @Mighty1290 in Pratt @ 11 a.m. CT to talk news of the day &amp; my #KansasListeningTour"]["Proud to co-chair Congress's Down Syndrome task force to promote policies that benefit the Down syndrome community. https://t.co/Bn2CxjHPN5"]["Go Hawks! Congrats @CoachBillSelf on the win over UConn. On to the next one. #RCJH #facts @KUHoops"]["Ran into @HerschelWalker promoting a cause we both care about: encouraging physical fitness @TheSFIA #PassThePhitAct https://t.co/NiWXq4Nolk"]["Cyber units in Reserve Component must be trained to meet demand. I appreciate addressing the backlog/slow pipeline. https://t.co/bY5GqYDVL2"]["Thank you! https://t.co/CDzskyEpZV"]["#KansasCommonSense — Fighting #opioid abuse, speaking @sxsw, reviewing @USDA budget + more. https://t.co/Qf96bzxTDA https://t.co/TKNN5WoyiP"]["“Farming looks mighty easy when your plow is a pencil, and you’re a thousand miles from the corn field.\" —Pres. Eisenhower #AgDay #agday2016"]["\"In no other country do so few people produce so much food, to feed so many, at such reasonable prices.\" —Pres. Eisenhower #agday #agday2016"]["Happy #AgDay—Ag is Kansas' largest economic driver, 43% of total econ. Simply put: it matters to us all. #agday2016 https://t.co/mBIzsRZ1Yi"]["I will speak on the @SenateFloor momentarily re: consequences of our broken immigration policies &amp; lives taken in Kansas City last week."]["Off to the airport – beautiful #Kansas morning. https://t.co/PBuJBF1pjU"]["I'm headed to #SXSW today—hope to see you at my panel w/ @KauffmanFDN &amp; @OpenPolicyTx! https://t.co/Q7lN20qeRK https://t.co/JksW1xbaub"][".@RepJeffMiller—Best wishes to you &amp; Vicki. Thanks for your friendship &amp; the honor to serve #veterans alongside you. https://t.co/ZkOGJ9YBVl"]["Will you be at #SXSW? I encourage you to stop by my panel w/ @KauffmanFDN &amp; @OpenPolicyTx on Friday. https://t.co/Q7lN20qeRK"]["Thanks, AG Lynch—Despite admin's track record re: rule of law, pleased detainees won't be transferred to U.S. #GITMO https://t.co/sjciMRtyML"]["On behalf of all Kansans, I offer condolences to a family worthy of respect of a grateful nation. #NancyReagan https://t.co/fjUtdEmdj0"]["Great work – proud of these law students from my alma mater! https://t.co/puLoXQKVC6"]["I hope everyone who will be in #KC this weekend for the Men's #Big12Tournament has a safe &amp; fun time. #EMAW #RCJH https://t.co/8qZQKH96Te"]["#KansasCommonSense — Visiting #GITMO, supporting edu. use of #uas, the farming econ. + more. https://t.co/UJd0e2CWIk https://t.co/CbKKWbjkiE"]["Pleased to learn Wichita-based @SpiritAero was named to @northropgrumman team manufacturing the #B21 bomber. Watch: https://t.co/jBYdEfsbU8"]["Rest in peace, Nancy Reagan. https://t.co/FU06mZkgag"]["I'm about to join @KMBZradio's @ej_becker &amp; Ellen in-studio — tune in or listen live! https://t.co/ybZkxUhd3e"]["Pleased to see the SAFE PIPES Act (S. 2276) unanimously pass the Senate tonight https://t.co/AXRPXISP6A"][".@KUnews @JackRCline @kuengineering We must empower students/educators to innovate &amp; harness the possibility of #UAS https://t.co/wvazclhMqL"]["Happy 75th to @mmschocolate who found a home in Kansas 2 yrs ago. #TBT with @RepLynnJenkins. @MarsGlobal https://t.co/3DN9xG5MJh"]["I'm chairing the Senate Ag Appropriations Hearing at 2 p.m. ET. Watch live on @cspan https://t.co/VBAw3IdMVS https://t.co/6jCI6M7MuX"]["This week's #KansasCommonSense — Questioning Sec. Kerry, ending force reductions + more. https://t.co/0c6BSqiXU4 https://t.co/WhMoTwGy1S"]["Here's my conversation w/ @FoxNews' @UmaPemmaraju on @ANHQDC about the president's plan to close #GITMO https://t.co/khkig22sIe"]["WATCH LIVE — I'll be joining @UmaPemmaraju on @FoxNews' @ANHQDC at 2:45 CT to talk #Gitmo &amp; the president's attempts to close the facility."]["This important bill would help safeguard our nation while global threats demand our full vigilance and capabilities. https://t.co/khhmtT0Zqi"][".@radpac - Thanks for the kind words. Nice to meet with you today, @amykpatel. Your care for Kansans is appreciated. https://t.co/uE40lzirsV"]["#KansasCommonSense—Honoring #JusticeScalia, speaking w/ @krauthammer, town hall stops + more https://t.co/pOVSrgclLk https://t.co/Dg336Bqr7k"]["Appreciated mtg w/ Kansas @AmericanLegion members &amp; have utmost respect for their hard work. #Accountable2Veterans https://t.co/UyqAw9b8PV"]["The president’s move down the path to close #GITMO is reckless &amp; against the law. https://t.co/5A5cbKkeA4 https://t.co/ohHnpWx93p"]["Pleased to be at the @nabtweets conference this morning. Nice to be w/ you &amp; thanks for inviting me to speak #nabslc https://t.co/VmajcJP96m"][".@clairecmc — I'll be praying for your quick recovery &amp; look forward to seeing you back very soon."]["#KansasCommonSense — Strengthened sanctions against #NorthKorea, learning about #Zika &amp; more https://t.co/vPUg7pKRyh https://t.co/Utw1aNQT78"]["It was a pleasure to emcee the @KansasChamber Annual Dinner last night. #16dinner https://t.co/qlUsJhxbyF"]["Thx @RobertDPutnam @BrookingsCCF @MJGerson &amp; more for #familychange discussion w/ @TheAAPSS. https://t.co/PAiW0El4Pa #EconomicMobilityCaucus"]["Happy #PresidentsDay. If you haven't already, I encourage you to check out the @IkeLibrary &amp; learn about Kansas' own President Eisenhower."]["I'm looking forward to joining @ej_becker on @KMBZradio around 8:30 a.m. CT. Tune in or listen live. https://t.co/CBUkfbQ1jN"]["Justice Scalia will be remembered for his intellect, wit &amp; principled approach to the rule of law—thoughts &amp; prayers to his family &amp; friends"]["76-72 #RCJH — Congrats, @KUHoops, on the big win over Oklahoma."]["Privatizing ATC has dangerous, long-term implications on general aviation &amp; the rural communities it serves https://t.co/ORDEkC6yS2"]["Proud to sponsor this resolution recognizing the contributions made at places like @haskellu https://t.co/wVyklXEtf5 https://t.co/tLvdFkvuxT"]["Excited to see the standing room only crowd for the @1MillionCupsICT kick-off this a.m. in Wichita #entrepreneurship https://t.co/AXGgSZMeRL"]["#KansasCommonSense — @FAANews reauthorization, meetings in Washington &amp; defending #2A. https://t.co/VT70GpjNzM https://t.co/q3TW1pCzzn"]["Congrats to the @KState Wildcats on the win against top-ranked Oklahoma. Go Cats! https://t.co/01jzPOjmB9"]["Great to catch up w/ @KState_Pres &amp; @KState_VetDean re: progress on the National Bio and Agro-Defense Facility. https://t.co/4MbKNF05N2"]["#KansasCommonSense — visiting @OlatheChamber, @HaskellU, @opcares &amp; @olatheschools + more. https://t.co/5BQht6Jx4u https://t.co/Lil3HgSe4y"]["I'm proud to display my #GodBlessAmerica banner from @jakesfireworks in my Pittsburg office. #GodBlessPittsburg https://t.co/Wus2Zizgic"]["#GodBlessAmerica is an expression of faith &amp; love for country—to demand the removal of this banner is outrageous. https://t.co/WOi9WsV0GI"]["Spotlighted Kansans: entrepreneurs @BlooomInc, @FortRiley community, &amp; residents of @greensburg_ks. Read my tribute: https://t.co/eRfP8hJf12"]["Kansas, you look good for 155. Happy #KansasDay.\nhttps://t.co/BuehLRIRHd"]["Back at it in Washington on my way to a judicial nomination vote and there's still lots of snow hanging around. https://t.co/v8MYUjYTUt"]["SecDef Carter echoes AG Lynch's remarks: transfer of #Guantanamo detainees to US is illegal. https://t.co/OixCZfv5FX https://t.co/OztHiCGWYD"]["TUNE IN: I'll be speaking with @ArthelNeville on @FoxNewsSunday about my bill addressing victims of #Iran terrorism today at 11:15 a.m. CT."]["US must prioritize terror victims ahead of Iran. Remind that terror &amp; hostage taking aren’t for-profit enterprises. https://t.co/MsVbv1Gpok"]["The administration continues to push forward w/ their irresponsible approach of releasing terrorists to close #GITMO https://t.co/vPj7Dyln6d"][".@WSJOpinion—New Senate bill would put justice for victims of Iranian terror ahead of payments to Iran. https://t.co/CkPKeXLnTD"]["U.S. should put justice for American victims of Iranian terrorism ahead of compensation for the Iranian regime. https://t.co/CkPKeXLnTD"]["I'm disappointed POTUS chose to veto the resolution to reverse the EPA’s #WOTUS rule. #DitchTheRule https://t.co/jZc9f4n1Pr"]