["Boston has had many great mayors in its remarkable history, and @marty_walsh can proudly take his place among any of them. Thank you, Mayor, for giving me the honor of presiding over your swearing-in today. https://t.co/wiK3t5u8wX"]["Jill and I, and the whole Biden family, want to wish you a happy, healthy, and safe holiday season. https://t.co/X2xHY8pjtT"]["It’s been five years since 20 first-graders and 6 educators were murdered by a gunman at Sandy Hook Elementary School. Their families continue to inspire me with their courage in turning tragedy into purpose. https://t.co/RSOU6d7dXI"]["Ann Arbor - I’m terribly sorry I won’t get to see you this evening, but we want to make sure everyone can safely make it to #AmericanPromiseTour. Be safe in the snow. I’m looking forward to seeing you on February 5th."]["Help your friends and loved ones get the peace of mind of health insurance for 2018. Remind them that this Friday is the deadline to sign up for health insurance through https://t.co/B3aPObavkV"]["Doug Jones. Thank you, Alabama. You’ve elected a man of incredible integrity, grit, and character. A fighter for working class and middle class Alabamians. He is going to make you proud in the Senate."]["Tomorrow, the people of Alabama will decide whether the United States Senate will gain the courage, character, and integrity of Doug Jones. Find your friends who can vote there, and make sure they're planning on doing it. \n\nhttps://t.co/JTf5VPJCpu"]["The people of California are on my mind as they suffer through these devastating wildfires. Amidst the loss, I’m inspired by the bravery &amp; commitment of our firefighters. Day after day going back into the flames, risking their lives to save others. Incredible bravery."]["It’s a little too cold for ice cream in Madison, but I hope you liked the cupcakes all the same. Thanks for spending your birthday with me, @ElaineWelteroth - hope this next year is a great one. #AmericanPromiseTour https://t.co/qj0d6xbz8n"]["Be who you are. Stand for what you are. Few people embody that better than @melindagates. Enjoyed discussing #PromiseMeDad, public service, and faith with such a remarkable woman in Seattle last weekend. #AmericanPromiseTour https://t.co/IFfARAWyct"]["I'm going to keep speaking out on the importance of standing up to the Kremlin through my work @PennBiden. My colleague @mikercarpenter and I have written in @ForeignAffairs about the steps we need to take to defend our democracy. https://t.co/o2b9Do0nTf"]["I've been on the road talking about #PromiseMeDad, the book I wrote about my son Beau, but I've been most amazed listening to your stories. Incredible people overcoming loss, finding hope and purpose in their lives. Thank you for sharing. You inspire me. https://t.co/Y7IzxK9m5l https://t.co/eOaplWRr8N"]["No one who has ever met Sandy Winnefeld has doubted his strength or resolve. And no one who reads this article will ever forget it. Sandy &amp; Mary - thank you for summoning the courage to turn your heartbreak into action to end this epidemic. https://t.co/8CKEgmt61S"]["One of the best shines I’ve ever had. https://t.co/1BwrihNF32"]["Throughout my career in public service, I’ve heard a lot of great ideas, and developed a few of my own. Now we want to hear yours. Join us: https://t.co/d11GvD5eFJ"]["Every week, we’ll hear from leaders in business, politics, academics—and everyday Americans sharing bright ideas that keep us moving forward."]["Today I’m announcing the launch of the Biden Forum, a new space for conversations about America’s future: https://t.co/RS1zFw4Psk https://t.co/XT731eD6ta"]["Thank you to the #AmericanPromiseTour moderators and thousands of readers who attended events or picked up a copy of #PromiseMeDad. Honored to be able to share the story of my son Beau, and what a remarkable man he was. https://t.co/Y7IzxKqXtV https://t.co/Qp0l3qTJTz"]["May today serve as a reminder of our solemn duty to look after the men and women who have served in our Armed Forces and sacrificed so much for this country. #VeteransDay2017. https://t.co/fxGOqbzeSr"]["You’re going to make us all proud, Danica. https://t.co/doouBh0qME"]["Juanita Perez Williams ran an incredible campaign in Syracuse. So proud of the work she did. And still hoping for a win for Manka Dhingra that will change the shape of Washington’s state Senate!"]["And mayors like Rick Kriseman and Joyce Craig who are incredible leaders in their communities."]["State legislators like Sara Cambensy in Michigan and Danica Roem, Jennifer Carroll Foy, David Reid, John Bell, and Elizabeth Guzman in Virginia. People who stood up for working people of every stripe."]["Candidates like Ralph Northam and Justin Fairfax, who will ensure that Virginia’s economic recovery continues to reach every town and city in the commonwealth."]["A resounding defeat tonight for President Trump. Voters around the country rejected the ugly politics we have seen this past year. Instead, they chose candidates who unite and inspire us."]["Folks, there's an election happening tomorrow. We've got to keep our eye on the ball. Let's get this done. https://t.co/UWl53fswMz"]["These tragedies aren’t inevitable. Don’t let hopelessness win today. We must persist in our efforts to prevent gun violence."]["Americans again murdered in a place of worship. Jill and I send our prayers to Sutherland Springs."]["Don’t let politics &amp; misinformation keep your loved ones from getting health insurance. Call/text them today to make sure they sign up!"]["Today is the first day to sign up for 2018 health insurance through https://t.co/3CYKhP8ZoR. Deadline is December 15th! https://t.co/GtpN0DiugI"]["New York, we love you. Grateful to first responders who saved lives today. Jill and I are keeping you all in our prayers."]["Honored to work with a woman of great courage, my friend @ladygaga. With her leadership, and your help, we can change the culture. #ItsOnUs https://t.co/ZcaOqncopa"]["Alabama, this gets to the heart of why you should vote for Doug Jones on December 12th. A man of incredible integrity and intellect. https://t.co/sjgtmICxUf"]["@JohnKasich @UDelaware @UDBidenInst There's a lot at stake, but John and I are still optimistic. I hope you'll tune in at 1:00PM -  https://t.co/0z8dtU3guo"]["Looking forward to welcoming Gov @JohnKasich to @UDelaware @UDBidenInst to discuss bridging partisan divides &amp; restoring faith in government"]["John McCain is the real deal. A model public servant. And my dear friend. I was honored to present him with the 2017 #LibertyMedal tonight."]["Unilaterally putting the Iran deal at risk does not isolate Iran. It isolates us: https://t.co/Cj1zu126bb"]["Proud to be at @RutgersU today with survivors &amp; activists working to change the campus culture on sexual assault. #ItsOnUs"]["Spoke to my friend Jim Murren, so proud of the men and women at MGM Resorts. #VegasStrong"]["Jalal Talabani was a champion of the US-Iraq partnership and a friend, whose unifying leadership will be missed."]["Barack &amp; Michelle: all of the Bidens send our love today on your 25th anniversary. May you have many more years of joy still to come."]["How long do we let gun violence tear families apart? Enough. Congress &amp; the WH should act now to save lives. There's no excuse for inaction."]["Appalled by the senseless loss of life in Las Vegas. Jill and I hold all those affected and grieving in our hearts."]["Now is not the time to go backward—it's on all of us to stop sexual violence. https://t.co/EUh61Mjmit"]["There is only one way to confront hatred and prejudice: head on. Well said, Lt. Gen Silveria. https://t.co/vQ2Aflo8Tx"]["We Veeps stick together. Jill and I, and all of the Bidens, are with you, Julia. https://t.co/JP0c2wtrJ6"]["Southern Florida chose a proven leader and consensus builder yesterday. Congratulations to @Annette_Taddeo, Florida’s newest State Senator."]["Beau fought to protect the most vulnerable among us. Thanks to my friend @barackobama for honoring his life’s work with the @BeauBidenFdn. https://t.co/oHAb6mc6fT"]["Today's Title IX decision is shameful, but the law is still the law. Colleges &amp; universities must honor obligations to students &amp; survivors."]["@UDBidenInst @PennyPritzker @Airbnb @LinkedIn On the @UDBidenInst blog, @LinkedIn's @allenb says better data &amp; mentoring can help workers find good jobs. More: https://t.co/ZHBjH0ySix"]["@UDBidenInst @PennyPritzker @Airbnb @LinkedIn Following @UDBidenInst’s forum on work, @Airbnb's @bchesky writes how technology can empower people and work. More: https://t.co/DW3kD2vT8J"]["On the new @UDBidenInst blog, @PennyPritzker, @Airbnb &amp; @LinkedIn share strategies to help American workers succeed: https://t.co/ZMPkwBcBsu"]["Sending prayers to all who lost loved ones in the devastating earthquake. We are seeing the resilience and heart of the Mexican people."]["#ItsOnUs is making great progress toward ending sexual assault, but today we face new challenges: https://t.co/gUdR13uYeY"]["Just had the chance to see President Trump's golf swing tweet. Enough. This has to stop. Our children are watching."]["Here's a path forward to choose a future that puts work first: https://t.co/Y6B2q21nHF"]["My new initiative at the Biden Institute will identify strategies for building a future of quality jobs: https://t.co/Y6B2q21nHF"]["America is strongest when we lead with our values—at home and abroad. https://t.co/g8vGlXdeqz"]["23 years ago today, the Violence Against Women Act became law. VAWA is changing the culture &amp; saving lives, but our work continues. #VAWA23"]["16 years ago today, terror tried to break us. It did not, and will never, succeed. Our grit &amp; determination are the strongest force I know."]["Jill and I are praying for the safety of everyone in the path of Hurricane Irma this weekend. Stay strong - the country stands with you."]["Any change that weakens Title IX protections will be devastating: https://t.co/8E3n3RIMTS"]["Brought by parents, these children had no choice in coming here. Now they'll be sent to countries they've never known. Cruel. Not America."]["We are living through a battle for the soul of this nation.\nhttps://t.co/2XtpeyhVex"]["Praying tonight for the victims of #Barcelona attack &amp; their families. Heinous acts of terror cannot break the spirit of our Spanish friends"]["There is only one side. #charlottesville"]["No. Not in America. We must be stronger, more determined and more united than ever. Racism and hate have no place here. #charlottesville"]["Your service has been a great gift to the country, and your friendship and brotherhood are a great gift to me. Happy birthday, @BarackObama. https://t.co/1uSEkU01k9"]["Thrilled to see the 2028 Olympics coming to Los Angeles. Thanks to @MayorOfLA Garcetti who worked hard to secure a big win for US athletics."]["Hope to see you at a stop this fall on my #AmericanPromiseTour – tickets are available now: https://t.co/Y7IzxK9m5l https://t.co/LnW8Ob2ah8"]["Thank you to everyone who tirelessly worked to protect the health care of millions. You saved lives."]["To all of you working to stop Republicans’ devastating “health” bill: Thank you. We’re not done yet. Please keep going."]["Any final bill that looks anything like their proposals so far would be devastating."]["Every patriotic American who is qualified to serve in our military should be able to serve. Full stop."]["The GOP's \"health\" plan would gut care &amp; treatment for opioid addiction. Call your senators—the time to act is now. https://t.co/ZHX7KZLgXk"]["Incredible progress in cancer research and treatment in just the last year offers new promise and new hope. You can win this fight, John."]["John and I have been friends for 40 years. He's gotten through so much difficulty with so much grace. He is strong - and he will beat this."]["@washingtonpost I was a senator for 36 years. I can assure you that your call matters. Your viewpoint might not always win, but your senators hear you."]["@washingtonpost Especially if you live in WV, NV, AK or OH now is the time to call your senators. Or, encourage your friends in these states to call."]["@washingtonpost If you believe health care is a right for all, make sure your senators know that this bill is a big step backward."]["@washingtonpost All Americans deserve the peace of mind that comes with knowing that you can get affordable care. But that’s now under threat."]["@washingtonpost By denying this right, Republican leadership’s “health” bill is fundamentally flawed. It can’t even be fixed on the floor."]["@washingtonpost Republican leadership's “health” bill would return us to a time when health care was a privilege for the wealthy, not a right for all."]["Excited to share news about #AmericanPromiseTour - a series of conversations I’m hosting around the country https://t.co/Y7IzxKqXtV https://t.co/lpVu14LZsZ"]["Jill &amp; I send our condolences to the loved ones of service members lost in MS crash—those who wear the uniform are the heart of our nation."]["Happy 4th of July! America continues the march toward tolerance, diversity and equality of opportunity that began in 1776—that's patriotism."]["We’re live in a few minutes to talk about how @BidenCancer will bring renewed urgency to the fight against cancer: https://t.co/1rcV1XdLmS"]["Jill and I are excited and ready to take the next step toward ending cancer. Are you with us? https://t.co/vVDk81oRtq"]["Let's see a bill that actually tries to improve folks' health care, and then we can have a reasonable debate about how to best do that."]["Especially now, when so many communities are struggling with opioid addiction, the bill's drastic cuts to Medicaid are cruel."]["Slashing Medicaid hurts kids, the elderly, people with disabilities and those struggling with addiction. All for tax breaks for the wealthy."]["The Senate health bill isn't about health care at all—it's a wealth transfer: slashes care to fund tax cuts for the wealthy &amp; corporations."]["America’s soul is rooted in the promise of opportunity. We must protect, support &amp; welcome refugees to keep that promise. #WorldRefugeeDay https://t.co/4K3exquxgl"]["Jill and I are praying for the people of Colombia and the families of the victims of tonight's bomb explosion. #BogotaEstoyContigo"]["Congrats &amp; good luck to my former staffer Dr. Tony Allen, incoming Provost of @DelStateUniv! A great fit for a passionate public servant."]["Jill and I are praying for the victims and their families. Grateful for courage of my former colleagues, first responders &amp; Capitol Police."]["We meet unspeakable tragedy and hate with unbound resolve. I stand with the LGBTQ community, today and every day. #OrlandoUnitedDay. https://t.co/9lvBiV8q1k"]["Honored to see Ecumenical Patriarch Bartholomew in Athens – his leadership on climate change and the environment is the example we need now https://t.co/VO2zdVc3Gc"]["Great to be with @PennBiden in Athens. A Europe whole, free, &amp; at peace remains vital to U.S. security–as it has been for the past 7 decades"]["Congrats to Ambassador Andy Young, a dear friend and inspiration, on 85 years. Wish I could be in Atlanta tonight for AJY Leadership Awards."]["We're already feeling impacts of climate change. Exiting #ParisAgreement imperils US security and our ability to own the clean energy future"]["It's time for big dreams and #AmericanPossibilities. If you're ready to elect folks who agree, say you're in: https://t.co/HyJR0b0KxA https://t.co/nmvlgZfKYN"]["America is at its best when we’re OPTIMISTIC and we THINK BIG."]["It’s time to remember who we are as Americans: Giving EVERYONE the opportunity to achieve the impossible."]["Our politics has become too small and petty. We’re better than this."]["America has always thought BIG. It’s stamped into our DNA."]["Climate change is an existential threat to our future—staying in #ParisAgreement is the best way to protect our children &amp; global leadership"]["To our nation's fallen troops: we thank you and will never forget. To their families: remember, you are never alone."]["Zbigniew Brzezinski's brilliant strategic mind enriched American foreign policy for decades--his distinctive voice will be greatly missed."]["Great to see Mayor @marty_walsh, and hear about everything he's doing to keep Boston strong. https://t.co/U74RGLciBb"]["LGBT rights are human rights. Prejudice is prejudice; inhumanity is inhumanity.  #IDAHOT #IDAHOT2017 https://t.co/XyAWDqAtAJ"]["To the teacher who inspires me every day, and all the other amazing teachers changing lives, Happy #NationalTeachersDay! https://t.co/cismp3x67d"]["Millions of Americans will lose coverage. Up to the Senate now. Hoping for courage to return."]["Day of shame in Congress. Protections for pre-existing conditions, mental health, maternity care, addiction services -- all gone."]["Dan Rooney embodied everything I was raised to believe being Irish meant – generosity, decency, warmth, dignity &amp; a truly genuine spirit."]["Boston represents what it means to never yield, never cower, never stand down &amp; lead the way. America owns the finish line. #OneBostonDay"]["When faced with crimes of hate and inhumanity, every person of conscience must speak out in support of #LGBT rights https://t.co/crzQTFQKmS"]["Our mission is to influence, shape and work to solve tough problems facing the nation."]["#BidenInstitute’s goal is to create a world-class destination for scholars, policymakers, activists and leaders."][".@Udelaware is my home, been with me every step of the way. Today, it felt like I never left. I am so proud to launch the #BidenInstitute https://t.co/90XBT0tD1N"]["Being an American means being treated equally under the law, no matter who you are or who you love https://t.co/XiPAcWTMgD"]["Today, I called on students across the country to speak out and step in to stop sexual assault. #ItsOnUs"][".@PennBiden @Penn Join me as I discuss foreign policy with @Penn president Amy Gutmann. @PennBiden https://t.co/Siou5b7jTC"]["Follow @PennBiden to get involved and check out the livestream of my conversation on foreign policy with @Penn president Amy Gutmann today."][".@PennBiden will work to defend &amp; amend the liberal international order so that it sustains American prosperity and works for everyone."]["I am confident America is better positioned than any other nation in the world to lead in the 21st century."]["I’m proud to continue my work on national security issues through the new @PennBiden Center for Diplomacy and Global Engagement."]["The correct word for sex without consent is rape. Period. #ItsOnUs to know the signs and to stop it. https://t.co/yGBRIKiHod"]["Every American who worries about getting health care when they get sick can breathe a sigh of relief today."]["Checks &amp; balances? Chair of cmte investigating WH can't share info w/ WH. McCain is right: Need select committee!"]["Jill and I -- and the whole Biden family -- wish everyone a very safe and happy St. Patrick’s Day."]["Like many other Irish Americans, I’m proud of my Irish heritage and of my family’s contributions to our nation."]["Last year I had the privilege of walking down the streets my great-great grandfather once walked, in County Louth, Ireland. https://t.co/GsvB7DPCXk"]["Today at #SxSW, we’re laying out how we’ll harness the momentum of the past year to make real progress. https://t.co/9nWDw27hhm"]["This fight is personal for Jill and me.  It’s personal for almost every American."]["Jill and I were honored to take the stage today at #SxSW. Join us in seizing the urgency of now to end cancer as we know it. https://t.co/TemXB9baJQ"]["Standing up for women is the cause of my life. We must change our culture to end violence against women #IWD2017\nhttps://t.co/0t5nS9eGEW"]["Congratulations @TomPerez - You will help ensure our party continues to fight for economic fairness and for all to be treated with dignity."]["Our tolerance and diversity make America great. We are safer and stronger when we welcome the brightest, best and bravest with open arms. https://t.co/axggT3DRiZ"]["From fighting cancer to changing the culture on domestic violence — we’re just getting started. Join us: https://t.co/QHaFokMnrZ"]["We cannot yield an inch on all the progress we have made on civil rights and human rights."]["Now more than ever, we must work hard to preserve everyone's shot at the American Dream. Today Jill &amp; I are proud to launch @BidenFoundation"]["Folks, don't forget to stay in line! If you're in line when polls close, you're entitled to cast your ballot. https://t.co/NuF8byPfsS https://t.co/LGkpzd7Ang"]["There are world-class candidates running at all levels in this election. Vote down the line for Democrats who will keep us moving forward. https://t.co/8Y5dX89QW7"]["We've come so far and all the progress we've made is at stake. You've got to vote. Bring a friend and get it done: https://t.co/Hy8C4mIL2M https://t.co/o3NyzpzUHj"]["Vice President Biden on the importance of electing senators who will come together and work for every American: https://t.co/unK1ry1hfG https://t.co/HrdoPCf7iu"]["1. Make sure you know how to vote today: https://t.co/Hy8C4mIL2M\n2. Get on the phone and make sure others do, too: https://t.co/tS5yvtd2iK https://t.co/OOoJhZf6p1"]["\"Let's make history tomorrow. Let's send a signal to the rest of the world that America is still the brightest beacon of hope.\" -VP Biden"]["\"We're America! We don't scare easily... We never bow. We never bend. We never break.\" -VP Biden with @timkaine 🇺🇸 🇺🇸 🇺🇸"]["\"If we come together, there's nothing, nothing that can stop us.\" -VP Biden with @timkaine"]["\"We are endowed by our creator with certain inalienable rights. EVERYONE is endowed with those rights.\" -VP Biden with @timkaine"]["\"@timkaine and I believe, we really believe, that there's no reason why we can't do so much better politically.\" -VP Biden"]["\"Every time there's a problem in Congress, I get sent to the Hill. Tim, get ready!\" -VP Biden with @timkaine"]["\"We have a responsibility not only to vote... but to bring this country together when tomorrow is over.\" -VP Biden with @timkaine"]["\"We're on the precipice of an American century like we've never ever thought of before.\" -VP Biden with @timkaine"]["\"There has never been a more important tomorrow in the modern electoral history of the United States of America.\" -VP Biden with @timkaine"]["You've got to have a plan. Make one before Tuesday. https://t.co/xghcJF6D9n"]["\"Vote! Get your friends out — every single vote counts.\" -VP Biden\nhttps://t.co/Hy8C4mIL2M"]["\"12 years of education is not enough in the 21st century... simply not enough.\" —VP \nDems want to prioritize sending students to college."]["\"This is the person, along with Donald Trump, who says we should not be spending money on Pell Grants.\" —VP Biden on Rubio at @FAMU_1887"]["\"Character is destiny—you've got a guy running... who doesn't have the courage to stand up and say I won't vote for him.\" —VP on Marco Rubio"]["\"One of my proudest accomplishments was writing the Violence Against Women Act — which Marco voted against last time.\" –VP Biden in FL"]["\"Folks, tomorrow. Tomorrow is... going to impact on your lives like no other tomorrow.\" -VP Biden at @FAMU_1887 \nhttps://t.co/Hy8C4mIL2M"]["We need your help to make calls and ensure every voter turns out to cast their ballot for Democrats tomorrow: https://t.co/31F60tiAC9 https://t.co/ROChevjn9W"]["Election Day is nearly here! Find your polling place and everything you need to vote on Tuesday: https://t.co/Hy8C4mIL2M https://t.co/czvIzw9qkS"]["Can you step up to knock on doors or make calls? We need your help electing Democrats at all levels: https://t.co/4YOcuPybxB https://t.co/EUC2M2s5C2"]["\"Give the people a chance. Ordinary people can do extraordinary things. I'm counting on you to do extraordinary things.\" https://t.co/wEWNUjl7hC"]["\"We will own the finish line in the 21st century. God love you, go out and vote, vote, vote!\" —VP Biden \nhttps://t.co/kApFiopxid\n#votebluewi"]["\"My word as a Biden — I've never been more optimistic about the prospects of the United States than I am this very day.\" —VP Biden"]["\"I don’t know anybody, in the neighborhoods I grew up in, who could go 3 months without a paycheck.\" —VP \n\nDemocrats believe in paid leave."]["\"When we took office, the unemployment rate was above 10%. It's now below 5%.\" —VP Biden #Progress #votebluewi"]["\"These guys… seem to be carbon copies of each other.\" —VP Biden on Ron Johnson and Donald Trump. #votebluewi"]["\"This man is totally, thoroughly... unprepared and unqualified to be the Commander-in-Chief of the United States of America.\" —VP on Trump"]["“Johnson says the jury is still out on climate change… talk about being out of it.” —VP campaigning with @russfeingold #votebluewi"]["We are just getting started. Our best days are ahead of us. Do your part. Vote. And bring a friend. —Joe \n\nhttps://t.co/kApFiopxid https://t.co/CKoqFqAJf0"]["We’ve got a lot of good Senate candidates to vote for. People committed to doing the hard work, who will never stop fighting for you. https://t.co/HL0QgP5z8T"]["We have to elect @HillaryClinton in 5 days. But she has got to have a Congress to work with. Vote down the line."]["I won my first election to the Senate by a little over 3,000 votes. I’m deadly serious when I say showing up matters. Your vote counts. https://t.co/N1IsL67Srm"]["Take it from the Vice President, you've got to make a plan to vote. https://t.co/Q1hvj18XY3 https://t.co/pVVTcI3Vm0"]["\"Folks, there's only 14 days left until Election Day....go vote!\" -VP Biden\nhttps://t.co/Hy8C4mIL2M"]["\"Americans never bow. Americans never bend. We never break. We endure, we overcome, and we continually move forward.\" -VP Biden"]["\"Republicans talk about productivity. They haven't produced anything that generates economic growth so far. Not a joke.\" -VP at @ChathamU"]["\"@KatieMcGintyPA knows who built the middle class, and you should if you don’t: L-A-B-O-R. Organized labor built the middle class.\" -VP"]["\"You can tell a lot about a candidate...by looking at the people who oppose her.\" -VP Biden supporting @KatieMcGintyPA"]["\"[Trump] is thoroughly unqualified based on his conduct, his abuse of power, and his lack of substantive knowledge.\" -VP Biden at @ChathamU"]["\"Can you imagine any president getting up at 3:30 in the morning and tweeting vitriol... What does that say about who we are?\" -VP Biden"]["Being a Democrat has always meant buckling down and getting it done for working people. https://t.co/8u0HwVyrlc"]["“No one can compete with us… America never bows… We will own the finish line.” –VP Biden in Pennsylvania  🇺🇸 🇺🇸 🇺🇸"]["“Our system is built on the notion of consensus. @Maggie_Hassan knows how to do that without yielding on principle.” –VP Biden #NHTogether"]["“It’s really, really important that we elect @Maggie_Hassan.” –VP Biden\n\nhttps://t.co/kApFio7VTD"]["Be one of the millions of Americans who vote before Election Day. Head to https://t.co/tu6W6eS9xR for more information. https://t.co/rVsdNYv6Vd"]["When your advisers call folks who can't afford nannies \"the little people,\" it's clear you don't understand America. https://t.co/CgxS5qyxDH"]["\"Please, please, please, up until the polls close, do everything you can.” –VP Biden\n\nhttps://t.co/I7XFm9x7z2"]["“She will not back down. She will fight like hell for all of those things that affect people’s lives.” –VP Biden supporting @CatherineForNV"]["“Wealthy people are good people… But one thing they don’t need is more tax breaks.” –VP Biden"]["“Hillary is going to need a Democratic Senate.” –VP Biden campaigning with @CatherineForNV"]["The words are demeaning. Such behavior is an abuse of power. It’s not lewd. It’s sexual assault. –Joe"]["One thing's clear: @TimKaine and Hillary have hardworking Americans' backs. The VP's office is in good hands. –Joe #VPDebate"]["Listen to Vice President Biden — go to https://t.co/Hy8C4mIL2M, register to vote, and make your voice count for @HillaryClinton. https://t.co/5NxqbgUSb8"]["VP Biden is back in Philadelphia and taking over @TheDemocrats' Instagram from the campaign trail. Follow along: https://t.co/Tjybk1cUg7 https://t.co/u8tjeXlHQq"]["Register and vote for Democrats like @HillaryClinton and @KatieMcGintyPA: https://t.co/tu6W6eS9xR #iRegistered #VoterRegistrationDay https://t.co/SAyxI29a6C"]["Tonight, @HillaryClinton proved she is ready to be President — and Donald Trump proved he is not. #debatenight https://t.co/Zeq5iF09Bc"]["Take it from those who have been there - Trump is not ready for the responsibility of being president: https://t.co/MCmcwcOwju"]["Doughnuts &amp; volunteers help fuel this campaign. Happy to bring some treats &amp; say thanks in Charlotte this week. -Joe https://t.co/tRQ3nuh24Y"]["On VAWA's 22nd anniversary, join VP Biden and recommit to fighting to end domestic violence: https://t.co/AMoKY0OkUQ https://t.co/PKjhVgaIG3"]["Every woman in this country deserves to be free from harm and from fear. Proud to celebrate 22 years of the Violence Against Women Act. -Joe"]["Fights for working people. Respects immigrants. Good taste in sunglasses. @timkaine is ready to be Vice President. https://t.co/vswV07WOZW"]["Folks, we've got to elect @HillaryClinton and take back the Senate. Let's roll up our sleeves and get to work. -Joe https://t.co/7MyhWs9sAc"]["\"They said we'd never make more than 6 million cars a year again. We made 17 million last year!\" -VP Biden"]["\"My dad used to have an expression...don't tell me what you value. Show me your budget — I will tell you what you value.\" -VP Biden"]["When you give the American people a chance, they'll never let you down. Happy to be here in Ohio today. -Joe https://t.co/0P5mjivYHJ"]["The Vice President is talking to you live from UAW Local 1714 in Warren, Ohio. Tune in now: https://t.co/7HFnJ3pr4v"]["\"My name's Joe Biden, I'm for @HillaryClinton and @Ted_Strickland. And Donald Trump is dangerous.\" -VP Biden"]["\"It's about the stuff we're made of. It's about our values... Hillary gets it in her gut. She gets it.\" -VP Biden"]["\"This ain't your father's Oldsmobile. This ain't your father's Republican Party.\" -VP Biden"]["\"[Trump] was born with a silver spoon in his mouth that he's now choking on because his foot's in his mouth along with the spoon.\" -VP Biden"]["\"The neighborhood you come from is where your character is etched. Where your values are set.\" -VP Biden https://t.co/DQ99r0Od7e"]["\"I know I would not be standing here today as Vice President without you all – without the American Labor movement.\" -VP Biden"]["\"My biggest problem with Donald Trump... is the way he treats people.\" -VP Biden"]["We're fighting for the middle-class workers who make America great. Follow along as VP Biden is back in Ohio today. https://t.co/lJUMetkav0"]["Joe and Hillary went home to Scranton. Take a behind-the-scenes look at their visit: https://t.co/xdiqa0dbdP"]["Eight years ago today, and the progress we've made is remarkable. —Joe https://t.co/E54GhFlMq0 https://t.co/uTNNqr37ss"]["We are America, and we're second to none. Together, let's elect @HillaryClinton the next President. https://t.co/F7K3fplY09"]["Scranton, she has your back. Do you have hers? Visit https://t.co/tu6W6eS9xR to make sure you're ready to vote for Hillary in November. -Joe"]["\"It is never, never, never ever been a good bet to bet against the United States of America.\" -VP Biden"]["\"Trump’s ideas are not only profoundly wrong. They’re very dangerous. They’re very un-American.\" -VP Biden"]["\"On every issue that matters most to our security, Donald Trump has no clue what it takes to lead this great country.\" -VP Biden"]["\"[Trump] is trying to tell us he cares about the middle class? Give me a break... That's such a bunch of malarkey!\" -VP Biden"]["\"Hillary Clinton. She’s always been there. That’s her life story. And let's state the obvious—that is not Donald Trump’s story.\" -VP"]["\"Everyone is entitled to be treated with dignity and respect... and America can be defined in one single word — 'possibilities.'” -VP Biden"]["VP Biden is about to go live on https://t.co/c0F9NPZ9dY. Tune in for a live behind-the-scenes preview from Scranton."]["Those are the values that Joe Biden brought to the White House &amp; they're the values @HillaryClinton will bring, too. https://t.co/crrQwousyw"]["Scranton families like the Bidens know the meaning of hard work and giving your kids a better life. https://t.co/MQoe5IxJUb"]["The VP is stepping up to the plate in Scranton again. He'll introduce @HillaryClinton to his hometown in a few hours https://t.co/iVjE25ohxl"]["No one wants to earn a Purple Heart. But to those who did, you have America's unending gratitude and admiration. Thank you. #PurpleHeartDay"]["America is going to see what VP Biden already knows — just how much @HillaryClinton cares about our country. https://t.co/OakQ0Yhw0l"][".@SarahEMcBride - Beau loved you, I love you, and all the Bidens are proud of you. -Joe"]["Our choice in November is between division and hate — and the idea that we're stronger together. Let’s go. https://t.co/Vc7191V3pq"]["\"I am more optimistic about our chances today than when I was elected as a 29-year-old kid to the Senate.\" -VP Biden #DemsInPhilly"]["\"It's never been a good bet to bet against America.\" -VP Biden #DemsInPhilly"]["“The threats are too great and the times are too uncertain to elect Donald Trump president of the United States.” –VP Biden #DemsInPhilly"]["\"He has no clue. Period.” –VP Biden on Donald Trump #DemsInPhilly"]["\"There's only one person in this race who will be there... That's Hillary Clinton's life story.\" -VP Biden #DemsInPhilly"]["\"This is kind of a bittersweet moment.\" -VP Biden\n\nEight years ago: https://t.co/zq2u667z7f"]["I've seen Hillary in the Senate &amp; the Situation Room. Clear-eyed. Steady. Understands working people. Exactly the leadership we need. –Joe"]["It’s good to be back, folks. We've got less than 4 months until Election Day, and I need you with me. Let's go elect some Democrats. –Joe"]["Celebrating the workers who built this country. #MayDay http://t.co/s6Tc15VBbi"]["5 years ago I watched Pres. Obama sign the Affordable Care Act. We should all be proud of the difference it's made in millions of lives –Joe"]["This #progress is extraordinary, but we're not done. Add your name to keep the momentum going: http://t.co/lB20ILcmGq http://t.co/S919Af9VwD"]["♥ http://t.co/ZGFT0PqoEj"]["Happy birthday, @TheEllenShow! Vice President Biden surprised her on the air. Watch: http://t.co/PwEKS32gLo"]["VP Biden is going to be listening to the #SOTU at 9pm ET tonight - join him here: http://t.co/NBNUZ6ibQe"]["\"How do we make it better?\" Listen to VP Biden preview the State of the Union address: http://t.co/xIUBDInsIl #SOTU http://t.co/6UZbvWaGRR"]["The example set by Dr. King is one that inspires us to work toward a more just and equal future. Today, we celebrate that legacy."]["VP Biden on how you can join millions of Americans who have quality health care thanks to the Affordable Care Act: https://t.co/UG3RuGpSb4"]["Happy Chanukah! Vice President Biden will be speaking at the National Menorah Lighting at 4pm ET today. Listen here: http://t.co/Rp2uXt1hYi"]["Happy 227th, Delaware! On this day in 1787 it became the #firststate. http://t.co/E5AzX18lzB"]["I never get tired of counting my blessings. We’ve got so much to be thankful for. Happy Thanksgiving, everyone. -Joe"]["Looking good! #TBT http://t.co/Rh5b0rQFF9"]["To all the brave men and women who have served our nation, thank you, and happy Veterans Day. http://t.co/uQXC5dKd55"]["If you've already voted, give your friends a call right now and remind them to vote. http://t.co/NuF8byPfsS http://t.co/Vqf99EavVy"]["Democrats can't win without your help. Make sure you're ready to vote on Tuesday: http://t.co/NuF8byPfsS http://t.co/E9Cc3n1GhO"]["Look who voted yesterday! Commit to join him by voting in this year's election: http://t.co/Xsn4dFdqwu #IWillVote http://t.co/uBHRYzw3Sa"]["Catch Vice President Biden and @Mariska during @USA_Network's SVU marathon today. #1is2Many #NotAlone"]["VP Biden is about to speak about infrastructure development in Philadelphia. This is why we have to #RebuildAmerica: https://t.co/VPP70xIX22"]["#1010means good news for our economy. Commit to vote for candidates who will #RaiseTheWage: http://t.co/2XxEP1GE6u http://t.co/w7x8LqTydh"]["Big GOTV weekend, folks. Wish I could bring a slice to every one of you knocking on doors and picking up phones! -Joe http://t.co/CKD4rCRSEM"]["The Vice President is in Joplin, Missouri today. Here's why: http://t.co/Zb3SzOr9oN"]["Happy first week of fall, everyone. #ThrowbackThursday http://t.co/z9ALxCF6DC"]["Voting is important, folks. Make sure your registration is up-to-date for 2014 by visiting http://t.co/irUGlySpKT –Joe"]["Stopping sexual assault is everyone's responsibility. Visit http://t.co/wymBStCyGB and take the pledge. #ItsOnUs"]["VP Biden is about to take the stage at the Women's Leadership Forum Conference. Follow @TheDemocrats for live updates. #DemWomen"]["When women like @DWStweets talk about their #breastcancer experience, it gives others hope. Congrats on a well-deserved Komen award. -Joe"]["RT if you agree with Vice President Biden. #vawa20 http://t.co/JfSorMbouK"]["VAWA is the single most significant legislation I’ve ever been part of. Couldn't be prouder of everyone who made it happen. -Joe"]["Today America stands strong and proud. http://t.co/0zMR6J6O8U"]["There are 55 days left before Election Day. Commit to vote right now → http://t.co/SVMedG8i7O #IWillVote http://t.co/UYVjqR7Xrc"]["Read the VP's op-ed on his proudest legislative accomplishment: The Violence Against Women Act. http://t.co/N8etPFeQw6"]["\"Folks, it’s never a good bet to bet against the American people.\" - Vice President Biden. WATCH: http://t.co/svGEHibKry #OpportunityForAll"]["The Vice President is about to talk about jobs at the Portsmouth Naval Shipyard. Listen → http://t.co/XYmtPfVGj7 #MadeInAmerica"][".@TheDemocrats nominated President Obama and Vice President Biden on this day in 2008. http://t.co/KCcB5kUuEL"]["Every single vote matters. Visit http://t.co/irUGlySpKT and http://t.co/Efxpa5Tl6Q to get ready for November! http://t.co/T1Aou4YFZu"]["Happy birthday, President Obama! http://t.co/XjCxW8agfu"]["Republicans blocked bills, shut down the government, and voted to sue the President. Replace them with @TheDemocrats: http://t.co/Tk0tck4bvo"]["The VP is committed to helping every eligible voter cast a ballot. Join him today: http://t.co/iffwoXHotx #100Days http://t.co/JGzEKiZ18n"]["The Vice President chats about the plan to #RebuildAmerica: https://t.co/RlPwx67FN8 http://t.co/GxjTjPNfcG"]["Read the VP's letter to the President on how job training will provide #OpportunityForAll: http://t.co/K4RbsyJ0Bm http://t.co/vknkySylmj"]["The VP is about to take the stage at #NN14. Watch the keynote here: http://t.co/7NNLwyz7vk"]["The VP is speaking at @genprogress' #MakeProgress Summit. Watch live: http://t.co/W5pDZ75FLF"]["Let’s get to work. MT @TheDemocrats: Add your voice to President Obama's: http://t.co/y3dY9C5RIw http://t.co/pS6lu6YScl"]["Happy 4th of July! http://t.co/lXt9UPkzdG"]["The VP reflects on the courage of civil rights leaders like @repjohnlewis for #CivilRights50 http://t.co/s2P6auPbSr http://t.co/6rkm9wKQ30"]["Let's go, #USMNT! #IBelieveThatWeWillWin http://t.co/IV72T81qyV"]["The first Corvette was #MadeInAmerica (Flint, MI) on this day in 1953. http://t.co/NbnXdjoyiE"]["One year ago, the Supreme Court struck down a vital component of the #VRA. Stand up for every citizen's #VotingRights http://t.co/hTbDVNHR3p"]["Still celebrating? Watch the post-game pep talk with the #USMNT and the Vice President. #OneNationOneTeam #IBelieve https://t.co/sUCMZcGtXh"]["The VP cheered on the #USMNT in 2010, and he's cheering them on right now. Are you? #IBelieveThatWeWillWin http://t.co/lPngtEsOQu"]["RT to wish @DrBiden a very happy birthday! http://t.co/bgROT9vb7K"]["This election is about each of us doing our part, and the President, VP, and @TheDemocrats need your help. Join: http://t.co/TkppTZdpr0"]["Honoring the memory of those we have lost, and reminding their families that they are never alone. http://t.co/rhxAeWVmOh"]["\"I hope you will accept this corsage and enjoy your prom as much as I did mine.\" - The VP http://t.co/YuGLBpOPQj"]["RT if you agree with the Vice President this #NationalWomensHealthWeek http://t.co/SINIFZHBiS"]["\"We have to rebuild the infrastructure in this country.\" -VP Biden talking #RebuildAmerica in St. Louis yesterday. http://t.co/ZyjLtgn9XX"]["Welcome to Washington, @UDBlueHens! http://t.co/JM3CIIiwPf"]["Miss the VP and @OfficialJLD's video from the #WHCD? WATCH: http://t.co/0qxn8zaRbP"]["“We have got to get 11 million people out of the shadows.\" - VP Biden. Act on immigration: http://t.co/tFi2nh0bWG http://t.co/nEkBlf25y7"]["Ending violence against women is my passion. I couldn't be prouder of http://t.co/Bis94relFN &amp; the students who helped make it happen. -Joe"]["Before the VP launched http://t.co/Bis94relFN this week, he championed the Violence Against Women Act #TBT #1is2Many http://t.co/0aOybj4FkP"]["The VP teamed up with Daniel Craig, @DuleHill, @sethmeyers, and others to combat sexual assault. Watch → http://t.co/v5qUadZjdd #1is2Many"]["The VP has been fighting to end violence against women for a long time. Here's the next step: http://t.co/Bis94relFN #1is2Many #NotAlone"]["Fight for a fair shot for the middle class → http://t.co/uIpsrGSDVs http://t.co/tAFdLfQg86"]["Listen to VP Biden's speech on the budget now on @WHLive --&gt; http://t.co/V7eH0EaSBN"]["Agree with the VP that cutting millionaires' taxes while raising middle class taxes is just wrong? Tune in at 2:00: http://t.co/V7eH0EaSBN"]["#ThrowbackThursday to an earlier #TakeYourChildToWorkDay http://t.co/7oAabE7enU #TBT http://t.co/17PInhV88x"]["High five. http://t.co/kjrOTTWk2i http://t.co/EWbVAsXbsy"]["\"The point is real simple: The backbone of this country is a strong and thriving middle class.\" -VP in PA yesterday. http://t.co/juzhgUrI89"]["The First Selfie. http://t.co/Zt7PgMh4sZ http://t.co/rKfaULQicl"]["Follow the VP on @instagram (grab some shades before checking out his first post!) http://t.co/HleMeJTjiS http://t.co/AlyjHYUJYF"]["Watch the VP &amp; @JohnKerry at the FIFA World Cup Trophy Tour. Cheer for @ussoccer this summer to bring it back! http://t.co/4wlFVIcNFL"]["\"Trevor &amp; Chopper represent the very best in our military.\" -The VP in the latest #BeingBiden http://t.co/2Hw9Bk52S0 http://t.co/PX5xOUxrL2"]["\"What's gutsy about giving millionaires another tax break? What's gutsy about gutting Medicare?” - VP Biden on the Ryan Budget in 2012. #TBT"]["\"It's time to stand up and to fight back\" - VP Biden on @TheDemocrats' #VoterExpansion Project. Watch and join today: http://t.co/owNm0VYtub"]["Go Blue Hens! Vice President Biden will deliver the 2014 commencement address at @UDelaware, his alma mater. http://t.co/783ocuFCCi"]["\"You've got to be kidding me.\" ­-Vice President Biden, on still having to fight for #voterexpansion in 2014. WATCH: http://t.co/IJjzLdn1ZB"]["Dusting off the Twitter handle for a big midterm election year. Let's get to it, folks! –Joe"]["Wishing you a happy and safe holiday season. http://t.co/CwkYuUcx"]["VIDEO: Ann Marie shared her #My2K story, and ended up having lunch with VP Biden. http://t.co/nYJ5xD0L"]["See the impact on your state if Congress fails to extend middle-class tax cuts: http://t.co/inf1psGj #My2K"]["Help make sure that taxes stay low for families and small businesses—contact your representative now: http://t.co/LiLxqxyM #My2K"]["\"This is no time to add any additional burden for middle class people.”—VP Biden on #My2K at a VA diner last week: http://t.co/sSbuwwvv"]["A #FF this week for @ObamaInaugural—everything you need to know for President Obama and VP Biden’s inauguration on January 21, 2013."]["Share why it matters to you that Congress keep taxes low for American families and small businesses. http://t.co/LedOeEUn #My2K"]["VP Biden visited Costco yesterday to do some holiday shopping—and urged Congress to extend middle class tax cuts: http://t.co/jvcJiNEr"]["Best wishes for a happy and safe Thanksgiving. http://t.co/8G9kqQcx"]["Help determine what happens next with the organization that powered this campaign: http://t.co/lZsyYSlq http://t.co/BlehIPcy"]["“We’re just so incredibly proud of you.”—VP Biden during a Thanksgiving celebration with wounded warriors yesterday"]["Happy birthday, VP Biden! http://t.co/4wfCw6Fq"]["A favorite Joe photo from November: pizza party. http://t.co/jwskw5pi"]["VP Biden meets @parksandrecnbc’s Leslie Knope: http://t.co/1llqHAqJ"]["VP Biden celebrated Diwali at the White House this week: http://t.co/LyVzFbyI http://t.co/Ws2quauP"]["Don't miss VP Biden on @parksandrecnbc tonight at 9:30pm ET. http://t.co/H6x5I2fu"]["Whether you volunteered, donated, or just voted, share your #Obama2012 memory here: http://t.co/9xTg3znl"]["Four more years. http://t.co/itBvJy9P"]["From the bottom of our hearts, thank you. http://t.co/rN0vOSR0"]["If you voted today, make sure your friends know it: http://t.co/NVP1KfSc http://t.co/9J45pSXD"]["Thumbs up for VP Biden’s final campaign stop in Ohio today: http://t.co/dKbjnySQ"]["“The secret to getting through: Always be doing something.” http://t.co/L7W4Zuz3"]["There’s plenty of time left to vote! Find out where to go: http://t.co/BUX0wn1K"]["Make sure everyone votes today—hop on the phone and talk to voters in key states: http://t.co/55X1UX2C"]["Let’s make sure the next 4 years are about giving the middle class a shot. Please get out and vote today—and bring a friend. –Joe"]["Joe photo of the day: The VP casts his vote in Delaware. http://t.co/KwiGVsvA"]["It’s a great day to vote! Grab a friend and head to your local polling place: http://t.co/glcIBJTL http://t.co/i4oWTGRs"]["Election Day is here! Find out where you’ll be voting tomorrow: http://t.co/MqqaiDI0 http://t.co/JXioVWdR"]["Meet ’n greet in Lakewood, Ohio: http://t.co/uWJcmzXj"]["Romney and Ryan have been spreading misinformation about Medicare. Get the facts from VP Biden: http://t.co/bOHUnNoJ"]["Share @BarackObama and VP Biden’s plan with anyone who needs a reminder before tomorrow: http://t.co/nRN4SC0m"]["3 reasons why President Obama should be re-elected: http://t.co/KtsjI5A3"]["“It’s the most cynical play I’ve seen.”—VP Biden on Romney’s fictitious auto industry ad: http://t.co/6jclKUnS"]["Get a head start on Election Day: Make a plan to vote. http://t.co/dH3nyddx"]["A second term for #TeamObamaBiden could be just a few phone calls away: http://t.co/GaW1Zvi6, http://t.co/vpsgnYnG"]["Character, convictions, vision: http://t.co/9UEdZPAE"]["The choice couldn’t be clearer—pass it on: http://t.co/zEeb36Vg"]["If you’ve got a phone and a computer, you can make calls. Get started now: http://t.co/VRUOBwY8 http://t.co/VZDBWOhK"]["RT if you’re in for four more years: http://t.co/yn5KnDoE"]["Watch VP Biden talk about preserving Medicare and Social Security—“the sacred promise of a nation that keeps its word.” http://t.co/8yuvzEFv"]["To do this weekend: Bring home the win for VP Biden and @BarackObama. Here’s how you’ll do it: http://t.co/XbKfT2KO"]["VP Biden: “The entire history of the journey of this country can be summarized in one word: Forward!”"]["“Romney getting tough on China, I got one word for it: Malarkey! It’s absolute malarkey.”—VP Biden in Beloit, WI"]["VP: “Imagine the 40 years of progress we’ve made for women in America—what will happen to that in a Romney-appointed Supreme Court.”"]["“I know the guy next door doesn't recognize it, but we actually did rescue the automobile industry and save a million jobs.”—VP in Wisconsin"]["VP: “We’ve created 5.4 million new private sector jobs. Companies in America hired more workers in Oct. than any time in the last 8 months.”"]["“I want to tell you who I am so excited about—the next senator from this state, Tammy Baldwin.”—VP Biden in WI today: http://t.co/YUk5IDiG"]["It’s time to sprint, then lean: Sign up to get out the vote this weekend. http://t.co/XbKfT2KO http://t.co/o8nheN2D"]["Kids lined up to greet VP Biden yesterday in Muscatine, IA: http://t.co/clkqUeOq"]["President Obama: “The people who need a champion are the Americans whose letters I read late at night.” http://t.co/sogmQwih"]["“It’s vastly more effective than voting late.” Watch VP Biden’s top 10 reasons to vote early on @Late_Show: http://t.co/xYvNlqUJ"]["“Who do you trust to stand up for the middle class? @BarackObama is the man you should trust.”—VP Biden in Ocala, FL: http://t.co/ltsspSpo"]["VP Biden’s presenting the Top 10 list on @Late_Show tonight! Tune in at 11:35pm ET: http://t.co/IIqTBxCn"]["Gen. Colin Powell has endorsed @BarackObama—here’s why: http://t.co/gAJhs8Fo"]["First responders for Obama-Biden in Florida yesterday: http://t.co/7kaGQxzm"]["Watch VP Biden address Romney-Ryan’s misleading auto industry ad in Florida yesterday: http://t.co/vSls1qx9"]["VP Biden: “My guy, your guy, Barack Obama has character. He has the character of his convictions. He does not engage in deception.”"]["“The President’s job is not to sow confusion. It’s to plant the seeds of confidence.”—VP Biden in Florida"]["VP: “Jeep isn’t cutting jobs, they're adding jobs. PolitiFact—the fact-checkers they don't look at—they called the ad ‘wholly inaccurate.’”"]["“They are running the most scurrilous ad in Ohio. One of the most flagrantly dishonest ads I can ever remember.”—VP on Romney-Ryan"]["On Romney: “He said 47% of the American people were ‘not willing to take responsibility for their own lives.’ Who does he think he is?”"]["VP Biden on Romney: “Guess what? He never did answer the question of whether or not women are entitled to equal pay for equal work.”"]["“We’re all better off when everybody is in this deal together, when we’re all working together.”—VP Biden in Sarasota, FL"]["Joe photo of the day: new friends in Sarasota, Florida. http://t.co/VEilY8wY"]["RT if you agree with VP Biden: http://t.co/rQMWy1nK"]["It’s time to get serious about getting out the vote. Find out how you can help: http://t.co/oI0y04HA http://t.co/7lTJqxtq"]["Forward, Ohio! VP Biden and President Clinton rally together in Youngstown, OH. http://t.co/F0YRuR1E"]["Joe photo of the day: Pumping up volunteers in Columbus, OH. http://t.co/VzWjR7wP"]["“We are our brother’s keeper. We are our sister’s keeper.” VP Biden talks about the importance of faith and values: http://t.co/IwsGCpWx"]["Joe photo of the day: Virginia hearts Joe. http://t.co/76dxQouC"]["Smiles in Virginia yesterday: http://t.co/kVd0f9jY"]["Donate $20 or whatever you can to stop the other side from buying and bullying its way to a win right at the end: http://t.co/ybjYH2Ek"]["Get the word out about what @BarackObama has done in less than 4 years—in under 2 minutes: http://t.co/G4LO8tHh"]["VP Biden got a warm welcome in Kenosha this morning: http://t.co/Ra4gXHHi"]["The VP visited @OFA_WI today and he thinks YOU should support the President by voting early: http://t.co/9kyP3tbA, http://t.co/87BmX2ew"]["Watch Gen. Colin Powell’s endorsement of @BarackObama and VP Biden: http://t.co/0YMiaNPD"]["VP Biden recaps the 2nd presidential debate, @MichelleObama votes, and more on the Road to November 6th: http://t.co/Bmqr6pbg"]["Joe photo of the day: Breakfast with VP Biden in Mechanicsburg, Ohio. http://t.co/TMVyatya"]["Dr. Biden stopped by an @OFA_MN field office last weekend to fire up volunteers: http://t.co/RqZAROtw"]["Pass it on: President Obama’s plan for a second term. http://t.co/fYELe18y"]["“I’ve got news for Gov. Romney and Congressman Ryan—it’s never, ever been a good bet to bet against the American people.”—VP Biden"]["VP Biden: “Together, all of us—even the 47 percent of us that Romney doesn't think matter—we’re moving forward. “"]["“This President is leveling the playing field—getting the middle class back in the game. He knows how to build America from the middle out.”"]["VP Biden on Romney: “Governor, you can't run from the truth. You can't run from your record. You can't run from your policies.”"]["“These debates have exposed that Gov. Romney and Paul Ryan have a foreign policy right out of the ’80s, a social policy out of the ’50s.”"]["“This is a President who says what he means, means what he says, and does what he says.”—VP Biden introducing President Obama in Ohio today"]["VP Biden on @BarackObama: “You got to see what I see every day: a President who clearly understands America’s interest around the world.”"]["“Last night, we saw a commander in chief who is in command of the issues.”—VP Biden in Dayton, Ohio"]["RT if you’re on #TeamObamaBiden: http://t.co/6vZjAHHh"]["Inspiration for pumpkin carving season, thanks to @OFA_CT: http://t.co/EAlyrKfm"]["Take a look at what people are saying about President Obama’s foreign policy debate win: http://t.co/pTOkPGBn"]["With only 14 days left, every action counts. Call 10 voters from the comfort of home: http://t.co/r9rSnjNf http://t.co/IjPbccic"]["VP Biden in Ohio yesterday: \"The American people will not go back. The American people only know one way: forward.\" http://t.co/hD7mfopM"]["Watch President Obama talk about his clear plan to move us forward: http://t.co/1KUJufOF"]["VP: \"Being president requires a clear vision and a steady hand. That's exactly what President Obama demonstrated.\" http://t.co/YSY7Vuc8"]["Tonight, we saw what it means to be commander in chief. Vision—courage—a steady hand. -Joe"]["FACT: Romney has held investments in Chinese and Russian oil companies that were doing business with the Iranian energy sector."]["RT this image if you believe standing up for the American worker is good for the country: http://t.co/65Ep4X3r #RomneyWrong"]["The Obama administration’s sanctions against Iran are the most comprehensive that Iran has ever faced. http://t.co/nZ4OPZeB"]["The President never \"apologized\" for America. Not once. http://t.co/ecwkmdL1 #RomneyWrong"]["The Romney campaign offered “few specifics” about what Romney would do differently from President Obama on Syria: http://t.co/UXxv0Q2A"]["Tune in for the final presidential debate on foreign policy tonight: Live coverage kicks off at 9pm ET. http://t.co/WYHwUUrc"]["Why Mitt Romney's Cold War mentality is out of date: http://t.co/Rj6HtOiv #RomneyNotReady"]["What Romney needs to answer in tonight’s foreign policy debate: http://t.co/ugTYYHzf #RomneyNotReady"]["“The American people didn’t give up, they got up.”—VP Biden on the road to November 6th: http://t.co/5bVY4jgH"]["When it comes to our national security, the choice is clear: http://t.co/kBw8ZyLt #RomneyNotReady"]["“He’s not ready for prime time in terms of national security.”—Former Sec. of State Madeleine Albright on Mitt Romney: http://t.co/R49RAtxl"]["Father-daughter campaigning in Florida: http://t.co/FBSdK1jF"]["Foreign policy officials review the strength and steadiness of President Obama's leadership on the world stage: http://t.co/07dqXwe9"]["Joe photo of the day: Provisioning an @OFA_FL field office in Orlando. http://t.co/QOoGIvG1"]["Dr. Biden: “The election is just 17 days away. And the work we do between now and then could make all the difference.”"]["“We have come so far—and we’ve got to keep moving forward—not just on women’s issues, but on all issues.”—Dr. Biden in Minnesota"]["Dr. Biden: “I want to make sure that all our veterans—and their families—get the benefits they have earned and the respect they deserve.”"]["“When Joe &amp; Barack were elected, like so many of you, one of my main hopes was that we end the war in Iraq. The President kept his promise.”"]["Dr. Biden in MN: “I’m also a military mom. Our son Beau served in Iraq for a year with the Delaware Army National Guard.”"]["“We have already made so much progress. We have doubled funding for Pell Grants and reformed the student loan process.”—Dr. Biden"]["Dr. Jill Biden: “As a teacher, I want to make sure that we continue to invest in quality education.”"]["“I’m a full-time teacher and, like most teachers, teaching isn’t just what I do—it’s who I am.”—Dr. Biden in Minnesota"]["Joe photo of the day, DQ edition: http://t.co/U8bm8a3r"]["VP: “All of a sudden, Paul Ryan, the budget hawk—the guy who introduced a budget plan that already passed—he doesn’t remember it.” #Romnesia"]["“I hope you all don’t get #Romnesia. It’s a bad disease—and it’s contagious.”—VP Biden in Florida today"]["VP Biden on Romney: “The President has a new term for this sort of ability to change your mind so quickly. He calls it #Romnesia.”"]["VP Biden: “When Gov. Romney was asked whether or not women deserve equal pay for equal work, what was his answer? Binders.”"]["“Romney and Ryan made it very clear they're willing to impose their private views on the public.”—VP on Romney-Ryan’s women’s health views"]["VP on Romney-Ryan: “You heard the debates. It was made very clear that they don't believe a woman has a right to control her own body.”"]["VP: “Barack and I are absolutely committed to ensuring that our daughters &amp; granddaughters have the exact same opportunities as our sons.”"]["“We have fundamentally different views on how to move this country forward, and a fundamentally different value set.”—VP on Romney-Ryan"]["Watch President Obama describe the symptoms of #Romnesia: http://t.co/7wHQQUtG"]["POTUS: “If you’ve come down with #Romnesia &amp; can’t remember the promises you’ve made, don’t worry—Obamacare covers pre-existing conditions.”"]["Speaking in Virginia today, President Obama coined a new term to describe Mitt Romney’s deceptive policies: #Romnesia."]["Lilly Ledbetter: Romney's position on pay equity is a \"terrible injustice\" for women. http://t.co/kCjwp8FZ"]["Joe photo of the day: A new friend in Reno, NV. http://t.co/8B0teuFb"]["A warm Colorado welcome for VP Biden: http://t.co/DXv1PUPq"]["Fired up, ready to go for VP Biden in Greeley, CO yesterday! http://t.co/V1JOfEpL"]["VP on Romney’s immigration stance: “He’s not only out of touch with the Hispanic community, he’s out of touch with the American people.”"]["“My daughter and granddaughters &amp; Barack’s daughters are entitled to every single, solitary opportunity my sons are and my grandsons are.”"]["VP: “The place where Romney was least responsive &amp; most sketchy, where we have the most basic disagreement with him, is on women’s rights.”"]["On the Romney-Ryan budget: “Their budget slashes 19 million people off Medicaid; turns Medicare into a voucher system; decimates education.”"]["“Gov. Romney was a little—how can I say it? Sketchy last night. No details. No specifics.”—VP Biden in Greeley, CO today"]["On the debate: “You saw the man I have sat with every day: a man of principle and gumption, a man with a steady hand and a clear vision.”"]["VP in CO: “Early voting starts in Colorado on Oct. 22. So don't wait until Election Day. Let’s take this thing sooner than later, okay?”"]["“President Obama dominated.” See what people are saying about @BarackObama’s debate win last night: http://t.co/C3sZp80V"]["“A clear win for Obama”: http://t.co/bpI3wli8"]["RT if you agree with President Obama that our daughters and sons deserve equal opportunities: http://t.co/pPccdc4I"]["Mitt Romney opposed the Lilly Ledbetter Fair Pay Act: http://t.co/vXBH6u2J"]["VP Biden: For women, \"the picture is becoming more clear\" after last night's debate. http://t.co/rofkNnVt"]["President Obama stood up for you tonight—now it’s your turn. Commit to vote: http://t.co/8zZedMuS #TeamBarack"]["OFA Campaign Manager Jim Messina on why @BarackObama \"clearly won tonight's debate\": http://t.co/cMTlxZug"]["If you’re proud of President Obama after tonight’s debate, add your name: http://t.co/p1MpprMZ #TeamBarack"]["President Obama: \"We are on pace to double our exports. That's creating tens of thousands of jobs all across the country.\" #TeamBarack"]["President Obama: \"We have made sure that millions of young people are able to get an education when they weren't able to before.\""]["Romney invested in a Chinese firm after learning it would “not be subject to taxes in the United States.” http://t.co/mC3S0gS7 #SketchyDeal"]["FACT: Romney’s only solution to lower gas prices is to drill for more oil—yet he opposes vehicle standards that will save money at the pump."]["Time to tune in! The second presidential debate starts in a few minutes. http://t.co/p1MpprMZ #TeamObamaBiden"]["Why Romney’s tax plan just doesn’t add up: http://t.co/nU5wb8sy #MittMath"]["\"Arithmetic over illusion\": What Romney's tax plan really means for the middle class. http://t.co/3xZSpdO0 #MittMath"]["RT if you’re on #TeamObamaBiden and excited for tonight’s debate—the action kicks off at 8pm ET on our live blog: http://t.co/SvX36y6f"]["“Let's show Barack what kind of grassroots organization he's got behind him—one that's ready for whatever comes ahead.” http://t.co/StDO9nR3"]["La Crosse, Wisconsin was fired up for VP Biden and Dr. Biden last week: http://t.co/i00yLvGE"]["VP: “What’s at stake for the Latino community this election is the dreams &amp; aspirations of their fathers and mothers.” http://t.co/WKhiOmrE"]["Dr. Biden gets North Carolinians excited for early voting, which kicks off in just 3 days (cc @OFA_NC). http://t.co/o4mcu8tf"]["Pitch in $10, get a car magnet—it’s that easy: http://t.co/XEfJ0uhp"]["In 1994, then-Sen. Biden wrote a letter to an 8th grader—and changed his life. Check it out: http://t.co/sBTcge4Q"]["Crisscrossing the country with VP Biden, President Obama, and the First Lady on the road to November 6th: http://t.co/ynfR8B0L"]["Romney and Ryan have been spreading misinformation about Medicare. Get the facts from VP Biden: http://t.co/bOHUnNoJ"]["Big cheers for VP Biden and Dr. Jill Biden in La Crosse, Wisconsin yesterday: http://t.co/Zrk0dlp3"]["“I think Joe Biden rocks.” Hundreds of supporters called in to congratulate the VP on his debate win—have a listen: http://t.co/U4FvwCTm"]["Worth a re-watch: VP Biden talks in last night's debate about why we've got to give the middle class a fair shot. http://t.co/oDRrudwg"]["RT if you agree: Facts matter. http://t.co/IDiG1g9J"][".@BeauBiden: Paul Ryan “left the door wide open” for putting additional troops in Afghanistan. http://t.co/FU2Is0yl"]["Now it’s your turn to talk—call 312.985.6433 and leave a message to let Joe know how you thought he did in last night’s debate."]["The Romney-Ryan strategy? Hiding the truth on plans that hurt the middle class. http://t.co/CKCKD4pi"][".@ChrisVanHollen: “What you saw was the passionate Joe Biden, the Joe Biden who fights for the middle class.” http://t.co/4n3sFaZG"]["The reviews are in—see what others are saying about VP Biden's win last night: http://t.co/2oaMJRjH"]["A woman’s health decisions are up to her and her doctor—no one else: http://t.co/flU5meBU"]["Straight talk on taxes from VP Biden: http://t.co/FRSTOJze"]["Tonight you heard the other side’s plan to take us back to the failed policies of the past. We can't go back. We've gotta go forward. –Joe"]["If you like what you heard from VP Biden tonight, say you're in here: http://t.co/iJK2hy1C"]["RT if you're on #TeamJoe"]["VP: \"Look at my record—it’s been all about the middle class. They’re the people who grow this country.\" #TeamJoe"]["\"If you notice, he never answers the question.\"—VP Biden #DetailsMatter"]["VP on Afghanistan: \"We will leave in 2014.\""]["The Romney-Ryan plan: They call it “gutsy”—we call it a disaster for the middle class. http://t.co/yxL6DkGo, http://t.co/9vRedMyH"]["VP: \"A simple answer: He's raising the cost of Medicare.\" #FactsMatter"]["Team Obama-Biden is strengthening Medicare. Romney and Ryan would turn it into vouchercare: http://t.co/sBRJLvXH"]["Take a look at the Romney-Ryan budget plan to see what they value (and what they don’t): http://t.co/yxL6DkGo"]["RT if you agree: Our economy grows from the middle out and the bottom up—not from the top down. http://t.co/1DdJfUj3"]["\"Iran is more isolated today than when we took office.\" —VP Biden"]["It’s go time: Tune in to http://t.co/xxwISX80 http://t.co/013Ok5z1"]["Barack and I are in this because we'll never stop fighting for you. You’ll see that tonight. –Joe"]["“My promise to you and Barack tonight”: http://t.co/CSUpnlDD"]["Wheels down in Lexington, Kentucky: http://t.co/gQFAJH5w"]["For live fact-checks, notable quotes, and infographics, follow @Obama2012 and @OFADebates during and after tonight’s debate."]["“Paul Ryan and his many methods of misrepresentation”: http://t.co/jjJHbJ3Z"]["Joe photo of the day: prepping for tonight’s debate. http://t.co/Es4vkZ8n"]["Check out our livestream of the VP debate tonight for exclusive coverage, starting at 9pm ET: http://t.co/Kh7OV6WJ"]["RT if you’re on #TeamObamaBiden tonight: http://t.co/eQGDEu5d"]["Get to know Joe a little better before tomorrow's vice presidential debate: http://t.co/hPl81xG0"]["Rep. @ChrisVanHollen previews VP Biden's debate against \"a ticket that is willing to say anything to get elected.\" http://t.co/IHi6LRss"]["Paul Ryan’s last major speech was called “stunning for its dishonesty.” Tune in to see if he’ll be honest tomorrow: http://t.co/UzMQYhfw"]["The only way someone like Mitt Romney beats someone like Barack Obama is if we don't step it up when it really matters: http://t.co/KYf7SSPt"]["“Barack and I cannot do this alone. We need you and it's always been that way.” http://t.co/cm25fj3D"]["Before VP Biden debates Rep. Ryan on Thursday, make sure everyone you know has the facts on where they stand: http://t.co/Pa99hjnM"]["Dr. Biden rallied supporters around Pennsylvania yesterday: http://t.co/fCFSNl1j"]["If you heart Joe, say it here: http://t.co/E9hPs7lH http://t.co/ZKoib1Ks"]["VP Biden reflects on President Obama’s unwavering commitment to veterans: http://t.co/oRVu0Zn0"]["Voter registration deadlines are coming up in many states. Make sure your vote gets counted: http://t.co/FXrlhdS6"]["An inside look at the campaign trail on the Road to November 6th: http://t.co/CqYZ8ZaC"]["Are you registered to vote at your current address? Make sure: http://t.co/JUVAN8RS"]["Tax experts agree: Romney’s math just doesn’t add up. http://t.co/0UqgyBrY"]["Photo of the day: VP Biden talks to a 91-year-old WWII vet in Council Bluffs, IA. http://t.co/1IUBrRb3"]["“The American people are so much better—so much stronger—take so much more responsibility than these guys give them credit for.”—VP in IA"]["VP Biden on Romney-Ryan: “Ladies and gentlemen, these guys don't get it. There is no quit in America.”"]["“We're going to give tax breaks to companies that invest in America, not invest overseas. We're going to cut our oil imports by half.”"]["VP Biden on the GOP: “Their policies put the middle class in a deep hole, which we’ve been helping them climb out of for the last 4 years.”"]["VP in IA: “Can you imagine Barack Obama signing &amp; being for a plan that would raise by $6,400 a year the cost of Medicare?” Audience: “No!”"]["VP on Romney: “He didn’t tell you much about his plan. He didn’t say much about what his plan does. And a lot of it just doesn’t add up.”"]["“Since President Obama has been elected President and changed the law, Medicare recipients have more benefits.”—VP Biden in Iowa"]["VP Biden on Romney-Ryan: “They don’t tell you what they are for anymore. And they deliberately misrepresent what they say we are for.”"]["“He put forward a clear, specific plan on how to get this country moving forward again.”—VP Biden on President Obama in last night’s debate"]["In case you missed it: Check out VP Biden’s take on last night’s debate. http://t.co/5X176iC9"]["President Obama has a specific plan for strengthening the middle class—pass it on: http://t.co/U3HgpG46"]["Fact check: Rommey's debate performance was \"mostly fictional.\" http://t.co/05MftQ2v"]["If you’re standing with President Obama tonight, be sure to register to vote. It takes less than 5 minutes: http://t.co/r4DkSsby"]["Folks, I hope you saw what I saw tonight: President Obama's the choice to move us forward, not back. –Joe"]["To Barack: Good luck tonight, and happy anniversary to you and Michelle. –Joe and Jill"]["Livestream coverage of tonight’s debate kicks off at 9pm ET—with a special message from the VP following the debate: http://t.co/R3ZVHaVQ"]["North Carolina was all smiles for VP Biden yesterday: http://t.co/Zy1CHnmY"]["“Keep the faith”: http://t.co/QUdeHeWP http://t.co/mdUnSWcI"]["Happy debate day! There’s still time to find a watch party near you: http://t.co/HoXeY1e2"]["Be the first to hear from VP Biden after the debate tomorrow night—find a watch party in your community: http://t.co/5UzascjI"]["From Carson City to Charlottesville, President Obama’s policies are having positive effects across the country: http://t.co/5udViQtP"]["“We will fulfill the only truly sacred obligation we have as a nation—to equip those we send to war and care for them when they come home.”"]["“We've cut taxes for everyone in the middle class—$3,600 for the average family.”—VP Biden in North Carolina"]["VP in NC: “They say they value education, but they make massive cuts in education—in early education, elementary, and secondary education.”"]["VP Biden on Romney-Ryan: “Their plan would immediately cut benefits for 48 million seniors already on Medicare.”"]["“Under President Obama's leadership, Medicare benefits have actually increased. For prescription drugs, they've increased by $800.”—VP Biden"]["\"The middle class was buried by the policies that Romney and Ryan have supported.\"—VP Biden in Asheville, NC"]["President Obama and Vice President Biden have a plan to move the economy forward—check it out: http://t.co/jajClfWp"]["VP Biden made clear in his remarks today that Romney-Ryan would take us back to the failed Bush policies that crashed our economy."]["Don’t forget to RSVP for a debate watch party near you! http://t.co/PJBBvP8b http://t.co/sHhxjlJL"]["VP Biden got a sunny welcome in the Sunshine State over the weekend: http://t.co/ek99R0By"]["Bonus! After the debate, VP Biden will speak to supporters at watch parties. Don't miss it: http://t.co/XFRhrk3y"]["Cheer on President Obama in Wednesday’s first debate at a supporter watch party in your neighborhood: http://t.co/WhoxtXhC"]["Thanks to everyone who pitched in to help this campaign start strong in October: http://t.co/TEo7qX79"]["Pitch in $5 before midnight to power this campaign when it matters most: http://t.co/i0uIDXwL http://t.co/YqZG2c5Y"]["One-on-one in Boca Raton, FL: http://t.co/2YCJu5Sm"]["RT if you agree that Social Security should be protected—not written off as a Ponzi scheme: http://t.co/n8XWro0f"]["VP Biden stood up for protecting Social Security and Medicare in Tamarac, Florida yesterday: http://t.co/7iQNokQs"]["Make sure your grandparents know: Romney could raise taxes on their Social Security benefits. http://t.co/Wcbui1Cu"]["Just 6 weekends left till Election Day—get out there for a Weekend of Action event near you: http://t.co/E1I94P9w"]["“I’ve got news for Governor Romney and Congressman Ryan: America and Americans are neither dependent nor are we in decline.”—VP Biden"]["VP in FL: “The American people are so much better, so much stronger, take so much more responsibility than these guys give them credit for.”"]["VP Biden: “My dad used to say, Joey, I don’t expect the government to solve my problems, but I do expect them to understand my problems.”"]["VP on the Romney-Ryan Medicare plan: “You’d have to reach into your pocket and come up with another $6,400 a year.”"]["“The action that the President took with regard to Medicare has made the system solvent … through 2024.”—VP Biden in Florida"]["VP Biden: “Just look at the facts. President Obama has increased the benefits available to people on Medicare today by the action he took.”"]["VP Biden on Romney’s plan: “The average senior would have to pay $460 more in taxes for their Social Security.” http://t.co/sPE9uPUq"]["Mitt Romney’s tax plan could lead to higher costs for seniors—send an eCard to spread the word: http://t.co/oSKjWAY0"]["VP Biden is in Florida today to talk about the stark choice on Social Security in this election. Get the facts: http://t.co/vHOF5odq"]["VIDEO: President Obama’s plan for creating jobs and strengthening the middle class. http://t.co/YShaaNzK"]["40 days. Let’s do this thing. http://t.co/ki0Nga0r http://t.co/t7BjtPis"]["Fired up, ready for Joe in Chesterfield, VA: http://t.co/fXptjksG"]["The choice on women’s health couldn’t be clearer: http://t.co/VUBolMN0"]["Registering to vote takes less than 5 minutes. Do it today, then spread the word: http://t.co/UCLAXnZn"]["VP: “I’ve got news for Gov. Romney and Congressman Ryan: Gentlemen, it has never, ever been a good bet to bet against the American people.”"]["“We owe those of you who served, we owe the families of those who have served, an incredible debt.”—VP Biden in Virginia"]["VP: “How could Gov. Romney and Congressman Ryan have such a profound misunderstanding of who the American people are?”"]["“We don’t think it is a culture of dependency when a 27-year-old couple with a couple of kids gets a child care tax credit.”—VP Biden"]["VP: “We do not think it creates a culture of dependency when a 79-year-old widow living alone has access to Medicare and Social Security.”"]["“Instead of attacking folks who work for a living and pay their way, Romney should be respecting their hard work.”—VP Biden"]["“They turn Medicare into a voucher system, and they put insurance companies back in control of your health.”—VP Biden on Romney-Ryan"]["On Romney-Ryan: “Their budget calls for massive cuts to education. They cut $4.9 billion in 1 year out of elementary &amp; secondary education.”"]["VP on the GOP: “They say they care about the middle class. Isn’t it amazing how they discovered the middle class at their convention?”"]["“We put forward a concrete plan to cut the debt by $4 trillion in the next 10 years.”—Vice President Biden in Chesterfield, VA"]["Don't wonder \"what if\"—give Dinner with Barack a shot before this great campaign tradition comes to an end. http://t.co/56XISaZB"]["A favorite Joe photo: http://t.co/0GWBE8aa"]["Get a free Obama-Biden car magnet in 3 easy steps: http://t.co/HWfU18jM http://t.co/5dbukpXt"]["Check out some highlights from the VP’s trip to New Hampshire—then commit to vote: http://t.co/ED5yteKU"]["Connect with the campaign on Facebook and get a free Obama-Biden car magnet! http://t.co/ZLohF0cE"]["Touchdown Joe: http://t.co/sYgvdnlh"]["Grins in Dartmouth, New Hampshire: http://t.co/wIGxlMqI"]["“This is not a country of victims. This is a country where when people get knocked down, they get back up.” #VPinNH"]["“We see a future where everyone—everyone, rich and poor—does their part and has a part.”—VP Biden"]["Written off by Romney: “9 million children, young adults from working-class families, who are in college because of Pell Grants.”"]["Written off by Romney: “The 63-year-old Vietnam War veteran who goes to the VA hospital once a week to get help and treatment.”"]["Among those Romney disdained: “The 78-year-old widow living on Social Security and Medicare, which she worked her whole life to earn.”"]["VP on Romney’s 47% comment: “Let’s take a look at the people who they think he has no responsibility toward, or who are dependent.”"]["“I believe he genuinely believes that nearly half this country is made up of people who see themselves as victims.”—VP Biden on Romney"]["“We are certain we will meet the goal in this country of once again having the highest percentage of college graduates by 2020.” #VPinNH"]["VP Biden: “We’ve invested in early education to eliminate the achievement gap before kids hit second grade.”"]["“We capped student loan repayments at 10 percent of your disposable income. It matters in what you’ll be able to do.”—VP Biden"]["“Jill has an expression: Any nation that out-educates us will out-compete us. It means we must be the best-educated nation in the world.”"]["VP Biden stands up for the 47% of Americans who Romney wrote off this week: http://t.co/rcJ8dPWi"]["VP Biden: “The President and I have a fundamentally different vision for this country and a fundamentally different value set.”"]["One year ago today, President Obama ended “Don’t Ask, Don’t Tell\": http://t.co/dkTgYnwz"]["You've got to get involved—we've got the last Dinner with Barack of this campaign coming up: http://t.co/vXv9T3y7"]["Grabbing a bite in Muscatine, Iowa: http://t.co/5FWSbVTm"]["Check out the highlights from Dr. Jill Biden’s trip to colleges in Minnesota and Pennsylvania last week: http://t.co/WUrFsJrE"]["Pass it on: http://t.co/CMqZ5hj2"]["PHOTOS: With just eight days to go until early voting starts in Iowa, VP Biden found folks fired up and ready to go. http://t.co/aHUBmbgV"]["Join Americans of faith who are supporting @BarackObama: http://t.co/ED4u9a0Q"]["Pumpkin time means it’s voting season in the Hawkeye State: http://t.co/eUhTy0uv"]["Watch Gloria’s story—it’s powerful stuff: http://t.co/K5bHn04D"]["VP in Iowa: “It's time to stand up for the middle class.  And you can start moving in that direction in 10 days when early voting starts.”"]["“I don't live in a country that's dependent or declining. There is no give-up anywhere in America.”—VP Biden"]["VP: “The President and I have a different way forward. We know the way to create jobs is the old-fashioned way—from the middle out.”"]["VP Biden on Romney: “He is totally out of touch with the reality of what ordinary Americans deal with every day. He does not get it.”"]["VP Biden in IA: “The President has brought more trade cases against China in one term than the Bush administration did in eight years.”"]["“President Obama understands that creating jobs here, keeping jobs here, bringing jobs back to America, that's the job of the President.”"]["On Romney’s jobs plan: “It will create 800,000 jobs—all of them overseas—and we’re being lectured by this guy about getting tough on China?”"]["VP on Romney (2/2): “The President won that case. As a consequence, 1,000 workers are making tires in this country and earning a good wage.”"]["VP in Iowa: “Isn’t it great having a President who thinks it matters whether or not there’s still an auto industry in the United States?”"]["50 days left till the election—sign up to make a difference now: http://t.co/O7r8tR7Q"]["Just a few ways President Obama is moving this country forward: http://t.co/mp5MWqZJ"]["Join Dr. Jill Biden as a woman for Obama: http://t.co/kszOwwe9"]["“From now until Election Day, I want to ask for everything you’ve got to help support President Obama and my husband.”—Dr. Biden in PA"]["Dr. Biden: “That means talking to all the women in your lives—ask them who they trust to stand up for women &amp; to keep expanding our rights.”"]["Dr. Biden in Pittsburgh: “We’ve got to realize how far we’ve come—and we’ve got to do our part to keep moving forward.” #Women2012"]["“For women of my generation, we know we can’t go back and refight those same battles that we fought years or decades ago.”—Dr. Biden"]["“Now insurance companies will no longer be able to charge us more for our coverage just because we’re women.”—Dr. Biden in PA"]["Dr. B: “The President has appointed more women to cabinet-level positions &amp; more women to the federal bench in his 1st term than anyone.”"]["“It’s no surprise that the very first bill the President signed helped make it easier for women to earn the same pay as men.”—Dr. Biden"]["Dr. Biden on VP Biden: “He always says his proudest accomplishment was pushing for and passing the Violence Against Women Act.”"]["Dr. Jill Biden: “Barack is the son of a single mother who worked hard to pay the bills.”"]["“I’ve seen firsthand how Barack and Joe stand up for the rights and freedoms of women every day.”—Dr. Biden in Pittsburgh, PA"]["“I’m in love with a teacher”: http://t.co/LpuLBtnD"]["Dr. Jill Biden: “At the end of the day, it’s not Barack or Joe alone that are going to move this country forward. It’s you.”"]["“I know that our President and Vice President are fighting for the values that have always made our country so great.” #DrBiden2012"]["Dr. Jill Biden on President Obama: “He implemented and expanded the G.I. Bill and signed tax cuts for businesses who hire veterans.”"]["“They’re making smart investments to raise standards for teaching and learning in our public schools.”—Dr. Biden on POTUS &amp; VPOTUS"]["Dr. Biden on POTUS &amp; VPOTUS: “They are giving students the right to repay their loans at a fixed percentage of their income.”"]["“Like most teachers, it isn’t just what I do—it is who I am.”—Dr. Jill Biden in Michigan"]["Dr. Biden: “So many issues I care deeply about are all at stake here in 2012.’"]["“This election is personal to me. And it’s not just because my husband’s name is on the ballot.”—Dr. Jill Biden in MI"]["In case you missed it, VP Biden rallied students in Eau Claire, Wisconsin yesterday: http://t.co/mFqjvKrd"]["Go backstage with VP Biden, President Obama, and the First Lady at #DNC2012: http://t.co/y6HCULSI"]["“You can find out all the information you need at our websites: http://t.co/sdY1NV9E and http://t.co/ySGMlxjt.”—Dr. Biden"]["Dr. B: “Every day, Barack and Joe are working so that every single American has an opportunity to provide for themselves &amp; their families.”"]["“The President has a plan to train 2 million workers through partnerships between businesses and community colleges.” #DrBiden2012"]["Dr. Biden: “Community colleges are a cornerstone of our education policies.”"]["Dr. Biden on POTUS and VPOTUS: “They doubled funding for Pell Grants and fought to make sure that student loan interest rates didn’t go up.”"]["“Barack and Joe are working hard to invest in education and make it easier for young people to afford college.”—Dr. Jill Biden in MN"]["Dr. Biden in MN: “I’m proud of this administration because I know that every single day, President Obama &amp; my husband are fighting for you.”"]["VP Biden in WI: “America is coming back. We’re not going back. We’re going forward.”"]["“We see a future where America leads not only by the example of our power, but by the power of our example.”—VP Biden"]["“Our plan focuses first on education—100,000 new science and math teachers in the next 10 years.”—VP Biden in Eau Claire, WI"]["VP Biden on Romney-Ryan: “They are not for Medicare. They are for a plan called Vouchercare.”"]["VP on the GOP: “What they're proposing will not extend the life of Medicare. It will actually put the trust fund in jeopardy in 2016.”"]["VP Biden on Romney-Ryan: “To them, it doesn’t matter much where American companies put their money or where they create jobs.”"]["“The Romney-Ryan budget calls for massive cuts in elementary and secondary education.”—VP Biden in Eau Claire, WI"]["VP in WI: “6 out of every 10 jobs in the next 10 years are going to require a degree or certificate beyond high school—we must be prepared.”"]["“The President &amp; I know neither one of us would be standing where we are today were it not for help we received in scholarships and loans.”"]["VP: “The President &amp; I have a fundamentally different vision than Gov. Romney &amp; Congressman Ryan, and a different value set that guides us.”"]["Eau Claire, WI welcomed VP Biden with flair today: http://t.co/WrDY5Q4r"]["President Obama on the values and faith that guide him—and our country—through difficult times: http://t.co/v2wAULSt"]["“Like generations before us, you didn’t lose faith. You fought back. You didn’t give up, you got up.”—VP Biden"]["“We have a lot of obligations—only one truly sacred one, and that is to equip those we send to war &amp; care for those who come home from war.”"]["VP Biden: “We've increased benefits for Medicare recipients, and in addition, we've extended the solvency of this system to the year 2024.”"]["“We’ve set a goal—and we will accomplish it—of creating 1 million new manufacturing jobs by 2016.”—Vice President Biden"]["“My personal prayer for all of you is that in every succeeding year, you’re able to sing more than you weep.”—Vice President Biden"]["Pick out your favorite bumper sticker, and we’ll send it to you for free: http://t.co/pyRts2NW"]["VP Biden swung through Ohio this weekend—and supporters greeted him warmly at every stop: http://t.co/0YR8B6Se"]["It was peach pie and motorcycle talk for the VP at Cruisers Diner in Seaman, Ohio yesterday: http://t.co/mASs8rG0"]["RT if you agree with VP Biden: http://t.co/UL2DD2S9"]["“It's never been a good bet to bet against America!”—VP Biden in Zanesville, OH http://t.co/j4u404Wb"]["Back in action: http://t.co/vJAnKCtx"]["More than 700,000 grassroots donations—and counting—to help re-elect President Obama and Vice President Biden: http://t.co/qy9uBR7J"]["We’re kicking off the biggest weekend of action yet, and chances are there’s an event near you. Get out there: http://t.co/0qkmeLJW"]["Pitch in $5 to the President and Vice President who are working to strengthen the middle class every day: http://t.co/fa8OPwYu"]["President Obama laid out a plan to restore the promise of middle class security last night: http://t.co/S59rpAWJ"]["VP Biden spoke from the heart last night—watch his speech and get inspired all over again: http://t.co/BOZFXUY3"]["After a great #DNC2012, it’s time to register voters and win this thing—find a weekend of action event near you: http://t.co/4KYvxfrB"]["If you’re in for four more years, stand with President Obama and Vice President Biden today: http://t.co/6rYtfyov"][".@BarackObama, @MichelleObama, VP Biden, and Dr. Jill Biden—together again on the campaign trail! Follow @OFA_NH and @OFA_IA for the latest."]["“The middle class wasn’t a number—it wasn’t a net worth. It was more of a value set.”—VP Biden on his upbringing: http://t.co/DIluIKhV"]["We’ll be live-tweeting the VP’s speech on @Obama2012—follow along for the latest."]["Before @BarackObama takes the stage tonight, watch his brother-in-law Craig relive another DNC speech: http://t.co/dn4w3Cqc"]["Catch up on all the great speeches and stories from #DNC2012 so far: http://t.co/gCk95mLj"]["RT if you’re excited for VP Biden’s speech at 9:35pm ET: http://t.co/c0GFICkV"]["President Bill Clinton is explaining why we should vote Obama-Biden on Nov. 6. Watch it live: http://t.co/OtrOhNSl"]["Get to know the 5 key points of the Democratic Party platform in 1 RT-friendly graphic: http://t.co/LiIAH4Es"]["Couldn’t make it to Charlotte? Catch VP Biden and President Obama’s speeches at a neighborhood watch party tomorrow: http://t.co/TsgD4HU9"]["\"Barack knows the American dream because he's lived it.\" Watch @MichelleObama's debut at the DNC last night: http://t.co/2nS29P5D"]["If #DNC2012 has you fired up, do something about it: Commit to vote today. http://t.co/NCvfPZlA"]["San Antonio Mayor Julian Castro knocked it out of the park at #DNC2012 last night. Take a look: http://t.co/nMmsVVZ8"]["VP Biden. Kal Penn. Coming tomorrow to a livestream near you: http://t.co/tCyxRWnk"]["Jill and I are looking forward to hearing from our amazing First Lady tonight—we think she's going to knock it out of the park. –Joe"]["A moving tribute to the late Sen. Ted Kennedy: http://t.co/gLTmRSbq"]["VP to union workers in MI: “We know who built this country, and we know who is going to rebuild it. It’s you. We should be thanking you.”"]["“Let me make something clear and say it to the press, America is better off today.”—Vice President Biden in Detroit"]["“It’s simple, folks. We’re for Medicare; they're for voucher-care. And if they win, people are in trouble.”—VP Biden"]["VP Biden: “While we’re talking about making sure we protect Medicare, they're talking about creating an entire new system—voucher-care.”"]["“‘Right to work’ means the right to work for less, not for what you deserve. That's not going to happen as long as we’re here.”—VP Biden"]["“Because of you and your productivity, the combined auto companies have committed to invest another $23 billion in expansion in America.”"]["“You’re the reason why the automobile industry is back.”—VP Biden at an AFL-CIO labor rally in Detroit yesterday"]["VP in Detroit yesterday: “Much of what they told you at their convention is simply, as they say in my old neighborhood, not on the level.”"]["Cheer on VP Biden and President Obama Thursday night at a #DNC2012 watch party near you: http://t.co/AZO3CkDQ"]["The VP took the stage in York, Pennsylvania with his grandson and son on Sunday. http://t.co/m8Yxk7sm"]["Check out highlights from the VP’s visit to York, Pennsylvania yesterday: http://t.co/rz8gpYGl"]["VIDEO: VP Biden talks about the basic choice on Medicare between @BarackObama and Mitt Romney. http://t.co/Fp15MPx5"]["To the more than 3 million Americans who have given to this campaign: Thank you. http://t.co/yQdPOG96"]["VIDEO: In Iowa, @BarackObama offers his thoughts on the Republican convention: http://t.co/Gs6Fx940"]["RT if you’re ridin’ with Biden: http://t.co/R7Alb7jU"][".@BarackObama on the GOP convention: \"They talked a lot about me. But they didn't say much about you.\" http://t.co/Gs6Fx940"]["Lordstown, Ohio welcomes the VP: http://t.co/vwdhmxAE"]["VP Biden: “We do not think you grow the economy from millionaires down. We know we build it from the middle class out.”"]["Vice President Biden in Ohio: “This is no time to go back. We have to continue to move forward.”"]["VP on the auto rescue that Romney opposed: “200,000 auto workers who’ve been added to the rolls since reorganization would not be working.”"]["VP on Paul Ryan’s false claim about a GM plant closing: “That plant in Janesville actually closed while President Bush was still in office.”"]["VP Biden on the Romney-Ryan budget: “Let’s look at how much they value you. They propose making massive cuts in education.”"]["“‘Romney was willing to go to extremes to secure a federal bailout’ when Bain Consulting was on the verge of collapse.”—VP Biden in OH"]["“There’s nothing bold about turning Medicare into a voucher system.”—VP Biden on the Romney-Ryan plan"]["“They call their plan new, bold, and gutsy. There’s nothing gutsy about giving another trillion in tax cuts to millionaires.”—VP Biden"]["VP Biden in Ohio: “They said last night that things weren’t getting better. I guess they don’t know what’s happening here in Lordstown.”"]["VP: “If we win this election, it will be because of what you did in moments like this to help close the spending gap.” http://t.co/WefYTROJ"][".@BarackObama on how you can prove the cynics wrong one more time: http://t.co/4JLBDOZA"]["New OFA video: Mitt Romney's \"unshakable\" record. http://t.co/zopDPDKf"]["Growing this campaign from the ground up—talking to voters about the issues that matter most to them—is how we win: http://t.co/UAWMgVxT"]["Ohio, get fired up—VP Biden is holding a grassroots event in Lordstown on Friday. Follow @OFA_OH for the latest!"]["President Obama is fighting for small businesses right here in the U.S.: http://t.co/9Tik37Dh"]["RT if you agree we don’t need a President whose private-sector experience involved outsourcing U.S. jobs: http://t.co/ySLEQcR7"]["Mitt Romney’s “convention reinvention”: http://t.co/tf2vfRAj"]["Help win this election—donate $5 today: http://t.co/0qGlDRTE"]["“This is how we could lose the election.” http://t.co/FFKkUg64"]["“There’s no quit in America.”—VP Biden in Minnesota this week: http://t.co/m2c4iTE2"]["VP Biden and @EvaLongoria will speak to supporters in Orlando next week about the important choice Latino voters face this fall."]["Olympic champion boxer Claressa Shields gave VP Biden a gold-medal show of support in Detroit this week: http://t.co/0QWT1qpI"]["Calculate your savings on college costs thanks to President Obama’s policies: http://t.co/9KSsMR2b"]["Four more years: http://t.co/0KRZ8pTY"]["Vice President Biden: “I am absolutely certain we will rebuild this country stronger than it was before.”"]["VP: “My mom used to say, children tend to become that which you expect of them. We expect a lot of you because you are capable of a lot.”"]["“A job is about a lot more than a paycheck. It’s about your dignity. It is about your place in the community.”—VP Biden in Detroit today"]["“There's nothing bold about cutting Medicaid, Medicare, education, and research and development.”—VP on the Romney-Ryan economic plan"]["VP Biden on the Romney-Ryan plan today: “They call it new and gutsy. But I say there’s nothing new about giving a millionaire a tax break.”"]["“We expanded the number of children able to attend college—6 million to 9 million just since we've come to office—because of Pell Grants.”"]["“We rescued the automobile industry, saving a million jobs and creating 200,000 brand-new, good-paying jobs.”—VP Biden"]["VP in MN: “We know the way to grow the economy is the way we always have—from the middle class out. That’s how we’ve always done it.”"]["VP Biden on the Romney-Ryan economic plan: “There’s overwhelming evidence that their policies will not grow the economy.”"]["VIDEO: VP Biden on how President Obama—unlike Mitt Romney—has stood up to China when American jobs are on the line. http://t.co/aBZrWVID"]