["I'm proud to recognize the service &amp; sacrifice of Korean War #veteran E.L. Heffley. His memories will be included in the @librarycongress #VeteransHistoryProject. In this clip he shares a story of trying to retrieve his personal belongings after returning from deployment. https://t.co/7npYzQ52gM"]["Today is #HumanTraffickingAwarenessDay. My latest column explains how Congress is combatting this crime https://t.co/7NlJJHicp9. You can join the fight, too. We can't be silent in the face of this tragedy. These resources ⬇️ can help you alert authorities and #EndTrafficking https://t.co/FlU2Gv5HTZ"]["Excited to learn @Walmart is using savings resulting from #TaxReform to invest in their employees through wage increases, bonuses and other benefits. This is great news and more evidence that our changes to the tax code are good for the economy &amp; working Americans. https://t.co/9hiTzNhmLQ"]["Congrats to Joseph on receiving the RAISE Award. Your creative thinking to solve a real-world problem deserves this recognition. Best of luck as you finish your doctorate. https://t.co/SLGkL01ZjB"]["Today I spoke on the #Senate floor to highlight the positive impacts our historic tax reform law will have on the agricultural industry. Watch this video for the full speech. https://t.co/tUybHSpIkS"]["I am proud of our efforts to pass this landmark #taxreform law and am confident that it will have lasting, positive effects on our economy."]["That's why we took great care to ensure that the agr industry would see the benefits of tax reform. Establishing a tax code that works for our farmers and ranchers, as opposed to against them, is vital to their ability to plan for the future and invigorate rural economies."]["My colleagues and I on the #Ag Committee under the steadfast leadership of @SenPatRoberts are working hard to reauthorize the #FarmBill. Programs authorized by the Farm Bill are absolutely vital to farmers, ranchers and consumers &amp; will provide more certainty in rural America."]["Uncertainty is devastating to our economy. There are few industries that are inherently more affected by uncertainty than #agriculture. We've taken steps to eliminate some of the punitive, needless #regulations that create uncertainty for our #farmers and #ranchers."]["Finally #farmers &amp; #ranchers will be able to expense 100% of their capital investments, such as equipment, over the next 4 years. In his address to @FarmBureau earlier this week @POTUS called that the “sleeper” in the bill. He’s right. It will be good for family-run ag operations"]["97% of the farms in #Arkansas are family owned, and the vast majority of them will now be exempt from the estate tax. This is a big deal. It will help keep those #farms and #ranches in the family for generations to come."]["@SenateAgGOP &gt;94% of #farms are organized as pass-through businesses, meaning they're impacted by the same #tax provisions as individuals. Lower tax rates across the board and a 20% deduction on their taxable income means immediate savings, which can be reinvested to help grow the operation."]["@SenateAgGOP #Agriculture is Arkansas's largest industry, adding around $16B to our economy annually &amp; accounting for nearly 1 in 6 jobs. We're in the nation’s top 10 producers of a number of #ag commodities. #TaxReform helps create an economic environment where the ag industry can thrive."]["About to speak on the #Senate floor with some of my @SenateAgGOP colleagues to highlight the positive impacts our historic #taxreform law will have on the #agricultural industry. WATCH: https://t.co/3b0Ko4c4FY"]["I'm \"ferry\" excited to join #SenateEPW today to talk a\"boat\" our nation’s inland waterways system. You're welcome for the #DadJokes/#HumpDay humor to get your Wednesday started, but please do tune in @ 10am EST. https://t.co/6tEPrYtIoi https://t.co/MY905IzUs5"]["Congrats to my friend &amp; colleague @rep_stevewomack on being recommended to serve as chair of @housebudgetGOP. Steve’s a natural leader &amp; willl do a great job. Republicans in Congress will benefit from having his strong voice advocating for more fiscal discipline &amp; regular order."]["Thanks for stopping by. Enjoyed discussing the great work @UnitedWay does. https://t.co/bkSm9XecbS"]["Today is #LawEnforcementAppreciationDay. Thankful for their service to our communities, states &amp; nation. That’s why I'm asking @TheJusticeDept to help ensure local LEOs have the resources needed to partner w/ the federal government on shared priorities. https://t.co/VX62shGZFI"]["I'll be joining @cspanwj at 7:40am CT to talk about efforts to reach an agreement on government spending before the upcoming deadline."]["I will continue working with @POTUS to help hardworking farmers &amp; ranchers in rural America. I’ve long supported improvements to rural broadband and I’m pleased to see the Administration’s support of this goal as well changes to the #FarmBill and less regulation. #AFBF18"]["Good luck and Godspeed to the @usairforce airmen from #LittleRock Air Force Base who just deployed to the Middle East in support of Operation Freedom's Sentinel. We appreciate your service and hope for a safe, successful mission and return home.\nhttps://t.co/XuncyDSG9n"]["Looking forward to continuing this progress in 2018. Thank you to @SenJohnBarrasso for his leadership. https://t.co/baRNCsXFmO"]["READ my latest column about why January is National #Slavery and #HumanTrafficking Prevention Month &amp; what we're doing and can still do to combat the heinous crime of modern-day slavery. #EndTrafficking\nvia @BoonevilleDemo https://t.co/DtPuTLM5mH"]["Congrats to the @EAST_Armorel students whose creativity and desire to help has made a big splash - their story has been featured by many national news outlets. Great job using technology &amp; what you’ve learned to improve the world around you.\n\nhttps://t.co/SPHzdKkDFq"]["More great news for American workers as @taxreformer is crunching the numbers and has found that so far 1 million+ Americans will receive bonuses from their employers as a result of #TaxReform. See the full list: https://t.co/c38WtnJXg5"]["Enjoyed getting to stop by @UArkansas and meet new AD @HunterYurachek &amp; @coachchadmorris. Looking forward to what @ArkRazorbacks and @RazorbackFB will achieve under their leadership. #WooPig 🐗 #HammerDown 🔨⬇️ #WPS 🏈 https://t.co/uUCt8tlUQ1"]["Great to visit with @RogersFire &amp; @Springdale_Fire to discuss fire grants and get updates on the community. Happy to support local fire departments and help them get the tools and resources needed to do their job.\n👨‍🚒🔥👩‍🚒 @ARFireMarshals https://t.co/WovGWLGdUQ"]["Constituent service is one of my top priorities as your U.S. Senator. 2017 was a big year in that respect and my staff and I are ready to do even more this year. We're available and ready to help however we can, so please reach out and let us assist you. https://t.co/jateeYX4Yw"]["Congratulations to the Griffin family on their new bundle of joy. https://t.co/IKnl6BSTjD"]["Congratulations to Ron Chastain, Gary Churchill, Sarah Dunklin, Nathan Reed &amp; Vivien Wright who will be serving on the #Arkansas FSA State Committee. These Arkansans will do a great job representing our #farmers &amp; #ranchers. https://t.co/GcTTNMUeBF"]["Pleased w/ the Administration's proposal to give small businesses the opportunity to band together to provide their employees with another option for affordable health insurance. Flexible, common sense options like this one will help expand access. https://t.co/qdyXxH5R4I"]["ICYMI: Fort Smith is celebrating its #bicentennial in a year-long celebration and I was proud to recognize this milestone on the #Senate floor. https://t.co/xBZGq2dBWa"]["I’m excited for the Fort Smith community as it comes together to recognize and commemorate its #bicentennial and wish all the very best as the events celebrating this milestone take place throughout 2018. @FtSmithARK @gofortsmithar"]["As home to a growing university, new medical school and vibrant new industries, I know Fort Smith is starting the 21st Century on a solid foundation. We have much to celebrate from the past, but even more to look forward to for the future. #bicentennial https://t.co/LvCFAp5bXt"]["Congratulations to Fort Smith, #Arkansas on #200 years. I’ll be speaking on the #Senate floor in commemoration of this milestone. #bicentennial Watch here https://t.co/IKaKcSZ3g7"]["More positive news for American workers as a result of #taxreform\n\n'Southwest and American airlines to pay bonuses after tax bill' - @AmericanAir &amp; @SouthwestAir giving employees $1k bonuses this year, citing benefits from tax bill. https://t.co/dAUmhyQjls"]["The enormous impact of @senorrinhatch’s tireless work throughout his tenure in the Senate cannot be understated. His leadership, vision &amp; dedication will be missed when he retires at the end of this term."]["Our economy made a lot of positive strides in 2017: 1.7M new jobs, unemployment at 17-yr low, consumer confidence at 17-yr high, &amp; Dow Jones up 5k points. READ my latest column about why our economic revival is just beginning. via @NewtonCoTimes\n \nhttps://t.co/dLwCYnTIX5"]["#HappyNewYear! Hope your 2018 is happy, healthy and bright. https://t.co/PlSbRtyMq1"]["We’ve achieved a lot in 2017. From a growing economy, bipartisan VA reform, unprecedented success confirming judges to the bench and passing historic tax reform, there’s a lot to be excited about. There’s still more work to do in 2018 &amp; I’m ready to come together and get it done. https://t.co/ulbFlf9hjS"]["Wishing you and your family a #MerryChristmas! May this season fill you with joy and warmth shared with the ones you love. https://t.co/Y8WmVDGj6N"]["As you celebrate the holiday season, take a moment to remember all the men and women who are serving our country in uniform. We’re so grateful for their service and sacrifice, especially those who may be away from loved ones. Wishing them all a safe and merry Christmas. https://t.co/seo0eDiVVl"]["Tune in tonight at 7:30 to watch my discussion with Steve. We have a lot to talk about so don’t miss it. https://t.co/FqhJ35lqzJ"]["Yesterday the #Senate confirmed Chris Caldwell to serve as Federal Co-Chairman of the @DeltaRegional Authority. We're proud of &amp; excited for Chris and believe that great things are in store for the delta region with him at the helm. My full statement: https://t.co/AyE7YJmAYS"]["Thank you for supporting this bill and fighting for veterans exposed to Agent Orange during their service in Thailand. https://t.co/iuMxEyxZY5"]["I'm pleased to honor the memory, service &amp; sacrifice of the lost crew of San Antonio Rose. Thank you to @SenBlumenthal for his leadership to bring these heroes home. https://t.co/ZPpcbLHiBB"]["We have a moral obligation to help people around the globe whose human rights are under attack. I’m pleased that @POTUS is taking action to put an end to the abuse and corruption by imposing sanctions on bad actors."]["Tune in to @newsradio1029. I'm getting ready to talk about #taxreform with Kevin Miller. https://t.co/qM1t9CTHjI"]["Today the #Senate confirmed Dak Kees to serve as US Attorney for the Western District of Arkansas. Dak has a distinguished career of service to our country. He'll enforce &amp; uphold our nation’s laws and I look forward to working w/ him to combat crime &amp; make our communities safer."]["Thanks for your support as well, Governor. This is a great day for Arkansas &amp; America. Families &amp; businesses will reap the benefits and our economy will grow. https://t.co/1aNHmcp0Ko"]["The House of Representatives just passed the the Tax Cuts and Jobs Act, which will deliver tax relief to Americans. I'm looking forward to supporting the bill when it comes to a vote on the Senate floor later today so we can send it to the president's desk. https://t.co/PCYkzqiHAi"]["Our homeland continues to be the target of violence by individuals intent on threatening our nation &amp; its ideals. READ my column on why ending the diversity visa lottery is necessary to help defend our country. @TimesRecord\nhttps://t.co/CBuycBdiQq"]["\"I'm confident this crew, known as the Warhogs, will carry on that same work ethic\" -- Read @ArkansasOnline story on this weekend's commissioning of the U.S.S. Little Rock: https://t.co/C8MoyNXVRp"]["I’ll be speaking at this event. Will be a great day for our state and @USNavy. Tune in to the livestream at the links below or follow @USNHistory while they live-tweet the event! #USSLittleRock https://t.co/vbHfYWeFWU"]["@GarrisonHero Yes, I’ll be in attendance. Expecting it to be a great event and something our entire state can be proud of. Hope lots of Arkansans tune in."]["This is a troubling development. I encourage our diplomatic, intelligence &amp; national security professionals to continue to analyze any evidence that Iran is violating commitments to the international community and creating more instability in the region.\n\nhttps://t.co/jvEBblKYWu"]["The #BillofRights guarantees limits on the government's power and provides all Americans with some of the basic liberties and freedoms we hold so dear. They were ratified by Virginia on this day in 1791 &amp; formally became the first 10 amendments to our #Constitution. https://t.co/beoGwhnBIm"]["I'm very excited to be taking part in the commissioning ceremony of the the new @USSLittleRock9 tomorrow. The @USNavy has a rich tradition of organizing ceremonies that celebrate these achievements while honoring the past &amp; inspiring us for the future.\nhttps://t.co/I4rBrY09Pm"]["Pleased that Gov. @AsaHutchinson is working alongside myself &amp; many others to remind the administration that #NAFTA has been beneficial to our state's agriculture, retail &amp; manufacturing sectors. Modernizing the agreement must protect these gains. https://t.co/S791hqvx3D"]["Congratulations to the Alston family of Polk Co. who were named 2017 #Arkansas Farm Family of the Year. I'm submitting a statement to the Congressional Record to help mark this occasion. Their hard work &amp; dedication to farming &amp; agriculture is inspiring.\n\nhttps://t.co/cIHo0yPuZm"][".@senjudiciary has just approved the nominee for US Attorney for the Western District of #Arkansas, Dak Kees. Appreciate their action on his nomination &amp; look forward to a vote on the #Senate floor soon. Dak will do a great job as US Attorney."]["Very proud of the 17 Arkansans who represented the USA @IDOWorldDance championships in Poland last week. They worked very hard for this opportunity and represented #Arkansas &amp; our country very well. 💃🕺 Well done! https://t.co/H3OhW3utAd"]["Congrats to Mariah, the @usairforce fellow assigned to my office this year, on graduating today from the AF Legislative Fellowship Program &amp; also recently being selected for promotion to Chief Master Sergeant. Thankful for her service to Arkansas &amp; our nation🇺🇸 Good luck! https://t.co/3gK481VbOv"]["Great to meet with and hear from @ArFB Young Farmers &amp; Ranchers and discuss what’s important to our #agriculture community. Also great to see young people helping to take #farming into the next generation. https://t.co/HsCvobjqS3"]["Today we celebrate the 381st birthday of @NationalGuard &amp; recognize the service &amp; sacrifice of @arkansasguard CW5 (retired) Pamela Huff. She shares the biggest lesson learned as a member of the 39th Infantry Brigade in this clip for @librarycongress #VeteransHistoryProject. https://t.co/JcyWjlMmLB"]["#HappyHanukkah to all those celebrating the Festival of Lights. Wishing you a happy and blessed holiday."]["Excited to attend the commissioning ceremony of @USSLittleRock9 on Saturday. A watch party is also being held in Little Rock with a livestream so Arkansans can help celebrate this special occasion. See this @THV11 article for details ⬇️\nhttps://t.co/8yngMBAIAb"]["Congress should pass the Children’s Consignment Event Recognition Act, my bill that would shield children’s consignment business owners like @rhealana from unnecessary @USDOL regulations that stifle innovation and harm entrepreneurs &amp; families. @dcexaminer\nhttps://t.co/UPBiKeUMyG"]["As we learn more about the attempted terrorist attack in NYC today, we're reminded to stay vigilant &amp; enhance our security against threats from abroad and at home. Thanks to the first responders &amp; national security personnel who worked quickly &amp; effectively to protect Americans."]["Congress is on track to provide historic #taxrelief to hardworking Americans. It's been 30 yrs since we've overhauled the tax code. READ my column 'Tax Reform: One Step Closer' to learn about how individuals &amp; our economy will benefit - via @BoonevilleDemo\nhttps://t.co/obI5LKXsek"]["@PressSec Thank you, Sarah. No matter how old I get, I’m grateful to call you a friend and so happy for your success. Always remember how proud of you we all are."]["I'm calling on the VA to do a nationwide review in light of reports it hired providers w/ at least 1 state medical license revoked for malpractice. This is unacceptable. #Veterans deserve &amp; have earned proper medical care from providers in good standing. https://t.co/l9wtT7jtUC"]["Appreciate @SenateAgGOP Chairman @SenPatRoberts explaining benefits of NAFTA for farmers, ranchers &amp; producers. It makes sense to look at parts of the agreement that can be modernized/strengthened, but we must remember how it has helped our #ag industry.\n\nhttps://t.co/hb4AwrPOy7"]["Congrats to @ArFB on another successful convention, the 83rd in the organization's history. Farm Bureau truly has been \"Leading Across Generations\" and I look forward to continuing to work with them and the re-elected leadership team to advance #AR agriculture."]["I was honored to recognize the life and legacy of the late Judge G. Thomas Eisele in the Congressional Record recently. I’m grateful for the influence this #Arkansan had on our state, country and judicial system. https://t.co/TFnbSfcTnG"]["Busy week in Washington &amp; there's more work to be done, but I've enjoyed seeming some friendly #Arkansas faces this week too including AR State Forester Joe Fox @ARForestryComm and AR Public Schools Facilities Dir. Brad Montgomery @ArkansasEd, among others. https://t.co/nq4C0AbeZF"]["FDR described Dec. 7, 1941 as \"a date which will live in infamy.\" It has. Not only bc of the devastating attack our country suffered, but the strength, courage &amp; resolve of our response. One unsung hero of #PearlHarbor is being honored posthumously today: https://t.co/sgwCr9x6tZ"]["My full statement on @POTUS announcement that the United States will recognize Jerusalem as the capital of Israel🇺🇸🇮🇱⬇️ https://t.co/NOPVXDxel5"]["Big things happening @ArkRazorbacks in the past few days. Congratulations &amp; welcome to new AD @HunterYurachek &amp; new @RazorbackFB Coach @coachchadmorris. We're excited about the future &amp; eager to watch you get to work. #WooPig 🐗"]["As Chairman of the Senate Committee on Appropriations Subcommittee on Homeland Security, I look forward to working closely with Ms. Nielsen and her team to ensure that Congress is giving @DHSgov all the support it needs. (2/2)"]["Securing our nation from the many threats we face is one of Washington’s most important responsibilities. I am confident that Kirstjen Nielsen has the experience, knowledge &amp; leadership skills to serve our nation in this extremely challenging capacity. (1/2)"]["I joined Ms. Pankey's 6th graders at Euper Lane Elementary in Fort Smith via skype to talk global community problems like #malaria. Glad I could share with them what I've learned through visits to Africa &amp; my involvement w/ #Senate Malaria Working Group. @FSSchools https://t.co/WuQ4y3WxTe"]["We often find ourselves feeling both thankful for our blessings and wanting to help others less fortunate during the holiday season. READ this column in which I discuss what we're doing to fight #hunger in the US &amp; around the world. #foodsecurity https://t.co/rVtyOTMdez"]["Passage of the Senate bill is a great step toward finally having an efficient and effective tax code that works for the American people by doubling the standard deduction, lowering rates and eliminating loopholes. Full statement: https://t.co/SnAdtfyTPP"]["#TaxReform means delivering relief to the American people. Studies show it will raise incomes and wages💰 and grow the economy📈. Arkansans deserve to keep more of their own 💵 and this bill will let them. Find out more ⬇️\nhttps://t.co/ez0LUyVGXQ @SenateRPC"]["It's been a privilege to work w/ @WFPChief on hunger &amp; nutrition issues. @WFP is the world's largest humanitarian agency fighting hunger worldwide. It's an honor to partner w/ David &amp; WFP as the US continues to lead on ending hunger &amp; malnutrition. #ZeroHunger https://t.co/CUuff84N1c"]["ICYMI: @DeptofDefense will study viability of a logistics &amp; distribution center at Pine Bluff Arsenal. I supported this provision in the #Senate NDAA. https://t.co/7dD35Q50Q2"]["Met with representatives of @Glatfelter to get an update on the progress of the #manufacturing facility it's locating in Fort Smith. Bringing high-skilled #jobs to the region is a huge benefit and I look forward to its completion. https://t.co/984IkCbs98"]["Pleased to join my colleagues on @BudgetGOP to make #TaxReform one step closer to reality. https://t.co/aJ3OviLIxx"]["Pleased to have had the opportunity to sit down with a bipartisan group of senators to hear from His Majesty King Abdullah II. Jordan is a strong, steadfast partner in the Middle East and we are thankful for @KingAbdullahII's leadership."]["Ty does a great job working on a lot of issues important to #Arkansas communities, including #agriculture &amp; #HungerRelief. He also comes from a farming family so he's had some practice gathering a harvest! https://t.co/S4zSLzVFa7"]["The @uscapitol Christmas Tree 🎄 arrived on the West Lawn this morning. This tradition, which began in 1964, is a great way to help ring in #Christmas and the entire holiday season. This year’s tree is from Montana. https://t.co/Tzn0N97DyQ"]["It was great visiting w/ Mr. Magee’s class at Elmwood Middle School @RogersSchools &amp; Ms. Mathis’ class at Beard Elementary @FSSchools via #Skype this morning. Enjoyed answering their excellent questions. https://t.co/lXHB2CrSlh"]["Earlier this month the president declared November as National #Veterans &amp; Military Families Month. As we approach the end of the month I reflected on the work left to be done to honor our commitment to vets. Read my thoughts here via @KAWX_Radio https://t.co/HUsb6HNii9"]["Small Businesses are the backbone of our economy; employ our family, friends &amp; neighbors; &amp; contribute to our local economies and communities. Thank them and support them by shopping #smallbiz today on #SmallBizSat #SmallBusinessSaturday https://t.co/XrLuzoNSBH"]["Today is #BlackFriday but don’t forget that #SmallBizSat is tomorrow, Nov 25! When we #ShopSmall we support the small businesses that give back to and invest in our communities. https://t.co/PkqdGTc4h6"]["It’s an incredibly worthwhile endeavor for many reasons, but mostly bc these stories need to be heard by us &amp; future generations. We’ll never be able to thank our veterans enough for their service &amp; sacrifice, but we can make sure to preserve their memories &amp; honor their service."]["We need to listen to &amp; document these stories. They are amazing, inspiring, full of courage and heroism, heartbreaking, sobering, and each one is unique.\n\nI’m thankful for the folks throughout Arkansas who are getting involved in this effort and I encourage you to join us."]["@ArkansasOnline @librarycongress The interviews give families something to pass down through generations. They’re important for the historical perspective but also for the families. I’ve learned a lot since we began this effort, but the biggest takeaway is to take every opportunity to sit down w/ our vets."]["29 million+ US #smallbusinesses  support our local economies every day. Let's show our support and #shopsmall this holiday season."]["Wishing you and your family a happy and blessed Thanksgiving. #HappyThanksgiving https://t.co/AnYmx28jhB"]["Recently visited @AF_Academy &amp; got to have lunch w/ cadets from #Arkansas. I really enjoyed the opportunity to learn about what the Academy is doing to advance the @usairforce mission &amp; train future leaders. Very proud of our airmen. #AimHigh #FlyFightWin https://t.co/Ad8v3z6RcP"]["My prayers are with those involved in the crash of the @USNavy C2-A aircraft in the Pacific, especially the three who remain missing and their loved ones. US sailors &amp; our partners are no doubt working tirelessly to locate them and we hope they are safe and successful."]["As we enter the holiday season and prepare to show family &amp; friends how much they mean to us, I'm encouraging everyone to join me in patronizing local merchants and retailers that support our own communities. READ my column via @harrisondaily for more:\nhttps://t.co/PBnJCXpDVX"]["Great to visit with you and hear about how your hard work is paying off. Glad you're living your American Dream &amp; serving as an inspiration to so many Arkansans. https://t.co/mOtzSvQOx8"]["#TaxReform is so important because it will help create jobs, encourage investment, and let middle-income Arkansans keep more of their own money. Visit https://t.co/kDeiY6ESZU for more details about the plan. @GOPSenFinance @SenateGOP https://t.co/9Nz9TX8wfF"]["The death of Border Patrol Agent Rogelio Martinez in the line of duty is tragic. I'm praying for his family &amp; friends as well as his partner who was injured during this incident. I'm also grateful to all @DHSgov who risk their lives &amp; safety to protect our homeland."]["I’ve enjoyed visits today to Altus, Ozark and Van Buren which included a tour of the new Crawford County jail. Thank you to Sheriff Ron Brown and Judge Dennis Gilstrap for showing me around and their dedication to public safety. https://t.co/nwRKt5oGzQ"]["Leading a bipartisan group of senators in asking Commerce Sec. Wilbur Ross to conduct a robust economic analysis evaluating how changes to NAFTA would impact our nation’s crop &amp; livestock sectors. We need trade policy that benefits both U.S. consumers and producers. https://t.co/dyLDioHxT6"]["I support @WFP and its efforts to provide food assistance around the globe. We can help end the humanitarian crisis in Yemen. https://t.co/5bh8CZUxYR"]["Looking forward to debating the bill on the floor of the Senate very soon. Arkansas families need #taxrelief and I want to help them keep more of their hard earned money in their pockets. #taxreform https://t.co/gSHVu1RHBG"]["Congratulations to 4th generation rice farmer Jennifer James of Newport, #AR. Jennifer is the @FieldtoMarket 2017 Farmer of the Year. She's a great advocate for agriculture and conservation who is making Arkansas proud. https://t.co/z6XaFVhatL https://t.co/ckC8iL1MQ0"]["#Senate passed the National Defense Authorization Act conference report yesterday, including a provision I offered in support of Pine Bluff Arsenal. We must be prepared for today’s missions &amp; evolving threats facing our country. READ my full statement: https://t.co/omox26LW9w"]["I'm incredibly sad to learn AR State Sen. Greg Standridge passed away after battling cancer. Greg answered the call to public service, admirably serving his constituents even through illness. My thoughts &amp; prayers are w/ his loved ones as they mourn his loss &amp; celebrate his life."]["Today is #WorldPancreaticCancerDay &amp; it's a good opportunity to help raise awareness &amp; join the fight against this deadly disease. #PancreaticCancer @PanCAN @worldpancreatic"]["Great meeting with Hot Springs Chamber representatives today. Always valuable to visit with and get updates from local leaders. https://t.co/cAtu1cfWxy"]["Appreciate getting an update on @DeptVetAffairs efforts to prevent &amp; combat #opioid overmedication. You can watch the hearing LIVE: https://t.co/e0nN1VgBTJ"]["WATCH: I sat down w/ Patrick Haggerty @OfficialRFDTV to talk about how the ag community will be a priority as the US works to revise NAFTA. https://t.co/ON06yskvjk"]["Today is #AmericaRecyclesDay. As Co-Chairs of the Senate Recycling Caucus, @SenatorCarper &amp; I have introduced a resolution that recognizes this great initiative. #Recycling supports over 534,000 jobs &amp; generates nearly $117 billion in economic activity. cc: .@recyclesday"]["Continuing to highlight the constituent services my office provides. We're hosting a mobile office tomorrow in Little River County and want to hear from you. If we can help you, please drop by and visit w/ my staff. #ServingAR https://t.co/gE9peo3VNP"]["Thanks to the representatives of the #Arkansas Waterways Commission (@ArkWaterways) for coming by today. I enjoyed our discussion and appreciate your hard work in support of our state's waterborne transportation and ports. https://t.co/XzH0l0ZW85"]["See this column where I highlight why I consider constituent service to be one of the most important jobs I have as a US Senator. Fighting on behalf of Arkansans is always my top priority. https://t.co/zpk7JmcZNi"]["My staff will be holding mobile offices tomorrow in Madison &amp; Phillips Counties. If you are in or near these areas and you're facing a problem that my office can help with, please stop by and talk with my staff. Details ⬇️ https://t.co/Q26XaUuTH7"]["I’ve introduced a bipartisan bill w/@SenDonnelly to help #veterans exposed to Agent Orange get recognition &amp; treatment from the VA. You can learn about it via @KARK4news. Their reporting has brought a spotlight to this issue. https://t.co/lr0ch3oBm5"]["ICYMI: The ceremonial groundbreaking for a National #WW1 Memorial in Washington, DC was Thursday. It’s being designed by an Arkansan. Still a long way to go but looking forward to its completion in order to #honor WW1 #veterans @WW1CC\n https://t.co/XIrUjITwIk"]["WATCH @AF_Academy Cadets Ramey and Reynolds from Arkansas share a special #veteransday message. Thanks for helping us honor our vets and for your own service to our country @usairforce #aimhigh #flyfightwin https://t.co/m3eKdKkxI7"]["On #VeteransDay, I'm proud to recognize John Rollins of Fayetteville. He shared memories of his time in uniform in an interview for @librarycongress #VeteransHistoryProject. We thank all our vets for their brave service &amp; sacrifice. https://t.co/z8FW9I0BrF"]["Happy Birthday @USMC and Semper Fi! https://t.co/15t9LUkWLO"]["@SenDonnelly And thanks to @VFWHQ for their support of the bill as well. We'll all keep pushing to correct this misguided policy."]["I'm fighting for vets exposed to agent orange while serving in Thailand during Vietnam War era. Current VA policy arbitrarily disqualifies veterans who may otherwise be able to prove exposure to toxic chemicals. Proud to have @SenDonnelly join me on S.2105\nhttps://t.co/lmaoB9DFPi"]["I'm chairing a Senate Agriculture Committee hearing this morning . WATCH: https://t.co/nwQaT39ZTi"]["Listen to my interview with @kffb1061 about the need for #taxreform. This will help grow the economy and help Arkansans keep more of their hard-earned money. https://t.co/MCoaAUp37U"]["There is still more that needs to be done to improve #veteran services including expanding @DeptVetAffairs services for female veterans. I urge @SecShulkin to implement reforms written in the Deborah Sampson Act  that don’t require congressional action #SheWhoBorneTheBattle"]["I appreciate Senator @RonWyden’s leadership to fix a clear oversight in the law that unfairly penalized wounded and injured service members from accruing educational benefits they rightly earned. #GIBillFairness"]["Headed to the #Senate floor to recognize our #veterans &amp; the progress we've made this Congress to honor our promise. Watch: https://t.co/S7kE1qQEh0"]["Always glad to advocate for educational exchange. Just as important today as in 1946 when #AR Senator Fulbright helped found the program. https://t.co/ckiSenjUmY"]["I presented #Arkansas #veterans Harold, Minuen &amp; Robert with the medals they earned in service to our country. Thank you for your service. https://t.co/1aei4feAyA"]["READ my weekly column on how Arkansans are using the Veterans History Project to honor #veterans via @harrisondaily https://t.co/1LHyArkvPj"]["I was honored to present service medals to #AR veterans. @KNWAnews shows the importance of this recognition to one #veteran &amp; his family. https://t.co/jslR01kQeT"]["Our #ag &amp; #rural communities will be served well by @USDA Appointees for AR Rural Development &amp; Farm Service Agency.\nhttps://t.co/Wi8HRTXuUS"]["My condolences to the victims, their families &amp; the entire community of Sutherland Springs. We are grieving w/you &amp; standing beside you 2/2"]["Saddened by the events that unfolded yesterday at one of the most sacred places in our society, a house of worship. 1/2"]["Congrats @JuddPDeere. Appreciate your service 2 #Arkansas in my office &amp; w/ @AGRutledge. Good luck in your new role! https://t.co/n3YmtJOHH2"]["NAFTA is impt to AR farmers &amp; ranchers. I talked w/@OfficialRFDTV abt the need to break down unfair trade barriers &amp; improve market access https://t.co/6r2KGXQDzz"]["The House #TaxReform bill is a good first step to deliver tax relief for all Americans. #LowSimpleFair 💵🇺🇸💰\nREAD my full statement: https://t.co/T6QYKi8Puk"]["@voiceofD @UCAComm Enjoyed our visit. Hopefully I'll be able to visit your class soon."]["Senate confirms 4 circuit court judge nominees in 1 week despite continued obstruction to fill executive positions\nhttps://t.co/jp65S9GtM2"]["My staffer Heba was recognized for outstanding support of @WhiteHallAR Military Affairs Advisory Cmte/@USArmy Pine Bluff Arsenal. Congrats! https://t.co/b5o9XhO8PK"]["We should eliminate the Diversity Visa Lottery Program &amp; prioritize our safety and security. Read my full statement ⬇️ https://t.co/52gNIHAbSO"]["What a great tribute recognizing the service &amp; sacrifice of the men &amp; women inducted into #Arkansas Military Veterans' Hall of Fame @amvhof https://t.co/ZL27unvUgl"]["Praying for victims of NYC attack. Grateful for first responders &amp; law enforcement. We must remain vigilant &amp; resolved to defeat terrorism."]["Pleased to support #Arkansas Take Back. Locations like this one in Fayetteville make it easy for us to get rid of unneeded prescriptions. https://t.co/OhTcpQYFSW"][".@artakeback is tomorrow, 10/28. Visit https://t.co/kvDDtJmICQ to find a location near you. Let's all help #ReverseTheOpioidEpidemic https://t.co/7nUxsDL4JI"]["House passage of Senate 2018 budget means we can get to work on #taxreform to help middle-class families &amp; grow our economy. #LowSimpleFair"]["Saturday, October 28 is Arkansas Take Back. Find a location to drop off old, unneeded prescription drugs. https://t.co/xmIV2C1TQw https://t.co/lQijkh0vFa"]["At a Senate EPW hearing this morning focusing on how forest management can play a big role in mitigating or preventing deadly #wildfires. https://t.co/GM6vi3a1fB"]["It was great visiting with #Arkansas @AAHOA members who are in #Washington for their 2017 Fall National Advocacy Conference. #FNAC17 https://t.co/AhMkiErLno"]["Had a good visit w/Kirstjen Nielsen. If confirmed as Secretary, I look forward to working w/her to ensure .@DHSgov gets the support it needs https://t.co/MaW8ZCOqf6"]["Hope Campus is a great addition to Fort Smith that brings together under one roof services for homeless in the region. https://t.co/0xVF8gB2oS"]["Getting ready to join @newsradio1029. You can listen live https://t.co/qM1t9CTHjI"]["@JenCleveland @artakeback Here's a different site that ran the same column: https://t.co/xD8YhPXYbR"]["'How You Can Help in the Effort to Curb #Opioid Abuse' - My latest column discusses the #opioidcrisis &amp; @artakeback. https://t.co/V3aobGU1Zt"]["Working w/ my friend @SenatorTester to improve care for women veterans. The Deborah Sampson Act will do just that. #SheWhoBorneTheBattle https://t.co/hnlviCrjUM"]["Products from #AR were a hit w/ my colleagues at lunch last week. Read about what we chowed down on @ArkansasOnline https://t.co/zgpuSzhsYa"]["My staff is hosting a Mobile Office in Paragould at City Hall from 2-4 today. Let us help you. https://t.co/XgIASHBZk3"][".@SenatorTester &amp; I are redoubling efforts to change the culture at VA that has left too many women veterans behind: https://t.co/p9CWTyzLC5"]["U.S. Senator Hattie Caraway was also the first woman elected to the #Senate. She represented #Arkansas in the Senate from 1931 to 1945. https://t.co/us0zDkJxWt"]["Proud of how #AR leaders, educators &amp; students are embracing STEM fields. Congrats to the winners &amp; all participants https://t.co/Fojf1OA7hk"]["I’m excited to share a taste of #Arkansas with my #Senate colleagues at lunch today. #ARRice @neighborsmill @Mtnvalleywater https://t.co/X5UogmKe7h"]["During #ForestProductsWeek we #CelebrateFP bc the industry employs thousands of Arkansans, boosts our economy &amp; promotes healthy forests.🌲 https://t.co/EghqsJJ6tt"]["Enjoyed visiting w/ Sutton Elementary 6th graders via Skype today. They had great questions &amp; are a bright group! @FSSchools #FortSmith #AR https://t.co/rAeUovxjbd"]["For #Cybersecurity Awareness Month, let's make every effort to protect our data. READ my column @BoonevilleDemo https://t.co/rUefRayyvD"]["Pleased to share memories of #WWII #veteran Garland Gable of Conway, #Arkansas for Veterans History Project. We are thankful for his service https://t.co/vOCDYothKk"]["Heba does a great job and works hard on behalf of all Arkansans. Glad she was able to visit with these students. Go Goblins! https://t.co/lo222tlyqs"]["My staff met up w/these #AR @usairforce Vietnam vets in DC for an Honor Flight, visiting nat'l monuments. We are thankful for their service. https://t.co/k5WnFQI9RV"]["Thank you to all our brave men &amp; women of @USNavy. They keep our country safe &amp; help whenever called upon. Anchors aweigh! ⚓️ #242NavyBday https://t.co/rhcr8THvkj"]["Looking forward to working with @DHSgov Secretary nominee Kirstjen Nielsen, who has an impressive national security &amp; cyber background."]["Obamacare is unsustainable. I applaud @POTUS for taking action to bring down costs by expanding choice &amp; increasing competition."]["Did you know 99% of farms=family-owned &amp; account for 89% of ag production? Thankful for farmers who do a tough job well! #NationalFarmersDay https://t.co/kpXD0XccQE"]["Our antiquated tax code needs to be overhauled. READ my column via @TimesRecord \"Now is the time for tax reform\" https://t.co/wpgE9tbVsV"]["Rescinding these regulations will help keep energy costs down for Arkansas families &amp; protect jobs here at home https://t.co/IDeDzqe1RR"]["It's an honor to interview WW2 veteran Jesse Trice for @librarycongress #VeteransHistoryProject to preserve his story for future generations https://t.co/htlTvPUVjp"]["Sending thoughts &amp; prayers to all involved w/ tragic events in #LasVegas. Thankful for heroic actions of law enforcement &amp; first responders."]["Jace is a great ambassador for my office and for #Arkansas. https://t.co/m15JEOWA1h"]["Cody Hiland has been confirmed as U.S. Attorney for Eastern District of Arkansas. Congrats from @SenTomCotton &amp; me: https://t.co/7hVGsWCMDu"]["I'm excited to have Congressman @SteveScalise back! https://t.co/2Sg6Nz0VcC"]["I'm participating in the #FarmBill18 rural development &amp; energy hearing. Watch LIVE: https://t.co/YOiKaIEv68 / https://t.co/XfFPCmKO3i"]["The #TaxReform framework unveiled today will lead way to a fair and simple tax code. Full statement: https://t.co/ZBNCfMWN2k"]["Congrats to Fernanda of Bentonville, @BGCA_Clubs Southwest Youth of the Year. We are proud of you &amp; the example you set for #Arkansas youth. https://t.co/XptQek9Kw4"]["My staff is hosting a mobile office at the Horseshoe Bend City Hall until noon. Stop by and let us help you. #Arkansas https://t.co/16of44CXPZ"]["I've joined a bipartisan group urging for an immediate extension of critical funding for community health centers: https://t.co/rxJS6B8tWl"]["We thank @SecretaryPerry for taking the time to meet with us regarding Clean Line: https://t.co/6i76E3HRMo https://t.co/GyvF2Aaz4C"]["Pleased to recognize Washington Co. Judge Joseph Wood for his support &amp; advocacy for adoption in #Arkansas. @CCAInstitute #adoptionangels https://t.co/bitkvd3kfL"]["My staff is setting up for a mobile office in Paris. They will be at Community Outreach Services until noon. Stop by and let us help you. https://t.co/wlYXTIrwyF"]["I took time today to reflect upon the Central High integration and the Little Rock Nine on the Senate floor: https://t.co/5bCoVEO10o"]["If you missed my conversation about health care reform with @RobyBrock yesterday, you can watch it here. https://t.co/QBQFLwkDdb"]["Dak’s strong investigative skills &amp; experience make him an excellent pick for U.S. Attorney for the Western District https://t.co/TE7GGLMiHD"]["Great to be on hand as @WTCArkansas marked it's 10th anniversary yesterday. Learn how it helps grow AR's economy: https://t.co/j30OtYM4qD https://t.co/Pmi0bvclhE"]["READ: My @ArkansasOnline column celebrating @WTCArkansas milestone of connecting #AR w/ global economy for 10 years: https://t.co/17q5oJjENK"]["My office would be happy to arrange tours to help you make the most of your trip to Washington, D.C. https://t.co/XKEc1sVXbY https://t.co/z7zOtM34aa"]["Recognized @usairforce &amp; our #airmen who are meeting the challenges of an ever-changing world w/ limitless strength, resolve, &amp; patriotism. https://t.co/V2oIAOrrEO"]["Happy 70th Birthday @usairforce. I’m proud to honor our Air Force and the #Airmen who make it exceptional. #AFBday https://t.co/d1vHZdPZCl"]["https://t.co/UehfI8rYFi"]["OTD 230 yrs ago the founding fathers gave us the #Constitution. Their wisdom still inspires us to form a more perfect union. #WeThePeople https://t.co/xvEwVqQQSl"]["@firesafetydogs Getting better every day Molly. Thanks for checking on me!"]["Pleased to support the #Veterans History Project and have my staff share how you can get involved. Learn more here. https://t.co/T1TRi70ioZ"]["Thanks to truckers in #AR &amp; across the US who move the goods &amp; services we rely on. We appreciate you. #NationalTruckDriverAppreciationWeek https://t.co/9bTvMWZMSO"]["Pleased Judiciary Comm gave swift approval of Cody Hiland’s nomination. Full Senate vote comes next. He will be an excellent U.S. Attorney."]["Learn how you can participate in the #Veterans History Project tonight. https://t.co/ZHBEerw6UF"]["In Veterans History Project interview #WWII #veteran Willie Newman of Waldron, #Arkansas shares what he ate when supplies were low. https://t.co/qtD0UWPpsJ"]["Great time celebrating @usairforce 70th birthday w/ @SecAFOfficial &amp; many airmen-even some overseas via skype. Proud of you all! #AimHigh https://t.co/xlGqJGMdQS"]["Great having @SpringdaleCofC stop by to discuss important topics like infrastructure, taxes, health care, helping Marshallese &amp; immigration. https://t.co/U7upyWpsFq"]["Troubling news: US #nationaldebt &gt;$20 trillion. We must address this crisis. Balanced budget amendment to the constitution has my support."]["@UALR @arkansasguard Mark is doing a great job with his internship! We are proud to have him help us serve Arkansans."]["Some highlights of how my office helped Arkansans in August - let us help you w/issues involving the federal govt https://t.co/erNSLum2Ou https://t.co/KPofHgW7BY"]["We will never forget 9-11-2001. https://t.co/pWq9M7wKPO"]["#WWII #veteran Jay Churchwell recently celebrated his 100th birthday. We captured his memories for @librarycongress Veterans History Project https://t.co/7caeG7JzCT"]["I'm pleased to recognize the service of #Arkansas #WWII #veteran Oliver Vinson via @rsvlcourier https://t.co/2v4DraFcgh"]["Great progress in the fight against hunger in #Arkansas. Thank you @nokidhungry &amp; @ARHungerRelief for your efforts. https://t.co/EKAAMwovdD"]["My full statement on the DACA announcement by @POTUS ⬇️ https://t.co/BiFDg3JirC"]["Glad to be back in the Senate to vote tonight. Thanks for all your thoughts &amp; prayers for my health. I'm blessed &amp; humbled by your support. https://t.co/2Fz29OsVtx"]["Statement from my office regarding the surgical procedure I underwent today: https://t.co/g9PoJUjY8V"]["Coach Broyles had a profound impact on me &amp; countless others. The ultimate giver; he'll be dearly missed. My full statement on his passing: https://t.co/AlQKvn5lbr"]["Our summer intern shared her experience capturing memories of Arkansans 4 @librarycongress Veterans History Project https://t.co/LyB8x7qt3c"]["Today's @purpleheart1782 Truck Run &amp; @AmericanLegion picnic remind us who we are &amp; of the heroes who represent the best of America #AR #MOPH https://t.co/DRtBJCF0WG"]["The violence &amp; hatred in #Charlottesville is unacceptable. Bigotry has no place in our society. We solve our problems by working together."]["Great visits in central #AR over the last few days w/ @75arcounties, NLR @_MealsOnWheels, interview on healthcare, &amp; @virco plant in Conway. https://t.co/nHiVWpDFJS"]["@SenThomTillis Thanks, Thom. Looking forward to it! Appreciate your concern &amp; friendship."]["Deadline to apply for disaster assistance in the counties listed below is Monday, 8/14. See ⬇️ for more info @AR_Emergencies @fema @SBAgov https://t.co/CSWgRisVVQ"]["@DrWesGeorge @FBCRogers That's a great comfort &amp; blessing for sure. Thanks for your support throughout this journey."]["@AGRutledge Thank you, Leslie. I value our friendship &amp; relationship very much. It's an honor to serve Arkansans alongside you."]["@SenatorHassan Thank you for the well wishes, Maggie. I'll be eager to get back to work with you &amp; our colleagues on behalf of all Americans."]["@SenatorLankford Thanks so much, James. Appreciate your prayers and your friendship. Looking forward to getting back to work with you."]["Thanks for having me. Always good to visit with you &amp; appreciate the great job you all do! https://t.co/L35DdVS9jm"]["A note to my fellow Arkansans about my upcoming medical procedure. Read more about it in @ArkansasOnline: https://t.co/E2FLGkP5yF https://t.co/ULW1rgoYAE"]["I'm joining @KASUradio to discuss the news of the day. Listen live https://t.co/PPDOQ4gqim"]["Southern AR Univ. @muleriders exchange w/ #Cuba's Univ. of Artemisa is a great opportunity to share US culture/ideas https://t.co/y4SS7kWVHe https://t.co/2JNFxObKi3"]["Congratulations to @LaurenW_Ward on being named @RiceArkansas Exec. Director. Look forward to continuing to advance #AR rice &amp; ag together."]["READ my thoughts on how Senate can move forward w/ spirit of bipartisanship &amp; cooperation: ‘End Confirmation Delays' https://t.co/yDVY8FEePW"][".@ArkCattlemen Exec. VP Adam McClung was a strong voice for AR farmers. Saddened to learn of his passing &amp; praying for his loved ones."]["#PurpleHeartDay is an opportunity to remind ourselves of the brave men &amp; women who sacrifice so much in defense of freedom. #AmericanHeroes https://t.co/28xX5UDsfg"]["Proud to recognize #Arkansas #veteran Delbert DuCharme &amp; include his memories in the Veterans History Project. https://t.co/CouMHbZeqq"]["The #Razorback family is proud of Jerry Jones. What an honor to be inducted into the @ProFootballHOF. Congratulations. https://t.co/fOXx2dNaVS"]["It was great to visit with Roby. Watch the full interview for my thoughts on tax relief, health care reform, N. Korea &amp; the debt ceiling. https://t.co/1UI9AYLZNK"]["I talked w/@MountainTalk97's Dale Hoffman about the #ForeverGIBill, healthcare &amp; the North Korean threat. Listen Sat at 5pm CT or Sun 9:30am"]["In honor of @USCG's birthday listen to the memories of this #WWII #veteran nicknamed the Coast Guard Lady. https://t.co/wHvsbRnuTg"]["My staff attended a Military Order of the Purple Heart ceremony in Fayetteville today where #veteran Derl Horn received the Patriot Award. https://t.co/SWniySGzBB"]["Thanks to our 2nd group of DC summer interns who did an excellent job serving #AR. Enjoyed getting to know them &amp; wishing them all the best. https://t.co/utIHP1PtYE"]["Happy Birthday @uscoastguard! Protecting &amp; serving the USA since 1790 in honorable &amp; effective fashion is a huge milestone. #SemperParatus https://t.co/DZvbPo9HKR"]["Getting ready to join @DaveElswickShow. Tune in https://t.co/du5MgzBMGG"]["Congrats to @AmbassadorGreen on his confirmation. He'll do a great job leading @USAID https://t.co/UMSZEa63us"]["WATCH: I spoke on the senate floor abt Bill Reed, a wonderful advocate on behalf of #AR agriculture @RicelandFoods https://t.co/fUMbkCTkA5"]["Congrats to @SenTomCotton's Sand Lizards on their first win in the Battle for the Golden Razorback. We'll be back next year! ⚾️🐗🏆 https://t.co/7NaxVwFa5X"]["Today, bipartisan sanctions bill against Iran, Russia &amp; N Korea becomes law. My full statement: https://t.co/U7konhRpje"]["Proud to work with @RepRickCrawford &amp; state leaders to open #Cuba to Arkansas agriculture. @ArFB https://t.co/5M6frUr4qX"]["Congrats to Delphine Metcalf-Foster! Army vet becomes 1st woman to lead big 3 veterans service organization @DAVHQ https://t.co/KRpsNVccy3"]["Pleased to visit w/@bridgetrchavez &amp; @KARK4News @KNWAnews about the importance of opening the Chinese market to American #ag products https://t.co/dMUXKnVEpi"]["#Arkansas #veteran Delbert DuCharme served in WWII, Korea &amp; Vietnam. His memories will be part of @librarycongress Veterans History Project. https://t.co/w16n8EkvFt"]["Trey Walker served in my office as a @usairforce fellow. He was promoted to CMSgt. Congrats on this career milestone. We are proud of you. https://t.co/qBCEZb1JBX"]["I will continue to work toward a solution to provide relief to families from skyrocketing health care costs. https://t.co/Tw9ej2tcIK"]["Congrats to Staff Sgt. Tasheenia Wallace, the 1st woman to complete the @arkansasguard Infantry Transition Course https://t.co/qaeG34VjWf"]["Appreciate @USDOL Sec. Acosta for meeting w/ #AR Congressional delegation &amp; constituents abt exciting opportunities in our state. https://t.co/IiILyGKHy7"]["Pleased my staff recorded memories of #Arkansas #veteran Edwin Ross which will be submitted to the @librarycongress Veterans History Project https://t.co/gatJThwS3L"]["Two #veterans provisions I authored are part of Senate #ForeverGIBill: VET-TEC &amp; GI BILL Fairness Act. READ more: https://t.co/LH7CHeahVq"]["Thank you to Garner &amp; Kathlyn #Arkansas #JDRF advocates for sharing with me their experience of living w/#type1diabetes. #JDRFCC17 #ARinDC https://t.co/FoHlVkgkQQ"]["Proud that on VA committee we're advancing bipartisan solutions for vets. We'll keep working to get #ForeverGIBill across the finish line. https://t.co/ZLShTl8F4t"]["I appreciate the opportunity to meet @FarmCreditWEAR to discuss the #FarmBill and my support for #Arkansas agriculture. https://t.co/zqQ7Q93gXa"]["I look forward to supporting this legislation that includes provisions I introduced to help improve education benefits for our #veterans. https://t.co/8sT1bHDMkd"]["My full statement on today's vote to move forward on legislation to repeal Obamacare ⬇️ https://t.co/zswXbvIKBm"]["Thank you to these Arkansans for helping fight western wildfires. https://t.co/jASpx89CA2"]["Watch Hearing on Perspectives on Risk Management Tools &amp; Trends for the 2018 Farm Bill &amp; testimony of Arkansan https://t.co/m3rZXNYco7"]["Pleased to welcome Jennifer James of Newport, #Arkansas to testify at this hearing. https://t.co/TGBGalwbQ3"]["Honored to receive 'Arkansan of the Year' award from the AR Broadcasters Association this past weekend. Thanks to all our #AR broadcasters. https://t.co/ZoWgmhR65U"]["Great recap of Mike Frazee's Senate EPW testimony &amp; why I'm pushing for water infrastructure upgrades here: https://t.co/SkWkXPXMjl"]["Congrats to @SHSanders45 on being named @WhiteHouse Press Secretary. Know you’ll do a great job for @POTUS &amp; the American people."]["Congrats on achieving this ambitious &amp; important goal! Students will benefit tremendously &amp; will be better prepared for 21st century economy https://t.co/DEyRgArh6N"]["Great to have @EPAScottPruitt bring the #StateActionTour to #AR to hear affects of #WOTUS &amp; talk abt how @EPA can cooperate w/ states. https://t.co/SunNWbUn4l"]["Today’s announcement of a US-China protocol is great news for Arkansas’s rice producers and our state’s economy. https://t.co/QcKmiq4snN"]["Appreciate the work y'all do on this important issue. https://t.co/2B9ENtIfa1"]["This hearing has been a productive start to the conversation that must continue re: investments to upgrade &amp; improve water infrastructure."]["As Mr. Frazee points out, quality of life improves dramatically after getting access to reliable, clean drinking water &amp; wastewater."]["Another witness at our hearing, Andrew Kricun, notes that emergency repairs to water infrastructure cost 5-7x more &amp; aren't cost effective."]["The Water Systems Council has provided Mike, his neighbors, and families across #AR w/ quality drinking water through its Water Well Trust."]["Mike Frazee of Rogers, #AR is now testifying before the committee abt the challenges related to rural communities' access to drinking water."]["The time to act is now. We have an opportunity to develop an infrastructure bill to directly address drinking water &amp; wastewater challenges."]["Small, rural communities in Arkansas are working to update aging &amp; deficient water systems. They face unique challenges in this effort."]["We can use a variety of tools (public-private partnerships, private financing, state &amp; fed. funding) to invest in water infrastructure."]["Estimated 1.7M Americans live w/o access to clean, running drinking water in their homes. We have the opportunity to address this problem."]["We tend to imagine communities w/o access to clean &amp; efficient drinking and wastewater as far-off countries, but it occurs in America too."]["This isn't a rural problem or a big city problem, R or D problem. It's a national emergency &amp; we need to find solutions before it's too late"]["Currently the ASCE grades America’s drinking water infrastructure with a D, waste water has a slightly better grade of a D+."]["I'm chairing a Senate EPW subcommittee hearing about ways to fix America's crumbling water infrastructure. WATCH: https://t.co/booFCjBHqu"]["There aren't many tougher than @SenJohnMcCain. He won't back down from a fight. Cathy &amp; I are praying for him &amp; family during his latest one"]["Thank you for sharing with the committee the benefits of the bill to #Arkansas. https://t.co/xwTnJwLNHl"]["Today @HouseVetAffairs passed #ForeverGIBill w/ important VET-TEC provision. Passing a similar bipartisan measure in Senate is a priority. https://t.co/vxXOo1Amag"]["Pleased to lead efforts to help our cotton farmers. https://t.co/27TyLu2r9P"]["Director @ARGameandFish testifies that HELP Wildlife Act will increase participation in hunting &amp; conservation of our wildlife resources"]["I look forward to hearing testimony from @ARGameandFish Director on bipartisan HELP for Wildlife Act. Watch live https://t.co/zjUGhGfoBX https://t.co/GKsJyGTSBb"]["Proud that a great Arkansas company like @hytrol showcased @WhiteHouse for #MadeInAmericaWeek. 70 yrs of business, investment &amp; jobs for #AR https://t.co/OdDpef3XVz"]["Welcome news re: LR @DeptVetAffairs nursing shortage. I raised this issue w/ VA officials in a hearing last week. https://t.co/GnHzbmjK2Z"]["Great work at this Nashville, #Arkansas summer meals site that provides kids w/nutritious food via @swarkansasradio https://t.co/ijmxL4Y3iV"]["Proud of my staffers Laura and Heba who were awarded the #Arkansas Exceptional Service Medal for their service to our state. @arkansasguard https://t.co/MX2YVJhKBG"]["Pleased to have my staff participate in the dedication of the Highway 162 overpass in Alma. https://t.co/QW4zxZmzcp https://t.co/2XDn6UmAR0"]["Congrats to Kirk Lane on being named #Arkansas Drug Director. He is a proven leader in the fight against opioid abuse in our state."]["Pleased to visit with @Arkansas4H members who are visiting Washington. I'm proud to support 4-H and its positive impact on young Arkansans. https://t.co/AkwvoLYsnH"]["Congratulations to @BretBielema and his wife @jenbielema on the addition of their little Razorback."]["Pleased to visit #Arkansas #veteran Delbert Ducharme who served in WWII, Korea &amp; Vietnam. https://t.co/vIZd3sf7Fb"][".@UACossatot is leading the way in career &amp; technical ed. in SW AR! Thx to Chancellor Cole for showing us around the facilities in DeQueen. https://t.co/yaqEhnT0To"]["Stopped by @USDA Seamless Summer Feeding program @nes_scrappers. This site is a great example for other school districts! @ARHungerRelief https://t.co/aLVw9apPNs"]["In Ashdown this morning &amp; had a great visit @DomtarCorp. Heard more abt its economic impact in #Arkansas &amp; got to check out new equipment. https://t.co/Uql6r2DdjL"]["Honored to chat w/Delbert DuCharme, @USNavy (ret.), who served in WWII, Korea &amp; Vietnam at Izzy's Place in Prescott. \nThx for your service! https://t.co/NScbPK13o4"]["Visiting w/lots of folks at Seamless Summer Feeding Program in Arkadelphia. Thx @ARHungerRelief &amp; @APSD_News for ur work. #TeamNoKidHungry https://t.co/3XAGPiNi76"]["Had a great discussion with #vietnamveterans in Jacksonville today. We'll continue to fight for our #veterans to get the care they deserve. https://t.co/0Qb1yF6YcF"]["Thank you @arhospitality &amp; @WeRRestaurants for input on how to create environment that encourages growth &amp; decreases needless &amp; costly regs https://t.co/DdleUrpcMF"]["Pleased to participate in  #TheWordsThatBuiltAmerica. Watch at 7pm on @HBO https://t.co/Mayucu7qNv and https://t.co/kXva5zy85u"]["https://t.co/zNd7uFvu5D"]["Celebrating what unites us. #TheWordsThatBuiltAmerica debuts July 4th at 7pm on @HBO, https://t.co/MayuctPPVX and https://t.co/kXva5zgxdW"]["I continue to stand &amp; support law enforcement to fight this ongoing reckless violence in our capital city. Statement on Little Rock shooting https://t.co/X86zI8RX4y"]["Praying for the victims of violence in Little Rock."]["Thank you to these young men and women who served #Arkansas as interns in my #Washington office. I appreciate their service. https://t.co/RhxFTZHUO0"]["Laura has been a valued member of my team &amp; will be a huge asset to @DeptofDefense in this role. Congrats, Laura! https://t.co/GQaLzid4Pu"]["An excellent choice for U.S. Attorney for the Eastern District. @sentomcotton &amp; I applaud nomination of Cody Hiland: https://t.co/xi68SIS2Hn"]["Pleased to introduce legislation to provide our #veterans with the training and tools they need for long-term success. https://t.co/KUsGhNbOJf"]["Pleased to join efforts with @SenatorTester to help break the cycle of #veteran homelessness. https://t.co/I8hSnQUunZ"]["@FEMA disaster recovery centers open in Randolph &amp; Lawrence Counties. Learn about assistance available to #Arkansas. https://t.co/PW1tNPHnG3"]["@DaveElswickShow is broadcasting from #Washington. I'm joining him now. Listen live https://t.co/5P1VP6jNtz #holdtheirfeettothefire https://t.co/G297FimBhE"]["@EPA's announcement to dismantle #WOTUS is a win for #Arkansas homeowners, small businesses and family farmers. https://t.co/iOBtjybp5F"]["Read my statement for an update on the senate health care bill: https://t.co/krMi07FUGz Appreciate hearing Arkansans' thoughts &amp; opinions."]["#Arkansas Silver Star recipient Parnell Fisher shares story of joining @usairforce. Proud 2 capture his memories 4 #Veterans History Project https://t.co/p0ADn9e0R1"]["Very proud of @McentireFarrah at @StarCityHigh (@StarCitySchools, #AR) who has been recognized as a 2017 @PBS Digital Innovator. Congrats!"]["We’ve got to make it such that @DeptVetAffairs can deliver care to #veterans efficiently &amp; effectively. Choice program a good step #StandTo"]["We’ve worked really hard to improve the transition assistance program. #StandTo #KnowOurVets https://t.co/ePfV08bNY7"]["Pleased to join @TheBushCenter's #StandTo to share Congressional work to improve #veteran services and benefits. https://t.co/CAC4wkMiZI"]["Excited that LRAFB Community Council was named the 2017 Assoc. of Defense Communities Member of the Year. Read more: https://t.co/lh0t2dyZ8M"]["Pleased to see @POTUS sign into law reforms to improve @DeptVetAffairs accountability &amp; protections for employees who expose wrongdoing https://t.co/suY57x1yws"]["Staff attended the sendoff ceremony for members of @arkansasguard 39th infantry brigade supporting NATO. Wishing them much safety &amp; success. https://t.co/tHHgL1ugWK"]["Congrats to @DeptVetAffairs deputy secretary nominee Thomas Bowman. He'll continue to be a strong advocate for vets. https://t.co/K1sT5A44CT"]["The guys from @1037TheBuzz are in town. I'm joining them live to start off the day. https://t.co/zvYLuJGTbz"][".@SecShulkin says his visit earlier this week to NW Arkansas &amp; Fayetteville VA was \"extraordinarily helpful\" in learning best practices."]["WATCH: I'm asking @SecShulkin &amp; other VA officials questions related to @DeptVetAffairs funding &amp; programs needs. https://t.co/wDw133laqU"]["I was proud to join @rep_stevewomack to recognize Ivy Owen, winner of the 2017 John Lynch Base Redevelopment Leadership Award @ChaffeeFS https://t.co/bbm12RFptN"]["Happy Father's Day! Hope you have the opportunity to spend time w/ your loved ones. I'm blessed to be a Dad and Grandpa on this special day."]["I will continue to work to promote policies that help U.S remain competitive &amp; create jobs while pushing for human rights &amp; change in Cuba."]["Through this approach, we not only trade goods, but ideas. The two go hand-in-hand."]["It would be more effective to continue an open line of communication &amp; working relationship w/a government in need of democratic assistance"]["By rolling back reforms that have benefited U.S. citizens, everyday Cubans and our economy, we are taking a step backward, not forward."]["But a return to embargo-like policies is the wrong approach. We ran this play over and over again for 50 years &amp; results have not changed."]["I share the President’s desire to see democracy take hold in Cuba, as well as his commitment to ending the regime's human rights abuses"]["A few thoughts on the changes in U.S.-Cuba policy announced today by the President:"]["ICYMI: @RepRickCrawford &amp; I advocate a path forward for @POTUS that helps American farmers &amp; the Cuban people in yesterday's @WSJ https://t.co/ArhI17d9vW"]["Today marks 181 years since Arkansas became the twenty-fifth state in the Union and it's a great opportunity to celebrate the Natural State! https://t.co/z8GdYueVa5"]["Looking forward to considering legislation I introduced to improve #veteran services and benefits. https://t.co/Im4KH8Cxvq"]["Happy Birthday @USArmy! Very grateful for over 200 years defending our nation and our freedoms. #ArmyStrong https://t.co/A1NhVRom60"]["I'm horrified at the senseless act of violence at congressional baseball practice. Praying for @SteveScalise Capitol Police &amp; other victims"]["I paid tribute to the life of Newport Police Officer Lt Patrick Weatherford who was killed in the line of duty: https://t.co/uCSHH0uiou"]["House just passed VA Accountability &amp; Whistleblower Protection Act - heads to president's desk. I'll keep working to improve care for vets. https://t.co/gieGML89Tg"]["No doubt these @NRECANews #Washington Youth Tour participants are from #Arkansas. @ElecCoopsArk #WooPig #ARinDC https://t.co/dsggfeWlXP"]["U.S. Capitol Police warn of a Caller ID Spoofing scam. Protect yourself from becoming a victim https://t.co/P5YDZrjESC"]["Great news for #AR ranchers who will be able to sell top quality &amp; affordable products to growing Chinese market https://t.co/nmoXdXsv8a"]["May Newport Police Lt. Patrick Weatherford Rest In Peace. My prayers are for his family, friends and colleagues."]["Appreciate opportunity to talk abt infrastructure needs at the @HudsonInstitute yesterday. Watch entire event here: https://t.co/eZ6fmSGnoG"]["Pleased to join @HudsonInstitute to talk about the importance of infrastructure. https://t.co/8clQgroi9o"]["Congrats to Cave Springs, #Arkansas resident &amp; member of @HaasHallAcademy Class of 2017 on earning this scholarship. We are proud of you. https://t.co/Cksznq0ZSn"]["Another good read on what \"Future I-57\" means for the region via @Times_Dispatch &gt;&gt;&gt; https://t.co/JhMQBZzQ1N"]["Reversing this rule created by the Obama administration puts local franchises back in control of business decisions https://t.co/vWvgM0hF7M"]["Read AR delegation's letter to @POTUS in support of Gov. @AsaHutchinson's request for a fed disaster declaration &gt;&gt; https://t.co/TRengF0pCO"]["I had the pleasure of meeting the @ChaffinJH National Quiz Bowl Championship Team. Great work by these #Arkansas students. https://t.co/vlGktaHj13"]["So appreciative of @ARBoysState for inducting me into its Hall of Fame today. Such an honor. And @SenTomCotton, look who I ran into there! https://t.co/vrV3ZJsGfP"]["Read what state and local officials are saying about what \"Future I-57\" will do for the region: https://t.co/BOw7tk46h7"]["My statement on the U.S.'s withdrawal from the Paris climate accord &gt;&gt;&gt; https://t.co/cWpKMigexb"]["\"Greater love has no one than this: to lay down one’s life for one’s friends.” Grateful for the bravery &amp; selflessness of our fallen heroes. https://t.co/yPDqX4FxR0"]["ICYMI: Opening statement from yesterday's Homeland Security Subcomm hearing w/@DHSgov Sec. Kelly--my 1st as Chairman https://t.co/RS7WAPHjhp"]["Saddened by the news of another attack on Coptic Christians in Egypt. Our hearts &amp; our prayers are with the victims &amp; their families."]["Happy to learn Ashdown, Bald Knob &amp; Paragould school districts have received @NAMM Best Communities for Music Education award. #SupportMusic https://t.co/y52KbTb1Tl"]["6. Congress will have to make these decisions based on shared priorities and w/an eye toward risk-based distribution of limited resources."]["5. While this budget proposal for @dhsgov makes some smart choices, there are also parts of it that are unworkable."]["4. Sec. Kelly has rightly noted in testimony &amp; through this budget proposal that @dhsgov workforce is its most valuable resource."]["3.This Subcommittee is committed to working w/Sec. Kelly and the men and women of .@DHSgov who are working every day to keep us safe."]["2. Tragic events in Manchester, England earlier this week remind us why we must focus on the serious challenge of securing our homeland."]["1. Kicking off my 1st hearing as chair of Homeland Security Appropriations subcommittee. Sec. Kelly testifying abt FY18 budget request"]["Thanks to folks from @ARTrucking for coming by to discuss transportation &amp; regulatory issues we can work together on to help the industry. https://t.co/3C5Ch9Enap"]["Cathy &amp; I enjoyed being @MarchofDimes Gourmet Gala guest chefs. We served up one of our favorites: Fruit Slush. Great event &amp; worthy cause. https://t.co/4roV47w5XP"]["These Murfreesboro High School students are visiting #Washington w/@CloseUp_DC. It was great meeting w/them during their day on Capitol Hill https://t.co/EPL3d6s2n5"]["Honored to give a US Capitol tour to a group of @USCG chaplains yesterday evening. Thankful for their service and leadership. #SemperParatus https://t.co/bVmtmhk5fi"]["I was proud to recognize the positive influence of #drugcourts in #Arkansas &amp; throughout the country via @KARK4News https://t.co/krLClBCY1K"]["What a pleasure to talk with these Southside students &amp; answer their questions. So glad we had an opportunity to visit before summer break. https://t.co/jpWxlrVf8C"]["I stand with Manchester &amp; mourn the victims of the horrific terrorist attack. The victims, their families and the country are in my prayers."]["May is National #DrugCourt Month. I'm on the #Senate floor speaking about their positive influence in #Arkansas. https://t.co/yzeuCeY94I"]["Pushing @DeptVetAffairs to support hiring more women’s health providers &amp; enhance data tracking https://t.co/clDwvNWUGm #DeborahSampsonAct"]["Senate Intel Committee is continuing its work as well. I have complete confidence in their ability to conduct a thorough investigation (2/2)"]["Appointing Robert Mueller as special counsel in this matter is a good step toward restoring public confidence. (1/2)"]["Couldn’t agree more. Rural areas need fast, reliable broadband connectivity to compete in the 21st century economy. https://t.co/kUcFJCvZwn"]["Congrats to next @ArkansasState Chancellor Dr. Kelly Damphousse. Exciting future ahead for #AState students, faculty &amp; Jonesboro. #WolvesUp https://t.co/dNWjF04b0E"]["Praying for a speedy and full recovery for my friend @maziehirono."]["Getting ready to join @KASUradio. Listen to our live interview here https://t.co/PPDOQ3YPqO https://t.co/gM1xDOXr3s"]["My thoughts and prayers are with @SenThomTillis, his family and staff. https://t.co/Xf1pvjmYwf"]["Congratulations to our new @usairforce Secretary @HeatherAnWilson. I'm proud to work with her in support of our airmen &amp; women #SECAF https://t.co/0HKwtrm1VZ"]["ICYMI: I spoke @RobyBrock about James Comey, NE AR flooding &amp; health care reform on @TBArkansas this past Sunday &gt;&gt; https://t.co/uaqxY3Z59p"]["Great to meet with doctors from the American College of Rheumatology (@ACRheum) last week to talk about important healthcare policy issues. https://t.co/dUGGhq4jYV"]["VIDEO: Thanking law enforcement &amp; honoring the lives of those cut short in the line of duty https://t.co/f3SPSz3wJE #NationalPoliceWeek"]["Congrats to Brittany &amp; her family. They are stationed @LRAFB. Grateful to have you contributing to the community &amp; #AR in such a big way! https://t.co/dk4EUgyivX"]["After speaking at @williamsbaptist commencement on Sat. am, I spent pm continuing to see how we can help those in need from the flooding. https://t.co/m4oNuvbg0M"]["Happy Birthday @SenTomCotton. It's a pleasure to work for Arkansans alongside you in the Senate. Appreciate your service &amp; friendship. #AR"]["Congratulations to @UArkansas @ArmyROTC's graduating class. I wish you successes in all you take on in the future. https://t.co/tOyzXb9oiJ"]["WATCH my @meettheleaders discussion regarding veteran care, tax &amp; healthcare reform, &amp; infrastructure improvements https://t.co/WYNFvprn3g"]["On #MilitarySpouseAppreciationDay we honor the partners who stand behind &amp; alongside all our service members. Their sacrifice is inspiring."]["I enjoyed having a Google Hangout w/ &amp; answering questions from Ms. Dungan's class at East Hills Middle School in Greenwood @GSD_Excellence. https://t.co/0gXeGweBiu"]["Hope you'll join us in the #StampOutHunger Food Drive 2017. This will be a big help to the 1 in 6 Americans who struggle to eat regularly. https://t.co/HG6JqaZ9qF"][".@AmbassadorGreen is a smart choice to run @USAID. He has a deep understanding of international crises &amp; an unmatched record of service."]["Proud to show support for .@Heifer's efforts to strengthen local economies around the world by wearing their tie today. https://t.co/qNKTHW8uny"]["Welcome Shandong Ruyi Technology Group to #Arkansas. It's a great place to do business and create hundreds of jobs. https://t.co/RCNeLoCIKu https://t.co/DOylvJQDxq"]["My full statement on the firing of FBI Director James Comey: https://t.co/IpIHezAjtH"][".@CentralHighNPS recognized as a now thriving once-endangered historic site by Nat'l Trust for Historic Preservation https://t.co/xD9U1tm1cd"]["Congratulations to Emily &amp; Gable on their recognition as @PruSpirit top youth volunteers in #Arkansas. #PruSpirit2017 https://t.co/xvKmqI1Pd5"]["Happy #NationalTeacherDay to our hardworking educators. You have one of the most difficult &amp; important jobs and we appreciate you! #ArEd https://t.co/7nP9RJzs5B"]["@CurlyandBelle Sorry you got disconnected. Try again at 888-400-1986."]["Getting ready to join @DaveElswickShow. Listen live at https://t.co/5P1VP6jNtz"]["Today marks 72 years since World War II ended in Europe. Many Americans answered the call to serve and secured our peace &amp; safety. #VEDay https://t.co/2TcxtEqIPf"]["Appreciate @USDA @SecretarySonny joining us for flyover tour to survey NE AR flood damage. Will remain in close communication on next steps. https://t.co/jUrsvrjfS3"]["Great to be in Jacksonville, AR &amp; sit down w/ Mayor Gary Fletcher. Always enjoy opportunities to visit &amp; hear directly from local leaders. https://t.co/zFYNE6iv7Y"]["It was great meeting with @GAManufacturers to talk about general aviation during @GAMAHillDay https://t.co/NJfelg5lbX"]["Celebrating National #CharterSchoolsWeek bc every family deserves the right to choose the best education for their kids. #SchoolChoice #ArEd"]["Grateful my staff is able to share how our office is capturing the memories of #veterans for the @librarycongress Veterans History Project. https://t.co/ESQbuzQCeI"]["READ my thoughts about people across the US praying for our nation on the National Day of Prayer (@NationalPrayer): https://t.co/Dbs4lVl2R7"]["This is great news. Removing unneeded prescriptions from our homes is important to fighting the opioid epidemic. Good work #Arkansas. https://t.co/j3tmnfEC1u"]["What a great act of kindness that reunited an #Arkansas veteran’s family with a symbol of his service and sacrifice. https://t.co/Ka2q6DBWFL"]["I appreciated the opportunity to join @meettheleaders to talk about #veterans, healthcare reform and infrastructure. #alticeMTL https://t.co/CrkCTqQAJp"]["Pleased my staff could help WWII, Korea &amp; Vietnam #veteran Mabel Thomsen celebrate her 100th birthday by recording her memories of service https://t.co/Su2gels0WM"]["Proud to support @artakeback w/@AGRutledge at @PBPoliceDept prescription drug-drop off location. This program is saving lives. https://t.co/KhKEAcnAvu"]["The Senate is united in effort get UN to improve its treatment of Israel &amp; to eliminate anti-Semitism in all its forms https://t.co/c9N574wjht"]["We must work w/international community to end the corruption that is causing so much suffering in South Sudan https://t.co/b4TjglVjGq"]["Jay Dickey was a fierce advocate for AR &amp; worked hard to ensure that our state had a strong voice in Washington https://t.co/SI2coDJvnX"]["Pleased to see commitment of @POTUS to hold bad actors accountable &amp; create protections for whistleblowers so we can better serve #veterans https://t.co/HG4SEweQGA"]["I appreciate Monticello, #Arkansas leaders coming to #Washington to share their vision for economic development and how we can be helpful. https://t.co/Q0sA5NSFgD"]["Fort Smith Pastor @MartySloan served as guest chaplain &amp; delivered the opening prayer in the Senate. Hear his prayer\nhttps://t.co/QWmkvTYv9r https://t.co/32UYn9rdaX"]["@HarvestTimenet Lead Pastor @martysloan is guest chaplain today &amp; will open the #Senate with a prayer @ 10 ET. Watch https://t.co/1Xkj35fZRZ"]["Bottom line is that Kim Jung Un has to end his belligerent actions. If not, Congress &amp; admin need to leave every option on the table (3/3)"]["If North Korea continues these aggressions, it's important that we have all the intelligence necessary to determine best way forward. (2/3)"]["Talking w/ @ftsmithchamber about impact of EPA consent decree &amp; economic needs. Meeting w/ AR business &amp; community leaders is always helpful https://t.co/bWejU0rUM9"]["Grateful for the opportunity to speak &amp; for the excellent discussion to start the day. https://t.co/EmYckO0w39"]["Today is #WorldMalariaDay and a vaccine may finally be in sight thanks to advances in public health. Read more here: https://t.co/WgdwWZXFPD"]["Congratulations @USDA Secretary Sonny Perdue https://t.co/AsVy7wCECT"]["@mickelcanary Hope it was great. Connect w/ my office if you're around longer or ever make another trip so we can help you see as much as possible #ARinDC"]["Congratulations to @fayar Woodland Junior High for earning the Diamond Schools to Watch Award. What a great accomplishment. https://t.co/rULNp3dPA2"]["I appreciate @sdaleschools Hellstern Middle School students showing me what they're learning. Only a few weeks left until summer break. https://t.co/i5SILD9RgH"]["Honored to dedicate @sdaleschools Har-ber HS mechanical lab. It provides students w/opportunities to learn skills needed in the workforce https://t.co/ntsHJl7Don"]["Always glad to help Arkansans like the Hildahls who face problems w/ a federal agency. Reach out if I can assist you https://t.co/98CYD4VvFd https://t.co/6OAFj0z6T7"]["I'm saddened to learn of the passing of former Congressman Jay Dickey. My thoughts and prayers are with his family. https://t.co/9l3QdAPiVk https://t.co/WJSXLGe7qp"]["I'm honored to be in Springdale to help dedicate the new mechanical lab for the skilled trades at Har-ber High School. https://t.co/2CL9dHuwJj"]["Pleased to learn that Aya has been freed &amp; is back in the US. Appreciate the work by @POTUS &amp; team to get this done. https://t.co/mh2q4CQbHI"]["Pleased to welcome @TGowdySC to Fort Smith for the Winthrop Paul Rockefeller Distinguished Lecture Series. @marshalsmuseum #WPRGowdy17 https://t.co/F3I13IxYhI"]["Congrats to Waldron Middle School's @firstlegoleague team on advancing to the 7th Annual Global Innovation Award competition. Great job!"]["I'm joining @DaveElswickShow in the studio. Listen in https://t.co/5P1VP6jNtz"]["Great to visit the North Little Rock location of @CaterpillarInc. https://t.co/cSFHDGG2l5"]["Thank you @NEMA_web for honoring me with the 2017 Congressional Award for supporting disaster preparedness initiatives. https://t.co/de8BJzfp96"]["I appreciate the hospitality &amp; opportunity to see how @garverusa is serving #Arkansas and communities across the country. https://t.co/PBxqnzGDs3"]["So grateful for the M&amp;N Augustine Foundation &amp; volunteers who helped feed more than 6,000 people at this 24th annual Easter feed on Saturday https://t.co/OQQWssTLu1"]["I'm pleased to support the Veterans History Project &amp; share the stories of #Arkansas #veterans like Clem Kordsmeier. https://t.co/34QwP8Jjvc"]["She earned the nickname ‘Coast Guard Lady.’ I'll submit her stories of service &amp; outreach to @librarycongress #veterans history project 2/2"]["WWII #veteran Lois Bouton was one of the 1st women to serve in @USCG &amp; developed a passion for writing letters to Coast Guard members 1/2 https://t.co/jsYvG8trxd"]["It was great to be in Pine Bluff last week hosting @USArmy Lt. Gen. Piggee. Read more via @pbcommercial https://t.co/I8ELPyBJXR"]["Proud to continue serving on @HelsinkiComm. Maintaining &amp; strengthening our partnership w/ Europe to advance US interests is critical. https://t.co/hMYZDsYmF6"]["Had a great time welcoming LTG Piggee back to his alma mater @uapbinfo &amp; touring Pine Bluff Arsenal. Proud of what this community is doing. https://t.co/38ulJQQoJF"]["Great to visit @RRAD_TX with Sen. @JohnCornyn to get an update on its mission &amp; its workplace development partnership with Texarkana College https://t.co/CxtI2b5hOQ"]["Honored to recognize the military service of WWII #veteran James Donald Neal Burnett. Read more via @TimesRecord https://t.co/fDsYma2JXH https://t.co/5a57VzzmiQ"]["Congrats to @ARMathSciArts in Hot Springs on winning the @NOSBRocks regional competition. Very proud of your hard work and dedication!"]["WATCH: Talked w/ @5NEWS about my conversation in Fort Smith w/ #veterans about their experiences w/ VA. Appreciate getting their insight. https://t.co/GE9qY68fPf"]["Excited about @DeptVetAffairs new tool providing vets more transparency on wait times &amp; quality of care. Learn more: https://t.co/a0mrjcjNKO"]["Kicked off the day visiting w/veterans in Fort Smith about how we can better meet their health care needs. On to Mena for a similar session. https://t.co/7HZXxkcL1h"]["The Rogers High School orchestra &amp; band perform today in #Washington.  Listen to part of the concert at @UnionStationDC_  @RogersSchools https://t.co/7hZLWxloio"]["Senate made the right decision for our nation by confirming Neil Gorsuch as a Justice on the Supreme Court. More &gt;&gt;&gt; https://t.co/xRX7LADgHX https://t.co/xp2GQsxX3V"]["US formally entered WWI 100 yrs ago today. Historic occasion &amp; sobering opportunity to reflect on global conflict then &amp; now. #WWICentennial"]["Judge Gorsuch will be confirmed. Breaking longstanding precedent is unfortunate, but Senate Democrats are to blame: https://t.co/PN3b0JxEMH"]["I was pleased yesterday to welcome Lake Hamilton and Gurdon High School students who are experiencing #Washington with @CloseUp_DC #ARinDC https://t.co/uVricTogAl"]["Pleased SASC has approved @usairforce secretary nominee @HeatherAnWilson. Look forward to supporting her nomination on senate floor."]["\"Judge Gorsuch is eminently qualified. His credentials are exceptional. His resume is impressive.\" #ConfirmGorsuch"]["Headed to the #Senate floor to show my support for Judge #Gorsuch to serve on the Supreme Court. Watch here. https://t.co/Pml9HxlG6o #SCOTUS"]["We can never thank military spouses enough, especially on #GoldStarSpousesDay where we honor those whose spouses made the ultimate sacrifice"]["Rooting for @uapbinfo in the 28th annual #HSASC National Championship Tournament this weekend. Arkansas is proud of you. Good luck! https://t.co/c8PMhSwCQ3"]["An exciting adventure is ahead for Lavaca #Arkansas teacher Karen Grady as a participant in @TeacherAtSea shark research project. Congrats! https://t.co/V7f2MgCZB3"]["Thank you for the warm welcome. I appreciated the opportunity to participate in the Washington fly-in. https://t.co/AT2cVbAgpo"]["I'm grateful for the support @RofRecovery provides our #veterans. Thank you for your dedication to empowerment through outdoor therapy. https://t.co/pdsPhG9OlN"]["Great discussion w/@BlindedVeterans &amp; @BlindVeterans about the need for collaboration in vision trauma research. #ProjectGemini https://t.co/ewRVUIdLE1"]["I'm enjoying talking with Weiner Elementary 5th and 6th graders during our Skype discussion. They're asking some great questions. https://t.co/LFkHFD6kFg"]["Getting ready to join @newsradio1029 to talk about SCOTUS nominee Judge Gorsuch. Listen live https://t.co/qM1t9CTHjI"]["Senate passed bill to allow iconic #DeltaQueen to operate again. Benefits economies of communities along Mississippi River &amp; its tributaries"]["Great to visit w/ @RepWesterman &amp; Hot Springs Chamber. Looking forward to sitting down again tomorrow to discuss needs &amp; important issues. https://t.co/iDPoLDnoyB"]["It's a great day to show off the @188thWG and its mission to defend our national security. Thank you @AirNatlGuard director for visiting. https://t.co/Ambl6DGQQ2"]["Starting the day in Fort Smith with @5NEWS to talk about a visit to the @188thWG with Dir of @AirNatlGuard. Watch https://t.co/vhHCRnK5OJ https://t.co/Agf7VAxWHr"]["What a beautiful day to kick off the celebration honoring the 25th anniversary of @SouthArkCC. Congratulations on this milestone. https://t.co/JxSwmQJNoz"]["I was pleased to meet with @Arkansas4H delegates to the @n4hconf. It was great to visit with future leaders of #Arkansas agriculture. https://t.co/zQvGxtKbK5"]["Congratulations to the first graduating class of @LRAFB cyber course. Proud of you! Thank you Lt. Gen. Rice for visiting #Arkansas. https://t.co/PzvfzHjSBI"]["Breakfast with @jtownchamber members is a great way to start the day. https://t.co/COaAxP9wTa"]["Thanks to Dennis Sternberg, #Arkansas Rural Water Association Exec. Dir. for testifying before the Fisheries, Water &amp; Wildlife Subcommittee https://t.co/R419QS52yS"]["Pleased to join the 2017 Water Policy Conference to discuss the need for water infrastructure. https://t.co/Q3uwMnhboZ"]["As co-chairs of Senate Air Force Caucus, @SenSherrodBrown &amp; I led a delegation of our colleagues to @WrightPattAFB: https://t.co/Owr24qRskJ https://t.co/6c55TcaxJE"]["I'm pleased to support this legislation to make college more affordable and accessible. https://t.co/egDgc7CU2p"]["and our continued security relationship with the U.K. https://t.co/Rzh9oGASiz (2/2)"]["I appreciate the Trump administration’s commitment to strengthen our national security. \nhttps://t.co/7aysNGJoXO (1/2)"]["#KeystoneXL is the type of job creating infrastructure project that America needs. The approval is long overdue. https://t.co/HuSr88Qg3A"]["We must improve health services for women #veterans. @KFSM shows us why we need to pass The Deborah Sampson Act . https://t.co/7y53qWS98L"]["Thank you to members of VFW Post 4451 in Mena who brought the Vietnam Veterans Memorial Fund's Wall That Heals to the community. https://t.co/tbwuixx6Do"]["@RealWillTeeter Will, dial 888-400-1986 to get on the line for my tele- town hall. It’s still going and would love to have you join."]["Great to join @NACWA at the #WaterWeek2017 reception to discuss the need for water infrastructure. https://t.co/53UnbbF2CR"]["This is another reason why @ENERGY should re-evaluate its agreement with Clean Line. https://t.co/xBTg5vszHB"]["We’re taking steps to eliminate the barriers women #veterans face when seeking care. https://t.co/S33QJkFXQk"]["Bill aims to support female #veterans; Boozman co-sponsor of measure on VA medical funding via @arkansasonline https://t.co/JmVcQHeQvb"]["It's #AgDay today so I'm wearing my #AR Agriculture lapel pin to make sure DC knows how important ag is to our state. https://t.co/AWSiz1D16M"]["Honored to receive the Spirit of Enterprise award from @USChamber. I look forward to advocating for greater economic growth in 2017. #SOE17 https://t.co/5v4SKdubHB"]["When you trade goods &amp; services, you also trade ideas. I’m a strong supporter of opening trade to #Cuba. Read more about my efforts here. https://t.co/WnhKX0qI9u"]["It's #springbreak in #Arkansas &amp; we are blessed to have families spend their time in #Washington. It's always great to see Arkansans in DC. https://t.co/6mFudK97uy"]["Way to go team! #marchmadness continues for the Hogs on Sunday. https://t.co/BJ0w41JFQ6"]["I hope you enjoyed the Capitol as much as I do. https://t.co/PJxRG3I1XU"]["Pleased to join efforts to promote #FreeFile, a way for Arkansans to save time &amp; money this tax season. Learn more https://t.co/E7MReI01zc https://t.co/gjbWFMR6yd"]["I'm committed to improving mental health services to our #veterans. Read my opinion piece via @Militarydotcom https://t.co/kwUC2zpVjJ"]["Its a great day for the @ArkRazorbacks. @RazorbackMBB joins the #marchmadness excitement at 12:30 CT. Good luck #Razorbacks! Beat Seton Hall"]["Today is #gameday for @ucawbb. Good luck to the Sugar Bears who are making their 2nd straight #ncaaw appearance. Beat Texas! #BearClawsUp"]["Public-private partnerships are fighting hunger &amp; finding new ways to meet nutritional needs of #Arkansas families https://t.co/FmHqAwKWTP https://t.co/x3r7J5td1o"]["Visited @HarpsFoodStores in Fort Smith to discuss nutritional education &amp; hunger relief efforts helping Arkansans afford healthy, fresh food https://t.co/mfgyhxskYh"]["Excited abt Caddo River Forest Products revitalization of the sawmill in Glenwood. New jobs &amp; economic investment=great news🌲#AR #Forestry https://t.co/6F4dFA68QW"]["Congratulations to my friend &amp; former colleague Dan Coats who was confirmed today as DNI. He will play key role on national security team."]["Thank you for the invitation to join @MillionWMentors. I'm proud to support women in #STEM fields. https://t.co/aEaBJTXZ1D"]["Great to hear from @ARStateChamber about issues important to them. @EPWGOP Chairman @SenJohnBarrasso also stopped by to share his thoughts. https://t.co/I5sBCSkjuM"]["In recognition of #WomensHistoryMonth hear the memories of service of the 1st female President of the National Guard Assoc. of #Arkansas https://t.co/2cmeCNmEXg"]["Proud to recognize leadership &amp; achievements of @sdaleschools Superintendent Dr Jim Rollins. I appreciate his dedication to public education https://t.co/MR9UhibOYw"]["I joined Talk Business &amp; Politics to discuss North Korean aggression, immigration, healthcare &amp; APPROVAL Act. Watch  https://t.co/psFi27F7EO"]["If you frequently use the Parthenon Post Office (72666), please read this important info on its temporary closure: https://t.co/0wzoJ94unH"]["My office is hosting a workshop on 3/18 to train #Arkansans interested in preserving the memories of our #veterans https://t.co/2sAEGSV1sX"]["A well-deserved honor that reflects our appreciation &amp; respect for those who served in Operations Desert Shield and Desert Storm. https://t.co/CRj9l0OH6p"]["Just got back from Senate floor where I spoke about reasonable, responsible measure to protect the homeland &gt;&gt; https://t.co/HVCrOsakGW"]["Great to see how Choosing to Excel, a Conway-based nonprofit that serves the community, is encouraging and educating #Arkansas youth. https://t.co/HfMuw6627k"]["Glad I was able to meet the two @SenateYouth Program participants from Arkansas. We're so proud of Shreya &amp; Robert for this accomplishment. https://t.co/f0VaMY9MOP"]["Pleased that @HHSGov is no longer considering Ouachita Job Corps center in #Arkansas to house unaccompanied minors. https://t.co/PyJSg2BW2c"]["@k8keeley pls call my Lowell office so we can get more info in order to help you w/ getting the authorization. The number is 479-725-0400."]["I'm kicking off the week Skyping w/Star City Middle School 6th graders &amp; answering their questions. I appreciate this opportunity. https://t.co/xaaKI9wuG5"]["Very helpful briefing &amp; tour @CustomsBorder. Info gathered will be vital as we work to meet needs of those charged w/protecting our borders. https://t.co/gsQ1mWws2T"]["Congrats to this year's inductees to the Arkansas Agriculture Hall of Fame! We appreciate your contributions to an important industry in AR. https://t.co/S9Oediw7U3"]["Yesterday, my staff read to Jonesboro Math &amp; Science Magnet School students for #ReadAcrossAmerica day. Thanks for the invite Ms. Duke! https://t.co/6k8ulYtaAL"]["@therealmarklane Thanks for sharing! Glad to see they were as excited as I was."]["Texarkana's College Hill Elementary students were enthusiastic for #ReadAcrossAmerica. I hope this encourages a lifelong interest in reading https://t.co/QUhow05Epo"]["Gov @AsaHutchinson signs bill adding a Gold Star Memorial on state Capitol grounds. A well deserved honor for our Gold Star families. https://t.co/PxMTgX9L0T"]["In celebration of #ReadAcrossAmerica I shared my love of reading with Salem, #Arkansas 1st graders. https://t.co/eKCIfvLXpP"]["Getting ready to join @DaveElswickShow to talk about the @POTUS address to the #Jointsession. Tune in https://t.co/5P1VP6jNtz"]["I'm helping lead this hearing of @VFWHQ legislative priorities. I'm happy to welcome #Arkansans. https://t.co/Dt6dJWjspj"]["#Arkansas @AmericanLegion member RD Kinsey is in #Washington to support #veteran services improvements. I appreciate his leadership &amp; input. https://t.co/dq5MYD2gDJ"]["Yesterday I met #Arkansas @DAVHQ members to discuss issues affecting #veterans. I appreciate their dedication to improving veteran services. https://t.co/9ysj5aGprV"]["Looking forward to welcoming #Arkansas representatives for @SenateYouth Robert Parker &amp; Shreya Majagi \nvia @KNWAnews https://t.co/d7HnnWzpie"]["It was a nice surprise to see @kffb1061's Bob Connell in Statuary Hall following the #JointAddress. https://t.co/R0uotuCq4G"]["Sharing my thoughts about #JointAddress. @POTUS &amp; Congress must collaborate to pursue solutions that meet our nation's challenges. https://t.co/lbofPTdFqS"]["Proud to join @POTUS to roll back #WOTUS rule. This is welcome relief for property owners threatened by overreach. https://t.co/uG4oT8DMZ9"]["I'm pleased to support the Veterans History Project &amp; share the stories of #Arkansas veterans like Col. Sears. https://t.co/kxm4jkYknZ"]["The last C-130J aircraft was delivered to @LRAFB today. I was pleased that my staff could attend the ceremony. Welcome to #Arkansas. https://t.co/mgntvLWvMo"]["We submitted memories of 21 #Arkansas #vets to @librarycongress #Veterans History Project. Proud to have AR vets receive overview of program https://t.co/p7gAjJvxxk"]["It was great meeting with @uamshealth West Director Don Heard about the importance of training the next generation of medical professionals. https://t.co/lGK05Ubpp9"]["Siloam Springs 5th grader Keenan Huckeby is the #Arkansas winner of the #Doodle4Google competition. Check it out  https://t.co/cXiPvrD5YG"]["Congrats @sdaleschools superintendent for recognition as a @educationweek Leader to Learn From. We are proud of you https://t.co/CI6OQgojjS"]["Arkansans - I'm hosting a telephone town hall on Monday, 2/27 at 7:30 p.m. CT. Here is how to sign-up for the call: https://t.co/w7VTQDXIWY"]["Pleased to serve as chairman of 3 key subcommittees this Congress. \nhttps://t.co/MXz80QGDO5"]["Scott Pruitt is the leader we need to rein in @EPA overreach of last 8 years. Pleased to support his confirmation https://t.co/PB6U9svi8G"]["It's a great day for baseball. Good luck Diamond Hogs &amp; @VanHornHogs! #WPS https://t.co/0HWM9Ea6o9"]["Pleased to join @kffb1061 to discuss some of the issues being debated in Washington. https://t.co/s8ZECUCS4n"]["This is why the Children's Consignment Event Recognition Act is important via @ArkansasOnline https://t.co/R3n97sI7Uo"]["I joined @amyklobuchar to introduce bill to improve access for farmers &amp; ranchers to voluntary conservation programs https://t.co/nKrj3fuUvA"]["I'll be joining @DaveElswickShow live in 10 minutes. You can listen to the interview here https://t.co/5P1VP6jNtz"]["I look forward to working w/the new OMB Director to restore regular order to the budgeting &amp; appropriations process https://t.co/FBBMdCgweO"]["Conway resident @rhealana will testify in this hearing &amp; tell the story of her consignment business. I was pleased to visit w/her yesterday. https://t.co/SaJ6QuoTwH"]["Bureaucrats should not be able to restrict 2nd Amendment rights of law-abiding seniors &amp; disabled Americans &gt;&gt;&gt; https://t.co/2KEM9k8LtR"]["As a leader of #Senate Air Force Caucus I enjoyed discussing upcoming agenda w/@GenDaveGoldfein &amp; Ms Disbrow Acting Secretary of @usairforce https://t.co/cmVoTLEmkR"]["VRN is a great program enabling local law enforcement to tap expertise across federal law enforcement agencies to help address unique needs https://t.co/8lJ0pwzJ0S"]["It's always great to visit w/@RiceArkansas. As a voice for #Arkansas agriculture I rely on their input to craft policies to help our farmers https://t.co/qkGhXoEtQD"]["It was a pleasure to address members of the Pulp and Paperworkers' Resource Council. https://t.co/w6dA3tkprk"]["Thank for you for your visit today. https://t.co/kRtNcsludY"]["It's National Salute to #Veterans Patients week. Elementary students made #Valentines for our veterans &amp; my staff helped distribute them. https://t.co/iw6mIp110N"]["Pleased to join my colleagues in sending letter to @POTUS to encourage him to strengthen #GITMO mission. https://t.co/d6KbUo548A"]["Congrats to the Bryant High School Cheer Squad on their national title. What an accomplishment! You make #Arkansas proud. @BryantSchools https://t.co/fzwT00agYe"]["I was pleased to contribute a column in the latest edition of Irrigation Leader about the need for water infrastructure improvements. https://t.co/krPF7TCJ16"]["I am eager to work w/Dr. Shulkin to modernize @DeptVetAffairs w/a focus on access to quality care &amp; accountability: https://t.co/1MH2joJKCk"]["Visiting Washington, DC &amp; interested in touring the US Capitol or other sites? Reach out to my office so we can help https://t.co/XKEc1sVXbY https://t.co/aLrjSKCuLw"]["It was great start to Monday by Skyping with #Jonesboro 5th graders at Visual &amp; Performing Arts Magnet School. They had some great questions https://t.co/ReAIpxHK7Z"]["Getting ready to join @newsradio1029. Listen live https://t.co/qM1t9CTHjI"]["Had a great conversation about US-Israeli relations with David Friedman, @POTUS's nominee to be our Ambassador to Israel. https://t.co/IkA08MxNXQ"]["Grateful for the opportunity to serve as Chair of the Fisheries, Water &amp; Wildlife Subcommittee. We've got a lot to tackle https://t.co/BlJWrWj335"]["I enjoyed talking with Wynne Intermediate School 5th graders via Skype. They asked some very good questions. https://t.co/jhfmnnZuHz"]["Thank you to @EAANG1 members for visiting my office to discuss legislative priorities that support our guardsmen and their families. https://t.co/ufNmIsPagn"]["Proud of the work my office does to teach #Arkansas students about the flag. 'Group promotes flag education' https://t.co/SFcEZ1LwOQ"]["I didn't get to answer all the @KASU listener questions on Monday so I responded to a few on this blog post https://t.co/ynYJU5L3b6"]["While @SenatorSessions will be missed in the Senate, his strong adherence to the Constitution will be a welcome change at @TheJusticeDept"]["Member of my staff discussed importance of child nutrition advocacy @ AR School Nutrition Association State Legislative Action Conference. https://t.co/FyuESDxnGF"]["Talking w/ @Conway_Chamber abt generating economic growth &amp; business expansion and abt how federal policies impact them &amp; how I can help. https://t.co/hXH8IrlKPj"]["Pleased to see friendly Arkansans. These Junction City students &amp; staff met me outside of a committee hearing. @CloseUp_DC https://t.co/dXGIYT48oh"]["Boone County Substance Abuse Prevention Coalition helps make AR safe, healthy &amp; drug-free. Pleased to have members visit during #CADCAForum https://t.co/k1qbL8fVOh"]["My staff is attending the @ArkansasState Agribusiness Conference today to hear about the exciting things happening in #AR agriculture https://t.co/od97y43awh"]["It was an honor to meet Jim Downing who set an example of service and faith for us all to follow. https://t.co/ByttISAuCz"]["My statement on the confirmation of Betsy DeVos &gt;&gt;&gt; https://t.co/fZRmxBqvpY"]["Pleased to meet @DHSgov Secretary Kelly today to discuss how we can work together to protect our national security. https://t.co/ReHku8RmvC"]["What great recognition for an #Arkansas community many people already know is a great place to live. Fayetteville is truly a special place. https://t.co/lTw3bAV19j"]["Lt Gen Rice talked at @AirForceAssoc briefing abt great work at @LRAFB to train cyber warriors. 1st class of new cyber course started Monday https://t.co/TStdcPzdkX"]["Great to meet w/Pine Bluff School Board President Henry Dabner. Read about his trip to Washington via @pbcommercial https://t.co/rn3p5WOSJW"]["Congratulations to @ProFootballHOF Class of 2017 inductee Jerry Jones. Such a unique honor. Your @ArkRazorbacks family is proud of you. https://t.co/a1i7rAAhh8"]["I met w/@USDA Secretary nominee Gov. Sonny Perdue about importance of #agriculture to #Arkansas. https://t.co/QnAt8o1Chk"]["Congratulations to Fort Smith Mars Petcare on earning the 2 Million Man Hour Safety Award. Keep up the good work. https://t.co/eCwVck8gjA"]["ICYMI: I joined @KASUradio this morning &amp; answered some questions from listeners. Listen to the interview here https://t.co/f3g0VY36Rk"]["Joining @KASUradio. Listen live as I answer listener questions and share what the #Senate is working on this week. https://t.co/PPDOQ3YPqO"]["Great to spend time w/these #Arkansans via Russellville Courier https://t.co/TPuDFcPY2T school band returns from D-C-#.WJX8rnXqtK4.twitter"]["Appreciate efforts of @POTUS to eliminate burdensome regulations hardworking American families face to access affordable retirement options https://t.co/qBca4MSA19"]["Very blessed to co-host the #NationalPrayerBreakfast. Read @arkansasonline story Arkansans: Prayer meals uplifting https://t.co/xpqqJEP9kG"]["It was an honor to help host the National Prayer Breakfast where thousands of people gathered to pray for our nation, president &amp; the world. https://t.co/YCfDf2w7Vx"]["Pleased to join @SenatorHeitkamp to lead efforts to expand #agriculture exports to #Cuba, support American farmers &amp; jobs. https://t.co/6LGpBL9o6b"]["Let's enact commonsense reforms so #Arkansas farmers &amp; US agri producers can compete fairly in the Cuban marketplace https://t.co/XwFtZtkRsK"]["Our country needs a new @EPA Administrator. I support @AGScottPruitt &amp; am pleased EPW Committee reported his nomination to the full #Senate."]["Congratulations to @fayar students on this accomplishment. Good luck at the National Science Bowl finals. #Arkansas is cheering for you! https://t.co/sziFv88k3L"]["The National Prayer Breakfast is underway. As co-chair of this year's event, I will be speaking shortly. Watch live: https://t.co/34zcP9BCrQ"]["I am pleased that Rex Tillerson has been confirmed as our nation’s chief diplomat. Full statement: https://t.co/qgeI1tkB9Z"]["Watch the #Senate VA Committee confirmation hearing of Dr. David Shulkin. I've always appreciated his responsiveness to #Arkansas #veterans https://t.co/Jd05m9Iuxi"]["WATCH: I urge my Democrat colleagues to quit stalling a vote on @AGScottPruitt nomination #Delayocrats\nhttps://t.co/n7OFuOdpSG"]["It’s disappointing that Democrat EPW Committee members are unwilling to vote on the nomination of @AGScottPruitt to lead @EPA. #Delayocrats https://t.co/LFGXBAlg7s"]["I'm encouraged by how well-respected Judge Gorsuch is in legal circles &amp; how highly experts speak of his intellect, experience &amp; temperament https://t.co/cN9po0R0wS"]["Congrats to new @USDOT Sec. Chao. Excited to work w/her to fix our infrastructure &amp; urge my colleagues to move forward w/remaining nominees."]["Happy I had the opportunity to meet w/ @PhilanderSmith President @RLSmothers this morning to discuss higher education. https://t.co/kPZUNa6m3n"]["Little Rock Rabbi Barry Block will deliver the daily prayer when the #Senate is gaveled to order in 6 minutes. Watch https://t.co/34zcP9BCrQ https://t.co/zxx4ll3h2c"]["Cohosting #NationalPrayerBreakfast w/@ChrisCoons. Read our @dcexaminer column about the importance of this occasion \nhttps://t.co/LzjwmtFFze"][".@POTUS exec. actions stem from doubts abt effectiveness of safety checks. Read my full statement from this weekend: https://t.co/jqVa1ADXUi"]["$80 million investment in modernizing &amp; restarting a sawmill, creating 120 full-time jobs in El Dorado. Great news. https://t.co/Nn6VyTPYbr https://t.co/yjVYEK5RlT"]["@POTUS exec. actions stem from doubts abt effectiveness of safety checks. Read my full statement from this weekend: https://t.co/KXAcrxZfoD” https://t.co/iEtbjRr3cr"]["It's been great day at Fort Bliss with #Arkansas soldiers. God bless the @arkansasguard as they deploy &amp; carry out their mission. https://t.co/LQS5wOgNck"]["I support the right to life. Thank you to the thousands of Americans who will #MarchforLife in the nation’s capital today. https://t.co/6dtnpEeu5f"]["WATCH: I share my love for the First Amendment in #WeLoveTheConstitution video to celebrate this important document https://t.co/8ukCiInqYz"]["Congrats @LISAAcademy. Good luck at the National Science Bowl finals. #Arkansas is cheering for you! https://t.co/oZi5RlIZDO"]["#Arkansas #WWII #veteran Paul Cunningham recalls his time stationed in Ireland &amp; the patriotic song the Irish requested he sing. #history https://t.co/zGAvGwTiqz"]["Had a very good visit w/Dr. Shulkin &amp; will support his nomination to lead the VA. Full Statement: https://t.co/mf3qdH8v61 https://t.co/HynmQrhCsV"]["READ: Voiced my concern abt impact of fed. hiring freeze on VA. It must have personnel necessary to provide timely, quality care &amp; benefits. https://t.co/gi0jQzF89p"]["@arkyshopaholic it needs to provide care &amp; benefits veterans were promised &amp; have earned. Please stay in touch w/ me about this."]["@arkyshopaholic Glad VA is trying to be proactive, but I am still going to monitor this situation closely to ensure VA has personnel"]["@arkyshopaholic &amp; discussed w/ him. VA says it \"intends 2 exempt anyone it deems necessary for public safety including frontline caregivers\""]["@arkyshopaholic I discussed this w/ the news organization Stars &amp; Stripes here: https://t.co/4tYFCq3fU0 I met with new VA Secretary nominee"]["@arkyshopaholic I’m also concerned abt this. VA needs sufficient # of hospital/clinic/facilities personnel to provide timely, quality care."]["Proud to support this legislation that will help protect the #Arkansas aquaculture industry. https://t.co/CpDNRu3pu7"]["I'm looking forward to serving as the chairman of the Homeland Security Appropriations Subcommittee https://t.co/1CwRCYU0xx"]["@nikkihaley will be a tremendous US Ambassador to the @UN &amp; I look forward to working w/ her to reassert US leadership &amp; strength. https://t.co/fJ3JV73dkM"]["Great #SchoolChoice discussion w/@School_of_Innov students. I appreciate the questions &amp; progress made in #Arkansas. @EASTovation https://t.co/XxrsCKUdJ0"][".@SarahHuckabee is an incredibly smart, disciplined &amp; effective communicator. An excellent pick to serve @potus. https://t.co/PpOWCiM8Gx"]["I agree w/@RepMickMulvaney that we need to \"reinvigorate\" the appropriations process to help fight wasteful spending https://t.co/sLyHJh94W3"]["Watch as the Senate Budget Committee considers the nomination of @RepMickMulvaney to lead OMB. https://t.co/xt2pISqGRn"]["Pleased to hear @POTUS nomination of #HeatherWilson to serve as Secretary of the Air Force. She will do a fantastic job."]["Congrats to new @FCC chairman @AjitPaiFCC. Looking forward to working w/him to ensure we continue to lead in innovation &amp; communication"]["I’m proud to support #schoolchoice and the outstanding educational choices that #Arkansas offers. https://t.co/Tdys3EuV9d"]["Glad @POTUS is taking a stand for the dignity &amp; worth of every human life. Tax-payer dollars shouldn't support abortion in the US or abroad. https://t.co/y9vpYd6wSp"]["The Russellville Cyclone Band did a great job during the Inaugural Parade. Enjoyed showing @uscapitol to these bright, talented kids today. https://t.co/RiVQzNZ9Y8"]["2/2 I encourage my colleagues to quickly confirm remaining cabinet positions so @POTUS can begin working w/us to address issues we face"]["1/2 Gen. Mattis &amp; Gen. Kelly are two men of integrity who will serve our nation extremely well in these key national security positions."]["Congratulations President of the United States @realDonaldTrump! #InaugurationDay https://t.co/y3ARP2JO1t"]["VIDEO: It's been great visiting with #Arkansans in #Washington to celebrate the #inauguration &amp; peaceful transfer of power. https://t.co/gcuDP6Btsq"]["It’s a historic week in Washington. I appreciate visiting with Arkansans in our nation’s capital including @AsaHutchinson. https://t.co/saGpSgIkIB"]["This is a great accomplishment for the @188thWG &amp; @FtSmithARK. Pleased to play a role in making this happen. https://t.co/t4U21bwxpS"]["My weekly column: Inauguration Demonstrates America’s Unique Political Legacy via @KAWX_Radio https://t.co/CxJJLsUAIT"]["Our thoughts &amp; prayers are w/ @GeorgeHWBush &amp; Barbara. Wishing speedy recoveries for both. Very thankful for their lives of public service."]["I'm at the EPW nomination hearing for @AGScottPruitt to be the next @EPA Administrator. Watch live. https://t.co/IH7ebDPW0P"]["Great way to start the morning w/friendly #Arkansas students. These young Arkansans from Smackover &amp; Cabot are in #Washington w/@CloseUp_DC. https://t.co/rg9QklQEEq"]["Pleased to welcome these Arkansas Gosnell High School students, staff &amp; parents to Washington to attend the inauguration @ghsNYDC https://t.co/VcyLsrGWWY"]["ICYMI: I joined @KFFB to discuss the #Senate's role in the confirmation process for cabinet secretaries and why #GITMO needs to remain open. https://t.co/QRwUSQO9Mx"]["The inauguration tickets arrived! I look forward to celebrating the swearing-in of our 45th President @realDonaldTrump w/Arkansans. https://t.co/qGbCAnfRvx"]["I enjoyed reminiscing about my time as an #Arkansas #Razorback football player with @wholehogsports. https://t.co/jhPGiXSE3p"]["I'm getting on the line to join @newsradio1029 to talk about this historic week. Listen live https://t.co/qM1t9CTHjI"]["Joining KARN @newsradio1029 in a few minutes. Hope you’ll tune in on the radio or online at: https://t.co/dAdgmcJxN0 https://t.co/dHWYGJLwEU"]["Dr. King's work &amp; tireless advocacy continue to inspire us. Honored to celebrate his life &amp; legacy at @AMLKC Prayer Breakfast #MLKDAY https://t.co/gXTpjFTeWY"]["Great way to get ready for Gillett Coon Supper at Berry Pre-Coon reception w/@ARLandCommish, @AsaHutchinson, @ARAuditor &amp; @LtGovTimGriffin https://t.co/fIqH25XAmH"]["Proud to have my staff present @ucabears Police Chief Larry James the Congressional Record. I recognized his 40+ years in law enforcement. https://t.co/UQlOHUDKwY"]["Pleased my staff could attend retirement reception of Reggie Blackwell, Ozark-St Francis Nat'l Forest Supervisor. Thank you for your service https://t.co/mXIP5YZDK8"]["Congrats @FSSouthside's Robert Christian Parker &amp; @RogersSchools Shreya Majagi on being named @SenateYouth delegates https://t.co/PxII6nSVWm"]["Pleased to support American Civil Rights Grant Program &amp; secure funds for education &amp; preservation of civil rights monument LR Central HS"]["Obamacare has driven up costs, busted our budget, stifled job growth &amp; raised taxes on hardworking Arkansans. It's time to repeal &amp; replace https://t.co/jCgBFDF12W"]["Senate passed the budget after late vote-a-rama. 1st step toward keeping our promise to repeal &amp; replace #Obamacare. https://t.co/Ep0CwT3NJ9"]["Looking forward to meeting w/VA Secretary nominee Dr. David Shulkin. I've appreciated his responsiveness to #Arkansas #veterans in the past."]["Congrats to Larry Rhein of Harrison #Arkansas who is an America’s Road Team Finalist. Great visiting with him at the @Truckingdotorg event. https://t.co/MgSpFqC1cF"]["Met w/Rep. Mulvaney, the nominee to head the OMB, today. I believe he is committed to the course correction we need: https://t.co/JaTYZNqekb"]["Getting ready to join @KASUradio to talk about the cabinet nomination process &amp; Obamacare repeal. Listen live at https://t.co/PPDOQ3YPqO https://t.co/gQi8vJZPSn"]["It's #LawEnforcementAppreciationDay. We appreciate the service &amp; sacrifice of law enforcement officers in Arkansas &amp; across the country. https://t.co/iFN6w9csq8"]["Stanley showed kindness &amp; consideration to everyone he met. Pleased to recognize his life in Congressional Record https://t.co/hyF7KaNxHt https://t.co/FpYHbPyqVN"]["I joined @agripulse Open Mic to discuss the 115th Congress and how I'll be helping the ag industry and rural America https://t.co/IYCCxk1Wt4"]["I look forward to visiting this location next week to learn more about the @Arkansasguard’s plans for expanding the Youth Challenge Program. https://t.co/aTAI8nSHjb"]["The United States must defend Israel. That’s why I support similar legislation in the #Senate https://t.co/NqjXRobnVw"]["I look forward to working w/@AGScottPruitt to ensure @EPA uses a smart, balanced approach to protect our environment https://t.co/h1HN8fijTM"]["I echo my colleague's sentiments &amp; pray for a safe and successful mission. https://t.co/PuXNQ4os7K"]["It's great to know that Eureka Springs Elementary students received their new #American #flag. I appreciate this nice thank you note. https://t.co/czC9hVr4Lp"]["This Bible belonged to my dad. He carried it w/him while serving in WWII. I took the oath of office on it today at start of 115th Congress. https://t.co/C761Yw6QWt"]["I am incredibly grateful for the trust Arkansans have placed in me to continue being a voice for our great state in Washington. https://t.co/i5xXtVcwrD"]["Thank you for the honor of serving #Arkansas in the U.S. #Senate. Today I was sworn in for my second term as a U.S. Senator. #blessed"]["WATCH the swearing-in ceremony for new and re-elected senators live on @cspan here starting at noon: https://t.co/cPTLIhmBMS"]["I appreciate Lee's hard work as intern in my #Washington office. Via @SalineCourier https://t.co/kRXkXMWonv"]["All the best to you and your family in #2017. https://t.co/6vEKnRHFWX"]["Lots of Arkansans are traveling to DC for the @TrumpInaugural. Looking forward to meeting many of you &amp; taking in this historic occasion! https://t.co/0U5MRQcyEV"]["Congrats to the Russellville High School Marching Band for its selection to represent #Arkansas in the Inaugural Parade. We're proud of you."]["Getting ready to talk w/@Crosschurch's @ronniefloyd guest host of @FRCdc’s #WashingtonWatch. Listen live https://t.co/XvMjaMp5uf"]["Congratulations @ARAuditor! https://t.co/bXd4qyeQuL"]["Getting ready to join @newsradio1029. Listen live as we discuss the end of the 114th Congress and a look ahead to 2017."]["Inability of HHS to provide answers to basic questions related to this proposal is disconcerting. AR delegation is raising our concerns. https://t.co/SkNsBvHpWE"]["I recently talked w/@meettheleaders to discuss some issues I believe need to be a priority next Congress. Watch here https://t.co/ArZAXO2BoM"]["Proud to lead efforts to secure passage of this bill. https://t.co/8MEtrm23DM"]["Guard and reserve retirees who honorably served in defense of our nation earned the recognition of #veteran status https://t.co/cLqeIOgB5W"]["Congratulations to @AStateRedWolves football on the great season. I was pleased to cheer the team on to victory. #CureBowlChamps #WolvesUp https://t.co/TYCMNJiIKa"]["My office is helping teach Arkansans how to preserve the memories of our #veterans for the Veterans History Project. https://t.co/KdvLKHQ6W9"]["Pleased Congress passed legislation to ensure combat-injured #veterans receive the benefits they earned. Read my column in @MilitaryTimes https://t.co/r37JNJD53P"]["Proud to recognize service &amp; sacrifice of Lt Edwin Ledbetter &amp; preserve his memories for #Veterans History Project https://t.co/YdICLj6NXo"]["@MarsGlobal's expansion of its Fort Smith facility is a great investment in the community and #Arkansas. https://t.co/SX9JyfRzw4"]["Pleased to have led efforts to secure passage of bill to ensure our wounded #veterans receive benefits they earned https://t.co/TUFz0SmSBN"]["Sign up for my e-newsletter to get updates on my work in the Senate &amp; stay informed about timely &amp; important issues: https://t.co/kr7IucoguF https://t.co/np23D0tOuP"]["#NDAA allows us to rebuild &amp; modernize military &amp; authorizes largest pay raise for service members in 6 yrs. https://t.co/XBBxBThySd"]["So proud of Arkansas's contribution to our nation's defense. Congrats Camden @AerojetRdyne on production milestone related to PAC-3 missile! https://t.co/J3U8kMhw0d"]["It's National #TaxSecurity Awareness Week. Are you doing everything you can do protect your identity? Visit https://t.co/EeZ4BZR8I8 for tips"]["Today I joined @GenDaveGoldfein of the @usairforce to surprise my Air Force fellow with his promotion. Congratulations CMSgt Trey Walker! https://t.co/VfWhPnGJS2"]["Learning computer science &amp; coding prepares students for future as job opportunities in this field grow #CSEdWeek https://t.co/CKZ1n9AR0B"]["Pearl Harbor survivor Harold Mainer joins World War II Memorial ceremony via @Arkansasonline https://t.co/qzrltZfQe6"]["Pleased to have my staff attend #PearlHarborRemembranceDay @AIMMuseum ceremony to recognize #PearlHarbor survivors &amp; the Greatest Generation https://t.co/GUI6MpHrkv"]["Arkansas wins! .@SenTomCotton &amp; I knew our colleagues had good taste. Congrats .@heightstaco! https://t.co/RllOeEhZ9m"]["Happy to report the bragging rights belong to #Arkansas cheese dip! Thx 2 our colleagues for judging! @SenTomCotton @JohnCornyn @SenTedCruz https://t.co/RllOeEhZ9m"]["HAPPENING NOW: Our colleagues are going to settle this. I have great faith .@heightstaco's cheese dip! @SenTomCotton @JohnCornyn @SenTedCruz https://t.co/mBtEeTCTTS"]["The Capitol press corps is excited about the #Arkansas/#Texas cheese dip/queso taste-off. I'm here to defend Arkansas cheese dip! https://t.co/jghKShm1Xa"]["Great to join @meettheleaders during their visit to #Washington. #alticeMTL https://t.co/iPH437UW6W"]["#PearlHarbor survivor Harold Mainer of Charleston, #Arkansas was serving on the USS Helena December 7, 1941 #PearlHarborRemembranceDay https://t.co/stUy24vo0Y"]["Proud to support @usairforce. This is why I was recognized w/the Secretary of the Air Force Distinguished Public Service Award. So honored. https://t.co/S1UdBitxTP"]["Planned to meet w/@SecAF23 about Air Force programs &amp; she surprised me w/the Secretary of the Air Force Distinguished Public Service Award. https://t.co/Vmt01uey2P"]["House passes bill to ensure combat-injured veterans aren't taxed on their severance pay-Working to get thru Senate   https://t.co/SLHGNWZjNa"]["Pleased to have my staff attend @CleanHarbors expansion ribbon cutting &amp; dedication in El Dorado. This is a great investment in #Arkansas https://t.co/yOI17OSbgt"]["My staff is hosting a #Veterans History Project workshop in Stuttgart. Learn how you can get involved https://t.co/FtbigIyEo4 https://t.co/VBi35rObWw"]["If you missed my interview on @KASUradio this morning you can listen to it here. https://t.co/QZjGP0oXRx"][".@chc_ar Thanks for stopping by. Always great to see Arkansans in DC. Appreciate the work you all do for our state."]["Happy birthday to my friend &amp; colleague @RepFrenchHill who had this surprise waiting for him at the Little Rock airport. https://t.co/NNMAV3hZer"]["Preserving vets’ stories helps complete the historical record &amp; lets these heroes know we care - via @Stuttgart_DL: https://t.co/dRnNeVd2FY"]["10-yr renewal of #Iran sanctions headed to @POTUS's desk. U.S. must have tools to deal w/Iran’s transgressions. https://t.co/ekiH0rZHQx"]["Let's recognize the progress we've make thanks to @PEPFAR and continue the good work of this program to #EndAIDS2030. #WorldAIDSDay."][".@khug06 Glad we could help. We owe you and all who have served a great debt of gratitude. Thank you for your service. Good luck!"]["Gen. Chastain is a respected, knowledgeable &amp; professional advocate for #AR agriculture. Proud of the work he's done on behalf of Arkansans. https://t.co/lRX33s220K"]["I'm enjoying signing Christmas cards to our service members as part of the @AmericaRedCross #Holidays for heroes. https://t.co/NGgLY3iM9t"]["I'm proud to join public &amp; private sector leaders who share the goal of expanded broadband. This has to be a joint effort. #bbgoals"]["Proud to talk w/champions of broadband at Transforming Communities with @NextCentCit #BBGoals https://t.co/i80t69dUbv"]["Critical habitat designation impacts AR farms, businesses &amp; communities. I’ve pushed back &amp; appreciate @AGRutledge’s challenge to expansion https://t.co/tO2Zwina6h"]["Getting ready to join Kevin Miller on @newsradio1029. Listen live to our discussion. https://t.co/qM1t9CTHjI"]["Excited to hear from 2nd graders at Woodland Heights Elem. who wrote to tell me what they had learned about our flag &amp; what it represents. https://t.co/G8i4A4xErH"]["Today is Small Business Saturday. I encourage Arkansans to join me in supporting our small businesses this holiday season. #ShopSmall https://t.co/gO9DDQaq4L"]["I hope the death of Fidel Castro marks a new beginning for an American-Cuban partnership and brings light to democracy in #Cuba"]["Happy Thanksgiving! https://t.co/k739wF6hbG"]["Americans will consume 46 million turkeys on #Thanksgiving. Follow these safety tips for a safe holiday #TurkeyDayTips https://t.co/eZgYew6JyF"]["This injunction is great news for #Arkansas and an important step to reining in the Obama administration’s abuse of the regulatory process. https://t.co/PWkTJ1sGQK"]["Arkansans interested in attending the 58th Pres. Inauguration can request tickets, which are limited. Learn more: https://t.co/9LafT85rb5 https://t.co/9I9mRxuSer"]["Great to be at the grand reopening of the Walton Arts Center today. So proud of everyone who helped make this a top-notch facility a reality https://t.co/0jkDS5jJMP"]["Today is #natladoptionday! Let’s raise awareness for the 108,000+ kids in need of safe, loving homes! #adoptiongives https://t.co/r1H64p6fgh"]["Happy Birthday to @RepWesterman! 🎂🎉 It’s an honor to represent Arkansans with you &amp; I appreciate your hard work &amp; friendship. #ARpx"]["Follow me on Instagram for images from around DC &amp; AR (https://t.co/s6geaARirz) &amp; use #ARinDC on your pics if you visit the nation’s capital https://t.co/o8XJGQM2Tf"][".@AStateMB I’ll be back in Arkansas but I hear West Point may be vulnerable to Red Wolves…🔴🐺🏀"]["Congrats on 2 big wins! I cheered on the basketball team against Georgetown in person. Good luck on the rest of their seasons! #WolvesUP https://t.co/b7AhqIpXa9"]["Getting ready to start the second half. #WolvesUp @AStateMB https://t.co/ZnYqjIx1da"]["Excited to have you in #Washington. I'm looking forward to the game tonight. https://t.co/mnpjotfjz6"]["It’s #WorldPancreaticCancerDay, a time to #WageHope and commit to research and support for those impacted by pancreatic cancer. #WPCD https://t.co/5cpS2fsxrV"]["Top issues for 1st 100 days- repeal &amp; replace Obamacare, securing the border, rollback Obama's executive actions @KASUradio"]["Joining @KASUradio to talk about the lame duck session and what to expect next #Congress. Listen live https://t.co/PPDOQ3YPqO"]["Pleased to participate in belated celebration of the 241st birthday of @USMC w/Commandant &amp; Sergeant Major. Thank you to all our Marines. https://t.co/T2YgxNwu4D"]["Good luck to Conway's Ruby Jones who is a contestant on tonight's #ChoppedJunior https://t.co/YkWobpbKbb https://t.co/zJCvUf4yXA"]["Proud to join @SenDonnelly to introduce joint resolution to approve location of @DesertStormMeml near National Mall https://t.co/3fL51F2mZd"]["I'm pleased to join the #Senate Recycling Caucus co-chair @SenatorCarper at this event. Watch live. https://t.co/7D33W7qciy"]["It's #AmericaRecyclesDay. As a cochair of the #Senate Recycling Caucus I'm proud to promote the benefits &amp; continued growth of recycling. https://t.co/JDcC9bq6BV"]["Thank you @UALR students for your efforts capturing the memories of our #veterans for the Veterans History Project. https://t.co/qN4wbhepuw"]["Honored to recognize the military service of 92-year-old #Arkansas #WWII #veteran Joseph Fritsche &amp; present him w/service medals he earned. https://t.co/14aJRgojdZ"]["Thank you to our #veterans. I'm celebrating this special day with the men &amp; women called to serve in our nation's uniform. #VeteransDay https://t.co/ulm04rDGJD"]["Honor those called to serve our nation in uniform like WWII #veteran Lucky Page. Read about his service &amp; sacrifice https://t.co/wE0sWoDKvT"]["Thank you @UOzarks students who are helping preserve memories of #veterans for the @librarycongress Veterans History Project (VHP) #LOCvets https://t.co/7vfgQryKq8"]["Pleased Anita Deason, #Veterans Liaison for my office, is able to speak at Stone County Veterans Day ceremony. Thank you veterans. https://t.co/56AJ3LAXJ1"]["Proud to recognize sacrifice of Lucky Page who served in @USMC in WWII &amp; Korean War. His memories will be part of #Veterans History Project. https://t.co/mBTAaJy13M"]["Happy 241st Birthday to the @USMC. Thank you to our #Marines for their service to our nation. Semper Fidelis. https://t.co/Nk22xj1UC7"]["Judy McReynolds has paved the way for women, setting an example of successful leadership &amp; working to break the glass ceiling. Congrats. https://t.co/S8NLQB6Ts7"]["The Veterans History Project is a meaningful way to thank our #veterans for their service &amp; sacrifice\nhttps://t.co/TIKPje9sMg"]["My e-newsletter is great way to stay updated on the work I'm doing on behalf of #Arkansas. Sign up to receive it: https://t.co/kr7IucoguF https://t.co/lYbp4cxwBi"]["My staff hosted a #Veterans History Project workshop in Jonesboro. Learn how you can preserve our veterans memories. https://t.co/uKd0KXo1nF https://t.co/Qo7uBwE1Ne"]["Pleased to have my staff attend Jonesboro's Ridgefield Christian School #Veterans Day program. Let us honor their service and sacrifice. https://t.co/8xGkh7SvSM"]["Congrats to Karen D. Lloyd, the new director of the #Veterans History Project. https://t.co/sWiraySDDO"]["@ARVetsInc named Gina Chandler Outstanding Female Veteran &amp; Anita Deason, #Veteran Liaison in my office, Outstanding Female Veteran Pioneer https://t.co/W5eq3X5CpB"]["This week we celebrate #Veterans Day. Honor the sacrifice of our veterans by preserving their memories @KAWX_Radio https://t.co/0mx66HkMvC"]["I'm pleased to honor the valor and public service of inductees into the #Arkansas Military #Veterans' Hall of Fame. https://t.co/bKmu84zoy2"]["@khug06 give my Little Rock office a call at 501-372-7153 so we can get more information &amp; try to be helpful. Thank you for your service."]["My staff was excited to attend the #Veterans Day program at Nettleton High School. Thank you to our veterans for their service &amp; sacrifice. https://t.co/36c2w77E9B"]["Honored to participate in #Arkansas Military Veterans' Hall of Fame induction tomorrow via @ArkansasOnline https://t.co/FAj6sy3FcA"]["Thank you for this honor.  I am proud to support and fight for policies that give our farmers the opportunity to succeed. https://t.co/pI0rLgvRrh"]["I'm pleased that these computers will fill an important need for Barton High Schoo via Helena Daily World https://t.co/xwbmsVvMG6"]["Thanks to .@alleneng for the warm welcome &amp; the tour of their impressive operation today. https://t.co/pd29CsFZhI"]["Thanks for letting me try out the riding trowel .@alleneng https://t.co/Vn5SrWaS0f"]["Honored to receive @RicelandFoods 2016 Friend of the Farmer award. I'm proud to fight for policies that help farmers https://t.co/ANf11e1FJR https://t.co/7tVWgJrIwN"]["Congrats Anita! Thrilled to have you on my staff. Very proud of your hard work &amp; tireless advocacy for vets &amp; service members in #Arkansas https://t.co/0AxBNuzqLO"]["In my weekly column I wrote about #Obamacare's looming premium hikes. Read @harrisondaily https://t.co/rlgaeUznv6"]["Discussing future of Saline Co. Career &amp; Tech Education Center w/.@RepFrenchHill at CoorsTek in Benton. Got 1st hand view of plant's ops too https://t.co/aeSznPl52C"]["#Arkansas recognizes Century Farm Families &amp; Washington should too. That's why I introduced the Century Farms Act. https://t.co/gJZ22e6K9y https://t.co/4pBSE6IFVe"]["Proud to help rural #Arkansas schools meet technology needs through the #Senate's Computers for Schools program. https://t.co/DXd15kqDcO"]["Focusing on importance of AR agriculture this morning. Speaking w/.@ARDeptofAgricul Board &amp; visiting w/.@ArkansasFFA members from Hermitage https://t.co/3zg6dJp0NW"]["Pleased to join AAD Board mtg today in Pine Bluff. https://t.co/UNwBOslHxS"]["@ATEN Director Allen Weatherly was passionate about public broadcasting. His work made a difference in Arkansas. My prayers are w/his family"]["Great time visiting w/ first responders across #Arkansas on the #EverySecondCounts tour last week. See more here: https://t.co/gKuJE5QRAb https://t.co/zDmhg62wv8"]["Opening date for @marshalsmuseum set. The community of @FtSmithARK has put a tremendous amount of work into making it a reality. https://t.co/yE9eXETInr"]["Pleased to visit with Baxter Co. first responders as part of the #EverySecondCounts tour via @BBnewsroom https://t.co/RXzlgwPJwd"]["The #EverySecondCounts tour took me to Baxter Co. today where I met w/county fire, police &amp; EMTs to see how we could help them. https://t.co/lPTt44dR1g"]["Breaking from my #EverySecondCounts tour to visit w/DAV members at Veterans Plaza in Mountain Home. Thx for the book on the memorial in DC. https://t.co/Q3BOI0S7eT"]["Starting the day in Mountain Home talking w/@ktloradio about our #EverySecondCounts tour. I'll be visiting with Baxter Co first responders https://t.co/jqbvwcxkbS"]["I enjoyed meeting with members of the Jonesboro Fire Department, EMS &amp; Air Evac during the #EverySecondCounts tour Wednesday. https://t.co/ZtNhsWIxpF"]["Sec. Carter made right call to end effort to penalize service members for actions of recruiting officials. More &gt;&gt; https://t.co/tDHJn7vkvX"]["Thank you @NLRPD for showing me how you're keeping the community safe. #EverySecondCounts https://t.co/8m51lHpRBA"]["It was great touring the new Nevada County jail. #EverySecondCounts Read more via https://t.co/KiwXYl3i4u https://t.co/PgLgc2xCLW https://t.co/P33wIeaWgP"]["During the #EverySecondCounts tour we visited the Magnolia Fire Department. Read more via @Magnolia_Reporter https://t.co/2T2iLdhndT"]["Day 3 of #EverySecondCounts tour started w/briefing from .@NLRPD Chief Davis &amp; his team followed by ride-along for a firsthand look. https://t.co/vChM5hCzvk"]["#Obamacare is collapsing under the weight of its own massive bureaucracy. My take on the looming premium hikes &gt;&gt; https://t.co/RsJUTlSB6p"]["Last week I toured the Booneville Human Development Center. Here's the @BoonevilleDemo story about my visit https://t.co/eetdaMq5KY"]["The Nevada County jail officially opened in June replacing one built in 1924. I appreciated the tour of this new facility #EverySecondCounts https://t.co/5yU878IKWk"]["I'm urging Pres. Obama to stand up for the US timber industry &amp; enforce trade laws w/ respect to Canada. See more: https://t.co/oxc1fDS0he https://t.co/8608SS3jjU"]["Magnolia Fire Chief Greg Piner showed me some of the new equipment firefighters use to keep the community safe. #EverySecondCounts https://t.co/L1Ipc5Hz1z"]["Here's a recap of #EverySecondCounts tour Day 1 as I visit with &amp; thank #Arkansas first responders. https://t.co/AksZSk6NmA"]["Thank you #Arkansas Assn of Chiefs of Police for recognizing me as the Legislator of the Year. #EverySecondCounts https://t.co/yqmuZPowPr https://t.co/PuPHRhjyBi"]["Great hearing how @BentonPoliceAR officers are working to protect their community &amp; teaching other depts best practices #EverySecondCounts https://t.co/aQOYL0HK1R"]["I had the opportunity to see the renovations to the Saline Co. 911 center to help respond to the needs of the community. #EverySecondCounts https://t.co/lMGYzOpx1L"]["Great way to launch the #EverySecondCounts tour. Thank you @LRPolice &amp; Pulaski County Prosecuting Attorney's office https://t.co/HleKNnzkTw"]["I'm kicking off a week-long #EverySecondCounts tour across #Arkansas to hear from and thank our first responders. https://t.co/6PzhXvHtKH"]["I'm launching the #EverySecondCounts tour today. I'll be talking about this on @newsradio1029. Listen live https://t.co/qM1t9CTHjI"]["Another positive step toward fully &amp; responsibly decommissioning SEFOR. I will keep working toward that goal. https://t.co/gxODkm01M6"]["@BentonPoliceAR Chief Lane discusses how law enforcement are using naloxone kits to save lives. Another example of how #EverySecondCounts https://t.co/Lbe1uwHhGQ"]["Arkansas Sheriffs' Assoc. Acting Director Mike Godfrey explains why first responders are so important to our communities. #EverySecondCounts https://t.co/dNQGn1FDDI"]["Stopped by practice this week to wish @RazorbackFB good luck before they headed out of town. #WPS #BeatAuburn https://t.co/wkfocd9WGd"]["I'm proud to support #Arkansas Take Back. Great work by Pulaski County Sheriff's Office to collect expired, unused &amp; unwanted prescriptions. https://t.co/azQJVDNf9r"]["@UA_CJI provides cont'd education &amp; training to #AR law enforcement. Proud of the work it does to enhance public safety #EverySecondCounts https://t.co/dQRuHBX5Ti"]["I enjoyed the tour of the Booneville Human Development Center. This facility helps residents w/developmental disabilities learn new skills https://t.co/kSngZmjVGI"]["@SalineCountyAR OEM Director @robert_mcgowen explains how crucial 911 dispatchers are in responding to emergencies #EverySecondCounts #AR https://t.co/VJQVqan1uI"]["Saddened by news that Ray Gosack passed away. Fort Smith benefited greatly from his years of service. Thoughts &amp; prayers are w/his family."]["It's great helping Arkansans at my Van Buren mobile office. Let me help you. I'll be at the senior center until 12:30. https://t.co/mKqqiofVw8"]["Boozman honors slain Sebastian County deputy via @TimesRecord https://t.co/9W9dlVNaDO"]["I'm looking forward to visiting with Van Buren residents at a mobile office today at the senior center from 11-1. Let me help you."]["Honored to present WWII @CivilAirPatrol #veteran Ralph Watson the Congressional Gold Medal via @5News  https://t.co/fbU1LTXNI6"]["Get expired, unused &amp; unwanted prescription drugs out of your home. Find a drop off site near you for AR Take Back https://t.co/kvDDtJmICQ https://t.co/cGfClvao2w"]["I was honored to present the Congressional Gold Medal to #WWII #veteran Ralph Watson who served in the @CivilAirPatrol. https://t.co/VPKyCR5KOm"]["Ralph Watson served in the @CivilAirPatroll during WWII. Today he will be awarded the Congressional Gold Medal for his service &amp; sacrifice. https://t.co/upRUw10Zhn"]["Presented Sebastian Co Sheriff w/Congressional Record recognizing service &amp; sacrifice of Cpl Bill Cooper who was killed in line of duty https://t.co/QNISn5Dys7"][".@NWAPeds great to be with you! Thanks for the excellent care you provide to the community."]["Firefighters put their lives at risk to rescue others. They’re part of the backbone of our communities &amp; deserve thanks #EverySecondCounts https://t.co/pauQQfxkxb"]["Congratulations to the national champion @Arkansas4H forestry team from Hermitage High School in Bradley County. https://t.co/DZ6yLMb5bJ"]["Join my staff for a mobile office event at the Marion County Annex Building in Yellville today from 10-12. Let us help you. #Working4AR https://t.co/LL5rqeaiU6"]["This brings us one step closer to fully decommissioning the SEFOR Project site in a safe and responsible manner. https://t.co/OhPnaxTeTP"]["Today my staff is hosting a mobile office in Wynne at the Cross County Courthouse from 10 to noon. Let us help you. #Working4AR https://t.co/Mr9E0xBC7V"]["What a great honor for the Wildy family. I had the opportunity to visit the Mississippi County farm during #AgTour2016 in August. https://t.co/T2wCiBbdlI"]["I had a great time in Texarkana discussing economic opportunities w/business leaders in the region Via @TxkGazette https://t.co/xB6UOvZq6j"]["Thx for invite to speak today .@ConwayNoonLions. Good visit about nat security, economy &amp; veterans. Look forward to seeing you again soon. https://t.co/pWDHriKv5U"]["Proud to recognize @Bentonville_PS students who were selected to march in the 2017 @RoseParade. Congratulations on this accomplishment. https://t.co/uz7FT9fOVv"]["I'm headed to Fairfield Bay this afternoon to celebrate economic development success via @ArkBusiness https://t.co/eGlJlqC1gg"]["Law Enforcement Officers play a pivotal role in keeping our communities safe. I appreciate their hard work &amp; dedication. #EverySecondCounts https://t.co/tMc5GwClGi"]["@lcdonline featured Conway WWII veteran Bill Ledbetter who was highlighted in my Salute to #Arkansas veterans series https://t.co/RiIvysfafQ https://t.co/drlsBTu2RK"]["Next week I'm launching the #everysecondcounts tour to thank #Arkansas first responders. Read more @BoonevilleDemo https://t.co/ss0HiwfSYX"]["I appreciate this recognition for creating &amp; promoting policies that lead to more affordable energy for #Arkansas families. https://t.co/AUCypOIoCp"]["Started off the week in Miller Co. where we talked economic development &amp; toured the future home of the John Measel Center. https://t.co/lYXtZFOuKu"]["ICYMI: I'm visiting First Responders across #AR on the #EverySecondCounts Tour Oct. 24-27th. Join me &amp; thank these heroes in your community! https://t.co/oy1hwI242I"]["We are hosting three mobile offices this week in Wynne, Yellville &amp; Van Buren. Times &amp; Locations here: https://t.co/55jVsvAkyK #working4ar"]["Worked my way down @FNBFS as part Reynolds Cancer Support House's \"Over the Edge\" Survivor's Challenge. Great experience, great cause. https://t.co/vfiGPQPpJW"]["Happy Birthday #USNavy! Thanks for over two centuries of service &amp; sacrifice. #241NavyBirthday https://t.co/lspFrD2oq8"]["Thank you @ArFB Appreciate your efforts as we work for common goal of ensuring AR farmers, ranchers &amp; loggers can succeed in today’s economy https://t.co/Tce0kdOaoZ"]["Looking forward to highlighting the work of #Arkansas First Responders. Follow along using #EverySecondCounts &amp; let's show them our thanks! https://t.co/ETpW5vuUPL"]["It’s my honor and the flag patrol looks great! I know they will take great care of it. Have a great school year! @WestsideCabot @cabotsd https://t.co/6LNw2ukpAe"]["DC Circuit Court strikes harsh blow to Obama admin. &amp; CFPB. This is a win for community banks. READ more at my blog: https://t.co/1gL64zg7rW"]["Lots of excitement in Conway Co today. New @CityofMorrilton City Hall dedicated &amp; county's public library celebrates 100th anniversary. https://t.co/IWKMwy6wR2"]["Very saddened to hear the news about David Pryor, whose legacy of service to the people of Arkansas is undeniable. (1/2)"]["Proud to celebrate the contributions of Beaver Lake to the region. via @ArkansasOnline https://t.co/v0mjgMCEAr"]["I celebrated #mfgday16 with @NTISecondaryCtr. It was great to see the community support for manufacturing. https://t.co/ehdK0zeJbe"]["It was great meeting with Eureka Springs High School students &amp; staff. I toured the school today. It's a great facility for learning. https://t.co/77XASXP6e6"]["Looking forward to being in Carroll Co &amp; hosting a mobile office event in Eureka Springs at @ESARChamber from 11:30-1. Let me help you."]["Sen. Boozman Joins Students for Hour of Code via @KNWAnews https://t.co/pRzfg5nwrm"]["I'm proud to join the celebration to recognize 50 years of Beaver Lake and Dam. https://t.co/AS04pwxxIH"]["Thanks for letting me see how you're preparing students for 21st century careers. This is so important. #CSforAll https://t.co/kdAiqp2E5v"]["Great to see @RogersSchools students develop #computerscience skills for 21st century careers during this Hour of Code event #csforall https://t.co/RVPtK57HMg"]["Today my staff is hosting a mobile office in Rison at the Cleveland County Courthouse from 10 to noon. Let us help you. #Working4AR https://t.co/7jEov978DI"]["Glad u received it! It's an honor to provide this service to #AR schools. Happy to hear it will be displayed soon. Have a great school year! https://t.co/hvBd5A8ojZ"]["Boozman highlights rice producers' contributions via @Stuttgart_DL https://t.co/SySrcLaS5A"]["My staff helped Siloam Springs #VFW recognize the 50th Anniversary of Vietnam War &amp; honor the service &amp; sacrifice of #veterans who served https://t.co/CaFByr811l"]["A bill w/language similar to what Sen. Hirono &amp; I intro'd was signed ensuring that vital #veterans programs continue https://t.co/9THtN2M60m"]["Hardworking Americans should be allowed to pass along the results of their success, without having to pay the IRS. https://t.co/PNHSE0lJjG"]["Thank you @RiceArkansas for donating 116,900 pounds of #rice to @arfoodbank. My staff celebrated with Miss #Arkansas Rice &amp; her parents. https://t.co/H4Ef4E4N2O"]["#Arkansas can be proud the new MQ-9 Reaper mission being led by our very own @188thWG is now officially operational https://t.co/oSon178Sqs"]["My staff is hosting a mobile office in Batesville from 11 to 1 at the Batesville City Hall. Let us help you. #Working4AR https://t.co/EP2g9szVdg"]