["Hardly constructive: Pelosi: 'Five white guys' leading DACA talks should open a 'hamburger stand' via @POLITICO for iOS https://t.co/VBXnlhwXEC https://t.co/SkGpiasNIY"]["Additional https://t.co/VvKvqFdfry"]["Hate to say so but this is just wrong as a matter of law.  Instead the House bill provides addition protection above and beyond current law. https://t.co/WeNkOVyV9A"]["https://t.co/kTEDWVdzDY"]["Youngest Sutherland Springs shooting survivor to be released from hospital https://t.co/3w6PW7rbN0"]["Gentleman playing the theme from the Addams Family on French horn at Reagan National Airports elicits audience claps at appropriate intervals.  Amazing how embedded such things are in our collective memories https://t.co/kHeMEueUYG"]["Treasury: 90 percent of earners will see more take-home pay under new withholding tables https://t.co/cpnhMhE08x via @dcexaminer"]["#TaxCutAndJobsAct https://t.co/J28omLRkMz"]["It will take all our efforts to end human trafficking. In addition to #JVTA, which became law in 2015, I've introduced the Abolish Human Trafficking Act to strengthen survivor support programs. #HumanTraffickingAwarenessDay https://t.co/CVVWxdLIlt"]["The \"wall\" is one piece of an integrated border security system, including technology and border patrol.  Secure Fence Act, essentially the same thing, passed 80-19 in 2006, w 23 Senate Ds a yes :  Opinion | Take a deal for the dreamers. Build the wall. https://t.co/8rzqlGS4ZW"]["#TaxCutsandJobsAct  https://t.co/pKSrZASvNj"]["Ha! https://t.co/CdAWO93VPB"]["Democratic leaders face internal mutiny over Dreamers deal https://t.co/57mmAVGjey via @politico"]["With @GOPLeader McCarthy https://t.co/WM0WG1m4lc"]["Chuck Schumer: DACA court ruling 'in no way diminishes urgency' for legislative fix https://t.co/bjTh3aHiWr via @dcexaminer"]["How Millions of Iranians Are Evading the Internet Censors https://t.co/42mJS5WeOc"]["Politico on DACA: HOUSE MAJORITY LEADER KEVIN MCCARTHY (R-CALIF.), SEN. DICK DURBIN (D-ILL.), SENATE MAJORITY WHIP JOHN CORNYN (R-TEXAS) and HOUSE MINORITY WHIP STENY HOYER (D-MD.) will meet today with administration officials to figure out what they might be able to get done."]["Texans in ‘extraordinary’ Trump meeting optimistic on immigration deal https://t.co/nnEtTslxjg"]["Although transparency is important, Chairman Grassley was right to object about unilateral release w/o consultation, and it may well damage the entire investigation: Grassley blasts Feinstein's release of Fusion GPS transcript as 'confounding' - https://t.co/SgWZjkyIa2"]["Cheaper electric bills as a result of #TaxCutsandJobsAct https://t.co/Gee42iPls3"]["Trump tells farmers he wants a better Nafta, but doesn’t repeat threats of U.S. withdrawal from the agreement https://t.co/MSPc8Sl5Q9 via @WSJ"]["North Korea to Send Athletes to Olympics in South Korea in Breakthrough https://t.co/qwbyRNWogp"]["CNN: \"I think it's a mistake to think of the border wall as a standalone,\" Cornyn, the No. 2 Republican in the Senate. \"It is part of a system that will include technology and include more border patrol and it's going to have to be integrated along the entire border\""]["Louisiana's John Bel Edwards wants Trump tax cuts to benefit power customers https://t.co/c7RwGvUKRA via @dcexaminer"]["Extreme hurricanes and wildfires made 2017 the most costly U.S. disaster year on record https://t.co/qnyIrPmdZK"]["Trump Washes His Hands of Insurgency Against GOP Incumbents | Political News | US News https://t.co/7rVhTrgEzW"]["Pretty amazing: A Fragile Biblical Text Gets a Virtual Read https://t.co/MSNdko0oOe"]["Mexico holds presidential elections this year, and voters in Dallas could hold the key https://t.co/Pd0FLbOljw"]["Mexico: U.S. National Security Adviser Notes Russian Meddling In Mexico Election https://t.co/9OGB7xYWk9"]["Senators Sanders and Booker would likely support hearings and confronting this head on: https://t.co/AtA0wPaKNm https://t.co/4VyTgyXdvU"]["Here is a House bill with 15 co-sponsors: https://t.co/OnKkMkjeSO https://t.co/PdoP2X16MO"]["AG appropriately said we should no longer ignore federal law.  If Congress wants to debate changes to federal law it should do so, not ignore it: Did Jeff Sessions Just Increase the Odds Congress Will Make Marijuana Legal? https://t.co/vhSsP1uCTF via @politicomag"]["New tax law is a huge win for renters https://t.co/bxUn2JK7O3 via @nypost"]["RIP: Rita Clements, former first lady of Texas, dies at 86 https://t.co/7PG9v7ieEu via @TexasTribune"]["Proud of newly sworn-in Judge Jim Ho of the Fifth Circuit Court of Appeals.  Congratulations. https://t.co/qHNo2RQcXx"]["Good meeting with POTUS on 2018 agenda https://t.co/xVRBMNuuot"]["Over 1 million getting 'Trump Bonus' from tax reform victory, up to $3,000 https://t.co/bl2BJaGt27 via @dcexaminer"]["Dos whips https://t.co/zlKo2Sg0s5"]["Texas Tribune: 47 days until early voting begins for the 2018 primaries | 61 days until the 2018 primaries"]["Sears to close more than 100 stores in latest round of cuts  https://t.co/pE9DR2X5KT via @WSJ"]["Tax reform will pay growth dividends,  writes Robert J. Barro https://t.co/AqROJdxHLv via @WSJOpinion"]["Iranian Hackers: Sophisticated, Frustrated and a Rising Global Threat https://t.co/NOdA3q283S"]["Virginia Official Pulls Republican’s Name From Bowl to Pick Winner of Tied Race https://t.co/r4LSht6inJ"]["We have been played for too long: Trump, Citing Pakistan as a ‘Safe Haven’ for Terrorists, Freezes Aid https://t.co/HkofnIDBok"]["Why do Senate Ds slow walk disaster relief (for Puerto Rico, \nFlorida, Texas and the West) plus defense needs in order to force a DACA deal? We are negotiating in good faith on DACA and will beat the deadline if Ds do so as well; no need to abandon USG's other responsibilities."]["Trump Moves to Open Nearly All Offshore Waters to Drilling https://t.co/aLhRM2sDq6"]["A record-breaking 22 women serve in Senate @CNNPolitics https://t.co/amTd274IeO"]["Sessions will end policy that allowed legalized marijuana to prosper https://t.co/4nzOtHSW5C"]["Mexico's leftist presidential front-runner puts country first, resists Trump comparison https://t.co/OQYGmVqA7r"]["Creepy: Brazos County outdoorsman pulls 5-foot snake from toilet at ranch house https://t.co/9c7g45p04z"]["After First Amendment challenge, FEMA may pay Texas churches to rebuild after Harvey https://t.co/FOcCnHfvHK via @TexasTribune"]["AAF: A better case for entitlement reform is that the programs themselves serve their beneficiaries poorly. In the absence of reform, Social Security promises to cut retirees’ benefits 25 percent across the board in just under 20 years."]["AAF: It is now clear that the Tax Cuts and Jobs Act (TCJA) will frame the politics of choosing the policy agenda for 2018 and beyond. The attacks by progressives are also already clear; they will argue that TCJA is the source of budget deficits and rising debt. This is nonsense"]["https://t.co/LYjQq3jeNM"]["Senate Republicans to meet with Trump Thursday on DACA https://t.co/8YulNCHYxx"]["Busting Illusions About Iran https://t.co/Xfk1V1IQ1C via @WSJOpinion"]["Sen. Cornyn to give State of Congress in Rio Grande Valley https://t.co/wpxtwa9qrV via @monitornews"]["Texas DPS denies locksmith's license, after 30 years on the job https://t.co/93q2przCUz"]["Honored to participate in @JusticeWillett and new TX Sup. Court Justice Jimmy Blacklock’s swearing in ceremony this morning in Austin. The judiciary in Texas is in very good hands. https://t.co/BvUUbNonsF"]["Flashback Tuesday: at the Texas Supreme Court chambers where Judge Don Willett was sworn into… https://t.co/AUhRsXH0Bn"]["Free Trade Has Been a Boon for Energy Independence, by @MerrillMatthews https://t.co/HfkY2IyRig via @WSJOpinion"]["In cities with low unemployment, wages finally start to get bigger https://t.co/fwb57YFMuq via @WSJ"]["Under #TaxCutsandJobsAct all taxpayers can deduct up to $10K in property, sales, or state income taxes, treating all taxpayers the same https://t.co/31ByFxqZbq"]["Hint: reigning in spending is not an option they are seriously considering.  https://t.co/tlSq6k6HrH"]["71% more personally hopeful in 2018: Poll du jour https://t.co/YiQHwpGbfY #axiosam"]["Despite fierce headwinds for GOP, Cornyn's crystal ball says 2018 elections may not be so bad https://t.co/GXZm14mtyM"]["Burrr! https://t.co/g1mz9EGMh3"]["My duck hunting companion. #firedupreadytogo https://t.co/y4E8iWroiQ"]["Registered under FARA? https://t.co/5jTDxEgwRX"]["https://t.co/dy4aFlMV3L"]["Dem senators fight to out-liberal one another ahead of 2020  https://t.co/0e8KVQzDpv via @politico"]["The Senate Intelligence Committee Is Prepping To Wrap Up Their Russia Investigation Early Next Year https://t.co/KjwTdwJngm via @LoopEmma"]["Welcome to the club, Jeanne! https://t.co/5FiBHCaASj"]["Russia denies entry to Sen. Jeanne Shaheen https://t.co/VmhtIWA1la via @dcexaminer"]["Criminal justice reform poised to take off in 2018 https://t.co/GoyRmdGJ0Q via @dcexaminer"]["New Protests in Iran  https://t.co/Mnymt3ozMq via @WSJOpinion"]["The Comfort of Tamales at the End of 2017 https://t.co/KYrD3NQPJU"]["Quite right https://t.co/ajFh3pXfAp"]["Analysis | There's still little evidence that Russia's 2016 social media efforts did much of anything https://t.co/ES6zKfuR9f"]["Romanian hackers took over D.C. surveillance cameras just before presidential inauguration, federal prosecutors say https://t.co/SoBDKviQTn"]["If you see no reason to give thanks, the fault lies in yourself.\n-- Tecumseh\n(1768-1813) Shawnee Chief (h/t liberty quotes)"]["#GoSpursGo https://t.co/7equ7NF58X"]["China Offers Tax Incentives to Persuade U.S. Companies to Stay https://t.co/wvbgLQVTaM"]["Commentary: How Republicans in Congress made great strides in 2017 https://t.co/XzvAud1Yha"]["Rex Tillerson: I Am Proud of Our Diplomacy https://t.co/Al65pAbEZA"]["6. Data du jour https://t.co/X92M4HTuiW #axiosam"]["Idaho and Nevada led the nation as the fastest-growing states https://t.co/0tRNLXXhx3"]["Texas added more people than any other state in past year https://t.co/Fn0cDLw6cV via @MyABJ"]["The Trade Deficit is Not Hurting the Economy https://t.co/nVfl9qAk7H"]["How a NAFTA Withdrawal Would Hurt the U.S. Economy https://t.co/jsGo0Qx05y"]["First state football title a holiday gift for Texas town still rebuilding after Harvey https://t.co/TbdZDXvvE7"]["It's time for Texas to take a long, hard look at its licensing regulations https://t.co/f8PGNhKplI"]["Frying spinach for one of my favorite Indian dishes. Won’t be doing that again soon. Messy and complicated. But delicious. https://t.co/1vqIa6INa6"]["Byron York: McCain associate subpoenaed in Trump dossier probe https://t.co/JiVr0lNoxu via @dcexaminer"]["Sen. Susan Collins: New tax law will benefit hardworking Mainers, not Washington elites https://t.co/Ysm3l6GzZl"]["https://t.co/0X5zD1JWKx"]["ATF eyes regulating rifle 'bump stocks,' like those used in Las Vegas massacre https://t.co/WUMyBLHFpS via @dcexaminer"]["https://t.co/qtNpRX5jbW"]["Jake Tapper on CNN: [N]ext year, 91% of middle-income Americans will receive a tax cut. Isn’t that a good thing?\nBernie Sanders: Yes, it is a very good thing. And that’s why we should have made the tax breaks for the middle class permanent.(h/t WSJ)\n\nWe will if Ds will vote yes."]["https://t.co/NzhHl25rNr"]["Kremlin trolls burned across the Internet as Washington debated options https://t.co/eTHj2FFBa4"]["America's Hottest Oil Play Just Needs a Few Thousand Truckers https://t.co/CisEbBXlSG"]["Happy Boxing Day"]["Trump’s Great Rules Rollback https://t.co/X6P4bCqByS via @WSJOpinion"]["The Uncharitable Charities https://t.co/bEe0UO4kTI via @WSJOpinion"]["Tax provision could bring lots of U.S. corporate cash from abroad via @axios https://t.co/6qD8AOwLdW"]["After losing 40 principals, Austin ISD gets boost from Bush Institute\n\nDownload the Statesman app for the latest Austin news you want, when you want, in this free app.\n\niOS: https://t.co/WOEYff84h4\nAndroid: https://t.co/Zo0HUlo1fI https://t.co/2nfUZ2VPJl"]["\"[H]omeless people were 167% more likely to have ER visits than the non-homeless population, and that from 300-400 homeless were arrested in Dallas each month. [Not] shocking, but they gave Crain data she could take to officials to try to influence policy on homelessness. https://t.co/iu7N1x3bWi"]["The ‘Frequent Flier’ Program That Grounded a Hospital’s Soaring Costs https://t.co/lPoh7wF6gC via @politicomag"]["Puerto Rico kids get a toy delivery thanks to a Dallas billionaire and the Marines https://t.co/CrAW4CHOxV"]["More than 107 million people to travel for holidays, AAA says https://t.co/aQ9bSngIOT via @PghBizTimes"]["Sinclair announces bonuses for employees as a result of tax reform https://t.co/Yxwmzb5e1z via @BaltBizOnline"]["After a Chaotic Start, Congress Has Made a Conservative Mark https://t.co/mWwFXh5VIQ"]["Using Billions in Government Cash, Mexico Controls News Media https://t.co/rWogapf578"]["You can still itemize if it exceeds standard deduction, I believe https://t.co/Y0CJdxHxgs"]["Ulysses S. Grant, the President who made Christmas a holiday https://t.co/GrIbgzLSgO"]["The top 10 Senate races of 2018 https://t.co/7qMLTnC9rO via @politico"]["Thank you, James https://t.co/e9wsIHSArm"]["A worthy read https://t.co/gwtheOmrWS"]["Oh, and Merry Christmas and Happy Holidays! https://t.co/ZD669dYsvB"]["Idiotic. The charitable deduction is fully preserved.  Also, the dubious premise is that the reason people generously give to worthy causes is so they can deduct from their taxes.  Nevertheless, everyone still can. https://t.co/Ct3cjh3djC"]["Democrats block dozens of Trump nominees via @POLITICO for iOS https://t.co/m3VEuFlttC https://t.co/Ajr6pMuTt5"]["https://t.co/qLrhm98tkc"]["Texas Jobs Report: Oct 2017 | @DMNBiz https://t.co/mOn6MHj7cL"]["WSJ: In a growing economy with a tight labor market, scarce workers are increasingly valuable. [T]he clear message is ... in a strong and competitive economy, [employers are] going to be in a bidding war for talent."]["Cornyn bill to make it easier for military members to get commercial driver's licenses https://t.co/wYlJ1eK1KZ"]["Texas Monthly, again: \"The makeup of last year's incoming class was notably unusual: instead of new people moving to the state, most of the fresh faces belonged to newborn babies.\" #Texanslovebabies"]["Texas Monthly: Texas welcomed 400,000 new people last year, according to a recent report by the U.S. Census. Estimates released Wednesday show the total population of Texas reached 28.3 million people between July 2016 and July 2017, continuing steady growth."]["#TaxCutsandJobsAct https://t.co/9il3axtEzW"]["Alan Graf, EVP and CFO for FedEx Corp., said: Any capital acceleration would primarily be allocated for equipment, technology and pension funds and would grow earnings per share and “further grow the business and create even more upward mobility,\" according to Graf."]["Alabama disproves the case against voter ID, writes @jasonrileywsj https://t.co/pVo3EYtnTi via @WSJOpinion"]["Tim Scott roasts Huffington Post writer for calling him a 'prop' at Trump's tax cut speech https://t.co/tblfQd9qEP via @dcexaminer"]["View from White House celebration of #TaxCutsandJobsAct https://t.co/0Hyo6VgdB1"]["With Tax Reform, AT&amp;T Plans to Increase U.S. Capital Spending $1 Billion and Provide $1,000 Special Bonus to more than 200,000 U.S. Employees | Business Wire https://t.co/DWDvASZbjT"]["Required D votes to get to 60, but they refused.  We’ll give them another chance soon https://t.co/WpxkZGTqNB"]["Join us https://t.co/eO2QmVDEoy"]["Democrats should now vote to make middle-class tax relief permanent https://t.co/MAduOhnzjy via @dcexaminer"]["Here are the top three biggest lies about the GOP tax bill we need to debunk real quick https://t.co/pAo2QnSwLP via @dcexaminer"]["Every American will benefit from the GOP tax reform plan https://t.co/1AlfhFNFVx via @dcexaminer"]["WP: 8 in 10 Americans will pay lower taxes next year, according to the nonpartisan Tax Policy Center’s analysis of #TaxCutsandJobsAct"]["More fake news https://t.co/twFeVkwUIP"]["House Passes Final Tax Bill; Senate Votes Next on Republican Plan, via @nytimes https://t.co/NqhfSFzOxe"]["Moneywatch: the typical American household is still earning 2.4 percent below what they brought home in 1999.  #TaxCutAndJobsAct will change that for the better."]["Under #TaxCutsandJobsAct a married couple earning $100,000 per year ($60,000 from wages, $25,000 from their non-corporate business, and $15,000 in business income) will receive a tax cut of $2,603.50, a reduction of nearly 24 percent."]["Under #TaxCutsandJobsAct a single parent with one child and an annual income of $41,000 will receive a tax cut of $1,304.50, a reduction of nearly 73 percent."]["Under #TaxCutsandJobsAct the typical family of four earning the median family income of $73,000 will receive a tax cut of $2,058, a reduction of nearly 58 percent."]["WSJ: Middle-income households that earn $20,000 to $100,000 a year will receive $61 billion in tax cuts in 2019 under the Republican overhaul, according to an analysis issued by Congress’s Joint Committee on Taxation."]["The real lesson of the kick at Bob Corker is how terrified the left is of a bill that could be a popular tax cut that helps the economy and lifts incomes. https://t.co/Gkvz9KWrWJ"]["Kicking Bob Corker https://t.co/6bcHNHKBgm via @WSJOpinion"]["Tax debate update: The U.S. House plans an early vote while Democrats plan drama https://t.co/PG89I54C9z via @bpolitics"]["The idea was planted by David Sirota, a liberal writer/activist that used to work for Senator Bernie Sanders of Vermont https://t.co/fzlLaO2Lq9"]["There Is No Last Minute Real Estate Perk in Tax Reform via @forbes https://t.co/tHsscQJCBR"]["House will vote on tax reform bill Tuesday https://t.co/wxrq0SMe2R via @dcexaminer"]["Hatch: First, [the assertion] that a new provision was crafted for real estate developers and was “air-dropped” [and] that you (Corker) had some role in advocating for or negotiating the inclusion of this provisions...are categorically false.”"]["Chinese ownership is raising questions about the editorial independence of a major U.S. magazine https://t.co/8gdVH7y7CZ"]["Giving up on the American Dream, settling for the status quo, and even #rootingforfailure seems to be the attitude of MIA Congressional Ds on #TaxCutsandJobsAct.  American families need more take-home pay, higher wages, more jobs, and a competitive economy.  Don’t settle for less"]["Sebastián Piñera Wins Chile’s Presidential Election https://t.co/wmuFKxRSrh"]["WSJ: After the slowest expansion in decades and tepid wage growth, Americans should want this tax reform to succeed and it’s a shame Democrats are rooting for failure."]["Democrats Against Tax Reform https://t.co/IGSq47iOmg via @WSJOpinion"]["Don’t you think we should count votes of military deployed overseas.  They have until the 19th. https://t.co/xwHSL896SI"]["James Lankford hits out at criticism of tax reform: 'A lot of people haven't started paying attention until the very end' https://t.co/LU868XINa4 via @dcexaminer"]["Endless: The Media-Democrat Complex is Addicted to Lying About the GOP Tax Plan https://t.co/RbOCoFu7hW"]["Makes sense to me to wait to see what they are first https://t.co/9lCqpYujKN"]["But Mueller needs to clean house of partisans https://t.co/g8SwgAKtfH"]["@playbookplus: \"We said tax reform probably wouldn't happen in 2017. It will.\""]["Florida becomes a paradise for the plaintiff bar. https://t.co/zXfSvdShgh via @WSJOpinion"]["SpaceX + Elon Musk successfully launches reused rocket for NASA—a milestone  https://t.co/ptqAIHFnvq via @WSJ"]["A Tax Reform for Growth https://t.co/7E3Y4gXGqc via @WSJOpinion"]["You don’t https://t.co/7lHYkIloyz"]["Congress will pass a long term CHIP bill next week https://t.co/ZkZOMS7Eaj"]["Rubio says he’ll back final tax plan as Republicans appear to have the votes they need https://t.co/UhzQYASzbH"]["I like it https://t.co/GQvFfbYEXP"]["In flux https://t.co/xecyjSLSMe"]["https://t.co/vz0IVFvn3S"]["Senate confirms second Texas conservative for U.S. appeals court in two days https://t.co/qXpalJ1xbN"]["DHS chief visits Valley https://t.co/utIOaVfdcc via @BrownsvilleNews"]["‘We reject this idea that America cannot do any better than the status quo, which seems to be the attitude of our colleagues across the aisle.”"]["Federal Reserve Chair Janet Yellen today said the tax package going through Congress is one of the factors that led Fed officials to increase their projections for GDP growth next year to 2.5 percent from 2.1 percent."]["https://t.co/dfMcsgi7Bl"]["Court document points to Kaspersky Lab’s cooperation with Russian security service https://t.co/pfZhSEE8YB"]["How a NAFTA Withdrawal Would Hurt the U.S. Economy https://t.co/jsGo0Qx05y"]["Trump to Unveil U.S. National Security Strategy on Monday https://t.co/Mmhk6TiaWg"]["Fingerprints of Russian Disinformation: From AIDS to Fake News https://t.co/Thh45NQg34"]["Cornyn: Vote Against Tax Reform is a Vote to Send Jobs Overseas https://t.co/nHuqTTfbBY via @YouTube"]["https://t.co/jsGo0Qx05y"]["WSJ: The latest reports show that we now have one job opening for every unemployed American. This ratio is at the highest level in decades."]["I hope my colleagues in the House will act swiftly to pass the #SAFERact as well and help end the national rape kit backlog 5/5"]["Other orgs supporting #SAFERact include @CrimeVictimsOrg @thencja @ndaajustice @RiseNowUS and @test400k 4/5"]["The #SAFERact is supported by @RAINN01 @ForensicNurses @TheJHF @natashasjustice and @endsxlviolence 3/5"]["(2) The #SAFERact will ensure that our state and local law enforcement agencies continue to have the resources to solve crimes, and provide survivors with the justice they deserve 2/5"]["In October, the Senate passed the #SAFERact to reduce the national rape kit backlog https://t.co/LgH1mdqy3j 1/5"]["China has a plan to rule the world https://t.co/aooKjWXXw6"]["It says he has explaining to do. Attack means something different. https://t.co/ruJYwpehmN"]["Hispanic Entrepreneurs Need Tax Reform https://t.co/QHgFNVr17q"]["WSJ: The unemployment rate among Latino Americans hit the lowest level on record (4.7%)."]["Another benefit is more jobs and more take home pay from growing economy, spurred by making US tax rates competitive and eliminating double taxation on overseas income, which discourages US investment, jobs, and better wages.   #wecandobetter https://t.co/Cb7iPyOBst"]["Many in media have lost focus on benefits to families struggling paycheck to paycheck, like 2X standard deduction and $2K child tax credit.  Family of 4 w median income will see $2,200 tax cut. Status quo unacceptable, but Ds chose to sit on sidelines  https://t.co/7XBlQXzbUu"]["Opinion | Robert Mueller has got some explaining to do https://t.co/aFU2okfRuU"]["A Visit To Houston's Himalaya: Pakistani And Indian Food With Deep Texas Roots https://t.co/b3ufNfp58A"]["Misconception. Every state has license to carry law.  Reciprocity would require Texas license holders comply with local laws.  Just like drivers license. https://t.co/YpMdzLfv8M"]["Reciprocity of state-issued drivers licenses? https://t.co/lZItKkBZgX"]["Top al-Qaeda leader reported killed in Afghanistan in U.S.-Afghan operation https://t.co/3L646EQ6wj"]["18 Questions CNN Needs To Answer After Getting Busted For Fake News https://t.co/PuSXc76luk"]["Don’t destroy NAFTA, update it https://t.co/H4HFFHZlJ8 via @mySA"]["Liberal Activists to Democrats: Protect Young Immigrants or Shut Down Government https://t.co/adXMEcGKFl"]["Oh Christmas tree.... https://t.co/JsW4Tr9lRp"]["Negotiating 101: ball in your court, so make a counteroffer  https://t.co/B2iaQ26ExX"]["\"The group consisting of mother, father and child\nis the main educational agency of mankind.\"\n-- Rev. Dr. Martin Luther King, Jr.\n(1929-1968), US civil rights leader"]["Jailed for a Text: China’s Censors Are Spying on Mobile Chat Groups https://t.co/g0ajEPl9GB"]["Texas Politicians Push Back On White House Ethanol Mandate  https://t.co/B3vPdqW6V4"]["I will be home tomorrow https://t.co/YLxA3IR2QE"]["House to stay in Washington the week before Christmas to pass tax bill https://t.co/PkT9bXkuUY via @dcexaminer"]["Good nomination https://t.co/jGk6H3j9of"]["Bob Armstrong dip would be a contender: https://t.co/uV53cU0vzN https://t.co/mIIN8Bhncw"]["Mitch McConnell names GOP senators for tax bill conference committee https://t.co/x3192P7Pkn via @dcexaminer"]["Let’s stop it now. #fixNICs https://t.co/JOMcIlWu46"]["If DOJ routinely prosecuted felons in possession of firearms it would save lives https://t.co/TcQYm6PXpc"]["Last Four Democratic Party Platforms Have Called Jerusalem the Capital of Israel https://t.co/YqVOh7h3HB"]["Undocumented Mexican national acquitted of murder now faces federal charges over case https://t.co/A8eit6UrV6 via @WSJ"]["It is simply not: The CHIP Program Is Beloved. Why Is Its Funding in Danger? https://t.co/19mDcPFNdf"]["Let's strengthen gun background checks and stop the mayhem. | Fort Worth Star-Telegram https://t.co/YnKQVFrevc"]["Cornyn, GOP Colleagues Introduce Bill To Protect DACA Recipients, Strengthen Border Security https://t.co/waWd6EiB4c"]["Durbin vs Schumer? https://t.co/KdOpII2P1A"]["Cut a deal with my wife https://t.co/dO6yHU7HdZ"]["Schumer downplays shutdown chances over DACA fight https://t.co/dMMs9QUURN"]["“No bipartisan deal currently exists to undermine, Grassley says” Durbin: Cornyn and Grassley Undermining DACA Deal https://t.co/j55dCOc3YQ via @RollCall"]["Yikes: 15-foot albino python turns up dead in DeSoto https://t.co/59OWjuikSJ"]["https://t.co/U8OMfz2j8h"]["Democrats Stalling Trump Ambassadors, Harming U.S. Effort to Combat N. Korea, Conduct Diplomacy https://t.co/YsBDQ4NAHT"]["Cornyn blasts congressional Democrats' government shutdown threats https://t.co/4rtjLOU5bW via @TexasTribune"]["Misunderstood question: Alexander-Murray and CHIP fair game, not DACA https://t.co/EENNPJKQWg"]["The Supreme Court is allowing the Trump administration to fully enforce a ban on travel to the United... https://t.co/RDtGKBsynt"]["Seems obvious but good advice https://t.co/XxmmI1etaw"]["Fake news https://t.co/D7E1VsqgLp"]["Wind Power Capacity Has Surpassed Coal in Texas https://t.co/CForNABY75 via @TexasMonthly"]["Withdrawal from NAFTA would damage Texas’s economy https://t.co/b3SlGbGDs0 via @mySA"]["To help families with large medical and dental expenses, the @SenateGOP tax reform bill allows them to deduct medical and dental expenses that exceed 7.5% (current law is 10%) of their adjusted gross income in 2017 and 2018. The House bill gets rid of deduction entirely"]["To help teachers, the @SenateGOP tax reform bill increases teacher deduction: Teachers who buy their own supplies for the classroom may deduct up to $250 today. The Senate bill doubles that amount to $500."]["To help families, the @SenateGOP tax reform bill doubles the standard deduction - zero tax on first $24K on joint return - AND doubles child tax credit to $2,000 per child, with $1000 being refundable, meaning you get benefit even if you don't pay income taxes."]["Heroin in Soups and Lollipops: How Drug Cartels Evade Border Security https://t.co/jNYG6NZs0u"]["Developers Said Their Homes Were Out of a Flood Zone. Then Harvey Came. https://t.co/UMeyLcxIve"]["How four GOP senators guided a tax-bill victory behind the scenes https://t.co/hxgw99bqqG"]["Thanks to @POTUS for his gracious congratulatory call on #TaxReform win for American people in Senate last night.  Tax cuts, a surging economy, rising wages, more take-home pay, and a flood of jobs and investment to US from overseas will result.  @realDonaldTrump"]["https://t.co/RQzitzPQ1F"]["This was regular order - except Democrats chose not to participate, preferring stagnant wages, fewer jobs and the shipping of jobs overseas https://t.co/JwdqxGGPYP"]["Kirby is a service dog in training, whose owner consented to my petting him.  He couldn’t take his eyes off his treats. https://t.co/TEecigdRKg"]["Has Kirby filed as a lobbyist?  I think not. https://t.co/U79127I4w5"]["WSJ: A mix of upbeat economic data and signs of progress on Republicans’ tax overhaul helped push the Dow industrials and the S&amp;P 500 to records and the indexes’ eighth consecutive month of gains."]["NYT says \"only\" about this felony from 5X deported illegal alien: \"The man, Jose Ines Garcia Zarate, 45, who was also found not guilty of assault with a firearm, was convicted only of being a felon in possession of a firearm\"  https://t.co/L1xQT0ryMw"]["Other trigger ideas being vetted https://t.co/ab48uoOPS0"]["https://t.co/VkipymJo9f"]["Senate Republicans round up more votes for tax plan via @POLITICO for iOS https://t.co/jUCK29ceZN https://t.co/KxT23kpppi"]["She would pay zero income tax, receive a doubling of standard deduction and a $2000 child tax credit under Senate bill https://t.co/ct00waS9pW"]["Opinion | Congress, surprise us https://t.co/PdeBpn2M9h"]["The Deadline for Harvey Victims to Apply for FEMA Assistance Is Thursday https://t.co/Vc5DzqSbiY via @TexasMonthly"]["Happy 100th birthday: Dallas runner celebrates major milestone with speed and spiffy custom Nikes | @guidelive https://t.co/QMuNjBlTVT"]["Consumers are more confident than they have been in 17 years https://t.co/EhELQngu5k via @WSJ"]["President Wins Round in the Battle for the Consumer Bureau https://t.co/2RyzHP7QFg"]["Air Force Failed to Report Dozens of Service Members to Gun Database https://t.co/mM104dBOWj"]["Denzel Washington: \"If the father is not in the home, the boy will find a father in the streets. I saw it in my generation and every generation before me and every one since. If the streets raise you, then the judge becomes your mother and prison becomes your home.”"]["Don’t destroy NAFTA, update it https://t.co/WgK1SAZMpW via @mySA"]["Cornyn Joins Small Business Advocates to Rally for Tax Reform https://t.co/lPDHGBFTnq via @YouTube"]["The Senate tax bill has a cure for corporate inversion, writes Kenneth C. Frazier @Merck  https://t.co/gCkVucpgJO via @WSJOpinion"]["Texans in Congress brace for frenzied agenda in December https://t.co/U0Dqxqea8D via @TexasTribune"]["Great weekend for @TylerJrCollege! https://t.co/LSfVjTPUbs"]["Consumer bureau's top lawyer sides with Trump in leadership clash https://t.co/AecBUCwXl0"]["Some of America’s leading economists on how tax reform will lift the economy https://t.co/CZq95OPcsU via @WSJOpinion"]["WSJ: CBO’s roughly $43 trillion revenue estimate also depends on a projection of average economic growth of 1.9% a year. *** That is not the country we have known and it is an America that would be much diminished and harsher."]["WSJ: CBO says that every 0.1% increase in GDP adds about $270 billion in revenue over 10 years. That means a mere four years at 3% growth—the U.S. historical norm—could fill a $1 trillion hole. An average growth rate of even 2.4% over the decade would more than fill the hole."]["Tax Reform, Growth and the Deficit https://t.co/G83ALKTpts via @WSJOpinion"]["RIP https://t.co/wa1pzc6R0y"]["“ you are basically being water-boarded with outrage stories about the other side.” https://t.co/aCcYhvVaDP"]["The Age of Outrage https://t.co/qK3VGRw8ru"]["Nancy Pelosi says sexual harassment controversy giving Republicans 'cover' on tax reform: Watch https://t.co/2N42vcm7hy via @dcexaminer"]["FBI didn't tell US targets as Russian hackers hunted emails   https://t.co/uFHPAWoPgN"]["Some folks doubted whether Texas could split into 5 https://t.co/MFZTaWihkd"]["A General Mattis Christmas Story https://t.co/izKOfLFFf1"]["The Parasites Feeding on North Koreans https://t.co/wPAPiw8fr3"]["What if Texas were split into five? https://t.co/KLkZ7VUInO"]["Hanging with my pelican friends in Rockport #HurricaneHarvey https://t.co/AsegHZDizR"]["Whooping crane off Port Aransas https://t.co/cP8Pf2LhRr"]["Americans want background checks for gun sales https://t.co/ITKIAkrLpw via @mySA"]["Jeff Sessions orders review of gun background check system - Reuters https://t.co/NzBXLmfs3o"]["President Abraham Lincoln's Proclamation of Thanksgiving https://t.co/iR3B7wysTV via @dcexaminer"]["The Day the Pastor Was Away and Evil Came Barging Into His Church https://t.co/Xpb5iyhb4p"]["Morgan Lewis International Trade Co-Leader Tells Clients to Get Ready for CFIUS Reform https://t.co/IyMFPjM338 via @TheNLJ"]["Net neutrality is misnamed. It is government regulation. Why not let the market work? https://t.co/gR5refrCDI"]["Murkowski says she backs Obamacare mandate repeal https://t.co/158FY3RENW via @politico"]["A very important subject, to be sure. https://t.co/yeQVtKWOL9"]["Yum! https://t.co/Hl6kOlE0eg"]["How Toyota improved Parkland Hospital's ER — with purple lights https://t.co/iBmjQdJPTM"]["As it gets colder in Texas, let's remember those in need. @TheBridgeHRC in Dallas is collecting cold-weather clothing to help folks 'Bundle Up at the Bridge.' @Mike_Rawlings &amp; I helped pass out clothing today. https://t.co/XSPi6PdMxN"]["\"Few things are more irritating than when someone who\nis wrong is also very effective in making his point.”\n-- Mark Twain\n[Samuel Langhorne Clemens] (1835-1910)(h/t liberty quotes)"]["Harvey was three months ago. These displaced families are still in limbo https://t.co/4lZ3CAE1Pl via @TexasTribune"]["Good tax sense from Sen David Perdue https://t.co/Vu9ub192ee"]["https://t.co/gIbjBNeRMU"]["99 year old Orville Rogers receiving Dallas Baptist University’s Russell Perry Free Enterprise Award https://t.co/RfkAcZiHOz"]["Good visit to @Toyota’s North American HQ in Plano today. Enjoyed visiting w employees and welcoming many to TX! https://t.co/ymdihu9MZ1"]["https://t.co/vMYfUlW6oN"]["Texas a Testbed for Carbon Capture and Sequestration Technology https://t.co/Lu4Y1kGdhN via @TexasMonthly"]["The Senate bill cuts taxes for every income group, increases economic growth and will help keep jobs and American companies here at home – all while making America more competitive. https://t.co/VN2kMx7GaJ"]["Finance https://t.co/cKerfZQ20Z"]["Looking forward to chairing  Senate Fianace Committee Field Hearing on NAFTA in San Antonio at 9:30 am CT.  You can watch online https://t.co/6FVQX8NYEV"]["Texas Jobs Report: Oct 2017 | @DMNBiz https://t.co/mOn6MHj7cL"]["EDITORIAL: Cornyn bipartisan gun bill would bolster our existing laws, background checks https://t.co/JCGB0zTSm7 via @wacotrib"]["He is doing a great job https://t.co/36Z3JFhALW"]["Apple served with search warrant in Sutherland Springs shooting https://t.co/LwZQ2L8YXh via @mySA"]["$5 billion in housing recovery aid heading to Texas https://t.co/M4AeOPPYXI via @expressnews"]["Assumes voluntary decision to forgo a tax credit payable to insurance company is a personal tax increase - wrong - and ignores true tax savings by eliminating individual mandate penalty https://t.co/BX42TKQOsN"]["Not true https://t.co/x5WP3IZOxv"]["Some of my young constituents came over at lunch to say hi before heading out to see @WonderTheMovie https://t.co/4nnPUMsx29"]["Sessions cracks Russia joke in speech https://t.co/GpG9giV2M4 via @YouTube"]["Playbook: ... Cornyn comms. director Drew Brandewie is 33! https://t.co/MdZMTaB2BO"]["Almost 300 MS-13 Gang Members Arrested in Nationwide Bust https://t.co/4uLC96bXLN"]["A Blue Slip—Not a Franken Veto: Restoring an important Senate courtesy to its rightful purpose. https://t.co/GJNxGcfl2M via @WSJOpinion"]["Kirsten Gillibrand says Bill Clinton should have resigned over Lewinsky affair https://t.co/eIL0qbE5P6 via @WSJ"]["U.S. flagged Russia’s Kaspersky as potential threat as early as 2004  https://t.co/Jw2UrEGCtg via @WSJ"]["Billions of Dollars Start to Flow Into Texas To Rebuild After Harvey https://t.co/j8IIvTq7dI"]["https://t.co/ChXuqSNNWq"]["M-V-P! Congrats @JoseAltuve27! Well-deserved recognition #EarnedHistory #HoustonStrong https://t.co/xsNbPF9yC4"]["Cornyn: White House hurricane disaster aid request 'wholly inadequate' https://t.co/M7yVt6bF15"]["I think the average since WWII is 3.2%. We have been in a slump a long time. https://t.co/ZhZ2FrAn61"]["Calling all tax nerds: The Joint Committee on Taxation is on twitter @jctgov https://t.co/728y6WI0Wl"]["This chart puts the lie to claims the Senate Tax Cuts and Jobs Act benefits only high end taxpayers - low and middle range taxpayers benefit the most https://t.co/Lyl9j7ZDG3"]["Indeed it is a tax cut for those who pay because they can’t afford Obamacare premiums https://t.co/gm9YM0LnuU"]["The repeal of the ACA's individual mandate is not a tax hike. https://t.co/jdDaol4cEw"]["https://t.co/sHEWQ8FPYU"]["Fake news https://t.co/mUiQgzdfiW"]["Tragic. This must stop.  Help us pass #FixNICS bill that will help list #domesticviolence abusers on prohibited list for purchases, which is current law. Shooter at #SutherlandSprings had a felony conviction. https://t.co/uLcwNug1FH"]["Tax cuts by income level in Senate Tax Cuts and Jobs Act https://t.co/rXNf9lJXrf"]["National Sheriffs Association also endorses https://t.co/U1JaNQJYkd"]["Should they rename? https://t.co/zoGlpvVIFq"]["L aw-abiding gun owners can and should be allowed to purchase and possess firearms. But we must #FixNICS and enforce the laws already on the books prohibiting those convicted of violent acts from having guns."]["The bipartisan #FixNICS Act is also supported by the @NSSF and the @GLFOP"]["We must all do our part to prevent another disaster like #SutherlandSprings from happening again. Thanks to @SenatorTimScott, @senorrinhatch, and @SenDeanHeller for the support to #FixNICS"]["For years, agencies and states have failed to upload criminal critical records to NICS without consequence. I introduced the #FixNICS Act with bipartisan support to fix this systemic problem."]["Thanks to Senators Murphy, Scott, Blumenthal, Hatch, Feinstein, Heller and Shaheen for being original co-sponsors https://t.co/Sb1Tf9ub3g"]["Ex-Homeland Security official: FISA checks on known terror suspects are a matter of life and death https://t.co/DkloNU960R #FoxNews"]["Soon to also be endorsed by premier law enforcement organizations in the USA https://t.co/4M0s99L71j"]["16 high-tech F-35B stealth fighters now deployed to Japan https://t.co/D6PAjhJB6d"]["https://t.co/AX5BEO9iVj"]["We’re not doing enough to patch up the NICS background check system https://t.co/yfNgi5Mrov"]["Oracle backs tougher foreign investment bills aimed at China https://t.co/pjcO0nKc2S"]["Ranking member Wyden on Senate Finance Committee voting Sen Menendez by proxy on tax bill"]["Senate Considers Staying in Session After Dec. 18 https://t.co/1ErwWcukSb via @RollCall"]["Good news: Senator Johnson will work with colleagues with a goal of improving the bill to a form he can support https://t.co/yzOLdGz94n"]["Everything That's In The Senate Tax Reform Bill via @forbes https://t.co/AmaMnATInx"]["China sending envoy to North Korea following Trump visit https://t.co/ymkknpMROb"]["What could go wrong? U.S. Hires Company With K.G.B. Link to Guard Moscow Embassy https://t.co/Vq7CJCIaR9"]["Guess who was answer to Jeopardy question? https://t.co/piFeUmkv0g"]["Jeff Sessions: DOJ is conducting 27 investigations into classified leaks https://t.co/COUZgo2pCS via @dcexaminer"]["Talking #Harvey relief with my friend Mayor Sylvester Turner of Houston https://t.co/FLtYfCRdPD"]["CFIUS Reform and U.S. Government Concerns over Chinese Investment: A Primer https://t.co/1izhU9Kxd3"]["Texans could keep an additional $2,558 under the Senate #TaxReform plan, and gain as many as 76,949 additional jobs statewide https://t.co/HzY8QGIdiz"]["Mike Crapo announces bipartisan Senate deal on rules relief for regional banks https://t.co/EN6p67qNRn via @dcexaminer"]["Surveillance cameras made in China with government backing are hanging all over the U.S.     https://t.co/OgaUJchbKI via @WSJ"]["Perez, Senate Democrats Won’t Say if Menendez Should Leave Senate if Convicted in Corruption Case https://t.co/n8NqbDozH1"]["China Enlists Western Media to Spread Its Message - WSJ https://t.co/hYvIHWAFPG"]["Trump backs U.S. intelligence agencies when asked about Russian meddling  https://t.co/laiLSpKfln via @WSJ"]["First Baptist Church in Sutherland Springs, Texas reopens as a memorial  https://t.co/MzZlMcjnYY via @WSJ"]["GOP bills remove some of the tax code’s complexities  https://t.co/wzgPHPUFof via @WSJ"]["In ‘Watershed Moment,’ YouTube Blocks Extremist Cleric’s Message - The New York Times https://t.co/jx05MSQ4Wx"]["The biggest threat to the Trump economy is his trade agenda https://t.co/jAXMXgmzQB via @WSJOpinion"]["Middle class biggest winners in Senate tax plan, study says via @POLITICO for iOS https://t.co/CK0Lq1HHhO https://t.co/Tzq7OwEQXR"]["Fewer ppl will need to itemize due to doubling standard deduction - 1 in 10 https://t.co/ZIXiemSsxC"]["So much for Sen Arthur Vandenberg’s admonition that we must stop “partisan politics at the water's edge.” https://t.co/sQEDpS50tM"]["Texans and the nation are standing with the First Baptist Church of #SutherlandSprings today. https://t.co/YT6xEpjbxK"]["After Irma and Maria: How 3 Spots on the U.S. Virgin Islands Are Faring https://t.co/yVVMQI6fCa"]["At San Antonio’s Fort Sam Houston, ceremonies bring thoughts of loss and renewal https://t.co/KSsH8cfoOt via @expressnews"]["https://t.co/UWtGC2hya5"]["#VeteransDay https://t.co/liIYwDNs5D"]["Can we have a serious conversation after Sutherland Springs? https://t.co/B9V5XI4ib9 via @HoustonChron"]["Thanks to @OpFinallyHome for recognizing U.S. Army Sgt. Jason Castille’s service to our nation.  #VeteransDay https://t.co/yA4Liw11Ch"]["Great to visit with some of our nation's finest heroes at Fort Sam Houston #VeteransDay ceremony in San Antonio https://t.co/W6T142fAwz"]["Legacy Vets told me they want #TaxReform at Ft Sam Houston Veterans Day celebration. https://t.co/X1taxeH0Q7"]["New citizens being sworn in at Veterans Day celebration at Ft Sam Houston, San Antonio https://t.co/3Eq7X5MQTD"]["Records paint portrait of a troubled man, but not everyone saw bad in Devin Kelley https://t.co/XvdU44FIqU via @expressnews"]["FBI database for gun buyers missing millions of records https://t.co/57kAUcfyQn"]["Spurs vs Bucks. Antetokounmpo has to be the best name in basketball today"]["Cornyn, Cruz angered by ‘systemic failure’ to care for veterans https://t.co/0QzUNbGxIL via @RioGGuardian"]["Proud to support the PAWS Act to help @DeptVAaffairs partner with nonprofits to pair disabled veterans with service dogs. Jazz &amp; Barney, trained by @PatriotPaws, showed us a few of their tricks to help vets coping with PTSD in Houston https://t.co/Z7Dspb0Xqj"]["Thanks to the folks at @combinedarmstx for your hospitality today, and for all you do for Houston-area veterans https://t.co/NsClO2P4HT"]["https://t.co/gehUReuHjc"]["Harvey-flooded Houston hospital to stay closed permanently, affecting up to 479 jobs https://t.co/yiaJDUomtJ via @HOUBizjournal"]["WATCH LIVE: Sen. John Cornyn speaks about PAWS legislation to help veterans get service dogs https://t.co/eE5gwjCL3y via @CW39Houston"]["Faithful since 1775. Happy Birthday to the @USMC https://t.co/1LYGcIoZ1a"]["Tax Reform Passes the Fairness Test https://t.co/Nza8R4RmCo"]["https://t.co/5iceAUcDR8"]["https://t.co/afQSI6h6D7"]["China Spreads Propaganda to U.S. on Facebook, a Platform It Bans at Home https://t.co/n22u17hyZI"]["#SutherlandSprings #NeverAgain #fixbackgroundchecks https://t.co/QxEpoET3c5"]["CBO: Obamacare mandate repeal would cut deficit by $338 billion  https://t.co/HoE6fuHJWT"]["George Soros Continues to Quietly Pile Up Wins in District Attorney Races https://t.co/QdJ3q6wwK2"]["Thanks to the Shriners Hospitals for Children for all the terrific work you do https://t.co/cYZkJrSDa6"]["Stephen Willeford shot the Texas church gunman and prevented further loss of life https://t.co/QApmlGRCpk"]["Chinese telecom threatens U.S. security, writes @PextonPB  https://t.co/S1I7HMX8SC via @WSJOpinion"]["China’s Technology Ambitions Could Upset the Global Trade Order via @NYTimes https://t.co/JQBOHREoJ4"]["In tax debates beware faulty numbers: Retracting Estimates: https://t.co/7OMRhKLwVh via @TaxPolicyCenter"]["Where’s the U.S. Beef? In Seoul’s supermarkets, writes Craig Uden of Beef USA   https://t.co/dCXWEBdnge via @WSJOpinion"]["Bad Marks for a Good Military: The Bergdahl sentence and a Navy report are dispiriting. https://t.co/J5PRXZ8OEG via @WSJOpinion"]["Plumber With a Rifle: neighbor saves lives in Texas with a legal gun and some quick action. https://t.co/AeJd7f7EbX via @WSJOpinion"]["Senate panel to hold hearing on bump stocks https://t.co/KCDDq8KUzn"]["https://t.co/znCVVcmWS6"]["WSJ: The unemployment rate for adults without a high-school diploma is at the lowest level in recent history."]["A domestic violence conviction disqualifies gun purchaser on background check #SutherlandSprings  https://t.co/8vskggpkNI"]["Facebook Says It’s Policing Fake Accounts. But They’re Still Easy to Spot. https://t.co/oFKqYw6a4u"]["https://t.co/qNKD7zqnNn"]["Bloomberg: Technology companies reversed their opposition to legislation aimed at squelching the online trafficking of children"]["If the shooter was dishonorably discharged, federal law prohibited him from buying or possessing any firearms #SutherlandSpringsShooting"]["Talked to Gov Abbott on the scene.  Also talked to Sheriff Joe D. Tackitt, Jr. &amp; offered any assistance we might be able to provide https://t.co/JvE8eM8We9"]["Truly heartbreaking news in #Sutherland Springs. Please say a prayer for First Baptist congregation, first responders &amp; the community there"]["Kremlin Cash Behind Billionaire’s Twitter and Facebook Investments, via @nytimes https://t.co/7nStpz2X4e"]["Show up for committee markups, offer amendments, and vote.  Pathetic excuse. https://t.co/sDFh7klwOA"]["Democrats should join us and make it bipartisan and permanent, not just criticize. https://t.co/7FUe4G3bQ6"]["Hang on.  The bill hasn’t passed either the House or Senate yet. https://t.co/AFABuS0gFh"]["How Russian Bots and Trolls Invade Our Lives — and Elections https://t.co/aNwjI9e3ia via @nytvideo"]["‘Transcendental Nonsense’ and Technology Companies: Reframing the Content Regulation Debate https://t.co/TUTU3LPyR9"]["Dems’ plan to tank Trump’s tax bill https://t.co/YInGWtKQAI via @politico"]["Mitch McConnell expects bipartisan DACA-legal immigration deal https://t.co/go4wswbVLX via @dcexaminer"]["The swamp fights back: Lobbying Frenzy Begins on Tax Bill https://t.co/1dnf4wqQ9I"]["Bipartisan bills expected to toughen U.S. foreign investment rules https://t.co/95YlszdPst"]["https://t.co/YsCrM7ivlq"]["9 Weeks After Harvey, Houston Celebrates World Series Win https://t.co/MlZrkPLtal"]["Senate will chart its own course: Six Charts That Help Explain the Republican (House)Tax Plan https://t.co/LiPqnFBIsZ"]["Double taxation https://t.co/P09U6KMsqJ"]["Senate confirmation blitz includes 16 ambassadors, 11 other Trump appointees https://t.co/5I1a3L8SHv via @dcexaminer"]["Senate Democrats falsely claim GOP tax plan will raise taxes for most working-class families https://t.co/xKdYQZHDPe"]["WSJ on tax reform: “This is the first serious simplification of the tax code since 1986, and the Swamp is fighting back.”"]["https://t.co/ktts0L5XBq"]["An India Reform Milestone https://t.co/0pt9ODKT5W via @WSJOpinion"]["@Dodgers vs @Astros now"]["Trump to huddle with GOP senators Thursday to discuss immigration reform https://t.co/gSCxBXOFdf via @dcexaminer"]["Senators demand more action from tech firms on Russian election meddling https://t.co/r32RUZSKrB"]["Well done: Houston's 'Mattress Mack' sends Hurricane Harvey first responders 2 World Series - ABC News - https://t.co/ugGJi8i1Ci via @ABC"]["Senate Intelligence Committee hearing on Russian influence on 2016 election using social media https://t.co/YWIwDur6TZ"]["Senate Republicans threaten rules change to clear Trump nominees https://t.co/rRt5p62R3l"]["Chuck Grassley calls for upgrades to foreign agents registration law https://t.co/slC0VyptW8 via @dcexaminer"]["Unprecedented obstruction by Senate Democrats on presidential nominees https://t.co/Ieh1wgfOyB"]["FBI watched, then acted as Russian spy moved closer to Hillary Clinton https://t.co/0OFlDeRwXS"]["CFPB cares more about class action trial lawyers than consumers: Cordray calls on Trump to veto arbitration override https://t.co/mSQdgDz0L0"]["The sudden fall of Washington's ultimate powerbroker https://t.co/DgJQmCytkB via @politico"]["I have been contemplating the phenomenon for some time.  Thanks for writing it down. https://t.co/VKA5bRrGGw"]["A headline in a popular DC political rag: \n“READ PEOPLE WHO ACTUALLY KNOW WHAT THEY'RE TALKING ABOUT”  As distinguished from those who don’t"]["Russian Influence Reached 126 Million Through Facebook Alone https://t.co/dLXyqOWxFW"]["Gov. Abbott to meet congressional leaders Tuesday on Harvey aid https://t.co/4ZaIAmXHGw"]["https://t.co/eGXKArW1xl"]["Podesta Group among two companies anonymously ID,d as lobbyists for Ukraine in Paul Manafort https://t.co/PWIadBnDgg via @dcexaminer"]["Enjoyed meeting Secretary of Labor Alex Acosta https://t.co/yWqwYV8KtY"]["The Senate Will Confirm Federal Judicial Nominees https://t.co/kdemZTU3XZ"]["Communist Party push into foreign companies in China mixes business and politics   https://t.co/SxBf0XbhJ3 via @WSJ"]["Afghan Taliban Awash in Heroin Cash, a Troubling Turn for War https://t.co/cfX95uejYa"]["Russia Uses Its Oil Giant, Rosneft, as a Foreign Policy Tool https://t.co/5ufbBFoJJ6"]["Trump’s states need Nafta, writes @MaryAnastasiaOG https://t.co/nXYtlxlMVn via @WSJOpinion"]["Toomey’s ‘Guidance’ Repeal Guide https://t.co/UuR5PEMVic via @WSJOpinion"]["Twitter Ends Relationship With RT For Election Influence, But What About Other Media Outlets? https://t.co/8xZbKwYqcv via @dailycaller"]["Two Pinocchios: Nancy Pelosi's claims on middle-income taxpayers and state and local tax deductions https://t.co/8SY7sgykmy"]["Unacceptable https://t.co/7yQsgOC1hp"]["‘Houston Strong’ indeed: A city put to the test has a team up to the task https://t.co/bLMJ4PIYIy"]["Never forget #HurricaneHarvey https://t.co/sU3djRfSee"]["Boy Scouts to the rescue in Tyler, Texas. https://t.co/3gzyCvM4bv"]["Hearing Amazon’s Footsteps, the Health Care Industry Shudders via @NYTimes https://t.co/SQDYBvHXWW"]["North Korea and the Threat of Chemical Warfare https://t.co/APxwqmRM5K"]["Today is National Rx Drug Take Back Day. Dispose of old drugs safely. Find a site near you --&gt; https://t.co/LkDZJeE3s7\n#DrugTakeBackDay"]["Culmination of years of planning and prep: GOP plans tax blitzkrieg - https://t.co/Xg3wthS6ol"]["Charter and Traditional Schools Find a Common Purpose in Texas https://t.co/jAUm51OiJo"]["https://t.co/gz3dMSpA0Z"]["More members of Congress should take a look https://t.co/YGUQqcFC4n"]["Incredible first-ever @Astros WS win last night. On to Minute Maid. #HoustonStrong #EarnHistory"]["EDITORIAL: Delay on FEMA trailers, federal aid is not acceptable https://t.co/iATUk76TBR via @BmtEnterprise"]["GOP lawmakers plan to unveil bill raising scrutiny of foreign investments, aiming at China  https://t.co/2l6U0hvVVz via @WSJ"]["Great job by @BradPaisley on national anthem at Astros vs Dodgers game."]["Two House Panels Launch Investigation Into FBI’s 2016 Decisions https://t.co/SRSJPfKWXW"]["U.S. Secretary of State Rex Tillerson urges Pakistan crackdown on militant havens https://t.co/6Gg8yqqFIZ via @WSJ"]["Twitter to disclose info on political ads as Russia scrutiny intensifies https://t.co/O7ak5eIGgP via @11AliveNews"]["Thanks to @VP Pence for supporting consumers over trial lawyers, allowing fair, efficient, cost-effective dispute resolution via arbitration"]["Mystery solved: Clinton campaign, DNC paid for research that led to Russia dossier https://t.co/a1P7NhvNNS"]["https://t.co/SGphUbFGRE"]["Senate GOP pushes to repeal consumer bureau arbitration rule https://t.co/nwoMsf8wSG"]["The Trump administration increased heat on CFPB’s arbitration rule  https://t.co/jYfh62RZA0 via @WSJ"]["Russia news outlet RT, a Kremlin ‘propaganda’ tool, thrives on YouTube, Facebook, Twitter https://t.co/VNrxZV0R0I via @WSJ"]["Argentina Votes for Change  https://t.co/vbsbf0xjiQ via @WSJOpinion"]["Et Tu, Steve Bannon? by @wjmcgurn https://t.co/wmEcTzaGTY via @WSJOpinion"]["Why should federal taxpayers subsidize high-tax states? https://t.co/JteXqlk9cx via @WSJ"]["Dallas Fed chief to Texas business leaders: Don't blame job losses on NAFTA and immigration https://t.co/MW8d1aadoN via @SABizJournal"]["Richard Cordray’s Bad Numbers https://t.co/MSnMsYj6YL"]["Still Waiting for FEMA in Texas and Florida After Hurricanes https://t.co/DiVeakdoee"]["Congratulations @astros! AL Champs and World Series bound. #HoustonStrong #EarnHistory"]["Ronald Reagan signed the Tax Reform Act of 1986 31 years ago today. (Playbook)"]["Iran Saps Strength of Revolutionary Guards With Arrests and Cutbacks https://t.co/JfLZ1VOY8S"]["Go @astros"]["Push for criminal justice reform grows in Senate https://t.co/6535R9asOU via @dcexaminer"]["See 111-year-old WWII vet Richard Overton's home makeover https://t.co/EHfhxq0oc1"]["How Fiction Becomes Fact on Social Media https://t.co/g6841TGNmu"]["Feel despondent over the state of political discourse? Don't forget to adjust for Russian trolls, writes @conor64: https://t.co/2UZwKliZF0"]["Wonderful evening with @TFRW friends working to #KeepItRed! #TFRWLeads #TFRWDallas17 https://t.co/jXR1FuUSdl"]["U.S. Sen. John Cornyn addresses Texas Rose Festival men's luncheon - https://t.co/07IPUz6SZB https://t.co/qPX385qGzp"]["Great to visit my friends beyond the pine curtain today at the 84th annual @TexasRoseFest in Tyler! https://t.co/PHWx0kdHxH"]["Thanks to Sec Ben Carson of HUD for releasing $50+ M in Community Develop. Block Grants $$ to aid #harvey recovery @GovAbbott @SenTedCruz"]["Amen https://t.co/pPNEcgRDPK"]["It isn't tax cuts but runaway mandatory spending that mainly cause deficits and debt https://t.co/hloejOXNXD"]["Solely to ensure the next #Harvey aid request from OMB will satisfy Texas's needs IDed by @GovAbbott @tedcruz &amp; me https://t.co/HIn4qWU3Z0"]["Congratulations to the RBIs of Texasl https://t.co/AZpALyZq6q"]["“The great advances of civilization ... have never come from centralized government”(2/2)"]["“The preservation of freedom is the protective reason for limiting and decentralizing governmental power..\"Milton Friedman\n(1912-2006)(1/2)"]["Trump Signs Cornyn Bill To Protect Seniors From Financial Exploitation https://t.co/wb1AT3r9sp"]["Push for criminal justice reform grows in Senate https://t.co/6535R9asOU via @dcexaminer"]["Trump agrees to new Harvey relief funds for Texas https://t.co/pqPlyQUyq8 via @houstonchron"]["US Senate took first step toward middle class tax relief and more take home pay, by passing budget resolution tonight"]["Trump to take up Texas' Harvey aid request in November https://t.co/V2BTdaSLok via @dallasnews"]["Cornyn extracts Trump pledge of Texas hurricane aid https://t.co/5ojfAIxrDE"]["Negotiators should recognize the net pluses of NAFTA https://t.co/c0GP4vQ8Dw via @mySA"]["https://t.co/p9ywzzG5qQ"]["Rex Tillerson says U.S. is India’s best partner for the future https://t.co/1J3kNMXWwA via @WSJ"]["Important speech by FBI director that every member of Congress should read https://t.co/EVWoHCmARP"]["Gulf Coast mayors discuss the impact of Hurricane Harvey https://t.co/z03tCbxYMs via @TexasTribune"]["Cochran returns to the Senate https://t.co/bEL89xART9"]["DOJ Indicts Two Chinese Drug Producers in Fentanyl Distribution Case https://t.co/aF4G2YDMFE"]["Video+Story: Cornyn – Modernize, Don’t End, NAFTA via @epheraldpost https://t.co/964p9gZhVS"]["It was a failure of Obamacare. The program was not appropriated by Congress. https://t.co/wjFfaLSspd"]["The South Texas Fajita Bandit Has Finally Been Caught https://t.co/18DRMIShEh via @TexasMonthly"]["Senate Budget Committee: A return to historic average growth would decrease projected deficits by over $2 trillion in the 10-year window"]["Army Sgt. Bergdahl pleads guilty to desertion, misbehavior   https://t.co/rThV4oacMK"]["State says Harvey's death toll has reached 88 https://t.co/WQCWjkAULK via @TexasTribune"]["Nafta Needs an Update, Not Repeal https://t.co/PGzo8dU39t"]["Wind power to overtake coal power in Texas https://t.co/drMs7g6Z8N via @dcexaminer"]["Fraud Scandals Sap China’s Dream of Becoming a Science Superpower, via @nytimes https://t.co/ZAByfpUXk5"]["@POTUS nominee for Secretary of @DHSgov Kirstjen Nielsen has considerable experience. Looking forward to discussing plan on border security"]["Bipartisan agreement on healthcare might finally come, at least on this one issue https://t.co/0AvTXVLApi via @dcexaminer"]["Texas Comptroller: Texas sees 80,000 new students each year in the public schools, 600 new residents each day"]["Congrats to the @Astros for the big win last night. On to the #ALCS! #EarnHistory #HoustonStrong"]["My thoughts are with the @TexasTech community today and the loved ones of the fallen TTUPD officer #PrayersForTexasTech"]["Germany’s Angela Merkel Agrees to Limits on Accepting Refugees https://t.co/6bxemElQRE"]["No law would have stopped Las Vegas shooter, Feinstein says https://t.co/VWF99BvH3m via @politico"]["'Like a family reunion': Veterans join Bush for bike ride at his Texas ranch https://t.co/WKJjtS1c9r via @dallasnews"]["9 GOP senators ask ATF to review gun 'bump stocks' via @POLITICO for iOS https://t.co/jmQXagdzvg https://t.co/QVHb7wZC3i"]["Another Storm: Now a Hurricane, Nate Is Aiming for Gulf Coast https://t.co/jgy6ibPcze"]["The Culture of Death—and of Disdain https://t.co/2Pl1yfXTeE"]["Cornyn calls for review of bump stocks https://t.co/zcrkgJAA27 via @houstonchron"]["Three more Senate Democrats will donate campaign contributions from Harvey Weinstein to charity https://t.co/v6QjzX546K via @dcexaminer"]["ALERRT center @TexasState is leading on active shooter training &amp; POLICE Act, opened funding for EMS too #saveslives https://t.co/pjuvaunbFp"]["Three Trump Nominees Pass Senate Judiciary Committee Hurdle https://t.co/5QYPFgxyEy"]["Obamacare might not be dead, but IPAB should be https://t.co/xUbofs1hgi via @dcexaminer"]["Texas delegation, Abbott request $19 billion in federal aid for Harvey https://t.co/dmjaLQs1aZ via @dallasnews"]