["To our brothers, sisters, and friends in immigrant communities at home and across the world, know that we stand with you. Immigrants don’t just belong in America, immigrants have helped build America."]["At my first hearing as a member of the Senate Judiciary Committee, I pressed the judicial nominee for the District of Utah, Howard Nielson, Jr., on his history of standing against the rights of LGBTQ Americans. \nhttps://t.co/gzqvWRl5bA"]["Are you also following me on @Snapchat? If not, you should! Get behind-the-scenes content, important news, and more. https://t.co/006maF6O6g"]["The FCC vote to repeal #netneutrality was disastrous, but we still have a very real chance to save the free and open internet. \nhttps://t.co/GYYrRvjIAy"]["HBCUs have nurtured and challenged generations of students (myself included) — and provided them with the tools and confidence to succeed. That’s why I am proud to cosponsor the HBCU Capital Financing Improvement Act.\nhttps://t.co/5XwTFdHvpY"]["On #HumanTraffickingAwarenessDay, we must recognize the millions of men, women, and children who are exploited for their bodies and their forced labor. It’s our obligation to dismantle trafficking networks and help survivors rebuild and reclaim their lives."]["We need to keep up the fight against mass incarceration. With the opioid epidemic raging across our country, we don’t need another war on drugs — we need to address drug addiction."]["Congress must pass the #DreamActNow. Dreamers are counting on us to stand up for them. \nhttps://t.co/sOSac5FE61"]["Protecting our coastline is one of my top priorities. Sign my petition today opposing Trump’s plan to expand offshore drilling in California and across the country &gt;&gt;&gt; https://t.co/T1c2FmOSJ1"][".@kyrstensinema has the courage to stand up on behalf of working people and the most vulnerable among us. She has a real chance to win in November. Chip in now: https://t.co/6nK7RoQI4M"]["Yesterday I joined my colleagues in writing Interior Sec. Zinke, urging him to abandon the Trump Administration’s proposal to reopen offshore drilling, which is an ill-advised effort to circumvent public and scientific input. We can't allow corporations to pollute for profit."]["Across the Golden State, we have Dreamers living in fear that they’re going to wake up to a knock on the door in the middle of the night and face deportation. This shouldn’t be who we are as a nation. Let’s pass the #DreamActNow, and give them peace of mind."]["Heartbroken to hear this news. Keeping the families and friends of those impacted in my prayers. \nhttps://t.co/M8F3MorNwC"]["This ruling, while important, isn't a lasting solution. Congress needs to act immediately to ensure that Dreamers, who are Americans in every respect except on paper, are provided with permanent protection from deportation. #DreamActNow\nhttps://t.co/fGUaav5xJR"]["Dreamers should not be a bargaining chip used by this Administration to build a wasteful border wall. Period."]["A target has been put on California’s back by this Administration — we won’t stand for it.\nhttps://t.co/zLT6KQpfrw"]["Secretary Zinke must also abandon his efforts to drill along California's beautiful coastline — protection of our ocean shouldn't depend on the D, R, or I after the governor's name. \nhttps://t.co/SJjb5CbVMC"]["Yesterday the Trump Administration announced they’re going to put 200,000 Salvadoran immigrants at-risk of deportation. Add your name if you agree this decision is callous: https://t.co/FN3wQChxFF"]["It’s been more than 100 days since CHIP expired. More than nine million children rely on this program for health care. It’s inexcusable the GOP hasn’t passed long-term funding. \nhttps://t.co/nO3HWby40j"]["Honored to be named to serve on the Senate Judiciary Committee and determined to continue the fight for justice, equality, and be a voice for the vulnerable."]["Disgraced sheriff Joe Arpaio, convicted of violating a court order to stop illegally detaining and terrorizing the Latino community, is running for U.S. Senate in Arizona. Donate to @kyrstensinema, a champion for all Arizonans: https://t.co/u40p0g6mfQ"]["Back on Track, an initiative to prevent recidivism among nonviolent, low-level drug defendants, reduced recidivism for the participants to fewer than 10% — the statewide average was 50%. \n\nA look at some of my criminal justice reform work throughout my career: https://t.co/9xe5SrxODH"]["An estimated 3M gallons of crude oil created a massive oil slick on our beautiful shore during the Santa Barbara oil spill. We said we’d never allow this to happen again, yet the Trump Administration wants to expand offshore drilling. We must stop it."]["An often-overlooked part of natural disasters is the mental health toll on survivors. \nhttps://t.co/GnjUtWgg7W"]["In 11 days, funding for children’s health insurance will start running out for some states. It’s shameful this usually bipartisan program has become a political football. Our kids will pay the price for this.\nhttps://t.co/67UbuTj7h9"]["My colleagues and I are calling on the Trump Administration to reject the Department of Justice’s request to include a citizenship question on the 2020 census. This would hinder a full and accurate count of the U.S. population. \nhttps://t.co/uDDH6x6ZWC"]["Republicans in Congress must stop playing politics with the lives of Dreamers. #DreamActNow\nhttps://t.co/hPXtwa9Ghn"]["This shouldn't be who we are as a country. \nhttps://t.co/SoBQsU6cyC"]["Flu season this year has hit California particularly hard. Here are a few ways to protect yourself and your family: \nhttps://t.co/FFbjuOOmy1"]["You need to watch this 👇🏾\nhttps://t.co/4jyrVJ7dWk"]["More El Salvadorian TPS recipients call California home than any other state. Turning our back on them is cruel.  \nhttps://t.co/WBL9px2HLW"]["\"A new day is on the horizon, and when that new day finally dawns, it will be because of a lot of magnificent women and some pretty phenomenal men fighting hard to make sure they become the leaders that take us to the time when nobody ever has to say #MeToo again.\" —@Oprah ✊🏾"]["Sessions should be focusing on issues like transnational criminal organizations and investigating and prosecuting human trafficking, not going after Californians who are using recreational and medicinal marijuana."]["#AskHerMore is about elevating the conversation about women in Hollywood to focus on their accomplishments and careers, not just what or who they are wearing. \nhttps://t.co/O7BX4mmBGM"]["Every single day we need to fight for a $15 minimum wage and paid leave, because we’ve got to make sure employees won’t be fired if they take a day off to care for a sick child or parent."]["Republicans made their legislative priorities pretty clear when they refused to pass a long-term solution for CHIP, jeopardizing the health coverage for millions of kids and pregnant mothers."]["Many Dreamers were brought into the United States by their parents and have only known this country as home. As I’ve said, when we use our voices, we’ve got the power. Let’s raise our voices to pass the #DreamAct."]["To anybody who thinks that passing the Dream Act is not an emergency: More than 14,000 Dreamers have lost their DACA status. So many of them fear a midnight knock on their door that would tear them away from their families. #DreamActNow"]["Sessions needs to leave grandma’s medical marijuana alone. \nhttps://t.co/IXoMHqOSeO"]["Congratulations, @Essence for nearly 5 decades of putting black women at the forefront of the news, entertainment, and motivation. \nhttps://t.co/14HuRqRVTK"]["We must recommit to mothers everywhere to fight for black women’s maternal health and rights. https://t.co/nakoBx7LQn"]["Jeff Sessions should spend less time targeting recreational marijuana users and more time going after transnational drug cartels and violent crime. Add your name if you agree: https://t.co/eZd0dWJf1H"]["In 1969, California experienced one of the worst oil spills in U.S. history. The spill in Santa Barbara had a devastating impact on the marine life and the environment. We can’t let that happen again by opening up our coastal waters to oil and gas companies for drilling."]["Many DACA recipients were young children when they were brought here, some before they could walk or talk. It’s up to Congress to now pass the #DreamActNow and ensure they can continue to live in the only country they have known."]["Using children who grew up in this country as a bargaining chip to pay for an unrealistic border wall is shameful. \nhttps://t.co/LmBVdscuv3"]["Here’s why the U.S. Census matters: When communities in need are undercounted in the census, they may receive less legislative seats and less federal funds.\nhttps://t.co/8intoslUbV"]["The government has a basic responsibility that when disaster hits anywhere in America, we help rebuild. Yet it has been over 100 days since Hurricane Maria hit Puerto Rico and the U.S. Virgin Islands, and there are still millions of people left without power."]["Sign my petition if you agree: we cannot bring back the worst days of the War on Drugs → https://t.co/eZd0dWJf1H"][".@Malala is right, investing in the education of women and girls around the world is an investment in the future of our world. \nhttps://t.co/b2BPyoz9Kr"]["Here’s the deal: We need to advance meaningful criminal justice reforms that will reduce harmful drug use, reduce mass incarceration, and bring smart on crime policies to the forefront of our criminal justice system."]["Despite this administration's attempts to sabotage the Affordable Care Act, signups for 2017 far surpassed expectations. \n\nLet's be clear: The American people want the ACA. It's up to the Trump Admin to continue to ensure all Americans have access to affordable health care."]["I am so encouraged by the activism I saw in 2017. From sharing your #MeToo stories, to those who marched for the first time (or the fifteenth), we demonstrated the power of the people. Keep it up this year. \nhttps://t.co/7BEuawBQx5"]["Nearly nine million children have their health care coverage hanging in the balance as funding for CHIP dwindles. Congress must do the right thing and pass a long-term solution that protects children and pregnant mothers."]["Congratulations to the team at @actblue for surpassing $2 billion raised for Democratic candidates and organizations. An amazing achievement. Small-dollar donors are the heart and soul of our party — and why we’re going to win in 2018! https://t.co/LvJ4VKvnt9"]["With Dreamers stuck in a state of limbo, every single day that Congress doesn’t act matters to their lives. We must be compassionate and pass a clean Dream Act."]["Passing the Secure Elections Act will protect our election systems against attacks by foreign actors. We must ensure what happened during the 2016 election never happens again. \nhttps://t.co/sEH0IZiBmb"]["Our fundamental right to vote must be strengthened and protected at all costs. We must modernize voter systems, strengthen protections against discriminatory laws, and expand early voting."]["This is an incredibly harmful move by an Administration that is already doing everything it can to wreak havoc on our environment. Offshore drilling poses a grave threat to the health and well-being of Californians and we must stand up for our natural resources and public health. https://t.co/Zk0Jc1yTIe"]["Instead of going after drug cartels, and violent crime, and major traffickers, Attorney General Jeff Sessions is going after recreational marijuana users. That’s not being smart on crime.\nhttps://t.co/BNlcxbTT4v"]["While this earthquake left no reported major damage, this is a good moment to make sure you’re prepared in case another earthquake strikes: https://t.co/yeutWLMqM0\nhttps://t.co/I9ZRb1vjy1"]["We have a duty to hold Wall Street accountable and defend consumers from fraud and abuse.\nhttps://t.co/jlLOvz94bi"]["Signed on to @SenMarkey’s bill to reverse the repeal of #NetNeutrality rules, which would ensure all voices online stay equal and the gatekeepers of the internet can’t tilt the competitive playing field."]["We promised Dreamers that if they gave us their information, led a lawful life, and contributed to their communities, they would be protected from deportation. With the announcement of the end of DACA last year, Congress must pass the #DreamActNow."]["Accurately counting every single American in the U.S. Census is critical to our nation’s future. This is alarming. \nhttps://t.co/DaEIHGlVLd"]["Today marks one year since I was sworn in as California’s U.S. Senator. It’s a privilege to serve our great state and I am looking forward to what the next year brings. From protecting our environment to civil rights, you can count on me to keep fighting for you."]["Trump’s voter fraud commission was a shameful attempt at voter suppression that should have never existed in the first place. This is a win for voters across the country.\nhttps://t.co/7lIbndnAoa"]["Congress must act to ensure the integrity of our elections by fortifying our election systems against attacks by foreign powers. There’s no time to waste. \nhttps://t.co/oLJgjwBJ9M"]["In 2017 you stepped up &amp; took action with our petitions. The highlights: \n💻 811,278 of you defended net neutrality\n🏥 559,647 of you fought to save health care\n🚫282,131 of you took action against the Muslim ban\n\nAnd you raised over $2M for 2018 candidates &amp; disaster victims."]["As of today, there is a record number 22 women serving in the Senate. We still have a long way to go, which is it’s critical we elect more women into office and ensure we don’t lose any of my fellow Democratic colleagues this November → https://t.co/OAR2tVynP1"]["On the to-do list for this month: Disaster aid funding. Passing the Dream Act. Long-term funding for CHIP and funding for community health centers. We have a lot of fights ahead. It’s critical you stay engaged. Keep calling Congress: (202) 224-3121."]["Congratulations @GDouglasJones and @tinaflintsmith on being sworn into the Senate today. I look forward to working with you and your staff on everything from education to health care access."]["The for-profit prison business is a billion dollar industry. We can’t let corporations keep exploiting human lives for profit."]["It’s coming up on four months since Trump rescinded DACA. Since September, more than 14,000 Dreamers have lost their DACA status. This Administration won’t help Dreamers so Congress must pass the #DreamActNow."]["Climate change is a reality we must confront. We cannot abandon our environment at this critical moment in time."]["It’s vital that we remain invested in coalition building and vigilant in defending our values in the new year."]["I stand with women across every industry to say #TIMESUP on abuse, harassment, marginalization, and underrepresentation. Join me: https://t.co/Kky09bQvUP https://t.co/tnHAkKYnxP"]["May every single day of 2018 be filled with love, happiness, and joy. Wishing you and your loved ones a fabulous new year. https://t.co/29VNNtOecy"]["Across all communities, we must stand together, arm-in-arm in the new year. We will leave no one to fight alone."]["As San Francisco’s District Attorney and CA’s Attorney General, I helped make California the first state to outlaw the “gay/trans panic” defense. I am proud that Illinois is joining California in ending this reprehensible defense and am hopeful other states will follow suit. https://t.co/RRTCjRYUT5"]["Perseverance and love lead to one of the most recognized Latino establishments in Oakland. \nhttps://t.co/sAoEzwjGDs"]["Saddened to hear of the passing of activist Erica Garner. Keeping her family in our prayers during this difficult time. May we all continue her fight for social justice."]["2017 was a trying year for so many, but I am greatly encouraged by the activism and enthusiasm I’ve seen. From people who marched in the streets to those who made phone calls and more, we showed the power of the people. Let’s keep it up. https://t.co/Fba7hIq2rk"]["Passing the Secure Elections Act is vital to ensuring the Russian interference during the 2016 election never happens again. \nhttps://t.co/cqNBYWvv9d"]["Let’s be clear: prevention, not reaction, is one of the best and most effective ways to reduce crime. It’s key to a smarter and fairer criminal justice system."]["A good motto for 2018: “If they don’t give you a seat at the table, bring a folding chair.” —Congresswoman Shirley Chisholm"]["Instead of wreaking havoc on our health care system, we owe it to the American people to come together and solve real problems."]["When talking about people who shared victims’ private images and information online without consent, “revenge porn” isn’t an accurate term. It suggests there is a legitimate reason to lash out and that the victim agreed to public distribution — neither of which is true."]["I reject the false choice that you can either have a strong economy or a strong environment. We can do both."]["Bring on 2018 ✊🏾✊🏼✊✊🏿✊🏽✊🏻\nhttps://t.co/y170Cn9aQI"]["Climate change is real and it poses a grave threat to our nation and our planet. It’s abundantly clear this Adminstration won’t tackle climate change head on, so state and local governments must. https://t.co/mrH5zlpyJD"]["According to the CDC, Black mothers are 243% more likely to die from pregnancy or delivery complications than a white woman. This is in America, not a developing nation.\nhttps://t.co/nbBtIzzxF0"]["Text FEARLESS to 225568 to stay up-to-date with what’s happening with health care, criminal justice reform, and more. https://t.co/WtmLR89yUv"]["Change is coming. Make a difference in your community and run for office. \nhttps://t.co/Jxdfa1oQrq"]["When voters witnessed an assault on our deepest values, on our commitment to equality, to fairness, and to justice — they fought back at the ballot box. Let’s do the same in 2018."]["I remain committed to fighting for raising the minimum wage, making public colleges and universities tuition-free, and guaranteeing access to health care for everyone."]["Here are the pressing issues Congress must address once we get back to Washington:\n✅ Passing the #DreamAct\n✅ Long-term funding for CHIP\n✅ Disaster aid funding \n✅ Funding for community health centers"]["“There are so many silences to be broken.” —Audre Lorde"]["To the students who got involved in the tax debate: stay engaged. Stay involved. We have many fights ahead in the new year. \nhttps://t.co/siEH8Ynecl"]["2017 was a year of women singing, storytelling, marching, and making history. I’m so excited to see what’s in store for these trailblazers in the new year.\nhttps://t.co/tHCNkp9loG"]["My advice from #GirlsBuild: If anyone ever steps in your way and tells you to not follow your dreams, don’t listen. But do not travel your path alone. Challenge each other. Encourage each other. We are all in this together."]["Long-term funding for CHIP must be one of our top priorities as soon as Congress is back in session. Children are counting on us.\nhttps://t.co/bQcLl3jZRH"]["Merry Christmas! Wishing you and your family a day filled with happiness, joy, and the comfort of loved ones. https://t.co/l6qtJQn4vn"]["This Christmas Eve, I’m thinking of the Californians families who lost their homes and their possessions in the wildfires. May they be able to find strength in their community and loved ones. \nhttps://t.co/diGofH9nNV"]["Regardless of who’s at 1600 Pennsylvania Avenue, California will continue to lead the charge to protect our environment and save our planet for future generations. \nhttps://t.co/EQqr8oSINe"]["Quick reminder: It's been 1️⃣0️⃣9️⃣ days since the Trump administration formally announced the end of DACA. I will continue to work to protect these young people from deportation at all costs."]["I firmly believe we must give voice to the vulnerable, give voice to the voiceless, and ensure dignity in the process."]["“There is never time in the future in which we will work out our salvation. The challenge is in the moment; the time is always now.” —James Baldwin"]["We need to take crimes against women more seriously — we can no longer ignore the connection between domestic abuse and gun violence. \nhttps://t.co/T7rGl1Swql"]["Trump and the Republicans have spent all of 2017 trying to kill the Affordable Care Act. Yesterday the American people sent them an unmistakable message in support of affordable health care coverage. Now we must work to ensure every American has health care. https://t.co/RrXD4mq76T"]["We must do all we can before 2018 to help Democrats take back Congress and help us reset the broken priorities in Washington. Every single phone call and every single door knock matters."]["Medicaid does more than help low-income Americans afford health care, it also pays for everything from treatment for substance abuse to support for children with special needs. We must protect it."]["Grateful this holiday season for our state’s heroic firefighters who are working day and night battling wildfires. #FlashbackFriday https://t.co/IwC5JjqxRg"]["Yesterday I voted against the short-term and short-sighted spending bill that neglected Dreamers and refused to provide a long-term solution to fund CHIP."]["Young people around our state, and across the country must be allowed to continue their studies without fear of deportation. #DreamActNow"]["Every single day that we don’t act, 122 more DACA recipients lose their status. We must keep our promise to these young people and pass the #DreamActNow. https://t.co/GQBWYkxQTM"]["Despite what Trump said, the Affordable Care Act is not repealed. In fact, Californians have until January 31, 2018 to #GetCovered at https://t.co/ulGnArohz1. \nhttps://t.co/TYf2OMik2k"]["#ThomasFire is now the second-largest fire in our state’s history, with 60% contained. Keeping the firefighters fighting this blaze in my prayers. \nhttps://t.co/rbfeDrSLeN"]["After disturbing reports of sexual harassment and assault within the national security community, my colleagues and I are calling for stronger sexual harassment policies. \nhttps://t.co/GJy3woAVQF"]["We can never stop fighting until we learn the truth, which is why it is critical Mueller is left to do his job of leading the special investigation."]["Every single day that we don’t pass the DREAM Act, is another day these young people have to live in fear — despite the fact that they have done everything right.\nhttps://t.co/UvX3ZciIpQ"]["More than 12,000 Dreamers have lost their DACA status since December. We must act now. \nhttps://t.co/m3Ot1uVdp9"]["The ability to breathe clean air and live in a safe and healthy environment should not be a partisan issue. Period."]["Let’s be clear: Dreamers study in our colleges, serve in our military, and work in Fortune 100 companies. And they are contributing to our economy ways that benefit all of us."][".@SenWhitehouse and I called on the EPA to end a $120,000, no-bid contract with a conservative public affairs firm. Yesterday, the contract was terminated. \nhttps://t.co/vXHTtj6SOb"]["Jasmine Lopez is 11 years old. All she wants for Christmas is Congress to pass the Dream Act so her mother, a DACA recipient, isn’t deported. Read her story →\nhttps://t.co/X6zTmbr7Jw"]["83% of the benefits of this tax bill go to the top 1% over the next decade. Americans won’t forget that Republicans chose to enrich corporations over middle-class families."]["DACA is an urgent issue and something we must address immediately. Each day in limbo in the life of these young Dreamers is a very long time."]["The Republican tax bill that passed the Senate is a travesty. It gives even more tax breaks to the top 1% and permanently cuts corporate tax rates at the expense of middle class families. This isn’t what Americans wanted, and it’s up to us to fight back at the ballot box in 2018. https://t.co/TRlhFpZzzR"]["Because Republican efforts to repeal the Affordable Care Act failed, they’re trying to turn this tax bill into a health care bill by repealing the ACA’s individual mandate. 13M more people will become uninsured in the next decade, and many face premium increases of up to 10%."]["\"The test of our progress is not whether we add more to the abundance of those who have much; it is whether we provide enough for those who have too little.\" —Franklin D. Roosevelt"]["For many Dreamers, this is the only country they have called home. They grew up here, placing their hand over their heart pledging allegiance to the flag of the United States. We can’t send them back to countries they don’t know. #DreamActNow"]["House Republicans just voted to pull the rug out from the middle class and give even more to corporations and the top 1%. Keep calling and speaking out against this tax scam: (202) 224-3121. https://t.co/Wwbw6Pw14e"]["Instead of cutting taxes for corporations or those at the top, we should be investing in our country’s crumbling infrastructure, or in giving middle-class families a real tax cut — or in the future of our country by making public colleges tuition free."]["It’s been 80 days since funding for CHIP lapsed. This program provides kids with routine check-ups, immunizations, dental care, and more. Republicans have to stop playing politics with children’s health care — we can’t leave our children vulnerable.\nhttps://t.co/ko9dB2wXL1"]["At a time when corporate profits are at an all-time high &amp; pay for workers has stagnated, this tax bill gives corporations &amp; the top 1% of Americans a permanent tax cut. This bill pays for those tax cuts by adding to the deficit &amp; raising taxes on middle-class families."]["Poor conditions, inhumane treatment, and medical negligence have led to tragic consequences within some immigration detention centers. That’s why @SenDuckworth and I are calling for these facilities to meet the most current national standards.\nhttps://t.co/BWjWfVSZ30"]["Approximately 30% of Puerto Rico is still without electricity, in what is now the longest and largest major power outage in modern U.S. history. \nhttps://t.co/doLvMGegE2"]["The GOP #TaxScamBill increases the deficit by more than $1 trillion over the next ten years and would hurt many working families — to give a tax break to corporations and the top 1%."]["Congress has the power to save the free and open internet as we know it. But we must act before it’s too late. https://t.co/nVRVVUuwZb"]["If you are in an area impacted by smoke and dust, be cautious when doing outdoor activities and be sure to check on the elderly. \nhttps://t.co/captJx8gED"]["Heartbreaking news about the Amtrak derailment in Washington. Incredibly thankful for the first responders who are on the scene. My prayers are with those on train 501. \nhttps://t.co/vSgbPq8QVD"]["Republicans are looking to vote on their latest tax scam bill, which they released late on Friday, in the next few days. Time is running out. Call your Senators now and tell them to vote NO: (202) 224-3121. \nhttps://t.co/wQY73WkSaa"]["If this passes, 13 million more Americans would be uninsured in the next decade and premiums would go up for millions of others.\nhttps://t.co/dHnYIL5I4q"]["For more information about preparing for wildfires, go to https://t.co/rkFtDdA3Rh and follow @Cal_OES and @CAL_FIRE for additional updates. #ThomasFire"]["Thinking of all the firefighters who are battling the Thomas Fire today. Thank you for your tireless efforts to contain this blaze. \nhttps://t.co/0xAAmQAuAd"]["With winds picking up again, it’s important to be prepared in case of evacuation. Remember the 6 P’s:\n✅People &amp; pets\n✅Papers &amp; other important documents\n✅Prescriptions &amp; eyeglasses\n✅Pictures \n✅Personal computer hard drive &amp; disks\n✅“Plastic” (credit cards, ATM cards &amp; cash)"]["The #ThomasFire is now the third-largest fire in California’s history. Red flag warnings remain in effect through 8 p.m. tonight. Please be alert for evacuation announcements. \nhttps://t.co/ztlra5SfH2"]["Alabama voters deserve to have their voices heard in the tax plan fight. Doug Jones should be seated in the U.S. Senate before we vote on the new bill. https://t.co/jJzU9Wp8Kw"]["As I said to girls at @LAPromiseFund, it’s a sign of strength to seek out role models and mentors. None of us, and myself included, has achieved success without people who invested in us and made us believe we could do anything and helped us along the way."]["My advice to girls at the @LAPromiseFund yesterday: continue to raise your hand. When you see others in need, go out of your way to lift them up. Stand up and speak out, because you can make a difference. \nhttps://t.co/CedtOwmMZt"]["Fires are getting more dangerous in Southern California. Please listen to evacuation orders and follow @Cal_OES and @CAL_FIRE for more updates.\nhttps://t.co/7pVatEg6EC"]["Republicans released their thousand page tax bill around 5:30 p.m. yesterday. They want to vote on it early next week. That barely gives Senators enough time to go over the bill, let alone have constituents weigh in."]["The latest tax bill is just as bad as the previous versions: Deep permanent tax cuts for corporations, while the middle class is left behind. It’s up to us to try and stop this bill. \nhttps://t.co/ZpWzYeaQZY"]["Vulnerable.\nEntitlement.\nDiversity.\nTransgender.\nFetus.\nEvidence-based.\nScience-based.\n\nWhat do these words have in common? They were all banned by the Trump Administration for use in any CDC official budget documents. It’s downright ridiculous. \nhttps://t.co/NQFN1K3Juz"]["The FCC may have voted to repeal #netneutrality yesterday, but this fight isn’t over yet. Don’t give up. \nhttps://t.co/YjeiQ94azB"]["A must watch 👇🏾\nhttps://t.co/C49lGhnegG"]["I was proud to partner with Senator @DickDurbin on legislation to ensure immigrant military personnel are allowed to continue to serve until their background screenings are completed — and this week, it became law. \nhttps://t.co/b8bttk3Ad6"]["Healthy people can become sick people in the blink of an eye. Get yourself and your family covered for the new year by signing up at https://t.co/zmKsbL62Qc. Don’t delay — open enrollment ends today (CA has until January 31). #GetCovered"]["Republican Senator Kennedy asked one of Trump’s U.S. District Judge nominees some of the most basic questions about law. He couldn’t answer. \nhttps://t.co/bMNsEqm220"]["Important. Spread the word. #GetCovered\nhttps://t.co/NmPT6x46jx"]["Doug Jones should be seated in the U.S. Senate before we vote again on the tax bill. Add your name if you agree: https://t.co/jJzU9Wp8Kw"]["Anti-Semitism has no place in California. We all must stand against these acts of intimidation. \nhttps://t.co/nwP5iN7yq1"]["Today is the LAST DAY to sign up for health care for 2018 (Californians, you have until January 31)! Go to https://t.co/zmKsbKOrYE before time runs out. #GetCovered"]["Help spread the word: this FRIDAY, December 15, is the last day for open enrollment (unless you’re in California — you have more time). Head over to https://t.co/zmKsbKOrYE to find a plan that works for you. https://t.co/8bvtPhaGCi"]["Federal laws for victims who have had their private images exploited online are lacking. The ENOUGH Act, which I sponsored, would change that. \nhttps://t.co/Y00bivSpQv"]["Today the FCC voted along party lines to repeal net neutrality. It is outrageous that they ruled in favor of multi-billion-dollar broadband companies over the interests of consumers. Americans deserve a fair and open internet. https://t.co/hBYwVgo7JK"]["“Leave it to Republican leaders in Congress to combine some of the worst parts of the horrible House and Senate tax bills and produce a true monstrosity.”\nhttps://t.co/JJuLDcMNyo"]["Today marks the fifth anniversary of the horrific tragedy at #SandyHook, which left a community mourning the lives of twenty children and six staff members. I will never forget the precious lives lost, which is why I continue to fight for common-sense gun safety reforms. https://t.co/hlyyHBoStV"]["The chairman of the FCC is forcing a vote tomorrow to get rid of #netneutrality. Here’s what that means: https://t.co/nQldtn2NBo"]["In case you missed it, the Trump Administration is once again putting corporate interests over consumer interests. \nhttps://t.co/rwpdo6RHP5"]["Some folks say there is no emergency to pass DACA, that it can wait. For the Dreamers who cannot concentrate at school because they’re terrified, this is an emergency. For their classmates, coworkers, and family members, this is an emergency. #DreamActNow"]["Sign the petition to demand Doug Jones be seated in the U.S. Senate immediately — before we vote again on the tax bill. https://t.co/jJzU9Wp8Kw"]["Delighted that one of my favorite artists and Civil Rights activist, @NinaSimoneMusic, is being inducted into the Rock &amp; Roll Hall of Fame. \nhttps://t.co/mMAqKwcpRK"]["The internet enables entrepreneurship on a level playing field. Anyone can become an overnight sensation based on the quality of their work, regardless of how much $ they have, their gender, the color of their skin, or where they were born. Let's keep it that way. #netneutrality"]["#BlackWomen helped elect a Democrat to the US Senate in AL for the first time in more than 20 years. But we need to do more than congratulate them. Let’s address issues that disproportionately affect Black women—like pay disparity, housing &amp; under-representation in elected office"]["McConnell needs to do the right thing and seat Doug Jones right away. The people of Alabama deserve to have their voice heard in the Senate. https://t.co/4WGugYPWBF"]["Doug Jones should be seated immediately — before we vote again on the tax bill. Alabama voters deserve to have their voice heard in this fight."]["“Let us realize the arc of the moral universe is long, but it bends toward justice.” —Martin Luther King, Jr."]["Congratulations, @GDouglasJones! So proud to welcome you as Alabama’s newest U.S. Senator. This shows Democrats can win anywhere in 2018.\nhttps://t.co/nlXSd3qWDj"]["All across the country, women are speaking up and speaking out. I’m honored to be included in @britandco’s #YearInWomen. \nhttps://t.co/h0yJ8btQjY"]["I’m going to keep pushing for the Dream Act in Congress and work to protect DACA recipients from deportation. \nhttps://t.co/hJ2GW98NEj"]["6.1 million California taxpayers claimed the state and local tax deduction in 2015, with the average deduction around $18,000. Eliminating this deduction would hurt hard-working California families."]["Nearly 90,000 people in Southern California are displaced due to this and other wildfires. \nhttps://t.co/xizd0U5zlc"]["Thanks to #NetNeutrality your cable company can’t block or slow down what you read or watch online, and your wireless carrier can’t pick and choose the apps you download.\n\nThat could change. We must protect the open internet by calling (202) 418-1000.\nhttps://t.co/HXyGYhWrpb"]["Happy Hanukkah! May you find peace, love, and happiness this Hanukkah season."]["Today’s the day: Tell your friends in Alabama to get out and vote! Polls close at 7 p.m. @GDouglasJones will fight for good education, access to health care, and higher wages — we need him in the Senate."]["A big thank you to everyone from states across the country who have helped California’s firefighters battle these blazes. Your courage has not gone unnoticed. \nhttps://t.co/xWlxhozkw3"]["\"Only 16 percent of adults, and 20 percent of likely voters, in California said they expect to be better off under the GOP tax plan.\" \nhttps://t.co/Axp0l8twzS"]["The Affordable Care Act open enrollment period ends December 15 for many Americans — Californians, you have until January 31. Go to https://t.co/zmKsbKOrYE to pick the plan that’s best for you."]["The California wildfires are still raging, but this year’s fire season has already burned more acres than the average of the last five years.\n\nNow is the time to discuss climate change."]["Five-year-old Ryland Ward, a survivor of the Sutherland Springs shooting, is asking for Christmas cards while he recovers in the hospital. He likes receiving pictures from other children and their pets. Please send to:\n\nRyland Ward\nP.O. Box 174\nSutherland Springs, TX 78161"]["Let’s reject the misinformation about Dreamers, let’s reject the division, and let’s find a bipartisan consensus to act on this issue. We should put the Dream Act to a vote today."]["Some good news: #RyeFire and #CreekFire are now both over 90% contained. Thankful for the tireless efforts of our firefighters for making that possible."]["Approximately 2 million CHIP recipients live in California. These children and their families shouldn’t have to pay the price of Congress’ inaction. We must reauthorize CHIP."]["Please be safe when returning to your home after a wildfire and be sure to review these helpful tips:\nhttps://t.co/7rpK3twcLv"]["Sign the petition if you agree: When intimate photos are used as a tool to denigrate, humiliate, and degrade — that's not something that we're going to accept: https://t.co/OUeWNvs5kP."]["Add this to your weekend to-do list: Sign up for health care! Go to https://t.co/zmKsbKOrYE to pick a plan that’s right for you. 2018 open enrollment ends December 15 (January 31 for those in California). #GetCovered"]["If you or someone you know needs assistance while recovering from the wildfires, please go to https://t.co/1Y2Bh66EU1."]["Earlier this week, hundreds of people came out to say that we need to pass the DREAM Act immediately. Thank you to those Dreamers who came out and told their stories that will change hearts and minds. https://t.co/Ne0k7RMI9R"]["👇🏾 Important information\nhttps://t.co/aSzvrxPIq6"]["Revoking #NetNeutrality will continue the digital divide across the nation, for everyone from low-income families, to small business owners, to students. Call the FCC to voice your concerns at (202) 418-1000."]["Please be cautious when going outside and be sure to protect yourself with a N95-rated mask. \nhttps://t.co/JHuVAl8ycM"]["If you are a victim of cyber exploitation, I want you to know you aren’t ever alone in this fight. \nhttps://t.co/yGL25E8O7c"]["Corporate profits are at an all-time high and workers’ pay has stagnated. Yet my Republican colleagues want to give corporations and the top 1% a permanent tax cut."]["Let’s be clear: With DACA, we’re not fighting against something, we’re fighting for something. We’re fighting for the Dreamers who need the #DreamActNow."]["Here are some important numbers for up-to-date fire information.\nVentura County: (805) 465-6650\nLos Angeles County: (424) 266-0701"]["Next week, the FCC will vote on #NetNeutrality and it’s up to us to protect the free and open internet. Urge the FCC to vote down this proposal by calling (202) 418-1000."]["Here’s a number of ways you can assist the victims of the California wildfires right now:\nhttps://t.co/Vkv530wtRg"]["34 House Republicans have said they want a DACA fix before the end of the year. Hundreds of business leaders have called for action. Let’s give these Dreamers a future. We cannot wait a day longer. \nhttps://t.co/wYwGsvotYa"]["If you are in an area affected by the wildfires and see businesses engaging in price gouging, please report it to the California Attorney General's office: https://t.co/eGEp5oZCDz \nhttps://t.co/eHvzJ3oZhv"]["Thank you to the brave firefighters and first responders who are out there battling these wildfires. We owe you a debt of gratitude. \nhttps://t.co/crbKHsZnW8"]["Are you looking for loved ones who may have fled the California wildfires? Do you want to let your family know you are safe? Please check https://t.co/WcIua0o5L1."]["👇🏾 Information on emergency shelters for the #LAFires. \nhttps://t.co/fKtZk04Eev"]["Update on the #ThomasFire: Approximately 96,000 acres burned, with 5% contained. I can’t say it enough, if you are given the notice to evacuate, please do so. \nhttps://t.co/Wz2tzRGcgs"]["These are some of the region’s worst wildfire conditions on record, with high winds posing extreme danger. Please stay safe today and be alert for evacuation announcements. \nhttps://t.co/Vejdc9mkSb"]["Throughout every natural disaster, we have seen Americans help our neighbors and friends. Let's pull together for Californians in their time of need. \nhttps://t.co/3coP8Co4E8"]["Higher education shouldn’t just be for the wealthy and the well-off. Congress should be doing more, not less, to ease the economic burden of higher education. \nhttps://t.co/AOw5gaLKQb"]["Californians help each other out in times of trouble, but please, stay safe out there.\nhttps://t.co/ApwvEAHUA7"]["You have less than 10 days to #GetCovered! Pick a plan that’s right for you and sign up before December 15 → https://t.co/zmKsbKOrYE. \n\n(Californians, you have until January 31!)"]["California is home to 220,000 DACA recipients. Many of them were young children when they were brought here, some before they could walk or talk. We must pass the #DreamActNow. https://t.co/RoeJegfVBk"]["Let’s reject those folks who say fixing DACA is not an emergency. For these 700,000 Dreamers who are terrified they will lose their job or their family, this is an emergency."]["#DreamActNow is about fighting for the ideals of this country. It's about fighting for the best of who we are."]["I will be speaking outside the U.S. Capitol around 12 p.m. ET today calling for Congressional action to fix DACA."]["Fires are continuing to quickly spread in Southern California. Please be alert and follow any evacuation orders. \nhttps://t.co/WZK9Eoho5k"]["Currently monitoring the wildfires in Southern California. Thankful for the first responders and firefighters who are working tirelessly battling these blazes. #CreekFire"]["Those in L.A., please be prepared in case you have to quickly evacuate. \nhttps://t.co/UAvjnIsgU0"]["A little more than a month after the shooting at a church in Sutherland Springs and two months after the worst mass shooting in modern history in Las Vegas, Republicans are trying to make it easier for people to carry concealed weapons across state lines. \nhttps://t.co/42Ao6zOJqV"]["California voters who reside in Assembly District 51, the special election is today! Make sure you get out and vote. Polls are open until 8:00 p.m."]["Please continue to heed evacuation orders for the #ThomasFire and be sure to follow @CAL_FIRE for critical wildfire updates. \nhttps://t.co/WrwjUEMaK5"]["The GOP plan is clear: Add $1 trillion to the deficit with their tax plan. Then, try to balance the budget on the backs of seniors.\nhttps://t.co/TZGU8Hr9qN"]["Drastically raising entrance fees at our nation’s national parks will hurt working families. The public comment period on the proposed increase is open through December 22: https://t.co/J2uedn4drh"]["Instead of giving America’s top 1% more tax breaks, let’s invest in infrastructure, job training, and making college affordable."]["Both Republican tax plans would cut taxes on the wealthy at the expense of middle and lower income Americans. But this period of reconciliation gives us time to keep calling, writing, tweeting, and taking action to make our voices heard."]["I know I’ve been asking you to make a lot of calls lately, but I wouldn’t be asking if it wasn’t important. Tell the FCC that we must keep the internet free and open: (202) 418-1000 #NetNeutrality"]["We should be preserving our national lands for future generations, not opening up our nation’s treasures to more drilling, logging, and mining. \nhttps://t.co/wfNzpieQZ8"]["Doug Jones is a candidate with integrity who fearlessly took on the KKK. We need people like him in the Senate. Donate here:  \nhttps://t.co/jvQiXpBBCn"]["This is abysmal. We can’t forget about the people in Puerto Rico who are still struggling. \nhttps://t.co/IakueLQt08"]["Keep up the pressure. Call multiple times a day. Tell Republicans we don’t want tax breaks to corporations paid for by millions of middle-class families."]["I've said it before, and I'll say it again: If you vote for people to lose their health care to pay for tax cuts to the top 1%, then you need to lose your job."]["The bill that passed the Senate is not law yet. The bill that passed the House and the bill that passed the Senate now go to conference to reconcile the differences."]["We have a responsibility to protect all children. That’s why I’ve introduced the COURTS Act with Sen. @JohnCornyn which to improve the handling of foster care cases."]["Nine million kids, more than two million in California alone, shouldn’t have to pay the price for Congress’ inaction. We must renew CHIP before funding runs out for some states at the end of this month."]["This is concerning. It’s important the U.S. Census fairly and accurately counts all Americans.\nhttps://t.co/ohKjSVejgN"]["Perpetrators who share private, intimate photos online without consent must be held accountable. \nhttps://t.co/WZLvNMtDKK"]["Don’t forget the FCC is voting later this month to kill important rules that keep the internet free and open to all Americans. We must actively work to stop them from ending #NetNeutrality."]["Add your name to pledge that you will do everything in your power — from calling your member of Congress to writing letters and attending rallies — to stop this #TaxScamBill.\nhttps://t.co/j7DcI3rvun"]["It’s been a little more than two months since the shooting in Las Vegas. Nothing has been passed in Congress to prevent mass shootings. It’s shameful."]["Under the cover of darkness, Republicans passed their tax plan. But this fight isn’t over yet, as the Senate and the House tax bills will be reconciled in conference. Keep up the calls and tell Republicans you don’t want this #TaxScamBill: (202) 224-3121."]["What happened early this morning — voting on the GOP tax bill just mere hours after Senators received the final text — was irresponsible and downright disrespectful to the American people. What was in the bill was even worse. I voted NO."]["Senate Republicans are trying to force a vote in the next few hours on a 479-page tax bill whose final text includes handwritten edits in the margins. That's ridiculous. https://t.co/w3iRZbSN9D"]["As the Republicans rewrite this bill in secret (again), I have an idea: Instead of giving corporations a big tax cut, let’s give the middle class a real, permanent tax cut."]["Introduced this amendment with Senator Nelson that would send the bill back to committee to have it rewritten to give tax cuts to the middle class without adding to the deficit. Every single Republican voted against it. Every single one. \nhttps://t.co/BSWHaw0M6Y"]["(202) 224-3121. Memorize it. Add it to speed dial. Make as many calls as you can. We need to make our voices heard in order to stop the Republican tax plan in the Senate."]["The GOP is rewriting their tax proposal in secret, just like they did during the health care fight. How can you honestly say you’re working for the best interests of the American people when they don’t even know what’s in it?"]["This tax bill will affect the lives of everyone. Your parents. Your grandparents. Children. And it’s is being rewritten in secret, on the same day they want to bring it to a vote. This is no way to govern."]["Tomorrow we need all hands on deck. Call. Write. Tweet. This isn’t over: (202) 224-3121 https://t.co/S1ZNdXjtFD"]["Not surprising. \nhttps://t.co/53px65emOc"]["No real hearings.\nNo bipartisanship.\n\nAnd Senate Republicans want to vote as early as today on a bill that would drastically change our tax system? It’s shameful."]["The GOP tax plan is a vehicle to severely damage our nation’s health care system. \nhttps://t.co/ujwwp2a6kd"]["Before the tax reform bill was passed in 1986, the Senate Finance Committee held 33 days of hearings. This bill? Zero. Now Senate Republicans are trying to rush it to a vote. It’s like they don’t want Americans to know ~50M households would see a tax increase within a decade."]["Don’t forget: it was your calls, letters, and action that stopped Republicans from repealing the Affordable Care Act, saving health insurance coverage for tens of millions of Americans. Let’s stop this tax bill: (202) 224-3121."]["Who are some of the people the Senate GOP tax scam would hurt?\n👵🏽 Seniors who rely on Medicare\n🤕 13 million more Americans who would be uninsured in the next decade \n📈 Our children, who would face an increase in the deficit by $1.4 trillion by the year 2027"]["Tell your representatives at (202) 224-3121 to vote NO on the GOP tax plan. Under this bill, approximately 50 million American households would see a tax increase within a decade."]["It is outrageous that protecting our children’s health care hasn’t been a top priority. \nhttps://t.co/UZhgxp9vsp"]["Congress should act now and pass the Dream Act. There’s no excuse. The clock is ticking."]["Healthy people can become sick people in the blink of an eye. That’s why it’s so important you #GetCovered today at https://t.co/zmKsbKOrYE. Deadline is December 15 (or January 31st for Californians)."]["Nobody deserves to have private, intimate photos posted online without their consent. That’s why the ENOUGH Act would make cyber exploitation a federal crime. \nhttps://t.co/nJQIRJRhu6"]["🚨 Republicans in the Senate want to bring their tax bill up to a vote soon. 🚨\nWe don’t need to give more tax breaks to corporations paid for by millions of middle class families. Let’s defeat this bill: (202) 224-3121."]["Here’s a suggestion: Instead of giving corporations a big tax cut, let’s give the middle class a real, permanent tax cut."]["#NetNeutrality ensures that internet providers can’t tilt the playing field by blocking or throttling their competitors. Protecting the free and open internet is crucial."]["It’s ridiculous that two months after Hurricane Maria hit Puerto Rico and the U.S. Virgin Islands, many are still without power. That’s why I’m joining @BernieSanders on a bill to put these islands on the path toward recovery."]["As Attorney General, I fought for victims of cyber exploitation and worked to ensure the perpetrators were held accountable. With the ENOUGH Act, we can ensure victims get justice."]["A lot of you have questioned whether calls to Congress will really help in the fight against the tax plan. Your calls helped to win the health care fight earlier this year. Keep up the pressure: (202) 224-3121. #BadDealForWomen"]["I’m co-sponsoring Senator @BernieSanders’ bill to help rebuild the electrical grids in Puerto Rico and the Virgin Islands.\nhttps://t.co/zPwIZ7UhT7"]["Today I’m introducing the bipartisan ENOUGH Act of 2017, which will make cyber exploitation a federal crime. We must ensure perpetrators who share private intimate images online without consent are held accountable. \nhttps://t.co/IaL1r8FPMJ"]["Today in the Budget Committee, I will be voting NO on the GOP’s disastrous tax bill that would give tax cuts for the top 1% and drive up our nation’s deficit. #GOPTaxPlan\nhttps://t.co/tit310A3AY"]["Public comment for the proposed @NatlParkService entrance fee increase closes on December 22. Submit a comment and say NO: https://t.co/J2uedn4drh"]["Before Thanksgiving, I visited with students at Al-Quds University on a trip to Israel. Visiting with these students was one of the many highlights of my trip. \nhttps://t.co/W1Tjwhxb7R"]["Revoking #NetNeutrality would further the digital divide across the nation, for everyone from low-income families, to small business owners, to students."]["The average American earning less than $30,000/year would be worse off by 2019 if the Senate GOP tax bill passes. And my Republican colleagues want to vote on this bill as early as this week. Keep calling. \nhttps://t.co/2srcJlSFIm"]["Sign on if you agree: the free and open internet is a cornerstone of our society and must be protected at all costs. https://t.co/kx2j6UOS07"]["Reminder as we start this week: Republicans are still pushing a tax plan that would leave 13 million more Americans uninsured and raise premiums. Call Congress, then add this number to your speed dial → (202) 224-3121."]["As former Attorney General of California, I know how critical the CFPB is to protecting consumers. What Trump is doing is flat out wrong. We must protect the CFPB. \nhttps://t.co/PwePRGxRuC"]["Pin-pointed and timely emergency alert systems could mean the difference between life and death. \nhttps://t.co/EO7pr3lf8n"]["The Republican tax plan would raise taxes on lower-income families over the next decade in order to give large tax cuts to the top 1% of Americans. That’s not how you strengthen the middle class. https://t.co/KFjKfJeN7a"]["The internet is under attack. The free and open internet is a cornerstone of our society and must be protected at all costs. Urge the members of the FCC to vote down these new rules and save the internet."]["ICYMI, California is paving the way by becoming the first state in the United States to approve LGBT-inclusive history textbooks for K-8 classrooms. \nhttps://t.co/HlOTUvY6PJ"]["The clock is ticking until open enrollment closes on December 15 (January 31, 2018, in California). Use this holiday weekend and sign up now at https://t.co/zmKsbKOrYE."]["Getting rid of #NetNeutrality would be a terrible mistake that would hurt the most vulnerable and voiceless among us. It will imperil our economy while reducing innovation, entrepreneurship, and creativity."]["We can’t be silent about this issue. If the House tax bill were to pass, some graduate students would go bankrupt.\nhttps://t.co/33VeAFegFI"]["On #SmallBusinessSaturday, celebrate and support local businesses in your community. They’re the backbone of our economy — let’s help them out where we can this holiday season. https://t.co/eANFoj9UIp"]["Let us not forget this holiday season our fellow Americans in Puerto Rico and the U.S. Virgin Islands who are still suffering without electricity."]["Join the fight. Make your voices heard. Because this is not a drill — the FCC wants to end #NetNeutrality. Add the FCC number to your speed dial and call them when you have a few minutes to spare: (202) 418-1000."]["Help us fight back today and save the free and open internet. #NetNeutrality\nhttps://t.co/gUaJPs4e3M"]["#ThankfulFor the Right to Vote. Use your voice and register today at https://t.co/MykJL0X5gt."]["#ThankfulFor the Affordable Care Act, which ensures million Americans who have pre-existing conditions have access to affordable care."]["#ThankfulFor everyone who has been politically engaged since Election Day. You’ve called, you’ve written letters, and it has made a real difference. Keep up the fight."]["Today I’m spending one of my favorite holidays cooking, surrounded by close family. My hope is you get to spend the day with people that you love. Wishing you and yours a happy Thanksgiving! https://t.co/dsqDn5hGKK"]["Although in our country today there are forces of hate and division trying to tear us apart, Americans have so much more in common than what separates us. And that is the truth."]["Health care enrollment is up by 23% in California when compared to the same period as last year. #GetCovered\nhttps://t.co/etWHuaqG0h"]["The basic principle of Net Neutrality is that access to all websites should be treated equally. What the FCC wants to do is empower broadband service provides to distort the online marketplace and set up a pay-for-play system. This would be a terrible mistake."]["This holiday season, some families that rely on CHIP have resorted to GoFundMe’s in order to pay for their child’s health care coverage. This isn’t right. Congress must renew CHIP.\nhttps://t.co/6OlUDzgyMq"]["Californians: Open enrollment is currently underway and you have until January 31 to sign up for health care → https://t.co/ulGnArohz1."]["The FCC released their plan yesterday to repeal #NetNeutrality. I have confidence that if enough of us come together in the next several weeks, we can make our voices and save the internet. The board is voting on December 14. Call Congress now: (202) 224-3121."]["This is a victory for our nation and everyone who wants to defend our nation. This ban is un-American.\nhttps://t.co/5uO0O0aL7p"]["Add your name to mine if you agree that we need to protect and expand internet access, not restrict it with pay-for-play: https://t.co/kx2j6UOS07"]["The House tax plan would eliminate the up to $250 deduction teachers receive for paying out-of-pocket for school supplies. \nhttps://t.co/chIN0lFrEv"]["I just wanted to remind you that the enrollment period to apply for health insurance is happening right now. Go to https://t.co/zmKsbL62Qc before December 15 (January 31st if you’re in CA!) and find the health insurance plan that works for you."]["Keeping the internet free and open is paramount to ensuring the gatekeepers of the internet can’t tilt the competitive playing field. One website should not be prioritized over its competitor. We must save #NetNeutrality."]["To do today: Reach out to friends or family in states with senators who may be on the fence about the GOP tax bill. Make sure they’re calling and writing: (202) 224-3121."]["The GOP tax plan targets California families, disaster victims, homeowners, students, lower-income Americans, and small business owners. Here’s the truth: Congress should be doing what’s best for the people, not just those at the very top."]["It's going to take everything we've got to save our free and open internet. Let's get to work. Make those calls to tell your representatives you support #NetNeutrality: (202) 224-3121.\nhttps://t.co/1SNF7y2NpC"]["Haiti has still not fully recovered after the most recent natural disasters. The administration must reconsider this decision. \nhttps://t.co/IMVsFJPzkU"]["We defeated Republican attempts to repeal the Affordable Care Act. Let’s do the same with this Senate tax bill that would leave 13 million more Americans uninsured and raise premiums. Call Congress now: (202) 224-3121."]["More than half of Puerto Rico is still without power. \nhttps://t.co/HnI758nkJf"]["Representation matters and can make a difference in the lives of so many children. \nhttps://t.co/T4t0MDjfFK"]["The only word to describe the GOP tax bill is cruel. It would hurt millions of families, while the top 1% would see their income go up. \nhttps://t.co/dXf9wlL5W4 https://t.co/xTCirNhrbk"]["Continue to choose hope over despair, love over hatred, and action over apathy — every single time."]["The Trump tax plan that passed the House would increase the deficit by $1.7 trillion over the next 10 years. This plan is bad for many middle class Americans and must be defeated in the Senate."]["Just a reminder that Republicans have still not done anything to reauthorize CHIP, which ensures health care coverage to nine million children. Children will start losing their health care if it is not funded soon."]["Republicans keep trying to chip away at our health care any way they can, but we will continue to fight those efforts tooth and nail."]["As head into next week, I want you to keep up the pressure against this tax bill. \n📞Call Congress at (202) 224-3121\n✏️Write your representatives\n\nRepeat. It’s up to us to defeat it."]["This ban never should have been lifted in the first place. It should be permanent.\nhttps://t.co/jLly2vaBoF"]["One of the first steps to reforming our broken criminal justice system is fixing bail reform. \nhttps://t.co/YKADNkVFBv"]["Puerto Ricans are Americans citizens who are still suffering after Hurricane Maria. Standing in solidarity with those attending the #UnityMarchforPuertoRico today. https://t.co/ooO3R46lOd"]["Republicans in Congress want us to remain silent, but it’s up to us to raise our voices and say gun bump stocks must be banned. \nhttps://t.co/QRvTQuIyoq"]["The Republican tax plan is a cruel catastrophe that targets some of the most vulnerable Americans. Fight back today: https://t.co/EIA56jvvrH"]["Our state of California is home to 220,000 DACA recipients. These young people are #HereToStay. We must pass the Dream Act now."]["Approximately a third of Americans are unaware it’s open enrollment. Help us spread the word!\n\nSign up to get covered at https://t.co/zmKsbKOrYE.\nhttps://t.co/OFRSojzSQN"]["South Lake Tahoe, California is just one of the towns across the country committed to obtaining 100% renewable energy.\nhttps://t.co/9YNDMVn3na"]["The White House is ignoring the victims of California’s wildfires in their disaster aid request. It’s unacceptable. \nhttps://t.co/WUlfE7yWa9"]["Another thing to add to your list of why the GOP tax plan is terrible: If the House bill becomes law, graduate school would become unaffordable for many Americans. \nhttps://t.co/1M3roDOnSO"]["For most states, there is less than a month to enroll in health care before the December 15th deadline. Get covered today: https://t.co/zmKsbKOrYE."]["Secretary Betsy DeVos’ refusal to help the more than 87,000 student loan borrowers who have requested debt relief will threaten these students’ livelihoods. \nhttps://t.co/qwWEk5kR5A"]["We need to replace a money bail system with a risk assessment system. Just having bail money should not guarantee someone’s release from jail. \nhttps://t.co/gHGrwL9ccT"]["The recent California wildfires left approximately 100,000 Californians displaced. Those Californians who lost everything shouldn’t have to pay to replace immigration and naturalization documents that were damaged or destroyed."]["Senate Republicans are trying to pass a tax bill that would cause an estimated 13 million more Americans to be uninsured and raise premiums for millions of others. We have to defeat it. Add your name: https://t.co/EIA56jvvrH"]["I know Jesse Jackson will keep hope alive as he battles Parkinson's disease and continues his tireless commitment to justice and civil rights. Praying for him and his family.\nhttps://t.co/5vlQzWJGTA"]["Yesterday the House passed their tax bill that would increase the deficit by $1.7 trillion over the next ten years, while permanently giving tax cuts to the top 1%. We must defeat the GOP tax bill in the Senate."]["The DHS is letting DACA recipients whose applications were delayed in the mail resubmit them. Please share this good news.\nhttps://t.co/7rYnqleRq9"]["Senate Republicans are trying to sneak a provision into their tax bill that would leave 13 million more Americans uninsured and raise premiums. Yes, this is the same bill that would give tax breaks to corporations at the expense of many middle-class families. We must defeat it."]["Today is day 47 since Republicans in Congress failed to reauthorize the children’s health insurance program. #ExtendCHIP"]["Under the Senate Republicans’ tax plan:\nTax cuts for corporations = permanent\nTax cuts for middle class = temporary\nhttps://t.co/H5KBpKIfqT"]["If you vote for people to lose their health care to pay for tax cuts for the top 1%, then you need to lose your job."]["Spread the word to your friends and family: The deadline to register to vote in the Alabama special election is November 27."]["California is on track to get 50% of our electricity from renewable sources by 2020, a decade ahead of schedule. We will continue to lead even when this Administration won’t. \nhttps://t.co/4gPBO6sHJ3"]["I’m calling for an investigation into the drug Vivitrol. We need more transparency into their aggressive lobbying and marketing campaign.\nhttps://t.co/IzZZwLH4pC"]["Congratulations @EleniForCA on the @EmilysList endorsement! I know she’ll be a fierce advocate for Californian women. https://t.co/r4ArgFX1Qg"]["We can’t stand for the rise in hate crimes that’s happening across our nation. No one should live in fear due to their religion, race, or ethnicity.\nhttps://t.co/qr8KZVhORu"]["Eliminating or restricting the deduction for state and local taxes would hurt one of every three California taxpayers. \nhttps://t.co/bHtK2x7H0o"]["🚨 All hands on deck. Let's save the ACA again. 🚨\n\nSenate Republicans are adding a provision to their tax bill that would leave ~13M more Americans uninsured and raise premiums, to pay for tax cuts for corporations. \n\nCall Congress now: (202) 224-3121."]["Thankful for the quick action of teachers and staff at Rancho Tehama Elementary, as well as the officers and first responders. Their actions saved countless lives.\nhttps://t.co/4s2KY8BArG"]["Run for city council, school board, state office, or U.S. Congress. We need your voice. We need your leadership. #RunForSomething https://t.co/unOkJJfWhW"]["The tragedy in Sutherland Springs happened a little over a week ago. Don’t let this fade into the next news cycle. We need gun safety reforms. Now."]["These Dreamers did everything right, mailing their DACA renewal weeks ahead of time. This is outrageous.  \nhttps://t.co/G9Rfzm9ZBp"]["Voting rights in this country are under attack. Since the Supreme Court gutted the Voting Rights Act in 2013, ten federal court decisions have found intentional discrimination against voters of color. \n\nOne way to fight back: register to vote today."]["We can’t let the GOP tax plan become law. Too many middle class families will be asked to pay more. Call your members of Congress and raise your voice: (202) 224-3121.\nhttps://t.co/lW89DOpCES"]["Congratulations to you and @SenSherrodBrown on the newest addition to your family! \nhttps://t.co/FapduwANlI"]["Bayard Rustin once said, “You have to join every movement for the freedom of people.” \n\nIt’s true, fighting for everyone’s civil rights is in our common interest. #MondayMotivation"]["Every little bit counts in the Alabama Senate race. Help us reach $100K raised for Doug Jones by the end of today: \nhttps://t.co/Zh069HcfOd"]["Huge corporations should not be profiting off the imprisonment of human beings. Private prisons must be held accountable for their actions. \nhttps://t.co/NgZIEnj0W5"]["Let’s use the victory on Tuesday to energize us to continue to show up health care, criminal justice reform, and the environment."]["On the topic of reasonable gun safety laws, the false choice that is being proffered everywhere is the choice that suggests you’re either in favor of the Second Amendment or you want to take everyone’s guns away. That’s a false choice and we have to reject it."]["Voting is your right. It must be strengthened and protected, no matter what. \nhttps://t.co/cgktaMFd6A"]["\"Let’s talk about the broken VA medical system, and traumatic brain injuries, and PTSD. But let’s also talk about homelessness, and unemployment, and mental health, and, yes, racial inequality.\" \n\nCompelling read by @StephenCurry30.\nhttps://t.co/V9JQCFBA60"]["Doug Jones fearlessly took on the KKK and has fought for working families his entire career. We need him in the Senate. Help us reach $100K raised for Doug's campaign in Alabama. Donate here: \nhttps://t.co/WRX75E3SAm"]["Roy Moore has raised more than $100K since Friday. Help us match that for Doug Jones — a candidate of integrity. \n\nWe're close to $50K since I asked you two days ago to give. Help us get there. Donate now: https://t.co/GOlZWbiiQt"]["This Veterans Day, let us recommit to ensuring all of America’s veterans get the proper physical and mental health care they need to re-enter to civilian life."]["This #VeteransDay, let us honor the servicemembers, veterans, and families who have sacrificed so much for our country. Their courage will never be forgotten. https://t.co/AjiPLMCtat"]["With Syria’s announcement earlier this week, the United States became the only country on the wrong side of history. \nhttps://t.co/Bc6UTN3q6W"]["It’s been more than a month since CHIP expired. Republicans in Congress still have not acted."]["#TeamKamala is on Snapchat! Get the latest updates: https://t.co/2NZr0fcIzH"]["Even after Tuesday’s victories, we cannot become complacent. 2018 is right around the corner, and we need everyone to get involved to help win back the House and Senate."]["Sexual harassment and assault are real in this country, from movie sets to newsrooms to factory floors. And we need to confront it."]["The GOP tax bill would add $1.7 trillion (yes, trillion) to the national debt over the next ten years, to lower taxes for wealthy Americans. \nhttps://t.co/VtXeSGZiu0"]["This past weekend, some of my colleagues and I examined recovery efforts in Puerto Rico and the U.S. Virgin Islands. What’s happening there continues to be a humanitarian crisis — approximately 58% of Puerto Rico is still without electricity. https://t.co/JEknSB5RuW"]["Just another way the GOP tax bill would hurt Californians. We cannot allow it to become law. \nhttps://t.co/Eu8AXiFFj5"]["California is home to 220,000 DACA recipients. I stand for them and I stand with them. They are #HereToStay. #DreamActNow"]["We know affordable education sets our children up for success, and we cannot let the next generation graduate with immoral amounts of debt. That’s why I support pathways to free tuition at public colleges and universities."]["Despite the forces of hate and division that are trying to tear us apart, Americans have so much more in common than what separates us."]["Donate now to support Doug Jones — a candidate with integrity running for Senate in Alabama.\nhttps://t.co/857LZwCn91"]["Approximately 800,000 Dreamers know no other home than the United States. We must bring the Dream Act up for a vote. #DreamActNow"]["Dreamers: I hear you, I see you, I’m with you. We need the #DreamActNow.\nhttps://t.co/t2VYzvsF0I"]["Weapons of war don’t belong on our streets. \nhttps://t.co/f5S8s9USdI"]["We won’t throw up our hands when it is time to roll up our sleeves and fight for who we are. We won’t retreat. We will continue to fight for our ideals."]["After yesterday’s victories, it’s clear you fought👇🏾\nhttps://t.co/ZnbZLondDb"]["Today on the 40th anniversary of Harvey Milk’s historic election as California’s first openly gay official, we must remember his words, “Hope will never be silent.”"]["The historic wins across the country last night for women, members of the LGBTQ community, people of color, and Americans of every faith, showed our diversity is our strength."]["A year ago today, I asked the question, “do we retreat, or do we fight?” From marches to stopping the Affordable Care Act repeal, we did not retreat."]["November 8, 2016. As the results started to roll in, my team and I knew it was going to be a long night → https://t.co/ESYOOCvOBJ"]["There are so many incredible stories to share — too many to count them all. But know this: Our diversity is our strength, and our unity is our power. Let’s remember that today. We must recommit ourselves to the important fights that lay ahead."]["Chris Hurst, a former television anchor whose girlfriend was killed in a shooting that occurred on-air, won an election for state house in Virginia — running on the idea that we need commonsense gun reforms now. https://t.co/eq1DInfMUN"]["Manka Dhingra, a first-time candidate who became active in politics after Trump's win last year, won a special election to help Democrats take control of the Washington State Senate. https://t.co/Qkhm1LlZGa"]["In Helena, Montana, voters elected Wilmot Collins, a former refugee from Liberia to become the state's first-ever Black mayor. https://t.co/7fHrOY6VlP"]["Vi Lyles became the first Black female mayor of Charlotte, NC after running a campaign focused on building a \"city of opportunity and inclusiveness” where “a woman whose father didn’t graduate from high school can become this city’s first female African-American mayor.” https://t.co/Bb7CXwkUR3"]["As Danica said last night: \"No matter what you look like, where you come from, how you worship, who you love, how you identify, or any other inherent identifier that you have, you should be celebrated because of who you are, not despite it.\""]["Justin Fairfax became the second Black Virginian elected statewide. Kathy Tran, a refugee from Vietnam, became the first Asian American woman elected to the VA state house. Danica Roem became the first openly transgender elected official in state history. https://t.co/CvuIJxZ8BE"]["Democrats embraced our diversity and our unity in yesterday's elections and the results speak for themselves. Here are a few examples:"]["Congratulations to my former colleague @MarkHerringVA and to @FairfaxJustin on his historic win tonight! Virginia is in good hands."][".@pwcdanica stood up to intolerance — and won. Congratulations on your historic victory tonight."]["Congratulations to @RalphNortham and his team for showing that Virginia won’t stand for hatred and bigotry.\nhttps://t.co/ptKySwzmMC"]["This is cruel and bad public policy, even for this tax \"plan.\" \nhttps://t.co/QsOsQQM7Yt"]["Drug addiction touches every community and family in America. Pharma companies like Alkermes have too much power, not enough accountability. https://t.co/e1J5EgK88W"]["Today is #ElectionDay and we need you. Our future, our progress, and our values are on the ballot."]["ACA open enrollment period has begun &amp; we’re already seeing record numbers! Go to https://t.co/zmKsbKOrYE to pick the right plan for you. https://t.co/I0kXkPKSWS"]["Bots are being used to disrupt our democracy. @Twitter must address this issue seriously heading into 2018. https://t.co/tYjdU8opzs"]["The most important thing you can do today is vote. Your voice matters. Don’t have any regrets on Wednesday → https://t.co/MykJL0X5gt"]["90 Americans are killed, on average, every day by guns. We must honestly acknowledge the epidemic of gun violence &amp; work together to curb it"]["The Trump Admin is proposing to cut the @NatlParkService budget by almost $300M, while almost tripling entrance fees\nhttps://t.co/DPfrd6sjWc"]["Trump is abandoning America's place as a world leader — this time on climate change and health care. \nhttps://t.co/dwzibuj5JO"]["Tomorrow is Election Day. Voting for city council matters. Voting for mayor matters. Voting for governor matters. Make your voice heard."]["The tragedy that happened in TX has become too routine in America. As we pray for those recovering, we also must commit ourselves to action."]["We’ve lost far too many of our classmates, friends, family members &amp; children to gun violence. Another moment of silence alone won’t suffice"]["Senseless gun violence has torn apart another community — this time in a house of worship. When do we say enough is enough? https://t.co/gsW1KN54xc"]["It’s ⏰ for this country to ask: \"Who are we?” We have 2 days until Election Day, VA. I believe you will be a part of that answer. https://t.co/rPT3CAzW0L"]["As the poet Audre Lorde reminds us, “there are so many silences to be broken.” So speak out. Be loud. Even when others are silent."]["In 2017, the ability to breathe clean air and live in a healthy environment should not be a partisan issue. \nhttps://t.co/sphrQ91dpI"]["The scientific evidence is clear — humans are contributing to climate change, despite what officials in this Administration say. https://t.co/UfTKB4eVkI"]["Help us spread the word about open enrollment! You have until Dec. 15 to sign up, unless your state extended (CA has until Jan. 31)."]["Election Day is in three days. It is our civic duty to get out there and vote. Your voice can make a difference. https://t.co/MykJL0X5gt"]["Taking money away from essential health funds to pay for children’s health insurance is just wrong. \nhttps://t.co/GoNmIY2HMw"]["Americans won’t be fooled — we know some of the biggest winners of this plan are corporations and the wealthy. https://t.co/YNvctrPSeq"]["Jeff Sessions needs to come back to the Senate and testify under oath again. We deserve the truth.  \nhttps://t.co/v4XUdJExNP"]["We have got to stop playing politics with Dreamers’ lives.\nhttps://t.co/mSJXcWDulo"]["Add this to your weekend to-do list: Sign up for health care! Go to https://t.co/zmKsbKOrYE to pick a plan that’s right for you. #GetCovered"]["As AG, I took on Big Oil. We need more transparency when it comes to these powerful special interests, not less.\nhttps://t.co/jbtZ2Emwjn"]["#FlashbackFriday to the @HRC dinner, where I had the opportunity to meet the incredible tennis player &amp; advocate @BillieJeanKing. https://t.co/0f3LB4Xqpq"]["Our country has a responsibility to make education attainable without digging students into a financial hole. This shouldn’t be partisan."]["Republicans in Congress still haven’t renewed CHIP funding &amp; some states are starting to run out of $$$. The clock is ticking. Time to act."]["No one should have to hide, not in the closet or in the shadows. Remember, our diversity is our strength and our unity is our power."]["Repealing the estate tax is a giveaway to those at the top — not something that will create jobs. We have to oppose this plan."]["The gender pay gap is greatest for Latinas. They make on average only 54 cents for every $1 a white man makes. #LatinaEqualPay"]["Today is #LatinaEqualPay Day, or the day Latinas must work to make the same amount white men earned last year on average"]["Tech companies need teams solely dedicated to countering state-sponsored information operations.\nhttps://t.co/i4htA0E6AZ"]["This Admin is waging an assault on our deepest values and targeting vulnerable—and often voiceless—communities. Speak up, register to vote."]["Virginia, in six days you can show our country that division and hatred do not reflect the ideals of who we are. https://t.co/A0bq8GMRDV"]["Women, no matter their immigration status, should be able to make their own choices about their health. Period. \nhttps://t.co/PmJ8GkMTh7"]["These tourists came to New York City to celebrate what should have been a joyous occasion. This is heartbreaking. https://t.co/htNyitICYQ"]["Let’s go @Dodgers! One more game. Let’s bring that trophy home to the Golden State. #ThisTeam"]["Earlier at the #TechHearings, I asked Facebook, Google, and Twitter how much they’ve profited from Russia propaganda. No one had an answer."]["Open enrollment starts today! Californians, you have until January 31 to enroll in a health care plan. Sign up now: https://t.co/ulGnArohz1"]["Keeping those killed and injured in NYC in my prayers. Thankful for the quick actions of the NYPD and first responders."]["From all of us on Team Kamala, hope you have a safe and spooktacular Halloween! 👻🎃 https://t.co/qEJAYlHYDE"]["Four-year-old Micaela is interested in universal health care and immigrant rights, and wins best Halloween costume in my book. https://t.co/Mx933TzE6G"]["We must speak the truth. Even when it makes people uncomfortable. Even when others are silent. \nhttps://t.co/n6ApUqFefq"]["It’s been almost a full month since CHIP funding expired, leaving 1.3 million California children at risk. \nhttps://t.co/tvGCMDVjAg"]["Tell your friends and family in Virginia: getting out the vote is more important than ever. Find events here: https://t.co/mokZkC3DON"]["From the United States Congress to the United States Census, LGBT rights are under attack. We must stand on the side of equality."]["Transgender troops are willing to defend our country. Turning them away is un-American. \nhttps://t.co/zCTfAOvQQv"]["California will recover, and I’m working to ensure those affected can get the resources they need to rebuild. \nhttps://t.co/1hDMBbfg8t"]["Fighting for everyone’s civil rights is in our common interest. No one should have to fight alone.\nhttps://t.co/tWVAi7EqYr"]["Every day that we fail to do right by DACA recipients is a day our country is failing an important moral test. https://t.co/VW6uktMf3w"]["This is unacceptable. We can’t become silent about gun violence just weeks after the deadly Vegas shooting. \nhttps://t.co/QQoe92M3O5"]["Steep increases in fees at national parks would discourage many Americans from visiting. Submit a comment &amp; say NO: https://t.co/J2uedn4drh"]["CA is experiencing the worst fires in history, and they are becoming more frequent. They must be a priority. \nhttps://t.co/v7Pb3BreO5"]["It is clear that the cause of justice and equality has never been more urgent. We must stay engaged, stay active, and stay loud."]["This country needs more than a declaration; we need more funding to combat the opioid epidemic that's threatening millions."]["We made a promise to young #DACA recipients. People must stop playing politics with their lives."]["Around 700 women die every year from pregnancy or delivery complications. We must do better as a nation to get them the care they need. https://t.co/821Bx0gAXK"]["This legislation is a direct attack on women’s reproductive and economic freedom. \nhttps://t.co/lz4BQH6sNa"]["This is troubling. Americans deserve ​answers into how ​this happened.\nhttps://t.co/iEgtmWaDFQ"]["A fee increase will hurt working families who want to enjoy our nation's natural beauty and public lands.\nhttps://t.co/p2fJz3pbhH"]["Just a reminder that funding for CHIP, which provides care for 9 million children, still hasn’t been renewed. It’s been 27 days."]["Leadership starts at every age. #FlashbackFriday https://t.co/QLKP072lYe"]["California has the largest number of DACA recipients. Let’s do the right thing and protect them. #DACA"]["Shackling pregnant women, some even while they give birth, is dangerous and downright cruel. \nhttps://t.co/pRDN9OqeNC"]["Creating media conglomerates, that amplify a few wealthy voices, is not in America's best interests. \nhttps://t.co/9U2RkbsEaV"]["California is leading the way and preparing for increasing wildfires, but the federal government must do its part. \nhttps://t.co/cn2hEd5TV4"]["Tell Congress that you agree: No spending bill without a DACA fix → https://t.co/VW6uktMf3w"]["More than 700,000 DACA recipients fear they will be deported from the only country they’ve ever known.\nhttps://t.co/jE6CH8ce1D"]["@broadcity I see you 👀"]["I subscribe to the notion that the American dream belongs to all of us, not just the wealthy or powerful."]["Entire communities in CA were devastated by the wildfires. If you or anyone you know needs assistance, please go to https://t.co/1Y2Bh5P3vr. https://t.co/v8HbtTbj8u"]["Let me be clear: I will oppose the end-of-year spending bill unless it fixes DACA.\nhttps://t.co/Y4lEesFg30"]["Natural disasters—from fires to hurricanes to floods—do not discriminate by region or by party. We must help each other when these hit."]["Yesterday the GOP denied consumers rights and protections from big banks and predatory lenders. Wall Street was chosen over Main Street. https://t.co/eebxpwtwxe"]["Donny Riveras, a young man in Santa Rosa, risked his own life to save his neighbors before the fires spread to their neighborhood. https://t.co/7lgDsBiIgV"]["From health care to climate change, I want to hear from you about the important issues facing our country → https://t.co/5S0FLBl1H9"]["Don’t take this heat lightly. There is a chance of elevated fire danger — please stay alert. \nhttps://t.co/S8SeWM8zso"]["It’s been 24 days and the Republican-controlled Congress has yet to renew CHIP. We must act quickly. \nhttps://t.co/tLJvDBcV94"]["If you were affected by the recent wildfires and need relief assistance, please visit https://t.co/1Y2Bh66EU1."]["The GOP is trying to pass through their budget with a $1.5 trillion cut to Medicaid &amp; Medicare. Simply put, Americans deserve better."]["Dreamers are valuable to our economic future. Congress must act now. \nhttps://t.co/uR1abUpcQU"]["This Administration’s campaign against students with disabilities continues. We should be doing more, not less, to help them. https://t.co/g5flDmlpfO"]["CHIP provides kids with:\n→Routine check-ups\n→Immunizations\n→Dental care\n\nNot reauthorizing this program leaves up to 9M children vulnerable."]["A domestic violence organization launched a program in California to help train survivors to become entrepreneurs. \nhttps://t.co/FCfu1v2t3r"]["A budget is a reflection of our values and should invest in our middle class. Our country deserves it."]["Opioid abuse will not end when pharmaceutical companies flood our communities with drugs. \nhttps://t.co/LyiWiOk0AX"]["Under the GOP budget, they give tax cuts to the top 1% while leaving the federal government unable to pay $1.5 trillion worth of bills."]["Earlier this week I pressed the OPM nominee on what he’ll do to protect LGBTQ federal workers from discrimination in the workplace. https://t.co/51dpLXmakH"]["The Affordable Care Act open enrollment period begins November 1 and runs through December 15. More info here: https://t.co/zmKsbKOrYE."]["ICYMI: Sen. @DianneFeinstein and I are calling for improvements to the emergency alert systems. \nhttps://t.co/T1JbZUlQeD"]["More than 4,600 Californians die each year from opioid overdoses. We need to treat this epidemic like the public health crisis it is."]["Thank you for all the wonderful birthday wishes! I really appreciated all the tweets, calls, and messages."]["The number of uninsured Americans rose by over 12% for the first time since 2014. We must ensure health care is a right, not a privilege. https://t.co/sFtqsQdbCK"]["The budget passed by the Senate GOP cuts Medicaid &amp; Medicare by $1.5 trillion &amp; will drive up our nation’s deficit. Americans deserve better"]["My Democratic colleagues and I are calling on the DHS to ensure that every single storm-related death is being counted correctly. https://t.co/XtpMHHj2Cs"]["🎉🎂 #HappyBirthdayKamala from Team Kamala! 🎂🎉\nSign the card we’re giving her: https://t.co/0x1trJ5yTn"]["Americans deserve better than the GOP budget that puts America’s future at risk and doesn’t put working families on the path to success."]["Just a reminder that Trump’s border wall is a waste of money. \nhttps://t.co/5XT5IGuuxv"]["Love you @douglasemhoff! https://t.co/npMfalXMw3"]["The budget that passed the Senate yesterday hurts our nation’s most vulnerable — which is why I voted against it. \nhttps://t.co/EA3uGJBjh3"]["Congratulations to the @Dodgers on their win against the @Cubs last night. On to the World Series!"]["Join #TeamKamala in wishing the Senator a happy birthday! #HappyBirthdayKamala https://t.co/iWjoOrIB0i"]["Four weeks after Hurricane Maria:\n→Only 19% of Puerto Rico has power\n→70% have clean drinking water\n\nWe can't forget about them."]["To all those who are celebrating in California, wishing you and your family a joyful Diwali."]["Senator @DianneFeinstein and I are committed to pushing for geo-targeted federal Wireless Emergency Alerts.\nhttps://t.co/JbuvabcWGR"]["To all LGBTQ youth who face bullying and harassment because of their identities: We have your back today and every day. #SpiritDay"]["Muslim Ban 3.0 was driven by campaign rhetoric &amp; hate, not national security. I joined my colleagues on a bill to block its implementation."]["It’s time for Congress to come together and do right by the most vulnerable among us: our country’s kids. \nhttps://t.co/g29idAnl5p"]["Money bail overtly affects low-income communities and communities of color. 9 out of 10 defendants detained cannot afford to post bail."]["If you’re starting cleanup, be sure to protect yourself: wear long sleeves, pants, boots, sunglasses, and a mask. \nhttps://t.co/sYfMesVK4p"]["In hospitals across the state, staff worked around the clock to save lives even after their homes burned down.\nhttps://t.co/ry5kVanY5T"]["Right now in CA it’s about recovery and still fighting fires. We’re with those affected every step of the way. \nhttps://t.co/Dbl5iSqlEv"]["A reminder that open enrollment begins on November 1. Despite Trump’s actions and words, enrollment will still go on\nhttps://t.co/ybEmT3AT8i"]["As we learn more names &amp; more stories, I want to give my condolences to all the victims of the California wildfires.\nhttps://t.co/v5PshLtyw7"][".@RepCarbajal and I introduced bicameral legislation to designate nearly 250,000 acres of public land as wilderness for future generations."]["Great to join @PeterHamby for @Snapchat’s Good Luck America story. Check it out now: https://t.co/JQQRXInmF5 https://t.co/O2Ru6XYuQJ"]["Trump’s heartless actions will have a dramatic ramifications for Americans who need health care. \nhttps://t.co/Ju8jhep92e"]["While Trump disregards the people of Puerto Rico, we must remember what’s happening is a humanitarian crisis and it’s up to us to help them. https://t.co/eVACBBDkSc"]["To everyone who has come forward with #MeToo, thank you for your courage. To all survivors, know that you are not alone."]["This weekend @JerryBrownGov, @DianneFeinstein, and I surveyed wildfire damage and met with residents. 📷: @JerryBrownGov https://t.co/QxKdqoEZjy"]["Dreamers are in a state of limbo right now. We must be compassionate — pass a clean Dream Act and work on comprehensive immigration reform. https://t.co/dXmkaEIGRc"]["Don’t forget that Congress has still not renewed the funding for CHIP, which provides care for millions of our kids."]["Thank you to all the first responders and medical professionals who are running on little sleep and continuously saving lives."]["Throughout every natural disaster we have seen Americans rise up to help our neighbors. Now's the time to lift up CA https://t.co/ogp04kAmt1"]["This Administration’s disturbing targeting of immigrant communities has led to a discouraging decline in domestic violence reports. https://t.co/yQvESOvVzJ"]["These are American citizens. We must treat them that way and do all we can to help.\nhttps://t.co/46eKMeWIPg"]["Be sure to follow @Cal_OES and @CAL_FIRE if you’re not already for critical wildfire updates. Please heed any evacuation orders."]["Numerous Californians are hurting right now from the wildfires. Please consider chipping in to help them out: https://t.co/ogp04kAmt1"]["Trump’s decision earlier this week endangers health care for our friends, family, and neighbors. \nhttps://t.co/yoqLxrkHWS"]["There are a number of ways to assist the victims of the fires wreaking havoc in California: https://t.co/bOGDdqSULw"]["Please be sure to keep all the medical professionals who are saving lives in California in your thoughts. \nhttps://t.co/uqn8Mwt1MV"]["As the #Californiawildfires continue, please consider donating to those who have been displaced or hurt: https://t.co/ogp04kAmt1"]["From cutting the open enrollment period to the latest exec. order, this Admin is actively undermining health care for millions of Americans. https://t.co/pxKt0S15Gk"]["Americans deserve a budget that creates opportunities for affordable education and provides for safer communities."][".@MarshallMovie is an amazing tribute to a man who changed the course of American history for the better through the power of the courts."]["Winds are expected to increase again tonight. Make sure you are prepared for wildfires: https://t.co/oYbJfpxvFs"]["Happy birthday to my wonderful husband @douglasemhoff! Can't wait to celebrate your special day with you. https://t.co/BnLEwGj0VH"]["Your help will make a real difference in the lives of so many Californians affected by devastating wildfires: https://t.co/ogp04kAmt1"]["Thank you to California’s firefighters who are out there, often for more than 24 hrs straight, battling these blazes\nhttps://t.co/XTVlEgHEf2"]["This is cruel and vindictive. This decision could cause premiums to skyrocket for millions of Americans.\nhttps://t.co/FPWIP2IylP"]["This DACA fight is about all the young people who were brought here, some before they could walk or talk.\nhttps://t.co/c257JxPSYY"]["Your boss should not be making health care decisions for you. Period. \nhttps://t.co/0247RNHrw1"]["With the arbitrary DACA deadline, the Trump Admin tried to set Dreamers up for failure. Let’s ensure they don’t fail &amp; pass the #DreamAct."]["If you live in an area affected by smoke, but are still safe, please try to stay in buildings with filtered air.\nhttps://t.co/kGtFC4XxVE"]["Reminder: We’re 12 days into October and Congress has yet to renew CHIP, the children’s health insurance program, after funding expired."]["This Administration's efforts to sabotage the ACA will harm Californians. Health care isn't a game, people's lives are at risk. https://t.co/zlTEFs2wyC"]["Please chip in whatever you can to support Californians who have been displaced or hurt by the wildfires: https://t.co/ogp04kiLBt"]["To tackle the challenges of the 21st century, we must empower women and families, lifting them up, not tearing them down. #DayoftheGirl"]["For those who want to help the victims of the #CaliforniaWildfires — here are 8 things you can do right now: https://t.co/TczGFofsqO"]["On #ComingOutDay, no matter who you are or who you love, know that you are not alone."]["Food banks in Napa County, Yuba County, and Sonoma County are currently accepting donations. \nhttps://t.co/jCDDnmQGoC"]["The link below includes a list of shelters in California for wildfire evacuees. Please share. \nhttps://t.co/wupAcq5KcJ"][".@DianneFeinstein and I called on Trump to expedite federal assistance to help areas affected by wildfires rebuild.\nhttps://t.co/0bjPiKEn1S"]["As a nation of immigrants, we can’t turn our backs on Dreamers, potentially forcing them to leave the only home they’ve ever known."]["Roberto Clemente, born in Puerto Rico, was inducted into the National Baseball Hall of Fame in 1973. #HispanicHeritageMonth https://t.co/hwB4HjGWo0"]["The federal minimum wage should be a living wage. $7.25 an hour is not enough to keep a roof over your head."]["Rolling back these protections endangers access to clean air. It’s outrageous. \nhttps://t.co/Zt0h8hshMR"]["Thank you to the first responders and firefighters who are working tirelessly to battle the fires in California.\nhttps://t.co/prS5Fo1aTU"]["I believe it is time to replace the divide and conquer of our politics with a new way of thinking: Diversity + Commonality = Unity."]["Please heed evacuation orders for wildfires. Follow @Cal_OES &amp; @CAL_FIRE for safety info. Stay safe out there. https://t.co/HHUAAOEXEb"]["Immigrants helped build this country. They are servicemembers, business leaders, Nobel winners, teachers, and neighbors."]["Today we cannot forget the indigenous people who were here before us. \nhttps://t.co/ntocE86fEu"]["I strongly support @DianneFeinstein's reelection campaign, and am thankful she is again offering to serve our state. https://t.co/0hR6clqrEz"]["Dreamers are Americans in every way. We are doing them a disservice by not passing the Dream Act. \nhttps://t.co/yOBAZeq143"]["The GOP budget would slash Pell Grant funding, which makes college more affordable for more than 8 million students, by more than $100B."]["Keep fighting every single day to defend and expand on the progress made for women’s rights and reproductive health. We can’t fall backward."]["The American flag you see waving over the United States Capitol is about fighting for what we can be as a nation.\nhttps://t.co/uckZfC6ipp"]["To everyone fighting for our Dreamers: Walk with your chin up and shoulders back. You are fighting for the future of this country."]["Congress needs to stop playing politics with our health care, and going out of their way to target women in the process."]["DACA recipients would contribute $460B in the national GDP over the next decade. Creating a path to citizenship makes our economy stronger."]["Establishing a national memorial would ensure we never forget the lives lost during the St. Francis Dam disaster.\nhttps://t.co/ttFtxXN6CZ"]["We don’t need weapons of war on our streets. https://t.co/IFuC9sWKp5"]["It’s true for all things — when we move forward as a community, when we advance as a family, we become an overwhelming force."]["Fighting for our Dreamers is about patriotism and ultimately ensuring we live up to the ideals of our country each &amp; every day. #HereToStay https://t.co/eUI2u9B7jr"]["The GOP budget cuts Medicare by $473B and Medicaid by $1 trillion, all in order to reduce taxes for the top 1%. It’s shameful."]["Bump stocks increase the fire rate for a semi-automatic weapon — up to 800 rounds/min. Tell Congress to ban them: https://t.co/awgrgtOooL"]["Americans deserve a budget that strengthens the middle class and opens up more opportunities for working people to succeed."]["California lost many precious lives on Sunday. We must never forget their names and their stories. \nhttps://t.co/4Yi5eCr2Gy"]["This administration just rolled back birth control coverage for American women. In 2017. https://t.co/aLZLrpFOCg"]["All of us in public service have a duty to give voice to the vulnerable, give voice to the voiceless, and give dignity in the process."]["We made a promise to Dreamers that we would not deport them. We must pass the Dream Act. 📹: @MoveOn https://t.co/IhZYxYOArX"]["Just like our friends in Texas or Florida, Puerto Rico and the U.S. Virgin Islands deserves to be a priority.\nhttps://t.co/gT4XjOo2rP"]["The GOP’s tax plan opens the door to Medicaid and Medicare cuts. We can’t let them get away with this. \nhttps://t.co/iFHdEeqr4O"]["A government has three functions: public health, public safety, and public education. The GOP budget doesn’t prioritize any of them."]["I’m joining with @SenFeinstein on legislation that would ban gun bump stocks. It is just common sense. \nhttps://t.co/eLcpNUuAgQ"]["Very good news this #BreastCancerAwarenessMonth: Improvements in screening and early detection has led to a drop in breast cancer deaths. https://t.co/RlAaC8AXoL"]["Americans are being hurt by this Administration's efforts to sabotage the Affordable Care Act. It’s indefensible. \nhttps://t.co/UMwpKEbwbH"]["Jonathan Smith risked his life in Las Vegas so others could get out safely. \nhttps://t.co/KCJX1n7hhE"]["No American citizen should be left clamoring for help after a devastating hurricane. \nhttps://t.co/0vnHQ33SG1"]["13,943 kids in Washington, D.C. are at risk of losing health care. Call Congress today: (202) 224-3121. #ExtendCHIP"]["7,387 kids in Wyoming are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["171,552 kids in Wisconsin are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["48,187 kids in West Virginia are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["66,517 kids in Washington state are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["192,831 kids in Virginia are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["5,305 kids in Vermont are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["58,410 kids in Utah are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["1,075,212 kids in Texas are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["105,990 kids in Tennessee are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["18,507 kids in South Dakota are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["81,574 kids in South Carolina are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["342,268 kids in Pennsylvania are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["140,786 kids in Oregon are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["187,971 kids in Oklahoma are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["223,583 kids in Ohio are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["4,955 kids in North Dakota are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["256,446 kids in North Carolina are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["684,625 kids in New York are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["15,100 kids in New Mexico are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["230,960 kids in New Jersey are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["17,946 kids in New Hampshire are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["68,951 kids in Nevada are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["55,041 kids in Nebraska are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["44,688 kids in Montana are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["87,790 kids in Missouri are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["88,531 kids in Mississippi are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["3,876 kids in Minnesota are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["82,693 kids in Michigan are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["185,578 kids in Massachusetts are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["137,592 kids in Maryland are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["161,565 kids in Louisiana are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["92,728 kids in Kentucky are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["79,319 kids in Kansas are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["84,989 kids in Iowa are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["114,927 kids in Indiana are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["325,990 kids in Illinois are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["35,964 kids in Idaho are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["25,780 kids in Hawaii are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["232,050 kids in Georgia are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["374,884 kids in Florida are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["17,784 kids in Delaware are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["25,551 kids in Connecticut are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["167,227 kids in Colorado are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["2,022,213 kids in California are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["120,863 kids in Arkansas are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["88,224 kids in Arizona are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["15,662 kids in Alaska are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendCHIP"]["150,040 kids in Alabama are at risk of losing health care. Call your Senator now: (202) 224-3121. #ExtendChip"]["9M children need us to speak up for them. That’s why I will be sharing how many kids in each state, plus D.C, are at risk without CHIP:"]["We need to pass a clean Dream Act, no strings attached. Dreamers are counting on Congress to take action.\nhttps://t.co/UZ4TiTMeJF"]["We can’t forget Americans in Puerto Rico &amp; the US Virgin Island who are suffering, many still without electricity &amp; access to food or water."]["Even in terrifying and heartbreaking moments, there are people who are willing to help strangers.\nhttps://t.co/ukC6ezaa98"]["Over the weekend, the GOP let a program expire that provides health insurance for 9M kids. Congress must re-authorize funding immediately."]["We’ve lost far too many of our classmates, friends, family members, and children to gun violence. \nhttps://t.co/0cEDR2QFUC"]["Senate GOP’s proposed 20-week abortion ban is another example of politicians playing politics with health care. #NoAbortionBan"]["It’s compassionate to pass a clean Dream Act and allow Dreamers a path toward citizenship."]["Dreamers are in our colleges, in our medical schools, and serving in our military. We must keep the promise we made to them. #DACA"]["In front of the Capitol speaking out for DACA recipients. https://t.co/2jwPaA70QD"]["DACA recipients, if your status expires before March 5, 2018, we recommend you mail your renewal application TODAY to meet the 10/5 deadline"]["Too many innocent lives have been lost. We cannot throw up our hands in despair. The time requires us to act. https://t.co/8YZJM6GB3H"]["Our hearts break for the victims and their families and our thoughts are with those wounded, after the horrific Las Vegas shooting."]["On the bench, Justice Sonia Sotomayor has fought for the people, including voting against Citizens United. #HispanicHeritageMonth https://t.co/cV1huaNJu7"]["I stand for and I stand with California’s 220,000 DACA kids. They deserve to stay and deserve to be heard. #DreamAct"]["Puerto Ricans are Americans and we can’t ignore their suffering. Donate now to help local nonprofits: https://t.co/JiRB1ZNraf"]["Let us have the courage to speak truth. Together — armed with our commonality and faith — let us be strong in our fight for justice."]["Let me be clear: When we talk about patriotism and love of country, it is about fighting for who we are and who we can be."]["Building coalitions to wage our fight for justice is about love of country. It’s about patriotism."]["We must replace the money bail system with a risk assessment system. We need to reform our broken bail system."]["Let’s speak the truth that in our country immigrants are being vilified, living in fear of a midnight knock on their door."]["Let’s speak truth that we have been reminded of too often: racism is real, sexism, homophobia, and hate are real in our country."]["The bible teaches about redemption. We will all make mistakes but is it not a sign of a just society that we allow folks to earn a way back?"][".@KasimReed is one of the finest mayors this country has ever seen. Others watch what he does. He doesn't accept false choices."]["My heart is full. I am so very honored to celebrate this anniversary with First Church. Coming to ATL has always been a homecoming for me."]["Tune in now to watch Senator Harris’ remarks at the Historic First Congregational Church →\nhttps://t.co/Rrl4o0BASJ"]["This morning I'll speak at the First Congregational Church’s 150th anniversary celebration at 11 am ET. My staff will livetweet my remarks."]["In times of crisis, Americans prove we are stronger when we come together and lift each other up. We have to help our brothers and sisters. https://t.co/HQv0CDh4jA"]["#NationalPublicLandsDay serves as a reminder of the need to preserve our nation’s natural beauty so that future generations can enjoy it."]["Thank you for all the work you are doing to help Puerto Ricans. Your work is inspiring.   \nhttps://t.co/jKZEQHTTct"]["On #NationalPublicLandsDay, join me in celebrating the magnificent natural beauty our nation and state have to offer. https://t.co/dKuTBIBblq"]["We can't forget about the US Virgin Islands. Back-to-back storms left many struggling to recover. They also need our help. https://t.co/pwvLxMKsMz"]["The people of Puerto Rico are suffering. They lack clean drinking water and many of them are without electricity. Congress must act now."]["When times are tough, we stand united. Donate to the people of Puerto Rico now: https://t.co/JiRB1ZNraf"]["Our brothers and sisters in Puerto Rico are American citizens who need our help. I stand with San Juan Mayor @CarmenYulinCruz."]["Here’s who Trump’s tax plan would benefit:\n✅ Corporations\n✅ The ultra-wealthy\n\nWho wouldn’t benefit? \n❌Many working Americans"]["Puerto Ricans are Americans, and it’s up to us to help them as they recover from Hurricane Maria. \nhttps://t.co/zWdShNNmgl"]["“It’s definitely a sense of fear, not knowing what my future holds.” Dreamers are terrified. #DreamAct must pass.\nhttps://t.co/TUdqfwNa2h"]["No American ​city ​should have to beg the federal government for help in the middle of a crisis. ​We must pass aid to PR now. https://t.co/yHvjrgq9gW"]["Funding for the Children’s Health Insurance Program expires tomorrow! Congress must act now on behalf of the 9 million children. https://t.co/721EnRvNsG"]["DACA recipients: If your permit expires on or before March 5, 2018, your renewal application must be received by October 5. https://t.co/B4agJI92JF"]["Puerto Rico hospitals are at a standstill while they’re without power. Americans are suffering. We must help.\nhttps://t.co/pOKCdvWRG7"]["#EndMoneyBail is about ensuring bail is based on risk to the community, not the amount of money someone has. \nhttps://t.co/hm0g5wmcU5"]["The gap between the rich and the poor continues to rise. These inequalities must be addressed. \nhttps://t.co/KfzYQnhKv0"]["Breast cancer is no match for my friend @OfficialJLD. Sending love and prayers.\nhttps://t.co/c38JgWRXhE"]["During #HispanicHeritageMonth, we honor César E. Chávez, who led marches and boycotts to protest farmworker treatment, pay, and conditions. https://t.co/FikHtfF5R7"]["We need to pass the #DreamAct as soon as possible. Hundreds of thousands of Dreamers are terrified. Let’s give them peace of mind."]["Not reauthorizing CHIP funding would leave nearly 9M children vulnerable without health care coverage. Congress must act now. https://t.co/YOKNuae5Lf"]["We have to take back Congress in 2018. It’s never too early to donate to local races or volunteer. Our success hinges on our mobilization."]["We’ve seen this before: Tax cuts for corporations, while the middle class is left behind. \nhttps://t.co/0T6yeauDzZ"]["Sen. Gardner and I called on Sec. Perry to work with American electric utilities to assist Puerto Rico in restoring electric services. https://t.co/qbSgY8JaIY"]["GOP won't stop fighting to repeal the ACA. But that’s not what Americans want. Time to work together to improve it.\nhttps://t.co/HtOHrOXLZD"]["There is a humanitarian crisis going on in Puerto Rico. They are Americans. We can’t turn a blind eye. \nhttps://t.co/J8QGV8wV6s"]["As my mother used to say, “you may be the first to do many things, but make sure you are not the last.” \nhttps://t.co/cheXp0couI"]["Defrauded students are after one thing: justice from predatory for-profit colleges. \nhttps://t.co/lwAaQiZeLR"]["Given the recent storms, I’ve joined 37 Senators calling for the Trump Admin to extend the Oct 5 deadline for DACA renewals."]["Today is #NationalVoterRegistrationDay. Your voice matters. Register to vote here: https://t.co/0fkmCceSEf"]["People with disabilities in our nation should not have to be begging our government for access to basic, affordable medical services."]["“When my husband lost his job, the Affordable Care Act helped us as we got back on our feet.” —Julie from Spokane https://t.co/DBOGfLJLAO"]["The health care debate is a civil rights fight. This fight isn’t over yet — let’s roll up our sleeves and win this once and for all."]["Anne from LA: I've survived ovarian cancer 3 times. Every Republican repeal and replace plan would leave me defenseless. https://t.co/rUgg9mNsod"]["It’s high time we crack down on student loan giants that mislead vulnerable students. \nhttps://t.co/ZjIhT8oU6m"]["Republicans are just a few votes short of passing #GrahamCassidy. 32+ million would lose their health care. Keep calling. Keep writing."]["Puerto Rico has gone through so much. We can’t forget that they need our help.\nhttps://t.co/dSevhPPJ7P"]["We can’t take anything for granted. The Graham-Cassidy “health care” bill would gut Medicaid and cause costs to go up: (202) 224-3121."]["This anniversary serves as a reminder that we must address the disparities in education for students of color."]["The courage and bravery they embodied would pave the way for desegregation at schools, but the struggle still persists today."]["The Little Rock Nine, as they came to be known, would endure violent threats, harassment, and even have acid thrown on them."]["Sixty years ago today, nine Black students started at an all-white school following the Brown v. Board decision banning segregation. https://t.co/792TRjsl7v"]["“I'm asking you, please, as my representative, fight with everything you've got — as we, the sick, do.” —Justine from Los Angeles https://t.co/qULkWO382h"]["It is a serious injustice that for the same offense, someone who can pay bail gets out, but someone who can’t pay sits behind bars."]["Don’t stop calling, writing letters, and tweeting, telling Senators to vote NO on #GrahamCassidy. This isn’t over until Sept 30th."]["Reminder: Dreamers whose renewal will expire before March 5, 2018, MUST submit their renewal before October 5.\nhttps://t.co/8yNaHig3jw"]["Reforming our bail system is about economic justice. https://t.co/g24WOzcclm"]["We only have a few days left to defeat the #GrahamCassidy bill. Call, tweet, write a letter, march. Are you with me?"]["Money bail disproportionately affects low-income communities and communities of color. Black men pay 35% higher bail amounts than white men. https://t.co/dkxZr71Eut"]["Under #GrahamCassidy, CA would lose $78 billion in federal money by 2026. Keep up the calls, this isn't over yet. \nhttps://t.co/gj8Q2ktg4t"]["You can be healthy one day &amp; sick the next. You never know what will happen in the future. That’s why we must #ProtectOurCare from the GOP."]["Before the Affordable Care Act, women were charged more just because they are women. We can’t go back. \nhttps://t.co/62wob9m4dI"]["California is leading the charge against Trump’s unrealistic and wasteful border wall. \nhttps://t.co/bjDU9BjKT1"]["We should make it easier to get care, not harder. Health care is a right, not a privilege for just the healthy and the wealthy."]["This weekend’s to-do list:\n📞 Call your Senators at (202) 224-3121\n✏️ Write your representatives\n\nRepeat. It’s up to us to save the ACA."]["This is infuriating. We should be strengthening, not weakening, protections for sexual assault survivors. https://t.co/VP5EIKkMHp"]["To everyone who has spoken out against #GrahamCassidy so far — your calls, tweets and letters are working. Keep up the pressure until 9/30."]["Lorna fought breast cancer, now it’s our turn to fight for her &amp; every other breast cancer survivor who would be affected by #GrahamCassidy. https://t.co/04mqmQasOf"]["Limited debate and no full CBO score. And the GOP wants to vote next week on the Graham-Cassidy “health care” bill? Shameful."]["Under the GOP bill:\n❌Planned Parenthood would be stripped of critical funding\n❌ Maternity care wouldn’t be required \nhttps://t.co/4cYNfSwzBW"]["It would be an irresponsible to take health care away from tens of millions of people to back a flawed campaign promise. https://t.co/vSFZLkqeT6"]["“Dreamers in the military face more than DACA deadline”\nhttps://t.co/f9snT4YnCi"]["Let's redouble our efforts to ensure this “health care” bill fails. Costs will ⬆️, care will ⬇️ &amp;coverage for many will disappear altogether"]["The GOP bill would let states allow insurance companies to price Americans out of coverage for having pre-existing conditions. https://t.co/F4QfpgZsxK"]["The devastation seen in Puerto Rico is heartbreaking. Here are ways to help →\nhttps://t.co/5wMCAu4Z6a"]["Graham-Cassidy bill would let states allow insurance companies to deny prenatal &amp; mental health care. We can’t call this a health care bill."]["The people won last time. So keep calling and writing letters. Time to defeat this “health care” bill once and for all: (202) 224-3121. https://t.co/zr5I1fecQk"]["We have ten days or less to defeat the Graham-Cassidy repeal bill. Let that sink in: Ten days.\n\nKeep dialing. (202) 224-3121."]["We must roll up our sleeves and keep up the pressure: (202) 224-3121. Health care is a right for all, not a privilege for the few. https://t.co/0TSsLwF1jy"]["L’Shanah Tovah to all who are celebrating Rosh Hashanah. Wishing you a joyous new year."]["This health care battle is personal to each and every one of us in this country. Tell me your story: https://t.co/Pmd7IiJVfM"]["Thank you for speaking the truth, @JimmyKimmel. Graham-Cassidy will hurt many Americans. Call your Senators at (202) 224-3121. https://t.co/yMaJBDBWuY"]["GOP “health care” bill would weaken pre-existing conditions protections, leaving many without access to the health services they need."]["Whether someone is detained before trial should be determined by whether or not he or she is a risk — not whether he or she is rich. https://t.co/dkxZr71Eut"]["Latest report shows this Administration will open up some national monuments to mining and timber production. That’s outrageous. https://t.co/wUginLY99S"]["Whether someone is detained before trial should be determined by whether or not he or she is a risk — not whether he or she is rich."]["Dolores Huerta is a leader in the farm worker, women’s, and civil rights movements and today we celebrate her for #HispanicHeritageMonth. https://t.co/ugoNijLLtq"]["The Graham-Cassidy bill would be disastrous for Americans. Memorize this number and call to save our health care: (202) 224–3121."]["Taking away health care from Americans won’t make us a better nation. The people won last time. Let’s do it again. https://t.co/Yet8FXLUf6"]["Zeke was born with hemophilia, so it's difficult for his blood to clot. I’m fighting for children like him.\nhttps://t.co/Ge5c0w8AYo"]["Latest ACA repeal would: \n→ Rip away coverage from millions, including children &amp; seniors\n→Roll back pre-existing condition protections"]["In July, your calls saved millions of Americans from losing health care. It’s on all of us to keep up the fight. Keep up the calls."]["We need all hands on deck over the next few days &amp; weeks. Call your reps &amp; tell them to vote NO on the Graham-Cassidy bill: (202) 224–3121."]["“The things that make us different, those are our superpowers.” Congratulations @LenaWaithe on making history last night! https://t.co/hm5MARuQlU"]["Ways to celebrate #ConstitutionDay (or week): Attend a city council meeting. Sign up to run for office. Register to vote. Get involved."]["(202) 224-3121\n(202) 224-3121\n(202) 224-3121\n(202) 224-3121\n\nTell your representatives to vote NO on the Graham-Cassidy “health care” bill."]["These immigrants wanted to serve our nation. They deserve that opportunity. \nhttps://t.co/yUTMeSUmq0"]["Just a reminder that this is the “health care” bill Republicans are trying to push through. We saved the ACA once, let’s do it again. https://t.co/CSKwbzMSl1"]["Text FEARLESS to 225568 now to get #TeamKamala updates from Capitol Hill and the Golden State."]["Today is #ConstitutionDay, a time to remember that our nation was founded on the ideals of liberty and justice for all."]["The Graham-Cassidy “health care” bill is just another bad bill that would ⬆️ costs and ⬇️ coverage for Americans. #SaveACA"]["I’ve been fighting for Dreamers since day one and I know I, and people across the country, won’t give up on them.\nhttps://t.co/Te6U12zrbt"]["Are you a Dreamer or know a Dreamer? Remember: The DACA renewal must be submitted before October 5. \nhttps://t.co/yrqJlD34wa"]["Remember when we saved health care for millions of Americans? We have to do it again. Call your reps now: (202) 224–3121."]["Almost all students understand the struggle of student loans. Enough. It’s time we make college affordable once and for all."]["Repealing the ACA is back from the dead. It’s up to us to stop Republicans from pushing this bill through. \nhttps://t.co/uftpL6lhp9"]["Funding Trump’s unrealistic border wall would be a gross misuse of government funds."]["Congress must swiftly pass the #DreamAct. It’s the right thing to do. 800,000 Dreamers know no other home."]["ICYMI: Watch my speech endorsing @BernieSanders #MedicareForAll:\nhttps://t.co/6pS4iHEdCY"]["Dreamers, we want to hear your stories. Use the hashtag #HereToStay and we’ll RT some so others can hear your voice."]["The difference between sitting in jail or not before trial should be based on the risk you pose to the community, not how much $$$ you have. https://t.co/KfytnjwdG5"]["Sending prayers to those injured in London at Parsons Green this morning."]["When it comes to health care, prevention first is key. If we’re dealing with sick Americans in the emergency room, it’s too late &amp; expensive"]["Fixing these discrepancies is critical — all children deserve the chance to succeed in school.\nhttps://t.co/IsvfbdslI4"]["32M—that’s how many Americans could lose coverage if the GOP’s latest health care scheme passes. We have to stop them. https://t.co/CSKwbzMSl1"]["#MedicareForAll will ensure Americans have access to the health care they need from the day they are born to the rest of their lives."]["To send Dreamers back to a country they don’t know is just wrong. It goes against the ideals of who we are as a nation."]["All Americans should receive the health care they need regardless of where they live or their income. \nhttps://t.co/lI8s2Iokhx"]["\"Americans should not hesitate about going to the doctor because they do not have enough money.\" https://t.co/9qhjNkmXgs"]["The vast majority of Americans are standing with us to protect our Dreamers. There is no excuse for Congress—act now https://t.co/HDjC12uJPK"]["We don’t have to let extremists define us. Opportunities to do right are right in front of us. https://t.co/sJwQyhDI15"]["“Women have been denied health care for too long. Consider the Hyde Amendment history if we pass Medicare for All.” —@SenBlumenthal"]["“You cannot have justice in this country when millions of Americans cannot get access to health care.” —@CoryBooker #MedicareForAll"]["Let's give taxpayers a better return on their investment. That's why we need #MedicareForAll."]["Everyone should receive care regardless of their income or zip code. This is about a right, not a privilege for the few. #MedicareForAll"]["All of us are standing up and saying \"Let's just do what's right.\" #MedicareforAll"]["“This is not a partisan issue. Health care should be a right. Once and for all.” —@SenGillibrand #MedicareForAll"]["“We can do better w/ Medicare for All. It guarantees peace of mind that when your child gets sick, you can afford it.\" —@SenJeffMerkley"]["“This system is killing too many of my patients. Let’s put an end to a system that puts profits before people.\" #MedicareForAll"]["“People don’t want to hear about politics. They want to hear what we’re going to do to repair a broken healthcare system.\" —@BernieSanders"]["Turn in to CSPAN as we introduce Medicare for All legislation w/ @BernieSanders and 14 of my Senate Dem colleagues. https://t.co/AI2yeVx9B8"]["Men and women who have pledged to serve our country in the Armed Forces deserve respect, not deportation. https://t.co/rJosBVP7wV"]["@BernieSanders If you’re with us in this fight, please add your name to become a citizen co-sponsor of our Medicare for All bill: https://t.co/pD7PtYj4ZF"]["@BernieSanders It’s about making reality the idea that health care is a right for all, not a privilege for the wealthy few."]["@BernieSanders It’s about making sure no one has to live in fear because a sudden illness or injury could bankrupt their family."]["@BernieSanders Today is about making sure no American has to worry about living without health insurance because they lose their job."]["Later today, I’ll stand alongside @BernieSanders and 14 of my Senate Democratic colleagues to introduce Medicare for All legislation."]["The more diverse decision makers are, the better chance we have of ensuring all perspectives are considered in the legislative process."]["It’s time we start treating opioid addiction as a crisis that touches every community in our country.\nhttps://t.co/ikz6LokfGc"]["Last month #TeamKamala raised more than $150,000 to help Harvey victims within 48 hours. Let’s do it again for Irma: https://t.co/6khU2HSAA0"]["Now more than ever, it is time to roll up our sleeves and stand with Dreamers who contribute to our society and our economy."]["“If you really care about the quality of somebody's life as much as you care about the quality of your own, you have it made.”\n—Edie Windsor"]["Opioid abuse deserves to be treated as a public health matter, instead of locking people up who suffer from substance abuse."]["Dreamers know no home other than the United States. https://t.co/AIPLTxYLYb"]["Make a donation to support local nonprofits in Florida that are helping the victims of Hurricane Irma: https://t.co/6khU2HSAA0"]["Our nation will never forget those we lost on 9/11 and the brave first responders who risked and gave their lives to save others. https://t.co/TKhz2gJCRU"]["The people of California are holding Floridians in our thoughts and prayers today."]["My message to this Administration: Dreamers contribute so much to our nation and deserve to stay."]["“Local law enforcement leaders are backing a bipartisan proposal to reform the nation’s criminal bail system.”\nhttps://t.co/OiMEYARJek"]["Dreamers: If your renewal is set to expire before March 5, 2018, you must renew before October 5.\nhttps://t.co/8yNaHig3jw"]["As Attorney General, I sued Corinthian Colleges for intentionally misleading students &amp; worked to ensure their student loans were forgiven."]["I joined my colleagues in reintroducing the Students Before Profits Act, which will help protect students from deceptive for-profit colleges"]["Under our broken bail system, many times a poor person pays a premium that a rich person doesn’t. https://t.co/aw4CNFeUYg"]["Over the next few days, I’m going to share stories of people who wrote in saying why they support Dreamers. https://t.co/CE0Vz2roQ8"]["“‘This is where I want to live, Peña said. ‘This is the only life I know.’”\nhttps://t.co/8UHPLnJ97M"]["Survivors of sexual assault deserve to be believed, not blamed.\nhttps://t.co/zC0cdm1EbJ"]["Shame on the Justice Department for siding with discrimination. It has no place in our society. \nhttps://t.co/3hzUTnPQfG"]["Who do I regret not putting on my Spotify playlist? I answer that during the lightning round with @AriMelber. https://t.co/vTuXpAHf1u"]["Dreamers: \n✓Serve in our military.\n✓Are college students, law students, scientists. \n\nVilifying them is wrong and irresponsible."]["Are you a Dreamer whose renewal is set to expire before 3/5/18? You MUST renew before October 5. Spread the word.\nhttps://t.co/8yNaHig3jw"]["It’s this simple: Trump’s tax plan enriches wealthy corporations at the expense of the middle class."]["Russia interfered with the election of the President of the U.S. No matter who you voted for, it should trouble all of us. @TheBeatWithAri"]["Reforming our bail system is about public safety and it’s an issue of economic justice for taxpayers. @TheBeatWithAri"]["To send Dreamers to a country that is foreign to them, where they may not even speak the language, is utterly wrong.\nhttps://t.co/wjXFR0WB91"]["#TitleIX protections for sexual assault survivors are under attack. We have to make our voices heard. It's a matter of civil rights. https://t.co/0xRaTYidOS"]["40% of Fortune 500 companies were created by immigrants or the children of immigrants. Immigrants make us a stronger, more prosperous nation"]["#Irma is one of the most powerful Atlantic Ocean hurricanes ever recorded. RT to share ways to prepare → https://t.co/BcGwesLEdi"]["All of us have a responsibility in this moment to speak out and demand Congress save the Dreamers. #DACA"]["Add your name now to urge my Republicans colleagues to immediately allow a vote on the DREAM Act → https://t.co/BrZqFVJoLG"]["Mass incarceration and bail reform isn’t an issue that only impacts California, it affects every state in our nation\nhttps://t.co/0yinI0IznA"]["The Justice Department denied four million American workers the wages they deserve. \nhttps://t.co/L9Kzg7BTNB"]["This is a moment in time that is challenging us to stand up &amp; be heard, not turn a blind eye but confront what is challenging our country."]["Passing the DREAM Act is the right thing to do. https://t.co/pNiCYPIV0b"]["Thinking of all of our friends in Puerto Rico, U.S. Virgin Islands, and Florida ahead of #IrmaHurricane. California has you in our prayers."]["RT to show Republicans in Congress that Americans support a vote on the bipartisan DREAM Act → https://t.co/BrZqFVJoLG"]["The reason I’m supporting Medicare for All is pretty basic — it’s the moral and ethical thing to do. @TheLastWord"]["For Attorney General Jeff Sessions to suggest that Dreamers are anything other than lawful is irresponsible. @TheLastWord"]["It’s irresponsible to suggest to hardworking Americans that the only thing preventing them from getting a job are Dreamers. @TheLastWord"]["Part of what has to happen is that more people should inform themselves of who Dreamers really are. Let’s stop demonizing them."]["800,000 Dreamers know only one home — the United States of America. We need to do the right thing for these kids. @TheLastWord"]["Dreamers make our nation strong and represent the best among us. ​We must fight for them.\nhttps://t.co/IpJUKVBXQO"]["In July, calls to Congress defeated the Affordable Care Act repeal. Time to do it again to pass the Dream Act: (202) 224-3121."]["Ending DACA would cost CAs economy approximately $11B. Not only is rescinding DACA morally wrong, it’ll have negative economic implications."]["Trump’s DACA decision undermines our nation’s values &amp; is a betrayal to the Dreamers who make our nation strong &amp; represent the best of us."]["Add your name to urge GOP leadership in the Senate and House to hold a vote on the DREAM Act: https://t.co/BrZqFVJoLG"]["My message to Dreamers: We see you. We stand with you. We will fight to ensure you can stay in the country you call home."]["The heartless move to rescind DACA is a betrayal of our promise to Dreamers. It’s now on Congress to pass the Dream Act. Call (202) 224-3121 https://t.co/bX1vTopqAu"]["Dreamers grew up in America. It’s their home. Ending the program, deporting them back to a country they don’t even know, would be cruel."]["On #LaborDay, we celebrate California workers and the labor movement that brought us a minimum wage, weekends, and other worker protections. https://t.co/ftI5e8m1gN"]["Ending DACA would be nothing short of heartless. It's on us to demand a vote on the DREAM Act. We must stand with our Dreamers. https://t.co/pi30H6mA1J"]["Go Bison! Congratulations to my alma mater @HowardU on your hard-fought victory last night. #MissionPossible\nhttps://t.co/SJykzl8pyq"]["There's no question that all people should have access to health care.\nhttps://t.co/432T391gr5"]["Big banks like Wells Fargo need accountability and consequences, otherwise actions like these will continue. \nhttps://t.co/S617NyRm9i"]["There is nothing crueler than deporting kids who grew up in America back to a country they don’t even know. #DefendDACA"]["Just like yesterday, this weekend is going to be a scorcher across most of CA. Make sure to check in on your neighbors and the elderly."]["California businesses are leading the charge and calling on Trump to keep DACA. \nhttps://t.co/Ko0Sb3K015"]["Sweeping equal pay protections under the rug won’t make the wage gap disappear. This is a bad move for workers everywhere. https://t.co/xiHePamcNg"]["Do you also support #MedicareForAll? I want to hear your story: https://t.co/BidpctcwdX"]["From defending DACA to health care, to infrastructure, I’m committed to fighting for Californian’s needs in Washington."]["Eid Mubarak to all Muslims who are celebrating in California and around the country. #EidAladha"]["I will fight tooth and nail to protect #DACA. Those young people have only known one home, the U.S. Deporting them would be inhumane."]["Health care should be a right, not a privilege. RT if you agree: https://t.co/pD7PtYj4ZF"]["It’s clear that this administration wants to push the issue of sexual assault under the rug. We can’t let them. \nhttps://t.co/TEo2dP3TWj"]["This is a moment in time that is challenging us not to turn a blind eye, but to face &amp; confront the truths that are challenging this country"]["Had a great time meeting with California mayors earlier this week to discuss bail reform and more. \nhttps://t.co/g7UAuSC0yI"]["I’m absolutely committed to making sure we keep our promise to DACA recipients. #DefendDACA \nhttps://t.co/Q4vX6fO0xe"]["A little red, white, and blue and smiles all around for this #ThrowbackThursday from the campaign trail last year. https://t.co/jPp5d5FivD"]["When times are tough, we stand together, united. Help make a donation to support local nonprofits in Texas → https://t.co/okm84QWPTP"]["I'm co-sponsoring @BernieSanders' Medicare for All bill because health care is a right. Add your name if you agree: https://t.co/pD7PtYj4ZF"]["DeVry recently settled for misleading prospective students with deceptive ads. Not fit to lead fraud office. \nhttps://t.co/7H3wD3OZgF"]["I intend to co-sponsor the Medicare for All bill because it’s just the right thing to do."]["There are folks right now leading federal agencies that challenge the premise of those agencies. It’s ridiculous."]["We must speak the truth: Racism, homophobia, sexism &amp; anti-Semitism is real in this country. We must change the laws to reflect our values."]["People worry about getting a job, keeping a job, retiring with dignity. They don't think about things through the lens of partisanship."]["I reject the premise that we’re a divided nation. There’s more that unites us than divides us. It’s important that we remind people of that."]["To be effective as leaders we have to walk into rooms where people don’t have the same perspectives as we do. And speak up."]["Anyone who wants to run for office needs to use their voice to organize on the issues that are front and center."]["Like with public health, it seems the current administration thinks that public education is a privilege, not a right. It's deeply troubling"]["When we see injustice and when we see something that's wrong in this world, let’s speak up, let’s stand up, let’s fight."]["Attorney General Jeff Sessions says we need to bring back the War on Drugs. Let's be clear — the War on Drugs was an abject failure."]["Republicans are playing politics with climate change on behalf of Big Oil. We gotta fight."]["Trump’s trans military ban is a fundamental violation of people’s rights. We have to fight it."]["California has 220K kids who are living in utter terror right now. This fight is real and present. We have to speak out to #DefendDACA."]["The beauty about what happened with the Affordable Care Act was it showed that our democracy worked. The people spoke and the people won."]