["Recently the small town of Cordova off of Alaska’s coast installed two charging stations, enough to simultaneously power four electric vehicles. For rural Alaska, where energy costs are far above the national average, this is a significant milestone. https://t.co/vIQ2iSAgnE"]["I’m proud to have led a bi-partisan effort, including @SenDanSullivan to urge our colleagues to include disaster funding for coastal communities affected by fisheries disasters as part of any disaster relief package that moves through Congress. https://t.co/4PmNipbOPg"]["Great speech by @SpeakerRyan congratulating my friend and colleague @repDonYoung on being named Dean of the House. Thank you for your dedication to serving our great state and our country. https://t.co/IYIFDXT6Wj"]["Congrats to Christopher E. Finerty of the National Guard Bureau on his promotion to Brigadier General. Brig Gen Finerty has been credited w/ saving over 40 lives. I'm thankful for his many years of selfless service. https://t.co/OqX0wewXiO"]["Pleased to see the Senate passed the RAISE Family Caregivers Act, legislation I cosponsored directing HHS to develop, maintain, and update a National Family Caregiving Strategy to provide the best possible care to American families. https://t.co/jPyKesQJGZ"]["Today during a HELP Committee hearing to address the nation’s opioid crisis, I questioned our panelist on how we can use our positions, federal programs, policies, and funding to address the opioid crisis and the stigma associated with those who have been impacted. https://t.co/AbEEtMQX9T"]["Happy #NationalLawEnforcementAppreciationDay! Every day I am thankful for the men and women in blue who do so much to protect and serve our communities. Thanks to your families for their hard work and sacrifices as well, we couldn’t do it without them! https://t.co/1O7B6XakOt"]["Senate passed the Coordinated Ocean Monitoring and Research Act, legislation I cosponsored to reauthorize a network of federal &amp; regional entities that will improve data management &amp; product development, encourage research, &amp; fill gaps in ocean observation. https://t.co/oSQfHKn8r8"]["Wonderful to read of Alaskan Ben Kellie’s success as SpaceX engineer and rural aviation innovator. Just goes to show the value of education, a can-do attitude, and rural Alaskan ‘make-it-work’ experience. Can’t wait to see where Ben’s ambitions will lead! https://t.co/y9sDvd08Of"]["Pleased to hear about the Kenaitze Indian Tribe will be hosting an Applied Suicide Intervention Skills Training (ASIST) workshop later this month, which is an intensive course that emphasizes various methods of suicide prevention.\nhttps://t.co/efCWRdnys2"]["It’s great to see individuals, families, and businesses already benefitting from the recent tax reform legislation. \nhttps://t.co/YdDKWvzWwC"]["I’m pleased to see the draft proposed plan suggests 19 lease sales in Alaska’s OCS. And while nothing in this proposal is final, it is good to see the administration seeking to expand access in places like Alaska, rather than limiting our opportunities."]["The Interior Department’s newly released draft proposed Five-Year Oil and Gas Leasing Program for the Outer Continental Shelf (OCS) is the first step toward a more competitive offshore leasing program in the United States. https://t.co/IYG0jkkMz5"]["Congratulations to Caitlin &amp; Scott Patterson, siblings who won the U.S. Cross Country ski championships in their hometown of Anchorage, as well as AK's Junior Racers. I’m proud of all the Alaskan competitors that came out to represent our state. https://t.co/9uTdptcezU"]["https://t.co/xjQOTx6MtS"]["For the first time since 2010, Anchorage is hosting the U.S. National Cross Country Ski Championships. Good luck to all the Alaskan athletes that plan on competing. I’m rooting for you! https://t.co/REJwp9W5SK"]["On this day in 1959, Alaska officially became the 49th state! Happy Birthday to our beautiful home! https://t.co/Tr9hNegiJ5"]["Afternoon sun through the fog along Turnagain Arm. https://t.co/quS04AsvXn"]["Yesterday, I spoke at Congressional bill signing for Tax Cuts &amp; Jobs Act. Today @POTUS signed it into law, meaning lower taxes &amp; opening small portion of 1002 Area in ANWR for responsible energy development is now a reality. The future of our nation &amp; Alaska just got brighter. https://t.co/VQoHjNAUYF"]["Congress extended federal funding for the Children’s Health Insurance Program (CHIP.) While I’m glad we extended funding for CHIP, Congress still needs to pass a long-term extension that gives Alaska’s most vulnerable children the security they need. https://t.co/gYf80aeZFv"]["Click to read my editorial on this week’s passage of the Tax Cuts and Jobs Act which includes two historic opportunities for Alaska and our nation:   https://t.co/Gx6LKQcQgj"]["Yesterday I joined @repdonyoung &amp; @SenDanSullivan to talk w/ AK press about the Tax Cuts &amp; Jobs Act. In addition to reforming taxes, this bill opens the non-wilderness 1002 Area of ANWR to responsible energy development. Proud to be a part of this team. https://t.co/bQKg3CMMSB"]["Also speaking to how this allows us to open Alaska’s 1002 Area of ANWR to responsible development. This is truly a historic moment."]["@ktva @KTVA11Daybreak Talking about Tax Cuts and Jobs Act and how it will benefit middle-class families."]["On live with @ktva @KTVA11Daybreak"]["Speaking on the magnitude of this historic moment. https://t.co/GZA6rUv33u"]["We have fought to open the 1002 Area for a very long time, and now, our day has finally arrived. I thank all who kept this effort alive over the decades and for the efforts of my colleagues @repdonyoung and @SenDanSullivan"]["The Tax Cuts and Jobs Act is heading to the President to be signed into law. In addition to reforming the tax code, Title II of the bill, opens the non-wilderness 1002 Area of ANWR to responsible energy development. #TaxReform \nhttps://t.co/OqXdyightr https://t.co/B2lTDTyjYb"]["Speaking now at the White House Ceremony on the Tax Cuts and Jobs Act. https://t.co/wX55mD4q72"]["The passage of this #TaxReform a defining moment in our nation’s history. It’s been 31 years since we last reformed the tax code—and this bill comes not a moment too soon. It’s time we deliver relief, tax cuts, and good jobs for hard-working Americans."]["The legislation includes a section of mine, which contains an important step in creating new economic opportunities by opening up the non-wilderness 1002 Area of ANWR for responsible energy development."]["The Senate just passed Tax Cuts and Jobs Act, comprehensive #taxreform that reduces taxes and encourages the economic growth needed to create jobs and generate wealth."]["It’s time to reform the tax code, for the good of our country.  And it’s time to open the non-wilderness 1002 Area to responsible development, for the benefit of all Alaskans and Americans."]["I support tax reform.  And I’m also proud to be the lead author of our energy title, which contains the single-most important step we can take to strengthen our long-term energy security and create new wealth. #TaxReform #1002Area"]["To allow American corporations a more competitive edge and encourage jobs to return from oversees, the corporate rate is lowered to 21%—a move that is long overdue. #TaxReform"]["It doubles the child tax credit, while making more of it refundable to help parents and families, helps our small businesses—which make up 99 percent of the businesses in Alaska—by allowing owners to deduct 20 percent of their business income from their taxes.  #TaxReform"]["I was proud to be a conferee for H.R. 1, the Tax Cuts and Jobs Act, and I’m excited to join so many of my colleagues in strong support of its conference report."]["I am proud to have recently introduced the Coastal Communities Ocean Acidification Act, a bipartisan bill to identify and assess communities that are most dependent on coastal and ocean resources that may be impacted by ocean acidification. https://t.co/sas8sHtE3Y"]["Absolutely tragic news coming out of the Tacoma area as a train derailed. Praying for everyone impacted, including their families &amp; loved ones. Thanks to all the first responders, including all the Good Samaritans who jumped into action to do all they could to help."]["I loved seeing so many families taking part in the Festival of Trees in Anchorage. I was especially grateful to get to spend some time reading to some of our young Alaskans. https://t.co/7nsU4UYcUl"]["A little bit of kindness goes a long way. Love reading these stories of thankfulness. \nhttps://t.co/ZYH0bXE9qZ"]["If anyone can handle the cold, it’s Alaskans! Loved being out at the @SpecialOlymAK Polar Plunge today to cheer on all the participants #FreezinForAReason! https://t.co/SbfA1zHlOE"]["This legislation levels the playing field for victims, improves transparency, and holds members of Congress who use their positions of power in abusive ways personally liable to repay the government for the cost of their conduct."]["I recently joined a diverse bipartisan group of colleagues in proposing this comprehensive reform of congressional harassment policies. https://t.co/u9ojWj6B28"]["I’m proud to be a part of this bi-partisan effort to ensure we are giving individuals and their families the resources and support they need to help our nation overcome the current opioid epidemic. https://t.co/wBnrXEnsXx"]["I joined a public mtg. of Senate/House conferees on the Tax Cuts &amp; Jobs Act, emphasizing my support for this bill that allows access to a small portion of the non-wilderness 1002 Area to responsible energy development &amp; benefits our families &amp; businesses https://t.co/5lOCNB09RQ"]["Pleased to see the President signed the NDAA into law recently, which includes my legislation -- the Second Division Memorial Modification Act.  Now all members of the Second Division who have given the ultimate sacrifice can be fully recognized. https://t.co/jWxU1baFE0"]["The Children’s Health Insurance Program (CHIP) is a high priority of mine, as I’m a cosponsor of the KIDS Act, legislation that reauthorizes CHIP and extends funding through 2022. I will do everything I can to ensure CHIP is funded."]["I’m proud to support tax reform, and I’m also proud to be the lead author of the energy title, which contains the single-most important step we can take to strengthen our long-term energy security and create new wealth."]["This effort – the Tax Cuts and Jobs Act – will be good for our economy, good for jobs and growth, and good for American families and businesses."]["In just a few moments, the Conference Committee is meeting on the Tax Cuts and Jobs Act and will be live-streamed here: https://t.co/aQHbyzUDjM"]["@Interior @SenatorCantwell Streamlining the federal permitting process could provide opportunities to improve the responsiveness, transparency, and predictability of permit reviews for energy &amp; resource projects"]["@Interior Whether it is energy production, pipelines, pumped storage, water supply, mining, or LNG, the permitting system needs to be improved across the board. My #energy bill w/ @SenatorCantwell does just that."]["During my tenure as a U.S. Senator, I have been a steadfast advocate for the Secure Rural Schools (SRS) program.  I have sent a letter to our Senate leaders to support local rural communities by reauthorizing this important program. https://t.co/0Z3kr68bnT"]["Sad to hear of the loss of Staff Sergeant David T. Brabander, 24, of Anchorage, who died yesterday in the Nangarhar Province of Afghanistan, supporting Operation Freedom’s Sentinel. Deepest condolences to his family. Staff Sgt Brabander’s service to our nation won’t be forgotten. https://t.co/mHS96KmSa5"]["As a conferee on this bill and a member of the Senate Armed Services Committee @SenDanSullivan helped our national security remain a top priority while safeguarding priorities for Alaska. I’m thankful for his focus on keeping out troops, friends, families, and homes safe."]["This bill outlines defense priorities, authorizes how funds should be spent to defend our homeland, and ensures that our military has the resources and tools necessary to protect our nation."]["Today, President Trump signed the National Defense Authorization Act (NDAA) Conference Report into law. https://t.co/DCmzpqRPbY"]["I was horrified by the news of the attempted terrorist attack in NYC, but I'm thankful that no life-threatening injuries occurred. Thanks to all the first-responders that tended to victims &amp; helped take the suspect into custody. Praying for a speedy recovery to those injured. https://t.co/0gMZ3BZEKr"]["One of my staff members, Deborah, had the opportunity join the Alaska National Guard for Operation Santa Claus to deliver gifts and treats to children in the village of St. Michael. Such a special way to deliver Christmas cheer. https://t.co/TeCJS0zNPx"]["As we head into conference committee negotiations on the Tax Cuts and Jobs Act, I want to further explain some of the many reasons I support the Senate bill and also address some of the misconceptions.  https://t.co/VCNT2Q2Pi1"]["Today we reflect on #PearlHarbor and honor the lives lost and those who bravely fought to protect our country. https://t.co/3nJfTSRV8F"]["Congrats Alaskan Joe Balash on being confirmed as Assist. Secretary for Land &amp; Minerals Management @Interior.  W/ significant experience on energy &amp; resource policy, a record of upholding Alaska’s interests as a landowner, he will ensure America’s interests are well represented."]["@repdonyoung I’m proud to represent AK &amp; the nation as we bring this bill through the final stages of the legislative process to put money back into the pockets of hard-working families &amp; strengthen our long-term energy security."]["@repdonyoung We will work to reform the tax code &amp; open a small portion of the non-wilderness 1002 Area in NE Alaska to responsible energy development."]["I was selected to serve on the Conference Cmte. alongside @repdonyoung, for H.R. 1, the Tax Cuts and Jobs Act where we will reconcile the differences between the House and Senate versions. https://t.co/sEFAYaJoBQ"]["We’re seeing a culture of harassment &amp; assault being exposed on a daily basis. Whether you are in the media, politics, or anywhere else abuse of power is unacceptable &amp; shouldn’t be tolerated at any place at any level. Sen. Franken must know that &amp; that’s why he must step down."]["The Senate recently passed my bill which provides for a land transfer of 19.07 acres in Sitka, allowing for a much needed expansion by Southeast Alaska Regional Health Consortium to expand services and improve access to healthcare. https://t.co/I5cKD98qV0"]["Pleased to hear that the EPA decided against imposing duplicative and burdensome regulations for hardrock mines. This will protect jobs, safeguard our nation’s mineral security, and ensure we can responsibly access valuable resources. https://t.co/2ATseIvFoQ"]["Great news-@repdonyoung will serve on Conference Cmte. tasked w/ reconciling House &amp; Senate tax reform bills. He'll fight to uphold key provisions that support/protect Alaska's future, including our language to open a small portion of 1002 Area to responsible energy development."]["The Christmas tree is up and being decorated in my DC office with a touch of Alaska! https://t.co/UGhwUY5LTm"]["The combination of developing more of our natural resources and stimulating America’s economy through tax cuts will create tremendous opportunities for our nation and put more dollars back into the pockets of hard-working Americans. #TaxReform #EnergyIsGood"]["Senate passed my legislation which opens a small portion of the non-wilderness 1002 Area of the Arctic National Wildlife Refuge (ANWR) for responsible energy development. #EnergyIsGood https://t.co/0TPeldEGhW"]["Senate passed #TaxReform that provides relief for hardworking Alaskans &amp; their families by doubling the standard deduction, increasing the child tax credit, &amp; reducing the tax brackets at every income level. https://t.co/g9So0dAdO3"]["Tonight I cast my in favor of the Tax Cuts and Jobs Act, comprehensive tax reform that aims to encourage the economic growth needed create jobs and generate wealth, while reducing taxes. #TaxReform https://t.co/0MlpVKc2fv"]["I am excited to announce that negotiations have concluded on the \"Agreement to Prevent Unregulated High Seas Fisheries in the Central Arctic Ocean\", a multi-national agreement I put in motion many years ago, alongside Senator Ted Stevens. https://t.co/npFY4utO4c"]["Today marks World AIDS Day – a day to honor and remember all of those who have lost their lives fighting this terrible disease. Over 1 million people die every year from AIDS related causes; I look forward to a day when that number is zero. #WorldAIDSDay https://t.co/3gyhf14dYB"]["Bottom-line, this is a #taxform bill that works for Alaska &amp; this nation. It gets dollars in pockets &amp; relief to families. It restores competition in the global marketplace, certainty to job creators, and confidence that now is the time to invest in Alaska &amp; the rest of America."]["This legislation will allow us to refill TAPS, which currently is just one-quarter full. This in turn will boost our local economy and reduce our nation’s foreign oil dependence.  #TaxReform"]["This tax bill authorizes responsible energy development in the 1002 Area, which covers land in the non-wilderness portion of ANWR in northeast Alaska."]["99% of Alaskan businesses are small businesses, taxed at the individual rate. This bill allows owners of pass-through small businesses to deduct up to 20% of their business income from their taxes."]["Lowering the corporate tax rate is a critical component of this tax legislation and will allow American businesses to compete against foreign competitors, and make the investments in American operations that will bring the jobs and economic growth that have eluded us for years."]["The hallmark of this tax proposal is encouraging the growth we need in our economy to create jobs—the jobs that feed families, that put kids through college, and allow folks to build up their savings to cope with the unexpected. #TaxReform"]["Tax Cuts and Jobs Act doubles the standard deduction, resulting in a $12,000 deduction for single filers and $24,000 for married taxpayers filing jointly."]["This tax bill doubles the Child Tax Credit to $2,000 per child, a significant form of assistance to the 22 million Americans who use the Child Tax Credit. #TaxReform"]["Speaking now on the Senate floor about how The Tax Cuts and Jobs Act is a pro-economy, pro-growth, pro-jobs proposal that will reduce taxes and put dollars back in the pockets of hard-working Americans at every income level. https://t.co/Hjg0GcBOGJ"]["The Senate passed Tribal Employment &amp; Training Legislation championed by the AK delegation, to strengthen the “477 Program”, an employment &amp; training program to support self-sufficiency &amp; expand employment opportunities for American Indians &amp; AK Natives https://t.co/hP4NEn5HeE"]["Tune in to watch the HELP Cmte. continue to address the opioid crisis by learning in-depth about what states, communities, &amp; providers are doing https://t.co/2fUmAuIvxh"]["https://t.co/bnWk3jNs5s"]["Today in the HELP committee hearing, I had the opportunity to ask Health &amp; Human Services Secretary nominee, Mr. Alex Azar (former Deputy Secretary of the U.S. Department of Health and Human Services) about his view on the role of patient navigators in AK https://t.co/yjNbN5RzmM"]["Happy to report the FDA officially updated its seafood list to change the acceptable market name of 'Brown King Crab' to 'Golden King Crab' - a big win for AK's world-class fishing industry. https://t.co/5KHgIKPa0F"]["I was glad to join my colleagues on the Senate HELP Committee this morning as we began to lay the groundwork for changing federal laws to improve college access, affordability, enrollment, and completion.  https://t.co/XXRL6hMWfw"]["Each year I have the distinct honor of nominating promising &amp; enthusiastic young Alaskans to our US Military Service Academies. Reminder that the military nomination application deadline is Friday, Dec. 1 &amp; can be found here: https://t.co/ZakmrZ799q"]["While many Alaskans were out and about yesterday getting a start on holiday shopping, don’t forget today is #SmallBusinessSaturday where by supporting local Alaskan businesses, you can impact your neighbors, communities, and our state’s economy."]["#HappyThanksgiving everyone. I’m thankful for such great family and the place I get to call home – Alaska! https://t.co/NrTzYalp1w"]["Congratulations to Samantha Mack for achieving the incredible academic honor of receiving a Rhodes scholarship! Achieving so much already, you truly have a bright future ahead of you. https://t.co/7oxTmUZpKZ"]["Congrats to the Colony High School marching band, who are taking their talents to the streets of New York City this week for the Macy’s Thanksgiving Day Parade. Way to make Alaska proud! https://t.co/RizROioxvz"]["I am proud to cosponsor the Fix NICS Act, a bipartisan bill that will enforce our federal criminal history reporting procedures and keep weapons from falling into dangerous hands. Thanks to @johncornyn for his leadership on this legislation. https://t.co/es4yxQzJ7u"]["Thinking of the life and legacy of my dear friend Ted Stevens who would have been 94 today. https://t.co/AnvkBxDEcv"]["Way to go Natalie Hanson and Priscilla Rubic of Anchorage for not only winning gold medals at the International Powerlifting Federation’s open world championship, but also setting world records. A tremendous accomplishment! https://t.co/pocLblmudY"]["Congratulations to Jim Dodson w/ Fairbanks Economic Development Corp awarded the Alaska Legion of Merit, by @AkGovBillWalker for his steadfast support of the military. https://t.co/0IfC3D52g9"]["#HappyApprenticeshipWeek to all the diligent apprentices &amp; their teachers, especially those in AK learning skills that support AK’s economy https://t.co/1STSxsTSLS"]["Earlier this week during a MilCon/VA Appropriations Subcommittee Hearing, I questioned a panel of experts on the VA’s efforts to both prevent &amp; combat opioid overmedication &amp; how the VA must improve on finding alternative methods of treatment. https://t.co/X3HsGxxpBK"]["Great American Smokeout is today, asking smokers to quit for 24 hrs as a 1st step to a healthier, smoke-free life https://t.co/rhf8Tzoxf0"]["Proud to introduce the Supporting Working Moms Act w/ @SenJeffMerkley to support nursing mothers and their newborn babies in one of the most critical stages of development. https://t.co/MNhQ72rRvl"]["Alaskans have repeatedly proven that we can develop safely and responsibly. Alaskans #ProtectTheArctic #EnergyIsGood #1002Area https://t.co/OX6zmlDsDe"]["We will balance the potential impacts of development, and that's why we have not avoided environmental reviews. We will not sacrifice wildlife for the sake of development. There is no question that development &amp; environmental protection can and do exist in Alaska."]["The size of development pads has decreased by nearly 80% since the 1970s. New technologies have expanded the subsurface reach of the newest rigs by 4,000% over the same period. Many exploration wells are now built using ice roads and ice pads—leaving no impact to the tundra."]["And while we can be confident in those benefits, we can be equally confident that none of this will come at the expense of our environment, because new technologies have left the footprint of development even smaller."]["Revenues are not the only benefit that will result from careful development in the non-wilderness 1002 Area. We will also create thousands of good jobs that support families and help put kids through college."]["The 1002 Area is separate from any wilderness. It is separate from the refuge itself. So when we talk about where the 1002 Area sits and how it sits as a function of ANWR, it’s important to keep that in mind."]["I keep going back to the map of ANWR to remind colleagues that the 1002 Area was specifically set aside under ANILCA for consideration for oil and gas exploration."]["CBO estimates that our legislation will raise more than $1 billion in federal revenues over the next 10 years."]["This morning I’m chairing an Energy Committee Business Meeting to consider legislation to authorize responsible energy development in the 1002 Area of ANWR."]["Today is Dr. Walter Soboleff day in Alaska. I hope we can all take a moment today to reflect on the late Doctor’s teachings of respect, care, love, and compassion. https://t.co/j8hrS662Hy"]["Thanks to @ANTHCtoday for spearheading the Alaska Tribal Conference on Environmental Management, which kicks off today. A great opportunity for Alaskans to learn &amp; share ideas surrounding Alaska's environmental challenges. #ATCEM https://t.co/UQbpHwJMJ1"]["Beautiful Anchorage views this weekend: Sleeping Lady, Anchorage skyline, and Turnagain Arm. There’s no place like home! https://t.co/goIrw8DeNI"]["Proud to join others in Alaska today to honor veterans who have sacrificed so much for this nation. https://t.co/dkjMqsCEGZ"]["I am thankful for the men&amp;women who have served in our military branches and have sacrificed so much for our nation’s freedom &amp; protection. https://t.co/JonO1HqGjk"]["Took part in “We Honor Veterans” ceremony in Anchorage, acknowledging the service &amp; sacrifices made by these veterans &amp; their families. https://t.co/xmXdmmMpWt"]["Great to see the Administration working w/ AK leaders on a joint development agreement to advance the Alaska LNG project. \nhttps://t.co/uAFBhw3J5v"]["Will put AK&amp;nation on path toward greater prosperity by creating jobs, keeping energy affordable &amp; reducing deficit. https://t.co/0DTGH8mRHQ"]["This leg would open a small part of the non-wilderness portion of ANWR known as the “1002 Area” to responsible oil and gas development. https://t.co/0Pwd509ifA"]["I released reconciliation legislation in accordance to the Senate Energy Committee’s instruction to raise $1 billion in federal revenues."]["Celebrated the completion of the TERRA project, a fiber optic network providing rural communities in western AK w/ high-speed internet. https://t.co/9M1Ay5WwTf"]["This past weekend I led a congressional delegation to Puerto Rico and the U.S. Virgin Islands to assess damages from recent hurricanes https://t.co/JOhgWfur9b"]["Thanks @SenDanSullivan for your leadership on this. As a member of Appropriations Comm I will work hard to fully fund President’s request"]["A vote of confidence for missile defense, for military that defend us &amp; for Alaska’s role in protecting our freedoms https://t.co/8UXrbGrjGB"]["Budget request contains $2.1B for missile defense, including $200M in military construction for a new missile field at Fort Greely"]["The Administration announced a FY18 budget amendment for DoD funding for upgrades to counter threats from N. Korea https://t.co/8UXrbGrjGB"]["I look forward to working with these Alaskans in their new positions. \n\nhttps://t.co/HZcdN8ND75"]["https://t.co/S4btp4CuED"]["It’s wonderful to see Alaskans showing their support at the Veterans Day parade in Anchorage. https://t.co/pj9ErXQrQx"][".@EnergyGOP hearing today on the potential of opening the non-wilderness #1002Area for responsible development.  https://t.co/lMm3c8YcV1"]["Rexford: “Now is the time to open ANWR, to measure exploration &amp; development for the benefit of our community, all of Alaska, &amp; the nation.”"]["Rexford: “.. we know development in ANWR can be done safely because it’s already being done safely- all over the Arctic.” #1002area #ANWR"]["Matthew Rexford of the Village of Kaktovik, within the #1002area , testified on responsible energy development in Alaska"]["We've got a great lineup of witnesses to discuss the potential of Alaskan energy; watch it live here:   https://t.co/xMIYsA39CL https://t.co/1iq553Ft35"]["Significant steps are being made toward saving on energy &amp; creating resilient, durable, sustainable homes in Alaska. https://t.co/rKnWsgoxZR"]["This is a stark reminder that we must remain vigilant in the fight against terrorism"]["I am horrified by the news of the attack in NYC. My heart goes out to those whose lives were taken, their families &amp; their loved ones.."]["I had a great meeting with @AEWC_Alaska who locally manage bowhead whale subsistence hunts. https://t.co/ng5ibwfCpS"]["My deepest condolences go out to the family &amp; loved ones of Chief Warrant Officer Jacob Sims. https://t.co/eUJvijgBzY"]["Congrats to Ethel Lund of the Tlingit Nation on winning the Della Keats Healing Hands Award of 2017 from the Alaska Federation of Natives https://t.co/5hthf0Urvk"]["Great to meet w/ Girl Scouts; young women who are growing into leadership roles and taught the values of confidence, hard work, &amp; respect. https://t.co/OLV1ta1pNw"]["https://t.co/Fndr5jJhZw"]["@POTUS I remain dedicated to working alongside AK in this fight against opioid addiction and substance abuse https://t.co/AsOjd4485B"]["@POTUS .@POTUS opioid crisis declaration is another important step in fight against opioid epidemic"]["@POTUS The Opioid crisis is impacting everyone, whether it's destroying families, spurring crime, hurting our economy, and leading to tragic deaths"]["Opioid addiction is a serious concern in this country. I applaud @POTUS for declaring the opioid crisis a public health emergency."]["Joined my colleagues in the Senate Indian Affairs Committee to advance 3 bills to improve public safety for AK Natives &amp; American Indians https://t.co/L30G81anAt"]["A truly historic day for #Alaska https://t.co/hafi9RYpaw"]["Honored to meet the Agron family, receiving Congressional Gold Medal on behalf of their late patriarch Alfred Agron for his service in WWII. https://t.co/dTG1FR3zyf"]["In Alaska, snow isn’t the only thing we have to clear off the runway! #OnlyInAlaska #AlaskaProblems https://t.co/HLySYrx2uj"]["I voted in favor of a disaster aid bill to help communities facing hurricane destruction and fighting wildfires. https://t.co/9qgbdPF9Nh"]["I can say from personal experience-fellow Alaskan, Laura Cole, is a great pick for the upcoming season of “Top Chef” https://t.co/5avuhBT7rg"]["Today is #UnitedNationsDay - marking 72 years of advocating for global peace and human rights. Happy Birthday @UN https://t.co/mJ7ELTOJi6"]["Special thank you to my Coast Guard Fellow, Juan Ramirez, for serving with the @USCG in Puerto Rico recovery efforts. https://t.co/ijqaeQXspV"]["Find out where to drop off your expired and unused meds on #DEATakeBack Day by clicking here: https://t.co/a5jqvHUsOn"]["Help fight back against prescription drug abuse by participating in #DEATakeBack Day this Saturday, October 28 https://t.co/a5jqvHUsOn"]["The snow came before the kids were ready to give up outdoor hoops. #OnlyInAlaska https://t.co/tltbR07BOA"]["The uniqueness and the beauty of #Alaska never ceases to amaze me. #ThisIsAlaska https://t.co/XHhUKGeprw"]["Speaking now at #2017AFN about how to leave Alaska stronger &amp; more resilient for the next generation. Watch live: https://t.co/IRYM7G0zOa"]["Wonderful to be at #2017AFN to catch up with so many friends, visit the arts &amp; crafts, and enjoy the music &amp; dancing at Quyana. https://t.co/ONp1Z2PlaZ"]["Proud of the radio stations in SE Alaska, aiding disaster relief efforts in Puerto Rico via portable radio stations https://t.co/Ia1nW9H6Ej"]["Congrats to Alaskan, Chris Hladick, for being chosen as @EPA Region 10 Administrator.  https://t.co/S9xapsUAxs"]["We're on a path allowing us to create jobs, generate new wealth, keep energy affordable &amp; protect our natl security. https://t.co/4xMJawZfGN"]["This budget res. offers a tremendous opp. to secure the future of Alaska, from long overdue tax reform to responsible energy development."]["Senate passed the FY18 budget resolution, opening the door to tax reform &amp; responsible development of the 1002 Area. https://t.co/4xMJawZfGN"]["I met with Gov. @ricardorossello of Puerto Rico to discuss hurricane recovery efforts &amp; how to rebuild the electric grid https://t.co/JMmjDaGbVS"]["Yesterday was the last day of combi flights w/ @AlaskaAir - Thx for years of hauling our unique goods! #OnlyInAlaska https://t.co/5OQzOxTWG4"]["My heart is with the Hickel family as they said their final goodbyes, yesterday. Ermalee will be dearly missed, but her legacy will live on. https://t.co/1RwxkQdRqX"]["150 years ago on October 18th, Alaska officially became part of the United States. Happy #AlaskaDay everyone! https://t.co/i7lE1JlwOZ"]["@GCIAK Too funny!"]["We are proud of you Chris! https://t.co/qmEANWdCni"]["Congratulations to @SenJohnMcCain for being awarded the #LibertyMedal – you are a true example of courage and conviction."]["As 2017 King Crab Season begins, I send my thoughts &amp; prayers to my two nephews, the rest of crew of the Brenna A and to all the crab fleet. https://t.co/skBBYQ9lDa"]["Are you subscribed to my E-newsletter? Stay up to date on the work I’m doing in D.C. &amp; in AK. https://t.co/mTFXpB6Hw7"]["Congratulations to Romig Middle School’s Ben Walker on being named the @AlaskaDEED 2018 Alaska Teacher of the Year! https://t.co/sIFxzDEGl8"]["@SenWarren and I are calling for more federal action in combating the nation's opioid epidemic. https://t.co/Gq2AomzewZ"]["Inspiring example of AK aiding Puerto Rico- @SitnasuakNC in Nome chartered planes to deliver crucial relief supplies to those in need. https://t.co/EtCRtHRe9N"]["Honored to help send off 23 veterans flying to Washington D.C. on The Last Frontier Honor Flight. https://t.co/qwFPKnYnd9"]["I had a great time shadowing Dimond High School Principal, Tina Johnson-Harris, learning about new technology and teaching methods. https://t.co/l6cALl88t2"]["Rain or shine- it's always great to be in Cordova. #Alaska https://t.co/TFUTzN8A1o"]["In Nikolai, AK, there was nowhere for the HS teacher to live, so students built a house during summer #ThisIsAlaska https://t.co/j8jayMenyt"]["Some of my staff attended the “Choose Respect March” in Wrangell- a meaningful way for Alaskans to be united against sexual abuse &amp; violence https://t.co/zG5qbfUX0i"]["Special thanks to the Alaska Air &amp; Army National Guard members that will deploy tomorrow to aid &amp; assist Puerto Rico https://t.co/h97jXS4num"]["Our nation’s lackluster response to the tragedy of missing &amp; murdered Native women needs to be addressed https://t.co/NfyGmVIfJF"]["Innovative discussions at the Health, Education, Labor &amp; Pensions hearing on prevention &amp; treatment of opioid abuse https://t.co/loboLukvO7"]["My staff &amp; I attended an Alaska Community Foundation event here in DC, supporting their efforts to help Alaskans. https://t.co/YVLodvjG6d"]["Honored to be named one of the National Council for Behavioral Health 17' Champions by @nationalcouncil https://t.co/vsIze93DfV"]["I spoke to how we can help Puerto Rico/USVIs rebuild, particularly as it relates to the electric grid &amp; power sector https://t.co/acwPxDIqNf"]["Latest Sturgeon decision is an affront to all Alaskans and cannot be allowed to stand. https://t.co/eCsLA323AJ"]["Speaking now on current relief efforts &amp; how we can help long-term rebuilding in Puerto Rico &amp; U.S. Virgin Islands https://t.co/kLjL8X5L7q"]["Anchorage &amp; Yukon-Koyukuk School District were awarded 2/5 Native Language education grants-the first of their kind! https://t.co/tBV14cFTFp"]["Beyond horrific news out of Las Vegas. My heart goes out to the victims, their families and loved ones. They are in my prayers."]["Alaskans are resourceful! In Haines: school lunch prgm uses moose meat after moose had to be put down. #ThisIsAlaska https://t.co/AuAf4JKBnX"]["Thanks to all who are joining in the fight against #ALS. Great support at Young Faces of ALS Corntoss Challenge! #YFALS https://t.co/eLRFEuWje6"]["Congrats to Northern Lights ABC for being named a National Blue Ribbon School. Your hard work has not gone unnoticed!https://t.co/iEtj1NBz9o"]["Touring the @NASA Goddard Space Flight Center with ASRC - A truly exceptional facility. https://t.co/sY24MDKnKZ"]["Beautiful evening at the Smithsonian’s @NationalZoo and Conservation Biology Institute's 2017 Gala. #DCZooGala https://t.co/ZI6WmlusX8"]["Okay @StephenAtHome - is this photo of me at 15 years old awkward enough? #PuertoRicoRelief https://t.co/Y5lphZIUd6"]["Sad to hear of the passing of Alaskan, Dr. Nora Keixwnéi Marks Dauenhauer, who taught many generations about the Tlingit culture &amp; language https://t.co/YUtwmNSc5R"]["Preventative steps include: collecting better data, developing victims assistant programs, &amp; ending homeless youth. https://t.co/tQBS1Z5E6i"]["We must take preventative steps to end human trafficking and better provide support for victims. https://t.co/66pNsyyDyo"]["And we are all so happy you are! https://t.co/zAcEPkF5s0"]["Thank you to the 60+ Alaska airmen from the 176th Wing for their bravery and willingness to serve our country. Praying for your safe return! https://t.co/yX6uyGGnU1"]["Congrats to Dr. Johnson-Struempler, who was recognized as the 2017 Alaska Principal of the Year! https://t.co/6ChCibS7ic"]["Congratulations on the first of many important steps towards equalized rights for women in Saudi Arabia. https://t.co/i8nt5z9NtB"]["My statement on the Graham-Cassidy healthcare proposal: https://t.co/IyFXgnz0KZ"]["I had the honor of introducing my 2017 Angel in Adoption, Rozann Kimpton, of Alaska. Thanks to all the honorees for making a difference. https://t.co/H2GRRQp6pp"]["ENR hearing starting soon to consider the noms of Bruce Walker &amp; Steven Winberg as Asst Secretaries of Energy https://t.co/RzomcQHIqH"]["Thanks @GoParks for awarding #EveryKidinaPark grants to AK, allowing these 4th graders to travel to @DenaliNPS\nhttps://t.co/Wsgo42ViH3🔒"]["I had a chance to visit the @AnchorageMuseum Art of the North galleries in the new Rasmuson Wing. Such a great addition! https://t.co/pGysfcwdME"]["Congrats to University of Alaska Fairbanks (UAF) for receiving a $500,000 grant from @ARPAE MARINER program. #macroalgae"]["Wishing a happy and blessed New Year to all of those celebrating Rosh Hashanah! #ShanahTovah"]["My thoughts and prayers go out to those in Hurricane Maria's path, as well those already impacted by this storm."]["I chaired an ENR hearing on vegetation management, how to protect electric grid reliability &amp; wildfire prevention https://t.co/FQv7tYMgpn"]["With the NDAA, we are enabling our military to protect our nation &amp; our livelihood, &amp; providing a long overdue pay raise to service members"]["I voted for #NDAA b/c it boosts our nation's defense capabilities &amp; ensures our military has the resources needed to protect our nation"]["The Senate just passed #NDAA, which provides our military with the support they need to defend our country https://t.co/TpYLuAnRUb"]["Happy Birthday to the @usairforce - Thank you for 70 years of flying, fighting and winning! https://t.co/fdQmtx2wcg"]["Today we celebrate the words that have kept our country together through 230 yrs of challenges &amp; accomplishments. https://t.co/VITZoY958C"]["Congrats to Anna Brown Ehlers of Juneau for being a recipient of the NEA's Heritage Fellowship for Chilkat weaving. https://t.co/Vs8vYf0XwY"]["On #NationalPowMIARecognitionDay, never forget the sacrifices made &amp; honor the POW’s, the missing &amp; their families. https://t.co/0GtYc7fdiZ"]["Getting some love from my staff on #NationalHugYourBossDay https://t.co/kRyD9wu0H9"]["https://t.co/pxdHuriSRS"]["Ermalee Hickel was a great Alaskan -- gracious and lovely in every way and always treated me with great kindness. https://t.co/MtqoWlbmjm"]["Proud of AK partnership selected by @Energy to receive major R&amp;D award for innovation to strengthen grid reliability https://t.co/t2CoXLSx7R"]["I have a res. recognizing Sept. as Alaska Wild Salmon Month, encouraging others to celebrate this valuable industry. https://t.co/yos7pN20UG"]["Last night was the start of a fabulous new tradition in D.C., celebrating Alaska wild salmon. #WildSalmonDayDC https://t.co/XvUEocaKtc"]["Glad to meet with @ACSCANAK about palliative care, future funding for the NIH, &amp; early screening/detection for rural areas of Alaska. https://t.co/IU4oprzfRJ"]["Congrats to award-winning composer, lyricist, and performer @Lin_Manuel for earning the U.S. Capital Historical Society Freedom Award! https://t.co/1uwuk8y7Xn"]["Congrats @CIHousing on opening of 3600 Spenard, new low income housing &amp; an energy efficient building to help keep utility costs down. https://t.co/leEX1e6Hgk"]["Introduced the Boost Saving for College Act with @SenatorBurr &amp; @SenatorCasey to help families save for college https://t.co/YW4M0i6I2j"]["Far away, but close at heart! Proud to see my fellow Alaskans helping with #HurricaneHarvey relief efforts https://t.co/tMaMgEtzM7"]["This weekend I participated in the Kenai River Women's Classic. A great chance to spend time fishing with other female Alaskan leaders. https://t.co/AH9ZkfnqYY"]["Thanks @AKASYMCA for putting on “Operation: Snack Attack” where snacks &amp; hygiene items are given to troops deploying https://t.co/0GYYy1Gg2H"]["On 9/11 we pay tribute to the first responders and all who showed courage &amp; heroism during the aftermath of this attack. #NeverForget"]["Today we remember those that lost their lives on 9/11 and the friends &amp; families that are still impacted to this day. #NeverForget https://t.co/vAIiovrQgF"]["Humbled by the sacrifice of JBER's 4-25 Army Brigade as they deploy to Afghanistan. Thank you for your service. https://t.co/CA6EDKXnVH"]["Today is #CancerProgramsDay! I hope everyone will take a moment today to appreciate the hard work that goes into Cancer Programs nationwide."]["@USDOL @HHSGov @usedgov From educational opportunities to job training to health programs, this bill will go a long way in serving Alaska. https://t.co/DskhckoHbA"]["Senate Approps Cmmte approved FY18 @USDOL @HHSGov @usedgov approps bill. https://t.co/DskhckoHbA"]["While in AK I visited Fort Greely &amp; their Missile Defense Facility-a testament to what AK contributes to the USA's security &amp; defense forces https://t.co/YWirjNSpce"]["Today during a HELP hearing, I asked state insurance commissioners for their opinions on cost-sharing &amp; reducing uncertainty w/in the market https://t.co/LsQRyYSHx8"]["I’ll be livestreaming the HELP Committee hearing @ 10AM (6AM AKtime) on Facebook. You can also watch it live here https://t.co/sN1Uvkcsjs"]["My statement on today's #DACA announcement: https://t.co/2Nbiz9P8Mv"]["The Health, Education, Labor, and Pensions Committee will hold hearings this week &amp; as a member of that committee, I will be deeply engaged. https://t.co/PIEu7iXxvp"]["Last stop w/ cell service headed out for my annual family hunt &amp; ran into my pal Ralph Samuels for burgers &amp; shakes. https://t.co/cPUt4uD2iL"]["I was so glad to tour the new @setFreeAlaska facility &amp; to meet with local groups about their efforts to help recovering substance abusers. https://t.co/C7R8njCCvh"]["Thanks to both Palmer &amp; Wasilla Chamber of Commerce for letting me share about the efforts that are being made for the good of our country https://t.co/OAI3wOw1Yi"]["A gyro -- Team Gyros was my first stop at the @AlaskaStateFair yesterday. https://t.co/ie77Qgu4up"]["Always a joy to go to the @AlaskaStateFair - always full of good food, good people, and lots of Alaska pride! https://t.co/BWEgt0tB7W"]["Thank you to all the volunteers &amp; @AKNationalGuard for helping with the #HurricaneHarvey relief efforts. \n\n https://t.co/3tWkTzXz6f"]["Happy Birthday and best wishes @SenJohnMcCain!"]["Enjoyed speaking at the Downtown Anchorage Rotary meeting about everything from healthcare reform to tremendous opportunities in AK. https://t.co/vJukn6aIpw"]["Thank you @USCG for all your efforts! https://t.co/JYsO6xGERR"]["Traveled to Kotzebue, Kobuk, Shungnak, &amp; Ambler &amp; met with community leaders &amp; members to discuss their unique needs as rural AK communities https://t.co/XuqHs966t5"]["Cont'd thoughts &amp; prayers for individuals in the path of #hurricaneharvey Thank you to first responders/volunteers helping the storm victims https://t.co/e9OsoJMPtV"]["Happy #womensequalityday to females worldwide and to the men that stand with us in our efforts."]["Congrats to the AK Military Youth Academy graduates! I'm hopeful for the great things these young Alaskans will continue to accomplish. https://t.co/LBiEKDSeeB"]["Happy 101st anniversary to the @NatlParkService - thank you for your work to preserve our beautiful lands. https://t.co/TQV7yBIVgt"]["I've been testing my green thumb in my D.C. office with our lettuce grow tower! https://t.co/3L9OyRK3K6"]["The @AlaskaStateFair is officially open! I encourage everyone to stop in for food, music &amp; a whole lot of fun. #AlaskaFair https://t.co/t6bY2zU5YY"]["Thanks to all the programs, groups, &amp; volunteers that have assembled Narcan Kits to fight the national Opioid Epidemic on a local level. https://t.co/uUxl37mE1D"]["The prelims for the #MrsAmericaPageant start today in Las Vegas. Good luck to Mrs. Alaska, Kersten Gomez. Thank you for representing AK! https://t.co/JJqhy0Lyhc"]["It was wonderful to bring @SecElaineChao to Prudhoe Bay's North Slope oil production &amp; show her one of our primary economic drivers! https://t.co/LNNsqOoazc"]["Grateful for the opportunity to participate in the opening of a deeply moving new exhibit at the @alaskajewishmus this week. https://t.co/FK7bG8ozAz"]["30 yrs ago on a beautiful Alaskan summer day Verne &amp; I were married in Anchorage. What a journey together it's been! https://t.co/TSTNP9ND3P"]["My thoughts &amp; prayers go out to the families and friends of the @USNavy sailors who lost their lives on the #USSJohnSMcCain"]["Great to attend Chena Renewable Energy Fair! Encouraging to see pioneering spirit or so many innovative Alaskans. https://t.co/0H8rdPZIUd"]["My \"view\" of the #totalsolareclipse right at its peak was from the permafrost tunnel near Fairbanks. https://t.co/mKC7XmvCTT"]["Traveling across the state, Alaska-style. Pic of boat ride to the village of Kwethluk from Bethel. https://t.co/KuWOF30Pdx"]["Congrats on the 100th anniversary of the 90th Fighter Squadron, \"Dicemen\". Thank you for your service! https://t.co/xt2TKyGPTa"]["Happy to celebrate the completion of the TERRA network w/ @GCIAK &amp; others in Bethel -providing Alaskans the internet services they need. https://t.co/8kyGpvsiax"]["I loved visiting Bethel Regional High School, where I saw the start of construction for a cafeteria, which I have long advocated for. https://t.co/WWovPPrdMR"]["I got to tour Meyers Farm in Bethel, where they grow &amp; sell fresh produce to help meet dietary needs of Bush communities in Western Alaska! https://t.co/XSB2xhQOnn"]["I am saddened for all victims in #Barcelona and all those affected by this devastating attack. America stands with our friends in Spain."]["It’s #NationalHealthWeek, so my visit to the Bethel Family Clinic was even more special. Thank you for serving the Yukon-Kuskokwim Delta! https://t.co/bEi4gQIQT0"]["https://t.co/r7tqIXaiCr"]["I enjoyed touring the Ketchikan Indian Community Mental &amp; Behavioral Health Complex w/ renovations still underway. https://t.co/AB6lQSguhB"]["https://t.co/1i5yeoXOHE"]["Glad to support American farmers &amp; business owners in the domestic flower industry through my res w/ @SenFeinstein  https://t.co/soddKQxPUu https://t.co/mXg08Awpt2"]["Today I toured the Fast Response Cutter Bailey T. Barco w/ @USCG Lt. Frank Reed, stationed in Ketchikan. https://t.co/5m73hh7Pgr"]["Nothing beats the scenery you witness flying around our beautiful state. Beautiful southeast Alaska! https://t.co/QwV7BEEL6T"]["Happy #AlaskaWildSalmonDay ! I hope everyone has a chance to enjoy some delicious salmon today! https://t.co/Swtou4JNuD"]["Had the pleasure of touring Prestige Care and Rehabilitation Center of Anchorage &amp; visiting with their staff &amp; residents https://t.co/AnYcpUTX85"]["Great tour &amp; visit to Clare Swan Early Head Start Child Care Center, to meet staff nurturing future generations. https://t.co/5klZLJzeY8"]["Great time talking w/ AK Trucking Association reps about their hard work &amp; plans for the state!"]["Great visit to Savoonga to see the new healthcare clinic that will be so critical to serving St. Lawrence Island. https://t.co/bHETsRcF5h"]["Honor to attend Naturalization Ceremony in AK today, where nearly 100 individuals took oath of allegiance to U.S. https://t.co/ieUGX2mVkZ"]["Proud to support #purpleheartday &amp; to honor the brave men &amp; women wounded in service or who paid the ultimate sacrifice. https://t.co/S4990vr9r8"]["Watch my summer interns interview me &amp; see feedback on their D.C. experience. Proud of these young Alaskans! https://t.co/j4qfQ7pTO4"]["Wonderful weekend up in Arctic Valley hiking and picking blueberries, including a moose encounter. Good to be home. https://t.co/3SjCvhdPqs"]["After 10 hrs flying X-country it was good to get out biking and end w/ refreshments @ neighborhood lemonade stand. https://t.co/gMflWJQPtI"]["Flying home to #Alaska. https://t.co/C7ce42nGTU"]["Alaska’s @USCG, 17th District, encompasses over 3.8M sq. miles, over 47K shoreline miles &amp; saves approx 24 lives a mo. #CoastGuardDay"]["Happy #CoastGuardDay to all @USCG members. Thanks for your service! https://t.co/14ttFc4UVG"]["@SenDanSullivan My hope is this bill will provide support to not only the individuals with terminal illness, but also to their families and loved ones."]["Senate passed leg I cosponsored w/ @SenDanSullivan giving terminally ill patients an alternative route to treatment. https://t.co/ryelsEvVNP"]["@axios Suggesting I blocked the President’s ability to make recess appointments during August state work period is false. \nhttps://t.co/KxARpf2Pyq"]["@RawStory Suggesting I blocked the President’s ability to make recess appointments during August state work period is false.\nhttps://t.co/KxARpf2Pyq"]["@PalmerReport Suggesting I blocked the President’s ability to make recess appointments during August state work period is false.\nhttps://t.co/KxARpf2Pyq"]["https://t.co/JFJHtoJojD"]["We must address hurdles hindering implementation of fuel treatments to mitigate wildfire risk, improve firefighter safety, &amp; protect forests"]["W/ wildfire management, we are dealing across multiple agencies w/ tribal, state, private, federal lands – we have to work collaboratively https://t.co/DCFa7tUXw2"]["Regarding wildfires, we need a comprehensive solution that addresses both wildfire budgeting &amp; forest mgmt https://t.co/zUc0K1lmAb"]["Chairing an Energy Cmte hearing now on reducing wildland fire risk to communities &amp; enhancing firefighting safety https://t.co/zUc0K1lmAb"]["Proud to support the Power Act, sponsored by @SenDanSullivan, which will empower survivors of domestic violence. https://t.co/pbz0a4mp1H"]["It's great to check in with local leaders from Eklutna, AK on addressing local infrastructure issues, even if it has to be via video chat. https://t.co/2J8CmGWyKN"]["Included in the CJS Approps bill are provisions to protect Alaska’s fishermen and fisherwomen. https://t.co/iHyna02ok4"]["CJS Approps bill focuses on developing Arctic infrastructure, marine/aviation operations, and our state’s fisheries, coastlines, and waters"]["I’m pleased to share the Commerce, Justice, Science funding bill continuing support for AK’s communities &amp; fisheries https://t.co/iHyna02ok4"]["This T-HUD Approps bill is critical to serving communities across AK, improving access to reliable, safe, and affordable transportation."]["Whether it's addressing a short construction season or access to communities, this bill meets housing/transportation needs for Alaska"]["Alaska’s transportation needs are unique &amp; diverse. This T-HUD bill addresses AK's needs, including funding for Essential Air Service"]["T-HUD Appropriations bill secures crucial funding for rural air transport and housing assistance programs https://t.co/m25Ks0iZ8Y"]["This wk I met 13 yr old Arianna Alrez, a passionate advocate for Juvenile Diabetes Research Foundation. #JDRFCC17 https://t.co/T7iWHopP1i"]["Great to visit Sitka and tour Mt. Edgecumbe Hospital. Thanks what you do for fellow Alaskans! https://t.co/9zxLZyH74b"]["Here is my following statement on the healthcare bill: https://t.co/vNlGf8G3Uu"]["Happy to host @CovenantHouseAK, a leader of combating youth homelessness in our state, last night as they visited D.C. https://t.co/QTO8meOd0S"]["Today 35 of my colleagues &amp; I wrote @SecretaryZinke in support of the #OCS 5-year leasing program #energydominance  https://t.co/vVOxYVI68p"]["Thanks to Olivia Siegel of Future Farmers of America (FFA) Alaska for her work on behalf of young Alaskans in agriculture! https://t.co/Mf4BPLcaN5"]["Very powerful and moving speech from Senator John McCain. I encourage you to watch. https://t.co/UUBWpLXjEP"]["My statement on today on the motion to proceed vote. https://t.co/d0Y7SJ93Dt"]["I look forward to working with Mr. Bernhardt to restore balance to the management of our federal lands. https://t.co/j54YWjxog8"]["Bernhardt's extensive experience &amp; knowledge of issues important to AK and western states will enable him to be a great asset to the Dep. https://t.co/i14TWGAlUa"]["@SenDanSullivan I'm confident she remains committed to helping AK via the SBA programs, empower AK communities to support job growth https://t.co/ZfGHwpKcan https://t.co/pKebvFXJBa"]["My condolences to the Talkeetna community, who lost a local feline legend this past weekend. RIP #MayorStubbs https://t.co/Bs07TLHU37"]["Congrats to Cdr. Evans as he takes command of @NOAA's Rainier. Their mission is critical to AK's maritime industry. https://t.co/uzpGXfv6qO"]["Thinking of my dear friend Ted Stevens today. I encourage Alaskans to get out and play to celebrate Ted Stevens Day! https://t.co/TOGCztpdwo"]["For a long time, I have been adamantly opposed to the approval of GE salmon. AK will not accept that GE salmon be sold w/out clear labeling"]["Approps Committee approved the FY18 approps bill containing AK priorities, such as a labeling mandate for GE Salmon https://t.co/FRLJlwCJdH"]["Renewed focus on the #Arctic region to support the use of energy resources including microgrids, alternative energy https://t.co/iJ9d4AfF3b"]["Provisions contained in this bill will bring to Alaska much-needed investments in infrastructure &amp; energy innovation https://t.co/iJ9d4AfF3b"]["Yesterday the Senate Approps Cmte passed the FY18 Energy &amp; Water Approps bill - funding for DOE programs/critical infrastructure projects"]["Thankful for @repdonyoung's leadership &amp; for bringing a life-saving road for King Cove one step closer to reality. https://t.co/UHmD8MmZpv"]["House passed leg. to authorize a land exchange needed to construct a short, life-saving road for King Cove residents https://t.co/UHmD8MmZpv"]["World Eskimo-Indian Olympics gets underway today in Fairbanks. There should be a competition for the best dressed! https://t.co/qZR8SCYO1S"]["Best of luck to all of those testing their skill, strength, agility &amp; endurance @ World Eskimo-Indian Olympics. https://t.co/vq7nfVoB54"]["Congrats to @SenDanSullivan's Chief of Staff Joe Balash on his nom. to be the Assist. Secretary for Land and Minerals Management @Interior"]["@SenJohnMcCain is a fighter &amp; I have no doubt he will face this challenge with courage and determination. Praying for him and his family."]["This week I spoke at a symposium on the impacts of an ice-diminishing Arctic on naval &amp; maritime operations, and how it impacts us. https://t.co/at9QmzA9oT"]["Way to go @allie_ostrander. Much-deserved! https://t.co/hoK8RjLqc6"]["Be thankful we're not on the 7th floor anymore. https://t.co/mkEpU0N7xu"]["Today I spoke at an #arctic @CSIS event with @SenAngusKing on addressing Arctic economic opportunities and limitations https://t.co/2akb9OG3B0"]["My recent statement on the Senate Healthcare Process: https://t.co/j19Ok1KwWw"]["Proud to recognize Alaskans Katie and Colleen Johnson, co-captains of Team USA at FIRST Global Robotics Challenge. #girlsinSTEM #FGC2017 https://t.co/pAC9G6sCH8"]["Wishing my colleague @SenJohnMcCain a full and speedy recovery."]["Happy to meet Zoe Novoa, a HS Sr. from Juneau who’s in DC as a National Youth Correspondent at the Washington Journalism &amp; Media Conference https://t.co/CUDFKyXOQ6"]["I had a blast going against (and beating) @SenDanSullivan team in the Slippery Salmon Olympics.  Only in #Alaska. https://t.co/9NUI6LmsxY"]["Always wonderful to be at the annual Bear Paw Festival &amp; compete in the uniquely Alaskan Slippery Salmon Olympics. https://t.co/0PW3dzRl2V"]["Many thanks to outgoing USARAK commander, MGen Bryan Owens for 34 yrs of service. Welcome MGen Mark O'Neill to AK. https://t.co/i1nAfYamWS"]["I won't accept this ‘fake fish’ be sold in stores w/out clear labeling. Huge difference b/w Frankenfish &amp; wild, healthy, sustainably-caught. https://t.co/Y6ATnLKKS5"]["I introduced leg requiring any salmon that's genetically engineered to be labeled as such. #Saynotofrankenfish https://t.co/7heNppOJf5"]["The Approps Committee approved funding for AK military construction projects &amp; VA programs critical to our state. https://t.co/pprfvg1MOW"]["#TBT to this time last week when I was in Alaska out on the Kachemak Bay in Kenai Peninsula, from Halibut fishing to dinner in Halibut Cove. https://t.co/WQNs2H5h19"]["I asked IHS officials whether or not the agency can keep a commitment to improving, in order to meet people's needs. https://t.co/GFhF8mfFAY"]["Today I raised concerns w/ the new Indian Health Service’s Acting Director over the administration’s proposed budget cuts. https://t.co/4ipEfcqoiv"]["Alaska’s 1332 State Innovation Waiver will enable lower premiums, better market stability &amp; increase consumer choice."]["The @HHSGov and @USTreasury approved Alaska’s 1332 State Innovation Waiver application, allowing states to provide more access to healthcare"]["My first session of summer interns had the chance to ask me questions &amp; describe their Senate experiences https://t.co/sTuGLDTNq4"]["On my way back to Washington D.C. and thankful for the time I got to spend with my family in Wrangell. https://t.co/RPcB3shM4a"]["Great news re: Alaska’s determination to refill TAPS &amp; beneficial to the development of oil &amp; gas resources in AK. https://t.co/wGUK6NC5tL"]["@SecretaryZinke issued an Order to hold regular onshore oil&amp;gas leasing sales - will help reduce permitting delays. https://t.co/wGUK6NC5tL"]["Caught an incredible view of a bore tide on Turnagain Arm on the drive back to Anchorage tonight. #Alaska https://t.co/vNclixRLmz"]["Even with pouring rain -- had a great time being outdoors participating in the Midnight Sun Shootout in Wasilla. https://t.co/FEmDTUoCsq"]["Past weekend was the Change of Command from Capt. Paul Albertson to Capt. Sean Mackenzie for USCG Sector Anchorage. Thx 4 your service Capt! https://t.co/MxLrC0StyV"]["Happy #4thofjuly everyone! I encourage everyone to enjoy the celebrations and thank those who have fought for our freedom. #IndependenceDay https://t.co/ArLIRD8FUy"]["I recently questioned Army Corps officials on building up Arctic infrastructure and prioritizing the region https://t.co/m5q4JSrtaD https://t.co/AS9NDmt73z"]["This bill provides much-needed support and will improve both quality and access to care. https://t.co/r6FIBHMDWj"]["Introduced leg w/ @SenDonnelly to address shortage of providers who treat people battling substance use disorders  https://t.co/r6FIBHMDWj"]["I questioned @EPAScottPruitt on the EPA’s FY18 budget request, discussing issues critical to Alaskans. https://t.co/CpydRyPyKw"]["@POTUS, do you want to be remembered for your tweets or your accomplishments?"]["Stop it! The Presidential platform should be used for more than bringing people down."]["Eager to work w/ EPA to ensure locals are involved in discussions about how to reasonably protect our waters. https://t.co/uwvD329SU1"]["I strongly &amp; consistently opposed #WOTUS rule b/c it was yet another burden for Alaskans that would have lessened economic opportunities."]["EPA announced a proposed rule to rescind Obama Admin’s burdensome #WOTUS rule.  https://t.co/uwvD329SU1"]["Happy we have more time to address Alaskan priorities in the healthcare bill. This was a good step. As I said before, we need to do it right https://t.co/79dbhOgTsZ"]["Happy I met w/ Denis McCarville, President/CEO of AK Child &amp; Family &amp; the AK Ass'n of Homes for Children. He's doing great work for AK youth https://t.co/18COCmwYIf"]["Happy to bring my interns to the annual Congressional Picnic at the White House last night. Thanks to the First Family for hosting us. https://t.co/HFKMAkvcg2"]["My statement on the discussion draft of the Senate healthcare bill: https://t.co/xRlwejEkwB"]["Happy summer solstice! I hope everyone’s out enjoying most Alaskans’ favorite day of the year. https://t.co/BasXqqjt5S"]["Celebrated #NationalSelfieDay a little early with my lunch buddies yesterday. @SenatorCollins @SenCapito https://t.co/xJP1Lmjxou"]["Congratulations to Jim Biela of Bethel on winning the Sandy Martin Grassroots Award for all his efforts in suicide prevention. https://t.co/ESmjeVbNi8"]["About to speak at Wilson Center-Arctic Circle Forum. Watch live here:  https://t.co/sGlQToiawK"]["On #WorldRefugeeDay let's reflect on the displaced individuals and acknowledge those working to stop the refugee crisis facing our world."]["Throughout the last 40 years, TAPS has helped reduce taxes, increase revenue, and inject billions of dollars into Alaska’s economy #40more"]["Today marks the 40th anniversary of the Trans-AK Pipeline! 17 billion barrels have since traveled through TAPS, fueling Alaska’s economy."]["Speaking on Senate floor now about 40th anniversary of TAPS. Watch live here: https://t.co/kLjL8X5L7q"]["I'm chairing an Energy Committee hearing on the Department of the Interior's budget for FY18. More info found here: https://t.co/oETsUuCShM"]["Happy to see the Yaxte Totem Pole at the Auke Recreational Area resurrected w/ the help of the @forestservice &amp; the Auk’w Kwaan people! https://t.co/NwU6UByTwh"]["Can’t wait until I’m back out on the river fishing again! Pictured is one of my staff members 11-year-old granddaughter’s catch of the day. https://t.co/n1kdT0lJcr"]["Thanks @AlaskaChamber for holding a military appreciation picnic at JBER. Great way to demonstrate our gratitude. https://t.co/Uj65TVDvU6"]["Happy #FathersDay to my wonderful Dad - a family above all else. https://t.co/HHdykpHhHf"]["Introduced the CARERS Act w/ Sen. colleagues which rectifies the conflict between state and federal marijuana laws. https://t.co/XDrexff3Oi"]["I was pleased to meet with Brian Dusek of Soldotna, Alaska today while he was visiting with the @youthtourdc. Keep up the good work, Brian! https://t.co/68AJpeDurH"]["Senate passed bill today strengthening sanctions against Iran and imposing new sanctions against Russia: https://t.co/LjkAGHAjmP"]["Great to see the 2nd Coast Guard Cutter commissioned in Juneau. The USCG Cutter Bailey Barco will further improve our Arctic infrastructure. https://t.co/JJz2ZrIzbT"]["Met Alaska History Day students w/ @SenDanSullivan &amp; @repdonyoung. Can't wait to see what the future holds for these bright young Alaskans. https://t.co/z3beXCKGps"]["I met with the Alaska Bering Sea Crabbers (ABSC) this past week to discuss issues directly impacting the seafood industry. https://t.co/0K8WxG5GYv"]["Praying for the injured, witnesses, &amp; all those impacted. Thank you to the brave souls-including the Capitol Police-who jumped into action."]["Saddened &amp; horrified to hear about the shooting at the Congressional baseball practice this am. I know this has shaken many on Capitol Hill."]["At an Indian Affairs hearing including witness Mark Charlie of Bethel, AK, to address bills beneficial to AK natives https://t.co/fI8hbrfV1N"]["Intern sighting on my flight from Fairbanks! Haley Hatch from Seward interned in my office summer 2006. https://t.co/6UWDSdQp5W"]["An Alaskan legend has left us, and we will never forget a woman who gave us so much to remember. https://t.co/VhWDtPr9Vz"]["Through training, education &amp; workplace development we are ensuring that we nurture incoming generations. https://t.co/GxyeQZIVu3"]["This leg. is a key step in addressing barriers facing young people trying to join the commercial fishing fleet. https://t.co/GxyeQZIVu3"]["Proud to support our young fishermen by introducing leg. w/ @SenDanSullivan @SenMarkey @SenatorCantwell Click here: https://t.co/GxyeQZIVu3"]["Very important hearing on Capitol Hill at 10...to study cost reductions in emerging energy technologies. Watch here: https://t.co/QrOkfcrFNb"]["Staff sent pics of the Denakkanaaga Elders &amp; Youth Conference taking place to address challenges in Interior communities &amp; find solutions. https://t.co/2hgTPFfWnq"]["Check out the newest addition to my DC office! Bernie Karl, one of Alaska’s top innovators,… https://t.co/mPGHenh7m5"]["YTD I asked @usairforce about the logistics of housing airmen &amp; families coming to @EielsonAFB_AK as result of F-35 beddown. https://t.co/nIDBpV1rmm"]["Happy #NationalTrailsDay, Alaska! Today is a day meant to connect more people to trails. Throwback to hiking Crow Pass a few years ago. https://t.co/FSzApHNlTD"]["FYI Interior Alaskans – my office in Fairbanks has moved. The new address is 250 Cushman Street Suites 2J/K: https://t.co/k0pm7zMvB0."]["Yesterday I spoke @ Juneau Chamber of Commerce to give an update on my work in DC to help restore stability/certainty @ the federal level. https://t.co/IzUYL2Bp4U"]["It was an honor to speak at @SHInstitute Education Conference, to share my thoughts on value of incorporating Native culture into education. https://t.co/YqYyPz0qDg"]["Saddened to hear this -- a tragic loss for the fishing community. Thoughts and prayers to the family and friends who are grieving. https://t.co/ZUv7wYJwwC"]["Great to have you in our state. You are welcome back anytime! https://t.co/DLw7rAX1eB"]["Thanks @SecretaryZinke for ensuring we're allowed to realize more of our resource potential. https://t.co/qRveG9KHBf https://t.co/k1wAZ98SUR"]["In AK @Interior @SecretaryZinke signed a new Secretarial Order that will boost access, production &amp; our economy. https://t.co/qRveG9KHBf"]["Fantastic mtg today w/@SecretaryZinke and @NativeFed leaders. https://t.co/QbCa1SvNEs"]["Awesome hands-on experience for UAA students at the NASA JSC to test their research in simulated microgravity: https://t.co/XKg8arkkj2"]["Had the opportunity to bring Senate colleagues &amp; @Interior @SecretaryZinke to the North Slope to look at Alaska’s energy assets. https://t.co/TSWwnZJWD9"]["Honored that @SecretaryZinke could join us this year at Byers Lake Memorial Day ceremony. https://t.co/quh9B0PFm5"]["I’d like to point out work of innovative Alaskans who are utilizing kelp from our waters to create kelp products: https://t.co/kMM4ktYodT."]["Saddened to see innocents, including children, attacked for their faith. Praying for their families, the wounded &amp; the people of the region. https://t.co/9K42YGtObd"]["I questioned U.S. Navy Admiral Richardson about the Northern Edge military exercise conducted in AK &amp; its plans to address Alaskan concerns. https://t.co/iuV2dSyKEZ"]["Hosted an event on the importance of research/awareness of ocean acidification and the impact on our coastal communities. https://t.co/0gbvOFkRN3"]["@POTUS  https://t.co/U9UDhH2MRj"]["My statement on @POTUS FY18 budget request: https://t.co/SXqA18LXKk."]["Devastated to hear about the horrific attack in #Manchester. My heart goes out to the victims &amp; their families of this terrible tragedy."]["Fabulous bday weekend! Spent Sat. w/ Matt at Anchorage farmers market. Then a dream picnic on Ruth Glacier on Denali w/ family. I'm blessed! https://t.co/64SyT3N0bF"]["Pleased that Deputy AG has appointed former FBI Director Robert Mueller as Special Counsel to lead the Russia investigation. https://t.co/stqpdjclsi"]["Like many Alaskans, I’m concerned about the continuous and often conflicting reports about President Trump, the FBI and Russia. https://t.co/XENI02GdBT"]["Sending @maziehirono and her family strength as she battles this terrible disease. https://t.co/eEBHsZ8mnV"]["Headed to Senate floor to talk about #NationalPoliceWeek &amp; honor life of fallen Fbks office Sgt. Brandt. Watch live: https://t.co/UxNdvdct3X"]["This weekend kicked off #NationalPoliceWeek, as we reflect on the service &amp; sacrifice made by our law enforcement officials who keep us safe https://t.co/Cqhlee1hN3"]["I had a lovely #MothersDay picking fiddlehead ferns with my son Nic in Girdwood! https://t.co/jlo9iJSjAO"]["Love this photo. Alaska is truly the heart of America’s Arctic. https://t.co/oQN0A5gPxP"]["Great talk w/ mayors from 8 Arctic nations, highlighting the role of local government in addressing challenges/opportunities in the Arctic. https://t.co/GEUbbuyqQh"]["At the opening ceremony at Arctic Council Ministerial with minister Timo Soini of Finland, the new chair of the Arctic Council. https://t.co/3K3CylGbsW"]["My statement on President Trump's announcement that he fired FBI Director James Comey: https://t.co/lU6R1GBEsb"][".@SenDanSullivan Many communities in Tongass &amp; Chugach rely on SRS to fund vital services like public schooling, emergency services, and road maintenance."][".@SenDanSullivan SRS helps resource-dependent communities with tax-exempt federal lands to provide essential public services."]["I appreciate @SenateMajLrd commitment to work w/ @SenDanSullivan &amp; me to reauthorize Secure Rural Schools program. https://t.co/BGytr9PhrO"]["Arctic Week starts today, w/ more than 1,000 ppl from around the world meeting in #Fairbanks for the @ArcticCouncil to discuss Arctic issues https://t.co/oCQbePu40u"]["Great showing at the Alaska Aviation Gathering in Anchorage this past weekend! https://t.co/C9ioqSypx1"]["Today Anchorage honored the men &amp; women of law enforcement for Alaska Police Memorial Day, to remember the lives lost in the line of duty. https://t.co/inlFUVcikP"]["I thank John Lee for his years of service as the CEO of Mat-Su Regional Medical Center. Best of luck with your future endeavors! https://t.co/MIzaI7XI8H"]["Senate passed omnibus funding bill today, which provides critical stability, protections, &amp; opportunities for AK: https://t.co/APhhIsCJmI https://t.co/08XiVYEkIE"]["Headed to the @SenateFloor to discuss the Omnibus Bill &amp; how it impacts Alaskans. Watch live floor here: https://t.co/JMtOTcYT6C"]["I'm holding a Facebook Live discussion tomorrow on funding the government &amp; Alaska's priorities. I can't wait to hear from all of you! https://t.co/NH6A2ogDbE"]["Congrats to the winners of the 2017 50th Annual Masonic Outstanding Student Awards - a truly impressive group of young men and women! https://t.co/ikGVBNRLan"]["Sounds like Alaskans in Southeast experienced quite an earthquake this morning – hope everyone is safe! https://t.co/45HzKz4m6x"]["It was an honor to receive an award from the Close-Up Foundation with the teachers and parents who help us bring young Alaskans to DC https://t.co/D4PgDoEVKo"]["Met w/ AK Assoc. of Secondary School Principals to discuss important education issues like teacher shortages &amp; greater local control. https://t.co/WnP0UTEDKB"]["Alaskans support offshore Arctic development. I applaud @POTUS's commitment to explore development opportunities: https://t.co/y5Hia46XpJ https://t.co/GWoq6q2aC8"]["Had the pleasure of meeting Bob Williams, an exceptional educator &amp; the first Alaskan to be inducted into the National Teachers Hall of Fame https://t.co/bRLK18D5Cp"]["2nd EO signed by @POTUS returns control of education decisions to those closest to students &amp; reduces gov. control. https://t.co/Rm8UYd5eg1"]["Thanks to the crews for your heroism, bravery &amp; determination during this mission &amp; cont'd. efforts to keep us safe. https://t.co/aMYW6YFebh"]["Congrats to the crews of Air Force Rescue 466/471/2108, the Guardian Angel team Bruin 01, &amp; members of the Alaska Rescue Coordination Center https://t.co/9532Ndlro2"]["Thanks @POTUS. I’ll hold you to it! https://t.co/cKAt7mAgDz"]["@POTUS signed an EO today directing the @Interior to review national monuments. Shifts Fed power back to the ppl. https://t.co/dAzSYwM0zZ"]["Met with the staff of the Fairbanks Cancer Care Physicians to discuss cancer care in Interior Alaska. Our state is lucky to have them! https://t.co/U9WYiXEAuX"]["Congrats to Gov. Sonny Perdue on his successful confirmation to be our next @USDA Secretary: https://t.co/WGtgT0J1A5. https://t.co/Qoum5eMzTo"]["On #HolocaustRemembranceDay, we remember the millions of innocent people who lost their lives. They will not be forgotten. #NeverAgain"]["Headed back to Washington, DC today. Beautiful views flying out of Anchorage. https://t.co/GlzpZ9X4AR"]["Spoke to @AKAlliance members in Kenai today on the need to access and responsibly develop our resources. https://t.co/QhdUBchA1D"]["Beacon Fire Training Facility facility provides valuable service training crews for aircraft rescue &amp; fire fighting. https://t.co/S0ZcEOOGyM"]["Went to @ Beacon Fire Training Facility in Kenai, the sole FAA-certified regional fire training center in AK. https://t.co/kUVuVu8RQJ"]["Met w/members of the Nat'l Restaurant Assoc. today to discuss tax reform and other issues impacting AK's small businesses. https://t.co/13DdnYmMNB"]["Great visit to Mat-Su Career/Technical High School, touring the new building, &amp; seeing the world-class training they provide young Alaskans. https://t.co/nNh1ReWNWN"]["Such a warm welcome at Meade River School in Atqasuk. https://t.co/f5Umbh1RlD"]["#Quintillion Fiber Optic System will deliver high-speed broadband &amp; bring more opportunities to rural communities. https://t.co/oLQ3eVUZ7t"]["Proud to join @SenDanSullivan &amp; @repdonyoung in Deadhorse @ launch of the #Quintillion fiber system. https://t.co/YRXUSAZ3Rv"]["Flying over the Brooks Range headed to Prudhoe Bay. #Alaska https://t.co/7u4PvgwuwG"]["One of my favorite family traditions this time of yr - our annual egg decorating contest. Happy Easter everyone! https://t.co/8ngPMRKG38"]["At @AESymposium I spoke about the current &amp; future state of the Arctic &amp; how we can ensure continued U.S. engagement in the region. #AES2017 https://t.co/G7cmsKm4qr"]["Proud to intro. OPENS Act w/ @SenDanSullivan -- will help create jobs, reduce our deficits &amp; keep energy affordable. https://t.co/kYtG7a8jS5"]["Beautiful sight of @USCG Cutter John McCormick Commissioning in Ketchikan. 1st fast response cutter stationed in AK. https://t.co/1FQULawVzs"]["I'm fortunate to have such great brothers and sisters (Brothers not pictured). Happy… https://t.co/FAUturlDMS"]["Sad day for AK hockey. Tonight is likely the @AlaskaAces last game in Anchorage after 15 action-packed seasons &amp; 3 Kelly Cups."]["Congratulations to Judge Neil #Gorsuch on becoming our newest #SCOTUS justice! https://t.co/fD0MhBddEk https://t.co/vnBUWLyO9i"]["I’ve been working tirelessly w/ @SenDanSullivan and @repdonyoung to reverse the proposed downsize of the 4/25 since 2014."]["Alaskans are waking up to news we’ve been waiting to hear – the 4/25 Army Brigade Combat Team @ JBER remains intact: https://t.co/YfRlr8KDc3"]["Talking w/Rick Rydell on @650keni re: Syria, SCOTUS, &amp; breaking news regarding the 4/25 brigade @ JBER. Tune in now: https://t.co/3953JGO9x7"]["Dems decision to filibuster Judge Gorsuch left no other way to advance an exceptionally well-qualified individual w/o changing Senate rules. https://t.co/uSWmsj5Zet"]["Judge Gorsuch will be his own man, following the law where it leads and that is what we should want in a Supreme Court justice."]["I pride myself as one who believes in the traditions of the Senate. But it's not the tradition of the Senate to filibuster a SCOTUS nominee. https://t.co/ckoTH3n0kf"]["Honored to receive @NSSF Legislator of the Year award yesterday &amp; look forward to continuing my work to support America's sportsmen &amp; women https://t.co/jIPAtLumb4"]["Speaking on the Senate floor on the need to confirm Judge Gorsuch. Tune in here: https://t.co/Rgshy28eGw."]["Glad to see @POTUS is on board w/ leveraging hydropower as a renewable energy source. https://t.co/BF4yFm9A3T"]["Honored to receive first-ever Legislator of the Year Award from the United Assoc. Union of Plumbers, Fitters, Welders &amp; Service Techs (1/2). https://t.co/4dOOu30gBS"]["Pleased to get call from @POTUS after he signed resolution to undo rule restricting Alaska's ability to manage wildlife on refuge lands."]["Today Judiciary Comm voted Judge Gorsuch out of committee to be considered by the Senate. He's proven himself &amp; should be quickly confirmed. https://t.co/K1QNgdnyti"]["@SenDanSullivan &amp; I intro'd leg for 150th anniversary of the Alaska Purchase, recognizing what makes AK unique https://t.co/LR74qYVa36"]["I co-sponsored bipartisan legislation with @SenDanSullivan to provide the tools needed to tackle growing issue of #marinedebris in Alaska https://t.co/p6RcGqhApZ"]["On 150th anniversary of #AlaskaPurchase, @WSJ asked the question \"was it worth it?\" My answer -- absolutely. https://t.co/aFWlz5lYop"]["2 squadrons of F-35s headed to @EielsonAFB_AK in 2020! https://t.co/6MHJ6lE8lz"]["Today @USArmy Surgeon Gen. confirmed support for military's ALS Research Program. There's high disproportionate rate of ALS among veterans. https://t.co/8eRYrfMM9W"]["AK's @MartinSensmeier is testifying @ @IndianCommittee hearing on Diabetes Prevention Through Healthy Living. Watch: https://t.co/6FNqPcldMv"]["I reintro'd bipartisan Sportsmen's Act to provide new opportunities for Alaskan outdoorsmen to access federal lands. https://t.co/aAoNSnt9pY"]["Here at Department of Interior this morning -- found the portrait of Alaska's one and only Secretary of Interior, Walter J. Hickel. https://t.co/cG9MbPKBIo"]["Was at the White House today as @POTUS signed bill to repeal BLM Planning 2.0 &amp; returns power/decision-making authority back to states. https://t.co/hyoVvNTuJe"]["#OnThisDay in 1964 Alaska was rocked by a magnitude 9.2 earthquake. https://t.co/AT5o3sOBdG"]["Speaking at @TheWilsonCenter in 10 minutes on regional collaboration in the Arctic. Watch live here: https://t.co/vHwu9UWEow."]["Yesterday my staff in DC &amp; in Alaska participated in Choose Respect Marches, taking a stand against domestic violence and sexual assault. https://t.co/TLMnR72sx1"]["Great group of women at the @ELLEmagazine #ELLEWIW event! https://t.co/IhAohQuygK"]["Honored to be named in @ELLEmagazine Women in Washington Power List, recognizing accomplishments of women. #ELLEWIW https://t.co/DwrQrokqsv"]["Happy #NationalPuppyDay! https://t.co/z31sdY7BU3"][".@FDNMeditor Good question - a Facebook live video. I'll give a brief update and then answer questions posed by Alaskans in the comments."]["At 12:30 AKDT I'll be live on FB to talk about where things stand w/ healthcare reform &amp; answer questions: https://t.co/hgfRxeAVRA. https://t.co/AOETg3d7UG"]["Horrified to learn of terrorist incident outside Parliament in London. Praying for everyone there &amp; for the safety of the officers."]["Senate voted to return ability to manage fish/wildlife back to the states, as promised to Alaska at statehood: https://t.co/5UqnA6D0xN."]["Today I had the honor of receiving the 2017 Congressional Arts Leadership Award due to my commitment to the arts. https://t.co/VfNtWVZQiV"]["Are you subscribed to my newsletter? Stay up to date on the work I’m doing in D.C. and at home in Alaska: https://t.co/10bIrinGgs."]["Great article the two innovative Alaskans I met with in Juneau last month who are harvesting kelp from our waters. https://t.co/t2zBIhMdwB"]["Way to go Doug and all Circle of Honor drivers with @UPS! https://t.co/Ne2ghZWCzQ"]["Budget request is simply first step in long process -- President proposes, but Congress disposes. Ready to get to work as an appropriator."]["Next week I will be hosting a Facebook Live to give a legislative update on healthcare policy. Tune into my page @ 12:30 AKDT next Thursday. https://t.co/VjpRqe4LuC"]["Huge congrats to Mitch Seavey on his record-breaking #iditarod2017 win! https://t.co/1bMycWVQaS"]["Skype with @TananaChiefs today to discuss challenges and opportunities within Native communities. https://t.co/2OiMZAUP4f"]["Only in Alaska... https://t.co/s9V1otjYs2"]["Alaska is set to receive $$ to help improve air quality in Fairbanks through voluntary wood stove change-outs: https://t.co/hyuat4d3qL"]["Best of luck to the two athletes representing Alaska at the 2017 Special Olympics World Winter Games in Austria! https://t.co/p0Muc0WR2L"]["Hosted lunch for Senate colleagues today and served Alaska halibut, pollock, crab, and carrots. Nothing like fresh #AKseafood and veggies! https://t.co/xpyPKLq39w"]["The 2nd Alaskan I’m highlighting is Nora Venes Guinn – the 1st female &amp; Alaska Native District Court Judge: https://t.co/fwxxJLyC8l #wmnhist https://t.co/eLOgSauJBt"]["Enjoyed meeting with the @ArthritisFdn about juvenile arthritis earlier this week - you are a great advocate for all children Danyza! https://t.co/E4Pxk6FBuR"]["Today I joined with every one of my Senate colleagues to call for swift action regarding recent anti-Semitic threats made across the nation. https://t.co/sqrKiwRjTF"]["Met this morning with members of the @naihc_national regarding housing, community, and infrastructure policy for our Native families. https://t.co/CuxJYnDxIo"]["After ceremonial start in Anchorage, #Iditarod2017 officially begins in Fairbanks today! My Capitol Hill office will be following along. https://t.co/LE0KkDq1VH"]["To celebrate #WomensHistoryMonth  I'll be highlighting women in AK's history, starting w/ Susan Butcher: https://t.co/BQxg49gbcl"]["Heading back east. Tough to leave after a fabulously beautiful weekend. https://t.co/HO8h56jk1t"]["Wishing a very happy birthday to our new Secretary of Energy, @SecretaryPerry. Your gift from Alaska is in the mail! https://t.co/A2gra95gVT"]["And they're off! Beautiful day in Anchorage for the start of #Iditarod2017. https://t.co/CiMHg6ve0i"]["Love this article about the @aksalmonsisters -- Alaskan women living a fishing life. https://t.co/RDzuj0Ia4s"]["NMFS is moving forward w/necessary regulations to issue quota &amp; ensure on-time halibut fishery in AK this spring: https://t.co/oLFfeiLGSD."]["Alaska high school and college students – only two weeks remaining to apply for a summer internship in my DC office: https://t.co/NryqrHGNp9"]["He will provide leadership at @ENERGY as we pursue broad benefits of energy innovation &amp; greater security for energy infrastructure. (2/2)"]["I congratulate @GovernorPerry on his successful confirmation to be our nation’s next Secretary of Energy: https://t.co/rPJ4o3d7Le (1/2)"]["What you would expect from an Interior Secretary hailing from a Western state! You have to like a guy who wears jeans to work on his 1st day https://t.co/e50s6nsdTB"]["Senate voted 68-31 to confirm Ryan Zinke as Sec. of Interior. I'm eager to work w/him to restore balance to management of federal areas. https://t.co/PEEgMlXG7Y"]["Most important tonight was @POTUS message that Congress must come together &amp; set aside differences to better our great nation. #JointAddress"]["Tonight’s #JointAddress was a much-needed opportunity for @POTUS to outline his plans &amp; vision for the future: https://t.co/hHKhuGSQQN"]["Watch @POTUS Trump's #JointAddress live below. https://t.co/mLYK3OXnPT"]["This morning I hosted a “Coffee With Constituents” in my new office to chat with the many Alaskans in DC this week! https://t.co/hKZJb6dJXX"]["Deeply concerned to see anti-Semitic incidents in US &amp; at home in AK. Anti-semitism is evil, as are all hate crimes, &amp; won't be tolerated. https://t.co/MJF3RV0Hsi"]["Great discussion w/Arctic representatives at the Conference of Parliamentarians of the Arctic Region meeting last week in Anchorage. https://t.co/MIddxRnsJD"]["Today marks Denali National Park &amp; Preserve’s centennial! @DenaliNPS has inspired Alaskans &amp; visitors for 100 years. https://t.co/s36IGWV6eo"]["Last week in Juneau I sat down with @USCG leadership for a debrief on ongoing and future Coast Guard activities throughout Alaska. https://t.co/qTII82GoP0"]["Sad to hear this is @AlaskaAces last hockey season. The team was such an important part of Anchorage, &amp; their games were always a blast! https://t.co/zWD3S6AKhi"]["Happy Fur Rondy!! https://t.co/jP9qLznqjP"]["Great discussion w/ @UFA_Fish -- representatives from all of Alaska's coastal communities -- about fish issues in our state. https://t.co/a6q1mUvPEA"]["Honored to announce award winners last night at Symphony of Seafood, celebrating  entrepreneurs and innovators in Alaska. https://t.co/NxbbX8m7oT"]["Bumper sticker I saw in Juneau...I couldn't agree more! https://t.co/m8JxZgJrZD"]["One hour until I deliver my annual address to the Alaska State Legislature. Watch live at https://t.co/RQVhZ6sbz0 #akleg https://t.co/4XJjcAdEOR"]["Flying between Wrangell and Petersburg this morning. Beautiful day in Southeast Alaska. https://t.co/mxKVOJRW9z"]["It was a true honor to meet John Reese, the last Ketchikan resident who can fluently speak Sm’algyax, the Tsimshian language. https://t.co/eVDwFtb50a"]["Busy day in Ketchikan yesterday! Started the day by meeting w/ AARP members to discuss the future of Medicare, Social Security, &amp; the ACA. https://t.co/hNBpkJGDQ3"]["XC-skiing in Girdwood today. Perfect for skiing &amp; haiku:\n     Snow. Lightly, slightly\n     Brushing all my eyelashes\n     Winter mascara https://t.co/9PaoPBvYdt"]["Last night was @AKASYMCA Salute to the Military – a night to honor the men &amp; women who serve our nation in Alaska #AKsalute2017 https://t.co/E25CKlk4cP"]["My statement on voting for Scott Pruitt as the next @EPA Administrator: https://t.co/MSne5IvBSP"]["Alaska’s opioid crisis has devastated so many communities, and this move will provide the tools needed to combat this terrible addiction. https://t.co/TYPoh4vvRT"]["Today is Elizabeth Peratrovich Day, to celebrate one of AK's greatest civil rights activists, female leaders, &amp; champion for Alaska Natives. https://t.co/2xnqtaYiIH"]["I couldn't agree more with @USCG Vice Commandant @AdmiralMichel! https://t.co/UX7epnZiY5"]["My sincerest condolences go out to the family and friends of the 2 killed and 17 injured in the fire at the Royal Suite Lodge in Anchorage. https://t.co/7br4yMaZma"]["This has been a difficult process for Mr. Puzder and his family. I respect his decision to withdraw his nomination to be Labor Secretary."]["Huge congrats to Zuill! I've had the true honor of listening to him perform live. AK is blessed that he is sharing the gift of music w/us! https://t.co/Ggwn2L6NWU"]["I look forward to working w/Dr. Shulkin as VA Sec &amp; am confident he'll work to provide AK vets w/quality healthcare: https://t.co/rfZu0QIvb8"]["So heartbroken to hear this news about the Destination. My prayers are with their families. https://t.co/twqg0VbQyG"]["Happy 24th Birthday to my son Matt! While I’m proud to see the man that he has grown up to be, he will always still be my little boy. https://t.co/2GM30qii8g"]["Way to go, @cthstigers! https://t.co/C2Sryaq4QE"]["My staff member Deborah was in Utqiagvik this wknd for Kigvik &amp; sent me some photos. You can feel the energy and community through the pics! https://t.co/yfndwHR2z5"]["#FlashbackFriday to Kivgiq '15 - an amazing celebration of dancing &amp; drumming w/ villagers from all over the North Slope. Wish I was there! https://t.co/DXgTTJp2as"]["Gave my front desk folks a break &amp; answered phone calls this morning. Good to hear from Alaskans weighing in on issues important to them. https://t.co/4f6s6D5NHV"]["Today I met w/ Judge Gorsuch, Pres Trump’s SCOTUS nominee. I learned more about his background/beliefs &amp; educated him on important AK issues https://t.co/66eF1Mvsym"]["There is only one week left for Alaskans to submit public comments. https://t.co/a3Xp7OaZTK"]["Great insight into how the @USCG operates in the ice! #BelowZero https://t.co/l9RyjFURi2"]["I offered my congrats to our new AG @SenatorSessions &amp; he confirmed that he’s looking forward to coming to Alaska. https://t.co/w4GmpDZfrE"]["I invited @SenatorSessions to visit AK to see our remote areas &amp; see what DOJ can do to make our communities safer. https://t.co/w4GmpDZfrE"]["I know @SenatorSessions to be an honorable man, of great integrity, &amp; a person open to finding common ground https://t.co/w4GmpDZfrE"]["Although I did not vote in favor of Betsy DeVos, now that she's been confirmed it is important we work together as she takes over @usedgov. https://t.co/Q0BNfIF6iW"]["#GoRedWearRed https://t.co/BqFJqrqEMh"]["Proud to #GoRed today with my female Senate colleagues to promote awareness regarding women's heart health. #GoRedWearRed https://t.co/wz1hFTIwDv"]["Judge Gorsuch is an excellent choice for the #SCOTUS who has truly a stellar legal reputation and is a worthy successor of Justice Scalia. https://t.co/sXWGyTEGgJ"]["Great to meet w/Sebastian Ashley, an @AmeriCorps volunteer who spent time serving in Palmer and hopes to soon return to Alaska for college. https://t.co/GbJBo33N2R"]["After careful consideration, and hearing from Alaskans, I will vote against Betsy DeVos for Secretary of Education: https://t.co/u7sNCPUH3d."]["So proud to nominate 34 talented young Alaskans to the U.S. military academies. They have a bright future ahead: https://t.co/ko2S3eG4Tk"]["I'm pleased w/ @POTUS nomination of Judge Gorsuch to SCOTUS &amp; I look forward to meeting w/ him to discuss AK issues: https://t.co/1yeeEZEdFM https://t.co/Yk7gq3iCeL"]["I welcome @POTUS decision to reaffirm protections against #LGBTQ discrimination in the workplace. Every American deserves equal rights."]["I look forward to working w/Elaine Chao to find solutions that suit AK’s unique &amp; diverse transportation issues: https://t.co/rArcXd6sn2."]["All weekend long my staff and I have been monitoring implementation of President Trump’s recent Executive Order related to immigration: https://t.co/5ZPoDmareg"]["Thanks to the brave Alaskans who plunged into freezing waters to support great work of @AmericanCancer  https://t.co/yH8QAQcN8u"]["Today we remember the victims of the Holocaust, and to always stand up to hatred and bigotry. #HolocaustMemorialDay #NeverForget https://t.co/lNmVYYkOhf"]["Thanks to the generous Alaskans statewide who volunteered their time and expertise to help out with Project Homeless Connect. https://t.co/8Tkc7I1qcX"]["I thank Adm Papp for his work as Arctic Representative at the State Dept. I will ensure new administration focuses on Arctic moving forward. https://t.co/WqKv10TrFc"]["The Senate has confirmed nominees to form @POTUS national security team, one of Senate's most important functions: https://t.co/cQVFCgEf5V."]["I encourage concerned Alaskans to contact me online if you are having issues getting through on the phone: https://t.co/c5EkofdzjX (3/3)"]["My staff is doing the best they can to manage phone calls &amp; listen to VMs. We're looking for solutions to manage the high # of calls (2/3)"]["My AK &amp; DC offices have been overwhelmed w/calls from the Lower 48 which has made it difficult for Alaskans to express their opinions (1/3)"]["Congrats to Mt. View neighborhood on re-dedication of the improved Mt. View Elementary School! https://t.co/2oIMy4e5q3"]["Huge congrats to Pete Kaiser on his 3rd consecutive @Kuskokwim300 victory! Traveling by dog sled in -50F -- talk about Alaska tough. https://t.co/epw6S3kYit"]["Spotted my husband Verne in the crowd at #Inauguration2017 https://t.co/BvOcgxxK1O"]["View from the stage at the #Inauguration https://t.co/MkyzWXpQqA"]["Brrr! https://t.co/9y28Ei1vMz"]["It's moving day! Made sure to take special care of my 63 pound king salmon, Walter. https://t.co/0ZDSpXsnmJ"]["First chair at Alyeska this morning with my nephews. Fresh snow! #Alaska https://t.co/pjxEE7DNhn"]["My condolences &amp; prayers go to Dale Tran's family. I will remember his contagious smile &amp; love for his community. https://t.co/tURHENSmUz"]["Good news for jobs &amp; investment in #Alaska. @COP_Alaska announced oil discovery in GMT w/ aprox 300 million barrels of recoverable oil."]["The longer our parks go w/out attention they need, the more costly it'll become for taxpayers to properly steward &amp; restore these gems. https://t.co/62S715rdEJ"]["We can now begin process of creating an affordable healthcare system that will return flexibility to states &amp; improve accessibility of care."]["We made a step towards repealing failed #ACA --a  necessary step towards delivering better healthcare for Alaskans. https://t.co/bua8iaHanR"]["#Obamacare has harmed Alaskans for too long: rising premiums, diminishing coverage choices &amp; done nothing to reduce cost or improve quality."]["I'm eager to work with a new administration to restore common sense &amp; resolve this horrible injustice for #KingCove. https://t.co/eqHQ1iZ6it"]["Life-saving road remains best &amp; only real option to help #KingCove have reliable access to medical transportation. https://t.co/eqHQ1iZ6it"]["Proud to intro leg. w/ @SenDanSullivan to authorize short, 1-lane gravel, non-commercial road for #KingCove. https://t.co/eqHQ1iZ6it"]["Working to ensure #ACA replacement provides Americans w/ certainty, access &amp;affordable options for healthcare needs. https://t.co/4iTlpUke2L"]["With a new administration &amp; new Congress we have an opportunity to fix failures of #Obamacare, but a repeal and replace need to coincide."]["I remain committed to repealing #Obamacare. I am equally committed to ensuring all Alaskans have access to affordable, quality healthcare."]["Congrats @vhhydroponics and thanks for your efforts to taking on Alaska's farming challenges. https://t.co/TRovZLYims"]["Met w/ @GovernorPerry, Energy Secretary nominee &amp; had good discussions on energy issues of importance to our nation. https://t.co/Ds75ZgX6Qr"]["Spradznikom to all who are celebrating Russian Orthodox Christmas this weekend!"]["Happy 98th birthday to WWII hero, legendary bush pilot, and all-around great Alaskan Urban Rahoi! https://t.co/wlrMeLbhiq"]["Allowing development would create new jobs, reduce our deficits, and protect our national security and competitiveness for a generation. https://t.co/8aD0rHB9q6"]["...and I look forward to continuing the conversation next week during her confirmation hearing in the Senate HELP Committee (2/2) https://t.co/YgENU78Nhw"]["Today I met w/Betsy DeVos, the Secretary of Education nominee. We discussed many important education issues facing Alaska &amp; the nation (1/2) https://t.co/sGLiUkXEfo"]["Thanks to my scheduler Kristen for making the best looking and best tasting cookies for swearing in day.  #Alaska https://t.co/ta9SV2wkMt"]["Happy Statehood Birthday Alaska! On this day in 1959, Alaska became the 49th state admitted to the union.  https://t.co/abrmxXLDwJ"]["Today I was sworn in to my fourth term as U.S. Senator for Alaska. I look forward to continuing to stand with and represent all Alaskans. https://t.co/W8jBhaIcyX"]["The 115th Congress begins today! I will be sworn in to my new term as U.S. Senator at noon DC (8 am AK). Watch live: https://t.co/jHi756XEc9"]["#HappyNewYear, Alaska! Here’s to a happy, healthy, and prosperous 2017. https://t.co/QIrlwYguod"]["#TBT to skiing at Alyeska this time last year! https://t.co/irMAMyA98V"]["26 years of a fantastic New Year's Day tradition! https://t.co/43DeEM9CtG"]["A favorite holiday tradition of mine is ringing the bell for the Salvation Army at the 5th Avenue Mall! https://t.co/h6WpEV2MV7"]["What are some of your favorite #Christmas tree decorations? Feel free to share yours! https://t.co/3DAKUR1rbm"]["Anchorage is blessed to have @BeansCafeAK helping those in need since '79. I was happy to lend a hand serving lunch. https://t.co/OM2lskXFto"]["Wonderful to see everyone at the annual Holiday Luncheon in Anchorage today - a tradition… https://t.co/nRLVhDR6AA"]["Despite requests for cooperation @EPA today released a proposed Federal Plan for Commercial Industrial Waste https://t.co/JRTvw1uuhZ"]["Great to visit Tudor El &amp; see video students created encouraging others to think about peace https://t.co/wOPLqUfp5G https://t.co/zwPEVYTo8Y"]["What a welcome back to Alaska! Bull moose in my neighborhood this morning. #OnlyInAK https://t.co/K0r1jWGdJ6"]["Many thanks to all the volunteers who made the Neighborhood Gift event such a success! The generosity of Alaskans never ceases to amaze me. https://t.co/38Z7G286Uq"]["Beautiful ornaments from @uaanchorage students on Alaska's Christmas tree in front of the White House. https://t.co/Rbhxyr4YwT"]["Wonderful to hear the surgery was a success. I will continue to pray for your swift and full recovery. https://t.co/vhoTAUwqed"]["Way to go @UAASeawolves volleyball team! https://t.co/WnhpEk4Q4R"]["My scheduler Kristen was named @RiponSociety Top Exec Assistants/Schedulers on Cap Hill. Congrats &amp; thx for trying to keep me on schedule! https://t.co/2ECsooA8gP"]["Great to run into a group of fellow Alaskans here in D.C. who are volunteering their time and… https://t.co/xPD2kMptRa"]["Senate passed leg. addressing infrastructure priorities on our coasts &amp; rivers. Alaskan communities set to benefit. https://t.co/6HutZqTjcA"]["(2/2) We have no idea what that designation will mean for subsistence, shipping, fishing, &amp; other activities in AK. https://t.co/m0UeZQjv04"]["(1/2) @POTUS announced an Executive Order creating a Northern Bering Sea Climate Resilience Area for 112K+ sq. miles off Alaska’s coast."]["Way to go @UAASeawolves! And best of luck tomorrow. We are proud of you. https://t.co/H0zxVTpGLu"]["Senate just passed #NDAA to keep our nation safe &amp; and provide support for our troops and their families. https://t.co/OYWPnK5N6b"]["Thanks @USCG &amp; good Samaritans for all your efforts to rescue distressed fishermen. Hoping for safe return of 2 individuals still missing. https://t.co/Iz2EkbJtNP"]["I'm incredibly humbled to be included among a group of amazing global leaders that is at the forefront to end violence against children. https://t.co/KdAAYfq93M"]["Senate passed #CuresAct to advance medical research, boost mental health programs, &amp; fight nation’s opioid epidemic: https://t.co/DGjHiHAH3r"]["Today marks 75 years since the attack on #PearlHarbor. Let's take a moment &amp; remember the courage of so many American heroes during WWII. https://t.co/DymS73cZ3s"]["Amazing story! And thanks to @AlaskaAir for helping this Pearl Harbor survivor make the journey. https://t.co/hz3iDhC1Jq"]["So sad to hear that Byron Birdsall has passed. His talent was a gift to all of AK, &amp; I've loved showcasing his paintings in my DC office. https://t.co/ZX0vi4h6ij"]["Welcome home to the soldiers of the 109th Transportation Company and thank you for you service. https://t.co/FsxI0FSZNo"]["Thanks to the men &amp; women of the @uscoastguard for standing ready to help distressed Alaskans at a moment’s notice https://t.co/Uznklq453g"]["Today the Senate passed long-term sanctions against Iran, the world’s largest state sponsor of terrorism: https://t.co/AmbFeslTCV https://t.co/9YXjQCYdji"]["#TBT to this time last year when the U.S. Capitol Christmas Tree made its way to Washington, D.C. all the way from Alaska. https://t.co/QzKQ8ffRJZ"]["You know you're an Alaskan when -27C is considered \"much warmer\". https://t.co/OxTrsZz68b"]["Thank you to the G.A.L.s group for the work that they are doing to ensure a better future for Alaskans! https://t.co/6KfblwoEfc"]["(2/2) By passing this bill, we will utilize technology to meet healthcare needs for Alaskans in rural areas. https://t.co/diITQ5rzdc"]["(1/2) Proud to support #ECHOAct to increase access to high-quality healthcare in hard-to-reach areas – including much of rural Alaska."]["I want to encourage Alaskans to get out on Small Business Saturday &amp; support the drivers of our local economies! https://t.co/4quKInlnHH"]["I wish everyone a #HappyThanksgiving today! https://t.co/hNMX2Xz9sn"]["Some good tips! https://t.co/EbASwLdVB9"]["(2/2) There is no limit to what we can accomplish when we work together, build partnerships &amp; find solutions in our differences."]["(1/2) Humbled to receive Panetta Institute’s '16 Jefferson-Lincoln Award, recognizing bipartisan leadership in public service. https://t.co/yRZir5EBwD"]["(2/2) Public health workers serve in so many different ways - from epidemiologists to  nurses - all who help to improve health of our nation"]["(1/2) As we approach Thanksgiving &amp; reflect about all we are thankful for I want to extend my gratitude to public health workers. #PHTYD"]["Another successful Rock/Stevens Smokehouse Gala held in honor of 2 great Alaskans, celebrating Alaska Native ways of life &amp; AK leaders. https://t.co/fFLFzcTe2b"]["So sad to hear of the passing of Nancy McGuire, editor/publisher of the Nome Nugget. Her voice will be missed in Nome and throughout Alaska. https://t.co/rB6euBdfbv"]["I wore purple in honor of #WorldPancreaticCancerDay to raise awareness &amp; support those impacted by it #InItTogether https://t.co/JvfI8ceeGh"]["About to speak on Senate floor to honor Alaska's law enforcement. Watch live here: https://t.co/9wpoZrQPhY"]["This OCS decision will tell us whether Obama admin. has chosen to seize an opportunity to grow our economy &amp; protect our security. (2/2)"]["Today I advocated for new lease sales in the Arctic, as Obama admin. is set to announce leasing plan for OCS energy development. (1/2) https://t.co/qZYnwILETV"]["Way to go @AlaskaAir for taking flight with renewable fuel and blazing a trail for alternative energy resources! https://t.co/fVeCyocYEA"]["In Ottawa the past few days working #Arctic issues as U.S. Representative on the Standing Committee of Arctic Parliamentarians. https://t.co/Wvo3a8ZG5f"]["Beautiful sight from the Veterans Day ceremony in the Mat-Su Valley last Friday. Nobody honors our veterans better than Alaskans! https://t.co/RStRMQIWsY"]["Praying for quick &amp; full recovery for the officer. My heart goes out to the entire Department &amp; Anchorage community. https://t.co/CTz5vvnvGM"]["Happy birthday to the #USMC! For 241 years the U.S. Marine Corps has protected and served our nation with honor and distinction. https://t.co/TasGbR1wxQ"]["My statement on the outcome of the Presidential election: https://t.co/FblI2n1lCh"]["Heartbroken to hear of Edward Itta's passing. His knowledge of Arctic policy was 2nd to none, as was his passion for AK's Native cultures. https://t.co/Lun0wtx5r4"]["Encouraging to see so many Alaskans helping victims of domestic violence by supporting @AWAICinc critical services. https://t.co/BRPFZEuUX8"]["Humbled to join w/ others @ Anchorage Mayor's Prayer Breakfast, to pray for the city &amp; our local &amp; state leaders. https://t.co/m5iVNzVHik"]["About to go on live on Q99.7 Valley radio @ MY House. https://t.co/9KMGUUsDNZ"]["Beautiful day out in the Mat-Su Valley! https://t.co/M9rtuB4feN"]["Great to see ret. @USAF Master Sgt. Reese Hines' progress/recovery @JBER since I saw him in '11 @WalterReedArmy after wounded in Afghanistan https://t.co/tFjUw75i8N"]["Toured the Traumatic Brain Injury clinic at JBER &amp; saw why it’s #1 for USAF. Staff provides invaluable support for service members &amp; vets. https://t.co/BxHVg9yRTB"]["Congrats @kinrossgold Fort Knox Mine - the most productive gold mine in AK history - on your 20th anniversary. https://t.co/X55hhGuqT2"]["Great step in addressing AK's unique comms challenges - ensuring Alaskans stay connected no matter where they live. https://t.co/EeIJU9WKJD"]["Thanks @USCG &amp; good Samaritans on Sweet Pea for rescuing 5 souls. Your response &amp; willingness to serve is inspiring! https://t.co/nmZOKUfVL6"]["#HappyHalloween, Alaska! Had a blast this past weekend @ Kenai's trunk-or-treat. Excited to see more great costumes! https://t.co/soUAVSSeDv"]["I am always proud of Alaska’s fishing industry where we host 6 of the top 10 ports nationwide! https://t.co/DIMi2CYr5u"]["It was an honor to speak at the #AlaskaWomensSummit and discuss how Alaskan women can break through barriers. https://t.co/JVRI39wcu8"]["Great to see @AlaskaAir  honoring those who have served our nation: active duty, veterans, &amp; the fallen. https://t.co/ZyjACn9zsC"]["Beautiful view of the sunrise from my Anchorage office. #Alaska https://t.co/tXE8xXln17"]["Pleasure to speak w/ @Alaska_Seafood members and hear their outlook on Alaska’s #seafood in the world market. https://t.co/vQypjibeuH"]["We cannot lose sight of how important it is to broaden access to programs that are beneficial to treatment of our wounded service members. https://t.co/Jpw13683lN"]["This creative art therapy partnership w/ NEA and DoD will help our service members veterans and their families. https://t.co/2kE2kbffpk"]["JBER 1 of 5 new locations to offer Military Healing Arts Program through funds I secured in FY16 Interior Approps. https://t.co/2kE2kbffpk"]["As we head into winter Alaskans are bracing for even higher heating bills - This $ will make a crucial difference. https://t.co/eU0K6gkhMN"]["Alaskans are getting heating bill relief, as over $15 million in LIHEAP funds are making their way to our state. https://t.co/eU0K6gkhMN"]["Great time speaking with many of Alaska’s educational leaders at the 50th Annual Alaska Principals Conference this morning. #akprincipals https://t.co/A3IBq34dMd"]["This is why I helped introduce Ensuring Health Care Opps. Act, to remove burdensome mandates created by the ACA. https://t.co/SL81HBqEAV"]["Premiums skyrocketing due to the ACA is a call for flexibility &amp; competition to give Americans choice of coverage https://t.co/SL81HBqEAV"]["At #2016AFN- Wonderful time canvassing beautiful handmade art &amp; jewelry that represent nearly every region in AK. https://t.co/NM71exYiTi"]["Was given a bandana by My Grandma's House - a suicide prevention effort. It reads \"be a fireweed even after a fire they bloom.\" #AFN2016 https://t.co/WmcVrgpn3a"]["Thanks to @repdonyoung for hosting All Academies Night in Fbx! Deadline for military academy nomination is Dec.1: https://t.co/WNH4Hrz6Lx. https://t.co/Msjd5BwYte"][".@SenDanSullivan &amp; I recently introduced Senate Resolution commemorating 50 years of Alaska Federation of Natives: https://t.co/vf5P9qCxYj. https://t.co/CA2EQwRu3y"]["In Sitka at the parade for #AlaskaDay. https://t.co/aYxlfNhKl7"]["Happy #AlaskaDay. It’s a joy to be celebrating this day in Sitka – where the official Alaska Day Festival is held! https://t.co/inaTqHdjjI"]["In Juneau-toured Wildflower Court Sr. assisted living home &amp; saw firsthand great care provided to our seniors. https://t.co/FpHitbPVJP"]["Wonderful to see young Alaskans doing great things to help out their community. https://t.co/ItqFwSAPPf"]["At Alaska's Healing Hearts Warrior Western Day in the Mat-Su Valley, this serviceman showed just how fun four-wheeling in Alaska can be. https://t.co/F2xUPKkPZG"]["I was proud to recently join with Anchorage's own Fil-Am community to celebrate Filipino American History Month! https://t.co/zWd4QuduON"]["Always great to address Alaska’s student leaders at the Alaska Association of Student Governments’ Fall Conference! https://t.co/gbNn1Ojv27"]["Excellent news – my bill with @SenatorHeitkamp to improve the lives of Native children has been signed into law! https://t.co/Wr02whZEjJ"]["Yesterday I visited LeeShore Center, the domestic violence and sexual assault facility serving the northern Kenai Peninsula. https://t.co/SteCiGEl4o"]["Spoke at @AlaskaChamber Fall Forum in Kenai today to lay out what I'm doing on the federal level to build AK's economy. https://t.co/ZFS16NkKKr"]["Wonderful to speak w/ students studying U.S. History &amp; Civics @KodiakHS today about the responsibilities and challenges of public service. https://t.co/aMk0wEplQZ"]["Spoke to Coalition on Housing &amp; Homelessness, updating them on work done in the Senate to reduce homelessness in AK #akhomelessness https://t.co/mbkuITrORs"]["Stopped by AVTEC in Seward this past weekend and learned to navigate through ice on their marine simulator. Amazing technology! https://t.co/oCuYGr9nny"]["Great to meet w/ the hard-working men and women of UniSea, which produces some of the world’s best sustainable seafood products from Alaska! https://t.co/taejANhrlb"]["Spoke with some great Unlaskans at the Ballyhoo Lions Club luncheon this past week! https://t.co/QAkKFPrDCn"]["On #NationalSalmonDay, I'm grateful for this bountiful natural resource that sustains Alaskans across the state. What about you? https://t.co/rbPvOjjdzx"]["Toured the Alaska pollock catching/processing vessel, the F/V Starbound – owned &amp; operated by Aleutian Spray Fisheries w/a crew of 130. https://t.co/7Bl6L5xk4X"]["Navy responded to my concerns over Northern Edge exercise, expressing commitment to engage early &amp; often w/Alaskans: https://t.co/NKZnNonxpj"]["Excellent news–Vivian Korthuis will lead Assoc. of Village Council Presidents, the first woman ever to do so. Truly an historic occasion! https://t.co/R4J0kTVzcr"]["Pleased to say the BIA Tribal Providers Conference, an invaluable opportunity for AK's tribes, is back on schedule: https://t.co/egT3dUVppz. https://t.co/X5RXgtC1Cv"]["Visited w/ Dr. Ann Nora Ehret, Medical Director at the Iliuliuk Family and Health Services Clinic in Unalaska yesterday. https://t.co/xmzDnu5cSI"]["Great to speak with students at Unalaska High School! https://t.co/W3BAuz0Bk0"]["Spoke at @WTCAlaska Arctic Ambitions Conference about commerce and investment in the #Arctic. https://t.co/Ajdgrynfil"]["I look forward to keeping all of the federal permitting agencies aligned &amp; on time so Caelus can move from exploration to development (2/2)"]["Caelus’ Smith Bay discovery is exactly what our state and nation need to keep TAPS viable (1/2) https://t.co/OOvNoF9E84"]["My bill w/ @SenatorHeitkamp addressing challenges facing Native youth is headed to President to be signed into law: https://t.co/Wr02whZEjJ. https://t.co/3sutlA3B3C"]["(2/2) Since helping found BCDC in 70's, I’m proud of all my mom has done to raise support for early detection &amp; screening for Alaskan women. https://t.co/fALeIVcsph"]["(1/2) Wonderful event in Fairbanks celebrating 40th anniversary of Breast Cancer Detection Center (BCDC). https://t.co/hvC6D9vwlv"]["At Mat-Su Valley Cancer Center opening, we wrote notes of hope to serve as a reminder that patients aren't alone. https://t.co/EXMl0hcezD"]["Mat-Su Valley Cancer Center - state of the art facility will give Alaskans a chance to receive care closer to home. https://t.co/eE700JYVAJ"]["Happy to see so many Alaskans show their support for the @ChildsLunchbox to combat childhood hunger across our state. https://t.co/X4OIkEbByF"]["Congrats to the 3 Alaska schools recognized as National Blue Ribbon Schools – Academy Charter, Bayshore Elementary, &amp; Orion Elementary!"]["I love seeing Alaskans in our nation’s capital! Yesterday I chatted w/ a group of young Alaskans in DC for the National Native Youth Summit. https://t.co/XYV1YQ5Zhu"]["Alaskans know that winter is on its way! Today's AK Snow Symposium brought together those who keep roads safe/accessible during the winter. https://t.co/nMuqAsvB4n"]["Bill I co-sponsored to empower Native communities and boost tourism in Alaska has been signed into law: https://t.co/kTFjsPc6yn."]["Fabulous to see Martin Sensmeier of Yakutat – star in “The Magnificent Seven” –  here in DC to meet w/Native youth. https://t.co/N2qej9yM3b"]["Great opportunity for tribal members to gather w/ common goal of improving lives of AK Natives &amp; American Indians. https://t.co/eWwMgIAnp6"]["Great to see so many Alaskans at WH #TribalNations Conference – bringing together tribal leaders nationwide. https://t.co/NKFZ1akFCy"]["Yoga on the National Mall this morning! https://t.co/RyrjcBxcAG"]["Thoughts and prayers for the APD officers injured today in the line of duty and for those still in harms way. https://t.co/Ii4rb0qnQr"]["Today Alaska welcomed its 1 millionth cruise ship passenger to the state this year. A great sign for Alaska’s tourism industry! https://t.co/8uE5S5B9QR"]["This measure ensures that Alaska is not just a resource-rich state, but also a resource-producing state: https://t.co/a27cMKoD4B. (3/3)"]["Bill facilitates responsible oil, gas, mineral &amp; timber production in AK, increasing economic growth &amp; creating thousands of new jobs. (2/3)"]["Today @EnergyGOP considered economic development bill I intro'd that comes at a vital time as Alaska grapples with its fiscal crisis (1/3) https://t.co/cDZg8AHjSr"]["Great to meet Angels in Adoption Pat &amp; Clarissa Kougl of North Pole, who have opened their home &amp; hearts to children https://t.co/xe5OzER2PH"]["Impressed w/ UAA’s Dr. Amstislavski, who created an environmentally-friendly &amp; cost-effective thermal insulation. https://t.co/Gj5ruLaSBq"]["Recently contacted @USNavy, requesting engagement w/ AK communities concerned over Northern Edge military exercise: https://t.co/uOcXR8Wu6o."]["Here’s to many more years of peace, investment, and discovery in the Arctic through the vital work of the Arctic Council! https://t.co/rttv6vq1wS"]["Happy B-Day @usairforce -keeping America safe for 69 yrs. Thanks to all the airmen &amp; women serving in Alaska!#AFBDAY https://t.co/gzPKGScs71"]["First stop in Kodiak today. Amazing! https://t.co/pklciLaLlD"]["Happy #ConstitutionDay! Today we celebrate the 7,591 words that have kept our country together for centuries. https://t.co/FQKlEXFDIV"]["The Senate passed legislation with a huge impact on water resource development in small communities across AK: https://t.co/sNgLJ2QlMO"]["I had a great time w/ Sen. @MartinHeinrich at the Congressional Sportsmen’s Foundation banquet last night. https://t.co/IKTQHw3ijH"]["Proud to intro bill w/ @SenDanSullivan &amp; @DonYoung to once again give Alaskans a choice in healthcare coverage: https://t.co/l2hwzs4fC5"]["Couldn’t agree more! https://t.co/weuqEQzwBF"]["Great to meet with Alaska’s Secondary Principal of the Year, Shaun Kraska of Fairbanks! https://t.co/gvUYaUYNWo"]["I told my Senate colleagues it's past time we build a road &amp; help the people of King Cove #StandWithKingCove https://t.co/XBO4LkqUtn"]["Great overview about how my energy bill promotes renewable energy resources in Alaska. https://t.co/OQ9HEDBwQB"]["Had a blast at @SpecialOlymAK tourney this wknd. Great to see the hard work put in by the org. &amp; athletes pay off. https://t.co/TvTfR8lhK3"]["And we honor all who have and continue to make tremendous sacrifices to keep us safe, at home &amp; abroad. #NeverForget https://t.co/An9NWKrLIx"]["Today, we pay tribute to the courage, bravery, &amp; heroism shown by our first responders. https://t.co/An9NWKrLIx #NeverForget"]["Today, we remember those who lost their lives in these terrible attacks. #NeverForget https://t.co/An9NWKrLIx https://t.co/Ju8NsEmXgA"]["#FlashbackFriday to last weekend duck hunting in #Alaska with Verne. https://t.co/s1KcyoVqiJ"]["AK Delegation &amp; I wrote to @JohnKerry @StateDept's lack of ensuring Canada protects transboundary waterways in AK.  https://t.co/NKKOQehtP2"]["Proud to stand with Alaskans and @FoodBankofAK to raise awareness of the impact of hunger. #HungerActionMonth https://t.co/Bj5ckxELQl"]["In #energy conference mtg, I reminded my colleagues our task: to develop a final bill that can be signed into law. https://t.co/lj2KHjGb6e"]["Congrats to Romig Middle School teacher Catherine Walker for winning Presidential Award for Math &amp; Science Teaching. https://t.co/5x52jg0KNV"]["Couldn't be a more beautiful day for flying in the Interior. #Alaska https://t.co/CQjXRNCoIf"]["Headed off to hunting camp. Off the grid! #Alaska https://t.co/ovqj35J6UF"]["I am praying for the families, friends, and the communities who have lost their loved ones in yesterday's crash. https://t.co/L2qWfsK4yn"]["Thanks AT&amp;T for $750K grant to @UnitedWay @covenanthouseak &amp; ASD to help raise Alaska's high-school graduation rate. https://t.co/XzL5uIQ0E7"]["Congrats to Susan Carney for being sworn into the Alaska Supreme Court- 3rd woman to sit on the court. https://t.co/61Nwhnnaxt"]["Great to see Homer’s newest ambulance. Thanks to Code Blue program, the community is getting an EMS boost. #Homer https://t.co/yFhFeXe08K"]["Grand opening of first Krispy Kreme in Alaska is at 5am tomorrow. 80 new jobs with the opening @KrispyKremeANC. https://t.co/plPCPTLoCA"]["First In line waiting for the first Krispy Kreme in Alaska to open @KrispyKremeANC https://t.co/bNJweBV7Mw"]["Great news for #Alaska as @usdaRD announced $810K+ grants &amp; loans to improve the health &amp; safety of our communities. https://t.co/lzeSTt8iKv"]["It was great to see so many Alaskans out at the Kenai Peninsula Food Bank Soup Supper this weekend. https://t.co/Kadhm957C4"]["Flying from Fairbanks to Anchorage tonight. Denali is pretty spectacular in the evening sunset. #nofilter https://t.co/gHBeYjXEL0"]["Happy 64th wedding anniversary to my mom and dad. Fabulous parents! https://t.co/NK3R2ZPJU6"]["Saddened to hear of the passing of Maj. Gen. John Schaeffer. A lifelong servicemen who will truly be missed. https://t.co/ETe76ngm0d"]["Happy #NationalDogDay! Family dogs have brought so much love to our family over the years. https://t.co/aINrkGe36m"]["Former intern sightings at the @AlaskaStateFair -- Annie and Tavish. https://t.co/IL47eHAwbm"]["Great to see @usdafsa Administrator Val Dolcini visit AK and make it to the  Matsu Alaska Legislation Farm Tour. https://t.co/3Shv4HLbh4"]