["Pres Trump doesn’t have a bottom floor – with every insult he stoops lower and lower. Truly a disgrace. https://t.co/1BethMotDi"]["Thankful for the leadership of @SenatorDurbin @LindseyGrahamSC @JeffFlake @SenBennetCO @SenCoryGardner &amp; @SenatorMenendez. Looking forward to reviewing bipartisan agreement on #DreamAct &amp; will do everything I can to #ProtectDreamers https://t.co/rPOmBX8tmT"]["Congress must preserve the ability to collect info that is actually necessary to guard against threats to our security, while also guarding the privacy of innocent Americans, which the framers understood was vital to American liberties. #FISA #Section702 https://t.co/LQwpOibJil"]["Today is Aldo Leopold’s birthday! As a US Forest Service ranger in NM he championed the idea of permanently protecting some of those last blank spots as wilderness—starting with the Gila. I’ve been proud to continue this tradition by protecting Columbine-Hondo, Ojito &amp; Sabinoso. https://t.co/QjHPxVkeBo"]["The future of Dreamers and the future of our country are inextricably linked and I won’t stop fighting to make sure they are protected and are here to stay. #DreamActNow https://t.co/VEhOpjKDs6"]["We’d lose these college students with bright futures, a licensed mental health therapist providing much-needed services to at-risk youth &amp; families, an early childhood educator, a student pursuing a computer engineering degree at New Mexico Tech, &amp; a nursing student. #DreamActNow https://t.co/bMCdlRYxpF"]["Ivonne Orozco-Acosta, 2018 #NM Teacher of the Year could be deported if she is stripped of #DACA. NM can’t afford to lose her &amp; neither can her students. We cannot be a country that kicks out our best teachers! #DreamActNow https://t.co/oEO8v4DTZB https://t.co/B18uxgKvGT"]["It can’t be overstated how devastated communities in New Mexico and across the country would be if #DREAMers are stripped of protections &amp; deported. We’d lose critical members of the community that we rely on including:"]["President Trump is clearly confused on FISA. But what’s clear is we need to pass USA Rights Act to protect both our security and liberty."]["I’ll be on @KSWVradio Que Suave Radio, Great Outdoors New Mexico show this morning to talk about #RGDN! LISTEN LIVE: https://t.co/MznFUnX083"]["I’m calling on Republican to pass the #DreamActNow. https://t.co/REbRJiVvvS"]["The entrepreneurial spirit runs deep in the Land of Enchantment &amp; women-owned businesses are fueling our economy and creating jobs in #NM. https://t.co/wEVTOGpdav"]["Foreign influence &amp; hacking of our elections in 2018 and beyond is still a serious threat. We need to pass the #SecureElectionsAct to protect our elections before it’s too late. https://t.co/D2aslXYCso"]["We’ll take it. Hoping we’ll get more rain in New Mexico soon! https://t.co/yurAssQKsx"]["WATCH LIVE: I'm standing with #DREAMers &amp; demand that Congress pass #DreamActNow. This commonsense, compassionate, and responsible policy is long overdue for a generation of young Americans. https://t.co/qKjK7cJlq8 https://t.co/QbzFoaE8VD"]["I’m headed to Senate Floor to urge Republicans to pass the #DreamActNow! Follow me on Facebook to watch live: https://t.co/zEMPQI9ZnP https://t.co/NUIObPanon"]["Even though court blocked Trump Admin from ending #DACA, #Dreamers are still in limbo. Congress needs to act on permanent solution to #ProtectDreamers. It’s urgent that we pass the #DreamActNow! https://t.co/fWE7nHE0M6"]["President Trump’s decisions have real impacts on the lives of New Mexicans. His move to turn the nation’s back on 200,000 Salvadoran immigrants will only hurt our communities and tear families apart. #SaveTPS https://t.co/44GeR2NsqO"]["McFarland is currently at center of #TrumpRussia investigation for connection with Flynn – not the best person for the WH to nominate. https://t.co/N3IauvH3Zo"]["#ClimateChange is causing the extreme weather that’s wreaking havoc we have to pay for. https://t.co/PoF8WjlkCO"][".@SenateMajLdr let's bring up the #DREAMAct for a vote tonight then. https://t.co/ATILF8JyNu"]["Albuquerque was named one of the 18 destinations to visit in 2018. What’s your favorite thing to do in Albuquerque? https://t.co/hidrWZZRui"]["This is far from over. I’m with @SenMarkey and over 30 Senators who will force a vote to restore &amp; defend #NetNeutrality. RT and stand with us to #SavetheInternet"]["I’ll be on @KTAOS this morning! Tune in to hear my live interview with Paddy Mac. https://t.co/esSt63u0v7"]["Proud to announce $10.7 Million in Grants to Help NM End Homelessness https://t.co/uCPIBitqLY"]["For 100 days, 9million children’s health coverage has been in jeopardy because of Republican inaction on #CHIP. Not one more day. #ExtendChip now! https://t.co/iXWPynrkfj https://t.co/2PIsspP5mo"]["I’m still fighting to save the internet. Today we reached the magic number of over 30 Senators demanding that critical #NetNeutrality rules be reinstated.\n \nWe’re not giving up &amp; neither should you. #SaveNetNeutrality."][".@techradar visited #NM before #CES2018 in Las Vegas to test out some gadgets &amp; visit our iconic and artistic towns. https://t.co/PtifNdwDoS"]["Happy Birthday #NM! On this day in 1912, NM officially became the 47th state of the United States. Anyone who’s visited or calls NM home knows the remarkable spirit of our state is rooted in our history and culture. What’s your favorite thing about the Land of Enchantment? https://t.co/KP2h17idro"]["#FlashBackFriday to talking with my friends @SenCortezMasto &amp; @SenKamalaHarris about the importance of protecting our #PublicLands. I’ll keep fighting to #KeepItPublic in 2018 and beyond, are you with me? https://t.co/RRDYqokEpI"]["Upon learning that the Trump Admin plans to leave our National Parks in the hands of someone who has already damaged public land on behalf of a private billionaire landowner, I am reminded of this scene from ‘Malcolm in the Middle.’ https://t.co/5AYLJyoPHh https://t.co/9oFVvSXStZ"]["The move by Republican controlled @FCC to strip common sense #NetNeutrality rule will wreck the internet &amp; hurt everyday Americans. #SaveNetNeutrality https://t.co/SrVEPENjeq"]["I’m calling for President Trump &amp; Republicans to stop playing politics with the lives of young Americans &amp; pass #DreamActNow. https://t.co/iAtrWn4F0y"]["We need to #SecureElections before it’s too late. Our #SecureElectionsAct has bipartisan support &amp; will protect our elections from cyber threats &amp; foreign influence. https://t.co/6KN6iPbxC5"]["In light of the current serious risk of conflict, including nuclear escalation with North Korea, @RonWyden and I want @ODNIgov to assess whether POTUS rhetoric serves as deterrent or provocation. https://t.co/0LE73Dz4qj"]["I’m calling for the Intelligence Community to assess the risk to national security arising from President Trump’s latest North Korea tweet. https://t.co/GItUFHVmzl"]["New Mexicans know that #GOPTaxScam will hurt hardworking families across the state. https://t.co/82Pa8eFwxr"]["A good reminder that teachers can make a big difference in our lives. What an inspiring story about ensuring all Navajo students have the opportunity to learn about their traditional language. https://t.co/PcM0cgjSRw"]["It’s alarming that our elections are still vulnerable to hacking and foreign influence &amp; even more alarming that the Trump Admin isn’t doing anything to address this pressing threat. https://t.co/jCwk3TA3g1"]["Honoring our nation’s heroes is our responsibility. We should all agree on a budget that provides the best care and benefits for our veterans. https://t.co/VrCNrLVvNF"]["Bannon implicates President Trump personally in Russia contact and calls it ‘treasonous’ and ‘unpatriotic.’ https://t.co/oMxNy7IpPt"]["Welcome to the Senate Doug Jones &amp; Tina Smith! Looking forward to working with you in the years ahead. #DYK that Senator Smith is originally from #NewMexico? https://t.co/vTX3Cl1Cp2"]["Kids’ health care can’t wait.\n \n#CHIP expired 95 days ago &amp; Republican refusal to #ExtendCHIP is putting the health of 9 million children in grave danger. I won’t stop fighting for our children &amp; their future."][".@SenateGOP we must pass the #DreamActNow. Thousands of #Dreamers &amp; #DACA recipients just want to live in peace with their loved ones &amp; contribute to the communities they know &amp; love. They don’t have time to wait."]["The Trump admin is all talk and no walk on fighting #OpioidEpidemic. Americans need urgent funding and treatment to address this crisis that is affecting so many communities. https://t.co/lpOhZIk0JN"]["We must do everything we can to protect the security and integrity of our elections. The bipartisan #SecureElectionsAct would improve and modernize our voting systems. https://t.co/OdFzIG2Njk"]["Great example of the potential of community solar. Shared solar projects allow more people to benefit from renewable energy and helps businesses and families save money. https://t.co/Qjb6pcH2xr"]["This legislation will further complete the vision of the diverse coalition who fought so hard to protect RGDN &amp; will preserve traditional practices &amp; boost NM's outdoor recreation economy."]["Proud that my bill to protect wilderness within the Río Grande del Norte National Monument passed the Senate with unanimous support. https://t.co/rVjsXyjPEw"]["Wishing you and your family a safe and Happy New Year! https://t.co/eXsI8L0u25"]["Someone please tell POTUS that THIS is the future, not requiring utility customers to subsidize expensive, dirty coal. https://t.co/AP41yr8bt1"]["I will continue to work hard every day to make a difference for you, and focus on what matters to all of us. Here are 100 highlights from 2017. https://t.co/z9qJ2vkfYd https://t.co/eMwaZFII97"]["From my family to yours, wishing you a happy holiday season! https://t.co/pZYdW7Sf0G"]["Thank you to all of our men and women serving in uniform this holiday season. I am grateful for the sacrifices you and your family make to keep our country safe. https://t.co/q3xoWJuZoM"]["@SenatorLankford @amyklobuchar @SenKamalaHarris @SenatorCollins @LindseyGrahamSC Until we take these necessary steps, our nation's democratic institutions will remain vulnerable. #SecureElectionsAct"]["@SenatorLankford @amyklobuchar @SenKamalaHarris @SenatorCollins @LindseyGrahamSC The #SecureElectionsAct will improve and modernize protections for our voting systems, registration data, and ballots to prevent theft, manipulation, and malicious computer hacking."]["@SenatorLankford @amyklobuchar @SenKamalaHarris @SenatorCollins @LindseyGrahamSC Our democracy hinges on protecting Americans' ability to fairly choose our own leaders. We must do everything we can to protect the security and integrity of our elections. #SecureElectionsAct"]["We urgently need to adopt stronger protections for our election systems. I’m proud to co-sponsor the #SecureElectionsAct with @SenatorLankford @amyklobuchar @SenKamalaHarris @SenatorCollins @LindseyGrahamSC https://t.co/fLx1bkjFvw"]["President Trump has made it clear whose interests he is working for—his own. #GOPTaxScam https://t.co/vljcNaoSZu"]["Here’s a fact check of President Trump’s claims about #BearsEars https://t.co/OW6n1EUq7M"]["Read the dissenting opinions from @FCC Commissioners @MClyburnFCC &amp; @JRosenworce, about why we need #NetNeutrality https://t.co/4YpCd7G9iu"]["I am proud to have worked with the Consortium to introduce the #TribalConnect Act to steer much-needed federal investments to Indian Country &amp; expand access to high-speed internet."]["I congratulate the Middle Rio Grande Pueblo Tribal Consortium for creating this successful and innovative approach to close the digital divide in Indian Country.   https://t.co/kLMOmNLDYT"]["Republicans have made clear where their priorities stand. They’ve abandoned working families while recklessly blowing up the deficit in order to reward their wealthy friends &amp; corporations."]["The top 1% of earners in our country will reap 83% of the benefits of the #GOPTaxPlan. The top 5% will reap 99.2% of the benefits. See page 5, table 3 here: https://t.co/uACnfUQGI0"]["Pres. Trump’s #GOPTaxScam fails to meet our country’s needs and does not deliver tax relief to those who need it."]["I voted NO on the reckless #GOPTaxScam that abandons working families."]["I stand with #Dreamers in demanding a #DreamActNow. RT if you agree we must pass #DreamAct https://t.co/tbzATnNChb"]["Republicans attempt to offset their massive tax giveaways for the wealthy by opening drilling in #ArcticRefuge is shortsighted tactic that will ultimately fail. #GOPTaxScam https://t.co/EKiZGzfxEO"]["Republicans’ so-called “tax reform” is a #GOPTaxScam that will leave everyday Americans paying more so the rich can pay less."]["In case anyone is wondering who benefits under the #GOPTaxScam: Trump organization, energy drillers, major corporations among tax plan’s winners. https://t.co/9Gb5Cz9bki"]["This is what many sensible Republicans believe, the question is... when will they stop enabling this reckless and destructive President? https://t.co/FpKSqjPZTY"]["This is yet another deeply troubling example of this administration's hostility toward science and basic facts. https://t.co/i4Wd3RSPCC"]["New Mexicans love our national monuments! Take a look at this brand new mural that local artists and students painted in downtown Las Cruces featuring Organ Mountains-Desert Peaks National Monument. #MonumentsForAll https://t.co/DcMqbD37F8"]["This is urgent! Dreamers are losing protection every day. RT to tell @SenateGOP we must pass the #DreamActNow. https://t.co/qRwS2wYqMs"]["It’s shameful that Republicans refusal to pass #DreamActNow has stripped 12,276 #DREAMers of protected #DACA status."]["It's Bill of Rights Day! The freedoms &amp; protections guaranteed by the Bill of Rights form the bedrock of our most important rights &amp; values. We should all honor &amp; defend these hard-won fundamental American principles against threats at home and abroad each and every day. https://t.co/k5WgmFStmj"]["@demingheadlight Instead of #GOPTaxScam we should invest in communities &amp; focus on programs proven to reduce poverty &amp; incentivize hard work, like Earned Income Tax Credit &amp; Child Tax Credit, which effectively raise incomes for working families."]["#GOPTaxScam won’t help rural communities in #NM. We should be investing in high-speed internet, helping small biz, ensuring families can afford college &amp; health coverage, not tax cuts for rich. Read my op-ed in @demingheadlight https://t.co/xh4O0psNzn"]["It’s finally December 15th - #LastJedi is out &amp; TODAY is the last day to #GetCovered!\n\nBefore or after you see Star Wars today - go to https://t.co/DaUwy5Vmtb &amp; sign up for affordable health coverage. May the Force be with you! https://t.co/iQpWWnlSx2"]["If #AmericanDreamer &amp; ABQ educator Oriandi loses #DACA she won’t be able to continue serving students &amp; families. We need our #Dreamers in #NM – her students need her. https://t.co/1fDIZm9npd https://t.co/SQmZSDPmK2"]["In case you were wondering...this is what an \"Unqualified\" Judicial nominee sounds like. https://t.co/wAUKero7AU"]["It’s been 76 days since #CHIP expired. Republicans need to stop playing games with children’s health and well-being &amp; #ExtendCHIP. https://t.co/fxW7SH9hqV"]["No matter the odds, I will continue working to keep firearms out of the hands of those who would turn them on our families, friends and neighbors. #HonorWithAction https://t.co/aRL1cjhPK4"]["I’m demanding that the people of Alabama be heard on #GOPTaxScam. https://t.co/AAHofi8vOj"]["Republicans are trying to sneak provision to open Arctic drilling into #GOPTaxScam. This is a refuge – No drilling here. No now, not ever. #ProtectTheArctic https://t.co/44ESKEvejL"]["The @FCC voted to kill #NetNeutrality today, but this fight is far from over. I’m joining @SenMarkey to restore vital #NetNeutrality rules. RT if you’re with me &amp; will do everything you can to #SaveNetNeutrality."]["#NetNeutrality is essential to fostering innovation &amp; education, and promoting civic engagement. I will continue fighting to #SaveNetNeutrality."]["The @FCC’s move to end #NetNeutrality is a slap in the face to Americans &amp; another example of Trump Admin gutting commonsense protections &amp; ignoring the will of the people. https://t.co/nAmOOBD4I8"]["The @FCC is voting to kill #NetNeutrality right now. We can’t let this go unnoticed – every American who accesses the internet will be impacted by this decision. Watch live: https://t.co/sFuOHUSoMt https://t.co/B1kezYmPBU"]["Gutting #NetNeutrality will wreck the internet. We can’t let this happen. https://t.co/uNIqjYSLyH"]["How will the @FCC’s plan to gut #NetNeutrality today impact New Mexico? “It will absolutely cripple our small businesses in New Mexico and across the country.” https://t.co/IRCOJxGw6i"]["#GOPTaxScam hurts:\n \nWorking Families\nFuture Generations\nAnyone Paying State &amp; Local Taxes\nPublic Schools\nSick People\nDisaster-Stricken Areas\nCharities\nFirefighters/Police Officers\nLocal Communities\nSmall Biz\n \nHere’s how: https://t.co/8AEnND6LmY"]["NO #GOPTaxScam. #ProtectTheArctic https://t.co/P8W8IB7UVk"]["I’m standing with #AmericanDreamer like Karla, from New Mexico &amp; won’t stop fighting to pass the #DreamActNow. https://t.co/Y89Np0YHqg"]["I’m demanding that we pass the #DreamActNow so that #AmericanDreamer like Yadira, from Las Cruces #NM, a small-business owner, wife &amp; mother of three can rest easy &amp; continue contributing to our economy. https://t.co/gA72AMiMFX"]["Excited about progress being made on Sagamore wind project that will be largest wind farm in #NM - resulting in hundreds of #CleanEnergy jobs &amp; more affordable electric bills for consumers. https://t.co/dc3anCSaHv"]["In New Mexico, we take our biscochitos very seriously. This year 46 entries competed for biscochito glory in Taos. What’s your secret for making the perfect biscochito? @TaosNews https://t.co/nL6NDSlWPo"]["Given the vast implications for our country, GOP should not hold a final vote on their #GOPTaxScam until Doug Jones is sworn in to the Senate."]["If @SenateGOP refuses to pass the #DreamActNow to #ProtectDreamers, businesses &amp; our economy in #NM will suffer. https://t.co/8FpuWb20as"]["Taos High School students Daniel Córdova, Indigo Acosta and Cameron Gonzáles made New Mexico proud by showcasing their invention on @FallonTonight! https://t.co/42uQbpwNcv"]["Tune into @ksfrnews' Wake-Up Call all this morning! I'll be on air with Tom Trowbridge, talking about #NetNeutrality &amp; why accessing a free &amp; open internet is so important to New Mexicans."]["Trump’s @FCC is voting to kill #NetNeutrality this week! I’ll continue standing up to #SaveNetNeutrality. RT if you’re with me. https://t.co/WuN5gJfoOQ"]["Looking forward to working with Doug Jones, the newly elected Senator of Alabama."]["Wishing all those celebrating in New Mexico and across the country, a very #HappyHanukkah! https://t.co/qcU8syUWcg"]["The protection of our nation's civil rights laws is at risk because many of President Trump's judicial nominees have long, anti-civil rights records. Women, and all Americans deserve better. #BadForWomen #courtsmatter"]["We’re calling for @FCC Chairman @AjitPaiFCC to abandon his reckless plan to kill #NetNeutrality. The future of the internet hangs in the balance - join us to #SaveNetNeutrality https://t.co/Npx8qQByEk"]["Republicans are trying to cook the books on their #GOPTaxScam. Massive giveaways to wealthy will pay for themselves &amp; middle-class families will be forced to foot the bill. https://t.co/I0WZz3x8bo"]["I’m working to close the #DigitalDivide so that students and children in Tribal communities can access the internet &amp; all the opportunities it provides. #TribalConnect https://t.co/Fyayfvg9Y5"]["Not only is Trump’s @FCC ignoring experts’ warnings – they’re ignoring millions of Americans who are calling for #NetNeutrality to remain protected https://t.co/QSH3VFqG53"]["Public lands belong in public hands. It’s disgraceful that Trump Admin is attacking #BearsEars, #GrandStaircase &amp; #ArcticRefuge. https://t.co/1pngu07anp"]["DYK that the BLM is responsible for managing 13 million acres of #PublicLand in #NM? We need a new BLM director who respects our state’s public lands legacy. https://t.co/42cv6DsY0K"]["The #DomesticViolenceLoophole is a widespread problem that we need to close in our armed services to keep Americans safe.@jacqklimas https://t.co/G6TRERy4FC"]["No member of Congress should rest easy until #Dreamers are able to live without fear in the only nation they call home. I will continue to stand #WithDreamers &amp; call on my colleagues in Congress to pass the #DreamActNow. https://t.co/wyLECbSGSz"]["Unacceptable that sacred places in #BearsEars #GrandStaircase could be sold to the highest bidder to pave the way for oil coal, &amp; uranium mining &amp; lost forever. They must remain protected. #MonumentsForAll https://t.co/6erEozfGkU"]["Read my op-ed in @TheDailyTimes on why we need #TribalConnect to increase internet access &amp; close #DigitalDivide for students &amp; children in Tribal Communities https://t.co/EG4bXiz4z3"]["Proud that #NM firefighters are lending a helping hand to those in need in California. Stay safe &amp; thank you! https://t.co/ZixXcFHlKc"]["The #GOPTaxScam would hit New Mexico and hurt charitable giving via @KUNMnews https://t.co/MQstae23kW"]["Los Dreamers merecen una solución permanente. Es hora que el Congreso apruebe el DreamAct. #DreamActNow https://t.co/iO3CNwPaGD"]["It’s unacceptable that 80% of rural Tribal communities in #NM don’t have a reliable connection to the internet. Our kids need access to high-speed internet to do their homework, complete advanced courses &amp; learn important job skills. #TribalConnect https://t.co/awrmqVINBz"]["Expanding broadband #TribalConnect internet access is one of the surest ways to improve education outcomes, boost economic development, and strengthen public safety and civic engagement. https://t.co/wAuWytu65W"]["We urgently need to close this digital divide between Tribal communities &amp; the rest of the nation. My bipartisan #TribalConnect bill with @SenDeanHeller would invest $100 million for broadband connectivity in Indian Country. https://t.co/KoEFNQeBUD https://t.co/PRmHUD1Jn7"]["In August, I hosted a #TribalConnect session in Santa Fe with members of two Pueblo library consortiums representing the Pueblos of Cochiti, Jemez, Zia, Santa Ana, San Felipe, &amp; Santo Domingo. https://t.co/PHsZHVZWai https://t.co/jRKCSB6tPg"]["My full statement on #AztecSchoolShooting https://t.co/frRdEVwkQn https://t.co/0BPsJFiyw0"]["I'm following the reports of an active shooter at Aztec High School and sending my thoughts to the community and all affected in New Mexico today."]["#Dreamers are Americans. The fight is not over - I’ll continue standing #WithDreamers &amp; our immigrant community in #NM to demand that we pass #DreamActNow. https://t.co/Gt0HBWdZcX"]["Instead of #GOPTaxScam we should be passing #DREAMActNow that will add $22.7 billion to the economy per year &amp; keep #DREAMers working in the communities that they have been members of for their entire lives."]["Interior’s report is based on hearsay &amp; erroneous data. Trump Admin has turned deaf ear to overwhelming consensus to protect #RGDN &amp; #OMDP4NM from #NM Tribes &amp; community. https://t.co/rRcEOCoCp4"]["Our national monuments are vitally important to tribes, the economy, and our way of life in #NM #MonumentsForAll @AlbaSoular @CrucesSunNews https://t.co/TWExBjupIu"]["Ten thousand Dreamers have already lost their #DACA protections. It’s time to pass the #DreamActNow"]["It’s been 3 months since the President’s cruel decision to end #DACA. I’m still fighting for permanent protections for #Dreamers &amp; passage of the #DreamActNow. https://t.co/26F3sBE1LP"]["Thanks for having me on @WstrnPriorities’ Go West, Young Podcast to talk about why I’m fighting to #SaveBearsEars #SaveGrandStaircase #RGDN #OMDP4NM &amp; keep #MonumentsForAll. Listen here: https://t.co/m1MjSGItDp"]["Shocking. #GOPTaxScam https://t.co/aV57ZVA5mV"]["Senator Franken needs to step down and we all need to do more to make clear that sexual harassment and assault are unacceptable."]["This decision is misguided and unnecessarily provocative. Once again, this President appears oblivious to the consequences of his actions. https://t.co/sSpD744NU3"]["I will testify today before the Office of the U.S. Trade Representative to oppose tariffs that could deeply damage the American solar industry. https://t.co/zXlRyZjddw"]["This is what happens when you hand write a major tax overhaul behind closed doors in the middle of the night. #GOPTaxScam https://t.co/zEJD6nRskH"]["RT &amp; spread the word! Open enrollment ends in just 10 days. #GetCovered by visiting https://t.co/I4kWXVRX8f to sign-up for health coverage today. https://t.co/Qw74RG347g"]["According to Republican logic we can afford a couple TRILLION dollars worth of handouts to the rich, but we can’t afford EXISTING children’s healthcare. https://t.co/Cj1U0YAQkA"]["If it ain’t broke, don’t fix it. Hands off our #MonumentsForAll https://t.co/sFV7cwZDzT"]["Is gravity real? The science on #ClimateChange is sound &amp; it’s deeply concerning that Trump nominee for key position at @EPA thinks otherwise. #ActOnClimate https://t.co/JgpBZtFVSo"]["We need leader of @EIAgov to do better estimating #Solar &amp; #CleanEnergy capacity. https://t.co/x4wTPFUbOt"]["Communities &amp; Tribes in #NM worked for decades to protect &amp; establish #RGDN &amp; #OMDP4NM. We won’t stop fighting to #KeepItPublic. RT to tell the Trump Admin to keep their hands off our public lands! #MonumentsForAll https://t.co/lwmIVIdcoA"]["By refusing to bring the #DreamAct for a vote, the GOP is putting our economy at risk. Without the #DreamAct, our economy would lose $460.3 billion from the national GDP over the next decade. #DreamActNow"]["Pursuing a new flying mission for the Tacos has long been a priority of mine &amp; I have used my seat on #SASC to help do so. Our letter urges @USAirForce to transfer legacy PAVE Hawk Combat Search &amp; Rescue Helicopters to #NM @NationalGuard https://t.co/q7vKuHqGTR https://t.co/l7jBAly9rq"]["In Utah, outdoor recreation accounts for more than twice the number of jobs as mining &amp; energy combined. #BearsEars @OIA https://t.co/p7oQCKxADs"]["It’s unacceptable that Republicans are subjecting nearly 800,000 young people to a life of fear and uncertainty. I am ready to vote YES on the #DreamAct today."]["@CynthiaMcFadden @NBCNightlyNews Did you catch @NBCNightlyNews last night? Here’s why #DirectedEnergy is so important for our national security &amp; how #NM is helping develop this technology @CynthiaMcFadden @warkin https://t.co/aSgnWxqDTB"]["Republicans are waging a war on #CleanEnergy jobs and hurting New Mexico’s economic growth. https://t.co/PxAcMJqn2o"]["The President just stole 2 million acres of your land to pave the way for mining &amp; drilling in sacred places. This move is illegal &amp; I won’t stop fighting to protect the public lands we all own. #MonumentsForAll https://t.co/58Ba2WDtM3"]["Proud to introduce my bipartisan bill with @SenDeanHeller to preserve the places that draw visitors from around the world &amp; sustain outdoor traditions like hunting and fishing for generations to come. https://t.co/dq0O93I4ul"]["Every #NM student should learn how to code! During #CSEdWeek if you participate in #HourOfCode - there’s no limit to what you can achieve. https://t.co/pFweIW6kmR"]["My staff is holding Mobile Office Hours in Sunland Park tomorrow morning from 10:30 a.m. to Noon. All are welcome to attend! https://t.co/ecP042F02n"]["Actions taken today to shrink #BearsEars &amp; Grand Staircase-Escalante National Monuments are single largest sell out of #PublicLands in our nation’s history. Every single American should be outraged. #MonumentsForAll"]["I’m confident that this shameful action will rightly face the same types of legal challenges as others pushed through by a White House hell-bent on appeasing a few extreme interests at the expense of the interests and values of the American people."]["This move by POTUS sets dangerous precedent &amp; threatens all movements - #RGDN &amp; #OMDP4NM could be next. #MonumentsForAll https://t.co/OmW1CnHJvL"]["The President’s attempt to erase #BearsEars &amp; Grand Staircase-Escalante National Monuments tears at the heart of America’s conservation legacy &amp; is a direct assault on sacred lands &amp; tribal sovereignty. https://t.co/Dza2kEfIeo"]["I won’t stand by while POTUS Attempts To Erase Bears Ears And Grand Staircase-Escalante National Monuments https://t.co/reTtJOwzoG"]["RT if you love our national monuments &amp; oppose POTUS attacks on #BearsEars &amp; Grand Staircase-Escalante National Monuments. #MonumentsForAll #SaveBearsEars #SaveGrandStaircase https://t.co/HJ70wm3HnA"]["Zuni Pueblo Elder Octavius Seowtewa on why we must protect the invaluable cultural heritage in #BearsEars National Monument. This is what is at stake. https://t.co/maEJV2vvr1"]["America’s public lands are under attack! POTUS is announcing eliminating protections for #StandWithBearsEars &amp; #SaveGrandStaircase, today. RT &amp; spread the word to protect #PublicLands! https://t.co/234EPaZRBO"]["“There is no good reason for shrinking Utah’s national monuments.” @sltrib https://t.co/8suvtgAFeF"]["#PublicLands belong in public hands. RT if you think POTUS should keep his hands off of #BearsEars. https://t.co/Bsxq0Ot9MF"]["We have a moral responsibility as a nation to our children and all future generations of Americans to protect and conserve our natural and cultural heritage. #ProtectBearsEars"]["Stripping protections for #BearsEars sets a dangerous precedent - could lead to a larger campaign to attack many of our most treasured #PublicLands. https://t.co/ixE2jvLPop"]["I voted NO on the #GOPTaxScam &amp; even though it passed in the senate tonight I won’t stop fighting this disastrous bill. RT if you’re with me."]["Senate Democrats are trying to stop the vote on #GOPTrumpTax. RT if you agree we shouldn’t vote until every senator has had the chance to read it."]["It’s irresponsible to consider #GOPTaxScam that’s STILL being rewritten &amp; full of secret special interest provisions for wealthy/well connected. I am voting to pause debate &amp; calling on @SenateGOP to stop this disastrous bill."]["Republicans scrambling to write their #GOPTaxScam. Don’t worry, nothing to see here folks. https://t.co/Gt4HZlAJMW"]["DeVos earmark. https://t.co/nVtpfRJnNY"]["We haven’t had time to read it – and the @GOPSenate didn’t have time to write it. Every single American will be impacted by the #GOPTaxScam - every senator should vote NO &amp; demand that this insanity stop. https://t.co/xvLbxFUFVx"]["Americans deserve so much more than the #GOPTaxScam. https://t.co/olNmtokjAg"]["Republicans are trying to sneak Sec. DeVos earmark into #GOPTaxScam written to give windfall tax break to @Hillsdale College. Another way they’re focused on helping wealthy &amp; well connected."]["My shortlist of what we should be working on tonight instead of Rs pushing #GOPTaxScam that will hurt millions of Americans:\n \n#ExtendingCHIP so children have health care\nPass #SecureElections protect voting equipment from foreign interference/hacking\n \nWhat's on your shortlist?"]["Flynn pled guilty to lying to @FBI about contacts with Russian officials. Begs Q of why he'd lie &amp; who he's protecting. News also appears to provide answer - Flynn reportedly prepared to implicate WH in instructing him to initiate previously lied about communications w Russians"]["Trickle-down economics doesn’t work and never has. Just ask Kansas about their version of the #GOPTaxScam. https://t.co/nC4bocGAQq"]["The #GOPTaxScam puts $94 MILLION from public education at risk in New Mexico @JECDems https://t.co/aopZPVj1Qm"]["The 5.2MILLION seniors can’t afford the #GOPTaxScam that will result if Senate Republicans pass their tax bill."]["#GOPTaxScam gives tax breaks to wealthy under the ruse that everyday people - someday - will be better off because big corporations &amp; investors will do something better with the money than working families."]["Who will be hit by the #GOPTaxScam?\n \n→ Students\n→ Teachers\n→Veterans\n→Seniors\n→Disabled\n→Homeowners\n→First Responders\n→People with chronic illnesses"]["I’m voting NO on the #GOPTaxScam &amp; am urging every senator to do the same! https://t.co/ucS0cf5fEj"]["Here’s what @paulkrugman who won the Nobel Prize in economics thinks of the #GOPTaxScam https://t.co/YPDUUaldle"]["A vote for the #GOPTaxScam is a vote to strap TRILLIONs of $$$ on the back of the next generation of Americans."]["#GOPTaxScam endgame: when tax revenues dry up Rs will force HUGE CUTS to #Medicare, #SocialSecurity, #Medicaid, #PublicSchools, our national labs &amp; our military."]["If the #GOPTaxScam passes the top 1% will get more than other 99% combined within ten years.  RT if you agree that’s not right. https://t.co/t7fe3i8so4"]["Republicans’ so-called “tax reform” is a #GOPTaxScam that will leave everyday Americans paying more so the rich can pay less. https://t.co/nXHMm1aJSe"]["Thanks to #GOPTaxScam, 200,000 households in New Mexico who earn less than $74,000 a year will see their taxes go up."]["What's going on with the #GOPTaxScam? Still haven't seen new version after Republicans spent the night behind closed doors scrambling to rewrite their bill."]["The #GOPTaxScam will setback our country’s #RenewableEnergy industry https://t.co/kllfyBSWCk"]["The #GOPTaxScam goes after #CleanEnergy &amp; will hurt our economy. https://t.co/LM3wiXHXnI"]["@SenatorCollins @WIRED Until we establish stronger protections to #SecureElections &amp; take the necessary steps to prevent future foreign influence campaigns, our nation’s democratic institutions will remain vulnerable."]["Read my op-ed with @SenatorCollins in @WIRED about our bill to #SecureElections &amp; protect future elections from foreign interference. https://t.co/KbD1RJImkK"]["Graduate students &amp; institutions of higher education like @UNM are hit under the @GOPTaxScam &amp; are speaking out against #GradStudentTax. https://t.co/ou0ZWMydqS"]["This is not the way to govern. Not the way to craft major legislation. But seems to be a broken record with GOP. #GOPTaxScam https://t.co/TpEduFNqoL"]["The #GOPTaxScam: \n \nAdds $2.2 TRILLION to deficit\nAdds 13M more uninsured\nTax hike on 5.2M seniors\nWill ruin Public Education\nGuts #Medicare\nSend jobs overseas\nHurts wind &amp; solar energy\nSends home values plummeting\nHurts graduate students &amp; universities\n\nWhat did I miss?"]["#GOPTaxScam would wreck #Medicare – cuts up to $410 BILLION from vital program so many #NMs rely on. https://t.co/aFZb6nFvy4"]["Deep &amp; unforgivable cuts in #GOPTaxScam will NOT pay for themselves. Still adds $1 TRILLION to the deficit. @jctgov https://t.co/RTQskpm8R4 https://t.co/zbS0Q7p7Wr"]["The #GOPTaxScam hits teachers, public schools &amp; students hard in #NM &amp; across the nation. @NEANewMexico https://t.co/625YXwDnVn"]["Another reason the #GOPTaxScam is bad for America. https://t.co/rCJTXPeACE"]["Another casualty of the #GOPTaxScam - #SolarEnergy, #WindEnergy, #RenewableEnergy &amp; our ability to fight climate change. https://t.co/jglJkAj4AF"]["#NM seniors will pay +$1,000 MORE for health insurance as a direct result of #GOPTaxScam. https://t.co/rasFIbEezh https://t.co/xrH2ULIjXf"]["It’s unacceptable that over 1 MILLION SENIORS will pay more taxes under the #GOPTaxScam https://t.co/fE4KoVXYhW"]["We should not pay for massive tax giveaways by drilling for oil in sacred land &amp; critical wildlife habitat. #ProtectTheArctic https://t.co/JKy94KHhC3"]["Watch Live: I’m standing up to demand that we #ProtectTheArctic https://t.co/FOJpnH6IRt https://t.co/jIFNsY1ve1"]["The #GOPTaxScam is the worst version of #TrumpCare yet &amp; will have effect 100 MILLION AMERICANS. @Vox @sarahkliff https://t.co/XS1ZijI7nf https://t.co/vyA598tHlt"]["Their tax bill is really a health care bill. If you care about keeping your #HealthCare coverage, you should care about the #GOPTaxScam https://t.co/j76lf4AauJ"]["I voted NO, on advancing the #GOPTaxScam. RT if you would vote NO too!"]["These massive cuts to programs #NMs rely on, including #Medicare - are triggered by the #GOPTaxScam. https://t.co/uKNOUF9u0g"]["This year I welcomed Air Force’s substantial re-investment in the Operationally Responsive Space Program. Proud Kirtland Air Force Base is leading the way in small satellites. https://t.co/uhsnsBybqx"]["#GOPTaxScam comes with a $1.5 trillion price tag that is a result of giveaways to the wealthy. We should be investing in our communities &amp; solving our most pressing problems instead of lining the pockets of the rich. https://t.co/5tQX7SQTeW"]["President Trump spreading anti-Muslim propaganda not only emboldens hate but sends the wrong message of who we are as a country."]["Republicans cannot afford the tax cuts they want &amp; instead are blowing a $1.5 trillion hole in the national deficit that will force future cuts down the road. https://t.co/xYeqTAzrY3"]["Native American women who experience violence are #NotInvisible. I’ll keep pushing for passage of Savanna’s Act with @SenatorHeitkamp to help address the crisis of missing &amp; murdered Native American women https://t.co/SOwsljcagb"]["84% of Native American women experience violence in their life. We can't let these stories go untold &amp; for it to continue to happen. Help us raise awareness &amp; show your support so we can start to address these challenges. #NotInvisible #MMIW https://t.co/feDmPriwVL"]["Standing by Native American women who experience staggering levels of violence and murder - they are #NotInvisible. Together we can raise awareness, show support &amp; work to combat these crimes. #MMIW https://t.co/Tqxj7GoObZ"]["Tune in today at 10 am ET to watch the Joint Economic Committee’s hearing on the economic outlook with @federalreserve Chair Janet Yellen. https://t.co/yJTrwkA9Fv"]["I will fight any attempt to shrink the #PublicLands that we all own. #ProtectBearsEars https://t.co/JQkWRkkzv3"]["The hostile takeover of @CFPB by Trump Admin is a move from tin-pot dictator playbook. https://t.co/0zWVcr5VbM"]["Republicans are pulling a reverse Robin Hood – the #GOPTaxScam steals from the poor to give to the rich. https://t.co/cskssLPixF"]["You can’t make this up. What an embarrassment. https://t.co/i7jC8kppzS"]["Congress must pass the #DREAMAct or risk losing 20,000 teachers who are #DREAMers in our schools. #ProtectDREAMers https://t.co/0aytYQIow8"]["Since POTUS’ decision to end DACA, an estimated 10K recipients have lost protection. Congress must pass #DREAMAct before end of the year to provide a permanent solution to #ProtectDREAMers."]["We can’t lose our #DREAMer teachers, small business owners &amp; students who contribute out our economy &amp; communities. #DREAMActNow #ProtectDREAMers https://t.co/boJIDJZM1T"]["New Mexicans are rallying against the #GOPTaxScam - I stand with you. https://t.co/Cu5C4q5wn8"]["Navajo Code Talkers used the Navajo language to help win WWII. Instead of honoring their immense contributions to our country, the president used a racial slur in a ceremony meant to celebrate them. This type of callous behavior is unacceptable."]["The Senate #GOPTaxScam: middle-class Americans will lose money &amp; millionaires will get a windfall. https://t.co/Xucw5SphKP"]["Glad to cosponsor @SenGillibrand &amp; @RepSpeier’s #MeTooCongress Act because sexual harassment/assault has no place in the halls of Congress—or anywhere. https://t.co/vP10ECFObf"]["It’s a disgrace that Republicans are spending the week pushing their #GOPTaxScam when we should be working to reauthorize #CHIP now. https://t.co/bDqfZRtG0S"]["Protecting #OMDP4NM is personal to so many New Mexicans. https://t.co/uaFUgmdhLr"]["We’re calling on @USDA to end the hiring freeze because severe understaffing is hurting #NM’s farmers &amp; ranchers https://t.co/w5rTPTTXrc https://t.co/JVrCBOuQMn"]["Our job is to look out for the people we serve – not Wall Street banks &amp; corporations trying to scam consumers. Whose side are you on: hardworking Americans, or big banks? #DefendCFPB https://t.co/CAdG2qIgY0"]["Renewable energy is a smart investment – it’s cheaper and cleaner than coal. https://t.co/nY7X6kE1ni"]["This is urgent. We’re running out of time to #SecureElections from hacking &amp; foreign influence. @martinmatishak https://t.co/6YR07ft6Mn"]["Senate Republicans are rushing to pass their #GOPTaxScam this week. I cannot support a bill that is financed on the backs of middle class families &amp; hurts #NMs @michaelcoleman https://t.co/bR0w7GjIOe"]["What exactly is the FCC hiding? https://t.co/2TKTxCtlf4"]["Please read this op-ed by Elizabeth Hyman of @CompTIA--The Computing Techonology Industry Association--on @SenCoryGardner and my bipartisan CHANCE in Tech Act. https://t.co/ycK2s7QbXW"]["Please read this op-ed by Elizabeth Hyman of @CompTIA--The Computing Techonology Industry Association--on @SenCoryGarner and my bipartisan CHANCE in Tech Act. https://t.co/ycK2s7QbXW"]["Dismantling net neutrality is the complete opposite of what millions of Americans said they wanted. We can’t back down. I will do everything I can to protect #NetNeutrality and a free and open internet.  https://t.co/dV8kr1Ox8w"]["Yo continuaré luchando por los Dreamers y la promesa que #DACA representa para miles de jóvenes en Nuevo Mexico"]["Esta noticia es un gran alivio para los beneficiarios de DACA que han estado viviendo con ansiedad sobre su futuro https://t.co/y04w8jpiju"]["@thenewmexican Thank you to the tireless efforts of local community, @WildernessLand &amp; @Wyss Foundation for vital role in unlocking #Sabinoso"]["Read my op-ed published in @TheNewMexican on why opening #Sabinoso is a major gain for #NM https://t.co/rdi5NFU2d9"]["Congratulations to the @UNMLOBOS women's cross country team for winning their second national championship in the last three years! https://t.co/ka1S0V9GLa"]["I’ll keep standing up for #NM #DREAMers. RT to spread the news that renewal applications that were delayed in the mail can be resubmitted. https://t.co/hKs2VuOmkM"]["I’m proud to cosponsor this bipartisan legislation that will help keep our country safe. https://t.co/hUvnXtRhww"]["Listen to my interview with @ksfrnews to hear why every New Mexican should be concerned about the GOP Tax bill. https://t.co/GH17FzbqqE"]["Proud to have authored key parts of #NDAA that make critical investments &amp; strengthen #NM military bases, test ranges &amp; laboratories https://t.co/2lZHDIcPTq https://t.co/Bi2BNDSDGD"]["It's National Apprenticeship Week #NAW17! Read my op-ed with @SenCoryGardner on why we need to pass our bipartisan CHANCE in Tech Act: https://t.co/eDBhhwvrn6"]["It’s #TakeAHike Day! #NM has so many incredible #PublicLands to hike with your friends &amp; family. Where’s your favorite place to hike in the Land of Enchantment? https://t.co/2QD43WIZgP"]["Earlier this year I led a group of senators in calling on FEC to consider new rules that would prevent foreign nationals from using online advertising platforms, like Facebook &amp; Twitter, to influence U.S. elections. https://t.co/1fqZlxWFwM"]["I’ll keep fight back against discriminatory policies against the LGBTQ community &amp; remain fully committed to pushing forward in our march towards full equality for every American. #TransWeek https://t.co/T9G0fwLZi9"]["Are Senate Republicans so busy trying to deliver tax cuts to their donor base that they forgot kids?  In a word - YES. https://t.co/qb12DppgHe"]["Taking money from New Mexico families to give tax breaks to corporations and the wealthiest Americans is not the way to grow our economy. I will do everything I can to stop the #GOPTaxScam https://t.co/7IpSTMrrJV"]["Proud to cosponsor this important legislation to keep us safe &amp; grateful for leadership of @ChrisMurphy &amp; @JohnCornyn. https://t.co/PHrMNqd3uH"]["We can’t let Republicans get away with robbing the middle class. Let’s call it what it really is - a #GOPTaxScam https://t.co/S6u0tfG9Gr"]["If Republicans insist on deficit spending, imagine if instead we invested in our people &amp;communities. Read my #GOPTaxPlan op-ed in @USATODAY : https://t.co/Y4xvGVovlL"]["I am deeply troubled by the allegations against Senator Franken and I believe there should be an ethics Investigation into the matter. Sexual harassment is not a joke and must always be taken seriously."]["This is too important &amp; I’ll continue to working w @SenGillibrand in #SASC to prevent these criminal acts from happening &amp; hold perpetrators accountable. #PassMJIA"]["No one serving in our armed services should have to fear sexual abuse by fellow service members. #PassMJIA https://t.co/6d7DMpcjb5"]["I’m standing with survivors &amp; advocates to re-introduce the Military Justice Improvement Act with @SenGillibrand. Watch Live: https://t.co/OKX0vcfWeG #PassMJIA https://t.co/GGD7w8YnAy"]["My office can assist anyone who has Qs on resubmitting #DACA renewals. I’ll continue fighting for #DREAMers &amp; promise DACA represents for thousands of young people across #NM."]["@DHSgov I’m pleased that #Dreamers whose applications were rejected due to Postal Service delays will be able to resubmit. https://t.co/FJVmOmasof"]["Thousands of #DREAMers renewal applications were delayed in the mail. Yesterday we sent a letter to @DHSgov to accept them. https://t.co/HIXuyF58wr"]["#Sabinoso Wilderness is finally open to all. Tune into @KSWVRadio this morning to hear how we got it over the finish line &amp; what NMs can expect when visiting. https://t.co/9uRE8LBcQ3"]["13 former top national security officials agree: Congress must act now to protect #DREAMers and pass the #DreamAct by December 8th. #DreamActNow https://t.co/82VU8iNGzN https://t.co/iwpPMlScEd"]["#DREAMers are answering the call of duty and provide essential language &amp; medical skills to our military. Congress must pass the #DreamActNow! https://t.co/ld7RbQLQdQ"]["Sent a letter with @JeffFlake &amp; @SenatorShaheen about #DomesticViolenceLoohole pressing @DeptofDefense for unpublished domestic violence reporting data. https://t.co/WyDbFxzeWy"]["It’s not right that thousands of #DREAMers could lose protection due to postal delay out of their control. We’re calling on @DHSgov to accept applications &amp; #ProtectDreamers. https://t.co/A8HJhvQifz https://t.co/j0hpeqaepY"][".@SenateGOP deal-making 101:\nGive tax giveaways &amp; kickbacks to the wealthy ✓\nSwindle families to pass #GOPTaxScam ✓\nSell the #ArcticRefuge to highest bidder ✓"]["If we destroy #ArcticRefuge, we’ll lose this landscape &amp; wildlife forever. RT to #ProtectTheArctic for future generations! https://t.co/ycoFeGzzaC"]["It’s shameful that Republicans want to sell out the #ArcticRefuge to give more tax breaks to corporate polluters. #ProtectTheArctic"]["Scientists are sounding the alarm on opening the #ArcticRefuge to oil drilling. #ProtectTheArctic https://t.co/1uqCsEWAgS"]["We won’t stop fighting against Republican efforts to open drilling the in the #ArcticRefuge. We must #ProtectTheArctic. Watch live: https://t.co/zWgdzgpGYe https://t.co/LKhabbTt7K"]["Failing to disclose key meetings &amp; connections is a theme for the Trump Administration. https://t.co/82TXQLqdek"]["NO. Talley has literally never tried a case &amp; is grossly unqualified for this lifetime appointment to the Federal Bench. https://t.co/0XkK6Fr931"]["Look no further for a comprehensive list of Team Trump’s ties to Russia via @WashingtonPost https://t.co/wvzJPy2jVj"]["I secured a commitment from Army General Counsel nominee James McPherson that he will review &amp; close any gaps in reporting domestic violence. #DomesticViolenceLoophole https://t.co/J1tYQmOKLq"]["Excited that @Facebook is tripling their investment in #NM for a total of $1 billion dollars! This expansion will strengthen our economy &amp; invests in NM’s growing #CleanEnergy industry. https://t.co/E72XVAHDvh"]["Now that we’ve unlocked #Sabinoso Wilderness, it’s open for all to enjoy - including hunters &amp; anglers. @outdoorlife\nhttps://t.co/meGPILvJ0t"]["If you need help or have Qs about signing up for health coverage attend one of these events happening in Las Cruces today, Belen, Las Vegas &amp; Taos #NM this week. https://t.co/buzSRDEOe2 https://t.co/AO9qIQr40u"]["It appears we may need to start administering memory tests for Attorney General nominees. https://t.co/y6c0B3hide"]["Inaction is not an option. That’s why I’m working with @JeffFlake to close the #DomesticViolenceLoophole @MattLaslo @RollingStone https://t.co/Z0YjTRDNUU"]["Local elections matter! If you're an Albuquerque resident get out and vote in the mayor and city council races today."]["Tune into @KSJE_News this morning to hear how I’m working to expand tribal broadband &amp; #SafeguardSacredItems."]["This explainer CQ Researcher on stolen antiquities shows why we need to pass my bipartisan STOP Act to #SafeguardSacredItems: https://t.co/uT65fTZLNN"]["Takeaway from last week’s @NMVoices Kids Counts Conference in Las Cruces? “Policy Matters” https://t.co/k2aJ0MjXNd"]["This @washingtonpost op-ed outlines how solar tariffs will harm Americans &amp; our economy. https://t.co/qtmPzJtPrS"]["It was an honor to join #NMs in Las Cruces to offer sincere gratitude for our #veterans for their service to our country. https://t.co/K209F28YMS"]["Too many Americans are still without power in Puerto Rico. These orgs are teaming up to get #solar power to those in need. #SolarSavesLives https://t.co/NjNy2NESwI"]["POTUS trusts Putin more than US Intelligence Professionals.  Sad &amp; DANGEROUS. I trust our Intel Professionals more than this President."]["This morning I participated in the Las Cruces #VeteransDay Parade w 4th &amp; 5th graders from Central Elementary School. Today &amp; every day we honor our nation's fallen heroes, veterans, &amp; military families. https://t.co/3fc5AISklL"]["Had a great conversation with @sbradley3 at @MesillaNews in Las Cruces. Thanks for having me in studio today! https://t.co/ToMubvAjxl"]["Yesterday, I attended the annual scholarship night for the College Assistance Migrant Program (CAMP) at @NMSU. https://t.co/MJ6lDsGyd6"]["Delicious lunch at @dragonflylc in Las Cruces. Loved the photo of the Organ Mountains-Desert Peaks by Wayne Suggs! https://t.co/aUOA5drtGq"]["New Mexicans will finally be able to access the #Sabinoso Wilderness &amp; we can safeguard these #PublicLands for future generations. https://t.co/av3GcxzGCg"]["I’m thankful for the years of community driven efforts to unlock the #Sabinoso Wilderness to the public. https://t.co/Rhp84gz04h"]["New Mexicans of all ages are expressing gratitude to veterans today. Kindergartners at Dennis Chavez Elementary school sent these thank you cards for #VeteransDay. https://t.co/hc0KJqrD1z"]["I can help #NM veterans access the care &amp; benefits they have earned. Visit my Veterans Resource Center if we can help: https://t.co/Ho3laZKzC5"]["We must keep America's promise to our service members &amp; their families. Read how I’m working for veterans in my newsletter here: https://t.co/qvImHxOoRh #VeteransDay https://t.co/7yIyakFNjT"]["Today &amp; every day, I join communities across #NM &amp; our nation in offering sincere gratitude for our veterans for their service to our country. #VeteransDay https://t.co/7vbvA5FEJj"]["Some of the stunning #Sabinoso Wilderness landscapes that #NMs will be able to access now. RT if you can’t wait to visit these #PublicLands https://t.co/KVYDQW3B7W"]["Unlocking #Sabinoso is a major gain for #NM! TY to Wilderness Land Trust, @NMWildlife, County Commissioners, sportsmen, local community &amp; many others for dedication https://t.co/vKwnbQNrSE https://t.co/mjvjv3whgD"]["Proud to announce that Sabinoso Wilderness will finally be unlocked – allowing public to experience this stunning landscape that we all own"]["This is something we can agree on: domestic abusers should not be able to buy a gun. #DomesticViolenceLoophole https://t.co/s971topT78"]["Yesterday’s hearing on the STOP Act added to momentum &amp; growing support for my bipartisan bill to #SafeguardSacredItems @KOB4 https://t.co/wIHi2JPZUE"]["Another #AntiScience, #ClimateChange denier that Trump Admin wants to put in a leadership position. https://t.co/f94bCoIK7z"]["Texas Shooter should have been barred from buying a gun with his record. My bill will close the #DomesticViolenceLoophole @kjzzphoenix https://t.co/W20PmGz5w0"]["It's time to sign up for health coverage! Go to https://t.co/VlTeGg7D3w before Dec. 15! RT to tell your friends &amp; family to #GetCovered https://t.co/NWf6g5xL3K"]["I stand with #DREAMers in demanding a #CleanDreamAct now. RT if you agree we must pass #DREAMAct before end of the year. https://t.co/uhcWKTXeIA"]["Proud that STOP Act was including in @IndianCommittee hearing &amp; that Gov Riley of Acoma Pueblo in #NM provided testimony. We must #SafeguardSacredItems: https://t.co/B0dKAEjrpl https://t.co/JvBZteExqG"]["Pleased to deliver keynote at the @ArmyCyberInst #CyConUS conference. Here are my full remarks: https://t.co/ZzLi9EVYo3 https://t.co/txhmCmXsHW"]["My bill to #SafeguardSacredItems is being considered by @IndianAffairs. WATCH LIVE: &amp; hear why we need to pass the Stop Act from key witnesses including Acoma Gov Riley https://t.co/fxTSgYAuFa"]["The facts are undisputable – #ClimateChange is real &amp; we need to #ActOnClimate. https://t.co/jPtO6CA31U"]["Honored to keynote at the @ArmyCyberInst #CyConUS conference today on cyber threats and action we must take to keep our nation safe."]["Thank you to the bipartisan cosponsors of the STOP ACT #SafeguardSacredItems @JeffFlake @SenatorTomUdall @SenJohnMcCain @SenBrianSchatz @SteveDaines @JonTester @LisaMurkowski @MikeCrapo @SenatorLankford"]["The voices of native youth matter. Read why they are committed to following in footsteps of those before them to #SafeguardSacredItems https://t.co/LR6B06oaIR"]["When I re-introduced the STOP Act I met with SFIS Leadership Institute’s Summer Policy Academy Students &amp; heard from tribal youth on why we must #SafeguardSacredItems https://t.co/WLWbdIOzTv"]["@thenewmexican There is clear difference between supporting tribal artists/collecting artifacts ethically vs dealing/exporting items that are sacred pieces of tribal cultural heritage. #SafeguardSacredItems"]["Read my op-ed in @TheNewMexican on why we need to #SafeguardSacredItems https://t.co/lNQU6h8jTz"]["I was proud to partner w tribes in #NM &amp; across Indian Country to craft important legislation to #SafeguardSacredItems https://t.co/xv6S99Itpy"][".@EveryTown reports via @NPR : while perpetrators of domestic violence account for only about 10% of all gun violence, they accounted for 54% of mass shootings between 2009 &amp; 2016. https://t.co/EO1NrnIYkL"]["If we look at the data one thing stands out: mass shootings have roots in domestic violence. Close the #DomesticViolenceLoophole https://t.co/T4HvIBhlgO"]["RELEASE: I introduced the bipartisan ACE Act to complete parks, wilderness areas &amp; increase revenues for schools https://t.co/LoRceFNPbF"]["Efforts to discredit Muller &amp; his investigation are a warning sign &amp; need to be taken seriously. @chrissmithnymag @vfhive https://t.co/w5wZvYsPrw"]["This hearing includes my bipartisan STOP Act that will #SafeguardSacredItems. Watch live at 2:30pm ET https://t.co/84Nf3sEbUp"]["Our bill will close the #DomesticViolenceLoophole once &amp; for all. https://t.co/hOERCN7RQe https://t.co/LCqd55xGQa"]["Our country is weary from violence and grief and the American people deserve meaningful action from Congress. https://t.co/4eZzJMzsZJ"]["Enough is enough, perpetrators of domestic violence should not be able to buy a gun. #DomesticViolenceLoophole https://t.co/uv5JCYrBtX"]["WATCH LIVE: I’m introducing a bill with @JeffFlake to permanently close the #DomesticViolenceLoophole. https://t.co/O3DXivLLQq"]["RT if you agree we need to close the #DomesticViolenceLoophole. https://t.co/DFE0FmyAQu"]["I met with Gov Riley of Acoma Pueblo today in advance of @IndianCommittee hearing on my STOP Act bill to #SafeguardSacredItems. https://t.co/GXg6tg1ae9"]["Glad to be working w/ @JeffFlake on bipartisan bill to close DoD/NICS loopholes to keep guns out of the hands of those that want to do harm."]["It's #ElectionDay in Las Cruces #NM. Local elections matter - get out and make your voice heard today. https://t.co/J4e0yI8Mn3"]["Americans deserve to know exactly what’s in the food they buy &amp; if its genetically modified @lamontanitacoop https://t.co/wGL8aoDu7g"]["Artistic expression is a vital part of #NM culture &amp; economy. https://t.co/a1SkssfnJF"]["ICYMI: Listen to details about my bipartisan bill to protect U.S. voting systems on @ksfrnews #SecureElections https://t.co/p0hpF9t2nu"]["I urge Pres. Trump to look at the bigger picture of the American solar industry &amp; recognize that undue tariffs will do more harm than good. https://t.co/7Xmt0IuLyq"]["My heart breaks to learn abt shooting in TX. Keeping everyone impacted by this senseless violence &amp; those on the front lines in my thoughts"]["Happy #NationalBisonDay! The bison has been an important part of our culture for generations in #NM, western prairies &amp; in Indian Country. https://t.co/X8REBgu7lZ"]["It's been over a month since #CHIP expired. Unacceptable that Republicans are putting 9million children at risk who rely on health coverage."]["If Pres Trump &amp; Rs were taking #OpioidEpidemic seriously they'd stop trying to gut #Medicaid &amp; sabotage health care https://t.co/8skehq6GSk"]["Tomorrow is #NationalBisonDay! DYK that the Bison is our official National Mammal? https://t.co/NMmVlGAXtU"]["The GOP tax plan is a setback on almost every level. https://t.co/yI7r5qSnRr"]["Inaction is not an option. RT if you agree we need to pass the #DREAMActNow! https://t.co/SElf3ONdX5"]["#ArcticRefuge is sacred to the Gwich’in people – “This is the heart of the refuge.” Listen to them and #ProtectTheArctic https://t.co/yOTX4cdnRT"]["WATCH LIVE: I’m on the Senate Floor w @SenatorCollins to urge support for our bipartisan #SecureElections bill. https://t.co/94lxqPjb2V"]["Selling off #PublicLands &amp; opening drilling in #ArcticRefuge should not be on the table to pay for #TrumpTaxScam. RT to #ProtectTheArctic https://t.co/kLZK2Xo0UN"]["WATCH LIVE: I’m speaking out to #ProtectTheArctic at the ENR hearing on GOP plan to drill in #ArcticRefuge https://t.co/XgyWIskjDQ"]["Proud intro legislation w @SenBennetCO &amp; @RonWyden to rebuild more resilient &amp; clean energy systems after disasters with help from DOE labs https://t.co/p5I872YkpW"]["Proud to join amicus brief supporting LGBTQ rights &amp; will continue push for full equality for every single American https://t.co/gdHeuXjl4R"]["Open enrollment for health coverage begins today! RT, spread the word &amp; encourage your friends/family to #GetCovered https://t.co/VlTeGg7D3w https://t.co/UbSLj8tIfR"]["We need to ensure #SecureElections to guarantee the integrity of our elections @krwg https://t.co/rE4JZCkKon"]["Our election systems are vulnerable to cyber-attacks by hostile foreign agents. We need #SecureElections @Reuters https://t.co/ueWvse8KIh"]["I'm working with @SenatorCollins to #SecureElections &amp; protect our voting infrastructure via @thehill https://t.co/xjp8uQLzky"]["Proud to partner with @NMSecOfState Maggie Toulouse Oliver to #SecureElections &amp; America’s voting infrastructure. https://t.co/BmB56fzQvW"]["Russian-created ads should be released to public so that Americans can see for themselves &amp; take steps to spot fake accounts &amp; news online."]["My Q: Pres Trump called Russian purchased FB ads a “hoax” was it?\nFacebook: “No. The existence of those ads were on FB &amp; it was not a hoax.” https://t.co/rWFjGYnUOS"]["Russian-created ads are anything but a “hoax.” They are very real &amp; had extensive influence https://t.co/TiVng5uAMB"]["ICYMI: I discussed my bipartisan bill to #SecureElections from foreign influence on @CBSNews w/ @TheStephSy https://t.co/I5xJsk06ZL"]["WATCH LIVE: I'm questioning leaders from Facebook, Twitter &amp; Google about social media &amp; the 2016 election https://t.co/FtuDpQgSc9"]["My thoughts are with all those in New York City tonight and the family members of those we have lost."]["President Trump meeting with his foreign policy team in 2016. Who can spot “low-level volunteer” Papadopoulos? https://t.co/mLs56S3NoW"]["We can’t stand idle while the voting systems in America remain vulnerable to foreign attacks. #SecureElections https://t.co/g1b21GEQ4w https://t.co/uoJy0ePwmJ"]["Read about how my #SecureElections bill w @SenatorCollins will help states protect against election cyber attacks: https://t.co/sk4gKfgbtw"]["I'm grateful for local leaders like @NMSOSMaggie who know how important it is to #SecureElections from attacks."]["@SenatorCollins I won't stop until we uncover full extent of Russian influence on our election &amp; create barriers so it never happens again #SecureElections"]["My bipartisan #SecureElections bill with @SenatorCollins will protect our election systems from foreign interference https://t.co/g1b21GEQ4w https://t.co/nZbnBzNNkX"]["Today I introduced my #SecureElections bill to safeguard voting systems, registration data &amp; ballots from theft, manipulation &amp; hackers. https://t.co/aAHHFNIDaJ"]["Foreign interference in our elections is alarming because our democracy hinges on our ability to ensure Americans choose our own leaders. https://t.co/Y37lHuVr6j"]["We know Russians attempted to hack state election voting centers &amp; state-level voter registration databases in 2016 https://t.co/jJ0zyBlnFp"]["POTUS is tweeting “NO COLLUSION” but his campaign advisor just plead GUILTY to lying about his efforts to collude w/ Russians. More to come?"]["I am proud to stand with Dreamers in NM and across the country. We will not stop fighting for you. #WeAreAllDreamers https://t.co/z11risZClV"]["The Special Counsel’s investigation needs to be protected—any interference is an obstruction of justice. https://t.co/CTpHd8tNKr"]["When you consider a Russian dictator like Putin to be a friend &amp; ally, you shdnt be surprised when “fake” news yields very real indictments"]["We must continue fighting for our conservation legacy, our obligation to respect tribal heritage, and the places that make us Americans."]["Decreasing protections for #BearsEars would also set the stage for additional attacks on all of America’s national parks and public lands."]["How do you get someone to do something they should not do? Find out what motivates them. @Politico https://t.co/y7B2gqSSIl"]["Every child should be able to enjoy America’s public lands no matter their family’s means! https://t.co/jomkfZ7Oai"]["Broadband access is critical for tribal economies, small businesses &amp; is a cornerstone to improving tele-health services, edu &amp; jobs."]["My #TribalConnect Bill will improve broadband internet in Indian Country by increasing E-rate internet access in tribal libraries. https://t.co/GveklyAuKA"]["I’m calling on POTUS &amp; Republicans in Congress to support my bill that would invest $45B to address #OpioidEpidemic https://t.co/XiOLXEZvd3"]["Secretary Perry and the Trump administration can repeal environmental rules, but they can’t repeal economics. https://t.co/Rdgi5XttP8"]["Read my op-ed calling on Sec Perry to abandon efforts to prop up coal &amp; nuclear power. @greentechmedia: https://t.co/x7q0h2JUro"]["Stakeholders are speaking out against @ENERGY's attempt to prop up coal. https://t.co/KlwJcIrFGv"]["Congratulations to @SFPSdistrict student Faris Wald for this impressive #STEM win! https://t.co/X4kegABW0p"]["We should be investing in #CleanEnergy not bailing out dirty energy. https://t.co/K68be0UtUd"]["I agree. Grateful for @ChrisMurphy's leadership &amp; proud to join him as an original cosponsor of the Background Check Expansion Act. https://t.co/x2mOJE3xaa"]["I support #StatePublicOption &amp; won’t stop working to find real solutions to improve our health care system in #NM &amp; get more people covered. https://t.co/bPSDlprBGm"]["Proud to join this effort to #UnlockMedicaid that will expand coverage &amp; provide more affordable health care options for families in #NM https://t.co/jNRhXJ7cGs"]["My #ProtectDreamers bill protects the personal data #DREAMers’ entrusted with the gov so they can't be unfairly targeted by the Trump Admin."]["We're demanding answers from Trump Admin &amp; urging DHS to protect personal #DACA data &amp; not use to deport #DREAMers https://t.co/LMixG9qnPu"]["#DREAMers are teachers and students. We need to pass the #DREAMActNow to #ProtectDreamers https://t.co/SNuMvTCBbk"]["@JeffFlake We should all fear the ramifications of a system which seems to be driving people of @JeffFlake's caliber away from this institution."]["The Senate will be worse off without @JeffFlake's honesty, integrity and willingness to speak his mind."]["Senate disaster relief falls short &amp; doesn't fix backward wildfire funding – we need to pass bipartisan Wildfire Disaster Funding Act."]["Until we devote necessary resources to wildfire suppression &amp; forest restoration we will continue setting ourselves up for greater disasters https://t.co/gwEibkpCfB"]["Our backward fire budget worsens fire season because funds are taken away from preventing fires to put them out. https://t.co/z4GvjRhB1n"]["Happy Birthday to the one and only @RepLujanGrisham! Proud to have you as a partner in Congress and thankful for all you do for #NM."]["Proud to join @RonWyden in this fight &amp; cosponsor USA RIGHTS Act to reform secretive warrantless spy program &amp; protect security/liberty. https://t.co/dN5esT9iNT"]["Republicans handed out tax cuts for the rich in Kansas &amp; put the burden on farmers &amp; workers. Learn from this failure &amp; demand #NotOnePenny https://t.co/cZd1WreTEj"]["Good luck to the two Albuquerque natives playing in the first game of the World Series tonight! https://t.co/NuqwfNw3us"]["Ending #DACA risks irreversible damage to school districts across country that depend on these talented teachers https://t.co/SCXKyaw2fN"]["Proud to join with @SenatorDurbin to call on POTUS to #KeepItPublic. https://t.co/hzuhjjJx2v"]["It’s hard not to fall in love with our #PublicLands in #NewMexico. https://t.co/1f3nAD3BJ4"]["Check out this @TeenVogue profile on how Latinx Teens and @HispanicAccess are standing up to protect our #PublicLands including #OMDP4NM. https://t.co/IjLlz7yuY8"]["We will all miss New Mexico music legend Al Hurricane. https://t.co/j6yUnD7E2b"]["Take a listen to this Albuquerque inspired playlist to start your week off right: https://t.co/ncHJGSpqGR"]["Solar power can help us rebuild Puerto Rico &amp; create a more secure grid. https://t.co/SfrK9bcYzZ"]["We should be utilizing the expertise at our national labs in New Mexico to help with recovery in Puerto Rico. https://t.co/VwwxHEOj5m"]["Congress needs to reauthorize #CHIP now! https://t.co/VrSjYK2VzX"]["I won’t stop fighting to ensure #NM students are taught science – including #ClimateChange &amp; evolution in school. https://t.co/r2VzBZCLvA"][".@DescartesLabs, a LANL #TechTransfer success story company in Santa Fe is assessing the damage of #CAwildfires. https://t.co/mtajdUI3WA"]["We need bipartisan, pragmatic solutions to address the challenges facing this country. https://t.co/FUCBDcmEya"]["GOP budget slashes Medicaid and Medicare, and cuts critical services that invest directly in our communities."]["The cost of Republican chaos and backward thinking is growing by the day and this budget only makes life harder for working families in NM."]["Proud to join @Patty Murray in introducing legislation to reject Pres. Trump's attack on women's health care. https://t.co/01V48qopBK"]["GOP budget would give fast-track authority to auction off over a billion $$ of public lands in NM &amp; across the West. https://t.co/B5F1KwHHYm"]["CIA Director Pompeo’s comments today at the #FDDSummit conflict with the IC's assessment: https://t.co/FqwpRB8Twn"]["Either Dir Pompeo is just parroting POTUS talking points or he’s making major split from rest of the IC on Russia meddling. #FDDSummit"]["I’ll keep fighting to #ProtectTheArctic &amp; say #NoArticRider. https://t.co/QwqEEnp66m"]["One month after Hurricane Maria +3million AMERICANS are still without power +1million AMERICANS without access to water in Puerto Rico."]["I’m doing everything I can to ensure New Mexicans are prepared to fill the 1,200 LANL vacancies we expect by 2021. https://t.co/GiaP6CP5YW"]["We need a sound, comprehensive strategy to combat real and present cyber attacks. So much more needs to be done."]["I'm working on legislation to improve election security to protect voting systems from cyber attacks. https://t.co/TUsuMjl1e3"]["It’s a red flag that CIA IG nominee didn't read full Torture Report. https://t.co/naBJaUzvQO"]["Think BEFORE you forward. https://t.co/HeIgAkYRgx"]["Important discussion about #HealthCare in NM on #LetsTalkNM this morning. Tweet, or call in live 505-277-5866 with questions. https://t.co/N5XVZ2tRQ0"]["Exposing girls to #STEM can put them on track for exciting STEM careers so they can solve our most pressing problems https://t.co/FNa2vFNtqc"]["AG Sessions spent another full day on Capitol Hill testifying but refused to provide answers to important questions. https://t.co/AV5gZactqg"]["Proud to stand with NMs like Andrew. I'll keep fighting to #SaveLWCF before it expires &amp; permanently fund it. https://t.co/24wxNHPuRk"]["We should use solar to rebuild Puerto Rico’s power grid. https://t.co/pCjrICfL5O"]["WATCH LIVE: I’m on the Senate Floor speaking against the Republican Budget that will harm working families in #NM https://t.co/NywFZE7QdU"]["The President is failing the people of Puerto Rico. https://t.co/0Hyil9WpFs"]["Thank you @RepLujanGrisham! https://t.co/wek6FltE78"]["Thank you @SenatorTomUdall! It’s an honor to serve #NM alongside you. https://t.co/M4bxpvCc2R"]["New Mexico is one of a kind. Think of this as an explainer on the Land of Enchantment: https://t.co/brlwpc8vAN"]["The Arctic National Wildlife Refuge is a treasure worth fighting for. #NoArcticRider https://t.co/MQKuh5IgV4"]["Republicans’ latest attempt to offset their massive tax cuts = opening drilling in Arctic National Wildlife Refuge. #NoArcticRider"]["WATCH LIVE: We're demanding that the Arctic National Wildlife Refuge be kept safe from oil drilling. #NoArcticRider https://t.co/Z8DpzCAWDZ"]["This is what democracy looks like. Thank you to every single New Mexican who took a stand. https://t.co/pYwm2uyJaE"]["Until next year @BalloonFiesta! What was your favorite balloon at the iconic Albuquerque International Balloon Fiesta this year? https://t.co/0yCGRc9FmX"]["To tackle poverty and put families on the right track we need to close the #WageGap in New Mexico. https://t.co/vvMYw4K0YC"]["Proud that #NM firefighters are helping battle the blazes in CA. Thank you to every one lending a helping hand. https://t.co/I4GwKQmYb7"]["None of us are entitled to our own facts. Keep #NM science standards strong. #RallyForScienceNM https://t.co/PNzjthlkJg"]["Our ability to face challenges ahead rests on our ability to make decisions driven by scientific data - NM students deserve real science ed"]["I stand with #NMs who oppose watering down science education standards for our public schools by removing climate change, and evolution. https://t.co/0MoqY7vopu"]["I’m glad the IRS heeded our call to reconsider its contract with Equifax https://t.co/gBGuY76zXH"]["It makes zero sense to effectively walk away and allow Iran to re-start its nuclear program: https://t.co/9ltS72XSqG"]["Having failed to repeal the ACA in Congress, Pres. Trump is determined to rip apart our health care system: https://t.co/0Qgvtl0G4A"]["Reminder: Service Academy applications are due tomorrow at 10pm MST. Submit here: https://t.co/0gDcqlw9e1"]["Proud to announce over a million dollars in new funding for #NM to combat the #OpioidEpidemic https://t.co/HwrTwV4DnZ"]["RT if you want Pres Trump, Republicans to stop sabotaging our health system care. New EO is newest attempt &amp; will hurt millions of Americans"]["The only thing that will result from this Executive Order is chaos in our health care system. https://t.co/QvA2uaUEXy"]["How do #Latinos impact our economy? @JECDems &amp; @HispanicCaucus have the answers here: https://t.co/nk8tJSudzQ #HispanicHeritageMonth"]["We need to do everything possible to make sure girls have every opportunity to succeed and change the world for the better. #DayoftheGirl https://t.co/zAP3uQYKPQ"]["With every new revelation, we’re getting a clearer picture how Russia’s online army worked to influence our election https://t.co/jtCBfaS8RE"]["Death by a thousand cuts: Republicans’ strategy to destroy the ACA @bizwomen https://t.co/dFiXf9hevJ"]["My heart goes out to the families of those we've lost in the horrific wildfires that continue to rage in California. https://t.co/wU7VPuoNg5"]["#NM chile isn’t just a food, it’s part of our culture, it fuels our economy, and it's #AuthenticallyNM. Here's one of my fav chile recipes! https://t.co/JZs6UiEVLG"]["I’m proud to work with @SenatorHeitkamp to combat the epidemic of murdered and missing Native women and girls: https://t.co/L9wk17fxkM"]["If we fail to reduce carbon emissions, the consequences will only become greater and our solutions will only become more expensive."]["By withdrawing these standards, the Trump admin is taking us in the wrong direction &amp; retreating from our moral obligation to #ActOnClimate"]["It established reasonable &amp; achievable standards to reduce our carbon emissions &amp; create thousands of new clean energy jobs in the process."]["The #CleanPowerPlan was a historic step in combating climate change and protecting the health of our kids and future generations."]["The Trump administration needs to stop playing politics w/ Dreamers' lives. We need to pass the bipartisan #DreamAct https://t.co/7FkUIUjcoN"]["The Albuquerque International @balloonfiesta starts today! What’s your favorite balloon? https://t.co/Z54QRwO3Z6"]["Good news that XTO will keep working to reduce methane emissions. https://t.co/QN4LSGO9pd"]["Thread Alert: @JECDems lay out how birth control saves taxpayers $, keeps more women in the workforce &amp; decreases poverty. #HandsOffMyBC https://t.co/BXrNqBzJnL"]["Republicans refusal to #ExtendCHIP is putting health insurance for 11,300 #NM children in jeopardy. #KeepKidsCovered https://t.co/X6PHrYljU1"]["In #NM $816 could pay for 10+ months of electric bills. GOP tax increase would burden working families @JECDems https://t.co/ACACr819Lo"]["The GOP #TrumpTaxScam will result in a tax hike for everyday Americans &amp; the middle-class. https://t.co/pLdujLHVnk"]["I'll continue prioritizing infrastructure investments in rural #NM like $2.5 million for Raton Water Treatment Plant https://t.co/8ww2yvDSzW"]["I'll continue opposing &amp; speaking out against #solar tariffs because they would harm solar jobs in #NM @ABQBizFirst https://t.co/bjdssUZw4z"]["@SenBennetCO We have a moral obligation to reduce greenhouse gas emissions and mitigate our contributions to #ClimateChange."]["Proud to join @SenBennetCO on effort to standardize the cost of climate pollution &amp; focus on our #cleanenergy future https://t.co/be1mOYfgpf"]["Reversing progress seems to be a trend with this administration. This backward decision will hurt women &amp; families. https://t.co/VpzXeN8tns"]["I'm calling for permanent &amp; full #LWCF funding to protect our outdoor heritage &amp; #PublicLands for future generations to enjoy. #SaveLWCF"]["#LWCF expands opportunities for outdoor traditions like hunting, camping &amp; fishing that fuel our outdoor recreation economy. #SaveLWCF"]["The countdown is on – #LWCF will expire in 52 weeks – unless Congress acts to #SaveLWCF."]["I’m demanding answers on why IRS is paying Equifax $7.25M in taxpayer $$ to protect very same ppl from identity theft risk Equifax created. https://t.co/iOPAmmKfB9"]["It’s #WorldTeacherDay! Thank you to all the educators in #NM who make a difference in our kids' lives every day. https://t.co/r2QnLVBWwE"]["Josue is a #DREAMer from #NM whose dream is to study medicine so he can give back to his community &amp; make a positive impact. #DreamActNow https://t.co/P7C3LHPJR8"]["I'm going to keep fighting for #DREAMers like Michael. #DREAMActNow https://t.co/bBLbOFnuuF"]["My message to #DREAMers: Don’t give up. You have me &amp; so many others in your corner &amp; and we’re going to keep fighting to pass #DREAMActNow https://t.co/fo5M1jpmwG"]["Proud to announce $4 Million for a Navy testing and evaluation construction project at WSMR https://t.co/aYaT5Q6hfG"]["...Meanwhile, thanks to possible tariffs from the Trump Admin, the future of American solar jobs are at risk. https://t.co/Bxq45UsdmY"]["Renewable energy generation &amp; jobs growing faster than anyone thought possible... https://t.co/WLNDXDblnN"]["@VallesCaldera I will continue to fight for #LCWF so future generations can enjoy the public lands that we all own and love. #SaveLWCF"]["In #NM we can thank#LWCF for protecting some of our most treasured #PublicLands like @VallesCaldera, Ute Mountain &amp; Valle de Oro #SaveLWCF https://t.co/lxEDH2hsf7"]["For more than 50 years, #LWCF an essential program for protecting #PublicLands &amp; opening hunting, fishing &amp; other recreation. #SaveLWCF"]["#LWCF is bipartisan priority we all can agree on. We must reauthorize America’s most important conservation &amp; recreation program! #SaveLWCF https://t.co/YXvcDi0kNE"]["I testified against tariffs on solar because it will hurt the #NM economy &amp; #cleanenergy goals https://t.co/G5rmU01XZX"]["I’m thankful for everyone who lent a helping hand during the tragedy in Las Vegas like Rebecca from Las Cruces https://t.co/oODAQ7VA7B"]["There is nothing “conservative” about making it easier to waste a precious public energy source. https://t.co/ZCC5ZDdJA1"]["I’ll keep pushing my innovative #2gen legislation with @SenatorCollins to provide a comprehensive strategy to help families succeed &amp; thrive"]["To break the cycle of poverty in #NM we need a #2gen approach that supports children &amp; parents at the same time. https://t.co/qUZvgpb19h"]["In NM we stand to lose 1,545 jobs in 2020 if high tariffs are imposed on solar panels #SaveSolarJobs @greentechmedia https://t.co/U8ahQ7sCTI"]["In New Mexico, every day is #NationalTacoDay. What’s your favorite taco spot in New Mexico? https://t.co/x8HxmyTRA6"]["I’m #WithDreamers &amp; will keep calling for the #DreamActNow. https://t.co/eyIfVFwnhu"]["@thehill Thanks to the contributions of #DACA recipients our economy is stronger, we have more businesses, and our tax base is larger. #DreamActNow"]["#DREAMers reflect the very best of America. Read my @thehill oped about why we need to pass the #DreamActNow https://t.co/OQOJ8ZBJXw"]["Proud to advance my bipartisan #TechTransfer Maturation bill that will create jobs &amp; boost #NM economy at @EnergyDems hearing yesterday."]["I joined @SenatorTomUdall on the Senate floor to recognize life &amp; service of the longest-serving senator from #NM, Senator Pete Domenici. https://t.co/NNySbpUBR3"]["Equifax needs a lesson in fraud protection, not the other way around. https://t.co/SpF2vjbT3o"]["In the wake of hurricanes that have disrupted day-to-day lives of many #DREAMERS I've called on @DHSgov to extend the #DACA renewal deadline"]["#DACA renewal applications are due on Thursday. Postmark them by TODAY to make sure they arrive on time! https://t.co/QAE3jVQMpM https://t.co/vJW6pPUCkj"]["The President should be working to get Americans the help and resources they need to rebuild and save lives. https://t.co/R5wCPpjJVu"]["Every life lost to gun violence is a tragedy. #NotOneMore https://t.co/NZ0vyAX0Zb"]["Thank you for your leadership @ChrisMurphyCT. We need action, including background checks now. https://t.co/Hvwn59tDaq"]["It’s election day in Albuquerque! Polls are open from 7am to 7pm. Make your voice heard. Voting info here: https://t.co/kfpG9OtdiR"]["Jobs in #NM solar industry increased by 54 percent last year. That’s why I’m fighting to #SaveSolarJobs https://t.co/vH2Jp9U7qT"]["Imposing high tariffs on imported solar panels would set back our nation’s efforts to transition to #CleanEnergy threaten #SolarJobs."]["Before testifying I sent ITC a letter urging them not to impose tariffs that would negatively affect #NM economy &amp; American solar industry. https://t.co/OpEWifmTbB"]["Today I told US International Trade Commission that we need to #SaveSolarJobs &amp; stop tariffs on solar. Full remarks: https://t.co/Rlbs8MbEhD"]["Denisse Rojas Marquez is a #DREAMer &amp; med student. Watch Senate Judiciary Committee #DACA hearing to hear her story https://t.co/OLEix5Ec25"]["The facts are the facts. https://t.co/PyTVa3yUII"]["This is a big win for our clean energy economy &amp; Indian Country in #NM. https://t.co/QN1oBTjMSM"]["Happy #NationalPublicLandsDay! Getting outside on our #PublicLands is an experience that every New Mexican can enjoy. #PublicLandOwner https://t.co/YjYtXcmFjN"]["Perry wants you to pay more so he can prop up dirty energy sources that can no longer compete in the marketplace. https://t.co/5XiRlW86Fl"]["Proud to stand with the 7,000 #DREAMers in New Mexico and across the country. I’m #WithDreamers. https://t.co/56fOUFHcQu"]["Thursday, October 5 is the deadline for #DACA renewals. RT &amp; spread the word about these free clinics for #DREAMers in #NM. https://t.co/tYXJwGk2iW"]["Wow. President Trump stands to save $1BILLION if the Republican tax plan becomes law. https://t.co/IPa7Vsc6cq"]["It’s #NationalCoffeeDay! Thank you to the #NMCoffee shops that give us a boost every morning. What’s your favorite coffee spot in #NM? https://t.co/Xvk06U5Q38"]["Imposing tariffs on solar panels will raise prices, endanger hundreds of local jobs, &amp; hurt the economy in #NM. https://t.co/efP6AuFWhE"]["In case anyone is wondering who benefits under the Republican tax plan. https://t.co/OoJTbI3Fi5"]["I oppose Pres Trump's @FCC Nominee @AjitPaiFCC &amp; will I'll do everything I can to protect #NetNeutrality &amp; the #OpenInternet NMs deserve."]["~9 million American children are covered by #CHIP. It’s indefensible that Republicans are letting it expire tomorrow https://t.co/DDDrgWcUGg"]["FALSE. Things are not \"good\" in Puerto Rico &amp; President Tump's delayed response put American lives in jeopardy. https://t.co/jLf9n66iuz"]["Did you know that 20% of #NMs are without access to #BroadBand? We need to close the #DigitalDivide. @JECDems https://t.co/K6yk9xpey7 https://t.co/Hx8JrDpRbc"]["That's why I wrote to Pres Trump calling for the administration to take action on Puerto Rico relief. Letter here: https://t.co/lw9WmMJDnZ https://t.co/iwUHq4yp0v"]["It's unacceptable for the President not to do everything in his power to help Puerto Rico recover. https://t.co/utWmHtsuwH"]["We need immediate action to preserve the integrity and transparency of our elections. https://t.co/R6oACVjy4d"]["Our national monuments like #OMDP4NM in Las Cruces fuel our economy in New Mexico. #KeepItPublic https://t.co/qkVlC1vlNw"]["I'm calling for #DACA renewal extension for #DREAMers whose lives have been turned upside down &amp; who are still recovering from hurricanes."]["We’re expecting heavy thunderstorms in #NM that could lead to dangerous flash flooding. Take precautions &amp; stay safe! @accuweather https://t.co/CHCzFIOFKg"]["@WhiteHouse @Interior @SenatorTomUdall @repbenraylujan @RepLujanGrisham A review based on facts would find that #OMDP4NM &amp; #RGDN have contributed to #NM economy &amp; protected traditions/culture in our communities."]["We wrote @WhiteHouse COS John Kelly about glaring inaccuracies in @Interior's National Monument report &amp; urge him to reject report recs. https://t.co/G4tIalnAxY"]["It's #NationalVoterRegistrationDay! Your vote is your voice. If you're from #NM register here: https://t.co/Z641vSM2I6 #NMVote"]["Thank you to every single New Mexican who stood up against #GrahamCassidy. This is your victory. https://t.co/v1iPqwsZdm"]["#GrahamCassidy is officially dead. It’s time to get to work, hold hearings &amp; find bipartisan ways to improve our #HealthCare system."]["WATCH LIVE: I’m fighting for every NM who would be hurt by Pres Trump &amp; Rs’ last-ditch effort to revive #TrumpCare. https://t.co/EToV5lRW9v"]["We need to pass #DREAMAct so #DREAMers who know only the U.S. as their home can continue to contribute to economy &amp; give back to communities"]["This partisan effort to undermine bipartisan #DREAMAct is a nightmare for #DREAMers. https://t.co/KwrYJbI1ZS"]["Watering down the #science curriculum &amp; gutting mention of #ClimateChange in #NM will hurt our economy &amp; short-changes our children's future https://t.co/3xHAidBYUm"]["Thank you for lending a helping hand! https://t.co/IvNsWDY6HO"]["Investments that support innovation &amp; entrepreneurship are critical to ensuring that NM economy can grow &amp; thrive. https://t.co/dfIqH6zmyZ"]["Thank you @SenatorCollins! https://t.co/aaVk4N3xnM"]["The only way we are going to defeat #TrumpCare &amp; ensure health coverage for all is if we do it together! https://t.co/d0bTmnYCp1"]["Protest. https://t.co/o1Esu8fknv"]["@SenateGOP March. https://t.co/ggpOS0WvSu"]["@SenateGOP Write. https://t.co/pcDG6mUe9Y"]["@SenateGOP Call. https://t.co/aSXAOMEeIW"]["We need every voice to tell the @SenateGOP to stop endangering lifesaving health coverage that millions of Americans rely on. https://t.co/E0pz6r6Vme"]["I oppose #GrahamCassidy. We need to do everything possible to make sure the Senate GOP doesn’t get the 50 votes they need to pass it. https://t.co/ts7EHhceAr"]["They have until Sept. 30 to pass it using a special budget procedure that allows #TrumpCare to advance without any Democratic votes. https://t.co/w4NZWCNhBp"]["That’s why we’re on RED ALERT! @SenateGOP is getting dangerously close to having enough votes to pass #TrumpCare. https://t.co/igXAl4psxm"]["The new #TrumpCare bill, #GrahamCassidy, is the worst yet. It guts #Medicaid, preexisting condition coverage &amp; will cost families more money https://t.co/jBHgFn5PgO"]["When it failed everyone celebrated because we thought we killed #TrumpCare for good, but it’s back from the dead. https://t.co/fa0xBbnItk"]["In July, the Senate #TrumpCare bill made it all the way to the floor for a nail-biting vote. Remember this crucial moment? https://t.co/Rm8RSqdOFy"]["They tried to ram #TrumpCare through the Senate Floor for a vote in June but pulled it when they didn’t have the votes. https://t.co/7iKd9iQIAD"]["When they unveiled the bill in June, it was a disaster – really. It left millions more Americans without lifesaving coverage. https://t.co/SjvU4Ynn4j"]["After the House passed their #TrumpCare bill in May, 13 Senate Republicans met in secret &amp; wrote a bill without bipartisan input. https://t.co/FNeJ5QtX5s"]["For months, Republicans have been working to pass #TrumpCare that would throw our health care system into chaos. https://t.co/9h94UDi8yW"]["I'm standing with the over 7,000 #DREAMers in #NM &amp; will keep calling for passage of #DREAMAct https://t.co/evgnpj9DFu"]["My #MondayMotivation: doing everything I can to stop #TrumpCare &amp; protect lifesaving health care for every NM. https://t.co/je9WWpSVvE"]["It’s unacceptable that #IndigenousWomen have to work until Sept 25 to match white men's pay. We need to close the #NativeAmericanPayGap."]["Read my op-ed with @SenatorTomUdall about why science education is essential to New Mexico’s future. https://t.co/jnAmYgIY18"]["New Mexicans should continue to have access to this vital care. #ProtectOurCare https://t.co/lTbyFm5hUL"]["WATCH LIVE: This is the first &amp; only hearing Senate Republicans have agreed to on their latest #TrumpCare bill. https://t.co/IGGFZFHv2H"]["This is what democracy looks like. https://t.co/06Yc8nohcG"]["Your voices matter. Keep calling. Keep writing. Keep telling your story. #ProtectOurCare https://t.co/451wO3cBrl"]["#GrahamCassidy is a disaster. RT &amp; tell @SenateGOP we should be working on real bipartisan solutions to improve health care system that:"]["Puerto Rico is American. We should be sending every possible resource to help the island recover following the devastating hurricanes."]["ACTION: Make your voice heard on #TrumpCare! Email your health care story &amp; Qs to ➔ gchcomments@finance.senate.gov for the hearing today! https://t.co/7Ylx4Bkrsr"]["It's the last week of Monuments to Main Street! Be sure to take advantage of the events taking place in southern NM! https://t.co/QZz99fT61B"]["Happy National Hunting and Fishing Day! Proud to celebrate these two #NM traditions. What's your favorite place to hunt or fish in NM? https://t.co/wu9TGVfCZR"]["Don't forget to comment on these proposed changes to NM's science curriculum. Deadline is October 16th: https://t.co/2GYGZxnwkF"]["The massive #Medicaid cuts in #TrumpCare will only intensify the #opioid epidemic in NM, and hurt kids. https://t.co/82rSiJOZ6D"]["We need to kill #TrumpCare once and for all. https://t.co/OZIioRuBz2"]["Pres Trump &amp; McConnell are trying to force #TrumpCare through Senate before Sept 30 so they can pass a bill w/ no bipartisan support at all"]["This is not a game. #CassidyGraham will hurt millions of Americans &amp; throw a quarter million New Mexicans off their health insurance."]["Gutting #Medicaid would be devastating for Indian Country. https://t.co/nWIPqARCVP"]["Under #Graham-Cassidy New Mexicans stand to lose $3,400\nper year. https://t.co/OaTLmXKM2p"]["If this administration had consulted with local experts &amp; communities in NM it could have avoided these basic errors https://t.co/svU6s5E3nu"]["Doctors oppose Graham-Cassidy because they know it will harm their patients. https://t.co/IHohPVUD0e"]["Rs need to remember that real people’s lives hang in the balance in this #TrumpCare debate. Share your story here: https://t.co/0oKOY535Qb https://t.co/2fUCAJmESt"]["Real bipartisan solutions to fix our health care system are within reach if Pres Trump &amp; Rs would be willing to work with us to find them"]["You have the power to stop #TrumpCare from becoming law if you take a stand. Keep calling, keep marching, keep making your voice heard. https://t.co/VfgsFKWnJV"]["I’m proud to have secured big wins for New Mexico in #FY18NDAA. https://t.co/az3hb781Wc"]["Thank you to everyone who came out to the Monuments Protection Rally in Taos last night! I'm with you. #KeepItPublic https://t.co/m7hK0TZ7mB"]["Wishing all who celebrate #RoshHashanah in #NM and around the world a healthy &amp; happy new year. Shanah Tovah!"]["Senate GOP has not learned its lesson. Still trying to ram #TrumpCare bill through by making backdoor deals to buy off GOP Senators."]["#Medicaid helps us fight poverty. If Graham-Cassidy becomes law child poverty will get even worse in NM. https://t.co/30F5Tyfv5l"]["@FEC @RonWyden @RepSarbanes @RepJohnConyers RT if you agree we need to do everything we can to prevent foreign governments from using social media ads to influence U.S. elections."]["We’re calling on the @FEC to establish safeguards to protect American voters from being targeted by foreign governments online. https://t.co/E6RcbewSNh"]["I will continue calling for the swift passage of the #DreamAct."]["#DREAMers are American, and they make an invaluable impact on our economy. We need to pass the #DreamAct. https://t.co/n3r60ofYkn"]["Millions uninsured, market destabilized, Medicaid gutted - #GrahamCassidy is a disaster. https://t.co/1HJNrDpEIp"]["NMs lives &amp; wellbeing hang in balance every time Senate GOP tries to strip lifesaving coverage from those in need. https://t.co/je9WWpSVvE"]["Alima from Santa Fe is pregnant &amp; enrolling in #Medicaid. She asked me to do everything I can to stop #TrumpCare. I won't stop fighting. https://t.co/hb80j5YytA"]["This is the worst version of #TrumpCare yet. It would wreak havoc on #NM by gutting #Medicaid. https://t.co/SOAPn5K6EN"]["Senator Cassidy failed his own test. His #TrumpCare bill will hurt children &amp; families. https://t.co/Wv05LHkMhI"]["Lack of BLM fact check is part of reason why there are basic factual errors in @SecretaryZinke's report to Pres Trump on NM’s Natl Monuments https://t.co/lihsm1auDg"]["Sending our thoughts and love to our neighbors in Mexico impacted by the devastating earthquake."]["We need these questions answered before we should vote on #GrahamCassidy. This is the bare minimum. https://t.co/Y54pnmod2g"]["Will Senate GOP listen to doctors who oppose Graham-Cassidy? https://t.co/Im3iNbKUq5"]["ICYMI: I was on @ksfrnews to talk about my #TechTransfer bill that will help grow the economy in #NM. https://t.co/rOQ0C7aX0W"]["Instead of focusing on latest #TrumpCare attempt we should be working on bipartisan stabilization effort that would actually help Americans."]["@SenatorTomUdall @RonWyden @SenBennetCO @SenMarkey @repbenraylujan #MiningReform will ensure that mining companies pay their fair share &amp; prevent future disasters like #GoldKingMine spill that devastated #NM"]["@SenatorTomUdall @RonWyden @SenBennetCO @SenMarkey @repbenraylujan Water is our most precious resource. We can't stand idle while toxic metals are drained into our rivers &amp; drinking supplies. #MiningReform"]["@SenatorTomUdall @RonWyden @SenBennetCO @SenMarkey @repbenraylujan Calling for #MiningReform because toxins leaking out of thousands of abandoned hardrock mines threaten public health &amp; damage our watersheds"]["We introduced a bill to reform antiquated Hardrock Mining Laws. We need #MiningReform so disasters like #GoldKingMine never happen again. https://t.co/jlt80XSDoa"]["Graham-Cassidy is really #TrumpCare 2.0. Every version gets worse."]["Senate Republicans are flying blind. This is basic governance, we need all the facts on #TrumpCare before we vote. https://t.co/UYb9AbAiuG"]["I support #ChildCare4All! Working families in NM deserve to know their children have quality child care, without breaking the bank"]["#ChildCare4All is part of #2gen approach to help families succeed by supporting children &amp; parents together so we can grow our economy."]["In #NM too many families don’t have access to quality early learning &amp; care that will help their children thrive that they can afford."]["#FY18NDAA will bring major benefits to our economy and strengthen New Mexico's position as a leader in national security for years to come."]["Proud to secure key advancements for #NM in #FY18NDAA through my role on #SASC: https://t.co/TPZHvz34jX"]["Denying #ClimateChange is putting us in real danger when it comes to fighting &amp; preventing #wildfires. https://t.co/YZPPqK7syR"]["We should be working together to improve health care so that everyone has lifesaving coverage, #TrumpCare does the opposite."]["Enough is enough. RT to tell Rs to abandon their latest #TrumpCare attempt to strip coverage from millions &amp; sabotage our health care system https://t.co/kamm4m8cjI"]["Unbelievable that Senate Rs want to revive #TrumpCare &amp; force a vote before we know how many will lose coverage &amp; how much people will pay."]["#CassidyGraham would do irreversible harm to NM because it puts #Medicaid on the chopping block by repealing expansion &amp; block granting it."]["This is not a drill. #TrumpCare is back and it’s worse than ever. Keep making your voice heard."]["Investing in early education boosts educational outcomes &amp; strengthens our economy @JECDems @educationweek https://t.co/KNmcAa4G8S"]["We’re urging President Trump to reject this sham report &amp; leave #OMDP4NM #RGDN &amp; all monuments intact. #KeepItPublic https://t.co/x65FuyuySu"]["An attack on one monument is an attack on them all! RT if you want our national monuments kept intact. #KeepItPublic #MonumentsForAll"]["A decision to move forward with these recs would be both exceedingly unpopular &amp; very likely illegal. #KeepItPublic https://t.co/Nk4i6iAKe2"]["#CassidyGraham is just like #TrumpCare: will strip coverage from millions and increase costs for everyday New Mexicans."]["#ClimateChange is real. Removing mention of it from #NM schools stops development of leaders we need to combat it. https://t.co/WixMk7ZZRe"]["I remain strongly opposed to Pres Trump’s border wall. It's an incredible waste of taxpayers’ money &amp; not what #NM communities want or need."]["We need to get to the bottom of Russian effort to influence our election &amp; make sure it never happens again."]["The origins of political ads on social media need to be as transparent as those on TV. @VanityFair: https://t.co/t2Yi0596Hq"]["DYK that #NM is the 2nd largest producer of pecans in the U.S.? This industry is vital to our state’s economy. https://t.co/e3gJW4HpaN"]["I’m #WithDREAMers &amp; will continue calling for the passage of the #DREAMact"]["RT if you agree: Every student in every school deserves a quality education. https://t.co/z9kx0qyTRc"]["With the deep uncertainty #DREAMers now face, it is clear that Congress must finally pass the #DREAMAct into law. https://t.co/hSi6AnJY6B"]["This is incredible. @CassiniSaturn has been on a remarkable journey for 20 yrs &amp; is nearing its grand finale. https://t.co/o65aFOVveh"]["Yes. Americans deserve these answers. https://t.co/9IdCFeoQtl"]["Read my op-ed in the @DailyLobo about how a prosperous future for #NM starts with investing in education. https://t.co/BybHCqqx08"]["#TechTransfer led to founding of @DescartesLabs in #NM &amp; is fueling innovation &amp; economy! @JohnMannes @TechCrunch: https://t.co/Qs22j8rgdY"]["The right to vote is sacred to our democracy. I’m calling for Pres. Trump’s #ShamVoterCommission to be shut down. https://t.co/FJIwtJLvHh"]["Proud that New Mexico is protecting private voter information from the Trump Admin's #ShamVotingCommission https://t.co/wji5tFEKWS"]["I support Senator Gillibrand’s #FY18NDAA Amendment to block President Trump’s ban on transgender individuals serving in the military."]["I join all New Mexicans in mourning the passing of our former Senator Pete Domenici. https://t.co/gDfSeAfbx9"]["Health care is a human right. #MedicareForAll https://t.co/Fq07OQRVKh"]["My bipartisan #TechTransfer bill will improve transfer of innovative technologies from labs to the private sector https://t.co/7tGcxawbmk"]["I support universal health care. Expanding access through Medicare—a program we know already works—is the right path forward #MedicareForAll"]["WATCH LIVE: I’m at @EnergyDems hearing announcing intro of my bipartisan #TechTransfer bill https://t.co/uA5e4ye1J5"]["Congress should fund wildfire fighting the same way we do when other natural disasters strike. @IndefiniteWild https://t.co/sZRziLYdnC"]["Tune-in to today’s @EnergyDems hearing! I’m announcing the intro of my bipartisan #TechTransfer bill: https://t.co/CTAKAGsBVo"]["Wildfires are getting bigger and more destructive. We need to pass a long-term permanent wildfire funding fix. https://t.co/1KhuNRoHqg"]["@JECDems Strengthening broadband access across #NM particularly in rural &amp; tribal communities will improve education &amp; boost economy #TribalConnect"]["We need global policies that enable companies to harness power of the internet. @JECDems hearing on digital trade: https://t.co/TTcC3CmMzE"]["Did you catch the @WSJ profile on #NM chile? It even includes a recipe for Christmas Enchiladas! #AuthenticallyNM https://t.co/KexClNZuFi"]["I join New Mexicans in keeping all those we lost on #September11 and their families in our thoughts. #NeverForget https://t.co/c5LjjHR7DV"]["NMs are standing up to #ProtectDREAMers. Proud to be united with @SenatorTomUdall @RepBenRayLujan &amp; @RepLujanGrisham https://t.co/0H4vtguall"]["Becuase of #DACA Cesar was able to make his dreams a reality by going to medical school. #ProtectDREAMers https://t.co/qMIQnvlVMi"]["Proud to have shared Cesar's story back in 2015. It shows how driven #DREAMers are &amp; how they're giving back #FlashBackFriday https://t.co/gaETITugbn"]["It’s #InternationalLiteracyDay! Reading to kids at an early age puts them on the right track. I want every child in every school to succeed. https://t.co/jHRNaTXYvA"]["WATCH LIVE: I’m receiving @AWEA’s Wind Champion Award &amp; talking about why #WindWorks. https://t.co/jTG9cwrQ8D"]["@RepBetoORourke RT of you agree: No member of congress should be able to rest until #DREAMers can rest easy. #ProtectDREAMers"]["Proud to have @RepBetoORourke leading efforts to #ProtectDREAMers in the House: https://t.co/YWYBOhKYXN"]["That’s why my #ProtectDREAMers bill safeguards #DREAMers’ private info from being used by Trump Admin to deport them https://t.co/bp8kzXGzfq"]["Nearly a million #DREAMers came out of shadows to apply for #DACA &amp; shared their personal info with gov, it shouldn't be used to deport them"]["Thank you #NM Attorney General @HectorBalderas for standing up for #DREAMers in the courts. https://t.co/SdWwYl3Dtv"]["Americans deserve to know how our elections are being influenced online. https://t.co/2ery8nKEV3"]["I’m calling for greater transparency for social media ads influencing American voters: https://t.co/WzLlrv25sJ"]["We're at a critical juncture that begins to show the public for 1st time tactical evidence of how Kremlin sought to undermine our democracy."]["Congratulations on this big win! These New Mexicans made our state very proud at the @NASA #STEM competition. https://t.co/jbw5DVw8Vi"]["As an @AmeriCorps Alum I know that service is invaluable &amp; won’t let National Service programs go extinct. #DinosInDC #LetUsServe https://t.co/U3pNB1ejLD"]["ICYMI: Here’s my interview with @MVNewsLC on my #ProtectDREAMers bill &amp; why I support the #DREAMAct: https://t.co/dnAgNezTUp"]["I'm thankful for the courage of NM's #DREAMers who are continuing to tell their stories &amp; call for the passage of the #DREAMact! #HereToStay https://t.co/AuYQiSWZAo"]["Sec Devos' move to rescind #TitleIX guidelines is a mistake. Survivors deserve better - campus sexual assault needs to be taken seriously."]["Educators are advocating for the swift passage of the #DREAMact &amp; stand #WithDREAMER @EdTrust https://t.co/A6VWfW1kI9"]["Ending DACA is heartless &amp; makes no economic sense. Result: $280 billion in lost tax revenue over the next decade. https://t.co/BRqUcd5R3s"]["Don't think the Russians were working to subvert American elections in 2016?  Think again... https://t.co/1agbluoKsZ"]["If we don’t pass my #ProtectDreamers bill the Trump Administration could use DACA data to target &amp; deport #DREAMers. https://t.co/tb4F3ujFIZ"]["We need to stabilize the #HealthCare market and make sure that everyone can afford and access quality coverage. https://t.co/wMYJ5GL15e"]["I’ll keep working to make sure that every child in every school has strong literacy skills and the opportunity to succeed."]["Only 1 in 3 NM students are proficient in reading. That’s why I’ll continue opposing Trump budget cuts to state &amp; local literacy programs."]["It’s #ReadABookDay! “The Hobbit” is one of our family’s favorite books to read together. What’s your favorite book?"]["September is Monuments to Main Street month in Doña Ana County! Spread the word &amp; join events happening all month: https://t.co/2k5XgN0hJD"]["We’re urging @SecretaryZinke to uphold the agreement to defer all leases on land near @chacoculturenhp. https://t.co/k7M0wLpVQs"]["I’m grateful for #DREAMers like Victor from #NM who are speaking out &amp; telling their stories. We need to pass the #DREAMAct now! https://t.co/PS2KNBT3EW"]["Sportsmen want #PublicLands to remain protected. #KeepItPublic @NMWildlife @JacoOutfitters https://t.co/I5bpBrUf4f"]["Ran into @SecretaryZinke at Migratory Bird Conservation Commission meeting. We’re still negotiating on Sabinoso &amp; national monuments! https://t.co/NQWqgtvWd5"]["My #ProtectDreamers bill would safeguard confidential data from being used to deport #DREAMers https://t.co/bCIvwxemBk"]["I have a message for #DREAMers. Don't give up, because we’ll never give up on you. #DefendDACA https://t.co/fYThGqP517"]["Ahora más que nunca, tenemos que trabajar juntos para aprobar la ley bipartidista #DreamAct para proteger a Dreamers en los Estados Unidos"]["Voy a seguir luchando para los Dreamers y para proteger la promesa que DACA representa para miles de jóvenes en Nuevo Mexico. #DefenderDACA"]["I stand with New Mexico’s #DREAMers. https://t.co/CWrMFy2jZk"]["Appreciated the thoughtful profile by @michaelcoleman on my role on Intel Committee &amp; #TrumpRussia investigation: https://t.co/5tBylWQpzM"]["I will not stand for policies that are contrary to our fundamental American ideals &amp; values. #DefendDACA"]["#DREAMers like Jesus are brave and just want the opportunity to give back to their country. #DefendDACA https://t.co/TnQ81ll4uc"]["DACA works. Every recipient has passed an extensive background check, paid a fee &amp; is a student, service member, or has a job. #DefendDACA"]["America is their home, deporting #DREAMers would be un-American. Now more than ever we need to pass the bipartisan #DREAMAct."]["I’m proud that New Mexicans are standing up to support DREAMers! I #StandWithDreamers https://t.co/BGv03bDivX"]["President Trump is wrong. This is far from over &amp; I won’t stop fighting to protect DREAMers. RT if you’re with me. #DefendDACA"]["Proud to stand up for NM's workers on Labor Day &amp; everyday to give all working families a fair shot at getting ahead https://t.co/x7UsRizlJX"]["President Trump's decision to end DACA protections is a heartless and grave mistake. This fight is not over. I’m #WithDreamers!"]["We will not stop fighting to protect our #publiclands https://t.co/uvNioteLmd"]["Eid Mubarak to our friends and neighbors who are celebrating in New Mexico and around the country. #EidAladha"]["This funding will jumpstart the deployment of directed energy technology and bring more high-paying jobs to NM: https://t.co/8x01NNkp4p"]["I stand w/ New Mexicans in opposition to funding a border wall that is a waste of taxpayers’ money &amp; not what our communities want or need https://t.co/tgKJJKTMoI"]["My #ProtectDreamers bill shields DREAMers’ data from being used by Trump Admin to deport them. #WithDreamers https://t.co/xzB9gAEJbV"]["Ending DACA protections would be a grave mistake. I’m #WithDreamers"]["I know how hard immigrants work, how much they believe in this country, how much they're willing to give back. #WithDreamers"]["DREAMers are our neighbors &amp; friends, they contribute to our economy and just want the chance to contribute to our country. #WithDreamers"]["I stand with Mauricio and the more than 7,000 #DACA recipients in New Mexico https://t.co/NcANkdHZBT"]["We should never be a country that kicks out some of our best and brightest students. #DefendDACA"]["Threats from the Trump administration to end #DACA are heartless and contrary to our fundamental American ideals and values."]["My thoughts are with the families of those who lost their lives today &amp; entire Clovis community as we learn more about this horrible tragedy"]["Stop by my service academy info session tomorrow at @UNM from 6-8pm to talk to military service academy reps &amp; ROTC https://t.co/4FW21mzQ12"]["The Rio Grande Nature Center is a perfect location for bird watching! I participated in the release of a Kestrel &amp; hummingbird. https://t.co/jaI8HRfu3f"]["@EnvNM Thankful for hard work of environmental champions in NM. I stand with you to protect #PublicLands, #CleanAir, water &amp; clean energy future. https://t.co/XVkgQmTTpm"]["I was honored to receive @EnvNM's New Mexico’s Environmental Champion Award at the Rio Grande Nature Center. https://t.co/xrLdy3xp4s"]["I stand with tribes and all New Mexicans in standing up to protect our #MonumentsForAll https://t.co/oJGNwibKaj"]["My thoughts are with everyone affected by Hurricane Harvey. Thank you to the volunteers, emergency personnel &amp; first responders. Stay safe!"]["Happy #WomensEqualityDay! The contributions women have made &amp; continue to make are immeasurable. We’ll keep marching towards full equality. https://t.co/YaRBAD51So"]["President Trump can pardon Joe Arpaio, but he'll always be a criminal."]["Arpaio pardon sends the wrong message to communities who already living in fear."]