["The word is vulgar, but idea that it's ok to write off an entire nation of people is unamerican. Either we're all created equal or we aren't."]["At long last, justice and respect for these tribes who called Virginia home long before the founding of our Nation. I’m honored to have played a part in their fight for recognition and today’s bipartisan victory. https://t.co/41tlpv2iyL"]["This is irresponsible, untrue, and frankly it endangers our national security. FISA is something the President should have known about long before he turned on Fox this morning. https://t.co/LQ9shut53k"]["I’ll take fighting for American consumers for 500, Alex."]["Who are the Senators who just introduced the Data Breach Prevention and Compensation Act?@Jeopardy @SenWarren https://t.co/b5ftKWplJe"]["There’s something morally wrong with arbitrarily threatening #DREAMers with deportation just to achieve the President’s political objectives. #DREAMActNow"]["When you’re as sloppy as Equifax was with Americans’ private data, there’s got to be a price to pay or things like the #EquifaxBreach happen again. My new bill with @SenWarren will make sure credit reporting agencies start taking #cybersecurity seriously."]["Forcing Virginia’s CHIP program to run month to month is not a solution. We need a bipartisan, long-term deal on #CHIP and we need it now.\nhttps://t.co/ARmFpnw9F7"]["Massive data breaches like the Equifax hack cannot be the new normal. Introduced a bill with @SenWarren today to penalize companies that fail to protect your private data from hackers. https://t.co/bxDEvInxWz"]["I stand with the bipartisan coalition to force a vote on #NetNeutrality and am proud to cosponsor the CRA. Together we can stop the FCC’s fatally flawed efforts and restore a #FreeAndOpenInternet. Retweet if you’re in. https://t.co/EMFJT2Jboq"]["We also looked ahead to the future in today’s Banking Committee hearing – dealing with #Cryptocurrency issues like #blockchain and #bitcoin. Stay tuned. https://t.co/RMXCSZkE6J"]["Ambassador Nuland is a top-notch diplomat and foreign policy leader. Looking forward to her leadership at @CNASdc. https://t.co/UgZxlBmIFA"]["Retweet if you agree https://t.co/3YuGnjZnRt"]["If my memory is correct, the President promised that Mexico would pay for his wall. Not the taxpayers, and not at the expense of thousands of #DREAMers facing deportation because of his political games. #DREAMActNow"]["100 days has passed since Congress failed to renew #CHIP funding. Virginia is running out of time for Congress to fix this. #RenewCHIP\nhttps://t.co/aTUZfpJIFc"]["Today marks 100 days since the Republican Congress allowed #CHIP funding to expire. No more excuses. #RenewCHIP now. https://t.co/f3SutnseVc"]["Heartbreaking. This morning there are thousands more stories like this for Virginia’s Salvadoran community, now that the Trump Administration has arbitrarily ended the TPS program for Salvadoran immigrants. \nhttps://t.co/8PtRmfL9NP"]["Congrats Coach Beamer! https://t.co/VuSZBmvciq"]["This is not fake news. This is not a witch hunt. It is a clear and unanimous conclusion that Russia attacked the United States. Frankly I’m astonished that our President has failed to even acknowledge this ongoing threat to our democracy. It begs the question: WHY? https://t.co/1p65WLQBzT"]["You can read the entire ICA report here: https://t.co/LLak67wbuh"]["“We assess Moscow will apply lessons learned from its Putin-ordered campaign aimed at the US presidential election to future influence efforts worldwide, including against US allies and their election processes.”"]["And here’s the conclusion that should give every American pause:"]["“Moscow’s influence campaign followed a Russian messaging strategy that blends covert intelligence operations—such as cyber activity—with overt efforts by Russian Government agencies, state-funded media, third-party intermediaries, and paid social media users or ‘trolls.’ “"]["“We also assess Putin and the Russian Government aspired to help President-elect Trump’s election chances when possible by discrediting Secretary Clinton and publicly contrasting her unfavorably to him.“"]["We further assess Putin and the Russian Government developed a clear preference for President-elect Trump.”"]["“We assess Russian President Vladimir Putin ordered an influence campaign in 2016 aimed at the US presidential election."]["…but these activities demonstrated a significant escalation in directness, level of activity, and scope of effort compared to previous operations.”"]["“Russian efforts to influence the 2016 US presidential election represent the most recent expression of Moscow’s longstanding desire to undermine the US-led liberal democratic order…"]["It’s been one year since our nation’s intelligence agencies announced their UNANIMOUS conclusion that Russia interfered in the 2016 election. Let’s look back at some of the key conclusions:"]["#FF → my new Senate colleagues @SenTinaSmith and @SenDougJones!"]["Virginia parents like Latasha are still waiting on Congress to find a long-term fix for #CHIP. For thousands of Virginia families living paycheck to paycheck, Congress’ failure is not an option. \nhttps://t.co/V3dg4PZFDG"]["Look I don’t often agree with Steve Bannon, but we should all be able to agree that if a foreign adversary approaches you with dirt on a political opponent, any true patriot would alert the FBI immediately. #MTPDaily https://t.co/aiqntI3M1Y"]["Proud to announce the passage of legislation with @CoryBooker, @TimKaine, @RoyBlunt &amp; @BobbyScott creating a commission to tell the 400-year story of African-American history. \nhttps://t.co/ihfbz3ml9t"]["With the power to spark a nuclear war that would annihilate millions of people, comes the great and sober responsibility to prevent it at all costs. This is not just a tweet. It’s a complete disregard of the President’s duty as Commander-in-chief. https://t.co/iQBhDO7Led"]["Slandering the Department of Justice’s career law enforcement and intel professionals as the “deep state” —whatever that actually means —  is dangerous and unpresidential."]["It’s 2018. Congress needs to stop kicking the can down the road and finally cut a long-term deal to fund #CHIP.  \nhttps://t.co/CCBXf7sRtp"]["Wishing everyone in the Commonwealth a happy new year!"]["There’s no excuse for poor governing.\nhttps://t.co/Fy4nfeVyyC"]["FACT: The party that controls both houses of Congress and the White House has failed to #RenewCHIP for 82 days. No more excuses. Fund #CHIP now."]["I hope my concerns are unfounded, but there are troubling signs.  It is critical that we as elected officials, and as citizens, speak up against these threats now…before it is too late."]["Congress must make clear to the President that firing the Special Counsel, or interfering with his investigation by issuing pardons of essential witnesses, is unacceptable, and would have immediate and significant consequences."]["In the United States of America, no one is above the law. Not even the President."]["Firing Mr. Mueller or any of the top brass involved in this investigation would call into question this Administration’s commitment to the truth and the rule of law."]["While the President has said he is not considering removing Special Counsel Mueller, the President’s track record on this front is a source of concern.  I’m certain many of my colleagues believed that he wouldn’t possibly fire Mr. Comey, either."]["These statements are reckless. They are inappropriate. And they are extremely worrying."]["In recent weeks, a growing chorus of voices in Congress, the media, and the White House have begun pushing a coordinated narrative undermining the credibility of the Special Counsel’s investigation and the FBI itself."]["Any of these actions would be a gross abuse of power and a flagrant violation of Executive branch responsibilities and authorities. These are red lines, and we simply cannot allow them to be crossed."]["That means:\n \n- Firing Robert Mueller or top FBI or DOJ brass overseeing the investigation.\n\n- Pardoning key witnesses in an effort to shield them from accountability\n\n- Any other attempt to shut down the investigation"]["It's time to draw the line: any attempt by President Trump to interfere with Special Counsel Robert Mueller's investigation would provoke a constitutional crisis."]["I'm speaking on the Senate floor right now about the future of Special Counsel Robert Mueller’s investigation. WATCH: https://t.co/aYOZK0hf4Q"]["This afternoon, I will speak on the Senate floor about the future of Special Counsel Robert Mueller’s investigation. Tune in at 4:30 pm: https://t.co/aYOZK0hf4Q"]["The fact of the matter is that if Congressional Republican leadership would just #RenewCHIP, instead of using it as leverage in budget negotiations, 68,000 Virginia families could rest easy.\nhttps://t.co/NhoLYkcMwY"]["My statement on the #GOPTaxScam https://t.co/hHalhJcUSD"]["Fact check: True\nhttps://t.co/p0lrYkL4MK"]["❌ The President won’t personally benefit from this.\n \nProve it."]["❌ This is the biggest tax cut in U.S. history\n \nIt’s the fourth largest, behind @BarackObama’s 2012 extension of the Bush Tax cuts, the 2010 Obama tax cut, and the 1981 Reagan tax reform. https://t.co/J7fNIFH7pr"]["❌ The bill will create American Jobs\n \nThe bill has major loopholes that will make it easier to ship American jobs overseas. https://t.co/3KzaauTVwg"]["❌ Businesses will use their tax cuts to raise wages, create jobs, and reinvest\n \nCompanies are openly promising to pass these gains on to shareholders. Some have already started. https://t.co/B6lZIS9pTZ"]["❌ The tax bill is primarily a middle-class tax cut.\n \nNot even close. https://t.co/PFeeGHZZ2W"]["❌  It will be “rocket fuel” for the economy\n \nThe nonpartisan @jctgov &amp; economists agree; any boost to the economy will be minimal. Still waiting for the administration to provide analysis disputing this (or any @USTreasury analysis for that matter)  https://t.co/LRovFd93dU"]["❌ The tax bill will pay for itself\n \nIt brings back trillion-dollar deficits and adds over $2 TRILLION to the debt. https://t.co/FTBE2kbnkq"]["The Republican tax bill we’re voting on tonight is built on a foundation of broken promises. Some examples:"]["Give taxpayers some credit: they were promised deficit-neutral, middle-class tax relief you could file on a postcard, and they’re getting a massive giveaway for big business and the wealthiest Americans instead. https://t.co/9TazEUDjhh"]["The standard Republican defense of their wildly unpopular tax bill boils down to “taxpayers just don’t understand the bill yet.” https://t.co/tbnuyNG37Z"]["Sending congratulations and best wishes to Col. Flaherty. Proud to have appointed you and grateful for your decades of service to the Commonwealth. https://t.co/zhS0poNeCA"]["This is why you don’t rush through major legislation. We’re going to be cleaning up this kind of sloppy legislating for years to come. https://t.co/7kmFpM00ra"]["A lot Democrats, myself included, could have gotten on board with bipartisan #TaxReform, but that was never the GOP plan. No hearings, no bipartisan negotiations or outreach. It’s shame…we could have gotten this right. https://t.co/645McybjpG"]["The House of Representatives just passed a partisan tax cut for big business and the wealthiest Americans. Taxpayers were promised a “middle-class miracle,” not trillion-dollar deficits and a tax increase for millions of middle-class Americans. #GOPTaxScam"]["This should be a deal-breaker on both sides of the aisle. https://t.co/wVUn02JyX3"]["Taxpayers deserve better. https://t.co/9BJpCewW6O"]["Today’s bipartisan vote against his nomination is a strong signal to the Trump Administration that it should withdraw this nomination &amp; put forward a qualified nominee who understands the important role #ExIm Bank plays in leveling the playing field for U.S. companies overseas. https://t.co/qp7IK6uOqi"]["In order for U.S. manufacturers to compete in a global economy, we need a fully functional Export-Import Bank. Rep. Garrett’s long record of attacking and undermining the #ExIm Bank means he’s not fit to lead it. https://t.co/RQxEjA0lOw"]["This is the tax bill that was rewritten last week and dropped at 5:30 on a Friday. #VoteNo #GOPTaxScam https://t.co/beHkFOpwGs"]["Reminder that the #GOPTaxScam will also undermine the health insurance market, causing premiums to spike in coming years. https://t.co/PqkLa3pjAY"]["Every day, ~122 #DREAMers lose their legal status. These young people can’t wait any longer for Congress to #ProtectDREAMers. #DREAMActNow https://t.co/9nJdlHUzIw"]["Excited to be a part of this new effort to spur entrepreneurship in #SWVA and across the Commonwealth. #VA4E\nhttps://t.co/XGeyMvBcai"]["Must-read @WSJ: “U.S. fuel makers are poised to reap billions under a sweeping Republican overhaul of the tax code. But don’t expect them to expand, go on a hiring binge, or lower prices at the pump.”\nhttps://t.co/8ybUl7YLXe"]["Forcing smart, hardworking #DREAMers to take their talents elsewhere is a terrible business decision for our country. It’s also just plain wrong. https://t.co/tlgcXiEITV"]["NEW: @BudgetHawks projects that the updated Republican tax bill + its budget gimmicks will add over $2 TRILLION to the #NationalDebt. #GOPTaxScam https://t.co/FTBE2kbnkq"]["#DREAMers aren’t asking for special privileges. They’re asking for a shot at the American dream. #DREAMActNow https://t.co/XUzVhJsurZ"]["Unfortunately some parents have good reason to be worried. Republican leadership has been unwilling to fund #CHIP since funding expired in September. #RenewCHIP\nhttps://t.co/iD0po3myWI"]["Virginia’s kids who count on #CHIP for their healthcare are running out of time. We must #RenewCHIP now.\nhttps://t.co/nDFdNYojzo"]["Amen! #DREAMActNow\nhttps://t.co/GUwDlQNQe4"]["Another week has passed. That’s another week of Congress failing to act on #CHIP. The time to #RenewCHIP is now."]["Did you procrastinate on signing up for health insurance? That’s OK. You’ve still got until 11:59pm ET tonight to #GetCovered at https://t.co/TEvyCTtM0W"]["Senate Republicans just released their final tax bill at 5:30 on a Friday. It’s almost like they don’t want you to know what’s in the bill. #GOPTaxScam"]["Happy #BillofRightsDay! https://t.co/HV8lX8oxtg"]["Hey it’s Senator Warner’s staff. Today is his birthday, so we surprised him with a birthday party yesterday. Check out the video and RETWEET to wish @MarkWarner a happy birthday! https://t.co/GHIx9bk7Pq"]["There really is one of these for everything. https://t.co/J5fu17VI4B"]["As of today, 12,156 #DREAMers have lost their #DACA status. They’re now facing deportation because of Congress’ failure to act. #DreamActNow"]["TOMORROW is the last day to #GetCovered during Open Enrollment 2017. Visit https://t.co/TEvyCTLnpw today."]["WE’RE BUILDING A WALL AND CUTS TO COUNTERTERRORISM FUNDING AND A BORDER PATROL PAY FREEZE ARE GOING TO PAY FOR IT\nhttps://t.co/a77P1lTF27"]["This year I drew @SenatorEnzi for the annual Senate Secret Santa, and what you need to know about Mike is that he’s a big fly fisherman. With these handmade flies from @Murraysflyshop in Edinburg, Va, I’m sure he’ll catch a big one. https://t.co/JIweHCrZ77"]["En camino a la Cámara del Senado para apoyar a los 12,000+ DREAMers que yo represento en Virginia. ¡Debemos pasar el Dream Act ya! #DREAMActNow"]["Headed to the Senate floor to stand with the 12,000+ Virginia #DREAMers I represent. We must pass the #DREAMActNow."]["What? https://t.co/Vx3PpStpKu"]["Today marks 5 years since the tragedy at #SandyHook, and unfortunately, 5 years of inaction on the issue of gun violence. Congress must come together on common-sense measures like universal background checks, which the vast majority of Americans support. It’s time for this to end https://t.co/1x6cFrcneb"]["The #GOPTaxScam actually encourages companies to ship American jobs overseas. It’s anti-worker. It’s anti-middle class."]["No. Anyone who engages in this kind of baseless slander owes the hardworking career law enforcement and intel professionals at the FBI an apology. Those in the media and the halls of Congress who give it a platform should be ashamed. https://t.co/nsDocZkQBf"]["Same goes for the people who work at federal agencies in Va that support farmers, miners, wounded warriors, and more. The unfair, arbitrary attacks on federal employees need to end."]["If people in the White House want to freeze people's salaries, they should start with their own, or members of Congress', but leave these hardworking Virginians out of it. They're busy keeping us safe. https://t.co/iTfNuq75GM"]["And we're home to the Pentagon, the National Guard Bureau, DARPA, and the civilian departments that support our men and women in every branch of uniformed service."]["We're home to the US Marshals, TSA, DEA, and the National Cybersecurity &amp; Communications Integration Center who pursue everyone from fugitives, to drug smugglers, to would-be terrorists, to cybercriminals."]["Virginia is home to the CIA, National Counterterrorism Center, Army Intelligence and Security Command, National Reconnaissance Office, National Geospatial-Intelligence Agency, Office of the Director of National Intelligence - who protect us from foreign threats and terrorism."]["Senator McConnell should practice what he preached in 2010. https://t.co/mw1fkpKi88"]["Today is the @USNationalGuard’s 381st birthday. Thank you to Virginia’s Guardsmen and all the citizen soldiers who’ve answered the call to serve. #Guard381 https://t.co/SaGbymCgbb"]["Los Virginia #DREAMers que yo represento no conocen otra patria más que a nuestro país. Ellos son tan Americanos como yo. #DREAMActNow"]["The #DREAMers I represent grew up in Virginia and know no other home but the United States. They’re every bit as American as I am. #DREAMActNow"]["The Commonwealth lost a great public servant in Rev. Curtis Harris. He was a civil rights icon, a great Virginian, and my friend. Rest in peace, Mr. Mayor. https://t.co/G5wE4Or7nW https://t.co/D7KqgySMnK"]["#DREAMers aren’t bargaining chips. \n\nThey aren’t an abstract problem for Washington to fight over. \n\nThey’re people, they’re our neighbors, and Congress needs to do right by them. \n\n#DREAMActNow"]["Pleased that the DOJ has brought the hackers behind the Mirai Botnet to justice. I’ve been sounding the alarm on this for over a year, and much more work remains to secure the highly vulnerable #IoT devices that made Mirai possible. #IoTSecurity https://t.co/LzO8dXHPbM"]["Written in secret, passed in the middle of the night, finalized behind closed doors, and now being rushed to a final vote: the #GOPTaxScam is Swamp 101."]["This fight is not over. RETWEET if you’re all in to stop the #GOPTaxScam. https://t.co/3EFugNsH27"]["2010 wasn’t that long ago. I remember when Harry Reid honored the GOP request to hold off on voting on major legislation until the new Republican Senator was seated. Senator McConnell should do the honorable thing and allow @GDouglasJones to vote on the tax bill."]["I suspect if more members of Congress actually met the #DREAMers from the communities they represent, we could have passed the #DREAMAct by now."]["ROLL TIDE"]["Wishing a very #MerryChristmas to the @GirlScouts and Brownies from Haymarket, Va who stopped by my office to sing Christmas carrols today! https://t.co/GKYLu6waKH"]["If there’s one thing we should be able to agree on, it’s that we shouldn’t make it easier to ship American jobs overseas.\nhttps://t.co/3KzaauTVwg"]["Virginia’s kids are running out of time. Congressional leadership needs to focus on funding #CHIP now. #RenewCHIP https://t.co/EtBZEIE71F"]["This is not a good sign. #GOPTaxScam\nhttps://t.co/L2g0GgXNAN"]["This doesn’t pass the smell test. https://t.co/Kp5GQnRp1A"]["Today is a scary day for a lot of families in Virginia, and it was completely preventable. https://t.co/HTg6lbcLhl"]["Thousands of Va families are being notified that their kids who are covered by #CHIP could lose their insurance if Congress fails to act by January 31st. GOP leadership needs to make this a priority. We shouldn’t go home for Christmas until we #RenewCHIP."]["THIS is why our bipartisan bill is so important. Banking regulations should keep Wall Street in check. They shouldn’t hurt Main Street. https://t.co/WgjbVbKJyA"]["This year’s Warner office Christmas tree is a Virginia Fraser Fir. The front office is looking festive! https://t.co/kHXpt8XikZ"]["Congress could have fixed this months ago. Instead, we’ve spent months trying to repeal healthcare and give the wealthy a tax cut. https://t.co/V5GDopPn07"]["A one-page “analysis” of a major rewrite of our tax code (which doesn’t actually analyze the effects of the bill). Seriously. https://t.co/2vPeiJUDuH"]["I’m frankly dumbfounded by the Treasury Department “analysis” projecting fantasy-level economic growth based on bills and executive orders that haven’t even been written yet."]["Congress is finding time to give tax cuts to the wealthy, but not to #ExtendCHIP or pass the #DREAMAct. Why?"]["There’s no reason to put these young entrepreneurs out of business. We must pass the #DREAMActNow.\nhttps://t.co/9w5EmfMULj"]["AMEN! These four Governors, Republicans and Democrats, are calling on Congress to #RenewCHIP for nine million kids. @OregonGovBrown, @MassGovernor, @GovSandoval @GovernorBullock\nhttps://t.co/PXsBhgkZb0"]["The #DREAMAct is a bipartisan bill. House and Senate leadership should allow a vote. #DREAMActNow https://t.co/S6PYZKWC5i"]["Reminder that we still haven’t seen a single analysis backing up the Republican claim that their tax bill won’t increase the deficit. #GOPTaxScam"]["He’s not wrong. https://t.co/q0ifgGJwrF"]["President Trump should extend the #OpenEnrollment deadline and allow bipartisan efforts to bring down premiums for Virginia families. https://t.co/zVhjPM2rHg"]["Congress is treating #CHIP like another political football. This is about our children. #ExtendCHIP https://t.co/hkAaJjEMXw"]["My statement on Senator Franken's resignation: https://t.co/pzfQe6rMEg"]["December 7, 1941—a date which will live in infamy. Remembering the bravery and sacrifice of those who served at #PearlHarbor. https://t.co/QYh6GxEyyS"]["They should be ashamed. We should work even harder to make sure people know about #OpenEnrollment\n \n#GetCovered at https://t.co/TEvyCTLnpw by Dec. 15 and RETWEET to spread the word https://t.co/Xttwq15jmA"]["Wishing a happy #NationalMinersDay to my @MineWorkers friends from #SWVA. I’m going to keep up the fight to save the pensions of Virginia’s miners and their families. https://t.co/mepehCfsxJ"]["Taxpayers deserve better than this.\nhttps://t.co/mynypHSj5o"]["Congress shouldn’t go home for Christmas without funding #CHIP. @TimKaine and I are calling on Senator McConnell to #ExtendCHIP as a part of any year-end spending deal. https://t.co/MVQA2ggqU7"]["This tax cut won’t pay for itself, and no amount of wishful thinking or fantasy economics will change that. https://t.co/AjMiBw7lof"][".@timkaine and I have been fighting for months to get Congress to renew #CHIP. The leadership in Congress and in the White House need to step up and work with us to #ExtendCHIP for thousands of kids here in Virginia.\nhttps://t.co/FOi9ZJ20WN"]["Virginia’s community banks and credit unions didn’t cause the financial crisis. They’re the ones who actually lend to local small businesses and homebuyers. Our bipartisan bill makes sure rules meant to keep Wall Street in check don’t hurt Main Street. https://t.co/oyLZt3F2dz"]["Our bill will help students make informed decisions about their higher education and student loan options. The data is out there. Let’s empower students to use it.\nhttps://t.co/uGAzSfYGvt"]["A tax bill that hits places like Roanoke just to pay for tax cuts benefiting the rich and corporate shareholders is a bad bill. https://t.co/3zCl3XPY9N"]["I’m looking forward to this morning’s hearing, and I'm proud of the bipartisan work by @MikeCrapo, @SenatorTester, @SenatorHeitkamp, @SenDonnelly and a number of Senators on both sides of the aisle. This is how good legislation gets done."]["Importantly, we’re talking about small banks and credit unions — the ones who do the majority of lending to small businesses, especially in rural communities — not big Wall Street banks: https://t.co/uFDVwekOnA"]["Remember how mad we all were when millions of Americans had to pay out of pocket to freeze their credit following the #EquifaxBreach? This bill guarantees one free credit freeze per year."]["This bill cuts red tape that’s holding back consumer and small-business lending. It also strengthens consumer protections, particularly for veterans, and leaves Dodd-Frank consumer safeguards intact."]["Today the Senate Banking Committee will consider our bipartisan regulatory reform bill, which helps smaller community and regional banks focus on what they do best: lend to small businesses and homebuyers, especially in rural communities.\nhttps://t.co/XDiMidqP1y"]["The @CFPB Payday Lending Rule is simple and effective: if the borrower can’t afford to pay back the loan, the lender can’t make the loan. This bill undermining the rule is bad news for consumers. #DefendCFPB\nhttps://t.co/uydlxVB8DO"]["Chairman Pai should investigate reports of bots posting fake public comments before any vote on #NetNeutrality https://t.co/lk5YZ8Usuy"]["Every day Congress procrastinates on #CHIP, the worse the situation gets for millions of kids in Virginia and across the country. We must #ExtendCHIP.\nhttps://t.co/zqieRqsqkD"]["Your government hard at work\nhttps://t.co/SC6MBhl41H"]["This does not need to be a partisan fight. This can be a moment where Congress rises to the challenge and does the right thing for 800,000 #DREAMers currently in limbo. #DREAMActNow\nhttps://t.co/uomnnNgwhU"]["@RobJonesJourney @timkaine Learn more about @RobJonesJourney: https://t.co/q5bdZHImeT"]["I don’t know that I’ve ever met anyone as impressive and inspiring as Rob Jones, a Marine vet from Lovettsville, Va. He just finished running 31 marathons in 31 days (!) to raise money for his fellow veterans wounded in combat. https://t.co/ziiCl3vOSR"]["Earlier this week I held a town hall with employees at @ODNIgov. As vice-chair of the Senate Intel Committee, it’s important to listen to the men and women on the front lines of our nation’s intelligence efforts. https://t.co/2wMPQywg5G"]["What happened tonight is a disgrace."]["Even if Senate Republicans had written this bill through regular order — which they didn’t — it wouldn’t have mattered. Leadership rewrote the bill this afternoon and dumped the crumpled, handwritten bill text hours before the vote."]["This was a wasted opportunity to do once-in-a-generation, bipartisan tax reform. Instead, Senate Republicans passed a partisan bill tonight that cuts taxes for wealthy on the backs of the middle class and leaves our children with $2.2 trillion in debt."]["https://t.co/DcPbAxyKRU"]["I guess if you’re going to raise taxes on the middle class and increase the national debt by $2.2 trillion, this is how you do it. https://t.co/SvFh5aYEyq"]["This is how we’re writing legislation now? https://t.co/kfy7yghtJA"]["It was a great honor to meet with His Majesty King Abdullah II of Jordan, a steadfast ally and a valued partner to our intelligence community. https://t.co/GBhfmFy3xV"]["The deficit isn’t some abstract concept. The #GOPTaxScam’s trillion-dollar increase to the deficit will have serious, immediate consequences for millions of Americans. https://t.co/JkoFUsqnks"]["Well we still don’t have the final text of the bill. https://t.co/a6eA9NNNOB"]["The Senate Select Committee on Intelligence takes seriously our responsibility to continue a thorough, bipartisan probe that follows the facts wherever they may lead."]["Members of Congress from both parties must make clear that those actions would be fundamentally unacceptable and incompatible with the rule of law."]["It's part of an alarming pattern in which POTUS has already fired the FBI Director; pressured the AG &amp; top intel officials to interfere w/an ongoing investigation; &amp; contemplated issuing pardons for his associates or firing the special counsel, according to numerous press reports"]["This guilty plea also comes on the heels of a new report about the President’s efforts to silence the independent, bipartisan Senate investigation into ties between Trump associates and Russia."]["Mike Flynn has pled guilty to criminal conduct, while he was serving as National Security Adviser to the President of the United States, involving his contact with Russian officials."]["The Special Counsel’s probe has found illegal behavior stretching into the senior most levels of the White House."]["BREAKTHROUGH: After years of working with @TimKaine, @GerryConnolly, @RepDonBeyer, &amp; @EleanorNorton, the @NatlParkService has secured funding to completely repair and rehabilitate Arlington Memorial Bridge. Construction is ready to begin! https://t.co/VmOoEKRBmy"][".@AARP sounding the alarm: the #GOPTaxBill could raise taxes on as many as 5 million seniors. #KillTheBill https://t.co/5yHa0P9M8g"]["Gov-Elect @RalphNortham came by today: really looking forward to continuing to work together for our fellow Virginians! https://t.co/NkQSctYAzY"]["I always want to hear from Virginians, especially on something as important as taxes. Don’t let anyone tell you that your calls, your letters, your voices don’t matter. https://t.co/eeIBzsA2Xj"]["Real #TaxReform doesn’t leave 156 million households behind https://t.co/nVOkxlebT1"]["Tax cuts DO NOT pay for themselves. https://t.co/muiMrFUTjv"]["Retweet if you oppose raising taxes on the middle class https://t.co/6Y3xJ4UGK0"]["We owe it to the American people to do #TaxReform the right way. A partisan bill that raises taxes on the middle-class, ships jobs overseas, and grows the debt by $2.2 trillion is a missed opportunity. https://t.co/wOBxjMpVsn"]["This is also what CEOs have been telling their shareholders for months. https://t.co/lrZEQ8kPnJ"]["Do you need health insurance or want to change your plan? #GetCovered at https://t.co/TEvyCTLnpw by December 15th. https://t.co/5F6ZVStVUy"]["Tonight Senate Republicans voted to move forward on a partisan bill raising taxes on millions of middle-class Americans - no hearings, no text, no score, and it’s not paid for."]["Bipartisan momentum for the #HonestAds Act continues to grow. Thank you, Congressmen. https://t.co/gQBAyNPHtT"]["Our bill is a win for students &amp; families, creating new tools to help them make informed decisions about how to spend their money while protecting student privacy. https://t.co/HbJnkKvKzD"]["Check this out: @UVA grad students earning their PhDs in everything from nursing to religious studies to astronomy are speaking out about the #GOPTaxBill. Taxing higher education to death is bad for all of us. https://t.co/H9vT0M3n13"]["It’s not too late to do bipartisan #TaxReform that doesn’t explode the deficit and actually helps the middle class. It’s not too late.\nhttps://t.co/NHIUdcIKn7"]["This as the Senate prepares to vote on a tax bill that increases the national debt by $2.2 trillion. https://t.co/2vLv76QBFH"]["Fortune 500 CEOs say they’ll pass the gains from corporate tax cuts on to investors — not workers.\n \nWe should believe them.\n \nhttps://t.co/8GjVZKM5lw"]["This is what’s so disappointing about the one-party approach Senate Republicans have chosen on taxes. Bipartisan ideas to help places like Appalachia never made it past the closed doors.\nhttps://t.co/0GSDlFCvlh"]["@Sen_JoeManchin @SenatorHeitkamp @SenDonnelly @SenAngusKing @clairecmc @amyklobuchar @RonWyden @SenatorHassan @SenGaryPeters @ChrisCoons I’m here to be a part of the solution, and so are enough of my Democratic colleagues to pass a bipartisan deal. I hope we can find willing partners on the other side of the aisle."]["@Sen_JoeManchin @SenatorHeitkamp @SenDonnelly @SenAngusKing @clairecmc @amyklobuchar @RonWyden @SenatorHassan @SenGaryPeters @ChrisCoons There’s a path forward here on middle-class tax cuts, a lower corporate tax rate, and a simpler tax code that doesn’t explode the deficit. It’s not too late to start over and get this right."]["@Sen_JoeManchin @SenatorHeitkamp @SenDonnelly @SenAngusKing @clairecmc @amyklobuchar @RonWyden @SenatorHassan @SenGaryPeters @ChrisCoons There’s a good reason Senate Republicans are having a tough time getting the votes for their current bill: it raises taxes on the middle class, relies on irresponsible budget gimmicks, and adds $2.2 trillion to the national debt. https://t.co/BzGQ79G3Bc"]["@Sen_JoeManchin @SenatorHeitkamp @SenDonnelly @SenAngusKing @clairecmc @amyklobuchar @RonWyden @SenatorHassan @SenGaryPeters @ChrisCoons Not only is there still time, but I honestly believe it will be easier to cut a bipartisan deal with 60 or 70 votes than a partisan deal that only gets 50 Republican votes."]["Today I stood with 16 fellow moderate Democrats who have a proven track record of bipartisan work. Our message is simple: it’s not too late for real, bipartisan tax reform. https://t.co/5c7mZZns1m"]["RIP fiscal responsibility https://t.co/hvzyNGIZKd"]["The Senate Budget Committee just voted — without debate — to increase the national debt by $2.2 trillion, all to pay for tax cuts for large corporations and the wealthiest Americans."]["A vote for the #GOPTaxBill is a vote for trillion-dollar deficits and a ballooning national debt."]["Idea: write a tax bill that helps small manufacturing businesses instead of hurting them.\nhttps://t.co/XJB4LMRUCv"]["There is no defense for raising taxes on people making under $30,000 per year. None.\nhttps://t.co/xI1i61YLU2"]["This crisis was 100% avoidable, and now kids are starting to pay the price for Congress’ failure. We must renew #CHIP now.\nhttps://t.co/nRmgnyjicV"]["It’s no secret: the #GOPTaxBill will increase the debt by $2.2 TRILLION.\nhttps://t.co/WScKcs14r1"]["Consumers deserve answers about Uber’s massive data breach and the months it took the company to notify customers and drivers. My letter to Uber’s CEO: https://t.co/YTMQlIZHDM"]["This is what fighting for main street looks like. And this is what the Trump Administration is trying to shut down. #DefendCFPB https://t.co/W6eDNaLbJY"][".@CFPB is an independent consumer watchdog. Appointing a part-time acting director who reports directly to the President in his day job defeats the purpose of the CFPB, and that’s no accident. #DefendCFPB"]["Since Day 1, the main criticism of the @CFPB is that it’s *too effective* at standing up for consumers. That speaks volumes. https://t.co/21cdhQX3G6"]["Eliminating the Historic Tax Credit helps no one, hurts cities and towns across Virginia https://t.co/j2FTZwvsi8"]["People are only beginning to realize just how bad the #GOPTaxBill is going to be for America's seniors\nhttps://t.co/9HBZkvg4h2"]["Happy #AircraftCarrierMonth2017! Thank you to our @USNavy sailors serving around the world and to the hardworking @AircraftCarrier shipbuilders in Hampton Roads. https://t.co/YKQEISs2qM"]["I'm thankful for my family, friends, and the daily privilege of serving my fellow Virginians in the Senate. From my family to yours, happy Thanksgiving!"]["Indefensible\nhttps://t.co/XHd2e3TJ6m"]["Yesterday’s vote on the House #GOPTaxBill was a direct hit to investment in Virginia’s infrastructure.  This is going to make infrastructure costs skyrocket in Northern Virginia and across the Commonwealth.\nhttps://t.co/kuMxDynF60"]["This means fewer scientists, fewer engineers, and more student debt\nhttps://t.co/VcEoDU1oSe"]["Shameful. Jamming through major legislation with late-night, party-line votes isn't how Congress is supposed to work. Cutting taxes for corporations and the wealthy on the backs of the middle class (and sabotaging the healthcare market) is wrong on every level. https://t.co/kB4DZdTCxB"]["Only 30 Days left in Healthcare Open Enrollment 2017. #GetCovered by December 15th at https://t.co/TEvyCTLnpw https://t.co/1WjbiRoE8S"]["The \"Corporate Tax Cut, Stock Buyback and Debt Repayment Act\" didn’t fit as well on the bumper sticker https://t.co/OTapxRLu1Q"]["The House just passed its partisan, anti-middle class #GOPTaxBill. It’s bad for Virginia. It’s bad for America. And the Senate version is even worse. I’m going to fight with everything I’ve got to stop it. https://t.co/HAjjcetfi8"]["Statement on Senator Franken: https://t.co/VC8iic8Edc"]["Let’s be clear. It’s not just that tax cuts for working families will expire. This is a tax increase. https://t.co/RUzsf6Oil7"]["Wow. Brand new study shows #GOPTaxBill will INCREASE taxes on families making under $75,000 starting in 2027. I think I know why the Finance Committee postponed its markup this morning. https://t.co/LJujhD5Aa2"]["When I met Gloria a couple weeks ago, she was excited to graduate law school &amp; serve her fellow Virginians. We can’t waste that kind of potential. We must pass the #DREAMActNow\nhttps://t.co/qkhTF4MWcR"]["I withdraw my previous comment about not understanding why they’re rushing through the #GOPTaxBill https://t.co/6Oq60yIHwC"]["Taking a quick break to remind everyone that the Senate Finance Committee is, for no good reason, rushing through the #GOPTaxBill rather than extending #CHIP. https://t.co/gEFJjtKsrz"]["At a bare minimum, #TaxReform should make it harder for companies to ship jobs overseas. The #GOPTaxBill actually increases the incentives for companies to move offshore."]["Here’s a map of all the Virginia cities and towns revitalizing their downtowns thanks to the #HistoricTaxCredit. The #GOPTaxBill would get rid of it. https://t.co/dNQBhSGpYM https://t.co/fixUTO9QTq"]["Held up an official @USCBO letter in today’s Senate Finance hearing showing the #GOPTaxBill will cut Medicare by $25 BILLION next year. GOP responses ranged from crickets to “nuh-uh” https://t.co/z3IrGZRzWC"]["All morning Republicans have claimed the #GOPTaxBill doesn’t cut #Medicaid. Then where the heck did you get $300 billion last night to make corporate tax cuts permanent??"]["The #GOPTaxBill is Swamp 101 https://t.co/CfoiD78rvx"]["Good morning. Overnight, @GOPFinance rewrote its tax bill to sabotage the healthcare market &amp; raise premiums by ~10%/year. Big tax cuts for businesses &amp; the wealthy are still in there."]["Misplaced priorities. https://t.co/mbL9tGTUpF"]["Don’t wait. #GetCovered at https://t.co/TEvyCTLnpw by December 15th. https://t.co/0eM1J6MdVC"]["Wrong, wrong, wrong. Making it harder for students and workers to get a degree or learn a new skill is anti-worker and anti-middle class. https://t.co/JYDKUlpg1m"]["Americans are starting to learn this isn’t the middle-class tax cut they were promised.\nhttps://t.co/6k9lOeL9qD"]["#TaxReform should grow the economy, not the national debt. This partisan tax bill might be great for shareholders, but the benefits aren’t going to trickle down to workers, and our grandkids are going to get stuck with the bill. https://t.co/jGioQorOfN"]["Proud to be a part of this bipartisan reform deal. Big relief for consumers, veterans, rural communities, and community banks. https://t.co/cFs7tAv2JK"]["President Trump made a promise to the people of Tangier Island. He’s got to follow through on that promise. @timkaine https://t.co/jojLsnvQGO"]["Great to see candidates embracing #HonestAds. Now Congress must take action to increase transparency and secure our elections. https://t.co/TVX3TByK8h"]["Today is #CaregiverAppreciationDay. Unfortunately, the GOP’s partisan tax plan eliminates the exact deduction used to cover in-home care for seniors &amp; people with chronic illnesses.\nhttps://t.co/wGpJQKRJza"]["Must-read @DailyBeast op-ed from @KHobertFlynn of @CommonCause on the #HonestAds Act: “Congress: It’s Time for You to Do What the Tech Giants Refuse To” https://t.co/Dm9xBw22fv"]["JUST RELEASED: Called on @FEC to take immediate action to improve transparency for online political ads. @AmyKlobuchar, @clairecmc, and I led a group of 15 senators in submitting an official public comment on the FEC’s online ads rules. #HonestAds https://t.co/Ok7s4Pvfem"]["Just one of the many ways the GOP tax plan hurts Virginia. This is the last thing cities and towns like Staunton who are revitalizing their downtowns need. https://t.co/0zdGDQnv2G"]["Today and every day, I’m grateful to our fellow Americans who answered the call to serve. Thank you for your sacrifice and service to our country, and happy Veterans Day! https://t.co/MLeLG3YtGZ"]["Happy birthday to the @USMC! #SemperFi https://t.co/lcSSD8Y3hJ"]["The House GOP tax bill is anti-growth and anti-middle class. I’d tell you what I think about the Senate bill, but it’s still being written behind closed doors. https://t.co/zcK7xgYL52"]["Filing taxes by postcard doesn’t mean much if your bill raises taxes on the middle class. https://t.co/UXEmaT6odM"]["Virginia voters sent a clear message last night: if you abandon the middle class, the middle class will abandon you. This is not going to end well.\nhttps://t.co/7DoZVkZPzp"]["I don’t see any other way to spin it https://t.co/Mc46E6fZrq"]["@LoopEmma @BuzzFeedNews And we're live on @BuzzFeedNews #AM2DM https://t.co/OnzvfmWld8 https://t.co/iiLDi8tshq"]["Sitting down to talk with @LoopEmma on @BuzzFeedNews' #AM2DM \n\nWatch the interview live at 10:00am ⬇️ https://t.co/OnzvfmEJOy"]["Today in memory of Otto Warmbier, the Banking Committee unanimously approved the #BRINKAct, strengthening sanctions against North Korea. https://t.co/fqDtQjvRaw"]["Great meeting senior government students from @PowhatanHS today at the Capitol! https://t.co/KZBt2fZ9kw"]["THIS. Don’t let Trump Administration sabotage stand in your way. #GetCovered at https://t.co/TEvyCTLnpw, now through December 15. https://t.co/4fAxJhoZn4"]["@GSCNC @girlscouts Amen!"]["@girlscouts @GSCNC But if I’m being honest, I think they were more impressed with Maggie from my staff, who earned the Gold Award when she was a Girl Scout. https://t.co/2uZXYw4eE2"]["Today is #ElectionDay here in Virginia. If you haven’t cast your ballot yet, find your polling place here: https://t.co/cS91DMH3sG https://t.co/p6sbQ2Bqmp"]["We must reauthorize #CHIP. Virginia’s kids are counting on Congress to put aside partisan politics &amp; get this done.\nhttps://t.co/HFEsP5hQ6K"]["EXACTLY what the #HonestAds Act would do for online political ads. More transparency. More accountability for candidates &amp; special interests https://t.co/Vn6H5bQZlB"]["Great talking with student newspapers from across the Commonwealth about my bills on #CollegeAffordability &amp; #StudentDebt. https://t.co/YgDQpW6a0L"]["Bipartisan momentum to end #FoodDeserts continues to grow. Thank you @RepTimRyan &amp; @RepRyanCostello for introducing our bill in the House. https://t.co/o189S4sin7"]["Watch this. We desperately need more transparency in online political ads, starting with the #HonestAds Act. https://t.co/qhJjusaGHf"]["And I'll bet you it would be a heck of a lot easier for the Senate to pass a bipartisan deal with 60 votes than a partisan deal with 50."]["Democrats have ideas about how to grow our economy, help the middle-class, and improve our competitiveness through tax reform."]["With healthcare, we saw what happens when you try to force through partisan backroom deals. The GOP shouldn't make the same mistake again."]["This backroom proposal is no way to construct sound policy, particularly with something as complex &amp; important as the tax code. https://t.co/cmbk69Lrzo"]["A missed opportunity for the platform companies in yesterday’s #TechHearings. I hope they will come around and support the #HonestAds Act. https://t.co/zWIeVP0K1e"]["Thank you @SenStabenow &amp; @SenBobCasey for supporting job training for American workers by cosponsoring the Investing in American Workers Act"]["Introduced the Investing in American Workers Act to make sure workers get the training necessary for good-paying, middle class jobs. https://t.co/8oG2cAR3vv"]["FUNNY: Bad Photoshop\n \nNOT FUNNY: Russia used this stuff to grow a 217k person following for this page, followed this playbook over &amp; over. https://t.co/VOpsy1CHur"]["Bottom Line: it was REALLY easy (and cheap) for @AmyKlobuchar &amp; I to run ads that reached thousands of journalists &amp; Capitol Hill staff. https://t.co/kj7eqbbB0k"]["States are beginning to run out of children’s health insurance funds. Virginia runs out in a few short months. We must renew #CHIP NOW. https://t.co/I6iRmVgfbt"]["I'm VERY skeptical that Russia's interference was limited to this one troll farm in St. Petersburg. #TechHearings https://t.co/38swWjTcro"]["Big day with #TechHearings, but don’t forget that today is DAY 1 of ACA open enrollment. #GetCovered https://t.co/1CYGgs2BHH"]["Preventing foreign adversaries from using digital ads to influence our elections is a national security issue. Full stop. https://t.co/97di4UGpmn"]["No question, we need #HonestAds. But we also need to know full extent of Russian interference on social media, including \"organic\" content"]["NOTE: this is not an ad. It is an unpaid \"organic\" post shared after Russia used ads to grow a 217k person following for the “Army of Jesus”"]["This graphic of Jesus and Hillary Clinton is an actual post shared by the Russian page “Army of Jesus,” released during #TechHearings. https://t.co/XKFLGnoXu4"]["Watch live at 9:30AM: https://t.co/XILVFFGuG8"]["Ready for today’s Senate Intel hearing on Russia's use of social media in the 2016 election. We'll hear from the tech companies at 9:30AM. https://t.co/DZwGpvYj6n"]["This is big. @AdamS, former head of Government, News, and Elections at Twitter backs the #HonestAds Act. https://t.co/djcKdQ5jT7"]["Monitoring this situation closely. Please keep the victims, their families, and NYC first-responders in your thoughts. https://t.co/uFSfHgXyan"]["Glad to see big tech recognizing the problem. Next step is the #HonestAds Act – real transparency &amp; accountability for online political ads. https://t.co/wdIZfbuWYr"]["It’s been a full month since Congress let #CHIP expire. That’s 30 days of failing Americas most vulnerable kids. Enough is enough."]["3.  How do they plan to work with Congress to make sure this doesn’t happen again? Specifically on legislation like the #HonestAds Act."]["2.  How susceptible are these platforms to future disinformation campaigns waged by a small group of foreign hackers, trolls &amp; bots?"]["1.  How did Russia use social media and search platforms to influence the 2016 election? The American people deserve a full explanation."]["Tomorrow some of America’s largest tech companies will testify before the Senate Intelligence Committee. Here’s what I want know:"]["I question whether Russia’s election interference came entirely from 1 troll farm in St Petersburg. Tech firms should help us find the truth https://t.co/jrdK3NHtI8"][".@BostonGlobe calls #HonestAds Act “overdue” and says the US “must do better to safeguard future elections.” https://t.co/IkIrpu2GAH"]["ACA Health Insurance Open Enrollment Starts TOMORROW: #GetCovered at https://t.co/eCeKIOEm64 starting November 1st. https://t.co/81SzUgHgjI"]["All aboard the new @Amtrak route to Roanoke! https://t.co/8M51F7Nj1x"]["Must-read @LATimes on the #HonestAds Act: https://t.co/zOkIgrVMBE"]["We must make clear to POTUS that pardons of himself or associates would be unacceptable &amp; result in immediate, bipartisan action by Congress https://t.co/gZcwspX7HQ"]["Congress must take action now to protect the independence of the Special Counsel wherever or however high his investigation may lead. https://t.co/gZcwspX7HQ"]["Statement on the indictments of top Trump campaign officials: https://t.co/yDt6w0nuTT"]["Glad to see companies taking​ ​these issues seriously. We need to work together to improve ad transparency. We need the #HonestAds Act. https://t.co/UpotNgHn6y"]["Or ​Shenandoah. @SenRobPortman and I have a better solution. https://t.co/4Q8hQ61XzL"]["Requested this new report to help find ways to improve workforce development resources for #GigEconomy workers. https://t.co/GdLcuAr1FI"]["Healthcare for over 65,000 kids here in Virginia is on the line. The Senate needs to vote on a bipartisan #CHIP deal. https://t.co/PBfgIr7n6M"]["A positive step towards restoring the public's trust. I hope platform companies will continue to reform and support the #HonestAds Act. https://t.co/uORkGIAa3A"]["Good for the deficit, good for consumers. As far as I can tell, the only reason to oppose the bipartisan #AlexanderMurray deal is politics. https://t.co/1LiCGZYjCP"]["If the Kremlin's own \"news\" agency doesn't like our #HonestAds Act, we must be doing something right. cc: @SenJohnMcCain @AmyKlobuchar https://t.co/W0De0U68hS"]["Reason #1,000,000,000,000 to not increase the deficit by another 1.5 TRILLION in unpaid-for tax cuts\nhttps://t.co/SLPREAUheW"]["Forced arbitration clauses prevent consumers from having their day in court. Repealing the @CFPB's #RipOffClause Rule is bad for consumers. https://t.co/4bxf5G2Wqt"]["I actually believe it would be easier to pass a bipartisan #TaxReform deal with 60+ votes than a partisan bill with *maybe* 50 GOP votes. https://t.co/1EuOxfchvc"]["Here’s where I stand on #TaxReform https://t.co/DBCaRMK5eO"]["I’m voting NO on repealing the #RipOffClause Rule. Retweet if you agree we must #DefendCFPB https://t.co/fpIqLrHJXV"]["A good first step, particularly public disclosure of ads info. Online political ads need more transparency &amp; disclosure. We need #HonestAds https://t.co/ewDbd1hTxZ"][".@JeffFlake is a good man who's in politics for all the right reasons. We need principled, decent public servants like Jeff more than ever."]["I am hopeful that the Senate will pass a disaster relief package ASAP, but more, much more, must be done for our fellow Americans. https://t.co/dMSmm9NKak"]["Shameful that this is happening in the United States. https://t.co/ZuX2YtUvhv"]["No more excuses, no more delays. 65,000+ kids in Virginia are on the verge of losing their healthcare. We must reauthorize #CHIP now. https://t.co/gGnduHkmAW"]["Deep dive on the #HonestAds Act from @BrennanCenter scholars. Americans deserve to know who’s paying for the political ads they see online. https://t.co/hf0IqHyFM4"]["One person is standing in the way of the Senate’s bipartisan deal to stabilize the healthcare market and lower premiums. https://t.co/S2iU91JM46"]["If Boris Badenov is sitting in some troll farm in St. Petersburg pretending to be the Tennessee GOP, I think Americans have a right to know. https://t.co/rw4JlOu9Ff"]["This is frustrating and 100% avoidable. Congress must reauthorize #CHIP now.\nhttps://t.co/LPds0PtKQO"]["@ART180 @inclusiveva Congrats!"]["Over 1M Virginians live in areas w/out access to fresh, healthy food. Visited @FoodbankSEVA to talk about my bill to end these food deserts. https://t.co/J2hnGKGsyl"]["@maristpoll Source: https://t.co/ThBkv35ybw @maristpoll https://t.co/7KVtAWIG66"]["Wow. New @MaristPoll finds 78% of Americans believe online political ads should have to disclose who paid for the ad. We need #HonestAds."]["Disturbing &amp; unacceptable. Today I sent a letter demanding answers about this law's impact on the government's response to the opioid crisis https://t.co/MNOqCOKnWM"]["#HonestAds Act will bring needed accountability to our elections. I'm grateful for @AmyKlobuchar &amp; @SenJohnMcCain's leadership on this issue"]["Government hasn’t kept up with changing technology, and the result has been a lack of transparency in online political ads."]["#HonestAds also holds politicians, special interests &amp; ad platforms accountable for the ads they run, just like we do for TV &amp; radio ads"]["The #HonestAds Act will strengthen protections against foreign interference in our election. No more election ads paid for in rubles."]["Russia attacked our democracy in 2016 armed with the tools of information warfare, including digital ads."]["Today I introduced the #HonestAds Act, which will bring needed transparency and accountability to online political ads. https://t.co/EyULBcZDV8"]["Happening now: @AmyKlobuchar &amp; I are introducing the #HonestAds Act to bring transparency to online political ads. https://t.co/Gr91sj4Wan"]["@BudgetGOP I’m calling on my Senate colleagues — Republican and Democrat — who care about fiscal responsibility to VOTE YES on the Warner Amendment."]["@BudgetGOP (By the way, economists are clear: paying for tax cuts with deficit spending is a really, really bad idea.)"]["The reason @BudgetGOP did this is to pave the way for a $1.5 TRILLION tax cut with absolutely no way to pay for it."]["Basically that means Congress will be able to run up the deficit &amp; stick our grandkids with the bill. I’m offering an amendment to stop this https://t.co/fOmOZ8pYIS"]["Today the Senate moves forward on a partisan budget repealing key \"PAYGO\" rules, which are a cornerstone of fiscal responsibility."]["Looking fwd to introducing the #HonestAds Act w/ @AmyKlobuchar &amp; @SenJohnMcCain today. Watch live at 12:40pm: https://t.co/Gr91sj4Wan"]["And you can tune in to the livestream tomorrow at 12:40pm:  https://t.co/Gr91sj4Wan cc: @AmyKlobuchar @SenJohnMcCain https://t.co/mY3RQXd47d"]["Learn more about the Internet of Things Cybersecurity Improvement Act of 2017: https://t.co/b1uL8jxMG0"]["We've seen what happens when #CyberSecurity warnings go ignored. Congress should pass my federal #IoTsecurity bill while we still have time. https://t.co/yZ7vgk7czo"]["\"Sabotage\" — verb — to deliberately destroy, damage, or obstruct something, especially for political or military advantage. https://t.co/zm3T6aJiXK"]["@SenAlexander @PattyMurray I’ve been fighting to stop the Administration’s sabotage of the healthcare market. Thankfully, this deal will prevent it from taking effect."]["This is how Congress is supposed to work. Grateful to @SenAlexander &amp; @PattyMurray for putting aside politics to reach a bipartisan deal. https://t.co/1X9sMXXS8W"]["We’ve seen this movie before. It doesn’t end well. https://t.co/fgsNX55kqb"]["Gloria is a Virginian &amp; a DREAMer who I met this month. If you're not sure about the #DREAMAct, listen to Gloria's story. #ProtectDreamers https://t.co/4SuL8Vobjj"]["In other words, Americans want Congress and President Trump to work together and improve the healthcare system, not sabotage it. https://t.co/qvDH4YFXEk"]["This is a fight to stop a ~20% insurance rate hike for thousands of Virginians. Thank you @MarkHerringVA. https://t.co/75aUzpEsGc"]["Community health centers are a vital piece of the health care system, especially in rural &amp; medically underserved areas. We must renew CHCF. https://t.co/dcDsgbJ09T"]["Today is the last day to register to vote in Virginia before next month’s election. Retweet to spread the word. https://t.co/N2oFYEOsdI"]["Virginia’s kids and their families are counting on us to get this done. Congress must renew #CHIP. https://t.co/2y18Q0dz2G"]["#VAChoice is an important tool to make sure Virginia veterans get the care they need. The VA needs to step up &amp; make sure the program works. https://t.co/8aADqaw5rl"]["Happy 242nd birthday @USNavy! Special shout out to Virginia’s 85k+ active duty and reserve Sailors and Navy civilians. #NavyBirthday https://t.co/KSijYb6Z6K"]["This is why we need more transparency in online political ads. Introducing legislation with @AmyKlobuchar on this soon. Stay tuned. https://t.co/0zZVz2fed7"]["This Administration is determined to sabotage the ACA, even though it will raise costs and limit healthcare choices for working families. https://t.co/dRfnUkpBUv"]["Sabotaging the ACA isn’t an abstract Beltway issue. It’s a real-life issue for millions of Americans who will pay more for worse healthcare. https://t.co/oHy7fhiN8F"]["Make no mistake: this is #sabotage that will destabilize the insurance market and undermine protections for pre-existing conditions. https://t.co/y7Djdl7F8W"]["Couldn’t agree more. Time to keep the promise to Virginia's retired miners and pass this bill. \nhttps://t.co/JCngp2H899"]["My heart is with these communities who've been devastated by the CA Wildfires. Praying for the missing &amp; first responders battling the fires https://t.co/D7K4C4524D"]["@Nationals @TommyMcFLY Hope I’m not too late, @TommyMcFly. Go @Nationals! #OnePursuit https://t.co/0KhVIBxNRt"]["Decisions about birth control are deeply personal and belong in the hands of women and their doctors. https://t.co/jyot3T3ERQ"]["These Virginia #DREAMers are hardworking students who should be worrying about graduation, not deportation. We must pass the #DREAMAct ASAP. https://t.co/riWtlmkipb"]["If you care about fiscal responsibility, you should demand Congress keep PAYGO rules in place. https://t.co/LHBxSuH3t5"]["In plain English, PAYGO is the rule that’s supposed to prevent Congress from increasing the deficit and sticking our children with the bill. https://t.co/QOBs11K8tc"]["Closing this deadly loophole is something both parties should be able to agree on. https://t.co/CiDbNbhAsh"]["If you’re not concerned about this, you should be https://t.co/YfmSYzHQZy"]["Retweet if you agree https://t.co/qm1dwjPjAx"]["Met #DREAMers from @GeorgeMasonNews this AM. @TimKaine &amp; I are fighting to pass the #DREAMAct &amp; #ProtectDREAMers like these young Virginians https://t.co/leKupu2Pgr"][".@SenatorBurr &amp; I will give an update on the Senate Intel Committee’s Russia Investigation today at 12:15pm. Watch:\nhttps://t.co/QlLZgS78MH"]["Honored to introduce Kenneth Juster, nominee to be the US Ambassador to India today in the Senate Foreign Relations Committee. #IndiaCaucus https://t.co/7GwU0FEoFM"]["Unbelievable. I can think of 145 million reasons why the IRS should have thought twice about this. https://t.co/cxQ1CzAoT5"]["Here’s how you can help victims of the #LasVegasShooting: https://t.co/udkIMoSIGS"]["@senrobportman I hope we can continue to put aside party politics and find more opportunities to make healthcare work better for the American people."]["@senrobportman Just as important, this is the first bipartisan fix to the Affordable Care Act introduced since last month's healthcare debate."]["@senrobportman This bill will go a long way towards reducing the ACA’s reporting burden &amp; making it easier for businesses to cover their employees."]["Introduced the Commonsense Reporting Act today with @SenRobPortman to reform ACA reporting requirements for small &amp; mid-sized businesses. https://t.co/GZlZTexAQU"]["@SenateFinance Millions of kids are counting on us to protect their healthcare, and we’re out of time to waste. #CHIP"]["@SenateFinance ...so we could have a show hearing on the GOP healthcare repeal bill last week."]["While I’m hopeful @SenateFinance will pass a bipartisan #CHIP extension soon, that doesn’t excuse the fact that it was allowed to lapse..."]["Frustrated doesn’t begin to describe how I feel about this. https://t.co/Qx4Yjc7ihG"]["Woke up to this tragic news. My heart is with the victims, their families, first-responders, and the people of Las Vegas. https://t.co/enj7y7irbV"]["Word of the Day: “empathy” — noun — the ability to understand and share the feelings of another. https://t.co/IaSXH6809v"]["Sending my best wishes to the Jewish community for a meaningful Yom Kippur and an easy fast."]["Working with @AmyKlobuchar on legislation to bring this kind of transparency to digital election ads. https://t.co/MrFUDHlKje"]["Great news. https://t.co/XgXI9GNbI7"]["If you add up what Russia spent intervening in our elections &amp; DOUBLE it, it's still less than 1/2 of the cost of an F-35. #WashingtonIdeas https://t.co/GygzjY7Lhy"]["The most irresponsible thing we could do now is bury our heads in the sand &amp; pretend the problem will go away. #WashingtonIdeas https://t.co/2F1jv4c5DG"]["@AARPVa Thx @AARPVA! These are just a few of the questions we covered tonight. You can listen to the full recording here: https://t.co/WabuMACJT8"]["@AARPVa Where the ACA fell short is cost-control. Our challenge now is to work together to bring down costs for middle-class families &amp; #SmallBiz."]["@AARPVa And you can't be denied coverage because of a pre-existing condition."]["@AARPVa *Access* to healthcare is much better thanks to the ACA. Millions more have coverage."]["@AARPVa Last question: Is healthcare better today than it was before the Affordable Care Act?"]["@AARPVa Both parties should have learned by now that we shouldn't pass legislation making massive policy changes without bipartisan support."]["@AARPVa Right now I'm hopeful we can move past partisanship &amp; the chaos it causes, and focus on Sens. Alexander &amp; Murray's bipartisan negotiations."]["@AARPVa It's definitely a problem, particularly for insurance companies figuring out if they're going to offer plans in markets like Virginia's."]["@AARPVa Bob asked about the Trump Administration's Executive Orders attempting to sabotage the Affordable Care Act."]["@AARPVa 1. Allow insurers to sell plans across state lines.\n2. Reduce ACA's reporting requirements\n3. More pooling of #SmallBiz purchasing power"]["@AARPVa Austin from Locust Grove asked what we can do to bring costs down for #SmallBiz owners like him, who've seen insurance costs go up. Fair Q."]["@AARPVa The challenge is that we do need to reform &amp; improve the Affordable Care Act. Keep what's good, fix what's bad &amp; do it in a bipartisan way."]["@AARPVa The good news for Va seniors is that the #GrahamCassidy bill was defeated. It would have been a disaster, particularly for #Medicaid."]["About to kick off my @AARPVa healthcare tele-town hall. Listen in: https://t.co/IE7WysgrxS https://t.co/XN74u7pY4n"]["Great to meet @SECNAV76. Looking fwd to working together on military readiness, supporting our Sailors &amp; Marines in Va &amp; around the world. https://t.co/sSvJzYUBp6"]["Thanks, chef. Looking forward to talking about my food desert legislation and what we can do to #EndHunger. https://t.co/A91buwJd9l"]["Proud of this bipartisan bill that's been years in the making. It's going to help a lot of patients &amp; families in Va and around the country. https://t.co/NCCS1mgyVT"][".@SenBobCorker is a great friend. Somebody who made the Senate work. This is a loss for all of us. https://t.co/8AN8HtBUzB"]["I'm so proud of the Americans who stood up for their healthcare. Your calls, your emails, your voices — you made the difference."]["The American people rejected #GrahamCassidy, just like #Trumpcare. It's past time to move on, work together on bipartisan healthcare fixes."]["Today I pressed SEC Chairman Clayton on what his agency is doing to get to the bottom of this. Watch: https://t.co/ODpOhkOBxy"]["At this point, I question whether Equifax has the right to continue providing services with its current lack of attention to cybersecurity. https://t.co/DdmZVC9eSZ"]["The #EquifaxBreach was a travesty, and simply changing CEOs is not going to be enough."]["A good start would be to give up on taking away healthcare from millions of Americans and focus on getting an aid package passed this week. https://t.co/RWgLfudLUK"]["These are our fellow Americans. If the Administration's response does not dramatically improve, Congress should take action on its own. https://t.co/dGia6Siwk9"]["We can't go back to the days when insurance companies could deny you coverage for a pre-existing condition. We can't go back"]["CBO: #GrahamCassidy will result in “millions fewer people with comprehensive health insurance that covers high-cost medical events.” https://t.co/WOxOgixPR8"]["The Senate Finance Committee's #GrahamCassidy hearing has been postponed so that those directly impacted by the bill can be ejected. https://t.co/pULTDYkuce"]["Americans submitted 27k + comments for today’s hearing on #GrahamCassidy healthcare repeal bill. @SenateFinance Dems are fighting for you! https://t.co/ujE25boGZX"]["The @SenateFinance Committee is about to hold the ONLY hearing on #GrahamCassidy. One hearing’s not enough, but here we are. Tune in at 2PM. https://t.co/q7anWSGsQn"]["Danté &amp; his mom, Marlo, came from Virginia Beach because healthcare is literally a life &amp; death issue for them. Hear what she has to say. https://t.co/fdux3WbUff"]["Danté is a 15 year old Virginian with a rare brain condition covered by #Medicaid. He's waiting in line for today's #GrahamCassidy hearing. https://t.co/XTEXHZi97G"]["The line for today's #GrahamCassidy Hearing is longer than the Comey Hearing line. Good. Tune in at 2PM. https://t.co/wA3kZCbkFr"]["Last chance to submit a comment for Monday's #GrahamCassidy hearing. Email GCHcomments@finance.senate.gov by 9:00 AM ET Monday. https://t.co/4oYZ1VkvEk"]["Another Almost Annual Collis-Warner Pig Roast in the books. Special thanks to #RVA's @BuzAndNeds for bringing the BBQ! https://t.co/y0BZ8kcagg"]["IMPORTANT. Please submit a statement for Monday's #GrahamCassidy hearing and make your voice heard. https://t.co/u7GLMesUns"]["Unacceptably delayed, but relieved this is finally happening after months of pushing. We have to do better in the future. https://t.co/CDebA0THQs"]["@NASA_Langley More importantly it was an incredible honor to finally meet Dr. Johnson, the “Human Computer,” subject of @HiddenFigures &amp; a great Virginian https://t.co/kqciE0Prg8"]["Celebrated the ribbon-cutting for the Katherine Johnson Computational Research Facility today at @NASA_Langley. https://t.co/wpg57Vz7bD"]["I’m fighting to stop #GrahamCassidy for Virginia kids like Charlie. https://t.co/MfjDEjJfin"]["Look at these numbers and try to tell me #GrahamCassidy covers pre-existing conditions. https://t.co/DVOMiQ5PN4"]["The title says it all.\nhttps://t.co/fhz06CWteP"]["To everyone celebrating #RoshHashanah, Shanah Tovah, happy new year!"]["Honored to present Congressional Gold Medals to the family of the Maples brothers, Documented Original Tuskegee Airmen from Petersburg, Va. https://t.co/U0BRzCXtZR"]["Two solid NO votes on #GrahamCassidy here. Keep calling, keep writing. Your voice is more important than ever. https://t.co/5FtpTQ6kFF"]["“Health Care” https://t.co/MWiK1ND9rt"]["Today it is against the law to deny someone coverage for a pre-existing condition. We can't go back. https://t.co/ICOKW3i9AB"]["As a former governor, I can tell you a $1.2 billion hole in your budget (like the one #GrahamCassidy creates for Va) means people get hurt. https://t.co/UdzA0WfvYA"]["The Senate Intelligence Committee has invited Trump lawyer Michael Cohen to appear in open session."]["Doctor’s orders: vote NO on #GrahamCassidy https://t.co/dx70g7gwJ1"]["You, me, and the American people. This is the most sensible thing I’ve seen on Twitter all day. #GrahamCassidy https://t.co/NbkGY25a0a"]["Joint Statement with @SenatorBurr on the Intel Committee's Postponing of Trump Lawyer Michael Cohen’s Interview: https://t.co/pEfSge3UFI"]["Congratulations Richmond, named a 2017 @RWJF #CultureOfHealthPrize winner. #RVA @LevarStoney https://t.co/YJVBavjJvk"]["Absolutely. https://t.co/C2DFLIKwrm"]["It might not be politically convenient, but the American people deserve to know #GrahamCassidy's impacts on coverage, premiums &amp; the deficit"]["Yes. https://t.co/9cXUjkV1XF"]["BREAKING: Senators want to know impact of #GrahamCassidy before we vote on it. https://t.co/fUuf2XQu7R"]["Grateful for the work of so many unsung heroes who keep our nation safe every day. #CIA70 https://t.co/6hH5RkR62m"]["Thank you to the men and women serving in the @USAirForce in Virginia and around the world. Happy #AFBday! https://t.co/tpdBqVR1Zp"]["New bill, same broken, partisan process. #GrahamCassidy is repeal and replace by another name. https://t.co/5hbouzqvbj"]["Glad Anthem is re-entering the Va exchange. Now it's time for the Trump Administration to stop efforts to sabotage &amp; destabilize the market. https://t.co/yh4Jh1ip6l"]["Encouraging news for 28,000+ Va kids who rely on CHIP for healthcare. I’m ready to work w/Finance cmte colleagues to pass a bipartisan bill https://t.co/9zUEm2DpUL"]["Pleased @POTUS signed my res condemning hate groups &amp; the violence in Charlottesville. Unfortunately he still equivocates when he speaks. https://t.co/zy27PQLIDv"]["And they paid in RUBLES. Seriously. https://t.co/D35tvhUEcj"]["Yesterday I called on @FTC to investigate the #EquifaxBreach. Pleased to learn they're taking action. https://t.co/qkKnvAuZVJ"]["We've been working hard for weeks to find a fix so all Virginians have access to coverage. Still at, won't stop until it's done. https://t.co/UZdLhslD7F"]["@BPC_Bipartisan Proud to be working w/ @Sen_JoeManchin @SenDavidPerdue &amp; @SenThomTillis on this project. Read the full report: https://t.co/Wkn8lk0pQq"]["@BPC_Bipartisan Today we released our report outlining steps to jumpstart Appalachia's economy &amp; invest in its health, workforce &amp; infrastructure. https://t.co/Oc1Z8jHowV"]["The American people deserve to know their government is serious about responding to the #EquifaxBreach &amp; making sure it can’t happen again. https://t.co/h7nTUJEM6A"]["This passed with the support of all 535 members of Congress. POTUS should send a message that we are 100% united against the forces of hate."]["Mr. President, do the right thing and sign this resolution into law. https://t.co/JgLdAONsWJ"]["As Aerospace Caucus co-chair, a top concern is the cybersecurity of Va’s aerospace industry. Good discussion at yesterday's #AeroWeek event. https://t.co/qp1aCochml"]["Always informative to hear from @ASlavitt. Important voice in today’s Senate Finance Committee hearing on healthcare costs and coverage. https://t.co/DHTyCxNJd3"]["Tonight the House passed my resolution condemning hate groups &amp; the Charlottesville attack. POTUS should send a clear message &amp; sign it ASAP"]["Great meeting Virginians with @ACSCAN’s #CancerLobbyDay to talk end-of-life care and cancer research funding. https://t.co/rCTmVzPudb"]["More explicit proof that Russia used Facebook to sow discord, divide Americans, and influence the 2016 election.\nhttps://t.co/WzhD4wnPD5"]["We can't hesitate or equivocate in condemning white nationalists, the KKK, neo-Nazis, or others who would spread hate &amp; bigotry."]["I hope my colleagues in the House will act on this resolution quickly &amp; send it to POTUS for his signature: https://t.co/Eoz2ij8OwL"]["Today the Senate passed unanimously my bipartisan resolution condemning white supremacist groups &amp; the terrorist attack in Charlottesville."]["We should have learned a lesson about passing major legislation like tax reform without bipartisan support. https://t.co/NTgTAznAgC"]["In NYC today, honored to meet members of @FDNY Engine 54 &amp; say thank you. No firehouse was harder hit on #September11. #Remember911 https://t.co/0V9dYTsXA7"]["Never forget those we lost or the unity &amp; resolve the United States showed in the aftermath of this national tragedy. #Remember911"]["On #September11, we remember the victims of that terrible day &amp; the bravery of our first-responders. https://t.co/5vuccz82pf"]["@SenateFinance @GOPSenFinance @RonWyden @WydenPress @senorrinhatch We need to get this done quickly. I’m committed to putting our children before politics and seeing this through."]["If Congress doesn’t act, 28k+ kids in Va will lose their insurance. Glad @SenateFinance is working in a bipartisan way to reauthorize CHIP. https://t.co/EaEzkVbR1C"]["The #EquifaxBreach raises serious questions about #Cybersecurity that Congress must address head on and soon."]["Is it time to rethink data protection policies dealing with these large, centralized sets of highly sensitive data on millions of Americans?"]["Should Congress create a uniform data breach notification standard for attacks like #EquifaxHack?"]["This breach involves SSNs, birth dates, addresses &amp; credit card numbers of ~1/2 of all Americans. It is a threat to our economic security. https://t.co/hmBf1GQI86"]["This is a red flag for those of us who care deeply about student safety. https://t.co/uZrzIHA4g8"]["Our new bipartisan resolution sends a clear message: The United States rejects the forces of bigotry and hate → https://t.co/cdymDSFi2o"]["President Trump &amp; Congress must unequivocally condemn the white nationalist &amp; neo-nazi hate groups behind the violence in Charlottesville."]["Good. Thank you @AGMarkHerring for standing up for what’s right. #ProtectDREAMers https://t.co/WjRxmLpWDg"]["Retweet if you agree it’s time for Congress to vote on the DREAM Act. #ProtectDREAMers"]["@timkaine @AlexandriaVAPD @AlexandriaVAPF Their actions and those of the Capitol Police officers on scene saved many lives. I'm grateful every day for their courage and commitment."]["It was an honor for @timkaine and I to present our Senate resolution recognizing @AlexandriaVAPD's bravery in response to the 6/14 shooting. https://t.co/Lj2LGHORY6"]["This is a disgrace. Ending #DACA means going back on our word to nearly 800k #DREAMers who've known no other home than America. #DefendDACA https://t.co/nEmpaMe8gM"]["The Metro Safety Commission is now law, freeing up funds for needed safety improvements. VA, MD, DC should get it up &amp; running ASAP. https://t.co/E3wDkdGeaT"]["Covered a lot at last week's Tazewell town hall, but we shared a focus on rural economic development, starting w/ broadband &amp; cell coverage. https://t.co/xydv9TOXHJ"]["My thoughts are with the families of the sailors lost aboard the #USSJohnSMcCain. I join @USNavy in praying for those still missing."]["Makes no sense to cut federal support when a healthy Chesapeake Bay is in sight. https://t.co/AYUevfC6Hm"]["My heart is with the victims of today's attack, their families &amp; the people of Barcelona. We stand united against terror, hate &amp; violence."]["@codeVirginia @Microsoft We're going to get it done, and there'll be no reason you have to leave Southside or Southwest to get a high-tech, high-wage job. https://t.co/yjXF2Wet0D"]["I promised the crowd at the @codeVirginia / @Microsoft event in Mecklenburg County that I'll keep up the fight for cell coverage &amp; broadband https://t.co/tGWq4jxL2d"]["Great things are happening in Southside Virginia. These kids are learning how to code and build robots before they're old enough to drive. https://t.co/lqV5Obl5Uh"]["@Honor_Capital @SaveALot Learn more about the bipartisan Healthy Food Access for All Americans Act: https://t.co/VYqWj22oJc"]["Just visited @Honor_Capital's new @SaveALot in Danville, Va. I'm excited to team up with them on my new bill that will help end food deserts https://t.co/oLEtb7ksNS"]["\"If you’re not outraged, you’re not paying attention\"  God bless you, #HeatherHeyer  #Charlottesville"]["No words. https://t.co/pCSYUE5iZN"]["Let's be clear: this is not \"Obamacare imploding.\" We're talking about POTUS deliberately sabotaging the insurance market. https://t.co/6s36X7Dnj3"]["This: CBO says Trump Admin sabotage by witholding ACA subsidies will raise premiums 20% and cost taxpayers ~$200B.\nhttps://t.co/lJeduoeamP"]["Heard from Roanoke Valley farmers  at today's roundtable in Catawba. We talked conservation, job creation &amp; ideas for next year's farm bill. https://t.co/c9GCd22Zuv"]["Just got to Roanoke. Next stop: Blacksburg then Wytheville. On to Big Stone Gap in the morning. #SWVA #WarnerOnTheRoad https://t.co/YCJBdLfME0"]["The fact that some of these hate groups are claiming a victory after this tragedy reveals their dangerous agenda &amp; disregard for human life."]["As I'm traveling through Virginia today, I'm thinking of Heather Heyer, victim of white supremacist terrorism in #Charlottesville. https://t.co/osm6ZXNSle"]["Sad day for the Commonwealth. My condolences to the families &amp; fellow officers of our two state troopers lost today. https://t.co/1b8e2bqkKh"]["Statement on the violence in #Charlottesville https://t.co/Z36aaDFTsP"]["To the white nationalists descending on Charlottesville: go back to where you came from. Hate has no place in Va. https://t.co/N20CRZ3Fr4"]["President Trump has been playing politics with health care for months &amp; now Virginians are paying the price. \nhttps://t.co/8awSyZx72e"]["This is politics at its worst. https://t.co/bVVGP80T3C"]["We need fewer fiery words and bombastic tweets, more focus on addressing the North Korean threat: https://t.co/uPb7AwaSnh"]["Great mtg @NestleUSA CEO Paul Grimwood to discuss worker training &amp; the jobs @Nestle is bringing to Arlington. Welcome to the neighborhood! https://t.co/o6LVgHeJQw"]["Wishing a happy 227th birthday to the @USCG, especially to all our Coast Guardsmen serving down in Hampton Roads. #SemperParatus #CG227 https://t.co/aAyGmisklr"]["@virginiavfw Thank you @VirginiaVFW. I’m looking forward to seeing the clinics in Hampton Roads and Fredericksburg up and running ASAP."]["Encouraged to see GOP colleagues putting people before politics. ACA needs fixes, but undermining it to score political points is just wrong https://t.co/4j0UR04N9z"]["Incredibly proud of Cadet Simone Askew from Fairfax. Congratulations! https://t.co/7L79Mqo3sO"]["PASSED: #ForeverGIBill expands educational opportunities for 500k+ veterans. Proud to cosponsor &amp; looking fwd to POTUS signing it into law https://t.co/rIqRe5nssm"]["#Equality is the law of the land &amp; our tax code should reflect that. Proud to cosponsor the #EqualDignity for Married Taxpayers Act! @HRC"]["Or you could thank Russian dictator Putin, who hacked US election, undermines Western alliances, invaded Ukraine &amp; annexed Crimea. https://t.co/38wCAxmqoW"]["@RCSAll4Him @timkaine Congrats, Josh!"]["If #ForeverGIBill comes to the floor, you’ve got a YES vote here. I say we just pass it unanimously &amp; send it to the President's desk now. https://t.co/0noIoHppYl"]["Amen! Tim and I are cosponsors. I hope to see the Senate pass the #ForeverGIBill this week. https://t.co/xd4QhmcN7A"]["I don’t think they’d let me bring my budget charts on the dance floor. https://t.co/v3xOXenLDm"]["@POTUS The Senate also passed a bill to reform the often slow &amp; frustrating claims appeal process at the Department of Veterans Affairs."]["@POTUS Great news for Virginia vets: it contains language I’ve been pushing for years to speed up new VA clinics in Hampton Roads &amp; Fredericksburg"]["Proud to have supported this bipartisan veterans bill &amp; glad to see it headed to @POTUS' desk. This is how Congress is supposed to work. https://t.co/lIhzgYDEhf"]["If the Trump Administration wants us to believe there’s nothing to the Russia investigation, they need to start acting like it."]["It now appears the President actually drafted his son's Trump Tower mtg statement in a way that intentionally deceived the American people. https://t.co/a6SuNmxcAx"]["I’m behind this 110%. Including Virginia’s VA leases in #VAchoice is a must. https://t.co/YxuYRHJJn7"]["After years of working to cut red tape holding up Virginia's VA health clinics, we are so close. We’re going to get this done for our vets. https://t.co/UKvlRjbJyn"]["@wmata @timkaine @SenatorCardin @ChrisVanHollen Glad to be working w/@SenatorCardin @TimKaine &amp; @ChrisVanHollen to hold WMATA's leadership accountable &amp; ensure it has the funding it needs."]["Met with @WMATA’s GM for an update on Metro safety improvements. Metro is too important not to get this right. https://t.co/8L3VSbJUGk"]["@SenCoryGardner @RonWyden @SteveDaines Appreciate all the input from experts, including @zittrain and @joshcorman, and from industry voices like @VMWare, @Cloudflare, and others"]["Appreciate the leadership of @SenCoryGardner @RonWyden &amp; @SteveDaines on this bipartisan federal #IoTsecurity bill: https://t.co/k8GV64BvgU"]["I’m excited about the innovation happening in the Internet of Things space, but we need #IoTsecurity standards for federal #IoT devices."]["Introduced a bill today creating #Cybersecurity standards for federal #IoT purchases. It's time to raise the bar for federal #IoTSecurity https://t.co/GpgRm5OHQC"]["Time to drop this partisan repeal process for good and work together on ways to improve health care for all Americans."]["Thank you to all Americans who made their voices heard. You did this."]["Long night. Now the real work begins. https://t.co/S8bgSLDJl9"]["For those who care about this legislation impacting 1/6 of our economy: 16 million will lose insurance, premiums will increase 20% #VoteNo"]["We *just now* got the CBO score and final text of the GOP healthcare repeal bill. We're supposed to vote on it in a few minutes."]["This partisan process &amp; the bill it produced are fatally flawed. The Senate is failing the American people tonight. #VoteNo"]["Worse than the process, this bill will mean higher premiums w/ millions losing insurance. It was a bad bill yesterday. It's a worse bill now"]["Heard lots of GOP complaints about lack of hearings &amp; debate. But here we are voting in the middle of the night on a bill written hours ago."]["President Trump should sign this bill as soon as it hits his desk. Otherwise, he risks encouraging Russia’s interference in future elections https://t.co/ZCTBD3rd1e"]["“Skinny” (adj): thin, scrawny"]["Whether on the Senate floor or in the marketplace, this partisan repeal effort will fail. I hope it happens before real people get hurt."]["After 7 years of “Repeal Obamacare” campaign rhetoric, the Senate just rejected a bill to repeal the ACA &amp; kick 32m off their insurance."]["I'm lucky I can provide for my daughters' medical needs, but the people Senators represent have the same right to healthcare as our own kids https://t.co/tJKMzdWQl8"]["I'm ready, but GOP has to meet us half way. We’ve had a secret process with 0 hearings. Only @SenateMajLdr even knows what we're voting on. https://t.co/WZl7C1tarY"]["Headed to the Senate floor to speak out against the partisan healthcare repeal bills. This is no way to conduct the people’s business."]["On the steps of the Capitol w/my colleagues &amp; Americans from across the US who are united in the fight to save healthcare. This is not over. https://t.co/MWSbkrZre0"]["Every senator has a choice today: throw your constituents under the bus for a political “win” or do the right thing &amp; #VoteNo."]["I’m going to #VoteNo for the Virginia seniors who will see higher costs or even lose their nursing home care because of #Trumpcare. https://t.co/OpRL8Jzps5"]["As a former governor, I'm going to #VoteNo because poking billion-dollar holes in state budgets is crazy. \nhttps://t.co/ntMATMGYHE"]["I’m going to #VoteNo for communities battling the opioid epidemic. Cutting Medicaid's substance abuse treatment is the last thing they need. https://t.co/GP3DqjbazR"]["I’m going to #VoteNo for Virginians like Anna, who relies on #Medicaid for life-saving care that her dad’s military insurance doesn’t cover. https://t.co/dUyJ4nxZ1b"]["If you have a bill that kicks millions off insurance &amp; hurts your most vulnerable constituents, your job as a Senator is to #VoteNo"]["Forget partisan politics for a second. Forget the campaign rhetoric. Whatever your thoughts on the ACA, the fact is #Trumpcare is a bad bill"]["Doctor’s orders: Vote NO on #Trumpcare. @AmerMedicalAssn says Senate bill violates the principle of \"do no harm.\" https://t.co/D3HuI3raiC"]["Two solid #Trumpcare NO votes here, Ronda. cc @TimKaine https://t.co/ifcPElVhni"]["Proud day for the @USNavy. The first-in-class #USSGeraldRFord @Aircraftcarrier was officially commissioned today in Hampton Roads. https://t.co/FNbKMFiX65"]["Team Warner reporting for duty at Remote Area Medical Clinic. @RAMusaorg is serving 1000+ today in Wise, Va. https://t.co/ZqHu3h1QyF"]["This is incredibly frustrating. How can state election officials prepare for 2018 if they're kept in the dark?\nhttps://t.co/da5LPK3v17"]["Praying for @SenJohnMcCain's speedy recovery tonight. A grateful nation stands with you, John."]["This is what \"repealing Obamacare\" actually looks like. Time to give up on partisan repeal &amp; cut a real, bipartisan healthcare deal. https://t.co/LfR0kJmpsb"]["For months I've been sounding the alarm on WiFi-connected toys. Glad @FBI is taking this cyber threat seriously #ioT\nhttps://t.co/u5l2zR8E93"]["Kickbacks to Wall Street brokers mean higher costs for workers' 401(k)/pension funds. I'm going to keep up the fight to reform this system. https://t.co/UYcExtLzb6"]["We saw democracy work today with #Trumpcare's failure. It's time to abandon the partisan repeal effort &amp; fix healthcare in a bipartisan way. https://t.co/XRLDpZNZGQ"]["Celebrating the centennial of Virginia's @NASA_Langley. Here’s to 100 more years of scientific leadership and discovery. #NASALangley100 https://t.co/W85Le7xh6p"]["Excited @Microsoft is investing in broadband for Southside, Va. I'll continue to work w/the private sector to make rural broadband a reality https://t.co/oIsVx9GLJy"]["This is why the Senate Intel Committee must continue its work. Russia will be back. https://t.co/hpeIfC8G5e"]["Three times https://t.co/H0EvTrltVV"]["(And would have said no to the meeting in the first place) https://t.co/mMpNToszN2"]["After meeting with Christopher Wray &amp; receiving his pledge to maintain the FBI's independence, I am announcing my support for his nomination https://t.co/FvtBdathRj"]["The ACA needs reforms, but gutting #Medicaid does nothing to fix it. Here are some fixes we proposed in 2014: https://t.co/vwPyFIAp53 https://t.co/zPgQtTGg61"]["Not true. #Trumpcare changes #Medicaid funding to a per-capita formula for all states. Bad for seniors &amp; families with complex medical needs https://t.co/wwZIm9ECyD"]["The numbers *still* do not add up. https://t.co/b4z4q05jw2"]["Thank you to the @LittleLobbyists &amp; parents for visiting and showing the Senate who #Trumpcare's #Medicaid cuts would hit hardest. https://t.co/iwPtBoXBDM"]["This investigation will move forward in a bipartisan way. We need to follow the facts wherever they lead."]["For all the denials we’ve heard from the administration, for anyone who’s said there’s smoke but no fire,  I’m curious what they’ll say now."]["There are no excuses for what we’ve seen in the last 24 hours. Lying is not a rookie mistake."]["We now know the denials of contacts with Russians that we've heard during the campaign, transition &amp; administration are all patently false."]["This is black and white: Trump officials at the highest levels knew Russia was working to aid Donald Trump &amp; welcomed Russia's interference."]["That’s why we have to continue this investigation. There’s a lot more work to do."]["Trump officials keep conveniently forgetting about mtgs with Russians, only to recant after being confronted with evidence to the contrary."]["More importantly, this follows a constant and troubling pattern from the Trump campaign and administration."]["I've been a candidate and a campaign manager. I can't imagine taking a meeting with a foreign lawyer claiming to have dirt on an opponent. https://t.co/xIgAK7IwlE"]["On President Trump’s meeting with President Putin: https://t.co/lzl2C7HY1v"]["An incredible story. I think we all owe SSG. Mangrum a debt of gratitude for his lifetime of service. https://t.co/STkIubGdjQ"]["It can and it must, for the good of workers and companies alike. https://t.co/wyS6in95yN"]["The U.S. is behind the curve when it comes to providing benefits for a changing workforce. Here's my idea for turning things around: https://t.co/uX0r6FpEOL"]["At the end of the day Capitalism 2.0 is about making sure everybody’s got a fair shot in a changing economy. #AspenIdeas @AspenFutureofWork"]["If companies can’t reform on their own, consumers (and voters) may demand these kinds of changes on their own terms #AspenIdeas"]["Beyond what government can do, consumers are demanding more responsible practices from the businesses they work for &amp; buy from. #AspenIdeas"]["We need a portable safety net with benefits that can follow these workers throughout their careers, wherever they work. #AspenIdeas"]["With the rise of the part-time, #Freelance, &amp; #GigEconomy workforce, fewer workers are spending their careers at one firm. #AspenIdeas"]["Tax credits &amp; capital gains reforms could incentivize reinvestment and reduce outsourcing &amp; short-termism. #AspenIdeas"]["And that money sure as heck isn’t going to the workers. It’s disproportionately benefiting investors and the management team. #AspenIdeas"]["Many companies are prioritizing short-term profit - buybacks and dividends - over workforce development and long-term investment #AspenIdeas"]["Our economy has changed since the Great Recession, and we need to hack capitalism in order to fix it. Here's where we can start. #AspenIdeas https://t.co/HY8443uXbb"]["@brianschatz @CoryBooker @ChrisMurphyCT thanks for cupcakes! I don't think my staff liked them very much... https://t.co/mis4ZE5f0X"]["A &lt;140-character lesson in how to disagree with someone respectfully, with dignity. https://t.co/gzONGVJWeZ"]["It’s the best way to fix our healthcare system once and for all. https://t.co/JIjHw2hkBf"]["The way to get it right: abandon partisan repeal &amp; fix the system in a bipartisan way. But we've not had a willing partner so far. https://t.co/DIxYDDLVWp"]["@Wontcoddleyou Yes, please call our Roanoke office: 540-857-2676. We'll do everything we can to help. - Staff"]["As a former Governor, I can promise you #Trumpcare would be a complete disaster for our state. https://t.co/ntMATMGYHE"]["Headed to the Senate Floor to speak out on behalf of Virginia families who will be devastated by #Trumpcare"]["This would be the time to scrap #Trumpcare, get everyone in a room, and fix our healthcare system in a bipartisan way. https://t.co/WQh0mACFty"]["When you repeal healthcare just for the sake of repeal, this is what you get. #ProtectOurCare https://t.co/XMWzrDd8T2"]["Breaking News: #Trumpcare still mean #CBOSCORE https://t.co/JcJrDKSAev"]["Last week alone, my office received 1800+ calls &amp; 4200+ letters opposing #Trumpcare. As #AmericaSpeaksOut, I hope my GOP colleagues listen."]["#Trumpcare puts nursing home care on the chopping block for seniors like Alice from Orange, Va.  #AmericaSpeaksOut https://t.co/Z4xwGUyzSj"]["#Trumpcare violates the standard of \"first, do no harm…on many levels.” - @AmerMedicalAssn #ProtectOurCare https://t.co/Rvoti8Hg3F"]["I do think so, and we need to do more to be ready. https://t.co/Aamtbg9bEp"]["#Trumpcare is a massive tax cut for the wealthiest Americans, and it cuts taxes on the backs of our most vulnerable. That's downright cruel."]["#Trumpcare is not a healthcare bill for the elderly, the disabled, or 1/3 of Virginia's kids who get their coverage through Medicaid."]["#Trumpcare is not a healthcare bill for patients with pre-existing conditions like diabetes, asthma, or depression."]["It's not a healthcare bill for the millions of Americans who will lose their insurance under #Trumpcare"]["Don't call this a healthcare bill. https://t.co/Fv8K0jp1pI"]["Russia targeted 21 state election systems, but the Administration refuses to tell the public which ones were targeted. That's unacceptable. https://t.co/XgjKfV51c3"]["WARNING: This is SATIRE. Everyone knows the GOP's Trumpcare meetings are held behind closed doors, not in forests. #ShowUsTheBill https://t.co/Rc7mSVKvlq"]["President Trump is right. Kicking millions off their insurance and gutting protections for people with pre-existing conditions is just mean. https://t.co/zhylHXpRVF"]["#NoHearingNoVote https://t.co/I6b7ddjlmw"]["You can read the full letter here: https://t.co/pVH8M8BYeK I hope tomorrow’s Intel Cmte. hearing on this subject will shed light as well."]["We need to be ready for Russian interference in future US elections. The more we know, the more we can be on guard to protect our democracy."]["Today I called on the Homeland Security Dept. to publicly disclose the extent of hacking attempts on state &amp; local election systems in 2016. https://t.co/IJrYxwBfYw"]["That’s the plan, Bharat. Let’s keep up the fight. #ShowUsTheBill https://t.co/743o9GMxud"]["I'd much rather hold hearings, markups &amp; debate on #Trumpcare like we do with every other bill, but Republicans won’t even #ShowUsTheBill https://t.co/ua2mEs1bVG"]["Rushing #Trumpcare to a vote with 0 hearings, 0 markups, and 0 amendments is not how the Senate is supposed to work. #ShowUsTheBill https://t.co/REumlYBYxa"]["Heartbreaking. Nabra's murder is a tragic, senseless act of violence. Our hearts are with the Hassanen family &amp; ADAMS Center community. https://t.co/oglGaQunER"]["I'm also saddened to learn we lost one of Virginia's finest, Dakota Rigsby. My heart is with his family, friends, and fellow sailors."]["Mourning our sailors lost aboard the USS Fitzgerald. This is a tragic loss for the Navy and our country. https://t.co/UNnBb6k2Kr"]["Good question. #ShowUsTheBill https://t.co/4bkfgHvNMj"]["Kicking kids off their insurance? We can’t let that happen. https://t.co/EYxGnSAKgM"]["Honored to join you today. Thank you for your continued service to Virginia’s veterans community and our country. https://t.co/n9rbrToDIz"]["The Trump Administration's decision to reverse progress in US-Cuba relations sends the wrong message to the world about American leadership. https://t.co/vcBIiGCwUw"]["@heatherscope My staff's been working on this for years. More research required before we can draw any conclusions. https://t.co/EgXemg4q4I"]["#Trumpcare hearings: 0 \n\nBackroom deals: 5 (so far)\n\nThis is not how our government is supposed to work. #ShowUsTheBill https://t.co/dgQ1aNz18g"]["Just in time for the #CongressionalBaseballGame https://t.co/Ci03AZXAeN"]["@timkaine @CapitolPolice @AlexandriaVAPD We're keeping @SteveScalise, Special Agents Griner &amp; Bailey, and Matt Mika in our prayers. Glad to hear Zach Barth was back at work today."]["The Senate came together today to unanimously pass our resolution with @TimKaine honoring the bravery of @CapitolPolice &amp; @AlexandriaVAPD. https://t.co/p1PlJSbdYH"]["Thanks to #DACA, #DREAMers can work, study &amp; contribute to their communities without fear of deportation. After 5 years, we know #DACAworks. https://t.co/5HWsXki2KD"]["@ASG316 @TamaraHiler @ThirdWayEDU @senorrinhatch Hi Ashley, if you give our Roanoke office a call (540-857-2676), we'll do everything we can to help with this. - Staff"]