["Much welcome and anticipated news from the @DeptVetAffairs today to revise regulations on reimbursement for emergency treatment of veterans. This revision will have a profound impact on Idahoans. https://t.co/FV9khOP17V"]["I look forward to reviewing the over 100 recommended actions by @USDA Task Force on Agriculture and Rural Prosperity report and continuing to work with my colleagues in the Senate to advance policies that meet the needs of rural Idaho. https://t.co/Tb3pTTgvjc"]["Happy National #LawEnforcementAppreciationDay to all of Idaho’s women and men in uniform who place their life on the line every day to protect us in our communities. Thank you for your dedication and commitment to our safety in Idaho and elsewhere across America. https://t.co/6cSxkwlpPR"]["#ICYMI my joint column with @SenatorRisch on the #TaxCutsAndJobsAct benefits for the American people and economy. (via Independent-Enterprise of the @argusobserver) https://t.co/X5fpaaqLEb https://t.co/wGsw3qUq3s"]["Airman 1st Class Cody Gilbert joined the Idaho Air National Guard after attending the Idaho Youth ChalleNGe Academy. (via @DeptofDefense) https://t.co/le82lBrkOj"]["Today I join @LDSchurch in mourning the passing of @ThomasSMonson. https://t.co/v3zEYSFSMU"]["Congratulations to #TwinFalls teacher, Benita Remaley, for receiving Idaho's Smart/Maher @VFWHQ National Citizen Education Teacher Award! https://t.co/JBVaQR4d60"]["#NYE2017 Happy New Year! https://t.co/OiGfWdWn82"]["Wishing you a happy birthday, @JeffFlake!"]["Happy birthday, @SenatorIsakson!!"]["Wishing all a very Merry Christmas! https://t.co/PoKCyInILM"]["Happy birthday, @SenTedCruz!"]["This #TaxReform will produce growth not seen in generations. (cc @SenateGOP) https://t.co/TmGG0UMpYr"]["#ICYMI: My column this week honored the ten 2017 Hometown Hero Medal recipients. #idahome (via @Idaho_Politics) https://t.co/Fd09HwhLjp"]["Happy birthday, @senrobportman!"]["Today marks 226 years since the ratification of the Bill of Rights to the U.S. Constitution. Happy #BillofRightsDay! https://t.co/T8nhW5OrDY"]["Happy birthday, @MarkWarner!"]["#ICYMI: My weekly column on celebrating adoption: making the dream of a family a reality. (via @argusobserver) https://t.co/8rX2R9Lb6t https://t.co/JtnTJBVraP"]["Happy birthday, @NationalGuard! https://t.co/lTvAWzBSQa"]["(2/2) and I look forward to continuing to work with Battelle Energy Alliance https://t.co/4h8LbWCVUG"]["(1/2) I appreciate the commitment shown by DOE in announcing the contract extension for management at the Idaho National Laboratory.  As the nation’s lead nuclear laboratory, the INL has produced cutting-edge energy and national security research..."]["Hope you both have a great birthday, @JohnBoozman &amp; @sendavidperdue!"]["Happy birthday, @SenGillibrand!"]["Without the SRS program, existing revenue-sharing payments are not sufficient to support critical services these counties must provide. https://t.co/VPKtD3xn7x"]["Myth vs. Fact on Senate Tax Reform. https://t.co/YuBLVpG4uL"]["#ICYMI: My column on an all hands on deck approach to fighting the opioid crisis. (via @twinfallstn) https://t.co/9uJl4D8N88 https://t.co/NLJVdViyC1"]["Wishing fellow Idahoan, @Raul_Labrador a happy birthday today."]["In addition to Pearl Harbor, we remember the December 1941 attack and imprisonment of those on Wake Island. I presented this Congressional Record Statement this past summer to family members of survivors and POWs. May their heroism never be forgotten. https://t.co/32taBB0hXf"]["On the 76th anniversary of the “date which will live in infamy,” we remember the lives lost and the heroism of the many women and men who defended our freedoms in World War II. #PearlHarbor76 #PearlHarborRemembranceDay https://t.co/Jy4H4kgLhn"]["Happy Birthday, @SenThadCochran &amp; @SenatorCollins!"]["Today, the Senate Banking Committee is marking up the “Economic Growth, Regulatory Relief and Consumer Protection Act.” Here’s a look at what folks are saying: https://t.co/e4R92qUNRa"]["Happy birthday, @SenatorBurr!"]["#ICYMI: My #WeeklyColumn on improving veterans' educational benefits. (via @Idaho_Politics). https://t.co/UrKvw60NPp https://t.co/HVDOlYfDz9"]["Happy birthday, @SenBennetCO!"]["Happy birthday, @SenCapito!"]["Happy #SmallBizSat to Idaho’s over 150,000 small businesses. #ShopSmall today! https://t.co/hQez2FQBbZ"]["Wishing all a very happy Thanksgiving! https://t.co/u440TdRMdW"]["Happy birthday, @SenSchumer!"]["Happy birthday to both of you, @SenJohnKennedy &amp; @SenatorDurbin!"]["Happy birthday, @JimInhofe &amp; @SenToomey!"]["Passage of the #NDAA signals our commitment to our military men and women and their families. https://t.co/rcs0FmOOfb"]["#TaxReform https://t.co/OKecIhEbZh"]["Happy birthday, @SenDanSullivan!"]["Happy birthday, @SenJackReed!"]["Happy Veterans Day and thank you for your service! #VeteransDay https://t.co/yY8GIFkvRu"]["Happy Birthday, @USMC! #USMC242 https://t.co/lOTsJr7JKP"]["The Senate Finance Committee today released @SenateGOP's proposal toward Congress' shared goal of delivering meaningful, pro-growth #TaxReform.  I remain focused on working with my colleagues to develop a comprehensive measure that results in a fairer, simpler tax code. https://t.co/lbFMaLoK1E"]["I look forward to hearing more from Jay Powell during his nomination hearing. https://t.co/58x2p2aN8u"]["Wishing a happy birthday to my colleague @SenSherrodBrown!"]["22 individuals will receive this year's Spirit of Freedom: Idaho Veterans Service Award. https://t.co/3k8jRaXbLN https://t.co/ORYnphVil7"]["#SafeguardSacredItems https://t.co/mvxkB2OT4M"]["The Banking Committee today sent a clear signal that the U.S. is serious about increasing pressure on DPRK. https://t.co/diDOMUJ0yn"]["My statement on the passing of former Idaho Representative Orval Hansen: https://t.co/WkCSC1Xecw"]["#ICYMI: My #WeeklyColumn on Veterans leading the way in helping others (via @uvsj) https://t.co/PktLnqulPT"]["Happy birthday, @maziehirono!"][".@POTUS has signed into law a bill that will nullify a controversial CFPB rule. https://t.co/WfOhh835yk"]["The @tfpl2 is hosting a month-long celebration of veterans, active duty military &amp; their families. Event information in the image attached! https://t.co/7r7E6NmWra"]["#ICYMI: My #WeeklyColumn and the 4th in a series on #TaxReform (via @Idaho_Politics) https://t.co/iXDGqUsrwW https://t.co/4sJWzXMxvZ"]["Happy birthday, @SenJeffMerkley and @SenatorRounds!"]["#ICYMI: My column discusses 5 significant #TaxReform proposals to follow as we move forward (via @Idaho_Politics) https://t.co/cGbUbLLfAD"]["Wishing happy birthdays to @SenKamalaHarris, @SenBrianSchatz, and @SenWhitehouse!"]["This National Forest Products Week, we #CelebrateFP for forest contributions in our everyday lives. https://t.co/TiQVzuYw8a"]["My prayers are with the family of former Idaho State Senator John Andreason. https://t.co/KgcEAqSyd7"]["#MeTooEndsWithMe https://t.co/hoKF3BK0Rt"]["Happy birthday, @MartinHeinrich!"]["#ICYMI: My #WeeklyColumn on actively protecting your identity. (via @twinfallstn) https://t.co/INh99fjhx2 https://t.co/Wpjw7VJAbV"]["I'm a co-sponsor of a bill that would allow fire-prone communities to apply for @fema Hazard Mitigation grants https://t.co/ahn6mEQOK7"]["Wishing you a happy birthday, @SenatorCantwell!"]["#NationalFarmersDay in Idaho numbers https://t.co/NQOj4Peqnv"]["Happy #NationalFarmersDay! https://t.co/CEqsQzfPcS"]["Happy birthday, @PattyMurray!"]["REMINDER: My Spring 2018 internship application closes next Monday, October 16! Visit my website to learn more. https://t.co/sVusgsnhbT https://t.co/kCjzzkK24V"]["I voted in favor of the RAISE Act earlier this week, which passed the Senate by unanimous consent on Tuesday. https://t.co/pqa4th8SjM"]["Recognition by the Administration as to the need for emergency fire funding is important. https://t.co/DnRgnWGqcv"]["I asked #Equifax to explain what products are being offered to Idahoans and how they can obtain them. (2/2) WATCH: https://t.co/NJ5OYiGM7w"]["Following the #Equifax breach, there has been some confusion about what steps people should take and difficulty accessing products. (1/2)"]["#ICYMI: My #WeeklyColumn on a comprehensive #TaxReform. https://t.co/IrKkQZ41oL https://t.co/P5Tp5doclG"]["My statement on #LasVegas https://t.co/Pv7x8iBuvh"]["Happy birthday to both @SenDonnelly and @SenBillNelson!"]["#TaxReform must be pro-growth and comprehensive. https://t.co/XHAls5q7g7"]["Yesterday, I met with Cassidy (Twin Falls), a finalist for the @BGCA_Clubs Youth of the Year. Her work in her community is truly admirable. https://t.co/V4lyNJxm5z"]["On wildfire funding: \"We need to come together and say, 'no more waiting.'\" (via @SpokesmanReview @BetsyZRussell) https://t.co/lhRYoRLvmf"]["@RonWyden &amp; I have long been champions for the Wildfire Disaster Funding Act. Thanks to @SecretarySonny for his attention to a #FireFix https://t.co/10w3WJ0UPV"]["Thank you for your attention to this matter, Secretary. https://t.co/W4cY5YYQyp"]["Joining @RonWyden @SenatorRisch &amp; other western Senators to discuss Wildfire Disaster Funding Act with @SecretarySonny #firefix https://t.co/xupOROoR0w"]["#ICYMI: My #WeeklyColumn on raising awareness about military suicide. #BeThere (via @twinfallstn) https://t.co/fDtvEQH8hV https://t.co/wGUxmRqlwp"]["Happy #FirstDayofFall! https://t.co/J0oLCSnnIw"]["Wishing my friend @SenatorDole well and praying for a quick and speedy recovery."]["Meet my summer 2017 DC interns! Spring 2018 application closes 10/16. \n \n🎦: @HunterFunk20 \nhttps://t.co/M41NKG9glr https://t.co/aLeBXRDs1H"]["Happy birthday, @SenatorTimScott!"]["#ICYMI My #WeeklyColumn on the 75th anniv. of the opening of the historic Minidoka War Relocation Ctr (via @uvsj) https://t.co/IONYOI8Xo2 https://t.co/nhz2NfZd3W"]["Thank you for 70 years of service to Idaho and our nation, and to many more in the future. (2/2) https://t.co/dIjlET5YYy"]["The men and women who make up the Idaho Air National Guard are central to our state and national defense. (1/2)"]["The 124th Fighter Wing based at Gowen Field in Boise has deployed various times in vital overseas missions. (2/2) https://t.co/xugDU0V3Ez"]["On the birthday of the Air Nat'l Guard, discover some of the 124th Fighter Wing, Idaho Air Guard’s recent notable awards &amp; deployments (1/2) https://t.co/7VuZT4GiO3"]["Happy 70th Birthday to the Air National Guard! #ANG #AFBday https://t.co/czuBLUGXTM"]["“Aim High…Fly-Fight-Win.”  Happy 70th Birthday, @usairforce! #AFBday https://t.co/ich5qDo7oC"]["Happy #ConstitutionDay! https://t.co/aNCsTsdA4K"]["Happy Birthday to chairman of @senjudiciary and Senator from Iowa, @ChuckGrassley! https://t.co/jUipPxN5bI"]["Don't forget about Orofino Lumberjack Days happening now through Sunday! #Idaho https://t.co/dXMBHjpzjq"]["On National #POWMIARecognitionDay, we solemnly remember the sacrifices made to defend our nation and those who have yet to return home. https://t.co/7x8F5mKVXJ"]["Touching images from the City of Hayden's #September11 ceremony yesterday. Thanks, Duane Rasmussen, for sharing these with me. https://t.co/Ix7vCK4XAC"]["@RonWyden and I agree: This fix is long overdue and people throughout the West desperately need our help. https://t.co/DCEXmgydnD https://t.co/fRaVQnxpBR"]["May we #NeverForget. #911 https://t.co/xFMVV3nBk1"]["#ICYMI: My #WeeklyColumn on S. 1752, the Emergency Fuel Reduction Act. #idpol (via @uvsj) https://t.co/brt1hTuIg5 https://t.co/n4G9rWdxGn"]["Wishing you a happy birthday, @ChrisCoons!"]["@RonWyden, Senate colleagues &amp; I sent a letter to Senate Leadership asking that any future disaster aid package include wildfire funding fix https://t.co/soutdebHc7"]["Mountain Home Air Force Base Appreciation Day kicks off tonight at 5:30PM with the kids &amp; adult fun runs. Parade begins tomorrow at 10:30AM. https://t.co/N3QT0CWsyp"]["@BLMNIFC Over 630k acres have already burned in 2,506 #IDFires in this year alone. (2/2)"]["@BLMNIFC reports 8 currently active wildfires in ID affecting more than 140k acres. (1/2) https://t.co/RWpIDd2d12"]["Happy birthday, @SenSanders!"]["Wishing a happy birthday to fellow Idahoan, @CongMikeSimpson!"]["Fires continue to rage the northwest. Fires in OR, MT &amp; ID have significantly reduced air quality in the region. https://t.co/ESdrtArfHh"]["The @TheJusticeDept will end Operation Choke Point, a flawed initiative that often targeted law-abiding businesses. https://t.co/WQ3lIZL4U5"]["Thanks to @IdahoVoices for stopping by to visit staff at my Boise office yesterday to share their experiences dealing with the #CHIP program https://t.co/9gnUHPrlWE"]["Idaho under air quality advisory. Learn how you can reduce smoke exposure (via @IdahoStateJ) https://t.co/wx2TQPf0yf"]["Jackson Sundown was a well-loved and well-known celebrity after his 1912 riding of a bull at Border Days. (3/3)"]["At this year’s Roundup, Nez Perce cowboy Jackson Sundown will be commemorated on the 100th anniversary of his last visit to the valley (3/5) https://t.co/kwtjUTN3R7"]["Today begins the 83rd Annual Lewiston Roundup, which donates portions of its proceeds to charity organizations throughout the year. (1/3)"][".@WestPoint_USMA will be hosting an admission info event @ Gowen Field, 9/23 in #Boise. RSVP to email in image. Photo ID required to attend. https://t.co/x2yl6mo91P"]["My statement on @POTUS action on #DACA https://t.co/aArSxYPl3s"]["Wishing all a happy Labor Day!"][".@mpdailynews referenced the Veterans Health Administration Reform Act that I have introduced. Read about my bill at https://t.co/ocMjCvAR7M"]["Thanks to those who joined us! RT: Veterans explain medical care concerns to Sen. Crapo https://t.co/IIWlFL9k6v via @mpdailynews"]["In the #Orofino region today &amp; always have time for a stop at the #Dworshak Dam and Reservoir on the #Clearwater River. https://t.co/ob2Kz4wpKh"]["More about the SJC staff @INL and their efforts to support #soldiers and #veterans can be found at https://t.co/6BXc7ybM6L #IdPol"]["Congratulations to the SMC staff @INL! They have earned my Spirit of Idaho award for supporting local soldiers, veterans, &amp; their families. https://t.co/WxaGSc2Bvc"]["Productive meeting yesterday with Kootenai Valley Resource Initiative Board of Directors in Bonners Ferry, ID https://t.co/5Pu14lVwKl"]["Have a great birthday, @SenThomTillis!"]["Happy birthday, @SenJohnMcCain!"]["Today I recognized Scouts from Troop 7 of the #SRCouncil for their work &amp; fundraising efforts to save the @AmericanLegion hall in Filer. https://t.co/o13B6ZKlgJ"]["Great to meet with you and thank you for sharing your personal insights! https://t.co/v3tFHQQz48"]["Tune in now to @kidnewsradio as I discuss national issues with @realneallarson. https://t.co/oPKNaNtRNN"]["Governor Andrus was a dynamic leader. I send my heartfelt sympathies to his family. https://t.co/AE6v2Y7FZh"]["Thanks, @Davenport25 and @kpvi for having me tonight! #idpol https://t.co/3gWXh0iiZ0"]["I'll be joining @KPVI live momentarily. Tune in as I discuss issues important to Idahoans. https://t.co/yXBoqc7vbg"]["Thanks to @librarycongress surplus books program, I donated books to Lincoln Elementary &amp; joined students to read 'Whistle for Willie' today https://t.co/Sw40J4ooLe"]["Happy Birthday, @SenBobCorker, @SenToddYoung, and @Sen_JoeManchin!"]["@Sen_JoeManchin &amp; I intro'ed legislation to create a new Congressional Gold Medal in memory of those who fought in defense of Wake Island"]["I presented a Congressional Record Statement to family members of survivors &amp; MIA/POWs of the Dec 1941 attack an imprisonment at Wake Island https://t.co/rUDSGom87t"]["@kevinmillershow @KIDOTalkRadio Great conversation with @kevinmillershow this morning discussing issues important to Idahoans. #idpol https://t.co/1aHSgqc5JE"]["I'll be joining @kevinmillershow live on @KIDOTalkRadio momentarily! Tune in to 107.5FM, 580AM to listen!"]["Caldwell High TRiO Upward Bound students are already leaders in their school &amp; making great strides in the pursuit of postsecondary ed. https://t.co/ITjDGlBy4o"]["Joined @Raul_Labrador &amp; @SenatorRisch to present @theaward to outstanding Idaho youth. #idpol #idahome https://t.co/c6DoeJIYDg"]["Happy birthday, @SenCoryGardner!"]["Happy birthday, @SenatorTester!"]["Wishing you a happy birthday, Senator @SteveDaines!"]["@IdaHumanRights @IdahoStatesman @IdahoStateJ @Boiseweekly Working w/efforts across Idaho to advocate for the dignity of all individuals is a rewarding part of my time in public service. (4/4) #idpol"]["@IdaHumanRights @IdahoStatesman @IdahoStateJ @Boiseweekly Idaho has a long history of combating racism and discrimination, making strides in #humanrights for over a century. (3/4) #idpol"]["@IdaHumanRights @IdahoStatesman @IdahoStateJ @Boiseweekly Boise is home to the only Anne Frank Memorial in the United States. (2/4) #idpol"]["@IdaHumanRights celebrates 15 years of the Anne Frank Memorial in Boise today. (1/4) #idpol #humanrights https://t.co/22898mMwBL"]["Tomorrow, @IdaHumanRights will host 15th anniversary celebration of Anne Frank Memorial in #Boise #idpol  https://t.co/355rz4BBee"]["@MicronTech ...and development facility in the Western Hemisphere.  The new facility on the Boise campus will host a giant cleanroom for research. 2/2"]["I congratulate @MicronTech on the ribbon-cutting event today to open what is being called the finest tech research... 1/2"]["My statement on Saturday's event in #Charlottesville. https://t.co/nEowcJUszJ"][".@SenMajLdr does the yeoman’s job under these very difficult circumstances. (2/2)"]["I support @SenMajLdr. Senators are all individually powerful.  There will always be differing &amp; strong opinions on key issues. (1/2)"]["Happy 227th birthday, @USCG! #SemperParatus #NationalCoastGuardDay https://t.co/2JFjJ0fAKK"]["As Americans, it is our duty to bring home those who have sacrificed so much for our country (via @uvsj) https://t.co/yy2N1AAd6p"]["Happy birthday, Senator @ChrisMurphyCT!"]["Ryan Nelson's background is a strong fit for @Interior #idpol https://t.co/EdpY86Tc0j"]["I nominated Dixie Weber of ID for @CCAInstitute's #AngelsInAdoption for her support of @StLukesHealth patients considering adoption"]["Had the privilege of meeting with bright young Idaho leaders from @ALBoysNation &amp; @ALAGirlsNation today! #2017BoysNation #ALAGirlsNation17 https://t.co/R3XkefK8jo"]["#ForeverGIBill to improve veterans' education benefits includes provision inspired by Idahoan.  https://t.co/xAMM5PGMZg"]["Why we need #RussiaSanctions: Russia's increasing aggressive actions are a threat to our nat'l &amp; economic security https://t.co/k4ZBWlUrxz"]["Great to see @girlscouts offering new badges to encourage young girls to learn about STEM and outdoor skills! https://t.co/qYvna4F482"]["Happy birthday, Senator @clairecmc!"]["Thank you to the VSOs who offered support for my bill, S. 1279, to address needed reforms for our nation’s veterans. https://t.co/spUudkxaXi https://t.co/bOGwNyVnQa"]["I look forward to welcoming @SenJohnMcCain back to the Senate. (2/2)"][".@SenJohnMcCain has demonstrated that he is a fighter. He will win this battle &amp; I send my prayers to him &amp; his family for his recovery. 1/2"]["Great to have Brenda H. from #TwinFalls in DC to testify before the @BankingGOP committee hearing on the need for #GSEreform today #idpol https://t.co/XEKyPmIYtQ"]["The introduction of the Restoration of Powers Separation Act is a crucial first step in restoring the proper role of judicial review. #idpol https://t.co/dfHUcgwT8G"]["Congratulations, graduates! https://t.co/9teFtAbxkD"]["Kindness, support &amp; respect run deep in Idaho. Hateful acts like these are detestable, &amp; I commend those countering hateful acts w/kindness https://t.co/5OORv9J0KZ"]["Thank you, Cpl. Baldwin, for your courageous service to our nation. Idaho is proud to have you as one of its own. https://t.co/1luiSNQbe0"]["Great to see students like Aziz representing Idaho! Aziz is a @nationalbeta's John W. Harris Leadership Award winner! #betacon17 #idpol https://t.co/vMa4vG8cbZ"]["I congratulate Judge Nye on his confirmation today. #idpol https://t.co/wyTKlfa8NG https://t.co/VhU9mtNVBj"]["Judge Nye is a supremely qualified candidate for a federal district court seat in Idaho #idpol https://t.co/cgUF6WeVdt"]["Happy birthday, @SenMarkey!"]["Wishing you a happy birthday, @LindseyGrahamSC!"]["Happy birthday, @SenatorWicker!"]["Happy 4th of July! #IndependenceDay https://t.co/9tMeEGhJDr"]["#OTD: #Idaho became the 43rd state admitted to the union! Check out @LibraryCongress Idaho #map collection https://t.co/fhpB5lTb6Z"]["Saddened to learn of the death of SFC Erin Smith. \nhttps://t.co/AsbUO3CFvI (via @IdahoStatesman) https://t.co/xtHMMOoZOz"]["Happy birthday, @SenAlexander!"]["Wishing you a happy birthday, @SenJoniErnst!"]["\"The President's tweets were unnecessary.\" -Senator Mike Crapo"]["@maggieKTVB7 @SenatorRisch @Morning_Joe The President's tweets were unnecessary."]["Tune in now: joining @realneallarson on KID Newsradio 590/92.1 live from Washington, DC https://t.co/hFSxUcQVua"]["HAPPENING NOW: joining @kevinmillershow live from D.C. to talk on 580 KIDO. Tune in now! https://t.co/FcyqGr38ia"]["Wishing both @SenFeinstein &amp; @SenWarren a happy birthday today!"]["Take the mystery out of #PTSD and spread the word about effective treatments. https://t.co/v3K6oyJluh"]["ICYMI: My #WeeklyColumn on raising awareness for PTSD. (via @Idaho_Politics) https://t.co/vDretpyMzy https://t.co/ppxpe9SyJw"]["Thanks to @VAChair for allowing me to provide statement on important Shauna Hill Post-9/11 legislation I introduced w/@SenatorRisch https://t.co/JoaumCHOqo"]["During #PTSDAwarenessMonth, know where veterans and their families can get help. Learn more through @VA_PTSD_Info https://t.co/AgVxcO3TkK https://t.co/63evQ2Qf42"]["This bill demonstrates the United States' commitment to the sanctity of territorial integrity, human rights &amp; good governance. https://t.co/z6A1Xm27az"]["BLOG: Crapo-backed Russia sanctions bill passes Senate https://t.co/YC8BEHqYdN via @twinfallstn"]["This bill will result in very powerful new sanctions against Russia. https://t.co/HxWQTfr2lr"]["Happy 242nd Birthday to the @USArmy! Thank you for your service.  #ArmyBDay https://t.co/7ajWdPD57F"]["My statement following this morning's shooting at a congressional baseball game practice. https://t.co/SIPjzgO7gS"]["Praying for @SteveScalise and congressional staff shot at baseball practice this morning. https://t.co/xDVBKZskVz"]["This important bipartisan legislation will strengthen and expand Russia sanctions. https://t.co/xcj5eYq69y https://t.co/cxfRiif4qO"]["I joined colleagues on Banking &amp; Foreign Relations Cmtes to introduce a bill to strengthen &amp; expand Russia sanctions https://t.co/oa0VzJ55zr"]["For some people with #PTSD, it can be hard to reach out for help. Learn how to overcome barriers to care. https://t.co/T6bHpHEsbg"]["Wishing the happiest 93rd birthday to President #41 @GeorgeHWBush! Thank you for your shining example of public service. https://t.co/HKK72qj74h"]["During #PTSDAwarenessMonth, understand key info about PTSD. Learn more through @VA_PTSD_Info https://t.co/ETi2i2O7I1 https://t.co/kZOeKdRsGG"]["#ICYMI: I introduced the @VeteransHealth Administration Reform Act to streamline and improve health care for veterans. #idpol https://t.co/2Wt9B6r8aJ"]["Happy birthday, @SenMikeLee!"]["Met with members of the Clearwater Basin Collaborative yesterday in Orofino. #idpol https://t.co/enYl2momEC"]["Good to join @kevinmillershow @KIDOTalkRadio today to discuss my new VHA Reform bill to address needs of Idaho veterans https://t.co/kB77yXb60n"]["Visited Lewiston Orchards Irrigation District to learn about collaborative solution to assist salmon species &amp; preserve H2O for domestic use https://t.co/tGsmm2PWEd"]["This #MemorialDay, we honor and remember the fallen brave men and women who went above and beyond the call of duty. https://t.co/KZaZRqmkpc"]["Happy birthday, @JerryMoran!"]["Happy birthday, Senator @marcorubio!"]["Happy birthday to my colleague from Minnesota, Senator @amyklobuchar! https://t.co/wcLfMNl03x"]["Yesterday, members of my staff joined @ClifBar CEO, @KevinClearyCEO, to #LoopTheLincoln for #OrganicWeekDC. Clif Bars are made in #TwinFalls https://t.co/86RufTl2D9"]["Congrats to the Boise VAMC for receiving the Greenhealth Emerald Award from @pracgreenhealth! via @IdahoStatesman https://t.co/DBrPbUqtHH"]["Happy birthday, Senator @lisamurkowski!"]["Happy birthday, @alfranken!"]["On #ArmedForcesDay, we thank all the men and women in uniform for their service to our country. https://t.co/NPizinSmiy"]["Congrats, graduates! https://t.co/mll61aHpbj"]["Happy birthday, @SenatorTomUdall!"]["Praying for your speedy recovery, @maziehirono https://t.co/NvDp8c3OtP"]["I am glad to hear you're doing well, @SenThomTillis. I offer my prayers for a full recovery! https://t.co/taRjXhRRVc"]["Today I joined @ChuckGrassley, @SenFeinstein, &amp; 61 other colleagues to support a Senate Resolution to commemorate #NationalPoliceWeek2017"]["Thank you to the courageous men &amp; women in law enforcement who put their lives on the line every day to keep us safe #NationalPoliceWeek https://t.co/Udy3skJuKe"]["Happy birthday, @SenTomCotton!"]["Congratulations, grads! https://t.co/bnybk3QxHF"]["Congratulations, graduates! https://t.co/ksMXrAa2m6"]["Wishing you a happy birthday, @SenDeanHeller!"]["Congratulations, @AlbertsonsCos! https://t.co/2PQgfeycH2"]["Joined @SenStabenow to reintroduce bipartisan legislation to address veterinarian shortage in rural communities https://t.co/lCr8mtS4yL"]["ICYMI: My #WeeklyColumn on addressing the need for more veterinarians. (via @uvsj) https://t.co/FWVeQKpq5X https://t.co/P9WhIcCDWt"]["Congratulations, graduates! https://t.co/cODhrG24ZC"][".@SenatorRisch and I welcome the nomination by @POTUS of Judge Nye to serve as U.S. District Judge for #Idaho. Cc. @senjudiciary #Law #Legal https://t.co/ySyddyMxvA"]["!ALERT! for veterans: @DeptVetAffairs has identified a fraudulent VCP phone number. See attached photo for more info. https://t.co/SbnE1IqVT1"]["Happy Birthday, @SenShelby!"]["Congratulations, graduates! https://t.co/qBToamkqEL"]["The omnibus spending bill does not go far enough to address our nation's fiscal health. Read my full statement here: https://t.co/pRBhSdTAtF"]["I joined @SenatorRisch &amp; other Senate colleagues to introduce extension of Secure Rural Schools funding. https://t.co/ha02No1bYO https://t.co/C4XGRCaw8n"]["Honored to have earned top award for conservative votes from the American Conservative Union Foundation.  https://t.co/u3lVII1pcs"]["Happy 50th Anniversary of earning your nickname, Gunfighters! https://t.co/eFNWnzhRad"]["Proud to join @SenatorRisch to support our veterans. Thank you @SenThomTillis &amp; @SenGaryPeters for your leadership. https://t.co/RRtcFfWU1s https://t.co/tmJbB2x2t8"]["Thank you for presenting me with this award. https://t.co/P9BAM1LSp1"]["Wishing a happy birthday to my friend, fellow Idahoan, and Senate colleague, @SenatorRisch! https://t.co/eEwUkW7dBG"]["Happy Birthday to Oregon Senator, @RonWyden!"]["Happy to support Jay Clayton as the next @SEC_News Chair. https://t.co/2cipJ1pPEd"]["Happy Birthday, @SenStabenow!"][".@HeatherAnWilson visited this week to discuss her nomination by @POTUS to be Secretary of @USAirForce. Congratulations on your nomination. https://t.co/aFbXfDNaak"]["Best of luck to the 4 Idaho schools participating in the @DOE_SC_NSB  this week/weekend! #NatSciBowl https://t.co/LIxFPu9u6L"]["I met today with Mary Spiker, Idaho’s Teacher of the Year from Wilcox Elementary in #Pocatello. Congratulations on your achievement. https://t.co/0Dct5lPbpO"]["Happy #EarthDay! https://t.co/r5dR0xXj0T https://t.co/JOkWSAs4l8"]["In celebration of #NationalParkWeek, all @NatlParkService sites will offer free admission 4/22-23! #FindYourPark https://t.co/ZxbAPMaav6"]["Happy birthday, @SenPatRoberts!"]["Good luck to the 96 Idahoans registered to run the world’s oldest annual marathon, @bostonmarathon, today! #Boston2017"]["Wishing you all a Happy Easter! https://t.co/fpN6n5UsuZ"]["REMINDER: ID delegation staff will join individuals from each of the Service Academies TODAY to discuss academy application processes. https://t.co/YGH54fjvSM"]["Happy Birthday to the Air Force Reserve. Thank you for your dedication to service and defense of our nation. https://t.co/TtbaHW6WA2"]["It was an honor to attend the swearing-in ceremony of Justice Neil Gorsuch to #SCOTUS, hosted this morning at the @WhiteHouse by @POTUS https://t.co/xOqCS1644D"]["Judge Gorsuch has been confirmed to #SCOTUS https://t.co/eZBGLxx8Ba"]["My statement on @POTUS-directed military strikes in Syria. https://t.co/dRjEXpxXRw"][".@senjudiciary His nomination now goes before the full Senate. #ConfirmGorsuch (2/2) https://t.co/G62AjcmE53"]["I joined a majority of @senjudiciary members to favorably recommend the nomination of #JudgeGorsuch to be Associate Justice of #SCOTUS (1/2)"]["Happy birthday to both @SenAngusKing and @SenatorLeahy!"]["Neil Gorsuch is the American ideal of a jurist. #ConfirmGorsuch #SCOTUS https://t.co/DtrY5BdLvJ"]["Update: My floor speech supporting Judge #Gorsuch will now occur closer to 12:50p EDT. Watch on CSPAN-2 or stream @cspan. Cc @senjudiciary"]["I will be speaking live from the Senate floor at 12:30EDT in support of Judge #Gorsuch. Watch on CSPAN-2 or stream @cspan. Cc @senjudiciary https://t.co/UEoPq4THqH"]["Wishing you a happy birthday, @SenCortezMasto!"]["#ICYMI: #Gorsuch correctly defines the job of a judge: Judicial duty is to follow the law #ConfirmGorsuch https://t.co/kxxbaDj3Vm https://t.co/ewLe3hLyvl"]["Capo Honors Fallen Idaho Airman, Staff Sgt. Alex Morrow\n\nhttps://t.co/G0Asz4r3r6 https://t.co/ptGuPgdMIq"]["@ChuckGrassley enjoying #Idaho product @Chobani during short breaks during @senjudiciary hearing on #JudgeGorsuch nomination to #SCOTUS https://t.co/wjicGSAN7e"]["Happy birthday, @SenOrrinHatch!"][".@SenateGOP on #Periscope: Sen. @MikeCrapo reacts to today's @SenJudiciary #SCOTUS hearing. #ConfirmGorsuch https://t.co/dH2LxkmvxI"]["As I stated @senjudiciary today, Judge #Gorsuch is exactly the model for appointment to #SCOTUS https://t.co/rF7oQOEjy0"]["Proud to see #Idaho home-state products @senjudiciary hearing on #SCOTUS nominee Judge Neil Gorsuch @Chobani @ClifBar https://t.co/1FeF31PtkG"]["In advance of @senjudiciary hearing today at 11AM ET, here are 5 facts relating to #SCOTUS that you may not know https://t.co/GQw1CJFt79"]["ICYMI: My #WeeklyColumn on over-regulation via @IdahoMtExpress https://t.co/WXViSQleI9 https://t.co/qfBC6yiBC8"]["Happy St. Patrick's Day (featuring #idaho made products)!!! #StPatricksDay https://t.co/6MkXlzPO6c"]["@twinfallstn hosted a forum last night aimed at breaking the cycle of silence for domestic violence victims #VAWA https://t.co/wZPDScvIwz"]["@FLOTUS announced today that the online lottery for White House Easter Egg Roll opens today at 12pm ET: https://t.co/ULuCh3VmUf"]["\"And now, some good news: #Idaho tops nation in #jobgrowth, led by construction\" https://t.co/9yPqoRMLEA via @IdahoStatesman"]["We have our work cut out for us, but we have a great opportunity within reach to truly bring about needed changes. https://t.co/YpPxrgN9fT"]["Happy birthday, @SenJohnHoeven!"]["Happy birthday to my colleague from Illinois, @SenDuckworth!"]["Last night, Farhana Hibbert of my staff was honored as one of @IBRnews' 2017 Women of the Year. Thanks for your work, Farhana! #IBRawards"]["REMINDER: ID delegation staff will join individuals from each of the Service Academies TONIGHT to discuss academy application processes. https://t.co/bLzHq3n4Xj"]["Thanks to Tom and Greg of the Professional Fire Fighters of Idaho for stopping by earlier this week. https://t.co/SzlBHKZsPM"]["Yesterday, I met with several members of the American Coalition for Taxpayer Rights. https://t.co/MAJ1x4NOCO"]["Thanks for stopping by! https://t.co/JzEnBMaYvz"]["On #InternationalWomensDay, I recognize the leadership and commitments of the women on my staff. #IWD2017 https://t.co/t9t3KtozQv"]["Great to meet with members of @uidaho College of Agriculture and Life Sciences yesterday. https://t.co/LgkPNNVi64"]["I am a proud supporter of @SenDeanHeller’s Bring Our Heroes Home Act. Thank you, Robert and Lois for your kind words https://t.co/SU3BIhaUDB"]["#otd: Lewiston became the capital of Idaho Territory 154 years ago. https://t.co/rmZJ0KFETj"]["Wishing you a happy birthday, @SenatorLankford!"]["REMINDER: ID delegation staff will join individuals from each of the Service Academies TONIGHT to discuss academy application processes. https://t.co/sLORKlMM7M"]["Congratulations to new @ENERGY Secretary @GovernorPerry. I look forward to working with him to continue the good work being done by at @INL https://t.co/qIKIRNkzsX"]["Glad to support @RealBenCarson today for Secretary at @HUDgov. He will be a strong partner on many important issues. #housing https://t.co/Hr2FWDaMio"]["The President outlined an optimistic vision for America. https://t.co/tNyTf5bdkW https://t.co/fBYQwSLAZ5"]["Glad to meet with @ZEROCancer Idaho members, Chuck, Marilyn and Gena today! #ZEROSummit2017 https://t.co/898pSA1LEC"]["Congratulations to @RyanZinke on his confirmation to serve as @Interior Secretary. https://t.co/ZcrSAGu2l2"]["Great to meet with members of the @IDFarmBureau today! https://t.co/hrsYK5Bbwk"]["Happy birthday, @SenatorFischer!"]["My response to @POTUS #JointAddress to Congress tonight. https://t.co/SKHo6u51KS"]["Glad to meet with members of Idaho’s Sugarbeet Growers Association today. https://t.co/kxTGSoL7WZ"]["Idaho @JDRF volunteers stopped by today to discuss #T1D research funding. #JDRFGovDay https://t.co/5NGdEIMkCd"]["Met w/ID members of America Outdoors Association today to discuss challenges facing Idaho’s guides &amp; outfitters operating on public lands https://t.co/hodSH4qtB0"]["@TinRoofTacos owners Susan &amp; Sandy and ID/MT CDC VP, Heidi, joined me in DC today to discuss issues important to Idaho-based #smallbiz https://t.co/FLMdACPq5c"]["Met w/members of ID Assoc. of Counties today to discuss long-term, sustainable funding solutions to the issues facing public land counties https://t.co/LAc9tU1s3R"]["Enjoyed my meeting today with members of the Idaho VFW to discuss the needs of Idaho's veterans. https://t.co/h0PGMkdZmW"]["Happy birthday, @SenatorHassan!"]["Happy birthday, @timkaine!"]["Interested in attending a Service Academy? Join staff from the offices of the Idaho delegation at various meetings to learn more. https://t.co/kezmtG7vcQ"]["\"It is our duty to honor those who sacrificed so much for our country\" \n\nMy weekly column via @IdahoStateJ \n\nhttps://t.co/cYyOedK0Wz"]["Know a #Student interested in @WestPoint_USMA , @AF_Academy, @USMMA_Alumni @NavalAcademy, or @USCGAcademy? Check out our information days. https://t.co/eHEJVXdP6I"]["The Hearing Protection Act would enable gun owners to better access hearing protection products."]["Wishing you a happy birthday, @SenSasse!"]["I join @SenatorRisch congratulating Ms. Galaviz for receiving @NEAFoundation's Award for Teaching Excellence https://t.co/AhJUwNYeMN https://t.co/axieEzBKEI"]["Your neighbors @MCChamber could use your help. Please contact the Chamber and Declo Fire Department for other ways to help. #IdPol #IdaHome https://t.co/0eT679sKrj"]["I met today with Judge Neil Gorsuch, who's been nominated to serve on the Supreme Court of the U.S. I enjoyed our conversation. https://t.co/QW0JhSd8NK"]["Joined @kelseyjharkness of @DailySignal today to discuss the Hearing Protection Act (S. 59). https://t.co/8SJ4OUCp5w"]["If you can't reach my office via phone &amp; are in need of assistance dealing w/a federal agency, plz visit my website: https://t.co/PebcAJOjCz https://t.co/oDfA6d1yLn"]["Joined @SenatorRisch and other western colleagues to introduce Greater Sage-Grouse Protection and Recovery Act \nhttps://t.co/BqEypANyTm"]["Having trouble reaching my office by phone? Please send your thoughts to me via email through my website: https://t.co/PebcAJOjCz https://t.co/1PfuUhZkdZ"]["Spoke today with @SamanthaJoRoth of @KTVB to talk #SCOTUS. Thanks for the conversation! #idpol #idsen https://t.co/r7N0RFc50q"]["My statement on @POTUS'S nomination of Judge Gorsuch to the #SCOTUS https://t.co/5coFChxvkZ https://t.co/nykzlDNZ0G"]["My statement on @POTUS' recent executive order. https://t.co/RT6Vloj8hL"]["Happy Birthday, @SenatorShaheen!"]["Trevor is a constant reminder that one person can have an impact on the lives of millions of others. https://t.co/5UAZNjVYiE via @people"]["I reintroduced legislation to protect Social Security beneficiaries from being stripped of their 2nd Amendmt rights https://t.co/dJDdFMUbic https://t.co/i6Wd9cwJxB"]["Congrats to the 2 ID students selected to the U.S. Senate Youth Program @SenatorRisch &amp; I look forward to seeing you in March @SenateYouth"]["My thoughts following my meeting yesterday with Jay Clayton, @POTUS nominee for @SEC_News chair. https://t.co/8yItP9F3XK"]["Joined colleagues to reintroduce RECA (S. 197) to provide compensation for victims affected by nuclear testing https://t.co/P7GLVonbre"]["The @4H delegation from Idaho shared this group photo with me after enjoying their visit to DC to witness #Inauguration2017. https://t.co/Gjd6Nihmq5"]["Keep up the good work, Frank, Brett and others involved with the Veterans Mobility Program! Your dedication is admirable. https://t.co/yQmyNJnEFE"]["Happy birthday, @SenatorCarper!"]["Took a \"selfie\" with the view behind me today during the 58th Inauguration. Great to be a part of this occasion. #Inauguration2017 https://t.co/jv1PSYDKLk"]["My full statement on today's Inauguration of President Donald J. Trump. #Inauguration2017\nhttps://t.co/B93fv6sQOS https://t.co/5n9aVcP0X5"]["Congratulations, Mr. President! @POTUS"]["The view from where I sit as @realDonaldTrump has now been officially sworn as @POTUS #Inauguration2017 https://t.co/yWUfoHh4Lu"]["The gates have opened and Idahoans are getting situated and watching the sunrise before #Inauguration2017 begins. https://t.co/UfgeL8PyYW"]["Idahoans have already begun to share #Inauguration2017 photos with me this morning https://t.co/Ar3OCNNXO1"]["My office handed out over 500 tickets to Idahoans this week for #Inauguration2017!!!"]["Great to see you, Governor! @ButchOtter #IDpol #IDinDC https://t.co/Ja96pUYtrb"]["Great to see fellow Idahoans, Governor @ButchOtter and First Lady Lori Otter, in D.C. today to discuss the needs of Idahoans. #IDpol #IDinDC"]["Contact a region coordinator if you are interested in learning more about @HUDgov’s PIT count (January 25, 2017) in your area. https://t.co/J7TtSzBMdV"]["Less than 48 hours from #Inauguration2017 Welcoming all Idahoans to DC who will witness the Constitutionally-granted transfer of power https://t.co/2DnW9ZjtU1"]["I reintroduced the Hearing Protection Act (S. 59) https://t.co/RsfpYw7ka8 via @NSSF"]["Today we honor the legacy of Dr. Martin Luther King, Jr. #MLKDay https://t.co/vttNIqlp0B"]["These are the #IdahoTop5 issues Idahoans contacted me about this week. Learn more: https://t.co/wpQwH0H0YQ https://t.co/ainAHKEfzp"]["Full house on Capitol Hill this morning as I administered testifying oath to @RealBenCarson at the @BankingGOP nomination hearing https://t.co/7iPSyk6GHk"]["Happening soon: First @BankingGOP hearing as Chairman on @HUDgov-designate @RealBenCarson. https://t.co/wePY8gKJoA"]["At 10am ET, I'll lead my first hearing as chairman of @BankingGOP on the confirmation of @RealBenCarson. Watch live https://t.co/dPsiOrj9ai https://t.co/3GXGEQ1Kta"]["Thanks for coming to chat today! https://t.co/uzOfbFXVJz"]["Joined @AmalSugarCo today via teleconference to discuss trade policies that could affect sugar growers this Congress https://t.co/GM7K99kD1u"]["Tune in to @PBS tonight @ 7PM MT/6PM PT to see how @INL is helping to innovate nuclear energy. #NuclearOption https://t.co/O3PAh0xs1o"]["It's time to #InnovateNuclearNow"]["\"ways our nations can work together to create proliferation resistant advanced nuclear energy.”(2/2)"]["“NEICA has tools to bring capabilities to @ENERGY for partnership enhancement by providing more opportunities for research &amp; collaboration”"]["“NEICA is a companion to a House bill led by @TXRandy14 @RepEBJ @LamarSmithTX21”"]["“Special thanks to @SenWhitehouse @SenatorRisch @LisaMurkowski @OrrinHatch @CoryBooker as partners in the reintroduction of NEICA”"]["“I am pleased to also announce the reintroduction of NEICA, the Nuclear Energy Innovation and Capabilities Act”"]["“@INL has an impressive history of research and partnerships with Japan and South Korea”"]["“I’d like to remind you all how proud I am of @INL, its people and its mission and support to help further trilateral nuclear cooperation”"]["“…while also strengthening the global non-proliferation regime (2/2)”"]["“We will continue to work cooperatively to advance nuclear technology that provides clean, baseload energy...(1/2)”"]["\"Rise of China and belligerence of N. Korea demonstrate immediate apparent mutual strategic challenges w/Japan and South Korea\""]["I'll be speaking at 11AM ET to @TheGABI_DC on importance of trilateral #nuclear relationship w/Japan and South Korea"]["As a member of @senjudiciary, I asked @real_sessions about states' rights and federal agency overreach. Video: https://t.co/TjRSVIHLeY https://t.co/nYgf99VTqo"]["Looking forward to my first hearing as a member of @senjudiciary this morning https://t.co/LsFLZauZt7"]["Wishing you a happy birthday, @ChrisVanHollen and @RoyBlunt!"]["#LawEnforcementAppreciationDay - Thank you to all of you for your service to our communities"]["@INL will help lead @ENERGY’s new Reducing Embodied Energy and Decreasing Emissions Institute. Via @ThePostRegister https://t.co/xaqoIym7z1"]["Wishing you both a happy birthday, @RandPaul and @SenJohnThune!"]["I am supporting a measure to give affected members of local communities a say in National Monument designations. https://t.co/AymY9tl7o0"]["Great @NewsHour segment on #nuclear @INL https://t.co/eOBcasURKc"]["Congrats to @INL for being named a 2017 Digital Edge Award winner for its immersive 3D visualization capability https://t.co/QuHguQiv99"]["A little note from our friends at @BoiseFire. Stay safe in the snow! https://t.co/fNsJgsX3zx"]["Thanks for joining me, @SenatorRisch. Proud to have you as a friend and colleague. https://t.co/9t2cLrGj0R"]["2day I was sworn in as U.S. Senator for 115th Congress. It is an honor 2 serve the people of the Great State of Idaho. #idahome #idpol https://t.co/VXdbYCESlA"]["Happy Birthday, @SenatorMenendez!"]["Happy birthday, Senator @JeffFlake!"]["Wishing you a happy birthday today, @SenatorIsakson!"]["A special Merry Christmas to our brave men and women who are unable to celebrate with loved ones today. https://t.co/Clh8L67jfV"]["Merry Christmas to all my fellow Idahoans! https://t.co/caAx4fl5UD"]["Wishing a happy birthday to @SenatorSessions!"]["Congrats to @VandalFootball on your exciting win in the @IDPotatoBowl last night!\nhttps://t.co/5fGQ69elcl"]["As part of the @IndianCommittee, we had a productive year. Chair @SenJohnBarrasso has a great piece on the year's accomplishments. https://t.co/6ckgy7cMFN"]["Happy  birthday, @SenTedCruz!"]["Thank you to your husband for his service, and to you for your support to him. Merry Christmas. https://t.co/4DphB3K8ns"]["@INL will open EBR-I Atomic Museum TOMORROW to celebrate 65 yrs since reactor 1st made electricity https://t.co/vr7sXhFHBq"]["Happy birthday, @senrobportman!"]["On this day in 1791, the Bill of Rights were ratified and became a part of the U.S. Constitution. Happy #BillofRightsDay! https://t.co/uDkc218io4"]["These are the #IdahoTop5 issues Idahoans contacted me about this week. Learn more: https://t.co/wpQwH0H0YQ https://t.co/ZFs7yhNdGw"]["My #weeklywednesday column focuses on #Idaho's #Native American Heritage. https://t.co/wSNWxSKY8U https://t.co/FigmcJr8vI"]["My thoughts following my meeting yesterday with @stevenmnuchin1, who has been nominated to be our next @USTreasury Secretary. https://t.co/iyepyMmHDA"]["From yesterday: https://t.co/RR7nUn3Ta0"]["Met with @RepTomPrice, President-elect Trump's nominee to lead @HHSGov, earlier today."]["Sat down to talk w/ @stevenmnuchin1, President-elect Trump's nominee to lead @USTreasury https://t.co/NN87aDDzuu"]["Happy 380th Birthday to the @USNationalGuard, especially to Idaho’s National Guard at Gowen Field! #NationalGuardBirthday https://t.co/6L84QTElZS"]["An ornament made by an Idaho student on the @USCapitolTree features the Idaho state bird: a Mountain Bluebird. #CapitolChristmasTree https://t.co/YtTChTrPxk"]["Happy birthday, @JohnBoozman and @sendavidperdue!"]["Happy birthday, @SenGillibrand!"]["I extend my condolences to the family of John Glenn. America has lost a remarkable and iconic figure. #RestInPeace"]["Gowen Field has been rightfully chosen as a finalist in the Air Force’s consideration of the F-35 basing. https://t.co/T9xV4mNBBV https://t.co/sPVxuSSciD"]["Happy birthday to fellow Idahoan and member of the Idaho congressional delegation, @Raul_Labrador!"]["We also remember the civilians of M-K Corp. who were attacked or captured on #WakeIsland shortly after the attack on #PearlHarbor https://t.co/j6GFBtBSlT"]["I voted in favor of #CuresNow today.  It's now headed for the President's desk."]["Today marks the 75th anniversary of the attacks on #PearlHarbor. We remember the lives lost that day and honor the survivors. #PearlHarbor75 https://t.co/HR62bdjH59"]["Had the pleasure of meeting w/@RealBenCarson, president-elect Trump's nominee to lead @HUDgov https://t.co/uAqxRn9X8V"]["I'll be live in 3 minutes with @Emjayktvb on @KTVBfeed talking about the @USCapitolTree #CapitolChristmasTree https://t.co/ADAMZrLtCP"]["I now present you with the lighted @USCapitolTree! https://t.co/e7oLzjJEme"]["Beginning shortly, the #capitolchristmastree from Idaho will be lit! https://t.co/BEHDh7CDsJ will stream the ceremony. https://t.co/34vvuwV1Ay"]["I joined Isabella at the Chief of the @forestservice's reception at @usda today honoring the Idaho people's tree in DC. https://t.co/ZWEU73DRIv"]["TONIGHT: The @USCapitolTree Lighting Ceremony takes place on the West Front lawn of the @uscapitol at 5pm ET. #capitolchristmastree"]["More Idaho-made ornaments from the Idaho-grown Christmas tree in my DC office! #idpol #idahome https://t.co/ITtl9C32Nl"]["Looking forward to tomorrow's #CapitolChristmasTree lighting!\n\nFrom Idaho, Merry Christmas https://t.co/wBI7ZSOygy"]["A small sampling of the ornaments decorating the tree in my DC office. All ornaments were made by fellow Idahoans. #CapitolChristmasTree https://t.co/FuLy5AvZdR"]["Happy birthday, @SenatorReid!"]["Happy 75th Anniversary to @CivilAirPatrol and Idaho's very own all-volunteer civilian @IdahoWingCAP! #CivilAirPatrol https://t.co/TRkZzxLJ8X"]["Happy Birthday, @SenGaryPeters!"]["Proud cosponsor of S. Res. 623, which recognizes the importance of Civil Air Patrol &amp; the role it has played in supporting homeland security"]["These are the #IdahoTop5 issues Idahoans contacted me about this week. Learn more: https://t.co/wpQwH0H0YQ https://t.co/bK7hheCsim"]["Wishing you a happy birthday, @SenatorBurr!"]["Thanks to my staff for helping to decorate the DC office Christmas tree, which came from Northern Idaho! Love the ornaments from Idahoans. https://t.co/xJkFEBeU8h"]["The @USCapitolTree arrived in DC today and stands outside the @uscapitol until the lighting ceremony next Tuesday! https://t.co/nPWLBEHnBA"]["Wishing you a happy birthday, @SenBennetCO!"]["Happy birthday, @SenCapito!"]["Attn Idahoans: get out and support small businesses on this #SmallBizSat! @ShopSmall https://t.co/clY1KfGgbx"]["I join in honoring Idaho’s Native American Tribes this National Native American Heritage Day. https://t.co/cxAb0Zf1rg"]["Wishing you and your family a Happy Thanksgiving. https://t.co/WFLBKZi40d"]["LAST CHANCE: Idahoans must request Inauguration tickets from ID congressional offices TODAY by 5PM Mountain Time. https://t.co/GGogcpDexs"]["Happy birthday, @SenSchumer!"]["Great story in the @IdahoStateJ about Mr. Bud Kelly, one of my Spirit of Freedom Award winners for this year.\n\nhttps://t.co/TZ7dcjSR7F"]["I will continue to work w/ @RonWyden and other congressional colleagues on passage of the BRACE Act, via @uvsj  https://t.co/zfEBCr0UhO"]["REMINDER: last day for Idahoans to request Inauguration tickets from ID congressional offices is TOMORROW. #IDpol https://t.co/GGogcpDexs"]["the @USDA has 5 excellent tips for a food-safe Thanksgiving.\n\nhttps://t.co/V1HdvdJuDA"]["My Weekly Column: Heroes Among Us, via @MessengerIndex https://t.co/SUeSPjeo9d"]["The last day for Idahoans to request Inauguration tickets from ID congressional offices is Wednesday. #IDpol  https://t.co/GGogcpUPp0"]["@NationalService ranked Idaho 5th in nation for volunteer service. https://t.co/QH0hmvD0US"]["Happy birthday, @SenatorDurbin!"]["On this day in 1883, the 4 time zones simplified the country's railroad and connected people across the country. #History"]["Joined @SamanthaJoRoth today to talk about the path forward during the remainder of the 114th Congress. #idpol #idsen https://t.co/VMQB1E3mBb"]["Happy birthday, @jiminhofe and @SenToomey!"]["If you're looking for ways to serve in the new Administration, you can access a link to information on my website https://t.co/Iqv2hHxYjU"]["Thanks, @localnews8 for the story\n\nIf you are a veteran &amp; need help w/the @DeptVetAffairs, please contact my office. https://t.co/VxAigoyLtm"]["This #WorldDiabetesDay, I applaud Idaho advocate, Carson Magee, for his ongoing efforts to advocate for better health for all Americans. https://t.co/IGjeiOhYaH"]["Today is the last day the @USCapitolTree will be in Idaho before making its way across the U.S. to Washington, D.C.! #TrackTheTree"]["Wishing you a happy birthday, @SenDanSullivan!"]["Happy birthday, @SenJackReed!"]["Help @LibraryCongress preserve #veterans histories w/ #LOCvets! https://t.co/lHdycz6MDu"]["On this Veterans Day, I extend a special thank you to all of Idaho's veterans for your service. https://t.co/JA2W4Cf7y5"]["#ThankOurVets! Preserve stories w/ @LibraryCongress #LOCvets https://t.co/aub4jHrEDN"]["Happy #VeteransDay. Thank you for your service to our country. https://t.co/2rkeGUsuE9"]["Happy birthday, @SenatorBoxer!"]["Honored to present Brett Waters the Spirit of Freedom Award for his support of our nation's veterans. Your leadership is exemplary. https://t.co/P9baaABCIc"]["https://t.co/zogMwofXtq https://t.co/7uBgKwp1qZ"]["Happy 241st Birthday to the @USMC. Thank you for your service. #SemperFi #USMC https://t.co/vZtksiBktN"]["Don’t miss your chance to visit the @USCapitolTree at one of its last 8 stops in Idaho! #TrackTheTree https://t.co/TaVZ252Ycf https://t.co/morbjLNbIP"]["Gary Amoth Trucking will haul the @USCapitolTree 4,000 miles to DC. Safe travels, Gary! Follow his journey: @TracktheTree  #TrackTheTree https://t.co/zMvnGtCSsp"]["And it's off!!! My wife, Susan, &amp; I joined Isabella and other fellow Idahoans to officially send off the @USCapitolTree in Boise today! https://t.co/TuJ1fHvbTh"]["Join me at the Idaho Statehouse today at 11:45AM as we give the @USCapitolTree a local send-off!\n\nhttps://t.co/jA6KqjqL42"]["Working collaboratively, federal #transportation grants were secured to complete a new transit center in #Boise. Congrats on the facility! https://t.co/PJ4Cp17xD9"]["Thanks @Idahohcc and @hccidaho for the inviting me to your gala. I am humbled by your award &amp; look forward to continuing to work with you. https://t.co/PpI7l8EwPy"]["Today I presented a Congressional Record statement to @AmalSugarCo in recognition of its 100 years of sugar production in #Idaho https://t.co/faTvT41bw7"]["Enjoyed partnership w/several ID organizations to donate nearly 1,500 books--from @librarycongress-- to students at Wilder Elementary today. https://t.co/gHJcM9mV3I"]["Honored to receive this plaque commemorating the opening of the Hispanic Cultural Center in Nampa. https://t.co/ubMkfNcfWk"]["Great to visit the Idaho Hispanic Chamber of Commerce in Nampa today. #idpol #idsen https://t.co/itLxFHfqE1"]["Happy Birthday, Senator @maziehirono !"]["Great discussion led by fellow Idahoan Carson Magee in Coeur d'Alene 2day to discuss the importance of maintaining @NIH diabetes programs https://t.co/tid0tfeTuN"]["ICYMI: \"Violence against partners...is absolutely unacceptable and will not be tolerated\" https://t.co/eqPLQPZCE3"]["The @USCapitolTree was cut from Little Ski Hill in McCall just a few moments ago: https://t.co/MUa0F2jvdP"]["Congratulations to Duncan Hunt on a job well done for his Eagle Scout project to make hygiene kits for the stand down last Friday. https://t.co/No82u7imT3"]["It was great to join so many fellow Idahoans at the South East Idaho Homeless Stand Down at @IdahoStateU last Friday. https://t.co/hSp5wskmAh"]["Joined Trevor Schaefer to talk w/@kevinmillershow about our 7-year fight to pass Trevor's Law to better track cancer clusters in the U.S. https://t.co/zyQq61RRa4"]["Oct is #domesticviolence awareness month. Thx to those who joined us at @IdahoStateU today to raise awareness of domestic &amp; dating violence. https://t.co/NYGjQgUWfh"]["Happy birthday, @SenatorHeitkamp!"]["Preparations underway 4 the arrival of the @USCapitolTree, coming from Payette Nat'l Forest all the way to West Front Lawn of the US Capitol https://t.co/To7dtbMUSO"]["Thx 2 Blue Water Navy Vietnam Vets Assoc. for presenting me this pin. I continue 2 support efforts 2 help veterans affected by #AgentOrange https://t.co/XJREQkY40y"]["Another happy birthday to @SenatorRounds!"]["Wishing a happy birthday to @SenJeffMerkley, Senator to Idaho's next-door neighbor!"]["Congratulations to Isabella Gerard of #Boise who will help light the @USCapitolTree from the @PayetteForest. https://t.co/UFUwmddZZh  #IdPol https://t.co/B7wl9NAgHf"]["Thanks to the #veterans who joined today's pinning ceremony in Soda Springs commemorating more than 50yrs since the start of the #VietnamWar https://t.co/DnDPmAH9xv"]["#Shortlinerail expansion in #Idaho will help companies like @WatcoRail take more #Idaho commodities to market. Thank you for the tour #IdPol https://t.co/msuTzgWe6Z"]["Happy birthday, @SenBrianSchatz and @SenWhitehouse !"]["Congratulations again to Mark DeHart and Terry Todd on their accomplishment. #nuclearsciweek #nuclear #science #Idaho https://t.co/2ULwrhxLSI"]["Enjoyed spending time with fellow Idahoans at the Vaughn Hugie Family Education Center in Blackfoot yesterday! https://t.co/0Pyyd8j07w"]["Thanks to all who joined me in Pocatello today to discuss my Improving Veterans Care in the Community Act (S. 3401). https://t.co/h5qZe5VKoc"]["Happy Birthday, Senator @MartinHeinrich!"]["Happy 241st Birthday to the U.S. Navy! Thank you for your continued service. #241NavyBday https://t.co/tp9J22C6fP"]["Federal court rules @CFPB structure unconstitutional. I have raised concern for years about structure of the agency https://t.co/Lk9KpBzbjD"]["Happy Birthday to my colleague from Idaho's next door neighbor, @PattyMurray!"]["Happy National #SchoolLunch Week, supported by @USDANutrition,  to all Idaho schools! https://t.co/McQqztN5Cx"]["I can no longer endorse Donald Trump. Read my full statement: https://t.co/lfa9mYZbdC"]["He must take full responsibility for this unacceptable disrespect of women, renounce it and apologize, no excuses."]["Comments made by Mr. Trump are outrageous, &amp; he must apologize immediately for his disrespectful, profane &amp; demeaning language about women."]["Thanks again 2 the many veterans who joined me @ the Idaho Statehouse for  announcement of my veterans health care reform legislation Monday https://t.co/YtQhQfX0qr"]["Thanks, @KTVB, for covering yesterday's event! https://t.co/C1JcwYN0Ss"]["Thanks @Chobani &amp; @IdahoDairy for providing healthy &amp; delicious treats at yesterday’s #SchoolLunch event."]["Great to visit #TwinFalls yesterday to celebrate upcoming @USDANutrition National #SchoolLunch Week. https://t.co/rKT5bjZsJW"]["Happy Birthday, @SenatorCardin!"]["I introduced the Improving Veterans Care in the Community Act based on feedback directly from Idaho's veterans.\nhttps://t.co/Jt1WgTOKKs"]["ICYMI: last day for Idaho students to enter contest to help light the U.S. Capitol Christmas Tree is Friday. https://t.co/C17NRY2LXK"]["My #WeeklyWedesday column highlights the greatness of Idaho's Olympic &amp; Paralympics athletes. #Rio2016 #Paralympics. https://t.co/FyjwlDhLvT"]["Happy Birthday, @BillCassidy!"]["#IdahoIncorporated: 56 years ago today, Clayton became an incorporated city. #Idahome https://t.co/pmGC4wdCDu"]["ICYMI: Idaho’s food manufacturers help grow jobs and the economy https://t.co/etLeiQl8cb"]["Pleased @CommerceGov engaged directly w/local stakeholders to learn the needs of southern Idaho food manufacturers. https://t.co/qv4vXyiKRM"]["PILT funding is an important resource for many counties in Idaho and other rural and western communities. #IDpol\nhttps://t.co/1HwDFMZGh4"]["Happy #FirstDayOfFall! The colors of Idaho are great this time of year. https://t.co/MQun1riO1Z"]["Meet my fall 2016 D.C. interns, Klodina (Boise) &amp; Amber (Nampa). https://t.co/lsyY2TvrxC"]["The best national direction comes from the common sense in #ID. More in my #WeeklyWednesday column: https://t.co/ATrbdj2DlX https://t.co/7XfUHV0vVs"]["Bipartisan group of Senators calls on reauthorization of the Secure Rural Schools &amp; Community Self Determination Act https://t.co/nJrPiALlHT"]["Welcome Emily Fleming from #Emmett who will serve as a #Page in the #Senate this semester. https://t.co/dGPgy5OzgH #IdSen #IdPol https://t.co/5R0bGKX0aL"]["Happy birthday to my SC colleague, @SenatorTimScott!"]["Happy 69th Birthday, @usairforce! #AFBday https://t.co/AOPfY3h4CB"]["Happy 88th Annual Spud Day, fellow Idahoans of Shelley! #SpudDay #Idahome https://t.co/IusChSYJbY"]["Happy birthday, @ChuckGrassley! #HBD"]["On National #POWMIARecognitionDay, we honor those taken prisoner &amp; those still missing. You are never forgotten. https://t.co/A7ZTjlUMtq"]["Today, I joined my colleagues on @epwmaj to pass the #WRDA bill. Read more about it here: https://t.co/wvILrpb8si https://t.co/E018Fkg9rW"]["#IdahoIncorporated: 101 years ago today, Kuna became an incorporated city. #Idahome https://t.co/zWWCYw7KFz"]["Wishing a happy birthday to my colleague from Illinois, @SenatorKirk"]["These are the #IdahoTop5 issues Idahoans contacted me about this week. #IDpol https://t.co/nfUCd8fFZV"]["Attn Boise area veterans, you can get your flu vaccine for free from the @DeptVetAffairs: https://t.co/ohthmEOlK0"]["Congrats on Top 15 in #MissAmerica, @MissAmericaID! You are still number one to Idaho."]["15 years ago, Idaho lost 2 of its own in the attack on the Pentagon. Ronald Vauk &amp; Brady Howell, you are not forgotten #NeverForget"]["#NeverForget #September11 https://t.co/ZTxtGsVI0J"]["Happy Air Force Appreciation Day, #MountainHome #Gunfighters! https://t.co/41uGvaIVtR"][".@WestPoint_USMA will be hosting an admission info event @ Gowen Field, 9/24 in #Boise. RSVP https://t.co/2BN3LpI2Pe https://t.co/3q10DKxvT3"]["Seeking creative Idaho youth to help light the @uscapitol Christmas Tree in December https://t.co/C17NRY2LXK"]["And thank you for protecting our community! https://t.co/MuEBS3AVTP"]["Did you know my DC staff can help provide guided tours of the U.S. Capitol? https://t.co/FvI310zm3R https://t.co/uQceQRbK6f"]["Attn, students &amp; recent grads! Oct. 15 is the deadline to apply for a Spring 2017 internship with one of my offices https://t.co/CRoEzmWsiZ"]["Glad my staff could attend. We will #NeverForget 9/11. https://t.co/X5mVuBBx56"]["Wishing my friend and fellow Idahoan, @CongMikeSimpson, a very happy birthday!"]["Happy Birthday @SenSanders !"]["Do you need help with a federal agency? My casework team can help. Please contact me to learn more. https://t.co/6ngADVKRHU"]["#YouAreNotForgotten #POW #MIA https://t.co/rUsUZE4cLT https://t.co/V2oNRyEW4r"]["Happy #LaborDay! https://t.co/zbKM9agoxn"]["The questions during my visit w/ @nateshelman @KBOI670 were similar to what I heard @ the 200 town mtgs I've hosted. https://t.co/IBFXlL9D1V"]["Thx to all attendees @ my 200th incorporated town meeting today, &amp; to all who have attended previous mtgs. https://t.co/WRW0F2aeIL"]["September is #SuicidePreventionMonth Read how you can #BeThere for veterans: https://t.co/OIBn4o3PCT https://t.co/SfmfYJAe21"]["Thank you for the warm welcome at my town meeting today in #Stateline. #IdPol #IdSen #Idaho https://t.co/o4BPt7af2M"]["Join me in upcoming town meetings as I complete my visit to all 200 incorporated towns in Idaho! https://t.co/haxPtbUQup"]["Please be careful out there! https://t.co/VP4CFL3imX"]["@ClifBar held a grand opening of its baking plant in #TwinFalls today. Facility will employ 200+ Idahoans this year. https://t.co/pR4786C43F"]["Hope you have a very Happy Birthday, @SenJohnMcCain!"]["Congrats to @IdahoStPolice for receiving the @DeptOfDefense #FreedomAward at the #Pentagon this morning https://t.co/qKctzYZSyk"]["Thx to #Idaho @NationalGuard for the tour of Orchard Combat Training Center &amp; Operational Readiness Training Complex https://t.co/soDDqR43UC"]["(3/3) I met with some of Smith's fellow guardsmen after the ceremony. Thank you for your service and commitment. https://t.co/YXxTDDLtst"]["(2/3) Smith is the 1st female armor #enlisted #soldier in the nation to complete #military #tank training. https://t.co/MFYcgilwiS"]["(1/3) Honored to present SFC Erin Smith of the Idaho @NationalGuard with my Spirit of Freedom Award. https://t.co/nlxoDvc9FH"]["Join me tomorrow at #BoiseState for conversations on ways to keep ID campuses safe @boisestatelive \nhttps://t.co/qEw3OTCQiR"]["Congratulations, @IdahoStPolice on your accomplishments! https://t.co/r3p9E7QKnR"]["#TBT to a lighter moment during the Intermountain Energy Summit. Thx 2 all attendees who made it such a great event https://t.co/KkSLzTfBjP"]["Met with the crew of the Orchard Combat Training Center today. https://t.co/1oqgAIjq3j"]["Celebrate @NatlParkService's 100th Birthday by visiting any of 7 NPS locations in Idaho: https://t.co/ZxbAPMaav6 #NPS100 #FindYourPark"]["Happy birthday to the @NatlParkService! Idaho is home to 7 NPS-managed sites with over 600,000 visitors each year! #NPS100"]["(2/2) keep the @SocialSecurity system solvent. The Bowles-Simpson Commission made several recommendations I supported."]["(1/2) I joined Lupe Wissel of @AARPIdaho for a telephone town meeting w/ thousands of Idahoans. We discussed ways to https://t.co/eOx3TuG0g7"]["(2/2) My bill w/@RonWyden &amp; @SenatorRisch would treat #forestfires as disasters &amp; address forest mgmt to reduce them https://t.co/rTa6qfDjBt"]["(1/2) @BoiseNF says #Pioneerfire is 40% contained and that better weather and burnout are assisting efforts in fighting it."]["(1/2) @CongMikeSimpson @MayorBieter &amp; I held a dedication ceremony for the Dixie Drain phosphorus removal (cont.) https://t.co/mCiDN2pR1w"]["It was an honor to present these medals:\n\nBurley WWII veteran family receives medals of honor https://t.co/uUZQJiLKv3 via @KMVTNews"]["Looking forward to presenting the Spirit of Freedom Award to SFC Smith tomorrow. https://t.co/JSyOYScKUw via @idahopresstrib"]["Wishing a very happy birthday to my Senate colleagues @SenBobCorker and @Sen_JoeManchin! Hope you both enjoy your day."]["Good luck to all Idaho students returning to school this week. Stay focused!"]["(4/4) aiming to stop violence against all Idahoans."]["(3/4) (#VAWA) and look forward to other meetings this week to discuss federal, state, &amp; local assistance programs"]["(2/4) violence, including against students returning to class on Idaho campuses. I worked diligently to renew the Violence Against Women Act"]["(1/4)Today I spoke at the Family Services Alliance to join advocates in discussing ways to stop domestic &amp; sexual... https://t.co/LQjQ7UzMes"]["Embodiment of the American spirit! https://t.co/wXuqoVjBlc"]["Enjoyed meeting with the @IdahoPotato Commission this morning. #IdahoPotato #Idahome https://t.co/a7Ylnk4c9n"]["All smiles in Mud Lake https://t.co/6mboVHkWIi"]["Good crowd in Spencer #idpol #idahome https://t.co/69plwzvoim"]["Enjoyed visiting the Opal Country Cafe and gift shop in #Spencer. Another warm welcome in the Gem State! #idpol https://t.co/laWUuvmKNM"]["Thanks for the warm welcome, Dubois! https://t.co/RrlyO0kSY4"]["Another great town meeting in Dubois today! #idpol #idahome https://t.co/63g2zKC2XO"]["Hoping my friend and colleague @SteveDaines had a great birthday this weekend."]["(2/2) The @Nature_ID, @uidaho, @WRLT and @NRCS_Idaho are partners in this research effort. #sagegrouse #grazing"]["(1/2) Ongoing research on grazing &amp; sage grouse populations will be enhanced here at Rock Creek Ranch west of Haley. https://t.co/ESvnxnnh2a"]["I'll be hosting town hall meetings next week in Hamer, Spencer, Dubois &amp; Mud Lake. #IdPol #IdSen https://t.co/g9FOj59GGc"]["U.S. energy policy must match innovation. \nhttps://t.co/YQiPE0q9ex"]["Wonderful to see my friend &amp; mentor Gov. Phil Batt @ the 45th anniversary of Terry Reilly Health Clinic in #Nampa. https://t.co/Weei4Atnxh"]["(2/2) Our bipartisan bill may be a part of a larger energy bill this fall.  The worst fires would be declared national disasters."]["(1/2) I joined @SenatorRisch &amp; @RonWyden to highlight our legislation preserving mgmt funding to prevent fires. https://t.co/zIam79LsXE"]["Do you have a question regarding federal issues? Please email me! https://t.co/PebcAJwIdZ"]["Timely discussion given current wildfires in the area.  https://t.co/HXReOsRArJ"]["Another benefit of my travels last week: Bear Lake https://t.co/F5N3CKKrgk"]["It was an honor to present medals to these individuals! #Idahome #CongressionalAward https://t.co/DPJ8qkteSw"]["In more stops on my trip through my home state, I found the senior center in Lava Hot Springs had a great display!! https://t.co/8b2X9mikN7"]["But no trip to #SodaSprings is complete without the geyser. #idahome https://t.co/NxQGaqAMsP"]["I also had an engaging town meeting in Soda Springs https://t.co/7ZaYd54zgu"]["I saw the smoke from the Pioneer Fire near Idaho City from Interstate 84. #idahowildfire https://t.co/Jaa3YMTxZg"]["Great to see fellow Idahoans in St. Charles, Bloomington, Paris, and Montpelier yesterday. https://t.co/Ry4hEebv0u"]["#Community #banks need meaningful relief from regs instead of WH rpt that blames long-term trends. Read more: https://t.co/LD4GIcLCzj"]["Honored Madison Miller w/Spirit of Idaho 2day for her project 2 help homeless in Twin Falls  https://t.co/HqUe3D3b28 https://t.co/UJ0oJ8Is9T"]["We also discussed my work on #wildfire funding https://t.co/peJcJomsew"]["At Times-News today, we discussed bipartisan legislation and gridlock; covering Trevor's Law https://t.co/KBUBkLIQQX https://t.co/PC5SM7nzDl"]["Congratulations to @k_armstrong of #Boise for making history and earning her third #gold medal at the #Rio2016 @Olympics!"]["Thanks to @ThePostRegister for hosting the 3rd Annual #intermountainenergysummit this year and allowing me to speak https://t.co/bzjdUyhTUB"]["Through public-private partnerships, Congressional oversight, &amp; efforts like #NEIMA, we can improve economics facing nuclear energy"]["I also joined Senate colleagues to introduce #NEIMA to increase transparency &amp; accountability at the NRC"]["#NEICA will help the U.S. pave the way for the development of cutting-edge technology in advanced reactor research"]["#NEICA was added as an amendment to the Energy Policy Modernization Act by a bipartisan 87-4 vote."]["My bill, #NEICA, would encourage innovation in advanced nuclear #IntermountainEnergySummit"]["#Nuclear energy is good for jobs, the community, our air, &amp; a great source of base-load clean energy #IntermountainEnergySummit"]["The @INL is a cornerstone of this community &amp; the workplace of 4,000 Idahoans #IntermountainEnergySummit"]["In a few moments, I'll be speaking at the #IntermountainEnergySummit"]["I'm so glad to be home in #IdahoFalls this week and look forward to speaking at the Intermountain Energy Summit tomorrow! #IMES"]["Appreciated the warm welcome at Victor City Hall today https://t.co/EswM6yKG1Z"]["Enjoyed throwing bread to the trout lurking in Warm River with Doug Gibson, head guide at the Three Rivers Ranch https://t.co/3Nom0gOhsO"]["You can feel the common sense in the air here in #Idaho. The views are not bad either. #Tetons #idahome https://t.co/8J54CrEsYK"]["It was an honor to meet Idaho veterans at the Veterans Home in Lewiston yesterday. https://t.co/kCXTs6I29P"]["Senator @RonWyden &amp; I are working on legislation to fix firefighting funding. Meetings like this help me hear directly the needs of Idahoans"]["Great talking to Idahoans in Orofino yesterday to discuss #wildfire prevention and recovery strategies. #IDSen https://t.co/6vvCtzJQMf"]["Fellow Idahoans, I invite you to join me for any of my 14 town meetings next week! https://t.co/k9QO3wl4Cp https://t.co/1wjgzn5Otf"]["ICYMI: There is still a [federal spending] crisis; but it's just been pushed back https://t.co/buOx4Fs8SW"]["ICYMI: We still have a notion in this political system that we can spend ourselves through this. It has got to end. https://t.co/buOx4Fs8SW"]["Wishing a happy 226th birthday to the @uscoastguard! Thank you for your continued service to the security of our nation. #BlessOurTroops"]["ICYMI: Small businesses can't survive the mountain of regulations to stay afloat. https://t.co/buOx4Fs8SW"]["ICYMI: Overregulation is quickly catching up to the national debt as one of our top threats.  https://t.co/buOx4Fs8SW"]["As a member of @BudgetGOP I'm working to build #abetterbudget to #fixthedebt. I shared details w/the Lewiston Rotary https://t.co/YklOirIGWB"]["I appreciated hearing directly from Idaho's veterans at my Lewiston office today. https://t.co/hWJYNXBA09"]["Great to see members of the Coeur d'Alene Chamber of Commerce during our lunch discussion today. https://t.co/FHkb3k4Nde"]["Great to see veterans service representatives in Post Falls today to discuss veterans priorities in Idaho https://t.co/LAhVPSVvSJ"]["Thanks to residents of Moore who came out to my town meeting on Friday. Here, I discuss problems w/ the federal debt https://t.co/8DiA6eFapL"]["Fellow Idahoans, I would love to see you at one of my town meetings today! I'll be in Mackay (12PM), Moore (2PM), and Atomic City (3:30PM)."]["Visit my website to see the top 5 issues Idahoans contacted me about this week: https://t.co/wpQwH0H0YQ"]["I will continue my town meetings this week w/ more to come. Details can be found at https://t.co/bECCynLHwz. #IdPol https://t.co/M15UH7eEDg"]["Interested to know what Idahoans contacted me about this week? Visit my website to learn the top 5 issues: https://t.co/wpQwH0H0YQ"]["Enjoyed visiting with Tommy Tucker on the Snake River Roundup program on KRLC AM in Lewiston last Friday. https://t.co/sWpMZwDHT6"]["ICYMI: Read my OpEd on the importance of #MentoringIRL via @twinfallstn https://t.co/MEJswqocMd https://t.co/K7lLvZvVBd"]["It was a pleasure speaking at ID @AmericanLegion’s 98th state convention. Thank you for your continued service. https://t.co/ITNlZvWz5p"]["@Brandwatch &amp; @Monster release report telling us what we already knew:\n\nIdaho ranks 1ST for state w/happiest workers\nhttps://t.co/ZdMzeu9rbh"]["Yesterday, I met with Idaho’s @CECMembership to discuss federal policies important #4SpecialEducation https://t.co/J4Bx8VmcRc"]["Good luck to @MissAmericaID, Kylee (CDA), as she represents Idaho @MissAmericaOrg in September #MissIdaho #MissAinDC https://t.co/W9OGvsPncQ"]["I enjoyed meeting Andres &amp; Jonathan, students at @BoiseStateLive serving as @USNISTGOV undergrad fellows this summer https://t.co/GihHc3hLGe"]["I've joined @RepBobGibbs to quickly take action to commence a thorough mosquito abatement program to stop #Zika https://t.co/wyZo9KfewW"]["This week, we celebrated the 240th birthday of America. Thank you to all who have &amp; continue to fight for freedom. https://t.co/J7Nez8pvEP"]["Members of ID’s Basque community &amp; @MayorBieter were in D.C. to help plant a symbolic tree outside the U.S. Capitol https://t.co/cKWgMl9vSk"]["Joining my colleagues to #EndAlz https://t.co/3lYtREHiur"]["Happy to advocate for Idaho's seniors. #iheartcaregivers #ACTCaucus https://t.co/BkxzvGs1l6"]["The responses to my survey of veterans are shaping my proposals to reform and fix the #VA. https://t.co/UXXPexA4fa"]["Good luck, Megan (of Emmett) &amp; Alycia (@uidaho alum) as they compete in trials to participate in @Olympics #Rio2016! https://t.co/LPXZKhiK9O"]["I will continue to push @DeptVetAffairs to improve both through legislation and other efforts. https://t.co/03WOCDxOdE  via @IdahoStatesman"]["Met with Bill Spence of the @LewistonTribune today to discuss Washington politics and impacts on Idaho. #IDpol https://t.co/cssgiuDIjJ"]["Congrats to SFC Smith on her achievements as 1st enlisted M1 Armor Crewman in the Idaho @USNationalGuard #WomenServe https://t.co/R4zUbdJGpf"]["Pleasure welcoming @CMNHospitals 2016 Champion for ID, Beckham, and his family, from Eagle, to DC.#ChampionsForKids https://t.co/8jq2Ee0dEy"]["(cont. 2/2)...reduce stigma associated w/ PTSD, &amp; help ensure those suffering from the invisible wounds of war receive proper treatment."]["Objective of the resolution, which I helped introduce with 31 other Senators, is to raise awareness about PTSD-related issues...(cont. 1/2)"]["The U.S. Senate voted unanimously last week to designate today Post Traumatic Stress Awareness Day and June as PTS Awareness Month."]["VA Sec. McDonald will visit Boise 6/28. If you'd like to share a comment that my staff can deliver, please visit: https://t.co/k6DfO54519"]["ICYMI: Two bills that I have worked on with Idahoans were signed into law this week by @POTUS  #TSCA #TrevorsLaw https://t.co/cI9UWhM2dl"]["A bill by @CongMikeSimpson &amp; myself providing #native tribes more autonomy to manage assets was signed by @POTUS. https://t.co/qQmcv2zlaO"]["ICYMI: @DeptVetAffairs Secretary Robert McDonald will visit Idaho on June 28. https://t.co/LIEGjdHkjo #IdPol #Veterans #VA"][".@POTUS today signed Tribal Asset Reform act that I introduced w/@CongMikeSimpson. W/ Trevors Law, 2 bills became law in 1 day. #backtowork"]["The bill named for Idahoan Trevor Schaefer to document &amp; track cancer clusters is now law. https://t.co/7ZphFHHOW3 https://t.co/LqjgFvoILN"]["Joining @kevinmillershow on @580KIDO to further discuss current affairs #IDpol https://t.co/xxn1JYUyeL"]["Joining @realneallarson of KID Newsradio this morning to discuss topics important to Idahoans #IDpol https://t.co/aJdtV5g98D"]["Video from this morning where @SenatorRisch and I introduced Judge Nye during his @senjudiciary hearing. #IdPol https://t.co/UVhp4m8zxM"]["Today, @SenatorRisch &amp; I introduced to @SenJudiciary Judge David Nye for his nom. to be U.S. District Judge for ID. https://t.co/BdPrJnvkjF"]["My response to legislative proposals being offered that will limit the rights of law-abiding Americans. https://t.co/2vr32ZuZYe #IDPol #2a"]["SPC Cindell is member of @USArmy Soloist Drill Team &amp; performed at the Twilight Tattoo in honor of 241st #ArmyBDay https://t.co/bgkjnOj1Fe"][".@SenatorRisch and I will introduce Judge David Nye next week at his @senjudiciary nomination hearing. https://t.co/3WM054IuDi #IdPol #IdSen"]["Visited today with Idahoans Devin and Olivia, who are in DC as part of the @NRECANews @YouthTourDC event. #YTDC https://t.co/KOJdWTOXvl"]["\"We will move forward bravely with compassion and ever-present vigilance.” My full statement on the #Orlando attack. https://t.co/05USthFyUM"]["ICYMI-The @IdahoStatesman published a piece I wrote w/ @RonWyden about a compromise to treat wildfires as disasters. https://t.co/3rt7kXUz2Z"]["Joined other @BudgetGOP members to discuss proposals to fix our #brokenbudget process. #IdPol #IdSen #Budget https://t.co/J5JsX5gmFQ"]["Just wrapped up a second live interview with @KTVB. Thanks for coming to DC &amp; covering the passage of Trevor's Law. https://t.co/masr7NNrM2"]["Spoke about the importance of Trevor's Law with @Emjayktvb. I'll join Mark LIVE again at 6pm MT on @KTVB . #idpol https://t.co/AHzPNWeUPd"]["I'll be joining @Emjayktvb LIVE from #DC at 4p MST on @KTVB  to talk about my Trevor's Law legislation. Tune in!  #IdPOL #Cancer"]