["Sad comment from @realDonaldTrump. All the more reason to focus on getting an agreement on DACA as soon as possible. https://t.co/aSKXvZQVuN"]["We know how to create growth. We know how to create jobs. We know how to build strong futures for our children. Instead, Republicans forced through their #GOPTaxScam."]["Last year, we took Martin Luther King, Jr.’s lessons to heart in the fight to #ProtectOurCare. And this weekend, House Democrats will hold teach-ins across the country to engage citizens on the damaging impacts of the #GOPTaxScam. https://t.co/XHjebFy0LQ"]["Republicans continue to show their dedication to selling our children’s future to corporations. #GOPTaxScam"]["I’m holding my first weekly press conference of 2018. Be sure to tune in! https://t.co/wCBDTcZBuf"]["Paul &amp; I are praying for all impacted by the mudslides in California. We are so deeply thankful to all the first responders working to save lives, and will be following up with @RepCarbajal to see how things are on the ground."]["Happy Birthday to Hall of Famer, philanthropist, and inspiration to generations of #SFGiants fans Willie Mac! #WillieMac80 https://t.co/aA0EiR2nlW"]["Thanks to the brave women of the #MeToo movement, we are at a watershed moment in the fight against sexual harassment. Know that we are with you every step of the way. #TimesUp https://t.co/FTT20fJxQX"]["Congratulations to California’s own @SenFeinstein on officially earning her own @realDonaldTrump nickname. Clearly doing something right! #FollowTheFacts"]["Visiting with #DREAMers from @FWD_us in the Capitol today with @RepLujanGrisham, @BennieGThompson, &amp; @RepCuellar (who had all just gotten back from the White House). #ProtectDREAMers #NoWall https://t.co/FdwBp9Q1Mj"]["I have no doubt that:\n1) If Democrats were in the majority, we would be working to #FollowTheFacts on Russia\n2) And the @HouseGOP would be calling for a thorough investigation as well"]["Nothing less than the safety and security of our country is on the line. Republicans must abandon their failure to #FollowTheFacts over the last year."]["And we're live! https://t.co/gs7fsFbU8y"]["Be sure to tune in at 2:30 pm ET as top @HouseDemocrats join me to talk about the effort to #FollowTheFacts on Russia. https://t.co/iMVT3xtNLp"]["Painful to think today marks 7 years since that terrible morning in Tucson. Thoughts remain with all who loved those we lost, &amp; I continue to be inspired by the strength of @GabbyGiffords &amp; @ShuttleCDRKelly."][".@realDonaldTrump’s decision to terminate temporary protected status for Salvadorans will tear apart families &amp; communities across the country. #SaveTPS https://t.co/wKLlerunuX"]["All of these and more would do a far better job of improving the everyday lives of American families than your ineffective &amp; immoral wall. No thanks. #NoWall"]["Help families gain access to high-speed internet"]["Increase @StateDept funding"]["Make a meaningful step towards saving pensions for some of the millions of Americans whose retirement savings are at risk"]["Give a helping hand to communities devastated by #wildfires"]["Help #PuertoRico &amp; #USVI in ongoing effort to rebuild in the wake of massive hurricanes"]["Provide the VA with urgently needed resources to keep America’s promise to #veterans"]["Treatment for people addicted to #opioids"]["Job training for workers"]["THREAD: @realDonaldTrump, that border wall funding you are asking for (again) could do so much more good in other places…. #NoWall"]["Trump Admin announcement that they want to drastically expand offshore drilling just 3 miles off East &amp; West coasts makes this article from last week even more worrying. #ProtectOurCoast https://t.co/KbH97gnw4T"]["Attorney General Sessions, your unjust war against Americans who legally use #marijuana is shameful &amp; insults the democratic processes that played out in states across the country."][".@NTSB prelim report shows deadly train crash in WA last month could’ve been prevented by positive train control tech. Railroads need to implement ASAP, no later than December 2018 deadline, and @USDOTFRA needs to enforce."][".@realDonaldTrump’s “Election Integrity” commission was built to encourage and enable voter suppression. Every American who cares about the right to vote should breathe a sigh of relief now that it no longer exists."]["We had a positive and productive meeting with @SpeakerRyan, @SenateMajLdr and Admin officials, &amp; all parties have agreed to continue discussing a path forward to quickly resolve all of the issues ahead of us. @SenSchumer https://t.co/BpL7qCYwkC"]["#Iran must pay attention to voices of the courageous protesters speaking out for their rights and well-being. That is the only way forward."]["“Americans have a lot to be thankful for this holiday season, and you – our brave service members – are at the top of our list.“ — @RepTimWalz https://t.co/bhucxORt7A"]["It is my honor to welcome Tibetan Filmmaker &amp; former Chinese political prisoner Dhondup Wangchen to our San Francisco community. My thoughts are with him as he is once again united with his wife &amp; children in freedom after so many years."]["Merry Christmas! This time of year always allows us a truly special time to reflect on the miraculous blessings of family, community and Country. I wish you all the very best during this Holiday Season. https://t.co/wWdNqLT5AB"]["The #GOPTaxScam signed by @realDonaldTrump today breaks every promise he has made to the American middle class. Instead of focusing on forgotten Americans, it bleeds working families dry to pad the pockets of corporations and the wealthiest 1%. https://t.co/bIlFXYK32k https://t.co/Md2S5Zo4x7"][".@SpeakerRyan must stop @HouseGOP efforts to hinder or end the investigation of Russia’s meddling in our elections. Read my letter to him here: https://t.co/zRMFKFx69h"]["Fernando is exactly the kind of young person America should be embracing. And he’s not alone. Across the nation, #DREAMers are contributing to &amp; strengthening our communities. America cannot afford to have Republicans continue to push them away."]["Now a third year medical student at @UCSF, Fernando is contributing to research to fight many diseases and disorders."]["Fernando was brought to the US when he was 9 yrs old. He was an AP scholar, received the IB Diploma, an Achievement Award in Foreign Language for French, and graduated cum laude from @SantaClaraUniv with a double major in Biology and French. He is undocumented."]["The fight to #ProtectDREAMers will have impacts in communities all across America. Right in my district, a young man named Fernando is just one of many whose future hangs in the balance."]["The stories of DREAMers like Tomas underscore just how dire this crisis is. We need to pass the #DREAMActNow! https://t.co/IXTtXep01i"]["Our country has been blessed with a long tradition of presidents who understand the importance of immigration. @realDonaldTrump’s vilification of these newcomers represents a complete reversal of that past."]["Republicans have spent all of 2017 throwing gift-wrapped handouts to their donors and special interests. Now, they’re doing everything they can to avoid actually addressing the needs of every day Americans. #DoYourJob"]["Republicans claim the #GOPTaxScam closes loopholes in our tax code. Far from it — it’s a Loophole Lollapalooza."]["Be sure to tune in as I discuss the ongoing fight to fund the federal government &amp; the fallout of the #GOPTaxScam. https://t.co/QIVOdgQYOX"]["Just a few minutes until I speak to reporters live from the Capitol about #GOPTaxScam &amp; the government funding fight. https://t.co/aPYqc2zJQB"]["There is no excuse for Republicans’ ongoing failure to act on the Congress’s responsibility to #ProtectDREAMers. https://t.co/5aOFajob3U"]["Still relevant. Probably even more so now that it’s happened *two times.* https://t.co/BxxaVwITyi"]["Every credible analysis of the #GOPTaxScam says it explodes the deficit. And the @HouseGOP knows it."]["-86 million middle class families get a tax hike\n-83% of benefits go to the top 1 percent\n-13 million Americans will be added to the rolls of the uninsured\n\nThat’s the real story of the #GOPTaxScam."]["Democrats are speaking out after Republicans passed their con-job #GOPTaxScam &amp; raised taxes on 86 million middle class families. Watch here: https://t.co/Nl26p3OHzi"][".@SpeakerRyan should check his facts – everyone from former GOP Economist Bruce Bartlett to @realDonaldTrump’s alma mater (@Wharton) knows the #GOPTaxScam will send the deficit soaring. https://t.co/x1XGJXbfuH"][".@AdyBarkan’s story reveals the sheer brutality of the #GOPTaxScam. https://t.co/l2JyYDLnGh"]["Republicans are about to take a victory lap to celebrate pillaging the future of America’s children. #GOPTaxScam"]["The American people will not forget the Republicans’ misrepresentations about the #GOPTaxScam."]["No hearing. No expert testimony. No listening to the American people. That has been the story of the #GOPTaxScam."]["Every member of the @SenateGOP should watch Laura’s story about how the #TaxCutsandJobsAct (really a #GOPTaxScam) would impact her son and her family. https://t.co/sNO7cr4q0D"]["Unsurprisingly, the #GOPTaxScam is so badly written the @HouseGOP will have to take *another* vote to pass it tomorrow morning. The seams of this Frankenstein’s monster are already showing."]["Shamefully, Republicans were cheering against the children as they rob from their future and ransack the middle class to reward the rich #GOPTaxScam"]["There are few things more disturbing than hearing the swell of cheers from the @HouseGOP as they raise taxes on 86 million middle class families. #GOPTaxScam"]["Incredibly moving argument against the #GOPTaxScam today from @AdyBarkan. #NotOnePenny https://t.co/nk9bJ7CbpC"]["Democrats are on the floor right now fighting to stop the #GOPTaxScam, which would hike taxes on 86 million middle class families. WATCH LIVE: https://t.co/BagwCxSb8X"]["We stand at a decisive moment for the future of America. The #GOPTaxScam takes the first step to obliterate Medicaid &amp; Medicare, while giving 83% of its benefits to the wealthiest 1 percent."]["Yesterday, I had the honor of welcoming @AdyBarkan to my office to share his story and those of so many more. Today, Ady joins us to fight back against the shameful #GOPTaxScam. Thank you, Ady! https://t.co/1qYrNUXGqP"]["I’m glad to welcome the @LittleLobbyists and other advocates to the Capitol to lend their hand in the fight against… https://t.co/i8xLKrHotX"]["Updated link: https://t.co/X4WoNAobDS https://t.co/7uYHatjbkX"]["Tune in at 11:30 am ET as @LittleLobbyists and other advocates join us to highlight the negative impacts of the #GOPTaxScam on families. https://t.co/w2voI7N4TF"]["Our thoughts and prayers are with the families of those killed and the victims still in critical condition following today’s Amtrak derailment. While no words can console those who lost loved ones, may it provide them some measure of comfort that so many grieve with them."]["By the end, the #GOPTaxScam will…\n-Raise taxes on 86 million middle class households\n-Hand 83% of the benefits to the wealthiest 1% of Americans\n\nThis will go down as one of the most scandalous, obscene acts of plutocracy ever."]["The #CorkerKickback is just another example of how the #GOPTaxScam is a Frankenstein’s monster of giveaways to special interests – and a reminder of why @SpeakerRyan &amp; @SenateMajLdr are trying so hard to pass this bill before the public learns even more. https://t.co/I7hXWMbc15"]["Now this is shocking: the #GOPTaxScam punishes hardworking middle class couples for getting married. https://t.co/bZkDnGSnMa"]["Time for another look into my week in Washington &amp; San Francisco. https://t.co/ivHQIFMAH4"]["DANGER! Trump Admin is going further down a dangerous and un-American path of word and thought control. @POTUS has no respect for and has banned words including: \n\n“vulnerable”\n\n“diversity”\n\n“transgender”\n\n“evidence-based”\n\n“science-based”\n\n#CDC7words\n\nhttps://t.co/cUw9IVQw9t"]["The #GOPTaxScam has grown more outrageous and cowardly with each version. The American people see it for exactly the #BillionairesFirst con job it is. https://t.co/DRmZw0tdcD"]["Trump Admin's continued attack on @usedgov's core mission to ensure civil rights for all students and unraveling IDEA is disappointing and destructive. #StandwithStudents https://t.co/xCpY8gwIFS"]["Today is the last day of Open Enrollment. Make sure you and your loved ones #GetCovered before time runs out! https://t.co/GlOYHMZ3h9"][".@RepThompson knows that fighting for America’s middle class families, seniors, &amp; veterans means we have to fight the #GOPTaxScam. https://t.co/hggJWKnRzW"]["The path before us is clear: Congress must act quickly to #SaveTheInternet by passing @USRepMikeDoyle’s resolution to overturn this disastrous decision. https://t.co/caWgKrXhKL"][".@AjitPaiFCC has eagerly led the effort to saddle consumers with higher costs and less choice, throttle competition and punish entrepreneurs and small businesses. #NetNeutrality"]["The power of the Internet has always been rooted in its role as a level playing field where the best ideas, not the deepest pockets, succeed. The @FCC’s decision to repeal #NetNeutrality is nothing short of radical."]["Five years after #SandyHook, it’s still difficult to come to terms with the tragedy of that day. But this much is clear – even now, the only option we have is to #HonorWithAction. Anything less – anything – is unacceptable. https://t.co/pRSoOK053f"]["The @FCC just voted to throw away #NetNeutrality, which is central to saving families money, creating good-paying jobs, and empowering small businesses. https://t.co/ReB2ROxWF0"]["#NetNeutrality is what gives you the power to use to apps, games, and websites you like, no matter what your internet company thinks. The threat of losing that – and seeing costs go up for families – is why we must #SaveTheInternet from the @FCC. https://t.co/p0v6Eg5NKm"]["Forget CRomnibus — @HouseGOP’s proposed funding package is a “puntibus” that leaves urgent, must-address issues for another day. #DoYourJob"]["#NetNeutrality is central to building a good economy and ensuring we are creating high-quality, good-paying jobs for the 21st Century. @FCC should delay its vote to destroy it."]["The idea that the @FCC’s process for throwing out #NetNeutrality could be in any way fraudulent is deeply concerning. We must protect the open internet!"]["At this point, it’s clear tax cuts for the rich are part of the Republicans’ DNA, no matter who it hurts. #GOPTaxScam #BillionairesFirst"]["With every version, the #GOPTaxScam becomes an even more brazen, damaging, and immoral con job. And all signs are the American people aren’t falling for it."]["Republicans should think twice before voting for the #GOPTaxScam. Trickle down didn’t work before. It won’t work now. And Americans won’t forget who raised their taxes and left them holding the bill. https://t.co/AD3anREdnh"]["From Silicon Valley to the Quad Cities, #NetNeutrality makes sure small business owners have a shot in today’s economy. The @FCC must delay tomorrow’s vote to repeal. https://t.co/G6ppEnCvj5"]["There’s a special message on my website from #DREAMers. Take a look! #DREAMActNow https://t.co/2af53i5tSP"]["Today’s conference meeting on the #GOPTaxScam is a sham! Watch as Democrats fight back: https://t.co/Lt284kFBrD"]["Just through those red curtains and down the hall, Republicans will hold a sham hearing their #GOPTaxScam. The reality is they’ve already made up their minds and this will just be a show to trick Americans into thinking otherwise. https://t.co/6JfOLhgM2J"]["In the House, when someone is elected, we give them their seat — we don’t hold it back so we can have a vote go the way we want it to. @SenateMajLdr, don’t disenfranchise Alabama voters by holding a vote on #GOPTaxScam before Doug Jones joins the Senate. #ALSEN"]["American middle class families deserve far better than the immoral and destructive #GOPTaxScam. https://t.co/IC2BrhDmop"]["House &amp; Senate Democrats are fighting to protect the pensions that Americans have worked so hard for. https://t.co/to7y48Gq7e"]["I look forward to seeing Senator-elect Jones take his seat in the US Senate! #ALSEN"]["Incredibly thankful to @will_c_fischer of @VoteVets for his passionate opposition to the #GOPTaxScam’s attack on our veterans. You are going to want to watch this. https://t.co/pyzGhblFHf"]["Had the pleasure of welcoming @SenDuckworth back to the House side of Capitol Hill to talk about how #GOPTaxScam impacts her fellow veterans. *Everyone* should watch. https://t.co/OIPsvb9gTP"]["Wishing the very best to all celebrating the start of the Festival of Lights tonight. #HappyHanukkah! https://t.co/IMtIxF4Qsl"]["It’s been two years since the world came together to sign the historic #ParisAgreement. Now, @realDonaldTrump is committed to abandoning American leadership on climate change. The American people have other thoughts. #StillIn https://t.co/tLpbApJM5n https://t.co/wrhU75sA9q"]["The 3 R’s of the #GOPTaxScam: \nRobs from the future\nRips off the Middle Class\nRewards the wealthy"][".@realDonaldTrump’s attack on @SenGillibrand was shameful &amp; disgusting. I would say that, as with many things the President says, it is likely a projection of his own behavior."]["Proud to stand with @SenDuckworth, @RepDWStweets, @JuliaBrownley26 and veterans’ advocates in opposition to the #GOPTaxScam’s wrong-minded attack on our veterans. https://t.co/7C7GWQ7ReX"]["The #GOPTaxScam promises to be a nightmare for America’s veterans. Want to hear how? Tune in at 2:30 pm ET as I speak live from the Capitol."]["Thank you @jimmykimmel for your ongoing fight to make sure all children have access to health care. And to everyone else, remember to #GetCovered by Friday at https://t.co/GlOYHMZ3h9 https://t.co/boCDoqudgP"]["Heartbroken to hear of the passing of @mayoredlee. He was a true champion for the people &amp; a dear friend to the many lucky enough to know him. My deepest love &amp; prayers are with his wife Anita &amp; daughters Brianna &amp; Tania. Read my full statement here: https://t.co/gGHaQfaXEZ https://t.co/uFBPPS9OK5"]["Good to see that Americans are (rightly) seeing through the #GOPTaxScam. Ten of millions of middle class families will see a tax hike under this sham. https://t.co/PlJjTZ3BPl"]["Deeply thankful for the heroism &amp; excellence of first responders, not to mention the strength of the New York community, following today’s terrorist attack in Manhattan."]["Personal highlight from this week? Meeting with Paddington Bear! https://t.co/i9feOBScfi"]["November’s #JobsReport reveals that even with full control of the House, Senate and White House, Republicans have still failed to deliver on their promise of higher wages for working families. https://t.co/vnEhG7yhSz"]["The priorities we are seeking solutions on share broad bipartisan support. It’s time for action – Americans deserve it. https://t.co/Ee1wmNThoj"]["These pictures are truly astounding. #PearlHarbor https://t.co/vBuBG2B0II"]["As we head into this afternoon’s meeting with @realDonaldTrump, we are committed to finding solutions to the urgent priorities the American ppl need us to act on. https://t.co/Hx060doqNu"]["Republicans have made this no secret: the #GOPTaxScam — and the attacks on Medicare &amp; Medicaid it will trigger — will pillage and plunder the American Middle Class."]["The radical Concealed Carry Reciprocity bill passed by the House yesterday is a gift to the NRA — and the first gun bill passed since #LasVegas. Appalling. #StopCCR"]["Tune in as I discuss the ongoing fight to stop the #GOPTaxScam. https://t.co/53zRVTqYEQ"]["The effort to stop the #GOPTaxScam is going strong. Be sure to watch at 10:45 am ET as I speak live from the Capitol."]["Inviting violent criminals to carry concealed weapons doesn’t save lives\nInviting domestic abusers to carry concealed weapons doesn’t save lives\nInviting convicted stalkers to carry concealed weapons doesn’t save lives\n \nYet the @HouseGOP just voted to do exactly that #StopCCR"]["@SpeakerRyan .@SpeakerRyan, you’ve already admitted you will use #GOPTaxScam as an excuse to effectively end Medicare &amp; Medicaid as we know it — and for millions of families, that will feel awfully close to Armageddon. https://t.co/2DLGcjk6Ob"]["I couldn’t agree more with this decision. #BelieveWomen https://t.co/N7uBr4K1UI"]["Inspired by the committed families stepping up to fight for their futures today and every day. #NotOnePenny #GOPTaxScam https://t.co/wNPmd3Yg9h"]["So many Americans count on the medical expense deduction to help them make ends meet. But House Republicans voted to leave them at the mercy of crushing medical bills. #NotOnePenny #BillionairesFirst"]["I was going to make a comment about how terrible the #GOPTaxScam is for middle class families — but first, can we all just appreciate how cute all these little elves are?! https://t.co/3ZC0BXi5jx"]["It’s hard enough raising a family. The #GOPTaxScam will lead to more parents losing sleep, worrying about how they … https://t.co/ktsNWVI9XU"]["With thousands of lives, homes, and acres under threat, my staff and I are working with @JuliaBrownley26 to track the #ThomasFire in #Ventura. Stay safe and watch out for your loved ones."]["Whether you are fighting to protect domestic violence survivors or are looking to protect local public safety decisions, the answer is clear: we must #StopCCR. #HR38 https://t.co/IciKKgYfCn"]["In #MasterpieceCakeshop case, the #SupremeCourt must once again affirm that no law sanctions discrimination and that all Americans have the right to fair and equal treatment. Read my full statement here: https://t.co/ueYtPv3FNd"]["Those who seek to reverse the remarkable progress we’ve made continue to seek justification for their flagrant, hateful discrimination."]["The true story of America is a story that celebrates the constant march of progress toward full and equal rights for all people. Yet the rights of #LGBT ppl remain under attack across the country."]["I want every single California Republican to understand this. Your ideology doesn’t come first. Your party doesn’t come first. The PEOPLE come first. If you fail to recognize that, you don’t belong here. https://t.co/xjbyOTI2MC"]["This is why we need to be as loud as possible. #GOPTaxScam  https://t.co/VIippSRn47"]["For over 100 years, we have recognized that America is not America w/o its great #PublicLands. @realDonaldTrump’s decision to remove protections from major portions of Utah’s #BearsEars &amp; #GrandStaircaseEscalante presents a real threat to that tradition. https://t.co/xab15cnu7q"]["The #GOPTaxScam once again proves the @HouseGOP hasn’t learned from history. The LAST thing we should be doing is rewarding outsourcers with a tax break – but that’s exactly what they aim to do."]["The #GOPTaxScam is one of the worst bills to be brought to the floor in the history of the United States. We will fight with everything we have to stop this bill from becoming the law of the land."]["If you want to understand the importance of the fight to stop the #GOPTaxScam, look to the fight to stop #Trumpcare. That’s how crucial it is that we stop this thing."]["Republicans are already trying to use the #GOPTaxScam to justify taking an axe to our children’s health care. #ProtectOurCare source: @voxdotcom https://t.co/nYKefFW2kO"]["@SenSchumer @realDonaldTrump There is a bipartisan path forward on all of these items."]["@SenSchumer @realDonaldTrump We have to provide funding for community health centers and CHIP, as well as relief for the millions of Americans still reeling from natural disasters. And we must also come together on a bipartisan deal to pass the DREAM Act along with tough border security measures."]["@SenSchumer @realDonaldTrump We need to reach a budget agreement that equally boosts funds for our military and key priorities here at home including the opioid crisis, pension plans and rural infrastructure."]["@SenSchumer We’re glad the White House has reached out and asked for a second meeting.  We hope @realDonaldTrump will go into this meeting with an open mind, rather than deciding that an agreement can’t be reached beforehand."]["As negotiations with our Republican counterparts continue, we are hopeful the President will be open to an agreement to address the urgent needs of the American people and keep government open. Read my full statement w/ @SenSchumer here: https://t.co/figVYCgRsu"][".@repsandylevin is a principled patriot, champion of the people of Michigan and deeply esteemed leader in the Congress. My colleagues and I wish him the very best as he leaves Congress and begins to write the next chapter of his journey."]["In passing the #GOPTaxScam, @SenateGOP has sealed its betrayal of the American middle class. https://t.co/BzuMZJwGx8 https://t.co/hkx5mV3qpl"][".@SenateMajLdr, if you are so intent on forcing middle class families to foot the bill so your donors can have a tax break, at least have the decency to find a printer. #GOPTaxScam https://t.co/qFkfaru6ml"]["Proud to stand with @RepSpeier in fighting for the #MeToo Congress Act. RT to spread the word! https://t.co/EoaeB0a4jn"]["Incredibly proud of the role the #LGBT community in San Francisco (and across the nation) played in fighting to put the spotlight on the scourge of HIV/AIDS and the suffering of those living with it. This fight would not exist without your determination. #WorldAIDSDay"]["This #WorldAIDSDay, we are thankful for the memories of all the friends and family we have lost to this terrible disease, and for all those who continue the fight against it today. https://t.co/l1JOGjHQ4E"]["“GOP plan scraps deductions for the middle class to bankroll tax cuts for rich people.” That says all you need to know. #GOPTaxScam https://t.co/QVSOEbfBuI"]["Now more than ever, we need a fully independent commission to #ProtectOurDemocracy from the types of meddling that took place in 2016. Republicans must stop shielding POTUS from those who wish to #FollowTheFacts."]["Congress has a duty to uphold justice and ensure Robert Mueller’s investigation is able to #FollowTheFacts without White House interference."]["The questions we need answered now:\n1) What does @realDonaldTrump know about Russian meddling?\n2) Why does he still refuse to take action against Russia?"]["We should all be alarmed by @realDonaldTrump's consistent attempts to obstruct effort to #FollowTheFacts on Russia."]["The guilty plea of President Trump’s former National Security Advisor Flynn to lying to the FBI about his communications with Russian authorities marks a dark moment in our nation’s history. https://t.co/akxUDGur2y https://t.co/p0IlVIpWDv"]["Each and every American should be disgusted by the callous way the #GOPTaxScam approaches the needs of seniors. https://t.co/HKYMzUQAsz"]["-Students\n-Seniors\n-Teachers\n-Single parents\nThey and more will have a harder time under the #GOPTaxScam. How can Rs seriously claim otherwise?"]["Unless they’ve have been asleep for the last 30 years, there’s no excuse for Republicans continuing to push the disproven and failed “trickle down economics” in the #GOPTaxScam."]["This is not how you help middle class families. #GOPTaxScam https://t.co/aLv2sKuikr"]["New analysis (once again) confirms the #GOPTaxScam will sell out middle class families to give the wealthy a tax cut. https://t.co/GExsi8NucN"]["Did you know that the #GOPTaxScam would give a TAX BREAK to companies that OUTSOURCE American jobs to other countries?"]["#GOPTaxScam = a blatant attack on Americans’ health care https://t.co/GuSXYRndmF"]["According to experts, the #GOPTaxScam would slash home values by 10%."]["The truth of the #GOPTaxScam is that Republicans marched past a large number of real ways to help empower our economy and decided to just give their donors a tax cut instead."]["FACT: 82 million middle class families would get a tax hike under the #GOPTaxScam. And they’re not happy about it. https://t.co/OawcR9nOJo"]["REMINDER: The 👏 #GOPTaxScam 👏 is 👏 a 👏 gift 👏 to 👏 the 👏 wealthy 👏 not 👏 middle 👏 class 👏 families. https://t.co/CjMZ1rDj3A"]["You need to read this. #mustread #ThursdayThoughts https://t.co/6fV8G6Oa2V"]["From the #DREAMAct to rebuilding communities impacted by hurricanes and wildfires, the priorities Democrats are fighting for would pass if only @SpeakerRyan would let them come to the floor."]["There can be no denying that the #GOPTaxScam will devastate middle class families across America. Tune in here: https://t.co/VqQQoSVdwg"]["RT if you worry about how #GOPTaxScam would affect your family. https://t.co/7qrC3UTLzv"]["cc: @SpeakerRyan, @SenateMajLdr, &amp; the entire @SenateGOP https://t.co/QH3xpnjTCJ"][".@realDonaldTrump, now will you admit the #GOPTaxScam won’t create jobs or boost wages? https://t.co/z5hZBd5TVw"]["Want to see through @realDonaldTrump’s claims about the #GOPTaxScam today in Missouri? These numbers tell a striking story. #mopolitics https://t.co/k2tuOowms6"]["Zero tolerance means consequences – for everyone.  No matter your contribution to our country, you do not get a pass to harass or discriminate."]["Republicans will do anything to obscure the devastating impact their #GOPTaxScam will have on middle class families nationwide. https://t.co/JEeCfiJvcH"]["Incredibly thankful for the determination of Leandra English, the rightful Acting Director of @CFPB. #DefendCFPB https://t.co/giUKsOCL2p"]["Don’t fall for Republicans’ claims about the #GOPTaxScam. RT to spread the word! https://t.co/mb4XDg8v0i"][".@realDonaldTrump now knows that his verbal abuse will no longer be tolerated. His empty chair photo opp showed he’s more interested in stunts than in addressing the needs of the American people. Poor Ryan and McConnell relegated to props. Sad!"]["Democrats are working for a bipartisan solution to keep government open. @realDonaldTrump on the other hand… https://t.co/mJgRcr7Dx7"]["@SenateMajLdr @SpeakerRyan @SenSchumer We look forward to continuing to work in good faith, as we have been for the last month, with our Republican colleagues in Congress to do just that."]["@SenateMajLdr @SpeakerRyan @SenSchumer If the President, who already said earlier this year that ‘our country needs a good shutdown,’ isn’t interested in addressing the difficult year end agenda, we’ll work with those Republicans who are, as we did in April."]["@SenateMajLdr @SpeakerRyan @SenSchumer We don’t have any time to waste in addressing the issues that confront us, so we’re going to continue to negotiate with Republican leaders who may be interested in reaching a bipartisan agreement."]["Rather than going to the White House for a show meeting that won’t result in an agreement, we’ve asked @SenateMajLdr &amp; @SpeakerRyan to meet this afternoon. Read my full statement w/ @SenSchumer here: https://t.co/v17WhoEJFU"]["Republicans have fought from the start to destroy the @CFPB’s efforts to protect consumers from bad actors on Wall Street. #DefendCFPB\n\nRead our amicus brief in rejecting the sham installation of Mick Mulvaney here: https://t.co/ePpk199mqa"]["This afternoon, I spoke with Melanie Sloan who worked for Congressman Conyers on the Judiciary Committee in the mid-1990s.  I believe what Ms. Sloan has told me. Read my full statement: https://t.co/OewsWUl6ZX"]["A worthwhile read for all who worry about the #GOPTaxScam’s impact on families. https://t.co/wxWJuzfUAW"]["Zero tolerance means consequences. I have asked for an ethics investigation, and as that investigation continues, @RepJohnConyers has agreed to step aside as Ranking Member. No matter how great an individual’s legacy, it is not a license for harassment. https://t.co/H5ikWy1iqT"]["Sitting down w/ @chucktodd tomorrow on @MeetThePress to talk about the Republicans’ #GOPTaxScam, the December Congressional agenda and more. Check your local listings. https://t.co/48QmrzmccD"]["Congress must do more to address sexual harassment on Capitol Hill. We need a bipartisan effort to put an end to the days of secret settlements paid for by taxpayer dollars. #WeMustDoMore https://t.co/NGZNPQPLTE"]["Our hearts and prayers go out to the Egyptian people in this terrible time. We are horrified by these terrorists’ assault on innocent people who were practicing their faith in peace. https://t.co/7FjL6PytgI"]["Thanksgiving is a time to appreciate our families, loved ones, and all our blessings. From my family to yours, we wish you a #HappyThanksgiving! https://t.co/jKOldn3FW1"]["We must protect the freedom of the internet from the latest @FCC's move to dismantle net neutrality– an attack on America’s entrepreneurship, innovation, &amp; competition of the internet."]["The Administration’s decision to terminate temporary protected status for 59,000 Haitian nationals will only deepen suffering in Haiti. Congress must act in the next 18 months to protect them. https://t.co/1TelzHJqeZ"]["BREAKING: 82 million middle class households face a TAX HIKE under the Senate's obscene #GOPTaxScam. We must defeat Republicans’ monstrous assault on the middle class. https://t.co/4njh2pZ1Sz"]["Today and every day, I stand with our transgender friends &amp; remember those who have lost their lives fighting for being true to themselves. Trans rights are human rights. #TDOR https://t.co/02fkJkP3Hz"]["It sure was a busy week at the Capitol. Take a look at some behind the scenes photos of some things I worked on this past week: https://t.co/1GBCd7gQ5R"][".@RepDelBene is calling out Republicans for doling out permanent tax giveaways to the people who need them least – corporations. #GOPTaxScam https://t.co/FZzxE0zjMX"]["Looking for a quick reminder of why the #GOPTaxScam is so bad for middle class families? Look no further: https://t.co/6KhHi7NLqg"]["#ABetterDeal on Pensions means: No. Cuts. https://t.co/AFpBD5dbkL"]["Americans deserve the truth about the #GOPTaxScam. Tune in as I talk about that and more. https://t.co/ceoQsWtvRc"]["I can’t say this enough: 36 million middle class families would get a tax hike under @SpeakerRyan’s #GOPTaxScam."][".@SenSchumer &amp; I are unveiling Democrats’ proposal to protect Americans’ pensions right now. Watch here: https://t.co/f0ngipIAsC"]["FACT: The #GOPTaxScam does away with the Work Opportunity Tax Credits – an important tool in connecting Americans with good jobs."][".@HouseDemocrats &amp; @SenateDems will be unveiling our newest #ABetterDeal proposal at 10:45 am ET be sure to tune in! https://t.co/f0ngipIAsC"]["“Nearly every claim Republicans are using to market their tax plan is at best a distortion, at worst a deliberate falsehood.” #GOPTaxScam #BillionairesFirst https://t.co/HzrZCsrm14"]["The Senate Finance Committee just rejected @SpeakerRyan’s #GOPTaxScam in a 26-0 vote. And he’s *still* asking @HouseGOP to walk the plank. https://t.co/Lq8foFYSfR"]["A special dose of #WednesdayWisdom for the @HouseGOP: your job is to serve your constituents, not special interests. #NotOnePenny"]["Under Director Cordray’s steady leadership, @CFPB has returned nearly $12 billion to 29 million wronged Americans. We will work to ensure his successor will live up his example as a champion for hard-working people. https://t.co/AKGN0gicT5"]["Democrats are standing up for women &amp; families who suffer under the #GOPTaxScam. https://t.co/NC66tSy5zz"]["Nearly 9 million families claim the medical expense deduction nationwide, worth nearly $10,000 on average. #GOPTaxScam would permanently eliminate that benefit.\n\nBut please, @SpeakerRyan, tell us how the #GOPTaxScam will help the Middle Class. 🤨"]["Republicans’ addiction to repealing the #ACA and raising Americans’ health costs makes their terrible #GOPTaxScam downright deadly. https://t.co/OaoXE2Kf8r"]["So let’s get this straight… the GOP wants the #GOPTaxScam to kick millions off health insurance (by repealing key part of #ACA) AND repeal the tax deduction for medical expenses? Have they no heart?"]["REMINDER: “Trickle-down economics” has no basis in reality. #GOPTaxScam https://t.co/jER4hIZIx6"]["Truly thankful to all who came out to help us make the case against the heartless #GOPTaxScam. cc: @MomsRising https://t.co/rSKktziMWI"]["Always amazed by the heart &amp; care that teachers bring to the classroom every day! #aew2017\n\nHow have teachers affected your life?"]["Remember: 38 million families will see their taxes go up under #GOPTaxScam. @HouseGOP Members are being asked to walk the plank. https://t.co/PlknWFcLKU"]["@repmarkpocan Wishing you the very best, Mark!"][".@AlexAzar, I hope you will join Democrats to create real bipartisan action to lower health costs. But we will hold you accountable if you try to put your Big Pharma friends ahead of the needs of the American people. I promise. https://t.co/neBCUBtyAi"]["With all due respect, Mr. President, do you understand what you are saying? Your #GOPTaxScam raises taxes on 38 million middle class families. And now, you want to raise premiums on millions of families to throw even more tax cuts to the rich?\n\nNo thanks. 👎 👎 👎 https://t.co/TGUfhMrYqC"]["Another busy week in Washington. Another chance to share some of the highlights. Take a look here: https://t.co/gDu7gOMsd8"]["On #VeteransDay and every day, we recognize &amp; honor all who wore the uniform to defend our nation and continue to serve in our nation’s armed forces. https://t.co/h72c9gPvI2"]["Honored to see so many friends yesterday at @vetshelpingvets gala. A truly meaningful reminder that we have a sacred duty to all who served when they come home. #VeteransDay https://t.co/sLi0bcva9B"]["Many thanks to all who made today’s event at San Francisco Fire Dept. Station 4 a success! https://t.co/FTVHxe8boI"]["Veterans &amp; servicemembers deserve more than our thanks and gratitude. As a nation, we must always #BeThere, today and everyday. https://t.co/bPPfKquYO9"]["The #GOPTaxScam is a gift to big business – letting them keep the State &amp; Local Tax deduction that is gutted for America’s middle class."]["All 14 CA Republicans voted for a #GOPTaxScam that wouldn’t allow those who lost property in the #CaliforniaWildfires to deduct those losses."]["And we're live! https://t.co/KrICGlTDhn https://t.co/xwlwh8zBfF"]["Tune in at 11 am PT as @RepBarbaraLee joins me to speak out against the #GOPTaxScam. https://t.co/gxMMDkrq1i"]["The @HouseGOP is trying to take the American people for fools. We’re not going to stand for it. #GOPTaxScam https://t.co/HAFWLSfILB"]["The dam is breaking on dishonest claim that the #GOPTaxScam will help the middle class. The facts show the *exact* opposite."]["The American Middle Class is hearing the truth about the #GOPTaxScam, and they are far from impressed. #BillionairesFirst"]["I’m speaking live from the Capitol. #GOPTaxScam https://t.co/DeDgxcuFux"][".@realDonaldTrump’s Chief Economic Advisor accidentally told the truth about the #GOPTaxScam. #BillionairesFirst https://t.co/cLqeerY7nR https://t.co/xSXYZpA8u8"]["🚨🚨38 million middle class households🚨🚨 will see a tax hike under the #GOPTaxScam according to @TaxPolicyCenter. Read my statement here: https://t.co/P8IH4xAzSe https://t.co/w10Kcwdqgd"]["Republicans say the drastic corporate tax cuts in their #GOPTaxScam will create jobs. It’s time they put their money where their mouth is. https://t.co/Hg8uolL3Iq"]["Democrats have a plan to make @HouseGOP put their money where their mouth is on #GOPTaxScam.  https://t.co/Hg8uolL3Iq"]["Students are the future of our nation &amp; foundation of our strength. Why do Rs want to make it harder for them to pay off loans? #GOPTaxScam https://t.co/ipRcizROaL"]["Education is the most important investment we can make in our future. And yet, the #GOPTaxScam leaves many students out in the cold."][".@GWSMHS student Max Ruben is here today calling on Congress to stand with students &amp; stop #GOPTaxScam. Thanks Max! https://t.co/NNIgQm48zJ"]["We all know someone living w/ student loans. Join in now as we hear how #GOPTaxScam would affect them: https://t.co/dqvbCxdvUD"]["The #GOPTaxScam would make a bad situation even worse for many living with student loans.\n\nWatch @ 1 pm ET: https://t.co/dqvbCxdvUD"]["Amazing to think that today marks 101 years since Jeanette Rankin became the first woman elected to the House of Representatives! https://t.co/E0ZAStOJyz"]["The Trump Admin’s decision to end #TPS for ppl from Nicaragua = a cowardly assault on families across America https://t.co/SPAdqG1fEv"]["We should be helping young people build bright futures. And yet the GOP tax plan erases student loan interest deduction. #BillionairesFirst"]["This is a must read. #EndGunViolence https://t.co/K0CSeOvRpn"]["Friends don’t let friends get away with not having health insurance. #GetCovered https://t.co/GlOYHMZ3h9"]["Great to talk with @davidcicilline &amp; @JimLangevin today during @CCRINews tour about stopping GOP tax plan &amp; giving families #ABetterDeal! https://t.co/GdevKXke7S"]["More than 270,000 Americans have parents receiving TPS. Tearing families apart is never acceptable. #SaveTPS https://t.co/TeiRAR1wAr"]["No matter how you look at it, the reality is that the #BillionairesFirst tax plan will explode the debt. #CNNSOTU https://t.co/PAczaOJLe6"]["As we mourn the lives that were cruelly cut short today, we must resolve to drive violence from all our communities. https://t.co/IOr1u2AlXX"]["We have to #FollowTheFacts to protect our democracy. You would think the President would appreciate that. #CNNSOTU https://t.co/xMA0bWvSqm"]["FACT: @SpeakerRyan &amp; @SenateMajLdr’s tax plan incentivizes companies who send American jobs overseas. #CNNSOTU"]["Any serious attempt to rewrite the tax code must be bipartisan. #CNNSOTU"]["This is a moment of truth for America: will we go deeply into debt in order to slash taxes for the rich? #CNNSOTU"]["Take a look at a few behind-the-scenes moments from my week: https://t.co/LKIsepDuSe"]["Sitting down w/ @jaketapper tomorrow on #CNNSOTU to talk about the GOP tax plan &amp; #ABetterDeal. Be sure to watch at 9 am ET! https://t.co/pnEYSR1i8X"][".@rosadelauro is calling the @HouseGOP out for rigging the game against the middle class. #BillionairesFirst https://t.co/bwer4lnLNp"]["Tune in as we hear the stories of middle class Americans who will suffer under the #BillionairesFirst tax plan: https://t.co/ifn8uSacCf"]["Watch at 11 am ET as we hear stories of middle class Americans who will be negatively impacted by the GOP tax plan: https://t.co/ifn8uSacCf"]["A GOP tax bill that explodes the deficit by $1.5 trillion means dumping $4600 in debt on every man, woman &amp; child in America."]["The GOP secretly wrote the #BillionairesFirst tax plan in hopes that no one would catch its painful impact on middle class families."]["If you have student loans — or may soon have them — the #BillionairesFirst tax plan will leave you behind."]["The #BillionairesFirst tax plan is nothing more than a shell game which will hurt millions of middle class families. https://t.co/xKv3RMIJdA"]["And we're live! https://t.co/YqR4TeRjdl"]["We will speak live at 2:30 pm ET on how GOP tax plan puts #BillionairesFirst at the expense of middle class families https://t.co/OvMn991dL7"]["Tune in live as I discuss Speaker Ryan’s disastrous #BillionairesFirst tax plan live from the Capitol! https://t.co/8V2yXB5fri"]["We are all praying for our fellow Americans in Puerto Rico &amp; the U.S. Virgin Islands. #USVIStrong #PuertoRicoSeLevanta https://t.co/oM3YUa26ml"]["Tune in as @HouseDemocrats show support for our fellow Americans in #PuertoRico &amp; #USVI: https://t.co/oHoO3A5vWe"]["Just 30 minutes until @HouseDemocrats once again speak out in support of our fellow Americans in #PuertoRico &amp; #USVI https://t.co/oHoO3A5vWe"]["Americans are have already started to line up against @SpeakerRyan’s tax plan… #NotOnePenny https://t.co/U2vzpEJSSA"]["Republicans are feverishly working to hide the damage their #BillionairesFirst tax plan would inflict on Americans. https://t.co/E66UFfCvaL"]["Whether it's their activism, military service, or cultural heritage, the contributions of America’s Tribal Nations are to be treasured #NAHM https://t.co/nWhgN4SVZJ"]["Dems will come together at 10 am ET Thursday &amp; stand in solidarity w/ our fellow Americans in #PuertoRico &amp; #USVI. https://t.co/oHoO3A5vWe"][".@SenSchumer and I just rolled out the newest proposal in Democrats’ #ABetterDeal agenda. Read about it here: https://t.co/N5GXDEeszN"]["This is ridiculous. #LetScientistsSpeak #ClimateChange #CaliforniaWildfires https://t.co/tSRonJ4hWI"]["TPS recipients have been contributing to local economies nationwide for years. Ending it would cost US dearly. #SaveTPS"]["Workers have fought hard to make their voices heard. We must protect their right to negotiate for #ABetterDeal: https://t.co/tKiR0Gq0ZI"][".@HouseDemocrats &amp; @SenateDems will present our plan to let workers negotiate for #ABetterDeal at 10:30 am ET: https://t.co/tKiR0Gq0ZI"]["Went on a mini (one-stop) pub crawl yesterday with @JKCorden. Will be on tonight’s #latelateshow at 12:37 am ET! https://t.co/JVlxnGkRwv"]["We join in mourning the dead, praying for the wounded, thanking first responders, &amp; sending our love to all of NYC. https://t.co/UnNs9dgNMt https://t.co/nI1huNnNIL"]["Closely following the developments out of Manhattan. Praying for the injured &amp; those lost. My heart is with you. #NYC"]["Republicans are gearing up to make the tax code a dream for the rich – &amp; a nightmare for working families. https://t.co/D9j91DLSQt"]["Happy #Halloween! Wishing all the little ones the very best on their candy hunt tonight!"]["President Trump can’t hide from the facts – and neither should we. #FollowTheFacts #WakeUpGOP https://t.co/N1Ob9l8WNr"]["#IndictmentMonday &amp; guilty plea show a clear link btw Trump campaign officials &amp; Russians seeking to influence our election. #FollowTheFacts"]["Democrats have a plan to create 10 million new jobs for American families. Read it here. #ABetterDeal https://t.co/o2XLkyfFDu"][".@SpeakerRyan is fighting to pass massive changes into law before Americans are aware of how his plan hurts their families. #NotOnePenny https://t.co/qaPh2UOryG"]["The indictments of Paul Manafort &amp; Rick Gates underscore need for an outside indpt commission to #FollowTheFacts. https://t.co/FNsocZ0JFB"]["Time to take another look behind  the scenes at my week in Washington. https://t.co/4RauugI1Yt"]["Being updated on #CaliforniaWildfires response w/ other Reps at @SantaRosaJC. Thank you to first responders &amp; local officials! https://t.co/HV4KJ3yRHi"]["Read all about @HouseDemocrats &amp; @SenateDems’ plan to give Americans #ABetterDeal on prescription drugs: https://t.co/0XR7tXWUa5"]["So cute! https://t.co/yiw78nxEeZ"]["You can’t hand 80% of a bill’s tax cuts to the rich and then say its primary design is to help working families, @SpeakerRyan. #NotOnePenny https://t.co/fjO1Bm7u2G"]["How can @HouseGOP say #BillionairesFirst tax plan helps middle class families when it will slash home values by 10%? https://t.co/Y8L9EzW7zf"]["Words are not enough. The Admin must send up a viable funding request for this life-saving mission to succeed. https://t.co/dqsjZAGK4X https://t.co/Szwz9ZYIG5"]["Republicans are looting the health, financial security and the future of Middle Class families with #GOPBudget &amp; tax plan."]["Republicans are carrying out a massive con on the American people with their #GOPBudget &amp; #BillionairesFirst tax plan."]["Be sure to tune in at 10:45 am ET as I speak live about the devastating #GOPBudget &amp; #BillionairesFirst tax plan: https://t.co/M283pk2mWU"]["A woman’s access to contraception shouldn’t be up to her bosses and it shouldn’t be up to @POTUS. Tune in here: https://t.co/Qts6BVi5ca"]["Our budget should be a statement of our priorities, not a grab bag of gifts to wealthiest Americans. #GOPBudget"]["Reagan. Bush 41. Bush 43. They all tried \"Trickle-Down Economics.\" And not once did it help working families. #NotOnePenny"]["Cutting our investments in education is – with stiff competition – one of the worst ideas the @HouseGOP has to offer."]["#GOPBudget borrows from our children's future to give massive tax cuts to the rich."]["Just ONE WEEK until it’s time to #GetCovered! Do you and your loved ones have health insurance? https://t.co/Vd0SRYg2U1"]["The #GOPBudget is just the first step in a plan that will hurt America’s hard-working families. https://t.co/u24ZJ3JRQA"]["And we're live!https://t.co/F4PJyzP9lV"]["LIVE at 12:30 pm ET: @RepJohnYarmuth &amp; @RepRichardNeal join me to discuss #GOPBudget &amp; #BillionairesFirst tax plan: https://t.co/NyVNQOXWFx"]["Remain in awe of firefighters battling the fires in CA. You remind us of what we love so much about our communities! #CaliforniaWildfires"]["With so many tax cuts going to rich, how does @HouseGOP plan to pay for them all? Cut #Medicare. Cut #Medicaid."]["Anyone who has looked at the numbers can see why Americans are rejecting this devastating tax plan. #NotOnePenny https://t.co/8xpWzXYOvp"]["If you have a family member on #Medicare or #Medicaid, you should be *very* concerned by the drastic cuts in the #GOPBudget."]["\"Fiscal hawks\" have become an endangered species. It's the only explanation for their silence on #GOPBudget adding trillions to the deficit."]["We can’t let Republicans get away with passing their #BillionairesFirst tax plan. #NotOnePenny https://t.co/33kK7pzdW3"]["No parent should have to choose between buying a prescription or putting food on the table. #ABetterDeal https://t.co/SKa93GI6Cd"]["American families deserve lower prescription drug prices. #ABetterDeal\n\nRead our plan: https://t.co/qeuehPy9P8 https://t.co/JLqNWXrpY3"]["-Stop the GOP Tax Plan\n-Protect the #ACA\n-Pass the #DREAMAct\n\nIt’s not about me – it’s about what policy will mean in people's lives. #AMJoy"]["President Trump has shown time &amp; again he has little respect for women’s rights in the workplace, in the home, &amp; in education. #AMJoy"]["Democrats will fight tooth and nail to protect the rights and dignity of every single American man, woman and child. https://t.co/kClKzRjCBw"]["Always a pleasure to chat with @joyannreid. Looking forward to tomorrow! #AMJoy https://t.co/vGPJzxh7gj"]["Dems just filed a brief supporting a federal lawsuit by 18 states &amp; DC to force @POTUS to resume #ACA CSR payments. https://t.co/yoOdPq8r88 https://t.co/64IvbIALe2"]["No one should be patting themselves on the back over #PuertoRico &amp; #USVI. People are still suffering and there’s still work to do. #TheView https://t.co/GMeH2qQqGA"]["Earlier this week, I sat down with @chelseahandler – and now you can watch our conversation on Netflix’s @chelseashow. Be sure to watch! https://t.co/KWgHjuevnE"][".@RepRichardNeal knows there’s a better way to move forward on tax reform – and it starts by the throwing out the GOP’s one-sided proposal. https://t.co/Da4ArHQe8C"]["This is not what helping families looks like, @realDonaldTrump. Not at all. #ProtectOurCare https://t.co/j67qShD9Ze"]["We have a responsibility to protect our borders. We do NOT have a responsibility to go after #DREAMers and their families. #TheView"][".@POTUS is claiming his decision to hike families' premiums is about blocking a “bailout” to insurance companies... https://t.co/lTa40gXI1K"]["If the #DREAMAct gets the vote it deserves, it will pass. #ProtectDREAMers https://t.co/qPKL0P3FsC"]["Thank you to all the women stepping up and saying \"#MeToo.\" Your courage is truly inspiring to us all."]["We're starting now! https://t.co/cwX9LuiJAE"]["I'll be speaking with @cbellantoni of the LA Times live at 10/7 pm PT. Tune in here: https://t.co/23GQYvUi4m"]["Our message to immigrants is simple: We stand with you. We fight with you. And we’re not backing down. #ProtectDREAMers https://t.co/lsBEuvbeLm"]["Protecting God’s creation is not the work of a single day but a constant effort that demands vigilance. #CWA45 https://t.co/YrqXAJ0NJK https://t.co/MxmC2Oj9bA"]["The #DREAMAct is central to any meaningful effort to protect immigrants' rights. Watch my remarks at @CHIRLA here: https://t.co/KLIhCqWVes"]["#ABetterDeal is built on input from Americans nationwide. Share your story: https://t.co/KJfVeXbSsM https://t.co/lAAk966PQS"]["Thank you to the doctors, nurses, &amp; staff who joined us for today's roundtable on #ACA &amp; their heroic response to the #LasVegas tragedy. https://t.co/i5UulFAdyF"]["Democrats aren’t just talking about a better future – we already have a plan to make it happen. #ABetterDeal https://t.co/IBWDO14umm"]["We will never forget Stacee Etcheber and all of the angels lost in Las Vegas. #LVHealingGarden #VegasStrong https://t.co/4mxkALcv5R"][".@realDonaldTrump, it’s time to accept your #MuslimBan is unconstitutional. Move on. https://t.co/RqgqNGM4j0"]["Congrats to @SenJohnMcCain on being awarded @ConstitutionCtr's #LibertyMedal! Thank you for your decades of service &amp; constant courage!"]["#ABetterDeal is powered by Americans like you. Please – share your story: https://t.co/rUTE2jpaTd"][".@POTUS makes empty promises to lower prescription costs. Democrats actually have a plan to do it. Read it here: https://t.co/6emRonL13p"]["While President Trump brags about his health care sabotage, hard-working families are suffering. #ProtectOurCare https://t.co/RXyGVWIPNw"]["#ABetterDeal means…\n-Universal high-speed internet\n-10 million new jobs\n-Expanding affordable child care\nhttps://t.co/IBWDO14umm"]["Democrats are fighting to give families #ABetterDeal. Read more here: https://t.co/E6NufZ2pVD"]["President Trump should take a look at his own billionaires-first tax plan before he starts attacking Democrats. https://t.co/EwIJUodFxF"]["People are hurting. We must continue to stand with Americans in #PuertoRico &amp; #USVI, as well as those suffering in #CaliforniaWildfires. https://t.co/P77qEjuKk4"]["From the #IranDeal to #ACA, President Trump is going rogue – and it’s not helping anyone. #ThisWeek https://t.co/pR52HQnWkh"]["If @realDonaldTrump really wanted to help people, why would he take them hostage and try to force his policies through? https://t.co/EslFJRGTYV"]["Democrats will not be cowed by @realDonaldTrump’s efforts to bully us into paying for his border wall. https://t.co/nlB8XBbhKa"]["The fight to #ProtectOurCare continues. It’s simply unconscionable that we have to fight @HouseGOP to fund children’s health insurance. https://t.co/wqLiG6vRJ2"][".@realDonaldTrump's war on the Middle Class has never been more clear than in his tax plan &amp; ongoing attacks on the #ACA. #ThisWeek"]["Had quite a few memorable moments this week. Take a look at them here: https://t.co/Ehh2shyF3X"]["Sitting down with @GStephanopoulos tomorrow for #ThisWeek at 9 am ET. Tune in!"]["Starting now on CNN! #AxeFiles https://t.co/HN4HkiFeq0"]["Here’s a highlight from walking @davidaxelrod around my alma mater, @trinitydc. You can watch the rest at 7 pm ET on @CNN! #AxeFiles https://t.co/36iteq0f09"]["Walking across @trinitydc campus earlier this week while filming for #AxeFiles. Be sure to watch this Saturday at 7 pm ET on @CNN! https://t.co/Gypdfm7IPX"]["Any renegotiation of #NAFTA must include efforts to raise wages in Mexico, or Americans will keep seeing their jobs head over the border."]["Had a wonderful conversation with @davidaxelrod earlier this week. Be sure to watch Saturday at 7 pm ET on @CNN! #AxeFiles https://t.co/ns8v59G9JA"][".@POTUS' decision to end #ACA cost-sharing payments means taxpayers will be forced to pay $200 billion for the privilege of higher premiums."][".@realDonaldTrump's threats against the #IranDeal are a grave mistake that threatens America's security &amp; credibility at a critical time."]["Tune in now for my reaction to President Trump’s ongoing effort to sabotage the #ACA: https://t.co/dtde4cQF9G"][".@POTUS’ decision to spike Americans’ health insurance premiums by 20% is an act of pure spite. Watch @ 2 pm ET: https://t.co/dtde4cQF9G"][".@realDonaldTrump’s efforts to undermine #IranDeal &amp; sabotage #ACA are inexcusable. Watch at 2 pm ET:  https://t.co/dtde4cQF9G"]["Matthew Shepard’s memory reminds us we must remain committed to fighting to #EraseHate across America. https://t.co/YPFfTyfcJ7"][".@SpeakerRyan, you talk about wanting a “fully functioning Congress.” So why do you keep barring Democrats from putting our ideas forward? https://t.co/3vjWpzDfwF"]["This is striking: 50% of households that claim State &amp; Local Tax deduction make under $100K – &amp; now @SpeakerRyan wants to throw it away."]["We are taking a stand against @SpeakerRyan &amp; @SenateMajLdr’s effort to hike taxes on families. Watch here: https://t.co/tXCB54iLO3"]["Keeping the US safe means the rest of the world must take us seriously. If @POTUS undermines the #IranDeal, that becomes more unlikely."]["It's truly sad to see @POTUS dismiss the suffering of Americans in #PuertoRico &amp; #USVI. We must give more help, not less!"][".@POTUS seems to think that saying \"Stop the World! I want to get off\" is a legitimate foreign policy. It is not. #IranDeal #ParisAgreement"]["We’re starting now. You can find the livestream for today’s press conference here: https://t.co/b9L07ECZAH"]["Tune in shortly as I discuss #CaliforniaWildfires, #PuertoRico, #USVI, &amp; efforts to undermine the #IranDeal: https://t.co/kF5yDrldj5"][".@POTUS, we don't abandon Americans in their time of need. PR &amp; USVI need MORE help, not less, from the federal govt https://t.co/fKpTKLbyZQ"]["Experts agree: the #IranDeal remains the best way to stop Iran from getting nuclear weapons. https://t.co/XxEwcN6L10"]["#FreedomForGirls is knowing your power, chasing your dream, and NEVER backing down. https://t.co/ZKg0LINIBP"][".@SpeakerRyan &amp; @SenateMajLdr should be ashamed of misleading the public on the impact of their tax “plan.” #NotOnePenny https://t.co/2D9c93mQan"]["The White House’s immigration proposals are terrible. Together, they would greatly damage to the character of our country. #ProtectDREAMers https://t.co/kpM5KTrndV"]["In awe of the courage of all who are coming out today as #LGBT. We will stand by you! #NationalComingOutDay https://t.co/bubhtQkeXt"]["Just ten minutes until Democrats speak out against @POTUS’s extremist immigration “proposals.” #ProtectDREAMers https://t.co/mS6i75q4pL"]["Is #FacebookDown for you? For far too many Americans, not having access to high-speed internet means it might as well always be. https://t.co/XWDxIwMbUb"]["Harvey #Weinstein's assaults on women &amp; efforts to silence his victims violate every standard of acceptable behavior https://t.co/o0E8ptdZGD"]["When #WomenSucceed – in classrooms, laboratories, and in the conference room – we all benefit. #WomenInSTEM https://t.co/ggQwz9wDAe"]["#CaliforniaWildfires disaster declaration is a positive step, yet more is necessary. Families need support to rebuild &amp; heal."]["Dismantling the #CleanPowerPlan is an assault on our sacred obligation to preserve God’s creation for the future. https://t.co/DLDh7AdQRP"][".@SpeakerRyan’s tax plan is great for billionaires – and terrible for hard-working families. #NotOnePenny https://t.co/Bo0ffVMIOT"]["Grateful for firefighters, prayerful for people of Napa &amp; Sonoma that fires will be put out soon #NapaFire."]["The Admin's proposal doesn't show real interest in compromise or protecting #Dreamers. My statement w/ @SenSchumer: https://t.co/1fiB5gO8Z5"]["Another week has come to an end. Take a look at some of the moments that will stay with us here: https://t.co/1yH5KxshLh"]["Deeply, deeply moving words from survivors &amp; those who've lost loved ones to gun violence. You really need to watch this. #EndGunViolence https://t.co/cehXP1SoZN"]["If @POTUS cared so deeply about the Constitution, he wouldn’t have just trampled on a woman’s right to health care. #HandsOffMyBC"][".@repjohnlewis knows our role in Congress is to lead the charge for change, not follow in its wake. I couldn’t agree more. #EndGunViolence https://t.co/PYvrm6krCJ"]["No woman should be subject to the whim of her employer to access the contraception that is her right #ProtectOurCare https://t.co/O9D5rAogHL"]["Millions of Americans in #PuertoRico and #USVI need our full and uncompromising support. Anything less is unacceptable."]["The devastation of Harvey, Irma, and Maria have laid bare the corrosive effect of @HouseGOP‘s refusal to act on jobs https://t.co/gRyeQafF1w"]["AG Sessions can try to ignore the truth, but even his deep prejudice cannot erase the rights of #trans Americans. https://t.co/vy1ulrlsnV"]["Our fellow Americans in #PuertoRico and the #VirginIslands need our support. We cannot fail them. #PelosiTownHall https://t.co/0lxlz6HgQQ"]["Let's be clear: there is a difference between the NRA &amp; gun owners. Many gun owners want common sense efforts to #EndGunViolence."]["Special consideration must be given to #DREAMers living in states &amp; communities impacted by Harvey, Irma, and Maria."]["What is happening right now in #PuertoRico and the #VirginIslands is a challenge to the conscience of America. We must do more. https://t.co/v7hKUbqZWb"]["Our budget should represent our values. The #GOPBudget does just the opposite."]["Republicans must allow a Select Committee on Gun Violence. They must allow us at least *look* for solutions. #EndGunViolence"]["Congress has a duty to protect Americans. We are failing in that mission. Republicans must let us take action. #EndGunViolence"]["And we're live! https://t.co/I8nSpbhTuu"]["Be sure to tune in at 10:45 am ET as I discuss #LasVegas, the #GOPBudget, and more. https://t.co/NL3CixFAbM"]["Republicans need to stop misleading Americans and tell the truth: their tax plan will raise taxes on middle class families. #NotOnePenny https://t.co/gHl2iCA5qG"]["Ran into @repjohnlewis and @RepSwalwell in the @CNN green room tonight after #PelosiTownHall. Nice surprise! https://t.co/DjhKweq0Oh"]["The @HouseGOP just can’t stop attacking Americans’ health care. #ProtectOurCare #PelosiTownHall https://t.co/zQoVG6oxCB"]["Democrats are urging our Republican colleagues to take a stand to #EndGunViolence. Is that too much to ask? #PelosiTownHall https://t.co/OXiJ7hAYsw"]["I’ve been very clear: where we can find common ground, we will work with the GOP. When we cannot, we will stand our ground. #PelosiTownHall"]["Expanding background checks are common sense. Americans know it. @SpeakerRyan, it’s time for a vote. #PelosiTownHall https://t.co/na9NfXZ6St"]["Bob &amp; Amber, from the bottom of my heart, thank you for having the strength to share your story tonight. #LoveVegas #PelosiTownHall"]["Getting ready to head out for start of #PelosiTownHall! Starting now at 9:15 pm ET. https://t.co/5oXilNX0M0"]["Under an hour until we get started. Lots to talk about! #PelosiTownHall"]["The families of victims of gun violence deserve more than empty words from Republicans in Congress. #EndGunViolence https://t.co/NxmEVMK6mm https://t.co/sMzef3SqNz"]["Just 7 more hours until the start of tonight’s #PelosiTownHall. Tune in at 9 pm ET on @CNN! https://t.co/HzpxYgjXYB"][".@realDonaldTrump, you promised you would not touch #Medicare. Americans need you to live up to that promise and reject the #GOPBudget."]["The #GOPBudget is showing the GOP’s true colors: cut taxes for the rich &amp; pass the bill to America’s hard-working families. #NotOnePenny"]["Be sure to watch tomorrow’s #PelosiTownHall on @CNN at 9 pm ET! https://t.co/IBV7NBGGrB"]["Tomorrow, my colleagues and I will honor those lost in #LasVegas &amp; call for a renewed effort to #EndGunViolence. https://t.co/0tbzJdbC6a"]["#HR36 is not only unconstitutional – it would leave women in dire medical situations with no meaningful options. #RightToChoose"]["How many have to die for the @HouseGOP to say #enough? This can’t wait. We can do something to end the drumbeat of gun tragedies."]["#DREAMers, make sure you mail your DACA renewal application today to make sure it’s received by the Oct 5 deadline. https://t.co/SVqSYcq7HQ https://t.co/bqwyNeBID4"]["Americans in #PuertoRico &amp; #USVI are w/o homes, food, water, power–and still heroically stepping up. They need help, not insults. https://t.co/JWEhctGXGc"]["50 years after he took the bench, there is still so much we can learn from Justice Marshall’s example. https://t.co/pExJ3HqEz9"][".@SpeakerRyan, it’s time for action. Congress must create a Select Committee on Gun Violence. https://t.co/yCpMOUKJKg"]["We will never waver in our love and support for the people of #LasVegas &amp; the families of the victims of this attack https://t.co/S4uey6GjGT https://t.co/kKdoZZ0mk7"]["Horrified and heartbroken by the awful tragedy in #LasVegas last night. Praying for those lost, wounded &amp; waiting for news from loved ones."]["This week was as busy as any. Take a moment to take a look at some of the moments that stood out. https://t.co/I5A9FxlMBI"]["When a hurricane hits, there are no Democrats or Republicans--only Americans, families struggling to survive. Shameful @POTUS can't see that"]["A budget should be a statement of values, but the purpose of this radical GOP budget is to hand tax breaks to billionaires."]["Well-deserved honor for one of the greatest in @SFGiants history! https://t.co/1oYJBGeRes"]["Our families – our children – know that the Affordable Care Act is working. Now, it’s time to make it even better. #ProtectOurCare https://t.co/XUnLVB2IBq"]["The deadline to renew #DACA for 140k recipients is October 5th. Information here → https://t.co/B9rrFSnTos #ProtectDREAMers"]["It is time to act. America cannot turn its back on #DREAMers. My op-ed with @SenSchumer: https://t.co/O0GgUAWfJk"]["Wishing you all the strength in the world, @OfficialJLD. https://t.co/lkIvMMOGg2"]["Trickle-down economics have always increased the deficit. And yet Republicans keep pushing it. #WashingtonIdeas"]["Just a few minutes until I sit down w/ @jonkarl at #washingtonideas. Be sure to watch at 2 pm ET! #WashingtonIdeas https://t.co/2aq3ikRjBM"]["Be sure to keep an eye on the news later today about #ABetterDeal -- Democrats will be laying out a plan for universal high-speed internet."]["What happened to the GOP's deficit hawks? Looking at the disastrous Ryan-McConnell tax plan, it seems they are nowhere to be found."]["The #DREAMAct enjoys overwhelming support among the American people. Republicans must allow it to pass."]["Tune in as I discuss Republicans’ disastrous tax plan, the #DREAMAct, and the fight to #ProtectOurCare! https://t.co/b9L07ECZAH"]["Proud to stand with @NydiaVelazquez in the effort to ensure #PuertoRico has access to all necessary resources."]["There’s no excuse for Congress’s failure to help #PuertoRico &amp; #USVI. Democrats are calling for immediate action! https://t.co/rz5XHuT6rM"]["You can’t put lipstick on a pig, but  @SpeakerRyan sure is trying to put some on his billionaires-first tax plan. #NotOnePenny https://t.co/HNhdHDgUXq"]["Great to have @RepCummings healthy &amp; back in the fight for needs and interests of American families! https://t.co/Iear0Enmrb"]["It’s official: yesterday’s press conference with the @LittleLobbyists was my favorite of the year. #ProtectOurCare https://t.co/9l7G1nCWUo"]["The GOP tax plan isn’t tax reform. It’s a ploy to give the rich massive tax cuts – &amp; make families foot the bill. https://t.co/4xRBraxsSH https://t.co/pt727fJTd0"]["Continuing my fight alongside the @MineWorkers to ensure that all miners get the pension benefits they earned during a lifetime of hard work https://t.co/gt8ME3lRIf"][".@StephenCurry30 &amp; @warriors – the offer still stands. #DubNation https://t.co/qfi2DEsKLk"]["Trump Admin must quickly give our fellow Americans in #PuertoRico additional DOD resources. ¡Estamos con ustedes! https://t.co/MZOp97hq4g https://t.co/8OEVf5JtQP"]["#WomenSucceed https://t.co/0wfD7yN43m"]["With Americans yet again beating back #Trumpcare, Republicans must abandon their anti-ACA obsession. https://t.co/1HtCuyu7wh"]["And we’re live! You’re not going to want to miss this! https://t.co/kYhv2swU9i"]["Excited to welcome special guests at 1:30 pm ET to talk re: #Trumpcare’s impacts on ppl w/ pre-existing conditions! https://t.co/SCEyXxPjag"]["Thanks @SenatorCollins for saving us from #Trumpcare again but more work to go to get us back on bipartisan track to update &amp; improve #ACA"][".@HouseDemocrats stand strong for the DREAM Act! #ProtectDREAMers https://t.co/6c3PxMiC3r"]["The DREAM Act is not simply a piece of legislation: it is a statement of *values.* #ProtectDREAMers"]["The hopes, dreams, &amp; aspirations of DREAMers could not be more American. They deserve a vote on the #DREAMAct!"]["Tune in now as @HouseDemocrats demand action on the #DREAMAct! https://t.co/eh6pTT23B7"]["Be sure to watch at 6 pm ET as Democrats demand a vote on the DREAM Act. #ProtectDREAMers https://t.co/eh6pTT23B7"]["If #Trumpcare passes, and you or someone you love gets sick, you better hope you have a few hundred thousand dollars lying around. https://t.co/VYjehOl4cB"]["#Trumpcare would be a disaster for millions of women and families who would lose access to Medicaid. RT if you want to #ProtectOurCare!"]["Under ACA, if you have a pre-existing condition, insurers can’t discriminate against you. #Trumpcare will throw those protections away. #AMR"]["Just a few moments until I sit down with @mitchellreports to discuss #GrahamCassidy #Trumpcare. Don’t miss! #AMR"]["I’ll be joining @mitchellreports on #AMR at 12:30 pm ET  to talk about the most recent #Trumpcare developments. https://t.co/wTjNwybUUT"]["Our fellow Americans in #PuertoRico &amp; #USVI deserve to know their government is there for them. We must act now! https://t.co/gsdedISfp7"]["#DREAMers are Americans. We must pass the DREAM Act to #ProtectDREAMers immediately! https://t.co/IQ0Vmd8kAq"]["Republicans must stop making a dangerous bill even worse &amp; join Democrats to improve health care. #Trumpcare. https://t.co/VXPV8B6ugo"]["Upgrading America’s infrastructure is crucial to creating good-paying jobs now and for years to come. #ABetterDeal #MTP https://t.co/xeiwEL2QIg"]["Didn’t catch #MTP this morning? You can watch the full interview here ⬇ https://t.co/euIhWrzBB7"]["Infrastructure has never been a partisan issue. Republicans should join us to create jobs and raise wages. #MTP"]["Congress has a moral duty to pass the #DREAMAct ASAP. DREAMers make America more American! #MTP"]["The President of the United States should focus on bringing Americans together – not deepening our divisions. #MTP"]["I hope you will take a moment to tune in as I join @chucktodd on #MTP to discuss the #Trumpcare monstrosity. https://t.co/TriV4tCSmX"]["Looking forward to sitting down this Sunday with @chucktodd for #MeetThePress to talk abt GOP's monstrous #Trumpcare proposal. https://t.co/L57hfLFW1b"]["More cynical efforts by the Trump Admin to make it harder to enroll in quality, affordable health care. Stop the sabotage. #ProtectOurCare https://t.co/hadixP96yl"]["@BetsyDeVosED To survivors, across the country, know that I stand with you – that my fellow Democrats and I are fighting for you. 5/"]["@BetsyDeVosED I cannot state strongly enough how fundamentally outrageous this is for survivors, students and schools – how immoral it is. 3/"]["And yet today, the Trump Admin and @BetsyDeVosED rolled back Title IX progress &amp; protections for survivors of sexual assault. 2/"]["We should all be able to agree that all students have the right to be safe from fear &amp; harassment on campus. #StopBetsy 1/"][".@SenJohnMcCain’s courage has always been clear. Thankful to him &amp; Americans who raised their voices for their strength &amp; determination."]["We finally have a chance to put a stake in the heart of the #Trumpcare monstrosity. We can’t let up. The next days are crucial in this fight"]["In this week's Democratic Address, @RepJohnYarmuth asks why Republicans continue to ignore #Trumpcare's devastating impacts. https://t.co/OStR9djAQr"]["#GrahamCassidy version of #Trumpcare is the most disastrous yet – and everyone knows it. https://t.co/gfLGdZ6S3D"]["There’s a reason @HouseGOP &amp; @SenateGOP can’t argue for #Trumpcare without misleading Americans: all the facts are against them."]["Republicans want you to believe their alternative facts on #Trumpcare. Don’t let them get away with it. https://t.co/P8s4JGGzMC"]["Thank you for speaking out, @lpackard. Wishing you strength. #ProtectOurCare https://t.co/KULsM7SlH9"]["Experts couldn’t be clearer: #GrahamCassidy version of #Trumpcare will leave Americans out in the cold. #ProtectOurCare https://t.co/PzY2Cs6tag"]["At every stage, it was the voices of Americans that held back #Trumpcare.\n\nThat will be true in the days to come too https://t.co/jyR67bpinX"]["You should read this thread. Don’t fall for GOP’s misleading claims. https://t.co/SJIGjnavp9"]["Congress should be giving America #ABetterDeal -- not denying people with pre-existing conditions crucial health coverage."]["The so-called Graham-Cassidy bill is the latest &amp; worst version of #Trumpcare yet. Fundamentally misguided."]["And we are live! https://t.co/Qy5zkh5Bfy"][".@SenateGOP’s newest #Trumpcare plan = assault on Americans’ health care\n\nListen in at 12 noon ET for my thoughts: https://t.co/i323FE98fr"]["Thank you, @jimmykimmel &amp; family, for sharing your ongoing story with us. Stories like yours are why we will defeat #Trumpcare. https://t.co/eppsgTBvyi"]["My heart is with all in Puerto Rico contending with #HurricaneMaria. Be safe. Your fellow Americans are with you."]["Be sure to tune in at 12 noon ET as I discuss Republicans’ effort to force through #Trumpcare. https://t.co/i323FE98fr"]["Paul &amp; I are praying for the loved ones of those lost &amp; the injured today in the Mexico City earthquake. #PrayForMexico"]["This is simply unconscionable. #Trumpcare https://t.co/aFjMxYZH3U"]["The #Trumpcare monstrosity is on the march again. We must defeat it. https://t.co/FymGykTda1"]["Congratulations on your 10th anniversary @Morning_Joe! Thank you, Mika &amp; Joe for keeping the American people well informed. #MJ10"]["Graham-Cassidy is the GOP's latest name for the cruelty and costs of the dangerous #Trumpcare bill. Democrats are all hands on deck. https://t.co/7SBQzlsxEr"]["It was a busy week here in Washington. Take a moment to look at what I've been up to! https://t.co/Ru0cOYss6J"]["La belleza de nuestro país se encuentra en la diversidad. #HispanicHeritageMonth https://t.co/H7rBSDNT26"]["This month, we recommit ourselves to the fight against efforts erase the contributions of Americans of #HispanicHeritage https://t.co/uUhRtzE08o"]["Congress has a moral duty to pass the DREAM Act. #ProtectDREAMers https://t.co/8OGQkJ5sRO"]["Your strength &amp; sacrifice will always be remembered. #POWMIA https://t.co/XPde03Op3l"]["Americans stand with our British friends in the wake of today’s terrorist attack. Thinking of all those who are suffering."]["No family should have to choose between caring for a young child and stable employment. #ChildCare4All #ABetterDeal https://t.co/xbkYLb9JbB"]["Proud to stand with @BobbyScott and @PattyMurray to propose #ChildCare4All as a part of #ABetterDeal! https://t.co/QbiHGDlWXF"]["Economic growth comes from investing in education, research, and infrastructure. It does not come from tax cuts for the rich. #NotOnePenny"]["I have no doubt that if the #DREAMAct were to be given the vote it deserves, it would pass. #ProtectDREAMers"]["America's faith leaders are clear: the effort to #ProtectDREAMers is a moral duty."]["And we're live! https://t.co/cuoCakZ5gG"]["Tune in at 10:45 am ET as I discuss our plans to #ProtectDREAMers. https://t.co/APTfNmJTh0"]["It’s always a pleasure to spend time catching up with @SenatorReid. https://t.co/kE5bjBhsBa"]["DREAMers are Americans in every way that matters. We need to pass the DREAM Act now! #ProtectDREAMers https://t.co/F3ejtvXDHL"]["We must never back down from ensuring that every woman in every place can live free from abuse. #VAWA https://t.co/5fSP1ugWcF"]["Met with @calstate Chancellor White and officers of @csustudents this morning to talk #ProtectDREAMers and #PellGrants! https://t.co/0zrQSEvocP"]["Every woman has a right to a life w/o abuse – and every survivor deserves the support to move forward. Thankful for 23 years of #VAWA."]["Today, House Ds intro-ed Medicare fr 50-64. Tmrw, @SenSanders intros single payer. We welcome all plans to the table to cover all Americans. https://t.co/bf1TbxgecR"]["Today, we mourn the loss of Edie Windsor. With pride &amp; bravery, she refused to accept injustice. Your legacy of LOVE moved us ALL forward."]["Today, we celebrate the life of former TX Rep. Jack Brooks. A beloved colleague, a giant of the House and for many of us a cherished friend. https://t.co/ahmQ14UFQp"]["We owe DREAMers for their patriotism &amp; courage to come forward. This is a fight about who we are as a country. We must pass the #DREAMAct. https://t.co/uEqJqzddf0"]["Democrats are committed to building up American communities. The Republicans may want to take notes. #ABetterDeal https://t.co/RYTgSl5YlL"]["16 years after #September11, we hold fast to this message: hate and terror will never defeat the American spirit. https://t.co/u98b8kpUAc https://t.co/WaMV8KkzWo"]["Deeply saddened to hear of the passing of @sffdpio’s Battalion Chief Terry Smerdel. Wishing for strength to his family &amp; loved ones."]["We will #NeverForget."]["Happy birthday to the Great State of California! https://t.co/i1qq2KkBUa"][".@RepLujanGrisham hits the nail on the head -- #DREAMers make America more American. We must pass the DREAM Act &amp; #ProtectDREAMers. https://t.co/3sPQVYYfBX"]["Trump Admin’s cynical disruption of health care outreach is driving up premiums. It. Must. End. #ProtectOurCare https://t.co/VyJbZprT9D"]["Passing the DREAM Act will ensure we do not miss out on all these young people will achieve. #ProtectDREAMers https://t.co/N3QGiecjMl https://t.co/FaDOhm0yQQ"]["Honored to be included in such an inspiring group of women. #SheIsTheFirst https://t.co/2kjodf7Imk https://t.co/bkMuXQrvwp"][".@BetsyDeVosED's remarks are another salvo in Admin's attacks on women &amp; survivors by destroying robust Title IX enforcement. #StopBetsy"]["Thank you for this commitment, Mr. President. Real protections will only come from your signing the DREAM Act ASAP. https://t.co/dCXSFrWfoy"]["Be sure to tune in at 10:45 am ET as I discuss Democrats' effort to pass the DREAM Act! https://t.co/WuzecX8HLf"]["Paul &amp; I are praying for all in the path of #HurricaneIrma2017. May you and your loved ones be safe in the days ahead."]["How can @HouseGOP look DREAMers in the face and say they don’t deserve to be here? #ProtectDREAMers https://t.co/gRAB96tZb7 https://t.co/Hd5Pp5v3bk"]["FACT: 76% of Americans support citizenship or permanent status for #DREAMers. It’s time to bring #DREAMAct to the floor! #ProtectDREAMers"]["Proud to stand with @HouseDemocrats &amp; @SenateDems to demand a vote on the DREAM Act. RT if you are ready to #ProtectDREAMers!"]["Trump is 1st @POTUS in 30 yrs who has been anti-immigration -- who rejects that immigration is the lifeblood of our nation. #ProtectDREAMers"]["And we are live – tune in as I speak live from the Capitol with @SenSchumer &amp; others. https://t.co/u3Ev54auzB"][".@HouseDemocrats &amp; @SenateDems are standing together to fight to #ProtectDREAMers. Tune in here at 10 am ET: https://t.co/x7kCdcsMJ0"]["Trump just gave a masterclass in cowardice²: he cancelled #DACA, and then trotted out Sessions because he was too scared to do it himself."][".@realDonaldTrump’s cruel decision to attack America’s young people is nothing short of shameful. https://t.co/u9jD79ZrKR https://t.co/WAORpLO1IM"]["Trump’s cowardice is on full display today. His cruelty must not stand! #ProtectDREAMers"][".@realDonaldTrump's attack on #DREAMers is pure political cowardice. Congress *must* #ProtectDREAMers! https://t.co/ZwL1LeypdA https://t.co/bptIMp4PA9"]["The 40-hour work week. OSHA. Overtime. Family leave. We owe labor for all of it.\n \nThank you. #LaborDay https://t.co/GQzmsLFCsV https://t.co/baAQrz3KsF"][".@SpeakerRyan, I hope we can agree that deporting patriotic young Americans would be disastrous. #DefendDACA https://t.co/JK7XfIDwqZ"]["Proud to see California leading the charge to #DefendDACA in the business community. https://t.co/gnZE8LYO9T"]["Word is getting out: @denverpost says #ABetterDeal presents a clear vision for America’s future! https://t.co/RYTgSl5YlL"]["White House &amp; @HouseGOP have no jobs plan &amp; have failed working families. The impact is clear. #JobsReport https://t.co/MKlMjq7Dru"]["DREAMers are part of the fabric that makes our country stronger. Their life, liberty &amp; pursuit of happiness is what's at stake. #DefendDACA https://t.co/53l65dmBOO"]["We should be shoring up #ACA marketplaces, @realDonaldTrump, not creating chaos that will hurt families. https://t.co/dnhPbk0ASK"]["I’ve said it before, and I will say it again: America’s #DREAMers are not negotiable. #DefendDACA https://t.co/Jl8tedE3nE"]["Americans deserve real tax reform that helps families. @realDonaldTrump's trickle-down scheme doesn’t come close. https://t.co/LOnzhNxEdT"]["Massive tax cuts to the rich →✨✨conservative magic✨✨→ \"trickle down\" to the middle class\n\nDon’t fall for Trump’s flawed logic. #NotOnePenny"]["And we’re live. Tune in here: https://t.co/FGlCviVKHz https://t.co/CpIZZLygiM"]["#ABetterDeal means better jobs &amp; better wages for American families. Tune in as I take questions at 11 am PT!"]["Thank you to all who have fought – &amp; continue to fight – for a better, more equal America all these years after the #MarchOnWashington! https://t.co/tgJPQM9IXe"]["Congress must pass a timely relief bill, making critical resources available thru emergency spending. #HoustonStrong https://t.co/vTYx4SkySk"]["Incredibly thankful to all working diligently to save lives of those impacted by Harvey. #HoustonStrong https://t.co/ZyjUUQsVzS"]["Praying for the safety of all in Texas. #houstonflooding https://t.co/t1vowE7Qxm"]["This #WomensEqualityDay, we recommit ourselves to the fights for gender equality &amp; voting rights nationwide. https://t.co/hWRpPn2RKq https://t.co/iJjGnAyeJc"][".@POTUS pardon of fellow birther Arpaio makes mockery of rule of law, &amp; says communities of color can be targeted &amp; abused w/ total impunity"][".@POTUS should have more respect for trans Americans who had the bravery to serve in uniform. #ProtectTransTroops https://t.co/U7r3gVkGuF https://t.co/btM4y4FdMq"]["It’s time to give America the tools to unlock a new wave of innovation, opportunity &amp; good-paying jobs. #ABetterDeal https://t.co/it0u0CI5RE"]["Thinking of everyone in the path of #Harvey2017. Please -- stay safe.\n \nResources:\n@fema\n@femaregion6\nhttps://t.co/7Bvxq9LkuF"]["Here’s to 101 years of @NatlParkService! #HappyBirthday https://t.co/B2h06nD2Kb"]["Our public lands &amp; national monuments are priceless. @SecretaryZinke's effort to shrink them is shamefully short-sighted. #KeepItPublic"]["Republicans need to stop the chaos and sort themselves out in a hurry. The full faith &amp; credit of the U.S. is on the line. #GOPdefault"]["This is NOT how you keep America safe. Period. #ProtectTransTroops https://t.co/ESu55wL5M4"]["#ABetterDeal means children learning &amp; parents earning. RT to spread the word! https://t.co/33kor8zBcF"][".@NatlParkService’s decision to permit a white supremacist rally at SF’s Crissy Field could not be more misguided. https://t.co/sx58QzFPJu"][".@POTUS’ attempt to bully taxpayers into funding his immoral &amp; expensive border wall is completely unacceptable. https://t.co/NW2pHwjidX https://t.co/AZCLKwfcjN"]["It’s all well &amp; good to *say* Trump’s defense of white supremacy was repulsive – it all means nothing if you refuse to act. #CensureTrump"]["When we talk abt #WomensEqualityDay, we are talking about a full-fledged commitment to ensuring women are empowered to improve their lives."]["#WomensEqualityDay is Saturday. American women deserve another wave of progress. #ABetterDeal https://t.co/rp8kYXwnqe"]["It is reprehensible to treat children as bargaining chips. America’s DREAMers are not negotiable. #DefendDACA https://t.co/wErMfpWBlh"][".@SpeakerRyan says House Republicans “did [their] job.”\n \nIt seems he thinks their job is to kick 22 million off health care. #RyanTownHall"]["President Trump’s speech on Afghanistan policy was low on details but raises serious questions about the future. https://t.co/I3pz1h5LtW"]["With students heading back to school nationwide, we must ensure good jobs are waiting for them when they graduate. #ABetterDeal https://t.co/qEyYIQg9rO"]["Not able to travel to see the complete #SolarEclipse2017 in person? Thanks to @NASA, that’s not a problem. https://t.co/dYE1ohhI6s"]["Watching the #SolarEclipse2017 can damage your eyes. Here’s how to watch if you weren’t able to get glasses. https://t.co/B0CEAkpjZM"]["Deeply saddened by news of the USS John S. McCain collision. Paul &amp; I are praying for our brave sailors &amp; their loved ones."]["#RIPDickGregory, dear family friend whom we loved for being a patriotic leader who led with wisdom and humor. Condolences to his loved ones. https://t.co/NEGNVBtRsG"]["27 years later, the Ryan White CARE Act stands as a firm commitment to Americans living with HIV/AIDS: we will not leave you behind. https://t.co/6BJhYVcJqv"]["It’s been 100 years since we took our first major step as a nation towards recognizing every woman’s right to vote. #WomenSucceed https://t.co/nkLsMkrcWi"]["Steve Bannon's exit does not erase @realDonaldTrump’s long record of lifting up racist viewpoints &amp; advancing repulsive policies. #BannonOut"]["Congress must censure @realDonaldTrump for his repulsive defense of white supremacy in the wake of #Charlottesville."]["Dems proud #ForeverGIBill signed into law to expand education opps &amp; good-paying jobs to millions more vets. https://t.co/JlmaDierUf"]["Terrorists will not break our spirit. May the people of #Barcelona know that the U.S. stands with them. https://t.co/h3r7yyUlLD"]["My thoughts are with all suffering after the terror attack in #Barcelona. Praying for the victims, their loved ones and the people of Spain."][".@SpeakerRyan, it is time to immediately remove Confederate statues from the halls of Congress. https://t.co/twJ4MFOfgB https://t.co/7Yx6p4JgCK"][".@realDonaldTrump has made it clear he doesn't know the difference between American patriotism &amp; white nationalism. https://t.co/6xhQhAFxW2"]["Congratulations, @Malala! We all can’t wait to see what the future holds for you and your fight for the world’s children. https://t.co/4u3FUofgpq"]["The re-sentencing of activists Joshua Wong, Nathan Law &amp; Alex Chow should shock the conscience of the world. https://t.co/TQXDdTtsbB"]["Thinking of #HeatherHeyer's loved ones. I hope it's a comfort that millions respect her courage, mourn their loss &amp; are praying for them. https://t.co/wTrB3z2wU7"]["Given #Charlottesviille, I urge @NatlParkService to reconsider allowing a white supremacist rally at Crissy Field https://t.co/xZRNbQN1il"][".@realDonaldTrump we heard you loud &amp; clear.  Ignoring the abhorrent evil of white supremacism is an attack on our American values. https://t.co/UNmyAbmTsz"][".@USCBO’s new report once again shows why the American people deserve a bipartisan conversation to improve the #ACA. https://t.co/hGJn1CKZIK https://t.co/FyP1Uy4Eph"]["For 5 years, #DACA has strengthened communities &amp; boosted our economy. #DREAMers are educators, engineers, nurses &amp; leaders in their field. https://t.co/y9orUfZCju"]["If @realDonaldTrump is sincere about rejecting alt-right white supremacists sympathizers, he should start at the White House. #FireBannon https://t.co/m2bfps3Q5g"]["For 82 years, Social Security has served America's seniors, children, disabled &amp; veterans. We'll continue fighting to protect it. #SocSec82 https://t.co/qmykRRDAwJ"]["As we mourn the victims of this act of terror, we must vow to defeat bigotry, racism &amp; hatred. #Charlottesville https://t.co/SkOP1lYAyq https://t.co/QujSXD7YNl"]["Repeat after me, @realDonaldTrump: white supremacy is an affront to American values. #Charlottesville"]["Our nation is defined by the march of progress. Our strength lies in our diversity. We must reject hate. #Charlottesville"][".@RepRichmond knows America deserves #ABetterDeal. RT if you do too! https://t.co/aXE0i4SrRT"]["Yet another reminder of the dizzying conflicts of interest in the Trump era. #WakeUpGOP https://t.co/FKY3Nl2NqQ"]["Republicans can talk all they want. The fact is they consistently refuse to put #PeopleOverPolitics."][".@realDonaldTrump spent months creating uncertainty for insurers. Now, working families are paying the price. https://t.co/0AoaCBxyXD"]["The last thing we need right now is saber-rattling &amp; impulsivity. The only acceptable path forward is with a smart, diplomatic solution."]["There is nothing more American than the hope &amp; courage that immigrant communities display every day. #IStandWithImmigrants! https://t.co/0z3dDelPrN"]["Sad comment from @realDonaldTrump. All the more reason to focus on getting an agreement on DACA as soon as possible. https://t.co/aSKXvZQVuN"]["We know how to create growth. We know how to create jobs. We know how to build strong futures for our children. Instead, Republicans forced through their #GOPTaxScam."]["Last year, we took Martin Luther King, Jr.’s lessons to heart in the fight to #ProtectOurCare. And this weekend, House Democrats will hold teach-ins across the country to engage citizens on the damaging impacts of the #GOPTaxScam. https://t.co/XHjebFy0LQ"]["Republicans continue to show their dedication to selling our children’s future to corporations. #GOPTaxScam"]["I’m holding my first weekly press conference of 2018. Be sure to tune in! https://t.co/wCBDTcZBuf"]["Paul &amp; I are praying for all impacted by the mudslides in California. We are so deeply thankful to all the first responders working to save lives, and will be following up with @RepCarbajal to see how things are on the ground."]["Happy Birthday to Hall of Famer, philanthropist, and inspiration to generations of #SFGiants fans Willie Mac! #WillieMac80 https://t.co/aA0EiR2nlW"]["Thanks to the brave women of the #MeToo movement, we are at a watershed moment in the fight against sexual harassment. Know that we are with you every step of the way. #TimesUp https://t.co/FTT20fJxQX"]["Congratulations to California’s own @SenFeinstein on officially earning her own @realDonaldTrump nickname. Clearly doing something right! #FollowTheFacts"]["Visiting with #DREAMers from @FWD_us in the Capitol today with @RepLujanGrisham, @BennieGThompson, &amp; @RepCuellar (who had all just gotten back from the White House). #ProtectDREAMers #NoWall https://t.co/FdwBp9Q1Mj"]["I have no doubt that:\n1) If Democrats were in the majority, we would be working to #FollowTheFacts on Russia\n2) And the @HouseGOP would be calling for a thorough investigation as well"]["Nothing less than the safety and security of our country is on the line. Republicans must abandon their failure to #FollowTheFacts over the last year."]["And we're live! https://t.co/gs7fsFbU8y"]["Be sure to tune in at 2:30 pm ET as top @HouseDemocrats join me to talk about the effort to #FollowTheFacts on Russia. https://t.co/iMVT3xtNLp"]["Painful to think today marks 7 years since that terrible morning in Tucson. Thoughts remain with all who loved those we lost, &amp; I continue to be inspired by the strength of @GabbyGiffords &amp; @ShuttleCDRKelly."][".@realDonaldTrump’s decision to terminate temporary protected status for Salvadorans will tear apart families &amp; communities across the country. #SaveTPS https://t.co/wKLlerunuX"]["All of these and more would do a far better job of improving the everyday lives of American families than your ineffective &amp; immoral wall. No thanks. #NoWall"]["Help families gain access to high-speed internet"]["Increase @StateDept funding"]["Make a meaningful step towards saving pensions for some of the millions of Americans whose retirement savings are at risk"]["Give a helping hand to communities devastated by #wildfires"]["Help #PuertoRico &amp; #USVI in ongoing effort to rebuild in the wake of massive hurricanes"]["Provide the VA with urgently needed resources to keep America’s promise to #veterans"]["Treatment for people addicted to #opioids"]["Job training for workers"]["THREAD: @realDonaldTrump, that border wall funding you are asking for (again) could do so much more good in other places…. #NoWall"]["Trump Admin announcement that they want to drastically expand offshore drilling just 3 miles off East &amp; West coasts makes this article from last week even more worrying. #ProtectOurCoast https://t.co/KbH97gnw4T"]["Attorney General Sessions, your unjust war against Americans who legally use #marijuana is shameful &amp; insults the democratic processes that played out in states across the country."][".@NTSB prelim report shows deadly train crash in WA last month could’ve been prevented by positive train control tech. Railroads need to implement ASAP, no later than December 2018 deadline, and @USDOTFRA needs to enforce."][".@realDonaldTrump’s “Election Integrity” commission was built to encourage and enable voter suppression. Every American who cares about the right to vote should breathe a sigh of relief now that it no longer exists."]["We had a positive and productive meeting with @SpeakerRyan, @SenateMajLdr and Admin officials, &amp; all parties have agreed to continue discussing a path forward to quickly resolve all of the issues ahead of us. @SenSchumer https://t.co/BpL7qCYwkC"]["#Iran must pay attention to voices of the courageous protesters speaking out for their rights and well-being. That is the only way forward."]["“Americans have a lot to be thankful for this holiday season, and you – our brave service members – are at the top of our list.“ — @RepTimWalz https://t.co/bhucxORt7A"]["It is my honor to welcome Tibetan Filmmaker &amp; former Chinese political prisoner Dhondup Wangchen to our San Francisco community. My thoughts are with him as he is once again united with his wife &amp; children in freedom after so many years."]["Merry Christmas! This time of year always allows us a truly special time to reflect on the miraculous blessings of family, community and Country. I wish you all the very best during this Holiday Season. https://t.co/wWdNqLT5AB"]["The #GOPTaxScam signed by @realDonaldTrump today breaks every promise he has made to the American middle class. Instead of focusing on forgotten Americans, it bleeds working families dry to pad the pockets of corporations and the wealthiest 1%. https://t.co/bIlFXYK32k https://t.co/Md2S5Zo4x7"][".@SpeakerRyan must stop @HouseGOP efforts to hinder or end the investigation of Russia’s meddling in our elections. Read my letter to him here: https://t.co/zRMFKFx69h"]["Fernando is exactly the kind of young person America should be embracing. And he’s not alone. Across the nation, #DREAMers are contributing to &amp; strengthening our communities. America cannot afford to have Republicans continue to push them away."]["Now a third year medical student at @UCSF, Fernando is contributing to research to fight many diseases and disorders."]["Fernando was brought to the US when he was 9 yrs old. He was an AP scholar, received the IB Diploma, an Achievement Award in Foreign Language for French, and graduated cum laude from @SantaClaraUniv with a double major in Biology and French. He is undocumented."]["The fight to #ProtectDREAMers will have impacts in communities all across America. Right in my district, a young man named Fernando is just one of many whose future hangs in the balance."]["The stories of DREAMers like Tomas underscore just how dire this crisis is. We need to pass the #DREAMActNow! https://t.co/IXTtXep01i"]["Our country has been blessed with a long tradition of presidents who understand the importance of immigration. @realDonaldTrump’s vilification of these newcomers represents a complete reversal of that past."]["Republicans have spent all of 2017 throwing gift-wrapped handouts to their donors and special interests. Now, they’re doing everything they can to avoid actually addressing the needs of every day Americans. #DoYourJob"]["Republicans claim the #GOPTaxScam closes loopholes in our tax code. Far from it — it’s a Loophole Lollapalooza."]["Be sure to tune in as I discuss the ongoing fight to fund the federal government &amp; the fallout of the #GOPTaxScam. https://t.co/QIVOdgQYOX"]["Just a few minutes until I speak to reporters live from the Capitol about #GOPTaxScam &amp; the government funding fight. https://t.co/aPYqc2zJQB"]["There is no excuse for Republicans’ ongoing failure to act on the Congress’s responsibility to #ProtectDREAMers. https://t.co/5aOFajob3U"]["Still relevant. Probably even more so now that it’s happened *two times.* https://t.co/BxxaVwITyi"]["Every credible analysis of the #GOPTaxScam says it explodes the deficit. And the @HouseGOP knows it."]["-86 million middle class families get a tax hike\n-83% of benefits go to the top 1 percent\n-13 million Americans will be added to the rolls of the uninsured\n\nThat’s the real story of the #GOPTaxScam."]["Democrats are speaking out after Republicans passed their con-job #GOPTaxScam &amp; raised taxes on 86 million middle class families. Watch here: https://t.co/Nl26p3OHzi"][".@SpeakerRyan should check his facts – everyone from former GOP Economist Bruce Bartlett to @realDonaldTrump’s alma mater (@Wharton) knows the #GOPTaxScam will send the deficit soaring. https://t.co/x1XGJXbfuH"][".@AdyBarkan’s story reveals the sheer brutality of the #GOPTaxScam. https://t.co/l2JyYDLnGh"]["Republicans are about to take a victory lap to celebrate pillaging the future of America’s children. #GOPTaxScam"]["The American people will not forget the Republicans’ misrepresentations about the #GOPTaxScam."]["No hearing. No expert testimony. No listening to the American people. That has been the story of the #GOPTaxScam."]["Every member of the @SenateGOP should watch Laura’s story about how the #TaxCutsandJobsAct (really a #GOPTaxScam) would impact her son and her family. https://t.co/sNO7cr4q0D"]["Unsurprisingly, the #GOPTaxScam is so badly written the @HouseGOP will have to take *another* vote to pass it tomorrow morning. The seams of this Frankenstein’s monster are already showing."]["Shamefully, Republicans were cheering against the children as they rob from their future and ransack the middle class to reward the rich #GOPTaxScam"]["There are few things more disturbing than hearing the swell of cheers from the @HouseGOP as they raise taxes on 86 million middle class families. #GOPTaxScam"]["Incredibly moving argument against the #GOPTaxScam today from @AdyBarkan. #NotOnePenny https://t.co/nk9bJ7CbpC"]["Democrats are on the floor right now fighting to stop the #GOPTaxScam, which would hike taxes on 86 million middle class families. WATCH LIVE: https://t.co/BagwCxSb8X"]["We stand at a decisive moment for the future of America. The #GOPTaxScam takes the first step to obliterate Medicaid &amp; Medicare, while giving 83% of its benefits to the wealthiest 1 percent."]["Yesterday, I had the honor of welcoming @AdyBarkan to my office to share his story and those of so many more. Today, Ady joins us to fight back against the shameful #GOPTaxScam. Thank you, Ady! https://t.co/1qYrNUXGqP"]["I’m glad to welcome the @LittleLobbyists and other advocates to the Capitol to lend their hand in the fight against… https://t.co/i8xLKrHotX"]["Updated link: https://t.co/X4WoNAobDS https://t.co/7uYHatjbkX"]["Tune in at 11:30 am ET as @LittleLobbyists and other advocates join us to highlight the negative impacts of the #GOPTaxScam on families. https://t.co/w2voI7N4TF"]["Our thoughts and prayers are with the families of those killed and the victims still in critical condition following today’s Amtrak derailment. While no words can console those who lost loved ones, may it provide them some measure of comfort that so many grieve with them."]["By the end, the #GOPTaxScam will…\n-Raise taxes on 86 million middle class households\n-Hand 83% of the benefits to the wealthiest 1% of Americans\n\nThis will go down as one of the most scandalous, obscene acts of plutocracy ever."]["The #CorkerKickback is just another example of how the #GOPTaxScam is a Frankenstein’s monster of giveaways to special interests – and a reminder of why @SpeakerRyan &amp; @SenateMajLdr are trying so hard to pass this bill before the public learns even more. https://t.co/I7hXWMbc15"]["Now this is shocking: the #GOPTaxScam punishes hardworking middle class couples for getting married. https://t.co/bZkDnGSnMa"]["Time for another look into my week in Washington &amp; San Francisco. https://t.co/ivHQIFMAH4"]["DANGER! Trump Admin is going further down a dangerous and un-American path of word and thought control. @POTUS has no respect for and has banned words including: \n\n“vulnerable”\n\n“diversity”\n\n“transgender”\n\n“evidence-based”\n\n“science-based”\n\n#CDC7words\n\nhttps://t.co/cUw9IVQw9t"]["The #GOPTaxScam has grown more outrageous and cowardly with each version. The American people see it for exactly the #BillionairesFirst con job it is. https://t.co/DRmZw0tdcD"]["Trump Admin's continued attack on @usedgov's core mission to ensure civil rights for all students and unraveling IDEA is disappointing and destructive. #StandwithStudents https://t.co/xCpY8gwIFS"]["Today is the last day of Open Enrollment. Make sure you and your loved ones #GetCovered before time runs out! https://t.co/GlOYHMZ3h9"][".@RepThompson knows that fighting for America’s middle class families, seniors, &amp; veterans means we have to fight the #GOPTaxScam. https://t.co/hggJWKnRzW"]["The path before us is clear: Congress must act quickly to #SaveTheInternet by passing @USRepMikeDoyle’s resolution to overturn this disastrous decision. https://t.co/caWgKrXhKL"][".@AjitPaiFCC has eagerly led the effort to saddle consumers with higher costs and less choice, throttle competition and punish entrepreneurs and small businesses. #NetNeutrality"]["The power of the Internet has always been rooted in its role as a level playing field where the best ideas, not the deepest pockets, succeed. The @FCC’s decision to repeal #NetNeutrality is nothing short of radical."]["Five years after #SandyHook, it’s still difficult to come to terms with the tragedy of that day. But this much is clear – even now, the only option we have is to #HonorWithAction. Anything less – anything – is unacceptable. https://t.co/pRSoOK053f"]["The @FCC just voted to throw away #NetNeutrality, which is central to saving families money, creating good-paying jobs, and empowering small businesses. https://t.co/ReB2ROxWF0"]["#NetNeutrality is what gives you the power to use to apps, games, and websites you like, no matter what your internet company thinks. The threat of losing that – and seeing costs go up for families – is why we must #SaveTheInternet from the @FCC. https://t.co/p0v6Eg5NKm"]["Forget CRomnibus — @HouseGOP’s proposed funding package is a “puntibus” that leaves urgent, must-address issues for another day. #DoYourJob"]["#NetNeutrality is central to building a good economy and ensuring we are creating high-quality, good-paying jobs for the 21st Century. @FCC should delay its vote to destroy it."]["The idea that the @FCC’s process for throwing out #NetNeutrality could be in any way fraudulent is deeply concerning. We must protect the open internet!"]["At this point, it’s clear tax cuts for the rich are part of the Republicans’ DNA, no matter who it hurts. #GOPTaxScam #BillionairesFirst"]["With every version, the #GOPTaxScam becomes an even more brazen, damaging, and immoral con job. And all signs are the American people aren’t falling for it."]["Republicans should think twice before voting for the #GOPTaxScam. Trickle down didn’t work before. It won’t work now. And Americans won’t forget who raised their taxes and left them holding the bill. https://t.co/AD3anREdnh"]["From Silicon Valley to the Quad Cities, #NetNeutrality makes sure small business owners have a shot in today’s economy. The @FCC must delay tomorrow’s vote to repeal. https://t.co/G6ppEnCvj5"]["There’s a special message on my website from #DREAMers. Take a look! #DREAMActNow https://t.co/2af53i5tSP"]["Today’s conference meeting on the #GOPTaxScam is a sham! Watch as Democrats fight back: https://t.co/Lt284kFBrD"]["Just through those red curtains and down the hall, Republicans will hold a sham hearing their #GOPTaxScam. The reality is they’ve already made up their minds and this will just be a show to trick Americans into thinking otherwise. https://t.co/6JfOLhgM2J"]["In the House, when someone is elected, we give them their seat — we don’t hold it back so we can have a vote go the way we want it to. @SenateMajLdr, don’t disenfranchise Alabama voters by holding a vote on #GOPTaxScam before Doug Jones joins the Senate. #ALSEN"]["American middle class families deserve far better than the immoral and destructive #GOPTaxScam. https://t.co/IC2BrhDmop"]["House &amp; Senate Democrats are fighting to protect the pensions that Americans have worked so hard for. https://t.co/to7y48Gq7e"]["I look forward to seeing Senator-elect Jones take his seat in the US Senate! #ALSEN"]["Incredibly thankful to @will_c_fischer of @VoteVets for his passionate opposition to the #GOPTaxScam’s attack on our veterans. You are going to want to watch this. https://t.co/pyzGhblFHf"]["Had the pleasure of welcoming @SenDuckworth back to the House side of Capitol Hill to talk about how #GOPTaxScam impacts her fellow veterans. *Everyone* should watch. https://t.co/OIPsvb9gTP"]["Wishing the very best to all celebrating the start of the Festival of Lights tonight. #HappyHanukkah! https://t.co/IMtIxF4Qsl"]["It’s been two years since the world came together to sign the historic #ParisAgreement. Now, @realDonaldTrump is committed to abandoning American leadership on climate change. The American people have other thoughts. #StillIn https://t.co/tLpbApJM5n https://t.co/wrhU75sA9q"]["The 3 R’s of the #GOPTaxScam: \nRobs from the future\nRips off the Middle Class\nRewards the wealthy"][".@realDonaldTrump’s attack on @SenGillibrand was shameful &amp; disgusting. I would say that, as with many things the President says, it is likely a projection of his own behavior."]["Proud to stand with @SenDuckworth, @RepDWStweets, @JuliaBrownley26 and veterans’ advocates in opposition to the #GOPTaxScam’s wrong-minded attack on our veterans. https://t.co/7C7GWQ7ReX"]["The #GOPTaxScam promises to be a nightmare for America’s veterans. Want to hear how? Tune in at 2:30 pm ET as I speak live from the Capitol."]["Thank you @jimmykimmel for your ongoing fight to make sure all children have access to health care. And to everyone else, remember to #GetCovered by Friday at https://t.co/GlOYHMZ3h9 https://t.co/boCDoqudgP"]["Heartbroken to hear of the passing of @mayoredlee. He was a true champion for the people &amp; a dear friend to the many lucky enough to know him. My deepest love &amp; prayers are with his wife Anita &amp; daughters Brianna &amp; Tania. Read my full statement here: https://t.co/gGHaQfaXEZ https://t.co/uFBPPS9OK5"]["Good to see that Americans are (rightly) seeing through the #GOPTaxScam. Ten of millions of middle class families will see a tax hike under this sham. https://t.co/PlJjTZ3BPl"]["Deeply thankful for the heroism &amp; excellence of first responders, not to mention the strength of the New York community, following today’s terrorist attack in Manhattan."]["Personal highlight from this week? Meeting with Paddington Bear! https://t.co/i9feOBScfi"]["November’s #JobsReport reveals that even with full control of the House, Senate and White House, Republicans have still failed to deliver on their promise of higher wages for working families. https://t.co/vnEhG7yhSz"]["The priorities we are seeking solutions on share broad bipartisan support. It’s time for action – Americans deserve it. https://t.co/Ee1wmNThoj"]["These pictures are truly astounding. #PearlHarbor https://t.co/vBuBG2B0II"]["As we head into this afternoon’s meeting with @realDonaldTrump, we are committed to finding solutions to the urgent priorities the American ppl need us to act on. https://t.co/Hx060doqNu"]["Republicans have made this no secret: the #GOPTaxScam — and the attacks on Medicare &amp; Medicaid it will trigger — will pillage and plunder the American Middle Class."]["The radical Concealed Carry Reciprocity bill passed by the House yesterday is a gift to the NRA — and the first gun bill passed since #LasVegas. Appalling. #StopCCR"]["Tune in as I discuss the ongoing fight to stop the #GOPTaxScam. https://t.co/53zRVTqYEQ"]["The effort to stop the #GOPTaxScam is going strong. Be sure to watch at 10:45 am ET as I speak live from the Capitol."]["Inviting violent criminals to carry concealed weapons doesn’t save lives\nInviting domestic abusers to carry concealed weapons doesn’t save lives\nInviting convicted stalkers to carry concealed weapons doesn’t save lives\n \nYet the @HouseGOP just voted to do exactly that #StopCCR"]["@SpeakerRyan .@SpeakerRyan, you’ve already admitted you will use #GOPTaxScam as an excuse to effectively end Medicare &amp; Medicaid as we know it — and for millions of families, that will feel awfully close to Armageddon. https://t.co/2DLGcjk6Ob"]["I couldn’t agree more with this decision. #BelieveWomen https://t.co/N7uBr4K1UI"]["Inspired by the committed families stepping up to fight for their futures today and every day. #NotOnePenny #GOPTaxScam https://t.co/wNPmd3Yg9h"]["So many Americans count on the medical expense deduction to help them make ends meet. But House Republicans voted to leave them at the mercy of crushing medical bills. #NotOnePenny #BillionairesFirst"]["I was going to make a comment about how terrible the #GOPTaxScam is for middle class families — but first, can we all just appreciate how cute all these little elves are?! https://t.co/3ZC0BXi5jx"]["It’s hard enough raising a family. The #GOPTaxScam will lead to more parents losing sleep, worrying about how they … https://t.co/ktsNWVI9XU"]["With thousands of lives, homes, and acres under threat, my staff and I are working with @JuliaBrownley26 to track the #ThomasFire in #Ventura. Stay safe and watch out for your loved ones."]["Whether you are fighting to protect domestic violence survivors or are looking to protect local public safety decisions, the answer is clear: we must #StopCCR. #HR38 https://t.co/IciKKgYfCn"]["In #MasterpieceCakeshop case, the #SupremeCourt must once again affirm that no law sanctions discrimination and that all Americans have the right to fair and equal treatment. Read my full statement here: https://t.co/ueYtPv3FNd"]["Those who seek to reverse the remarkable progress we’ve made continue to seek justification for their flagrant, hateful discrimination."]["The true story of America is a story that celebrates the constant march of progress toward full and equal rights for all people. Yet the rights of #LGBT ppl remain under attack across the country."]["I want every single California Republican to understand this. Your ideology doesn’t come first. Your party doesn’t come first. The PEOPLE come first. If you fail to recognize that, you don’t belong here. https://t.co/xjbyOTI2MC"]["This is why we need to be as loud as possible. #GOPTaxScam  https://t.co/VIippSRn47"]["For over 100 years, we have recognized that America is not America w/o its great #PublicLands. @realDonaldTrump’s decision to remove protections from major portions of Utah’s #BearsEars &amp; #GrandStaircaseEscalante presents a real threat to that tradition. https://t.co/xab15cnu7q"]["The #GOPTaxScam once again proves the @HouseGOP hasn’t learned from history. The LAST thing we should be doing is rewarding outsourcers with a tax break – but that’s exactly what they aim to do."]["The #GOPTaxScam is one of the worst bills to be brought to the floor in the history of the United States. We will fight with everything we have to stop this bill from becoming the law of the land."]["If you want to understand the importance of the fight to stop the #GOPTaxScam, look to the fight to stop #Trumpcare. That’s how crucial it is that we stop this thing."]["Republicans are already trying to use the #GOPTaxScam to justify taking an axe to our children’s health care. #ProtectOurCare source: @voxdotcom https://t.co/nYKefFW2kO"]["@SenSchumer @realDonaldTrump There is a bipartisan path forward on all of these items."]["@SenSchumer @realDonaldTrump We have to provide funding for community health centers and CHIP, as well as relief for the millions of Americans still reeling from natural disasters. And we must also come together on a bipartisan deal to pass the DREAM Act along with tough border security measures."]["@SenSchumer @realDonaldTrump We need to reach a budget agreement that equally boosts funds for our military and key priorities here at home including the opioid crisis, pension plans and rural infrastructure."]["@SenSchumer We’re glad the White House has reached out and asked for a second meeting.  We hope @realDonaldTrump will go into this meeting with an open mind, rather than deciding that an agreement can’t be reached beforehand."]["As negotiations with our Republican counterparts continue, we are hopeful the President will be open to an agreement to address the urgent needs of the American people and keep government open. Read my full statement w/ @SenSchumer here: https://t.co/figVYCgRsu"][".@repsandylevin is a principled patriot, champion of the people of Michigan and deeply esteemed leader in the Congress. My colleagues and I wish him the very best as he leaves Congress and begins to write the next chapter of his journey."]["In passing the #GOPTaxScam, @SenateGOP has sealed its betrayal of the American middle class. https://t.co/BzuMZJwGx8 https://t.co/hkx5mV3qpl"][".@SenateMajLdr, if you are so intent on forcing middle class families to foot the bill so your donors can have a tax break, at least have the decency to find a printer. #GOPTaxScam https://t.co/qFkfaru6ml"]["Proud to stand with @RepSpeier in fighting for the #MeToo Congress Act. RT to spread the word! https://t.co/EoaeB0a4jn"]["Incredibly proud of the role the #LGBT community in San Francisco (and across the nation) played in fighting to put the spotlight on the scourge of HIV/AIDS and the suffering of those living with it. This fight would not exist without your determination. #WorldAIDSDay"]["This #WorldAIDSDay, we are thankful for the memories of all the friends and family we have lost to this terrible disease, and for all those who continue the fight against it today. https://t.co/l1JOGjHQ4E"]["“GOP plan scraps deductions for the middle class to bankroll tax cuts for rich people.” That says all you need to know. #GOPTaxScam https://t.co/QVSOEbfBuI"]["Now more than ever, we need a fully independent commission to #ProtectOurDemocracy from the types of meddling that took place in 2016. Republicans must stop shielding POTUS from those who wish to #FollowTheFacts."]["Congress has a duty to uphold justice and ensure Robert Mueller’s investigation is able to #FollowTheFacts without White House interference."]["The questions we need answered now:\n1) What does @realDonaldTrump know about Russian meddling?\n2) Why does he still refuse to take action against Russia?"]["We should all be alarmed by @realDonaldTrump's consistent attempts to obstruct effort to #FollowTheFacts on Russia."]["The guilty plea of President Trump’s former National Security Advisor Flynn to lying to the FBI about his communications with Russian authorities marks a dark moment in our nation’s history. https://t.co/akxUDGur2y https://t.co/p0IlVIpWDv"]["Each and every American should be disgusted by the callous way the #GOPTaxScam approaches the needs of seniors. https://t.co/HKYMzUQAsz"]["-Students\n-Seniors\n-Teachers\n-Single parents\nThey and more will have a harder time under the #GOPTaxScam. How can Rs seriously claim otherwise?"]["Unless they’ve have been asleep for the last 30 years, there’s no excuse for Republicans continuing to push the disproven and failed “trickle down economics” in the #GOPTaxScam."]["This is not how you help middle class families. #GOPTaxScam https://t.co/aLv2sKuikr"]["New analysis (once again) confirms the #GOPTaxScam will sell out middle class families to give the wealthy a tax cut. https://t.co/GExsi8NucN"]["Did you know that the #GOPTaxScam would give a TAX BREAK to companies that OUTSOURCE American jobs to other countries?"]["#GOPTaxScam = a blatant attack on Americans’ health care https://t.co/GuSXYRndmF"]["According to experts, the #GOPTaxScam would slash home values by 10%."]["The truth of the #GOPTaxScam is that Republicans marched past a large number of real ways to help empower our economy and decided to just give their donors a tax cut instead."]["FACT: 82 million middle class families would get a tax hike under the #GOPTaxScam. And they’re not happy about it. https://t.co/OawcR9nOJo"]["REMINDER: The 👏 #GOPTaxScam 👏 is 👏 a 👏 gift 👏 to 👏 the 👏 wealthy 👏 not 👏 middle 👏 class 👏 families. https://t.co/CjMZ1rDj3A"]["You need to read this. #mustread #ThursdayThoughts https://t.co/6fV8G6Oa2V"]["From the #DREAMAct to rebuilding communities impacted by hurricanes and wildfires, the priorities Democrats are fighting for would pass if only @SpeakerRyan would let them come to the floor."]["There can be no denying that the #GOPTaxScam will devastate middle class families across America. Tune in here: https://t.co/VqQQoSVdwg"]["RT if you worry about how #GOPTaxScam would affect your family. https://t.co/7qrC3UTLzv"]["cc: @SpeakerRyan, @SenateMajLdr, &amp; the entire @SenateGOP https://t.co/QH3xpnjTCJ"][".@realDonaldTrump, now will you admit the #GOPTaxScam won’t create jobs or boost wages? https://t.co/z5hZBd5TVw"]["Want to see through @realDonaldTrump’s claims about the #GOPTaxScam today in Missouri? These numbers tell a striking story. #mopolitics https://t.co/k2tuOowms6"]["Zero tolerance means consequences – for everyone.  No matter your contribution to our country, you do not get a pass to harass or discriminate."]["Republicans will do anything to obscure the devastating impact their #GOPTaxScam will have on middle class families nationwide. https://t.co/JEeCfiJvcH"]["Incredibly thankful for the determination of Leandra English, the rightful Acting Director of @CFPB. #DefendCFPB https://t.co/giUKsOCL2p"]["Don’t fall for Republicans’ claims about the #GOPTaxScam. RT to spread the word! https://t.co/mb4XDg8v0i"][".@realDonaldTrump now knows that his verbal abuse will no longer be tolerated. His empty chair photo opp showed he’s more interested in stunts than in addressing the needs of the American people. Poor Ryan and McConnell relegated to props. Sad!"]["Democrats are working for a bipartisan solution to keep government open. @realDonaldTrump on the other hand… https://t.co/mJgRcr7Dx7"]["@SenateMajLdr @SpeakerRyan @SenSchumer We look forward to continuing to work in good faith, as we have been for the last month, with our Republican colleagues in Congress to do just that."]["@SenateMajLdr @SpeakerRyan @SenSchumer If the President, who already said earlier this year that ‘our country needs a good shutdown,’ isn’t interested in addressing the difficult year end agenda, we’ll work with those Republicans who are, as we did in April."]["@SenateMajLdr @SpeakerRyan @SenSchumer We don’t have any time to waste in addressing the issues that confront us, so we’re going to continue to negotiate with Republican leaders who may be interested in reaching a bipartisan agreement."]["Rather than going to the White House for a show meeting that won’t result in an agreement, we’ve asked @SenateMajLdr &amp; @SpeakerRyan to meet this afternoon. Read my full statement w/ @SenSchumer here: https://t.co/v17WhoEJFU"]["Republicans have fought from the start to destroy the @CFPB’s efforts to protect consumers from bad actors on Wall Street. #DefendCFPB\n\nRead our amicus brief in rejecting the sham installation of Mick Mulvaney here: https://t.co/ePpk199mqa"]["This afternoon, I spoke with Melanie Sloan who worked for Congressman Conyers on the Judiciary Committee in the mid-1990s.  I believe what Ms. Sloan has told me. Read my full statement: https://t.co/OewsWUl6ZX"]["A worthwhile read for all who worry about the #GOPTaxScam’s impact on families. https://t.co/wxWJuzfUAW"]["Zero tolerance means consequences. I have asked for an ethics investigation, and as that investigation continues, @RepJohnConyers has agreed to step aside as Ranking Member. No matter how great an individual’s legacy, it is not a license for harassment. https://t.co/H5ikWy1iqT"]["Sitting down w/ @chucktodd tomorrow on @MeetThePress to talk about the Republicans’ #GOPTaxScam, the December Congressional agenda and more. Check your local listings. https://t.co/48QmrzmccD"]["Congress must do more to address sexual harassment on Capitol Hill. We need a bipartisan effort to put an end to the days of secret settlements paid for by taxpayer dollars. #WeMustDoMore https://t.co/NGZNPQPLTE"]["Our hearts and prayers go out to the Egyptian people in this terrible time. We are horrified by these terrorists’ assault on innocent people who were practicing their faith in peace. https://t.co/7FjL6PytgI"]["Thanksgiving is a time to appreciate our families, loved ones, and all our blessings. From my family to yours, we wish you a #HappyThanksgiving! https://t.co/jKOldn3FW1"]["We must protect the freedom of the internet from the latest @FCC's move to dismantle net neutrality– an attack on America’s entrepreneurship, innovation, &amp; competition of the internet."]["The Administration’s decision to terminate temporary protected status for 59,000 Haitian nationals will only deepen suffering in Haiti. Congress must act in the next 18 months to protect them. https://t.co/1TelzHJqeZ"]["BREAKING: 82 million middle class households face a TAX HIKE under the Senate's obscene #GOPTaxScam. We must defeat Republicans’ monstrous assault on the middle class. https://t.co/4njh2pZ1Sz"]["Today and every day, I stand with our transgender friends &amp; remember those who have lost their lives fighting for being true to themselves. Trans rights are human rights. #TDOR https://t.co/02fkJkP3Hz"]["It sure was a busy week at the Capitol. Take a look at some behind the scenes photos of some things I worked on this past week: https://t.co/1GBCd7gQ5R"][".@RepDelBene is calling out Republicans for doling out permanent tax giveaways to the people who need them least – corporations. #GOPTaxScam https://t.co/FZzxE0zjMX"]["Looking for a quick reminder of why the #GOPTaxScam is so bad for middle class families? Look no further: https://t.co/6KhHi7NLqg"]["#ABetterDeal on Pensions means: No. Cuts. https://t.co/AFpBD5dbkL"]["Americans deserve the truth about the #GOPTaxScam. Tune in as I talk about that and more. https://t.co/ceoQsWtvRc"]["I can’t say this enough: 36 million middle class families would get a tax hike under @SpeakerRyan’s #GOPTaxScam."][".@SenSchumer &amp; I are unveiling Democrats’ proposal to protect Americans’ pensions right now. Watch here: https://t.co/f0ngipIAsC"]["FACT: The #GOPTaxScam does away with the Work Opportunity Tax Credits – an important tool in connecting Americans with good jobs."][".@HouseDemocrats &amp; @SenateDems will be unveiling our newest #ABetterDeal proposal at 10:45 am ET be sure to tune in! https://t.co/f0ngipIAsC"]["“Nearly every claim Republicans are using to market their tax plan is at best a distortion, at worst a deliberate falsehood.” #GOPTaxScam #BillionairesFirst https://t.co/HzrZCsrm14"]["The Senate Finance Committee just rejected @SpeakerRyan’s #GOPTaxScam in a 26-0 vote. And he’s *still* asking @HouseGOP to walk the plank. https://t.co/Lq8foFYSfR"]["A special dose of #WednesdayWisdom for the @HouseGOP: your job is to serve your constituents, not special interests. #NotOnePenny"]["Under Director Cordray’s steady leadership, @CFPB has returned nearly $12 billion to 29 million wronged Americans. We will work to ensure his successor will live up his example as a champion for hard-working people. https://t.co/AKGN0gicT5"]["Democrats are standing up for women &amp; families who suffer under the #GOPTaxScam. https://t.co/NC66tSy5zz"]["Nearly 9 million families claim the medical expense deduction nationwide, worth nearly $10,000 on average. #GOPTaxScam would permanently eliminate that benefit.\n\nBut please, @SpeakerRyan, tell us how the #GOPTaxScam will help the Middle Class. 🤨"]["Republicans’ addiction to repealing the #ACA and raising Americans’ health costs makes their terrible #GOPTaxScam downright deadly. https://t.co/OaoXE2Kf8r"]["So let’s get this straight… the GOP wants the #GOPTaxScam to kick millions off health insurance (by repealing key part of #ACA) AND repeal the tax deduction for medical expenses? Have they no heart?"]["REMINDER: “Trickle-down economics” has no basis in reality. #GOPTaxScam https://t.co/jER4hIZIx6"]["Truly thankful to all who came out to help us make the case against the heartless #GOPTaxScam. cc: @MomsRising https://t.co/rSKktziMWI"]["Always amazed by the heart &amp; care that teachers bring to the classroom every day! #aew2017\n\nHow have teachers affected your life?"]["Remember: 38 million families will see their taxes go up under #GOPTaxScam. @HouseGOP Members are being asked to walk the plank. https://t.co/PlknWFcLKU"]["@repmarkpocan Wishing you the very best, Mark!"][".@AlexAzar, I hope you will join Democrats to create real bipartisan action to lower health costs. But we will hold you accountable if you try to put your Big Pharma friends ahead of the needs of the American people. I promise. https://t.co/neBCUBtyAi"]["With all due respect, Mr. President, do you understand what you are saying? Your #GOPTaxScam raises taxes on 38 million middle class families. And now, you want to raise premiums on millions of families to throw even more tax cuts to the rich?\n\nNo thanks. 👎 👎 👎 https://t.co/TGUfhMrYqC"]["Another busy week in Washington. Another chance to share some of the highlights. Take a look here: https://t.co/gDu7gOMsd8"]["On #VeteransDay and every day, we recognize &amp; honor all who wore the uniform to defend our nation and continue to serve in our nation’s armed forces. https://t.co/h72c9gPvI2"]["Honored to see so many friends yesterday at @vetshelpingvets gala. A truly meaningful reminder that we have a sacred duty to all who served when they come home. #VeteransDay https://t.co/sLi0bcva9B"]["Many thanks to all who made today’s event at San Francisco Fire Dept. Station 4 a success! https://t.co/FTVHxe8boI"]["Veterans &amp; servicemembers deserve more than our thanks and gratitude. As a nation, we must always #BeThere, today and everyday. https://t.co/bPPfKquYO9"]["The #GOPTaxScam is a gift to big business – letting them keep the State &amp; Local Tax deduction that is gutted for America’s middle class."]["All 14 CA Republicans voted for a #GOPTaxScam that wouldn’t allow those who lost property in the #CaliforniaWildfires to deduct those losses."]["And we're live! https://t.co/KrICGlTDhn https://t.co/xwlwh8zBfF"]["Tune in at 11 am PT as @RepBarbaraLee joins me to speak out against the #GOPTaxScam. https://t.co/gxMMDkrq1i"]["The @HouseGOP is trying to take the American people for fools. We’re not going to stand for it. #GOPTaxScam https://t.co/HAFWLSfILB"]["The dam is breaking on dishonest claim that the #GOPTaxScam will help the middle class. The facts show the *exact* opposite."]["The American Middle Class is hearing the truth about the #GOPTaxScam, and they are far from impressed. #BillionairesFirst"]["I’m speaking live from the Capitol. #GOPTaxScam https://t.co/DeDgxcuFux"][".@realDonaldTrump’s Chief Economic Advisor accidentally told the truth about the #GOPTaxScam. #BillionairesFirst https://t.co/cLqeerY7nR https://t.co/xSXYZpA8u8"]["🚨🚨38 million middle class households🚨🚨 will see a tax hike under the #GOPTaxScam according to @TaxPolicyCenter. Read my statement here: https://t.co/P8IH4xAzSe https://t.co/w10Kcwdqgd"]["Republicans say the drastic corporate tax cuts in their #GOPTaxScam will create jobs. It’s time they put their money where their mouth is. https://t.co/Hg8uolL3Iq"]["Democrats have a plan to make @HouseGOP put their money where their mouth is on #GOPTaxScam.  https://t.co/Hg8uolL3Iq"]["Students are the future of our nation &amp; foundation of our strength. Why do Rs want to make it harder for them to pay off loans? #GOPTaxScam https://t.co/ipRcizROaL"]["Education is the most important investment we can make in our future. And yet, the #GOPTaxScam leaves many students out in the cold."][".@GWSMHS student Max Ruben is here today calling on Congress to stand with students &amp; stop #GOPTaxScam. Thanks Max! https://t.co/NNIgQm48zJ"]["We all know someone living w/ student loans. Join in now as we hear how #GOPTaxScam would affect them: https://t.co/dqvbCxdvUD"]["The #GOPTaxScam would make a bad situation even worse for many living with student loans.\n\nWatch @ 1 pm ET: https://t.co/dqvbCxdvUD"]["Amazing to think that today marks 101 years since Jeanette Rankin became the first woman elected to the House of Representatives! https://t.co/E0ZAStOJyz"]["The Trump Admin’s decision to end #TPS for ppl from Nicaragua = a cowardly assault on families across America https://t.co/SPAdqG1fEv"]["We should be helping young people build bright futures. And yet the GOP tax plan erases student loan interest deduction. #BillionairesFirst"]["This is a must read. #EndGunViolence https://t.co/K0CSeOvRpn"]["Friends don’t let friends get away with not having health insurance. #GetCovered https://t.co/GlOYHMZ3h9"]["Great to talk with @davidcicilline &amp; @JimLangevin today during @CCRINews tour about stopping GOP tax plan &amp; giving families #ABetterDeal! https://t.co/GdevKXke7S"]["More than 270,000 Americans have parents receiving TPS. Tearing families apart is never acceptable. #SaveTPS https://t.co/TeiRAR1wAr"]["No matter how you look at it, the reality is that the #BillionairesFirst tax plan will explode the debt. #CNNSOTU https://t.co/PAczaOJLe6"]["As we mourn the lives that were cruelly cut short today, we must resolve to drive violence from all our communities. https://t.co/IOr1u2AlXX"]["We have to #FollowTheFacts to protect our democracy. You would think the President would appreciate that. #CNNSOTU https://t.co/xMA0bWvSqm"]["FACT: @SpeakerRyan &amp; @SenateMajLdr’s tax plan incentivizes companies who send American jobs overseas. #CNNSOTU"]["Any serious attempt to rewrite the tax code must be bipartisan. #CNNSOTU"]["This is a moment of truth for America: will we go deeply into debt in order to slash taxes for the rich? #CNNSOTU"]["Take a look at a few behind-the-scenes moments from my week: https://t.co/LKIsepDuSe"]["Sitting down w/ @jaketapper tomorrow on #CNNSOTU to talk about the GOP tax plan &amp; #ABetterDeal. Be sure to watch at 9 am ET! https://t.co/pnEYSR1i8X"][".@rosadelauro is calling the @HouseGOP out for rigging the game against the middle class. #BillionairesFirst https://t.co/bwer4lnLNp"]["Tune in as we hear the stories of middle class Americans who will suffer under the #BillionairesFirst tax plan: https://t.co/ifn8uSacCf"]["Watch at 11 am ET as we hear stories of middle class Americans who will be negatively impacted by the GOP tax plan: https://t.co/ifn8uSacCf"]["A GOP tax bill that explodes the deficit by $1.5 trillion means dumping $4600 in debt on every man, woman &amp; child in America."]["The GOP secretly wrote the #BillionairesFirst tax plan in hopes that no one would catch its painful impact on middle class families."]["If you have student loans — or may soon have them — the #BillionairesFirst tax plan will leave you behind."]["The #BillionairesFirst tax plan is nothing more than a shell game which will hurt millions of middle class families. https://t.co/xKv3RMIJdA"]["And we're live! https://t.co/YqR4TeRjdl"]["We will speak live at 2:30 pm ET on how GOP tax plan puts #BillionairesFirst at the expense of middle class families https://t.co/OvMn991dL7"]["Tune in live as I discuss Speaker Ryan’s disastrous #BillionairesFirst tax plan live from the Capitol! https://t.co/8V2yXB5fri"]["We are all praying for our fellow Americans in Puerto Rico &amp; the U.S. Virgin Islands. #USVIStrong #PuertoRicoSeLevanta https://t.co/oM3YUa26ml"]["Tune in as @HouseDemocrats show support for our fellow Americans in #PuertoRico &amp; #USVI: https://t.co/oHoO3A5vWe"]["Just 30 minutes until @HouseDemocrats once again speak out in support of our fellow Americans in #PuertoRico &amp; #USVI https://t.co/oHoO3A5vWe"]["Americans are have already started to line up against @SpeakerRyan’s tax plan… #NotOnePenny https://t.co/U2vzpEJSSA"]["Republicans are feverishly working to hide the damage their #BillionairesFirst tax plan would inflict on Americans. https://t.co/E66UFfCvaL"]["Whether it's their activism, military service, or cultural heritage, the contributions of America’s Tribal Nations are to be treasured #NAHM https://t.co/nWhgN4SVZJ"]["Dems will come together at 10 am ET Thursday &amp; stand in solidarity w/ our fellow Americans in #PuertoRico &amp; #USVI. https://t.co/oHoO3A5vWe"][".@SenSchumer and I just rolled out the newest proposal in Democrats’ #ABetterDeal agenda. Read about it here: https://t.co/N5GXDEeszN"]["This is ridiculous. #LetScientistsSpeak #ClimateChange #CaliforniaWildfires https://t.co/tSRonJ4hWI"]["TPS recipients have been contributing to local economies nationwide for years. Ending it would cost US dearly. #SaveTPS"]["Workers have fought hard to make their voices heard. We must protect their right to negotiate for #ABetterDeal: https://t.co/tKiR0Gq0ZI"][".@HouseDemocrats &amp; @SenateDems will present our plan to let workers negotiate for #ABetterDeal at 10:30 am ET: https://t.co/tKiR0Gq0ZI"]["Went on a mini (one-stop) pub crawl yesterday with @JKCorden. Will be on tonight’s #latelateshow at 12:37 am ET! https://t.co/JVlxnGkRwv"]["We join in mourning the dead, praying for the wounded, thanking first responders, &amp; sending our love to all of NYC. https://t.co/UnNs9dgNMt https://t.co/nI1huNnNIL"]["Closely following the developments out of Manhattan. Praying for the injured &amp; those lost. My heart is with you. #NYC"]["Republicans are gearing up to make the tax code a dream for the rich – &amp; a nightmare for working families. https://t.co/D9j91DLSQt"]["Happy #Halloween! Wishing all the little ones the very best on their candy hunt tonight!"]["President Trump can’t hide from the facts – and neither should we. #FollowTheFacts #WakeUpGOP https://t.co/N1Ob9l8WNr"]["#IndictmentMonday &amp; guilty plea show a clear link btw Trump campaign officials &amp; Russians seeking to influence our election. #FollowTheFacts"]["Democrats have a plan to create 10 million new jobs for American families. Read it here. #ABetterDeal https://t.co/o2XLkyfFDu"][".@SpeakerRyan is fighting to pass massive changes into law before Americans are aware of how his plan hurts their families. #NotOnePenny https://t.co/qaPh2UOryG"]["The indictments of Paul Manafort &amp; Rick Gates underscore need for an outside indpt commission to #FollowTheFacts. https://t.co/FNsocZ0JFB"]["Time to take another look behind  the scenes at my week in Washington. https://t.co/4RauugI1Yt"]["Being updated on #CaliforniaWildfires response w/ other Reps at @SantaRosaJC. Thank you to first responders &amp; local officials! https://t.co/HV4KJ3yRHi"]["Read all about @HouseDemocrats &amp; @SenateDems’ plan to give Americans #ABetterDeal on prescription drugs: https://t.co/0XR7tXWUa5"]["So cute! https://t.co/yiw78nxEeZ"]["You can’t hand 80% of a bill’s tax cuts to the rich and then say its primary design is to help working families, @SpeakerRyan. #NotOnePenny https://t.co/fjO1Bm7u2G"]["How can @HouseGOP say #BillionairesFirst tax plan helps middle class families when it will slash home values by 10%? https://t.co/Y8L9EzW7zf"]["Words are not enough. The Admin must send up a viable funding request for this life-saving mission to succeed. https://t.co/dqsjZAGK4X https://t.co/Szwz9ZYIG5"]["Republicans are looting the health, financial security and the future of Middle Class families with #GOPBudget &amp; tax plan."]["Republicans are carrying out a massive con on the American people with their #GOPBudget &amp; #BillionairesFirst tax plan."]["Be sure to tune in at 10:45 am ET as I speak live about the devastating #GOPBudget &amp; #BillionairesFirst tax plan: https://t.co/M283pk2mWU"]["A woman’s access to contraception shouldn’t be up to her bosses and it shouldn’t be up to @POTUS. Tune in here: https://t.co/Qts6BVi5ca"]["Our budget should be a statement of our priorities, not a grab bag of gifts to wealthiest Americans. #GOPBudget"]["Reagan. Bush 41. Bush 43. They all tried \"Trickle-Down Economics.\" And not once did it help working families. #NotOnePenny"]["Cutting our investments in education is – with stiff competition – one of the worst ideas the @HouseGOP has to offer."]["#GOPBudget borrows from our children's future to give massive tax cuts to the rich."]["Just ONE WEEK until it’s time to #GetCovered! Do you and your loved ones have health insurance? https://t.co/Vd0SRYg2U1"]["The #GOPBudget is just the first step in a plan that will hurt America’s hard-working families. https://t.co/u24ZJ3JRQA"]["And we're live!https://t.co/F4PJyzP9lV"]["LIVE at 12:30 pm ET: @RepJohnYarmuth &amp; @RepRichardNeal join me to discuss #GOPBudget &amp; #BillionairesFirst tax plan: https://t.co/NyVNQOXWFx"]["Remain in awe of firefighters battling the fires in CA. You remind us of what we love so much about our communities! #CaliforniaWildfires"]["With so many tax cuts going to rich, how does @HouseGOP plan to pay for them all? Cut #Medicare. Cut #Medicaid."]["Anyone who has looked at the numbers can see why Americans are rejecting this devastating tax plan. #NotOnePenny https://t.co/8xpWzXYOvp"]["If you have a family member on #Medicare or #Medicaid, you should be *very* concerned by the drastic cuts in the #GOPBudget."]["\"Fiscal hawks\" have become an endangered species. It's the only explanation for their silence on #GOPBudget adding trillions to the deficit."]["We can’t let Republicans get away with passing their #BillionairesFirst tax plan. #NotOnePenny https://t.co/33kK7pzdW3"]["No parent should have to choose between buying a prescription or putting food on the table. #ABetterDeal https://t.co/SKa93GI6Cd"]["American families deserve lower prescription drug prices. #ABetterDeal\n\nRead our plan: https://t.co/qeuehPy9P8 https://t.co/JLqNWXrpY3"]["-Stop the GOP Tax Plan\n-Protect the #ACA\n-Pass the #DREAMAct\n\nIt’s not about me – it’s about what policy will mean in people's lives. #AMJoy"]["President Trump has shown time &amp; again he has little respect for women’s rights in the workplace, in the home, &amp; in education. #AMJoy"]["Democrats will fight tooth and nail to protect the rights and dignity of every single American man, woman and child. https://t.co/kClKzRjCBw"]["Always a pleasure to chat with @joyannreid. Looking forward to tomorrow! #AMJoy https://t.co/vGPJzxh7gj"]["Dems just filed a brief supporting a federal lawsuit by 18 states &amp; DC to force @POTUS to resume #ACA CSR payments. https://t.co/yoOdPq8r88 https://t.co/64IvbIALe2"]["No one should be patting themselves on the back over #PuertoRico &amp; #USVI. People are still suffering and there’s still work to do. #TheView https://t.co/GMeH2qQqGA"]["Earlier this week, I sat down with @chelseahandler – and now you can watch our conversation on Netflix’s @chelseashow. Be sure to watch! https://t.co/KWgHjuevnE"][".@RepRichardNeal knows there’s a better way to move forward on tax reform – and it starts by the throwing out the GOP’s one-sided proposal. https://t.co/Da4ArHQe8C"]["This is not what helping families looks like, @realDonaldTrump. Not at all. #ProtectOurCare https://t.co/j67qShD9Ze"]["We have a responsibility to protect our borders. We do NOT have a responsibility to go after #DREAMers and their families. #TheView"][".@POTUS is claiming his decision to hike families' premiums is about blocking a “bailout” to insurance companies... https://t.co/lTa40gXI1K"]["If the #DREAMAct gets the vote it deserves, it will pass. #ProtectDREAMers https://t.co/qPKL0P3FsC"]["Thank you to all the women stepping up and saying \"#MeToo.\" Your courage is truly inspiring to us all."]["We're starting now! https://t.co/cwX9LuiJAE"]["I'll be speaking with @cbellantoni of the LA Times live at 10/7 pm PT. Tune in here: https://t.co/23GQYvUi4m"]["Our message to immigrants is simple: We stand with you. We fight with you. And we’re not backing down. #ProtectDREAMers https://t.co/lsBEuvbeLm"]["Protecting God’s creation is not the work of a single day but a constant effort that demands vigilance. #CWA45 https://t.co/YrqXAJ0NJK https://t.co/MxmC2Oj9bA"]["The #DREAMAct is central to any meaningful effort to protect immigrants' rights. Watch my remarks at @CHIRLA here: https://t.co/KLIhCqWVes"]["#ABetterDeal is built on input from Americans nationwide. Share your story: https://t.co/KJfVeXbSsM https://t.co/lAAk966PQS"]["Thank you to the doctors, nurses, &amp; staff who joined us for today's roundtable on #ACA &amp; their heroic response to the #LasVegas tragedy. https://t.co/i5UulFAdyF"]["Democrats aren’t just talking about a better future – we already have a plan to make it happen. #ABetterDeal https://t.co/IBWDO14umm"]["We will never forget Stacee Etcheber and all of the angels lost in Las Vegas. #LVHealingGarden #VegasStrong https://t.co/4mxkALcv5R"][".@realDonaldTrump, it’s time to accept your #MuslimBan is unconstitutional. Move on. https://t.co/RqgqNGM4j0"]["Congrats to @SenJohnMcCain on being awarded @ConstitutionCtr's #LibertyMedal! Thank you for your decades of service &amp; constant courage!"]["#ABetterDeal is powered by Americans like you. Please – share your story: https://t.co/rUTE2jpaTd"][".@POTUS makes empty promises to lower prescription costs. Democrats actually have a plan to do it. Read it here: https://t.co/6emRonL13p"]["While President Trump brags about his health care sabotage, hard-working families are suffering. #ProtectOurCare https://t.co/RXyGVWIPNw"]["#ABetterDeal means…\n-Universal high-speed internet\n-10 million new jobs\n-Expanding affordable child care\nhttps://t.co/IBWDO14umm"]["Democrats are fighting to give families #ABetterDeal. Read more here: https://t.co/E6NufZ2pVD"]["President Trump should take a look at his own billionaires-first tax plan before he starts attacking Democrats. https://t.co/EwIJUodFxF"]["People are hurting. We must continue to stand with Americans in #PuertoRico &amp; #USVI, as well as those suffering in #CaliforniaWildfires. https://t.co/P77qEjuKk4"]["From the #IranDeal to #ACA, President Trump is going rogue – and it’s not helping anyone. #ThisWeek https://t.co/pR52HQnWkh"]["If @realDonaldTrump really wanted to help people, why would he take them hostage and try to force his policies through? https://t.co/EslFJRGTYV"]["Democrats will not be cowed by @realDonaldTrump’s efforts to bully us into paying for his border wall. https://t.co/nlB8XBbhKa"]["The fight to #ProtectOurCare continues. It’s simply unconscionable that we have to fight @HouseGOP to fund children’s health insurance. https://t.co/wqLiG6vRJ2"][".@realDonaldTrump's war on the Middle Class has never been more clear than in his tax plan &amp; ongoing attacks on the #ACA. #ThisWeek"]["Had quite a few memorable moments this week. Take a look at them here: https://t.co/Ehh2shyF3X"]["Sitting down with @GStephanopoulos tomorrow for #ThisWeek at 9 am ET. Tune in!"]["Starting now on CNN! #AxeFiles https://t.co/HN4HkiFeq0"]["Here’s a highlight from walking @davidaxelrod around my alma mater, @trinitydc. You can watch the rest at 7 pm ET on @CNN! #AxeFiles https://t.co/36iteq0f09"]["Walking across @trinitydc campus earlier this week while filming for #AxeFiles. Be sure to watch this Saturday at 7 pm ET on @CNN! https://t.co/Gypdfm7IPX"]["Any renegotiation of #NAFTA must include efforts to raise wages in Mexico, or Americans will keep seeing their jobs head over the border."]["Had a wonderful conversation with @davidaxelrod earlier this week. Be sure to watch Saturday at 7 pm ET on @CNN! #AxeFiles https://t.co/ns8v59G9JA"][".@POTUS' decision to end #ACA cost-sharing payments means taxpayers will be forced to pay $200 billion for the privilege of higher premiums."][".@realDonaldTrump's threats against the #IranDeal are a grave mistake that threatens America's security &amp; credibility at a critical time."]["Tune in now for my reaction to President Trump’s ongoing effort to sabotage the #ACA: https://t.co/dtde4cQF9G"][".@POTUS’ decision to spike Americans’ health insurance premiums by 20% is an act of pure spite. Watch @ 2 pm ET: https://t.co/dtde4cQF9G"][".@realDonaldTrump’s efforts to undermine #IranDeal &amp; sabotage #ACA are inexcusable. Watch at 2 pm ET:  https://t.co/dtde4cQF9G"]["Matthew Shepard’s memory reminds us we must remain committed to fighting to #EraseHate across America. https://t.co/YPFfTyfcJ7"][".@SpeakerRyan, you talk about wanting a “fully functioning Congress.” So why do you keep barring Democrats from putting our ideas forward? https://t.co/3vjWpzDfwF"]["This is striking: 50% of households that claim State &amp; Local Tax deduction make under $100K – &amp; now @SpeakerRyan wants to throw it away."]["We are taking a stand against @SpeakerRyan &amp; @SenateMajLdr’s effort to hike taxes on families. Watch here: https://t.co/tXCB54iLO3"]["Keeping the US safe means the rest of the world must take us seriously. If @POTUS undermines the #IranDeal, that becomes more unlikely."]["It's truly sad to see @POTUS dismiss the suffering of Americans in #PuertoRico &amp; #USVI. We must give more help, not less!"][".@POTUS seems to think that saying \"Stop the World! I want to get off\" is a legitimate foreign policy. It is not. #IranDeal #ParisAgreement"]["We’re starting now. You can find the livestream for today’s press conference here: https://t.co/b9L07ECZAH"]["Tune in shortly as I discuss #CaliforniaWildfires, #PuertoRico, #USVI, &amp; efforts to undermine the #IranDeal: https://t.co/kF5yDrldj5"][".@POTUS, we don't abandon Americans in their time of need. PR &amp; USVI need MORE help, not less, from the federal govt https://t.co/fKpTKLbyZQ"]["Experts agree: the #IranDeal remains the best way to stop Iran from getting nuclear weapons. https://t.co/XxEwcN6L10"]["#FreedomForGirls is knowing your power, chasing your dream, and NEVER backing down. https://t.co/ZKg0LINIBP"][".@SpeakerRyan &amp; @SenateMajLdr should be ashamed of misleading the public on the impact of their tax “plan.” #NotOnePenny https://t.co/2D9c93mQan"]["The White House’s immigration proposals are terrible. Together, they would greatly damage to the character of our country. #ProtectDREAMers https://t.co/kpM5KTrndV"]["In awe of the courage of all who are coming out today as #LGBT. We will stand by you! #NationalComingOutDay https://t.co/bubhtQkeXt"]["Just ten minutes until Democrats speak out against @POTUS’s extremist immigration “proposals.” #ProtectDREAMers https://t.co/mS6i75q4pL"]["Is #FacebookDown for you? For far too many Americans, not having access to high-speed internet means it might as well always be. https://t.co/XWDxIwMbUb"]["Harvey #Weinstein's assaults on women &amp; efforts to silence his victims violate every standard of acceptable behavior https://t.co/o0E8ptdZGD"]["When #WomenSucceed – in classrooms, laboratories, and in the conference room – we all benefit. #WomenInSTEM https://t.co/ggQwz9wDAe"]["#CaliforniaWildfires disaster declaration is a positive step, yet more is necessary. Families need support to rebuild &amp; heal."]["Dismantling the #CleanPowerPlan is an assault on our sacred obligation to preserve God’s creation for the future. https://t.co/DLDh7AdQRP"][".@SpeakerRyan’s tax plan is great for billionaires – and terrible for hard-working families. #NotOnePenny https://t.co/Bo0ffVMIOT"]["Grateful for firefighters, prayerful for people of Napa &amp; Sonoma that fires will be put out soon #NapaFire."]["The Admin's proposal doesn't show real interest in compromise or protecting #Dreamers. My statement w/ @SenSchumer: https://t.co/1fiB5gO8Z5"]["Another week has come to an end. Take a look at some of the moments that will stay with us here: https://t.co/1yH5KxshLh"]["Deeply, deeply moving words from survivors &amp; those who've lost loved ones to gun violence. You really need to watch this. #EndGunViolence https://t.co/cehXP1SoZN"]["If @POTUS cared so deeply about the Constitution, he wouldn’t have just trampled on a woman’s right to health care. #HandsOffMyBC"][".@repjohnlewis knows our role in Congress is to lead the charge for change, not follow in its wake. I couldn’t agree more. #EndGunViolence https://t.co/PYvrm6krCJ"]["No woman should be subject to the whim of her employer to access the contraception that is her right #ProtectOurCare https://t.co/O9D5rAogHL"]["Millions of Americans in #PuertoRico and #USVI need our full and uncompromising support. Anything less is unacceptable."]["The devastation of Harvey, Irma, and Maria have laid bare the corrosive effect of @HouseGOP‘s refusal to act on jobs https://t.co/gRyeQafF1w"]["AG Sessions can try to ignore the truth, but even his deep prejudice cannot erase the rights of #trans Americans. https://t.co/vy1ulrlsnV"]["Our fellow Americans in #PuertoRico and the #VirginIslands need our support. We cannot fail them. #PelosiTownHall https://t.co/0lxlz6HgQQ"]["Let's be clear: there is a difference between the NRA &amp; gun owners. Many gun owners want common sense efforts to #EndGunViolence."]["Special consideration must be given to #DREAMers living in states &amp; communities impacted by Harvey, Irma, and Maria."]["What is happening right now in #PuertoRico and the #VirginIslands is a challenge to the conscience of America. We must do more. https://t.co/v7hKUbqZWb"]["Our budget should represent our values. The #GOPBudget does just the opposite."]["Republicans must allow a Select Committee on Gun Violence. They must allow us at least *look* for solutions. #EndGunViolence"]["Congress has a duty to protect Americans. We are failing in that mission. Republicans must let us take action. #EndGunViolence"]["And we're live! https://t.co/I8nSpbhTuu"]["Be sure to tune in at 10:45 am ET as I discuss #LasVegas, the #GOPBudget, and more. https://t.co/NL3CixFAbM"]["Republicans need to stop misleading Americans and tell the truth: their tax plan will raise taxes on middle class families. #NotOnePenny https://t.co/gHl2iCA5qG"]["Ran into @repjohnlewis and @RepSwalwell in the @CNN green room tonight after #PelosiTownHall. Nice surprise! https://t.co/DjhKweq0Oh"]["The @HouseGOP just can’t stop attacking Americans’ health care. #ProtectOurCare #PelosiTownHall https://t.co/zQoVG6oxCB"]["Democrats are urging our Republican colleagues to take a stand to #EndGunViolence. Is that too much to ask? #PelosiTownHall https://t.co/OXiJ7hAYsw"]["I’ve been very clear: where we can find common ground, we will work with the GOP. When we cannot, we will stand our ground. #PelosiTownHall"]["Expanding background checks are common sense. Americans know it. @SpeakerRyan, it’s time for a vote. #PelosiTownHall https://t.co/na9NfXZ6St"]["Bob &amp; Amber, from the bottom of my heart, thank you for having the strength to share your story tonight. #LoveVegas #PelosiTownHall"]["Getting ready to head out for start of #PelosiTownHall! Starting now at 9:15 pm ET. https://t.co/5oXilNX0M0"]["Under an hour until we get started. Lots to talk about! #PelosiTownHall"]["The families of victims of gun violence deserve more than empty words from Republicans in Congress. #EndGunViolence https://t.co/NxmEVMK6mm https://t.co/sMzef3SqNz"]["Just 7 more hours until the start of tonight’s #PelosiTownHall. Tune in at 9 pm ET on @CNN! https://t.co/HzpxYgjXYB"][".@realDonaldTrump, you promised you would not touch #Medicare. Americans need you to live up to that promise and reject the #GOPBudget."]["The #GOPBudget is showing the GOP’s true colors: cut taxes for the rich &amp; pass the bill to America’s hard-working families. #NotOnePenny"]["Be sure to watch tomorrow’s #PelosiTownHall on @CNN at 9 pm ET! https://t.co/IBV7NBGGrB"]["Tomorrow, my colleagues and I will honor those lost in #LasVegas &amp; call for a renewed effort to #EndGunViolence. https://t.co/0tbzJdbC6a"]["#HR36 is not only unconstitutional – it would leave women in dire medical situations with no meaningful options. #RightToChoose"]["How many have to die for the @HouseGOP to say #enough? This can’t wait. We can do something to end the drumbeat of gun tragedies."]["#DREAMers, make sure you mail your DACA renewal application today to make sure it’s received by the Oct 5 deadline. https://t.co/SVqSYcq7HQ https://t.co/bqwyNeBID4"]["Americans in #PuertoRico &amp; #USVI are w/o homes, food, water, power–and still heroically stepping up. They need help, not insults. https://t.co/JWEhctGXGc"]["50 years after he took the bench, there is still so much we can learn from Justice Marshall’s example. https://t.co/pExJ3HqEz9"][".@SpeakerRyan, it’s time for action. Congress must create a Select Committee on Gun Violence. https://t.co/yCpMOUKJKg"]["We will never waver in our love and support for the people of #LasVegas &amp; the families of the victims of this attack https://t.co/S4uey6GjGT https://t.co/kKdoZZ0mk7"]["Horrified and heartbroken by the awful tragedy in #LasVegas last night. Praying for those lost, wounded &amp; waiting for news from loved ones."]["This week was as busy as any. Take a moment to take a look at some of the moments that stood out. https://t.co/I5A9FxlMBI"]["When a hurricane hits, there are no Democrats or Republicans--only Americans, families struggling to survive. Shameful @POTUS can't see that"]["A budget should be a statement of values, but the purpose of this radical GOP budget is to hand tax breaks to billionaires."]["Well-deserved honor for one of the greatest in @SFGiants history! https://t.co/1oYJBGeRes"]["Our families – our children – know that the Affordable Care Act is working. Now, it’s time to make it even better. #ProtectOurCare https://t.co/XUnLVB2IBq"]["The deadline to renew #DACA for 140k recipients is October 5th. Information here → https://t.co/B9rrFSnTos #ProtectDREAMers"]["It is time to act. America cannot turn its back on #DREAMers. My op-ed with @SenSchumer: https://t.co/O0GgUAWfJk"]["Wishing you all the strength in the world, @OfficialJLD. https://t.co/lkIvMMOGg2"]["Trickle-down economics have always increased the deficit. And yet Republicans keep pushing it. #WashingtonIdeas"]["Just a few minutes until I sit down w/ @jonkarl at #washingtonideas. Be sure to watch at 2 pm ET! #WashingtonIdeas https://t.co/2aq3ikRjBM"]["Be sure to keep an eye on the news later today about #ABetterDeal -- Democrats will be laying out a plan for universal high-speed internet."]["What happened to the GOP's deficit hawks? Looking at the disastrous Ryan-McConnell tax plan, it seems they are nowhere to be found."]["The #DREAMAct enjoys overwhelming support among the American people. Republicans must allow it to pass."]["Tune in as I discuss Republicans’ disastrous tax plan, the #DREAMAct, and the fight to #ProtectOurCare! https://t.co/b9L07ECZAH"]["Proud to stand with @NydiaVelazquez in the effort to ensure #PuertoRico has access to all necessary resources."]["There’s no excuse for Congress’s failure to help #PuertoRico &amp; #USVI. Democrats are calling for immediate action! https://t.co/rz5XHuT6rM"]["You can’t put lipstick on a pig, but  @SpeakerRyan sure is trying to put some on his billionaires-first tax plan. #NotOnePenny https://t.co/HNhdHDgUXq"]["Great to have @RepCummings healthy &amp; back in the fight for needs and interests of American families! https://t.co/Iear0Enmrb"]["It’s official: yesterday’s press conference with the @LittleLobbyists was my favorite of the year. #ProtectOurCare https://t.co/9l7G1nCWUo"]["The GOP tax plan isn’t tax reform. It’s a ploy to give the rich massive tax cuts – &amp; make families foot the bill. https://t.co/4xRBraxsSH https://t.co/pt727fJTd0"]["Continuing my fight alongside the @MineWorkers to ensure that all miners get the pension benefits they earned during a lifetime of hard work https://t.co/gt8ME3lRIf"][".@StephenCurry30 &amp; @warriors – the offer still stands. #DubNation https://t.co/qfi2DEsKLk"]["Trump Admin must quickly give our fellow Americans in #PuertoRico additional DOD resources. ¡Estamos con ustedes! https://t.co/MZOp97hq4g https://t.co/8OEVf5JtQP"]["#WomenSucceed https://t.co/0wfD7yN43m"]["With Americans yet again beating back #Trumpcare, Republicans must abandon their anti-ACA obsession. https://t.co/1HtCuyu7wh"]["And we’re live! You’re not going to want to miss this! https://t.co/kYhv2swU9i"]["Excited to welcome special guests at 1:30 pm ET to talk re: #Trumpcare’s impacts on ppl w/ pre-existing conditions! https://t.co/SCEyXxPjag"]["Thanks @SenatorCollins for saving us from #Trumpcare again but more work to go to get us back on bipartisan track to update &amp; improve #ACA"][".@HouseDemocrats stand strong for the DREAM Act! #ProtectDREAMers https://t.co/6c3PxMiC3r"]["The DREAM Act is not simply a piece of legislation: it is a statement of *values.* #ProtectDREAMers"]["The hopes, dreams, &amp; aspirations of DREAMers could not be more American. They deserve a vote on the #DREAMAct!"]["Tune in now as @HouseDemocrats demand action on the #DREAMAct! https://t.co/eh6pTT23B7"]["Be sure to watch at 6 pm ET as Democrats demand a vote on the DREAM Act. #ProtectDREAMers https://t.co/eh6pTT23B7"]["If #Trumpcare passes, and you or someone you love gets sick, you better hope you have a few hundred thousand dollars lying around. https://t.co/VYjehOl4cB"]["#Trumpcare would be a disaster for millions of women and families who would lose access to Medicaid. RT if you want to #ProtectOurCare!"]["Under ACA, if you have a pre-existing condition, insurers can’t discriminate against you. #Trumpcare will throw those protections away. #AMR"]["Just a few moments until I sit down with @mitchellreports to discuss #GrahamCassidy #Trumpcare. Don’t miss! #AMR"]["I’ll be joining @mitchellreports on #AMR at 12:30 pm ET  to talk about the most recent #Trumpcare developments. https://t.co/wTjNwybUUT"]["Our fellow Americans in #PuertoRico &amp; #USVI deserve to know their government is there for them. We must act now! https://t.co/gsdedISfp7"]["#DREAMers are Americans. We must pass the DREAM Act to #ProtectDREAMers immediately! https://t.co/IQ0Vmd8kAq"]["Republicans must stop making a dangerous bill even worse &amp; join Democrats to improve health care. #Trumpcare. https://t.co/VXPV8B6ugo"]["Upgrading America’s infrastructure is crucial to creating good-paying jobs now and for years to come. #ABetterDeal #MTP https://t.co/xeiwEL2QIg"]["Didn’t catch #MTP this morning? You can watch the full interview here ⬇ https://t.co/euIhWrzBB7"]["Infrastructure has never been a partisan issue. Republicans should join us to create jobs and raise wages. #MTP"]["Congress has a moral duty to pass the #DREAMAct ASAP. DREAMers make America more American! #MTP"]["The President of the United States should focus on bringing Americans together – not deepening our divisions. #MTP"]["I hope you will take a moment to tune in as I join @chucktodd on #MTP to discuss the #Trumpcare monstrosity. https://t.co/TriV4tCSmX"]["Looking forward to sitting down this Sunday with @chucktodd for #MeetThePress to talk abt GOP's monstrous #Trumpcare proposal. https://t.co/L57hfLFW1b"]["More cynical efforts by the Trump Admin to make it harder to enroll in quality, affordable health care. Stop the sabotage. #ProtectOurCare https://t.co/hadixP96yl"]["@BetsyDeVosED To survivors, across the country, know that I stand with you – that my fellow Democrats and I are fighting for you. 5/"]["@BetsyDeVosED I cannot state strongly enough how fundamentally outrageous this is for survivors, students and schools – how immoral it is. 3/"]["And yet today, the Trump Admin and @BetsyDeVosED rolled back Title IX progress &amp; protections for survivors of sexual assault. 2/"]["We should all be able to agree that all students have the right to be safe from fear &amp; harassment on campus. #StopBetsy 1/"][".@SenJohnMcCain’s courage has always been clear. Thankful to him &amp; Americans who raised their voices for their strength &amp; determination."]["We finally have a chance to put a stake in the heart of the #Trumpcare monstrosity. We can’t let up. The next days are crucial in this fight"]["In this week's Democratic Address, @RepJohnYarmuth asks why Republicans continue to ignore #Trumpcare's devastating impacts. https://t.co/OStR9djAQr"]["#GrahamCassidy version of #Trumpcare is the most disastrous yet – and everyone knows it. https://t.co/gfLGdZ6S3D"]["There’s a reason @HouseGOP &amp; @SenateGOP can’t argue for #Trumpcare without misleading Americans: all the facts are against them."]["Republicans want you to believe their alternative facts on #Trumpcare. Don’t let them get away with it. https://t.co/P8s4JGGzMC"]["Thank you for speaking out, @lpackard. Wishing you strength. #ProtectOurCare https://t.co/KULsM7SlH9"]["Experts couldn’t be clearer: #GrahamCassidy version of #Trumpcare will leave Americans out in the cold. #ProtectOurCare https://t.co/PzY2Cs6tag"]["At every stage, it was the voices of Americans that held back #Trumpcare.\n\nThat will be true in the days to come too https://t.co/jyR67bpinX"]["You should read this thread. Don’t fall for GOP’s misleading claims. https://t.co/SJIGjnavp9"]["Congress should be giving America #ABetterDeal -- not denying people with pre-existing conditions crucial health coverage."]["The so-called Graham-Cassidy bill is the latest &amp; worst version of #Trumpcare yet. Fundamentally misguided."]["And we are live! https://t.co/Qy5zkh5Bfy"][".@SenateGOP’s newest #Trumpcare plan = assault on Americans’ health care\n\nListen in at 12 noon ET for my thoughts: https://t.co/i323FE98fr"]["Thank you, @jimmykimmel &amp; family, for sharing your ongoing story with us. Stories like yours are why we will defeat #Trumpcare. https://t.co/eppsgTBvyi"]["My heart is with all in Puerto Rico contending with #HurricaneMaria. Be safe. Your fellow Americans are with you."]["Be sure to tune in at 12 noon ET as I discuss Republicans’ effort to force through #Trumpcare. https://t.co/i323FE98fr"]["Paul &amp; I are praying for the loved ones of those lost &amp; the injured today in the Mexico City earthquake. #PrayForMexico"]["This is simply unconscionable. #Trumpcare https://t.co/aFjMxYZH3U"]["The #Trumpcare monstrosity is on the march again. We must defeat it. https://t.co/FymGykTda1"]["Congratulations on your 10th anniversary @Morning_Joe! Thank you, Mika &amp; Joe for keeping the American people well informed. #MJ10"]["Graham-Cassidy is the GOP's latest name for the cruelty and costs of the dangerous #Trumpcare bill. Democrats are all hands on deck. https://t.co/7SBQzlsxEr"]["It was a busy week here in Washington. Take a moment to look at what I've been up to! https://t.co/Ru0cOYss6J"]["La belleza de nuestro país se encuentra en la diversidad. #HispanicHeritageMonth https://t.co/H7rBSDNT26"]["This month, we recommit ourselves to the fight against efforts erase the contributions of Americans of #HispanicHeritage https://t.co/uUhRtzE08o"]["Congress has a moral duty to pass the DREAM Act. #ProtectDREAMers https://t.co/8OGQkJ5sRO"]["Your strength &amp; sacrifice will always be remembered. #POWMIA https://t.co/XPde03Op3l"]["Americans stand with our British friends in the wake of today’s terrorist attack. Thinking of all those who are suffering."]["No family should have to choose between caring for a young child and stable employment. #ChildCare4All #ABetterDeal https://t.co/xbkYLb9JbB"]["Proud to stand with @BobbyScott and @PattyMurray to propose #ChildCare4All as a part of #ABetterDeal! https://t.co/QbiHGDlWXF"]["Economic growth comes from investing in education, research, and infrastructure. It does not come from tax cuts for the rich. #NotOnePenny"]["I have no doubt that if the #DREAMAct were to be given the vote it deserves, it would pass. #ProtectDREAMers"]["America's faith leaders are clear: the effort to #ProtectDREAMers is a moral duty."]["And we're live! https://t.co/cuoCakZ5gG"]["Tune in at 10:45 am ET as I discuss our plans to #ProtectDREAMers. https://t.co/APTfNmJTh0"]["It’s always a pleasure to spend time catching up with @SenatorReid. https://t.co/kE5bjBhsBa"]["DREAMers are Americans in every way that matters. We need to pass the DREAM Act now! #ProtectDREAMers https://t.co/F3ejtvXDHL"]["We must never back down from ensuring that every woman in every place can live free from abuse. #VAWA https://t.co/5fSP1ugWcF"]["Met with @calstate Chancellor White and officers of @csustudents this morning to talk #ProtectDREAMers and #PellGrants! https://t.co/0zrQSEvocP"]["Every woman has a right to a life w/o abuse – and every survivor deserves the support to move forward. Thankful for 23 years of #VAWA."]["Today, House Ds intro-ed Medicare fr 50-64. Tmrw, @SenSanders intros single payer. We welcome all plans to the table to cover all Americans. https://t.co/bf1TbxgecR"]["Today, we mourn the loss of Edie Windsor. With pride &amp; bravery, she refused to accept injustice. Your legacy of LOVE moved us ALL forward."]["Today, we celebrate the life of former TX Rep. Jack Brooks. A beloved colleague, a giant of the House and for many of us a cherished friend. https://t.co/ahmQ14UFQp"]["We owe DREAMers for their patriotism &amp; courage to come forward. This is a fight about who we are as a country. We must pass the #DREAMAct. https://t.co/uEqJqzddf0"]["Democrats are committed to building up American communities. The Republicans may want to take notes. #ABetterDeal https://t.co/RYTgSl5YlL"]["16 years after #September11, we hold fast to this message: hate and terror will never defeat the American spirit. https://t.co/u98b8kpUAc https://t.co/WaMV8KkzWo"]["Deeply saddened to hear of the passing of @sffdpio’s Battalion Chief Terry Smerdel. Wishing for strength to his family &amp; loved ones."]["We will #NeverForget."]["Happy birthday to the Great State of California! https://t.co/i1qq2KkBUa"][".@RepLujanGrisham hits the nail on the head -- #DREAMers make America more American. We must pass the DREAM Act &amp; #ProtectDREAMers. https://t.co/3sPQVYYfBX"]["Trump Admin’s cynical disruption of health care outreach is driving up premiums. It. Must. End. #ProtectOurCare https://t.co/VyJbZprT9D"]["Passing the DREAM Act will ensure we do not miss out on all these young people will achieve. #ProtectDREAMers https://t.co/N3QGiecjMl https://t.co/FaDOhm0yQQ"]["Honored to be included in such an inspiring group of women. #SheIsTheFirst https://t.co/2kjodf7Imk https://t.co/bkMuXQrvwp"][".@BetsyDeVosED's remarks are another salvo in Admin's attacks on women &amp; survivors by destroying robust Title IX enforcement. #StopBetsy"]["Thank you for this commitment, Mr. President. Real protections will only come from your signing the DREAM Act ASAP. https://t.co/dCXSFrWfoy"]["Be sure to tune in at 10:45 am ET as I discuss Democrats' effort to pass the DREAM Act! https://t.co/WuzecX8HLf"]["Paul &amp; I are praying for all in the path of #HurricaneIrma2017. May you and your loved ones be safe in the days ahead."]["How can @HouseGOP look DREAMers in the face and say they don’t deserve to be here? #ProtectDREAMers https://t.co/gRAB96tZb7 https://t.co/Hd5Pp5v3bk"]["FACT: 76% of Americans support citizenship or permanent status for #DREAMers. It’s time to bring #DREAMAct to the floor! #ProtectDREAMers"]["Proud to stand with @HouseDemocrats &amp; @SenateDems to demand a vote on the DREAM Act. RT if you are ready to #ProtectDREAMers!"]["Trump is 1st @POTUS in 30 yrs who has been anti-immigration -- who rejects that immigration is the lifeblood of our nation. #ProtectDREAMers"]["And we are live – tune in as I speak live from the Capitol with @SenSchumer &amp; others. https://t.co/u3Ev54auzB"][".@HouseDemocrats &amp; @SenateDems are standing together to fight to #ProtectDREAMers. Tune in here at 10 am ET: https://t.co/x7kCdcsMJ0"]["Trump just gave a masterclass in cowardice²: he cancelled #DACA, and then trotted out Sessions because he was too scared to do it himself."][".@realDonaldTrump’s cruel decision to attack America’s young people is nothing short of shameful. https://t.co/u9jD79ZrKR https://t.co/WAORpLO1IM"]["Trump’s cowardice is on full display today. His cruelty must not stand! #ProtectDREAMers"][".@realDonaldTrump's attack on #DREAMers is pure political cowardice. Congress *must* #ProtectDREAMers! https://t.co/ZwL1LeypdA https://t.co/bptIMp4PA9"]["The 40-hour work week. OSHA. Overtime. Family leave. We owe labor for all of it.\n \nThank you. #LaborDay https://t.co/GQzmsLFCsV https://t.co/baAQrz3KsF"][".@SpeakerRyan, I hope we can agree that deporting patriotic young Americans would be disastrous. #DefendDACA https://t.co/JK7XfIDwqZ"]["Proud to see California leading the charge to #DefendDACA in the business community. https://t.co/gnZE8LYO9T"]["Word is getting out: @denverpost says #ABetterDeal presents a clear vision for America’s future! https://t.co/RYTgSl5YlL"]["White House &amp; @HouseGOP have no jobs plan &amp; have failed working families. The impact is clear. #JobsReport https://t.co/MKlMjq7Dru"]["DREAMers are part of the fabric that makes our country stronger. Their life, liberty &amp; pursuit of happiness is what's at stake. #DefendDACA https://t.co/53l65dmBOO"]["We should be shoring up #ACA marketplaces, @realDonaldTrump, not creating chaos that will hurt families. https://t.co/dnhPbk0ASK"]["I’ve said it before, and I will say it again: America’s #DREAMers are not negotiable. #DefendDACA https://t.co/Jl8tedE3nE"]["Americans deserve real tax reform that helps families. @realDonaldTrump's trickle-down scheme doesn’t come close. https://t.co/LOnzhNxEdT"]["Massive tax cuts to the rich →✨✨conservative magic✨✨→ \"trickle down\" to the middle class\n\nDon’t fall for Trump’s flawed logic. #NotOnePenny"]["And we’re live. Tune in here: https://t.co/FGlCviVKHz https://t.co/CpIZZLygiM"]["#ABetterDeal means better jobs &amp; better wages for American families. Tune in as I take questions at 11 am PT!"]["Thank you to all who have fought – &amp; continue to fight – for a better, more equal America all these years after the #MarchOnWashington! https://t.co/tgJPQM9IXe"]["Congress must pass a timely relief bill, making critical resources available thru emergency spending. #HoustonStrong https://t.co/vTYx4SkySk"]["Incredibly thankful to all working diligently to save lives of those impacted by Harvey. #HoustonStrong https://t.co/ZyjUUQsVzS"]["Praying for the safety of all in Texas. #houstonflooding https://t.co/t1vowE7Qxm"]["This #WomensEqualityDay, we recommit ourselves to the fights for gender equality &amp; voting rights nationwide. https://t.co/hWRpPn2RKq https://t.co/iJjGnAyeJc"][".@POTUS pardon of fellow birther Arpaio makes mockery of rule of law, &amp; says communities of color can be targeted &amp; abused w/ total impunity"][".@POTUS should have more respect for trans Americans who had the bravery to serve in uniform. #ProtectTransTroops https://t.co/U7r3gVkGuF https://t.co/btM4y4FdMq"]["It’s time to give America the tools to unlock a new wave of innovation, opportunity &amp; good-paying jobs. #ABetterDeal https://t.co/it0u0CI5RE"]["Thinking of everyone in the path of #Harvey2017. Please -- stay safe.\n \nResources:\n@fema\n@femaregion6\nhttps://t.co/7Bvxq9LkuF"]["Here’s to 101 years of @NatlParkService! #HappyBirthday https://t.co/B2h06nD2Kb"]["Our public lands &amp; national monuments are priceless. @SecretaryZinke's effort to shrink them is shamefully short-sighted. #KeepItPublic"]["Republicans need to stop the chaos and sort themselves out in a hurry. The full faith &amp; credit of the U.S. is on the line. #GOPdefault"]["This is NOT how you keep America safe. Period. #ProtectTransTroops https://t.co/ESu55wL5M4"]["#ABetterDeal means children learning &amp; parents earning. RT to spread the word! https://t.co/33kor8zBcF"][".@NatlParkService’s decision to permit a white supremacist rally at SF’s Crissy Field could not be more misguided. https://t.co/sx58QzFPJu"][".@POTUS’ attempt to bully taxpayers into funding his immoral &amp; expensive border wall is completely unacceptable. https://t.co/NW2pHwjidX https://t.co/AZCLKwfcjN"]["It’s all well &amp; good to *say* Trump’s defense of white supremacy was repulsive – it all means nothing if you refuse to act. #CensureTrump"]["When we talk abt #WomensEqualityDay, we are talking about a full-fledged commitment to ensuring women are empowered to improve their lives."]["#WomensEqualityDay is Saturday. American women deserve another wave of progress. #ABetterDeal https://t.co/rp8kYXwnqe"]["It is reprehensible to treat children as bargaining chips. America’s DREAMers are not negotiable. #DefendDACA https://t.co/wErMfpWBlh"][".@SpeakerRyan says House Republicans “did [their] job.”\n \nIt seems he thinks their job is to kick 22 million off health care. #RyanTownHall"]["President Trump’s speech on Afghanistan policy was low on details but raises serious questions about the future. https://t.co/I3pz1h5LtW"]["With students heading back to school nationwide, we must ensure good jobs are waiting for them when they graduate. #ABetterDeal https://t.co/qEyYIQg9rO"]["Not able to travel to see the complete #SolarEclipse2017 in person? Thanks to @NASA, that’s not a problem. https://t.co/dYE1ohhI6s"]["Watching the #SolarEclipse2017 can damage your eyes. Here’s how to watch if you weren’t able to get glasses. https://t.co/B0CEAkpjZM"]["Deeply saddened by news of the USS John S. McCain collision. Paul &amp; I are praying for our brave sailors &amp; their loved ones."]["#RIPDickGregory, dear family friend whom we loved for being a patriotic leader who led with wisdom and humor. Condolences to his loved ones. https://t.co/NEGNVBtRsG"]["27 years later, the Ryan White CARE Act stands as a firm commitment to Americans living with HIV/AIDS: we will not leave you behind. https://t.co/6BJhYVcJqv"]["It’s been 100 years since we took our first major step as a nation towards recognizing every woman’s right to vote. #WomenSucceed https://t.co/nkLsMkrcWi"]["Steve Bannon's exit does not erase @realDonaldTrump’s long record of lifting up racist viewpoints &amp; advancing repulsive policies. #BannonOut"]["Congress must censure @realDonaldTrump for his repulsive defense of white supremacy in the wake of #Charlottesville."]["Dems proud #ForeverGIBill signed into law to expand education opps &amp; good-paying jobs to millions more vets. https://t.co/JlmaDierUf"]["Terrorists will not break our spirit. May the people of #Barcelona know that the U.S. stands with them. https://t.co/h3r7yyUlLD"]["My thoughts are with all suffering after the terror attack in #Barcelona. Praying for the victims, their loved ones and the people of Spain."][".@SpeakerRyan, it is time to immediately remove Confederate statues from the halls of Congress. https://t.co/twJ4MFOfgB https://t.co/7Yx6p4JgCK"][".@realDonaldTrump has made it clear he doesn't know the difference between American patriotism &amp; white nationalism. https://t.co/6xhQhAFxW2"]["Congratulations, @Malala! We all can’t wait to see what the future holds for you and your fight for the world’s children. https://t.co/4u3FUofgpq"]["The re-sentencing of activists Joshua Wong, Nathan Law &amp; Alex Chow should shock the conscience of the world. https://t.co/TQXDdTtsbB"]["Thinking of #HeatherHeyer's loved ones. I hope it's a comfort that millions respect her courage, mourn their loss &amp; are praying for them. https://t.co/wTrB3z2wU7"]["Given #Charlottesviille, I urge @NatlParkService to reconsider allowing a white supremacist rally at Crissy Field https://t.co/xZRNbQN1il"][".@realDonaldTrump we heard you loud &amp; clear.  Ignoring the abhorrent evil of white supremacism is an attack on our American values. https://t.co/UNmyAbmTsz"][".@USCBO’s new report once again shows why the American people deserve a bipartisan conversation to improve the #ACA. https://t.co/hGJn1CKZIK https://t.co/FyP1Uy4Eph"]["For 5 years, #DACA has strengthened communities &amp; boosted our economy. #DREAMers are educators, engineers, nurses &amp; leaders in their field. https://t.co/y9orUfZCju"]["If @realDonaldTrump is sincere about rejecting alt-right white supremacists sympathizers, he should start at the White House. #FireBannon https://t.co/m2bfps3Q5g"]["For 82 years, Social Security has served America's seniors, children, disabled &amp; veterans. We'll continue fighting to protect it. #SocSec82 https://t.co/qmykRRDAwJ"]["As we mourn the victims of this act of terror, we must vow to defeat bigotry, racism &amp; hatred. #Charlottesville https://t.co/SkOP1lYAyq https://t.co/QujSXD7YNl"]["Repeat after me, @realDonaldTrump: white supremacy is an affront to American values. #Charlottesville"]["Our nation is defined by the march of progress. Our strength lies in our diversity. We must reject hate. #Charlottesville"][".@RepRichmond knows America deserves #ABetterDeal. RT if you do too! https://t.co/aXE0i4SrRT"]["Yet another reminder of the dizzying conflicts of interest in the Trump era. #WakeUpGOP https://t.co/FKY3Nl2NqQ"]["Republicans can talk all they want. The fact is they consistently refuse to put #PeopleOverPolitics."][".@realDonaldTrump spent months creating uncertainty for insurers. Now, working families are paying the price. https://t.co/0AoaCBxyXD"]["The last thing we need right now is saber-rattling &amp; impulsivity. The only acceptable path forward is with a smart, diplomatic solution."]["There is nothing more American than the hope &amp; courage that immigrant communities display every day. #IStandWithImmigrants! https://t.co/0z3dDelPrN"]