["Joining @BillHemmer on @FoxNews in a few minutes. Tune in!"]["The U.S. House of Representatives failed to protect Americans’ Fourth Amendment rights and instead passed the FISA Amendments Reauthorization Act to further entrench growing surveillance state powers. Read more here: https://t.co/09eSidrHaq https://t.co/R0iwfNVBun"]["No American should have their right to privacy taken away! #FILIBUSTER"]["Joining @Morning_Joe right now to discuss why the proposed FISA bill is unconstitutional!"]["The House votes this morning on our FISA reform to stop warrantless spying on American citizens. Let’s strike a blow for liberty today #GetAWarrant"]["We've got a great coalition working to restore our privacy rights. My hope is that the Amash amendment will pass and that it will come to the Senate a chance there. https://t.co/Rk7xgB8WHY"]["Most people within the intelligence community are hard-working, patriotic Americans, but it only takes a handful in the right positions to corrupt the system, and we should find out more about what has really been happening behind the scenes. https://t.co/YuBx68EkV7"]["Ultimately the debate over government surveillance focuses on a truth that many seem to have forgotten: The founders did not include the Fourth Amendment in the Bill of Rights as a suggestion. https://t.co/ApPrmlN14j"]["The House is going to take up a FISA extension that will not only extend their unconditional power to spy on Americans, but will make the problem worse. But there is resistance https://t.co/gOkXsCjerJ"]["ICYMI: I joined @FaceTheNation to discuss FISA reform. I will do whatever it takes, including filibuster, to prevent any reauthorization without new constitutional controls on this program. https://t.co/9xGIUPLn1n"]["What I find particularly troubling is that the U.S. continues to fund, we continue to give money to Pakistan over a billion dollars of U.S. taxpayer money is sent to Pakistan. I'll be introducing legislation to end their funding and use that money here at home. https://t.co/xBpdlo3Otm"]["It is time we stop sending American taxpayer money to Pakistan. RT if you agree!\nhttps://t.co/mRkvW1AgGx"]["I’m introducing a bill to end aid to Pakistan in the coming days. My bill will take the money that would have gone to Pakistan and put it in an infrastructure fund to build roads and bridges here at home. https://t.co/SHlA00rWEd"]["For the past year, I have worked with @realDonaldTrump to dramatically increase the availability of health care while at the same time decrease the costs. I applaud the admin for its action today, and I look forward to the finalization of the proposed rule https://t.co/7lHBxa9WzC"]["Joining @foxandfriends shortly. Tune in!"]["Great article from @amconmag. \"...contemplate for a moment the clinical insanity of starving a people you support in order to damage a government you don’t like (a strategy that notably failed against Saddam Hussein, by the way). https://t.co/FaKQlfXOwr"]["No Foreign Spy Program Reauthorization Without Citizen Protections https://t.co/YuBx68EkV7"]["Agreed. That’s why I introduced a bill to defund them as well. Unfortunately, it was blocked: https://t.co/yIEuytDmQW Let’s try again this year. https://t.co/AzLvmbAx2N"]["We shouldn't give money to countries that mass burn our flag and put Christians in jail for gossip. There's no reason in the world we should give Pakistan a penny when they put Christians in jail or put people in jail that helped to us get bin laden. https://t.co/jUDpwlcZ3H"]["I will introduce new legislation in the coming days to stop aid to Pakistan. I’ll be joining @TeamCavuto today at 4PM to talk more about this issue. Tune in."]["In March of 2016 I forced a vote on the sale of eight F-16s to Pakistan, worth $700 million. The vote tally, 71-24, in support of selling Pakistan F-16s. https://t.co/yWBLFiFtHW"]["In September of 2012 I introduced amendments to strip foreign aid from Pakistan, Egypt and Libya to do the right thing for taxpayers and veterans. https://t.co/RlPfIcNfDP"]["In July 2012 I introduced an amendment to limit foreign assistance to Pakistan unless Pakistan released Dr. Shakil Afridi from prison. https://t.co/WulMD03QgY"]["The US has given $34 billion in direct aid and military reimbursements to Pakistan since 2002. That is not putting America first."]["I can’t in good conscience look away as America crumbles at home and politicians tax us to send the money to corrupt and duplicitous regimes abroad. I wholeheartedly agree with @realdonaldtrump on this. https://t.co/flrhBcEnCj"]["Happy New Year! My New Year’s Resolution is to work for a bipartisan solution to surveillance reform and restore the fourth amendment."]["#ThrowbackThursday: Giving the accused their day in court isn't a suggestion. It's enshrined in our Constitution as a cornerstone of our judicial system. https://t.co/VlHJkZvKGA"]["We cannot live in fear of our own intelligence community. They have such power to suck up every bit of every transmission, every communication we ever made. https://t.co/rq6RKSoD5b"]["From our family to yours, Merry Christmas and happy holidays. https://t.co/y0kV6dMSHx"]["Merry Christmas!  Sen. Rand and Kelley Paul's Christmas Message https://t.co/EtRLJwoler via @YouTube"]["Kelley and I wish a Merry Christmas and Happy Holidays to all."]["To everyone, thanks for checking in here today for my annual #AiringofGrievances.  This is always fun, but in all seriousness #HappyFestivus"]["You can read more of the report here https://t.co/qAxQT2hrRu‘festivus’-edition-‘-waste-report’"]["Those are just a few items from our #HappyFestivus edition of the waste report, and they add to our #AiringofGrievances."]["Last but definitely worst: your government thought It wise to spend your tax dollars to build $255 million to repair roads...in Afghanistan https://t.co/aKFzUSEbYG"]["And @realDonaldTrump thinks there is a chance in hell someone else is going to pay for that border wall. https://t.co/aL88gcPEjF"]["We spent $15 million to train cashiers in Walmart...in Mexico"]["That begs several queastions really. Like why we blew up the last Libyan government...and, wait, there’s a Libyan government currently?"]["We spent $8.2 million to “instill confidence in the Libyan government”."]["Oh great, now the waste report is going to get a subpoena from the Special Prosecutor."]["We spent over $170k to build trails in national parks. Seems like not too bad until you read the next line that the parks were in Russia"]["It may not seem like a lot of money, but we spent just under $100k to make sure Kenyan farmers knew how to use Facebook."]["They spent $324,015 to pay for a clown school in Argentina. Rumors to the contrary, this was not a CODEL"]["Here are just a handful of the examples...#AiringofGrievances"]["That’s roughly the size of my hometown of Bowling Green, Kentucky"]["The average taxpayer pays around $8,136. That means the programs in this report wasted the taxes of 69,250 people"]["My #Festivus edition of the Waste Report totals $563,421,523 the federal government wasted."]["I’m back to celebrate #Festivus with some more #AiringofGrievances, this time about how the government spends your money"]["For now, consider how you can celebrate #HappyFestivus by helping others https://t.co/wEQXP9jbew"]["I’ll be back later today with some more #HappyFestivus #AiringofGrievances. DC swamp, government waste and more politicians on deck."]["@senorrinhatch Somehow, an octogenarian Mormon has better pot jokes than I do. This has been bothering me for a while. #HappyFestivus"]["Last but not least for this morning, I have an #AiringofGrievances for @senorrinhatch"]["@SenatorReid HOW IS IT YOU NEVER TOLD ME ABOUT THE ALIENS, HARRY??!!"]["@SenatorReid We argued about taxes. Fought about spending. Worked on repatriation together. I helped treat your eye injury..."]["On that same subject, I have a major #HappyFestivus #AiringofGrievances with my friend @SenatorReid"]["Was that my last #HappyFestivus #AiringofGrievances ?? https://t.co/hB8MfFAPO9"]["@tedcruz @HamillHimself I’m KIDDING, Ted. You’re likeable enough"]["@tedcruz @HamillHimself There are how many million Americans who’ve wanted to force-choke Ted, and he picked on the one who could do It. Brave, he is https://t.co/rL5c65wMoH"]["My friend @tedcruz decided to have an #AiringofGrievances early with @HamillHimself. On Star Wars opening weekend. Hmm https://t.co/msnzLeXkxn"]["I have a #HappyFestivus grievance with @ScottPruittOK. A year as @EPA director and still the toilets are NOT FIXED https://t.co/Q5Kr4um5aW"]["I want to celebrate the freedom to tweet my #AiringofGrievances. Twitter is getting a bit regulated so I wanted to show my permit https://t.co/8dNNaVpkKd"]["@FoxNews @HillaryClinton @realDonaldTrump If anyone doesn’t get that you can read about It here https://t.co/NR6cB63tmo"]["@FoxNews @HillaryClinton @realDonaldTrump That’s high praise considering he thinks the first two were both inspired by God."]["@FoxNews @HillaryClinton I hear even @realDonaldTrump loved It. He said It was the “third best book ever written”."]["@FoxNews @HillaryClinton I hear that many people are saying great thinks about Hillary’s book and It won some major major awards. That’s great for her, seriously. https://t.co/TjuIUbDniK"]["@FoxNews Speaking of Fox News, I’m going to begin the day the way they usually do, with a thought about @HillaryClinton"]["@FoxNews Declared of course. That’s the only way to do It. Right Congress? Right?"]["Before we get started, I need to alert @FoxNews and someone in DC that this is NOT a war on Christmas. It’s a war on everything else."]["Good morning, #Festivus celebrants and twitter!  Today, I will have an #AiringofGrievances to wish you a #HappyFestivus"]["You’re going to be saying #HappyFestivus again. Believe me!"]["As you all know... https://t.co/T80kTfHpC3"]["Good morning and #HappyFestivus!  Later today I will help you celebrate with some #AiringofGrievances."]["I put forward a motion that says let's obey our own rules, but it will be interesting to watch the vote and see how it turns out. Who truly cares about the debt on either side of the aisle? Who's willing to say I'm for tax cuts, but I'm also for spending restraint? https://t.co/NwHwXHnTWc"]["#ThrowbackThursday to 2012 when I spoke out against FISA in support of the 4th Amendment. I'll continue to oppose this unconstitutional abuse of power. https://t.co/vsNfHt2Mtp"]["Calling all conservatives, libertarians, and anyone who believes in limited government: call your legislatures and say don’t exceed the budget caps and vote for Rand Paul’s point of order, which will prevent us from exceeding the budget caps. https://t.co/5eOKpYDfY7"]["If the House passes a CR with a waiver of paygo budget caps, I will force a Senate vote to keep caps in place."]["I'm never a fan of shutting down government so that's not my intention. I am a fan of defending the bill of rights, though. https://t.co/qJ9Sc298Ep"]["Joining @BillHemmer on @FoxNews in a few minutes to discuss reforming  the warrantless domestic surveillance program. Will I have to filibuster this unconstitutional legislation? Tune in now!"]["I will actively oppose and filibuster any long term extension of warrantless searches of American citizens"]["Today, the Senate delivered on its promise of allowing Americans to keep more of their hard-earned money, a commitment I worked to hold it to by fighting to make sure the bill became a bigger and better tax cut and included repeal of the Obamacare individual mandate."]["ICYMI: Today I held a press conference with Senators Wyden, Lee, Leahy, and Daines to call for FISA reform. https://t.co/V6U07oUnx4"]["Live now! press conference on surveillance reform:  https://t.co/wgl8ONOOUJ"]["I hope my fellow members of Congress will join me in voting for tax reform so we can celebrate the holiday season knowing we have delivered on our promise to cut taxes and ensure you get back more of your own money. https://t.co/td2PCzvKDv"]["I agree with @realDonaldTrump - time to reject the naive nationbuilding of the neocons and try a true American First realist foreign policy."]["This isn't Capitalism. I will continue to fight for reforms that lower prescription costs and end crony capitalism. https://t.co/uBeztPfDJQ"]["For #FlashbackFriday I thought I'd share last year's Festivus #AiringofGrievances in preparation for this year.⚡️ “Senator Rand Paul’s 2016 Festivus Twitter StormSenator Rand Paul’s 2016 Festivus Twitter Storm”\n\nhttps://t.co/PIZ4IPrpzm"]["Happy #BillofRights Day. We should never forget the importance of the individual rights it protects and the constraints it puts on our government. https://t.co/GhXwOdEOqR"]["Just terrible news from Kentucky tonight on the passing of Rep. Dan Johnson. I cannot imagine his pain or the heartbreak his family is dealing with tonight. Kelley and I pray for his loved ones."]["Live now with @FreedomWorks discussing surveillance reform: https://t.co/SylDC8uNMz"]["ICYMI: I joined Senator @RonWyden to discuss the importance of 702 reform and restore our privacy rights. https://t.co/uTLaPX1tFT"]["And anything else you read about that is fake news!"]["Our problem is spending, and I intend to lead the fight for smaller government and lower spending, including opposing this week’s CR"]["I voted for tax cuts last week and I look forward to voting for the final bill next week. Tax cuts are you keeping your money."]["Hanukkah begins tonight! Happy Hanukkah to all those celebrating, have a holiday filled with hope and light. It is a holiday of miracles and gratitude for all we have. Chag sameach! https://t.co/uJafHeHvl0"]["Tax cuts — people keeping more of their money — are never the problem. The problem is spending. We should obey our rules, stop the deficit spending, and shrink government."]["I cannot in good conscience vote to add more to the already massive $20 trillion debt. I promised Kentucky to vote against reckless, deficit spending and I will do just that. https://t.co/BUYqm91mli"]["“We (gov) have made mistakes in our past, they do happen in times of war. That’s why we need government oversight, to protect our rights and the minority in thought from unlawful surveillance.” - @RandPaul with @RonWyden"]["“You shouldn’t be convicted of a  domestic crime using unconstitutional standards.” - @RandPaul #FISAreform"]["Great crowd here tonight discussing privacy rights and gov surveillance with @RonWyden @GWRepublicans and @GWCollegeDems! We must restore our rights and the 4th amendment https://t.co/Nai2GmfQa0"]["Join me and Senator @RonWyden tonight for a conversation on government surveillance, privacy, and FISA. https://t.co/JARbmjpafv"]["Of all the powers Congress has, the one that we should most jealously guard is the power to declare war. https://t.co/wfp2bEJkeu"]["This weekend, the Senate passed a tax cut to provide much needed relief to American taxpayers. As we work to send the final bill to the President, I will continue to stand up for Kentucky families. https://t.co/yGD27c2SZy"]["While I still would have preferred larger cuts, this bill provides a foundation on which to continue building. Today marks a victory for giving the American people back more of their own money and reforming an archaic tax code. https://t.co/nEgDcynrdb"]["Finance Committee Announces Improvements to Senate Tax Bill | Senator Rand Paul https://t.co/JpHwNEPBMR"]["\"The United States faces a question that it seems to want to ignore: What kind of nation are we?\"\nhttps://t.co/x08QbqEXsC"]["“As we work to reduce the massive tax burden Washington has placed on the American people, we should also stand up for their Fourth Amendment right to privacy by rejecting the bulk collection of the financial information of Americans who live overseas” https://t.co/Zgq1tgXDir"]["Earlier this week, I sat down with Fox News' Dr. Marc Siegel to discuss my ongoing recovery and tax reform: https://t.co/bZxhsroNvU"]["Great job highlighting more of the waste in Washington! https://t.co/Dsk3KXFO4T"]["One of Washington's biggest problems is thinking the money you make belongs to the government. I believe it's the other way around. https://t.co/BNiN6XDypT"]["Here's why I plan to vote for the Senate tax bill (and my colleagues should step up) https://t.co/RebAQZvnh0"]["A little Thanksgiving night reading!  https://t.co/mYztHnCYFO"]["Happy Thanksgiving. I hope you're enjoying time with family and friends. https://t.co/sABo2rGghz"]["https://t.co/y5oJ9p7FQ9"]["Kelley and I wanted to give you all an update and wish you a Happy Thanksgiving. https://t.co/ZyA7mRk3fk"]["Many thanks for the good wishes @SarahPalinUSA. Always  great to visit with you! https://t.co/Wdz0eApQno"]["This will help ensure House acceptance of the Senate plan as leaders there have stated they will not accept a plan with no state and local deductibility. Repeal the mandate fix problems with Senate bill through more tax cuts for all and help ensure House and Senate plans agree."]["My amendment will fix a problem in the Senate bill where many taxpayers would see a tax increase because of the loss of state and local deductions.\n\nI will introduce a similar deduction as the House plan, making the tax reform plan more fair for everyone."]["Today I am announcing my intention to amend the Senate tax bill to repeal the individual mandate and provide bigger tax cuts for middle income taxpayers.\n\nThe mandate repeal is a promise we all made and we should keep. It also allows an additional $300 billion+ in tax cuts."]["I voted against Steven Bradbury’s nomination because you shouldn’t get to author memos on torturing people &amp; then get another government job"]["Kelley and I want to thank everyone once again for your thoughts and prayers for my recovery. While I’m still in a good deal of pain, I will be returning to work in the Senate today, ready to fight for liberty and help move forward with tax cuts in the coming days and weeks."]["https://t.co/cR67A1qqDT"]["https://t.co/NrNi0L9AjZ"]["I appreciate all of the support from everyone. A medical update: final report indicates six broken ribs &amp; new X-ray shows a pleural effusion"]["Kelley and I appreciate the overwhelming support after Friday’s unfortunate event. Thank you for your thoughts and prayers."]["Spoke with @FoxNews' Bill Hemmer today about reforms for our immigration system and lowering taxes.\n\nhttps://t.co/CYFg44uOxm"]["Let’s do this @realDonaldTrump - - - and pass the biggest, boldest tax cuts possible! https://t.co/U9wMEY9VzS"]["Let's pass big and bold tax cuts now! https://t.co/J42MeyEq8G"]["Horrific news out of New York. We stand united against extremism and with the victim and their families."]["The debt is now even more frightening: $20 trillion. Happy Halloween https://t.co/MEAQuhi4IH"]["Initiation of war comes from Congress, and I believe that very strongly. https://t.co/5q1otOQjR1"]["Enjoyed touring the new Bilstein Cold Rolled Steel plant in Bowling Green this morning &amp; meeting with their leadership. https://t.co/tcUNMVP2zc"]["ICYMI: I joined @KasieDC to talk tax reform. I want everybody to have a tax cut across the board. I think it's a big mistake if we don't. https://t.co/uORZ7B4Zlx"]["The Battle Over The Government’s Massive Surveillance Powers Has Arrived https://t.co/1MnmIQuSV8 via @dailycaller"]["I look forward to working with him and my congressional colleagues to pass the biggest, boldest tax cut possible. https://t.co/07Oc5vExAy"]["On the Senate floor making a budget point of order. We should cut other spending to pay for emergencies, not keep borrowing. Vote to follow."]["https://t.co/oQgmKCDMFq"]["On the Senate floor now, speaking about debt and how we handle emergency spending. We should cut waste or other programs to pay for it"]["You know you are in too many wars in too many places when even warmonger Lindsay Graham can’t keep track anymore"]["I’m all in for tax cuts @realDonaldTrump. The biggest, boldest cuts possible - and soon!"]["Rather than bicker over raising taxes on some people and lowering taxes on other people, we should cut everyone's taxes. https://t.co/PD3SXA4elT"]["Republicans promised to repeal all of Obamacare, root and branch, they promised to repeal not block grant. Tonight I present another chance. https://t.co/qKMUJYY8Ff"]["What I'm asking us to do is be responsible, budget for this, actually act like we really believe in what we say that the debt is a problem. https://t.co/SsDtWayxHt"]["It's budget vote-o-rama night. This amendment would allow instructions so we will do what we say we are going to do which is cut spending. https://t.co/BjsFsDHjku"]["Nearly all Republican Senators just failed a litmus test on cutting spending."]["It is a simple, but important, change they could easily make. The ball is in their court."]["I have told the White House and GOP leaders that if they simply stick to their own caps, the rest of the Budget is fine and I’ll vote yes."]["Senators McCain and Graham are torpedoing the budget by insisting on busting the budget caps for more spending."]["Great article from @feeonline: Freedom or coercion: these are the two paths. The first works; the second doesn’t. https://t.co/bl87aSfg7Q"]["Excited to celebrate @realDonaldTrump's decision this week to allow individuals to buy health insurance across state lines. #AHP https://t.co/q7BWNgvheE"]["Proud to have worked on this with @realDonaldTrump - this plan will help so many. We will make the consumer king, not insurance companies! https://t.co/nEG3T32l5R"]["Rand Paul Squashes the Idea that Trump's New Healthcare Order Will Hurt the Poor https://t.co/XUkyhBtYQ9"]["Looking forward to joining @seanhannity on his radio program at 430pm ET to discuss our big win on AHPs."]["Millions of people who now go it alone or in very small groups will join together and make the CONSUMER THE KING https://t.co/cBPaClGsam"]["Congress can't allow the White House enforce secret laws https://t.co/cwaVhli8d7"]["Rand Paul says he’s been “working with Trump for months” on the next health care move https://t.co/w4ttfEFEdb"]["Rand Paul and Trump team up on health care https://t.co/RLyDdgw7n3"]["This will be a great plan &amp; a big deal for millions of Americans. I’ve been working with @realDonaldTrump for months on this. Details soon! https://t.co/pvwf5K8XIU"]["Condolences and prayers for the family of former KY Sen. Dick Roeding. A good man who fought for conservative values and for Kentucky."]["Cut Taxes For All! https://t.co/GJs1oEOBkm"]["Sen. Rand Paul: Cut Taxes For All! https://t.co/2bPV28uXjA"]["Proud to join Senators Hatch, Lee, Cruz and Perdue for criminal justice reform. Read more here: https://t.co/C6pqwNerTJ https://t.co/wlu70Zz8Bn"]["Hopes reignite for criminal justice reform https://t.co/jVbJueCuUk"]["This is a GOP tax plan? Possibly 30% of middle class gets a tax hike? I hope the final details are better than this. https://t.co/lcjkI4YRz8"]["Tragic news out of Las Vegas this morning. Kelley and I send our prayers and deepest condolences to all those affected."]["Praying for the victims and first responders in Las Vegas and our country right now. This shooting was a horrible and cowardly act."]["#FlashbackFriday I've been fighting to balance the budget since day 1 in the senate and I'll continue to do so. https://t.co/eMU0Zqr2AW"]["Conservatives are still fighting for free-market reforms to the health care system. https://t.co/OuKImuC5Zd"]["It was great to see coach Cal in D.C. today! https://t.co/yNRZbsAHvy"]["President Trump To Back Rand Paul Health Care Proposal | The Liberty Conservative https://t.co/btXWJ8EExH"]["Congratulations to @MooreSenate on his impressive victory tonight."]["Rand Paul: How to Achieve Peace on the Korean Peninsula https://t.co/J3I5qzawNh"]["Senator Rand Paul Confirms His Graham/Cassidy Demands - https://t.co/GMGwzKjhim"]["I'm on with @jaketapper right now on @CNN . Tune in!"]["Thanks @ncfl for meeting this AM in Louisville. Glad to learn more about efforts to improve literacy &amp; empower parents/family learning. https://t.co/4XtqecKDIW"]["Rand Paul praises Braidy Industries: \"an exciting time to be in Ashland\" https://t.co/kSKvWYMcEZ"]["Good to see @MooreSenate gets it. He won't vote for fake repeal! Roy Moore Speaks Out Against Graham-Cassidy.  https://t.co/ii1nTyQFDp"]["Calling a bill that KEEPS most of Obamacare \"repeal\" doesn't make it true. That's what the swamp does. I won't be bribed or bullied."]["I won't vote for Obamacare Lite that keeps 90% of the taxes &amp; spending just so some people can claim credit for something that didn't happen"]["No one is more opposed to Obamacare than I am, and I've voted multiple times for repeal.  The current bill isn't repeal."]["Last stop today was in Prestonsburg to discuss rural healthcare issues at Highlands Regional Hospital, including their future with ARH. https://t.co/pRw9llimln"]["Roundtables like today's in Maysville are important opportunities for me to listen to constituents and find solutions to their issues. https://t.co/d1TZLXPuCy"]["Thanks to all the local leaders who joined me in Morehead for a roundtable discussion on the issues facing their community. https://t.co/AvfIyEZeSW"]["Great meeting with @braidyinc in Ashland today to learn more about their progress &amp; future job creation here in KY! https://t.co/mZLsLuul6q"]["Block Granting and renaming a trillion dollars in spending is not #ObamacareRepeal"]["If #GrahamCassidy is \"federalism,\" would Bernie's Medicare for all be federalism if we block grant it? #ObamacareAmnesty  #ObamacareLite"]["Agreed. https://t.co/0xeHFY8I1a"]["We have to stop our foreign policy of endless war and I'll continue to fight for that. #PeaceDay https://t.co/AngFEQblEb"]["How Graham-Cassidy’s Funding Formula Gives DC Unprecedented Power https://t.co/Pnh72749GX"]["Sorry Republicans, this is not the Obamacare repeal we were promised | Rare https://t.co/aDKk8neOJJ"]["This new \"gang\" bill is another Grahamnesty, this time for Obamacare.  Conservatives have seen this before."]["How on earth could a trillion dollar appropriation be considered conservative or a repeal of Obamacare? It is neither"]["The #GrahamCassidy Obamacare Amnesty bill would be one of the largest new appropriations in our history, costing taxpayers over $1 Trillion"]["Also currently working with the President to finalize better replacement with cross state purchase of inexpensive insurance. Coming soon!"]["#GrahamCassidy is amnesty for Obamacare. It keeps it, it does not repeal it. I will keep working with the President for real repeal."]["Huge congratulations to my friend @IngrahamAngle on getting her own show on @FoxNews https://t.co/06Zog8VxKm"]["I was thinking this all sounds familiar...amnesty?#GrahamCassidyِ: Amnesty for Obamacare."]["Graham Cassidy is not federalism and it is not repeal. It is Obamacare Lite!"]["Federalism would be states deciding how much to spend, whether to tax and spend."]["Federalism is the 10th amendment. Powers not granted to fed gov't reserved to states. Not tax and disburse from fed government"]["Is keeping 90% of Obamacare taxes and spending then block granting it federalism? I think not! #GrahamCassidyBill"]["Their sales pitch is, “If you like your ObamaCare, you can keep it.” Read my latest on @FoxNewsOpinion | https://t.co/KehIRG5Ni3"]["Sen. Rand Paul: Graham/Cassidy does NOT repeal ObamaCare and I oppose it https://t.co/X92uHlENwQ"]["In Crestwood this AM meeting with Direct Primary Care providers, discussing how they provide affordable, patient centered healthcare. https://t.co/VjVyzxOVds"]["Keeping 90% of Obamacare is not ok and it's not what we ran on. Conservatives should say no."]["Graham/Cassidy keeps Obamacare and tells the states to run it. No thanks."]["Great day in Kentucky. Ended w/ a healthcare round table in Russell Springs then met with a great local business &amp; families in Bowling Green https://t.co/W6ODmDo4WR"]["When govt increases ur taxes a trillion &amp; then block grants the $ to the states that's not federalism that's still big govt. #grahamCassidy"]["#GrahamCassidy keeps Obamacare and redistributes money from dem states to republican states."]["#GrahamCassidy sales pitch: if you like your Obamacare you can keep your Obamacare. No thanks."]["@BillCassidy .@BillCassidy it keeps 90% of Obamacare spending and 90% of Obamacare taxes. No thanks."]["Discussing healthcare in Danville w/ local leaders. We need more healthcare freedom so individuals &amp; businesses decide what's best for them https://t.co/QCIOOr05eq"]["Why continue putting out bills breaking our promise to repeal.?  #GrahamCassidy redistributes, doesn't repeal. It is more Obamacare Lite!"]["Started today in Kentucky with a tour of @Toyota. They employ over 8,200 Kentuckians. I'll continue to fight for pro business solutions. https://t.co/0z58B672sI"]["Sen. Rand Paul: I'm still encouraged by tax reform https://t.co/8AtyRbNPGQ"]["I can't support a bill that keeps 90% of Obamacare in place. #GrahamCassidy is not repeal or replace, it is more Obamacare Lite"]["Today, U.S. Senator Rand Paul forced the US Senate to hold its first vote addressing an AUMF since 2002. Read here: https://t.co/9OjKO9wN6X https://t.co/bJgbvYV5hv"]["I appreciate @cspan clearly defining to everyone watching what every vote to table means. Yes to table = vote kill my amendment https://t.co/jORnkL8A3k"]["I urge the senate to adopt my amendment...There will be no real debate on war unless we pass this resolution. I yield back my time. https://t.co/YYsCacN3Ft"]["Mine is a vote to say, the gives the power to the legislature. That's what this vote is about. https://t.co/iITy1Wkken"]["This is a victory for the constitution. I look forward to the vote and urge my colleagues to join me. Full release: https://t.co/2sNKhPPI58 https://t.co/GjyYOYuPhu"]["We can defend without question against all invaders. And yet, we are not very good at making countries out of places that aren't. https://t.co/tHjEa9wRaC"]["Today's vote is a vote on whether congress will step up and do its job. https://t.co/Zh0nNyrfpj"]["The question is, will the senators, will those who gather to vote, will they stand for the rule of law? https://t.co/JytSt0adSE"]["Will they stand for the rule of law? Will the senators stand for congressional authority for war? https://t.co/F6IorS1t3R"]["We need to look at our country and say, it's time we did things for our country. https://t.co/ZnFpm4tv8t"]["I rise today to oppose unauthorized, undeclared and unconstitutional war... https://t.co/yIO0BqIIuq"]["Rand Paul's Maneuver Against Endless Wars https://t.co/wiKxPwTBk8"]["I will continue to fight, and if necessary, object, to continue this debate , secure a vote and force Congress to do its duty."]["Senate leaders have agreed not to try to end debate early, and have agreed to four hours of debate under my control to debate these wars."]["The Senate attempted to shorten debate &amp; move forward without consideration &amp; debate on my amendment to end our AUMF in Afghanistan and Iraq"]["Where is the anti-war left demanding the wars end? Where is the constitional conservative right demanding Congress reclaim its war powers?"]["Hypocrites, they pretend concern over our constitutional duty to declare war and then block any vote on ending any of our 7 current wars"]["I sit for our soldiers young and brave. Sent to fight in distant lands in our forgotten, forever war"]["I will continue this protest and these objections for as long as needed to ensure Congress do its duty, and vote on ending these wars."]["The Senate is now in a quorum call, unable to act because of my protest. This is why I sit on the floor, in silent protest."]["We have been there for 16 years. It is time for them to end. It is time for Congress to vote on whether or not they should end."]["Tonight I sit silently to protest the thousands of American soldiers who have died over the past decade in these wars."]["An attempt was made to run the clock on the bill overnight. I objected and am now sitting on the floor of the Senate to stop that"]["I will object to all procedural motions and amendments unless and until my amendment is made in order and we vote on these wars"]["Tonight, the Senate is attempting to move forward with the Defense Bill. I am seeking an amendment to end the AUMF in Afghanistan and Iraq."]["Why we must repeal the 16-year-old Authorization for the Use of Military Force https://t.co/ZNlizfmmFc"]["Let’s #neverforget those lost on #September11 and honor those who fight to defend us. I pray we work together for peace."]["Proud to have the support of law enforcement leaders on our bipartisan work with @SenKamalaHarris for bail reform https://t.co/HaBwrOMKAF"]["money stolen from civil asset forfeiture being used for catering. Asset forfeiture needs to end and I'll continue to fight for reform. https://t.co/apV1AFoPIS"]["I am headed to the Senate floor now to discuss my American First amendment to pay for Hurricane spending with cuts to spending overseas."]["Rand Paul to Fight Linking Harvey Relief Funding and Debt Ceiling with ‘America First’ Amendment-Big League Politics https://t.co/1Z3wn2Mr5s"]["We should include efforts to reduce and reform immigration in other areas at the same time. Congress will need to address this problem."]["There are ways to make sure people who have been here for many years since childhood are allowed to stay."]["President Obama's executive order was illegal. However, this is a real problem we should solve in a bipartisan fashion. #DACA"]["Human life is not expendable. This is why I continually oppose US-Saudi arms deals. https://t.co/QauqR0OCwi"]["I'm ready to fight for tax reform https://t.co/qEV8M2mthe"]["To support our local police we must realize they aren’t soldiers. But the line between the two is being eroded. https://t.co/lBHhjD2Nbn"]["America should reject the false appeal of socialism https://t.co/d7ZSVKwxSo"]["Rand Paul is Opposing Trump's Reversal on Surplus Military Equipment https://t.co/rsIbvokLIw"]["No, the feds shouldn’t give war machines to the police | New York Post https://t.co/bnzt5OHClP"]["All will be major issues this fall. Any order today still needs to be funded and I'll bring this issue to the Senate floor."]["I will oppose this move by the AG and administration. And I will continue to fight for our civil liberties and criminal justice reform."]["It's one thing for fed officials to work w/ local authorities to reduce or solve crime. It's another for them to subsidize militarization."]["The militarization of our law enforcement is due to an unprecedented expansion of government power in this realm."]["Americans must never sacrifice their liberty for an illusive and dangerous, or false, security. I disagree with AG Jeff Sessions on 1033..."]["Please keep the people of Texas in your thoughts and prayers and donate to relief efforts if you can. https://t.co/KAO98bVymT"]["Rand Paul: Don’t raise the debt ceiling without reform https://t.co/Fbp4nDhm9V"]["Let’s shock the establishment https://t.co/lgAbKc7vzd"]["16 years on, it's past time to bring our troops home from Afghanistan https://t.co/W3KKxSimZv"]["OPINION | Sen. Rand Paul: 16 years on, it's past time to bring our troops home from Afghanistan | TheHill https://t.co/yQIK0cqQY9"]["Nation building should not be our job &amp; it has consistently been a fool’s errand for us particularly in this region. https://t.co/yQIK0cqQY9"]["The mission in Afghanistan has lost its purpose...Read my full statement here: https://t.co/aaAfHhxhF0"]["It’s Time To Audit The Fed https://t.co/6Xkb6l6OhF"]["Let us take our case for a Balanced Budget Amendment to the American people and finally get it done. https://t.co/m2FghyE6OG"]["Rand Paul: 'Big Government' Needs to Back Off of Hemp https://t.co/jxScLcRyGp"]["“...if we want to fix health care, we have to have sufficient confidence in what made us a great country,”  https://t.co/RbvR9kZmTS"]["So much liberty on the stage tonight at the Champions of Liberty rally in NKY! https://t.co/VM7F2l8qXJ"]["In Owenton I heard from several physicians who provide through direct primary care &amp; are able to offer much cheaper, accessible healthcare. https://t.co/g1O4S8zYDZ"]["Great front page story from @OwensboroMI on my healthcare roundtable there yesterday.  https://t.co/5LHCn9m1Ag https://t.co/l3YqySHdTs"]["In Marion, many people are concerned about overregulation of their small businesses- we need to get govt out of the way so they can succeed! https://t.co/gNjJu0m0fe"]["In Paducah we covered many issues - healthcare, tax reform, and foreign policy. Spoke to media after about my Association Health Plan idea. https://t.co/soWp49KsyD"]["Talked about the need for a truly free market in healthcare &amp; answered Qs on big pharma/crony capitalism during my visit to Fulton, KY. https://t.co/Oy351V2HZd"]["Thanks to Joe Kelly for showing me his organic industrial hemp crop this morning in Murray, KY! https://t.co/T0J55sYRpz"]["Earlier this week I visited Bell County to meet with fellow physicians &amp; medical professionals at Middlesboro ARH  - https://t.co/O1mL5WzXTp https://t.co/bSGc9W9YGH"]["Today's least shocking news...This isn't the kind of bipartisanship we need. https://t.co/UwVfCnA4Gp"]["Last stop today at Orthodyne Physical Therapy in Campbellsville - talking about their legislative priorities &amp; rehabilitation efforts. https://t.co/I4DAYMVTjK"]["Great to be back in Somerset, KY meeting with local officials and community leaders! https://t.co/HJJDyDLils"]["Meeting now with business leaders and local healthcare industry leadership in Hazard, KY. Discussing health issues impacting EKY. https://t.co/m7ecvxSwVe"]["Traveling through Eastern Kentucky to discuss healthcare reform &amp; listen to concerns of local communities. First stop Pikeville! https://t.co/xyQbGROsvw"]["Rand Paul: 'We Can't Live In Fear Of Our Own Intelligence Community' https://t.co/zb7TlYiU6I"]["https://t.co/p4k7Ofn56g https://t.co/I92q7UlbX8"]["Rand Paul: Health care battle not over - Insider Louisville https://t.co/chGED6A5Ce"]["I, Pencil is perfect for #WednesdayWisdom and brilliantly explains how markets function w/out gov intervention https://t.co/A18dIW5spp"]["Rand Paul blasts Senate colleagues over healthcare: 'They are just afraid' https://t.co/B6wZfz5uMi"]["Yesterday I joined Kentuckians to discuss idea to fix healthcare. https://t.co/7g7iQvgrie"]["Thrilled to be joining @yaf tonight at their National Conservative Student Conference! The next generation of liberty lovers! https://t.co/MvIGJA9G1o"]["In Elizabethtown, KY this morning discussing association health plans with small business owners and listening to their ideas for reform https://t.co/zBFdSF7Kqj"]["The Senate fell one vote short tonight, which is disappointing. I intend to keep fighting for repeal."]["This week, I voted multiple times to repeal Obamacare, including offering my own clean repeal bill."]["5. Expand HSA (larger maximum contributions)\n6.  Push and fund expansion of 1332 waivers for states to opt out of many regulations"]["3. Repeal 3 years of medical device tax \n4.  Defund Planned Parenthood for 1 year"]["The next healthcare vote will be soon. The bill will: \n1. Repeal Individual Mandate tax/penalty\n2. Repeal the job killing Employer mandate"]["Just voted YES on the Heller Amdt. to permanently repeal the burdensome \"Cadillac\" tax on health insurance plans"]["830 vote is to repeal the Cadillac tax, an Obamacare tax that increases costs of insurance &amp; costs job creators and workers billions."]["Thrilled that the officers who saved so many lives on the morning of the congressional baseball shooting got honored w/ the Medal of Valor! https://t.co/NYsRgD4YqY"]["I am grateful to these first responders, and join @realDonaldTrump in honoring them today. https://t.co/hBrYdpRUKk"]["Watch: Senators from the right and the left come together for criminal justice reform https://t.co/zeLzzR6UFK"]["Proud of the bipartisan work Sen @KamalaHarris and I are doing. We joined @JakeTapper recently to discuss some much needed justice reforms. https://t.co/PxWk6ShryL"]["\"If you're a US citizen or a green card holder I think obscene to have your phone searched to get back into the country\" Sen Paul at Cato"]["\"At the very least they should have to get a warrant for the data collection of Americans\" - Sen Paul at @CatoInstitute"]["\"We have lowered the standard for data collection. I am absolutely opposed to lowering data collection standards on Americans.\" Sen Paul"]["\"702 needs an expiration date\" - Sen @RonWyden live with Sen Paul at @CatoInstitute \n\nAgree!"]["\"When there's an attack on our country all of these policies that make us less safe and sacrifice our liberties come out\" Sen Wyden @ Cato"]["\"I think they accept if you have nothing to hide you have nothing fear and it's a bizarre sort of notion.\" RP live @ @CatoInstitute"]["Live with Senator Paul and Senator @RonWyden at @CatoInstitute talking surveillance reform. Watch here: https://t.co/wxm85lZiYr https://t.co/TP9r8PC2s7"]["The “skinny repeal” strategy on Obamacare is a victory for the tea party and transparency https://t.co/YQlv0mLb3m"]["Joining @TeamCavuto shortly on @FoxNews. Tune in!"]["It's the \"obamacare repeal\" act as introduced by Sen paul tonight. The vote will be tomorrow around noon. https://t.co/Xd7PMulaMl"]["Rand Paul Wins Big on ‘Skinny Repeal’ After Multiple Meetings With Trump - Big League Politics https://t.co/D5k3RSxGZX"]["Today we took the first steps to repeal Obamacare. Here's my statement after today's #healthcare vote. https://t.co/ph3VqcYAtv"]["@SenateMajLdr @realDonaldTrump If this is indeed the plan, I will vote to proceed and I will vote for any all measures that are clean repeal."]["@SenateMajLdr Repealing mandates &amp; taxes, without new spending and bailouts. This is the path I've been urging, and what I discussed with @realDonaldTrump"]["@SenateMajLdr If we cannot pass full, clean 2015 repeal, I've also been told we will vote on whatever version of CLEAN repeal we can pass."]["@SenateMajLdr I've been told by leadership their bill would now need 60 votes to pass, votes they do not have. Therefore I believe it will fail."]["@SenateMajLdr If that is the plan, I will vote to proceed to have this vote. I also now believe we will be able to defeat the new spending and bailouts."]["This morning, @SenateMajLdr informed me that the plan for today is to take up the 2015 clean repeal bill as I've urged."]["Joining @FoxNews now to talk healthcare https://t.co/9EMfqaEml5"]["@realDonaldTrump Asset forfeiture is an unconstitutional  taking of property without trial. It's wrong and I call on the AG and the Adminsitraion to stop."]["@realDonaldTrump What I'm most concerned about though is the Attorney General's actions yesterday to push forward with federal asset forfeiture."]["I agree with @realDonaldTrump, his Attorney General should not have recused himself over reported incidental contacts with Russian officials"]["To @SenJohnMcCain and his family: Kelley and I will pray for you and your family, and we hope for a full recovery for you."]["ICYMI today I did a health care Q&amp;A on Facebook live: https://t.co/F8qARbFZ6f"]["Rand Paul: Time to repeal Obamacare https://t.co/0TjlPs3n79"]["The 2015 clean repeal is far better; it simply offers repeal and a two-year window to fix our broken system. https://t.co/0TjlPs3n79"]["Looking forward to joining @marthamaccallum on @FoxNews tonight at 7pm ET. Tune in for a discussion on why we need to repeal Obamacare now! https://t.co/AtwXSF9v81"]["Always great to visit with my good friend @EagleEdMartin and the #eaglecollegians! https://t.co/zVQpQwuAPe"]["I’m looking at every one of the dozens of votes my “team” cast when President Obama was in office to REPEAL. https://t.co/YwBRU3oAxY"]["As @realDonaldTrump and I discussed last week. Clean repeal now! https://t.co/o2V7DeIv4k"]["Retaining instead of repealing Obamacare will be Republicans’ undoing https://t.co/yzyWaoqaie"]["Sens. Paul and McConnell Reintroduce Economic Freedom Zones Act. Read more here: https://t.co/VvaIr7yAD2 https://t.co/1WdtFXHksW"]["Crony capitalism isn't a right. Read more here: https://t.co/95oNnb60XY https://t.co/IgBw9zD5WD"]["Crony capitalism is enshrined as a \"right\" by the new GOP Obamacare bill, while that bill...https://t.co/6xKRsI9QdY"]["Meet the new bill, same as the old bill (but with fewer tax cuts, more spending and a bigger bailout)  https://t.co/XKysr6Yyo2"]["Read more on why I'll vote no on the #HealthcareBill as it stands: https://t.co/2BdTKjG6gW https://t.co/2no2Q8M2DY"]["Obamacare regulations? Still here. Taxes? Many still in place, totaling hundreds of billions of dollars. https://t.co/2BdTKjG6gW"]["Thanks to the many representatives of Kentucky groups who joined me in Louisville today to talk about Association Health Plans! https://t.co/voVCvh5Hdw"]["Looking forward to joining @johnrobertsFox shortly on @FoxNewsSunday Tune in! https://t.co/3mtMF782PS"]["Tune in to @marthamaccallum tonight to hear me talk about how to split the healthcare debate up and break the impasse on repeal."]["I sent a letter to the President and senate leadership outlining healthcare changes I'd like to see. Read it here: https://t.co/AZ3sXuwd5A"]["Just came from WH. @realDonaldTrump is open to making bill better. Is Senate leadership?"]["@realDonaldTrump I'll discuss w/ him how to fix bill &amp; get more to a YES on real repeal, things I've tried to tell Senate leaders with no result so far"]["Headed to meet with @realDonaldTrump this afternoon. The bill is currently not real repeal and needs major improvement."]["I'll be on @ThisWeekABC today talking about health care, my opposition to the Senate bill &amp; what real Obamacare Repeal would look like."]["Very glad to hear Matt is going home. As his family notes, the heroism of the Capitol Police saved so many. Thank you @CapitolPolice https://t.co/L18F1g9AA9"]["I will be joining @Morning_Joe at 645AM and @TODAYshow at 7AM. Tune in as we discuss the need for real repeal of Obamacare!"]["I will oppose the #healthcarebill coming to the floor in its current form, but I remain open to negotiations."]["The current #healthcarebill does not repeal Obamacare. It does not keep our promises to the American people."]["Today I join senators Lee, Johnson, and Cruz in opposition to the #HealthcareBill. Read here: https://t.co/vo6lvirree https://t.co/FF9ChIBaBA"]["Enough with rushed, secret legislation! Today I reintroduced my Read the Bills resolution. Read more here: https://t.co/p1CmeL8vqd"]["Thrilled that @Ford had decided to bring additional jobs to Kentucky! https://t.co/WknbTKWUwL"]["Enjoyed stopping by Gordon Food Services in Shepherdsville, KY this morning to tour the facility &amp; talk to employees. https://t.co/hyha6vQovM"]["\"Our gov can protect national security while still preserving Americans rights to free speech and free association.\" https://t.co/xvDmNFtZoQ"]["Officer David Bailey saved many lives yesterday along with his partner. Today he threw out the 1st pitch at #CongressionalBaseballGame . https://t.co/OyLquLqM1A"]["It's a beautiful day at Nationals stadium. @seanhannity joined me on the field for some fair and balanced practice! #CongressionalBaseball https://t.co/6okH8FKr6O"][".@KelleyAshbyPaul &amp; I are praying for all injured in today's tragedy, particularly for Matt Mika in critical condition still."]["My statement on the shooting this AM in Alexandria. https://t.co/jrZxdqTchD"]["U.S. Senate Votes on Blocking Portion of Arms Sale to Saudi Arabia | read more here: https://t.co/5Ew8RdKTpj https://t.co/cR21QgfcpT"]["We can't make them be like us, but we don't have to encourage their behavior by giving them weapons that may fall into the hands of enemies. https://t.co/Bh9GiL3Lsq"]["Saudi Arabia is not a reliable ally. Saudi Arabia should not get these weapons. https://t.co/zfBUDpiWKO"]["I don't think we should sell arms to Saudi Arabia if it might wind up in the hands of ISIS and if they punish people for protests... https://t.co/JP1VV1zWRz"]["Today we will discuss an arms sale to Saudi Arabia that threatens the lives of millions of Yemenis... https://t.co/aX56BIvg6Q"]["There is an abundance of evidence that high level Saudis were complicit in 9/11. The 28 pages show that. Why would we give them arms?"]["Today we discuss issues of war and peace. https://t.co/ZScXseQEum"]["We should be attempting to end the aquisition of ballistic missiles from both Iran and Saudi Arabia not fueling an arms race."]["Even @HillaryClinton when she is speaking honestly in emails, noted the Saudis have supported terrorism. Why would we give them anything?"]["And we are going to give them weapons? I say no."]["We must stand up and tell Saudi Arabia ENOUGH. They are the biggest exporter of extremism and hatred in the world."]["We can't fix every problem in the world. But today we can vote to not make one huge crisis worse."]["17 million live in edge of starvation. Crisis may well be worse than Syria. And our country is going to further arm one side of this war"]["What can we do to help all those dying in Yemen? This is a huge humanitarian crisis. Children are dying from war and blockages by Saudis"]["They can't avoid the vote today. I forced it through a privileged motion. So let's talk about whether or not to arm Saudi Arabia"]["Today we will discuss issues of war &amp; peace, which we rarely do. We have been in conflict over 15 years."]["Saudi Arabia is causing a humanitarian crisis with a war in Yemen. It funds extremism worldwide. Abuses human rights. Stop arming them now."]["The vote will be close.  It is time we stop the counterproductive and harmful practice of arming a country that promotes extremism"]["Heading to the floor to speak on my Resolution of Disapproval on selling arms to Saudi Arabia."]["Senate Democrats join with Rand Paul to oppose Saudi arms sale - https://t.co/B1YC74TuJY https://t.co/fMAqaLarDc"]["Joining @jaketapper on @CNN right now to discuss why we should block the latest arms sales to Saudi Arabia. Tune in!"]["Giving the accused their day in court isn’t a suggestion. That's why I reintroduced 6th Amendment Preservation Act: https://t.co/Qv8ODNfZmy"]["Hosting some liberty loving reporters today! @mkibbe @MattWelch @RiEleDavis https://t.co/L3bTjTv86d"]["Happy #HempHistoryWeek! Proud to be a strong advocate for the deregulation of industrial hemp so KY farmers can reap the economic benefits."]["Looking forward to joining @foxandfriends at 835am ET. Tune in!"]["I applaud @realDonaldTrump for wanting to privatize the air traffic control system! Modernize, privatize and optimize!"]["I agree with my friend @RepMarkMeadows https://t.co/PHv9FlX2wu"]["Happy to see @FreedomWorks supporting the Reset Act! https://t.co/ihCQ92z6Pm"]["This action by @realDonaldTrump is great news for the economy and could save as many as 6 million U.S. jobs."]["I look forward to continuing to support policies that protect both our jobs and our environment instead of sacrificing one for the other."]["Thank you @realDonaldTrump for keeping your promise on Paris Agreement &amp; protecting KY jobs from a bad deal. @FriendsofCoalKY"]["Happy Birthday, Kentucky! Celebrating 225 years of statehood today! #KY225"]["#MemorialDay we honor brave men/women who made the ultimate sacrifice for our country. Always remember the cost of war &amp; cherish their lives"]["Kentucky lost a true hero.  Senator Bunning was fearless on the mound and in the halls of Congress. He will be missed."]["Let's do it @realDonaldTrump. Time to get out of this bad deal for US jobs https://t.co/MEfHSdBPhO"]["Our criminal justice system needs to be reformed now! I look forward to bipartisan solutions. Cc: @SenKamalaHarris https://t.co/j05LDI91uj"]["I applaud @realDonaldTrump for holding NATO leaders accountable.They need to pay their fair share! We shouldn't be subsidizing other nations"]["Earlier I joined @TeamCavuto to discuss my intent on blocking new arms sales to Saudi Arabia! https://t.co/lgjdR037uK"]["Joining @TeamCavuto on @FoxBusiness at 12:15pm ET to discuss why we need to oppose the proposed arms sale to Saudi Arabia. Tune in!"]["Rand Paul Explains Move to Force Vote Opposing Saudi Weapons Deal: https://t.co/AlcNxmRNnL"]["Meeting with Van Meter Insurance of Houchens Insurance Group this AM in Bowling Green to discuss healthcare reform from their perspective. https://t.co/1Jxuis2DSd"]["In Ashland today answering Qs from fellow physicians and medical professionals about the current status and future of healthcare reform. https://t.co/sENyaVn3Z0"]["Yesterday the REINS Act passed in committee. This is great step toward much needed relief for American businesses: https://t.co/K2JmPQzMUy https://t.co/7yoLPtEGhs"]["This legislation demonstrates, Congress can come together in a bipartisan fashion to change these laws. https://t.co/cnnftTK8dG"]["Congress can and should come together in a bipartisan way to pass this bill on fixing sentencing reform  https://t.co/fJ4NQvUGNR"]["Mandatory minimum sentences have unfairly and disproportionately incarcerated too many minorities for too long. https://t.co/gLcrkecfQl"]["Today I released the following statement in response to Attorney General Jeff Sessions. https://t.co/P3uo04xF0M"]["Congratulations to @Corning on their $200M investment from Apple! I visited their impressive plant in Harrodsburg, KY last month."]["Today I joined @wolfblitzer to discuss Comey's firing.Hypocrisy is so thick around here you can cut it with a knife\nhttps://t.co/H6fDI1M3hF"]["Thrilled to welcome KY Honor flight veterans to Washington! Thank you for your service. https://t.co/fcUK1FNQbg"]["Hypocrisy and fake outrage? Dems had been calling for months for the firing of Comey!"]["I was not a huge Comey fan, he politicized investigations, both sides of the aisle lost confidence in him. Lots of crocodile tears in dc"]["I have formally requested from the WH and the Intel Committees info on whether I was surveilled by Obama admin and or the Intel community!"]["Did the Obama admin use warrantless \"wiretapping\" on other candidates besides @realDonaldTrump? https://t.co/h7rsjvNLHM"]["Did the Obama admin go after presidential candidates, members of Congress, journalists, clergy, lawyers, fed judges? https://t.co/h7rsjvNLHM"]["I'll be joining @TeamCavuto shortly on @FoxNews! Tune in"]["The omnibus bill simply spends too much while fixing too little. Current spending will add over $500 billion to debt this year. I voted NO!"]["I voted against the $1 trillion omnibus spending bill. Kentuckians sent me to DC to fight out-of-control debt!"]["Washington believes it is an economics-free zone, where basic principles and common sense simply don’t apply. https://t.co/EsJEejTpas"]["In Louisville for a roundtable discussion of market-based, patient-centered healthcare reform policies including association health plans https://t.co/XO0mUtMHpp"]["Government agents should not profit from seizing property, especially if that property was taken from the innocent. https://t.co/WUmRWRxRP9"]["At 2PM I'll testify at @gopoversight on the damage done by FATCA &amp; call on Congress to pass my repeal legislation. https://t.co/NTbjx7IeVD"]["Sen. Rand Paul talks healthcare reform with doctors: https://t.co/sAAQD2sEmY"]["Congrats to my friend @ericbolling for getting his own show on @FoxNews #liberty"]["Holding a roundtable with Alltech employees and executives in Nicholasville, KY to discuss regulatory and tax reforms for businesses. https://t.co/mXR4Ag9Lxf"]["Always great to visit successful Kentucky businesses like Corning's plant in Harrodsburg, KY where I met with employees this morning. https://t.co/9DnyJpEHAw"]["After seeing me wear my UK and WKU belts all the time, Bill Stone decided to present me with a U of L belt to add to my collection! https://t.co/ONnQ4dkJr7"]["Caught up with the media at @JimBeam after an economic development roundtable with Bullitt County community &amp; industry leaders today. https://t.co/3b5xUWLXrf"]["Meeting with 30+ Rough River Lake community members to continue my efforts to fix their problems with the USACE's flowage easement plan. https://t.co/hOfLR2P1rX"]["ICYMI: Yesterday I performed pro bono eye surgeries for Kentuckians in Paducah -  https://t.co/7iciRBgVT6"]["Today I also visited Arkema in Calvert City to discuss cutting the overregulation that is stifling economic growth of KY businesses. https://t.co/dFIByKnn11"]["Had a good discussion on healthcare reform with fellow physicians &amp; KYans at my medical town hall at Baptist Health Hospital in Paducah. https://t.co/s7SFXnUGNy"]["I always enjoy giving back to the community through doing charitable eye surgeries, like I did in Paducah, KY today. https://t.co/Qiv2v57bA2"]["Ron and Rand Paul: Now is the time to pass Audit the Fed https://t.co/ez47jh30Kd"]["McCain and Graham’s Predictable Warmongering | The American Conservative https://t.co/CMeDz9QhiH"]["A good article by my friend @GeorgeWill about my friends in the @freedomcaucus  What the Freedom Caucus stands for https://t.co/NNMac8D5pC"]["We retain the right to take back the ticket you paid for, handcuff you, beat you about the head &amp; bloody you. This contract seems one sided"]["But it is I n their 30,000 word contract so it must be ok. https://t.co/AZwL5LD0FJ@"]["This seems unnecessary too:  United passenger threatened with handcuffs to make room for 'higher-priority' traveler https://t.co/Qs85GQuYvf"]["Rand Paul: Syria strikes 'not in the national interest' https://t.co/Pczw1FFJom"]["Rand Paul: The \"Stupidity\" Of The McCains Of The World Hinders Solution In Syria | Video | RealClearPolitics https://t.co/kYnZXe4TLs"]["Trump's dangerous expansion of executive war powers https://t.co/Ft50wPfjRS"]["Rand Paul Calls For Congress To Demand War Powers Authorization . . . John McCain Says Paul Is “Wrong”  https://t.co/Lzlvd1aoHP"]["Rand Paul Is Right; Don't Launch War in Syria Without Congressional Approval | National Review https://t.co/8z0O0zfQJY"]["Our prior interventions in this region have done nothing to make us safer and Syria will be no different."]["The President needs Congressional authorization for military action as required by the Constitution."]["While we all condemn the atrocities in Syria, the United States was not attacked."]["Rand Paul Is Right; Don't Launch War in Syria Without Congressional Approval https://t.co/JTZ6koejtF"]["Paul, Booker, Cummings Introduce Bipartisan, Bicameral Bill to Fix Broken Criminal Justice System | https://t.co/keqF3FyDj6 https://t.co/GjVmOnrQjY"]["This remains true today as it was in 2013. Both parts. https://t.co/sRQkcZ0oDI"]["Proud to support this bipartisan effort. \"New bill would crack down on border phone searches without warrants\" https://t.co/CrZga1hKk8"]["DIRECTIVE FROM OBAMA? Paul calls on Rice to testify over reports of unmasking request https://t.co/bnO0w8UKDM"]["Rand Paul makes new health care pitch to Trump https://t.co/QOvGxvyrfH"]["Joining @Morning_Joe momentarily to discuss health care repeal and Susan Rice's reported involvement in unmasking! Tune in to @MSNBC"]["I had a great time today with @realDonaldTrump and believe we are getting closer to an agreement on health care!"]["Sen. Rand Paul: Montenegro Joining NATO Is Against U.S. Interests https://t.co/0zrfHrf8EF"]["Nobody wanted to have this debate. They want to rubber stamp. They want no debates and they want to send your kids to war https://t.co/BcBc8AcftP"]["For decades nato has been an organization where the U.S. Disproportionately spends our blood and our treasure. https://t.co/mB8Nsl2zcx"]["I was on with @ericbolling last night: GOP pulls vote on their health care bill | Fox News Video https://t.co/zBDOLdkDfC"]["Joining @ericbolling in 45 minutes on @FoxNews. Tune in as we discuss  how we will fully repeal Obamacare!"]["I applaud House conservatives for keeping their word to the American people. I look forward to passing full repeal https://t.co/ftyj6sCw0v"][".@ericbolling gets it! Obamacare Lite is not the answer to repealing Obamacare! I'll be joining him live tonight on FoxNews at 8pm ET."]["I'll be joining @ericbolling tonight on @FoxNews at 8:00pm ET to discuss why we need a full repeal of Obamacare. Tune in!"]["https://t.co/341BwTHY6y"]["We can do real repeal. The naysayers are wrong. Hold the line for #FullRepeal. Pull the House bill, delay the vote &amp; let's do this right"]["https://t.co/tHF1iGilqQ"]["https://t.co/AhShYiBTJZ"]["I commend @freedomcaucus for staying united against Obamacare Lite. Enough NO votes to stop bill and restart negotiations w/ conservatives"]["I'm on @FoxBusiness with @MariaBartiromo now to discuss #Obamacarerepeal."]["There’s easily 35 no votes right now so unless something happens in the next 24 hrs, I predict they pull the bill. https://t.co/5j6YxVo1oz"]["Enjoyed meeting with @angealfa, Italy's Minister of Foreign Affairs. https://t.co/avfMcaujE9"]["I urge the House to start over and I stand ready to work with the White House for REAL repeal and replace.  Let's keep our promises."]["The House #AHCA is still Obamacare Lite. I would be a no in the Senate, but I don't think it can pass the House. I stand w/@freedomcaucus"]["Glad to be joining the St. Matthews Chamber of Commerce for their first legislative coffee event in Louisville this morning! https://t.co/O9AzSMIFH9"]["Must read from my good friend @RepJeffDuncan. Obamacare Lite is not what the GOP promised to the American people! https://t.co/OVSpmiveB0"]["We must stand strong and stand together for real repeal."]["We discussed how the White House wants to negotiate. And we brought some reading material to brush up on our negotiating skills"]["Tonight I joined members of the @freedomcaucus to discuss how to defeat Obamacare Lite.  #FullRepeal https://t.co/a7adpmL3zB"]["\"If we get what we’ve got from Ryan, ‘Obamacare lite,’ he will not have the votes.”- https://t.co/4Mtag9LTup https://t.co/BrQFPwtbLi"]["“I can't vote for a plan that is Obamacare Lite, and also keeps all the fundamental problems...\" https://t.co/IVUn9xBNEo"]["We Must Keep Our Promise to Fully Repeal Obamacare https://t.co/J8z57BJivJ"]["I stand ready to work with my colleagues and the President on a plan that can both work and pass - first real repeal and then replace."]["If House leaders try do a little less using the same basic framework as the failed Obamacare experiment, then it will fail too #FullRepeal"]["Offer a different vision of how to lower costs &amp; provide greater access to millions of Americans and open the floor to all ideas #FullRepeal"]["Pass the 2015 repeal that passed both Houses and keep our promises. Then immediately vote on free market solutions.  #FullRepeal"]["There is a solution for House Leaders that conservatives have offered: abandon Obamacare Lite now. It is bad law &amp; it can't pass #FullRepeal"]["With @mkibbe who gets why we need to oppose Obamacare Lite! We ran on full repeal, let's deliver on what we promised to voters. https://t.co/ZcK4zQ153W"]["Spoke with @KilloughCNN about why I will continue to oppose Obamacare Lite! Let's vote on clean repeal now. https://t.co/YRVM2wrjMa"]["On with @FaceTheNation now discussing Obamacare! https://t.co/68JxUZQnpn"]["Looking fwd to joining @ericbolling tonight on @FoxNews at 815pm ET. Don't miss this interview on why we need full repeal of Obamacare now!"]["I spoke with @realDonaldTrump last night about repealing Obamacare https://t.co/Vg8LB50UZr"]["A must read for all baseball fans! New book from @edhenry https://t.co/fNbyNfuZif https://t.co/uTQt8YGBJH"]["Tonight on @FoxNews at 9pm with @edhenry. Conservatives hate Obamacare Lite legislation. Give us free market solutions! https://t.co/tKnLrOQRqI"]["Looking forward to joining @edhenry on @FoxNews tonight at 9pm ET. I will continue to fight for a clean repeal and against Obamacare Lite!"]["Let's fully repeal ObamaCare, then have an open debate on how to replace it https://t.co/szVl0seBlx"]["\"Passing this bill would certainly ensure that Republicans will 100 percent own any ensuing death spiral...\" https://t.co/2O0h48Z5NI"]["Vote on the worst of government waste. There can only be one #SourSixteen winner! https://t.co/eAFSU71GcL"]["Discussing my opposition to Obamacare Lite with @mboyle1 @BreitbartNews #cleanrepeal https://t.co/bsyYEwKIsE"]["Now That He's Found It, Rand Paul Really Doesn't Like GOP's Obamacare Repeal Bill  https://t.co/AWaidlRR67"]["And it keeps insurance company subsidies forever."]["It keeps individual mandate but makes you pay the insurance companies instead of the government"]["Their plan keeps the Obamacare \"Cadillac Tax\" forever, which is a tax on the best health insurance."]["It keeps Obamacare subsidies but renames them \"refundable credits.\""]["House Obamacare Lite plan keeps Obamacare taxes for another year"]["The House leadership Obamacare Lite plan has many problems. We should be stopping mandates, taxes and entitlements not keeping them."]["Th House leadership plan is Obamacare Lite. It will not pass. Conservarives are not going to take it.  #FullRepeal"]["Coming up right now on @foxandfriends  Will be talking about the House Obamacare Lite plan."]["My latest with @RepMarkMeadows Full repeal of Obamacare, then let's debate on how to replace it! Via @fxnopinion https://t.co/UuLlWlD0Ns"]["Still have not seen an official version of the House Obamacare replacement bill, but from media reports this sure looks like Obamacare Lite!"]["I'll be joining @HARRISFAULKNER at 7pm ET on @FoxNews to discuss repealing and replacing Obamacare. Tune in!"]["Maybe it's over there with the Justices for safe keeping? https://t.co/CXEWPW9BPo"]["They went outside and thought maybe this guy was helping House leaders hide it. But nope. https://t.co/A06RoOG0pC"]["Nope. Not there either. It was another bait and switch https://t.co/9HJq4bwVuh"]["This is harder than it should be. But wait. I think someone left us a hint! https://t.co/dxx27kjxPM"]["Nope. Not there. Maybe this one. https://t.co/aA9C9iSNUu"]["There were some obvious places to look. Perhaps near the statues of some great Republicans from the past. https://t.co/vXLOQwaQZi"]["Today my staff and @randpaulcopier continued the search for the secret House Leadership Obamacare Lite bill https://t.co/G32duw04Pl"]["Oh look. @politico has more details on the House Obamacare Lite plan.  Hey @pauldemko can I get a copy?"]["I found a message from the old House leadership that the new ones should probably hear. \"Hell No You Can't!\" https://t.co/1IzTZY8bMu"]["We are continuing our search for the Obamacare Lite bill! Do you know where the secret location might be? Has anyone seen the bill? https://t.co/WcSIDTs0vP"]["I will be on @CNN around 11am to talk about this and more. Tune in!"]["Do you have a clue where the secret meeting on the secret Obamacare replacement bill will occur? Reply with your tips!"]["The Obamacare replacement bill remains hidden from the public! What secret location will they meet in this weekend to work on it?"]["Looking forward to joining Morning Joe shortly on @MSNBC Tune in!"]