["Donald Trump’s disgraceful comments prove that he does not even know what makes America great https://t.co/fsh9q70BZA"][".@SecretaryZinke and the Trump admin’s offshore drilling plan is terrible for Oregon’s environment, economy &amp; tourism and could devastate Oregon’s vibrant coastal economies. Oregon MUST be given the same treatment as Florida. https://t.co/8pKgBFQTAi"]["Walmart’s permanent #GOPTaxScam tax cuts are worth $1.85 billion a year. Meanwhile, Walmart is laying off thousands of workers and closing stores. Inexcusable. https://t.co/rwaz5P7mEk"]["The vast majority of Americans in Medicaid already have a job or are unable to work due to age or impairment. The Trump admin is going after people who are just trying to get by while taking care of kids or elderly parents, struggling w/ a chronic condition, or going to school."]["Health care is a RIGHT. Today @realDonaldTrump and his administration have taken a big step in the WRONG direction. https://t.co/GPYTyVkSJG"]["This #Section702 bill would give AG Jeff Sessions unchecked power to use this information against Americans. This bill prevents his decisions from EVER being challenged in court."]["If this #Section702 bill comes to the Senate, I will filibuster it."]["A strong bipartisan coalition voted to protect innocent Americans from warrantless spying. The Senate must allow real debate and amendments - not push this legislation through in the dark. #Section702 #FISA"]["The House just passed a bill that does absolutely nothing to protect the vast majority of law-abiding Americans from warrantless government spying. #Section702 #FISA"]["Tomorrow the House has a choice – reform warrantless surveillance, or pass a bill that gives greater privacy protections to criminal suspects that innocent Americans. https://t.co/G7PyNNeVdz"]["Every American needs to know how #FISA #Section702 affects them. Find out how in my Op-Ed for @thecipherbrief: https://t.co/wmQp7VIaOj"]["It is intolerable that the Department of the @Interior could be wasting scarce taxpayer resources that are meant to save lives amidst the most expensive wildfire season on record."]["I’m calling for an investigation into @SecretaryZinke's misuse of wildfire funds.\nhttps://t.co/xe9kVJcp16?"][".@RepRichardNeal &amp; I want to know: Is the Trump admin. tampering with people’s paychecks and exerting influence over IRS in the wake of the #GOPTaxScam? Could be lining families up for a nasty tax hit in 2019. https://t.co/HRHaLduT8O"]["I asked @HHSGov nominee Alex Azar if he’s ever LOWERED the price of a drug while he was a top exec at Eli Lilly. At yesterday’s @SenateFinance hearing, he dodged the question. https://t.co/Ic236NxA4Z"]["BIG news: extending #CHIP for 10 years would SAVE $6 billion dollars. With this news, securing kids’ health care for the long-term should be a no-brainer."]["Very proud to have Karlen Yallup from Warm Springs as an outstanding Mark Hatfield fellow in my office. Read more about her great work in the @MadrasPioneer: https://t.co/aWjQqDcGHC"]["#Section702 enables massive, warrantless spying on Americans. I’m joining Rep. @justinamash, Sen. @RandPaul and a bipartisan group of House and Senate colleagues to speak out in support of FISA reform. Tune in. https://t.co/g0n4I1NKIU"]["I want to welcome my friend and colleague @SenWhitehouse to @SenateFinance! Looking forward to having more opportunities to work together."]["Sacrificing real security to placate racists and xenophobes https://t.co/FP4PMXZx6b"]["Change starts at the grassroots. The public supports #NetNeutrality, and Oregonians are speaking out and demanding the Senate preserve these rules. #SaveNetNeutrality"]["Don’t forget Comcast said if they got a huge corporate tax cut, they’d create thousands of jobs. Comcast actually LAID OFF 500 people right after Christmas. It’s an example of Big Cable’s double-talk. https://t.co/CbWlXhEDz1"]["My measure with @SenMarkey would reverse @AjitPaiFCC’s harmful #NetNeutrality roll back and restore real net neutrality. A vote against this resolution is a vote FOR Big Cable and AGAINST the public. https://t.co/vyl7a1UEeO"]["If Alex Azar is confirmed, it will not be the first time @realDonaldTrump and his health care team broke their promises."]["Alex Azar told @SenateFinance staff that while he chaired Lilly’s pricing committee he NEVER signed off on a decrease in the price of a drug – not ONCE. The system is broken, and Alex Azar was a part of that system."]["Alex Azar had a MAJOR role over drug price increases for every product Lilly marketed in the U.S. Under his watch, the prices of both Forteo and Strattera more than DOUBLED. https://t.co/HGbvaqmRK0"][".@realDonaldTrump said one year ago that price-hiking drug companies were “getting away with murder.” Now, he’s nominated Alex Azar, a drug company executive with a history of raising prescription drug prices, to lead @HHSGov. https://t.co/BVU3tR5994"]["I’m joining @SenSchumer &amp; @SenMarkey to highlight the milestone of 37 senators who will force a vote on overturning @AjitPaiFCC’s decision to end #NetNeutrality https://t.co/lCJhuWbdAC"]["This morning at the @SenateFinance hearing I’ll be asking Alex Azar, the nominee for @HHSGov Secretary, about his impact on drug price increases. Tune in 10AM EST:\nhttps://t.co/lZdjUMIzas"][".@FERC did the right thing by REJECTING @realDonaldTrump’s &amp; @SecretaryPerry’s hair-brained proposal to pick Americans’ pockets to funnel more money to coal executives. https://t.co/1gLiB3X6KL"]["It’s time to act and #ExtendCHIP. Congress needs to put kids and their health care first."]["States have stretched their CHIP programs to the breaking point to keep kids covered and prevent termination notices. #ExtendCHIP"]["9 MILLION kids, including 80,000 in Oregon, count on CHIP to stay healthy. Their care is at risk because of Congress’s failure to act. #ExtendCHIP"]["Republicans gave multinational corporations permanent relief in the #GOPTaxScam. They could only find time to give kids who count on #CHIP a patch."]["I spoke on the Senate floor to mark a disappointing milestone – the 100th day since Congress failed to extend full funding for #CHIP. https://t.co/ezkzpv3Rub"]["Whatever it takes, I’ll be right there with you, Senator @RandPaul. https://t.co/OUh506FOC9"]["As of today, 15,193 #DACA recipients have lost their status. I won’t stop fighting for a #DreamActNow. https://t.co/v7GdFq6bAN"]["Visit my website to learn more about where and when I’ll be holding town halls. https://t.co/fj1BTSthbJ https://t.co/ERIFCP0t4x"]["Looking forward to meeting with Oregonians at my first town halls of 2018! https://t.co/0GV6ARFm9w"]["That’s why I called on FERC to reject @SecretaryPerry's damaging proposal in its entirety.\nhttps://t.co/p0mxBXwp1S"][".@realDonaldTrump and @ENERGY Department’s plot to prop up coal will make rich executives richer by blowing up energy markets and raising Americans’ utility bills. \nhttps://t.co/QfBDv2QSGp"]["I’ve also signed on as the first cosponsor of @SenBooker’s Marijuana Justice Act to end the federal prohibition on marijuana and take steps to fix our broken criminal justice system. https://t.co/GN1ZHizVCa"]["I’ve introduced a path to marijuana reform - 3 bills that responsibly deschedule, tax &amp; regulate marijuana, shrink the gap between federal &amp; state marijuana policies and prevent unfair tax bills from hitting legal marijuana businesses. https://t.co/807gS9Jnf2"][".@realDonaldTrump and Jeff Sessions ONLY value states’ rights when they think the states are right. Voters in Oregon &amp; other states with legalized marijuana should NOT have their votes thrown in the trash by the Trump admin. https://t.co/kALnhTBj8h"]["🚨🚨Reminder @realDonaldTrump and his @ENERGY department are coming to raise your utility bills. https://t.co/JILxvhVbkN"]["More falsehoods from @realDonaldTrump about energy security reveal a shameless agenda to prop up oil &amp; gas. We must fight @SecretaryZinke’s attempt to open Oregon’s coast to drilling. https://t.co/wNr1RE1Ujt"]["My full statement on AG Sessions' announcement today: https://t.co/6YaHskHxIF"]["Trump promised to let states set marijuana policies. Now he's breaking that promise so Jeff Sessions can pursue his extremist anti-marijuana crusade. https://t.co/EhxfVdC3so"]["Fred Bass adored his wife and family, never hesitated to help employees when they fell on hard times, and built a bookstore that became renowned around the world. He will be missed by so many. https://t.co/03UAuP42i9"]["Welcome to the Senate, @SenTinaSmith and Senator Doug Jones! Looking forward to working together. https://t.co/syO8mZ0qN4"]["I won’t back down from standing up for Oregonians and their families."]["Congress MUST prioritize funding for veterans when negotiating our next budget deal and provide @DeptVetAffairs with the resources it needs to deliver the care our veterans have earned."]["Millions of children and families rely on #CHIP for critical health care. Congress MUST #ExtendCHIP."]["It’s past time to find a solution for Oregon’s 11,000 #Dreamers and the hundreds of thousands of undocumented youth across our country. Congress MUST pass a #DreamActNow."]["Congress is back in session, and the @SenateDems and I are going to keep fighting for the middle class and working Americans."]["Big congrats to Judge Nelson for her well-deserved appointment to Oregon’s Supreme Court: https://t.co/cRe1ip72cU"]["Wishing you and your family a happy and safe holiday!"]["The Western Oregon Tribal Fairness Act honors and respects each tribe’s right to be economically self-sufficient. This bill is an important step forward in rectifying injustices.\nhttps://t.co/hytS5akFZo"]["If we follow-the-money with @realDonaldTrump and the Russia investigation, we’ll be able to connect the dots."]["If @realDonaldTrump interferes with special counsel Robert Mueller’s investigation, he is NOT above the law. https://t.co/dvGRY3ag6Y"]["The United States stands with the Bahá'ís against religious oppression and persecution in Iran. https://t.co/ael1TXfXB8"]["I voted NO on the short-term funding bill because it shortchanged #CHIP for over 80,000 Oregonian children and ignored the 11,000 Oregon #Dreamers. Congress can do better. It’s time for long-term solutions to help Americans. https://t.co/OSM78c0XR7"]["I’ll be joining @maddow at 9:20pm EST to address the need to follow-the-money in the Senate Intelligence Committee Investigation. Tune in."]["Instead of making it harder to access health care, Congress and the administration should make it easier and more affordable."][".@realDonaldTrump tried to sabotage &amp; misinform Americans about the Affordable Care Act. Nevertheless, almost 9 million people signed up for health care during the 6 week #ACA #OpenEnrollment period https://t.co/fXupFA7zUG"]["I’ll be speaking on the Senate floor LIVE at 4:45pm EST on the state of the Senate Intelligence Committee investigation and follow-the-money issues. Tune in here: https://t.co/sHusinKct0"]["I will be voting NO on a CR that fails to address health insurance for millions of children, does not address DACA, or includes an extension of warrantless surveillance under FISA Section 702."]["I’ve been inspired by the brave #Dreamers who’ve met with me at town halls and stopped by my office. I’m proud to #StandWithDreamers and support a #DreamAct. https://t.co/E1P4SXFJHB"]["As of today, 13,006 #DACA recipients have lost their status. It’s time for a #DreamActNow. https://t.co/QoE2JNZ2KU"]["Thank you to all who raised their voices and spoke out against the #GOPTaxScam. Together, we will hold Republicans accountable and never forget this vote. #RonReport https://t.co/ejQyb43U7T"]["I stand with the 11,000 #DACA recipients in Oregon and #Dreamers across the country. It’s time for Congress to pass a #DreamActNow. https://t.co/YLoMufxfxJ"]["I’ll be right there with you. https://t.co/tM6isBvaoT"]["Federal marijuana policy is an issue where the government is light years behind the times. Jeff Sessions &amp; the Trump admin are still trying to fight a 1980s drug war that’s socially unjust, economically backward &amp; against the will of the American people."]["I’m proud to be the first cosponsor of @SenBooker’s Marijuana Justice Act. If you missed our Facebook Live Monday night, check it out here: https://t.co/aNnMMpL1i0"]["The American people will be ready to fight again. We will NOT forget this vote on the #GOPTaxScam."]["Middle class consumers across the country are already walking an economic tightrope. You can’t spend what you don’t have. https://t.co/BvIrbDlsAU"]["Even conservative economists are calling the #GOPTaxScam an absurd alternate reality."]["NEW from @jctgov - the #GOPTaxScam is a tax hike on 9 million Americans in 2019. https://t.co/QYdpHzWNLB"]["The #GOPTaxScam:\n- Showers corporations in handouts\n- Raises taxes on the middle class\n- Puts Medicare and Social Security at risk\n- Historically unpopular with Americans"]["Today, the Republican party officially turns its back on America’s middle class with the #GOPTaxScam. https://t.co/FzsXNdo8mU"]["With Republicans disregarding all of the norms for careful tax policy making, they have guaranteed significant instability in US tax policy for many years to come."]["The louder Americans protested, the faster Republicans raced to pass a #GOPTaxScam that will hike taxes on over 1/2 the middle class, AND leave 13 million Americans uninsured &amp; increase premiums on millions more."]["The American people have exposed Republicans’ scam on the middle class &amp; their betrayal to guarantee handouts to powerful CEOs and the donor class. #GOPTaxScam"]["While Republicans met in SECRET for weeks, they thought the American people weren’t paying attention – but we’ve been watching the ENTIRE TIME."]["From the BEGINNING this bill has been a shower of tax break goodies on multinational corporations, special interests &amp; heirs-in-waiting. Who will be paying for the #GOPTaxScam's massive handouts? The middle class. It’s a cruel double standard."]["Republicans are DESPERATE to make good on promises to their wealthy donors while the American people are raising their voices to scrap this historically unpopular #GOPTaxScam."]["It takes effort to completely ignore the voices of the people and give away $1.5 TRILLION to tax cheats and corporations. Americans will hold Republicans accountable."]["I’m continuing to monitor the situation in Salem after this weekend’s gas tanker crash. Salem residents can find more information here: https://t.co/UZvHKGdfFr"]["Thank you, @ACLU, @FreedomWorks and @DemandProgress for standing up for Americans’ rights. #Section702 https://t.co/yMX11zyVHv"]["I will oppose any effort to short-circuit debate by jamming #Section702 re-authorization on a CR."]["Congress needs an OPEN debate and an opportunity for amendment on #Section702. The American people deserve to know about the laws this Congress is passing."]["The Trump admin is going BACKWARD on transparency by refusing to provide an estimate of the number of Americans swept up under #Section702."]["#Section702 of FISA now is an end-run around the 4th Amendment. Our government is sweeping up untold number of Americans’ communications &amp; performing searches WITHOUT warrants."]["So glad to join with @RandPaul, @SenatorLeahy, @SenMikeLee &amp; more defenders of Americans’ rights to say NO warrantless spying on year-end spending bills. Congress shouldn’t pass laws in the dark. https://t.co/LuF3tKQDdo"][".@SenBooker and I are LIVE on Facebook answering your questions about the Marijuana Justice Act. https://t.co/wah0kgd95W https://t.co/KeIQzXIW6p"]["Looking forward to it, @SenBooker! Tune in at 6:30pm. EST https://t.co/wah0kgd95W https://t.co/gXk0vy3IUm"]["#DreamActNow. RT if you’re with me. https://t.co/CZ98Ns9OWP"]["I’m excited to sign on as the first co-sponsor of @SenBooker's Marijuana Justice Act. Join us at 6:30p.m. EST tonight on Facebook Live. We’ll be answering your questions about the bill. https://t.co/wah0kgd95W"]["The $1.5 trillion Republicans want to spend on the #GOPTaxScam would fund CHIP for ***915 YEARS***"]["The #GOPTaxScam is one of the biggest rip offs since the Gilded Age. The American people aren’t going to forget it. https://t.co/J5VXmnwwEZ"]["I’m saddened by the news of the Amtrak derailment outside Tacoma and grateful for first responders. Individuals with questions about friends and family on Train 501 should call (800) 523-9101. https://t.co/UuT2CPj9ds"]["The #GOPTaxScam is a recipe for hunger in Oregon. The impact on the Oregon Food Bank Network would be devastating. https://t.co/xyanN29k5S"]["Republicans are putting their #GOPTaxScam out on a Friday night because they’re counting on you to be quiet. But we’re NOT going to be quiet. It’s time to get LOUD. #RonReport https://t.co/sLFxInY0oQ"]["These Oregonians visited today to share why we need a #DreamActNow. https://t.co/fbaPGIBmQl"]["Today, Oregon #Dreamer Juan Navarro shared his story and why he believes we need a #DreamActNow. I am proud to #StandWithDreamers and undocumented youth. https://t.co/OySyltDAAS"]["The #GOPTaxPlan is a bad fit for Oregon. It’s like wearing a tuxedo at the beach! https://t.co/BiRnai3qkU"][".@AjitPaiFCC is on a mission to steal a free and open internet away from the American people. #SaveNetNeutrality https://t.co/rJsSeOXiuM"]["LAST CHANCE! #OpenEnrollment for #ACA health care ends today. Find a plan and #GetCovered for the year: https://t.co/AD8JO4YBzf https://t.co/wo6wU2rAjb"]["The #GOPTaxPlan is a complete betrayal of the middle class. https://t.co/1Tr7kNudxe"][".@AdyBarkan and I sat down today to talk about the Republican betrayal on the middle class. The fight on the #GOPTaxScam is NOT OVER. https://t.co/8jCbdaPqi2"]["Republicans apparently believe their economic double standard needs to be EVEN TOUGHER on the middle class. #GOPTaxScam https://t.co/918hjBSfyt"]["Rural communities, education and our economy will be worse off now that @AjitPaiFCC chose Big Cable over consumers and will repeal #NetNeutrality. My interview with @OPB: https://t.co/rii7fuy5im"]["In the fight for #NetNeutrality, the battle doesn't stop here. @AjitPaiFCC, we're just getting started. https://t.co/GR5h4u6ldk"]["On my way to the @FCC to speak out against repealing #NetNeutrality and how it would hurt rural Oregonians and working Americans."]["In times like these, we need our vegetables for extra strength. Happy holidays from my family to you and yours! https://t.co/D6wwO8j4B3"]["Only 3 DAYS left for #OpenEnrollment. Many can find plans for less than $75. Don’t delay - visit https://t.co/AD8JO4YBzf and enroll! #GetCovered https://t.co/sefbZM4V6N"]["I said it at the @taxmarch rally earlier today, and I’ll say it again – This fight is NOT OVER. #GOPTaxScam https://t.co/vuOj5B1aGr"][".@AjitPaiFCC's mission to roll back #NetNeutrality would destroy our free and open internet in favor of Big Cable. #SaveNetNeutrality https://t.co/jhkGkULtdI"]["Our government made a promise to #Dreamers when we encouraged them to share their stories publicly, submit to background checks and pay taxes. It’s time for Congress to pass a #DreamActNow."]["In Oregon alone, there are an estimated 11,000 #Dreamers who’ve planted roots in their communities. Every one of those young people has parents, brothers and sisters and friends."]["#Dreamers are vital contributors to our nation’s success, including more than 800 in our nation’s military. #DreamActNow"]["Dreamers are facing the very real and very frightening threat that they may be ripped away from the only lives and the only country they have ever known. #DreamActNow https://t.co/alBgyQ5fQN"]["Democrats agree that the tax system is broken. It’s not too late for bold members on the other side to REJECT this this reckless partisan process and work on a bipartisan basis to put the middle class first."]["Republicans have reportedly settled on even BIGGER breaks for those at the top, a capstone on a budget-busting gift to corporations and the donor class. https://t.co/E9CTebNHQp"]["The #GOPTaxScam is the ultimate betrayal of the middle class. It does not give middle class Americans the tax cuts they deserve now, and it takes away Medicare and Social Security later."]["This is a reality show version of a Conference Committee. https://t.co/WA56rThRKn"]["Tune in LIVE to the Conference Committee meeting on the #GOPTaxPlan. What’s about to happen is a sham and nowhere near regular order. https://t.co/oFGKps4OH1"]["I introduced the first strong #NetNeutrality bill in the Senate in 2006 – and I am NOT backing down on this fight to #SaveNetNeutrality."]["Many of the comments @AjitPaiFCC solicited for input on this process are FAKE – They’re bots and false identities or linked with Russian IP Addresses."]["The loss of #NetNeutrality makes it certain that consumers will get fewer choices and will pay more for them."]["Simply put - #NetNeutrality prevents your internet service provider from favoring one type of content over another."]["Speak out - Drilling the #ArcticRefuge has no place in the #GOPTaxPlan. We must #ProtectTheArctic and stop the destruction of an irreplaceable natural treasure."]["@AjitPaiFCC Handing it over to my staff."]["I’m going LIVE on the Senate floor to speak out against @AjitPaiFCC's plan to demolish #NetNeutrality and put Big Cable before consumers. https://t.co/bfsIGJaSDu"]["Don’t forget - The House #GOPTaxPlan is attack on people living with disabilities. https://t.co/PVvs7LRjeA"]["The people of Alabama have spoken. Republicans and the administration must drop their partisan attempts to rush a corporate handout through Congress until Senator-Elect Jones is sworn in. #GOPTaxScam"]["Welcome to the Senate, Doug Jones!"]["Wishing all who are celebrating a #Hanukkah filled with light and joy. 🕎"]["The #GOPTaxPlan is NOT a bill designed for the middle class. It’s a Republican scam to give massive giveaways to multinational corporations and tax cheats. https://t.co/D4ESDHLm1C"]["Only 4 DAYS left for #OpenEnrollment. Don't miss the opportunity to #GetCovered. Sign up: https://t.co/AD8JO4YBzf https://t.co/rcv1OahXks"]["I support a bipartisan #HEA reauthorization starting with better information &amp; privacy for students &amp; policymakers. @ACLU’s @ChadAaronMarlow writes that my bill w/ @MarkWarner &amp; @SenRubioPress is a good starting point https://t.co/hIoQwkYSbt"]["My bill with @SenRubioPress &amp; @MarkWarner stops students from being forced to sacrifice privacy in order to gain crucial consumer information while choosing a college. This post from @ACLU highlights our approach to privacy &amp; transparency in #highered: https://t.co/hIoQwkYSbt"]["Foul. Beneath the dignity of the presidency. https://t.co/oQXCB1eq2c"]["Thank you for sharing your story, @AdyBarkan, and speaking out for millions of Americans whose health could be devastated by the #GOPTaxPlan. https://t.co/DDoxwz1WZb"][".@SpeakerRyan and congressional Republicans are plotting their continued attack on Medicare, Medicaid, and anti-hunger programs. It doesn’t stop with the #GOPTaxPlan. https://t.co/jJd3xl2S71"]["Thanks for participating in my @reddit #AMA with @TaxMarch. It was great answering your questions on the #GOPTaxPlan. Check out our responses here: https://t.co/EkBulrn2AX"]["Join me and @TaxMarch for a @Reddit #AMA at 11:00am est. We’ll be answering your questions on the #GOPTaxBill and how you can speak out. https://t.co/EkBulrn2AX https://t.co/pihD6fFp6C"]["It’s time for Congress to pass a #DREAMActNow and protect Oregon’s 11,000 #Dreamers. #AmericanDreamer https://t.co/V57zjzGPTK"]["Deeply saddened by the loss of my long-time friend Mayor Vera Katz, who leaves a powerful legacy for Portland and our entire state: https://t.co/PJtf8YqTrh"]["After holding 80 #2017TownHalls across Oregon this year, my belief in the #OregonWay is stronger than ever. https://t.co/rEZVPGvTYd"]["Looking forward to it, @RandPaul. Liberty and security aren't mutually exclusive. Join us to hear why it's time to end warrant-less backdoor surveillance of Americans. https://t.co/s0rxyU9Pet"]["🚨 The Trump administration has a plan to raise your utility bill.\nhttps://t.co/JScHlSN9Zx"]["Yesterday, I joined @LittleLobbyists, @Drsforamerica &amp; @amprog to speak out against the #GOPTaxPlan, a bill disastrous for health care. By raising our voices, we can fight back. https://t.co/gEJ7Fs4oPe"]["I’m fighting hard to renew #CHIP because it’s a health-care lifeline for so many kids in Oregon &amp; nationwide. https://t.co/KfO5FuLUuU"]["This is outrageous. The Trump Admin is once again willing to sacrifice the safety of Americans in the name of undoing regulations. This is a senseless decision that endangers our communities by making oil by rail transportation less safe. https://t.co/VWzXEHk1Ez"]["Any attempt to interfere with Mueller's investigation will create a constitutional crisis. Every member of Congress - of both parties - must make that clear. https://t.co/0BzO6DNrqe"]["Sign up for #ACA #OpenEnrollment before December 15. ➡️ Visit https://t.co/AD8JO4YBzf to get covered today. https://t.co/Ay33ktP5GU"]["This effort from @realDonaldTrump and the @WhiteHouse to PUNISH innocent young people and SPLIT families goes against our values as Americans and further divides our country."]["I am proud to have been with #Dreamers every step of the way, from #DREAMAct legislation to President Obama’s actions on #DACA."]["In Oregon there are an estimated 11,000 #Dreamers facing the very real threat that they may be ripped away from the only lives and the only country they have ever known."]["In Oregon I’ve met with #Dreamers who’ve shared their powerful stories of how the Trump administration has needlessly and cruelly injected fear into their lives and the lives of their families."]["The strength of #Dreamers’ stories fuels the fight to bring a #DreamAct to the Senate floor. It’s time for Congress to act. https://t.co/xhX98q274h"]["Huge congrats to my friend @SenSaraGelser for her well-deserved recognition among the heroic Silence Breakers featured in @Time as the #TimePOY. All of Oregon is tremendously proud."]["Yesterday, @realDonaldTrump said “a very tiny little sliver” would be worse off because of the #GOPTaxPlan. The American people know that’s not true."]["Remember this - Republicans are going to try and break this deal. Democrats aren’t going to let it happen."]["After Republicans add $1.5 TRILLION to the deficit for goodies to corporations and tax cheats, they’ll say we don’t have money for basic assistance Americans need. @SpeakerRyan said so yesterday."]["Make no mistake – the #GOPTaxPlan trades the health of millions of middle-class Americans for money into the pockets of corporations and the wealthy."]["Not only is this Republican #GOPTaxPlan going to hurt people’s paychecks – it’s going to make their health care WORSE."]["I’ll be joining @SenBennetCO, @SenatorCardin, @LittleLobbyists, @Drsforamerica &amp; @amprog to speak out about how the #GOPTaxPlan puts a dagger in the #ACA, Medicare &amp; Medicaid. https://t.co/J0X8eY5YVP"]["Mistakes are exactly what happen when Republicans recklessly push through their #GOPTaxPlan with shame and secrecy. https://t.co/cphQBVdCpc\\"]["Oregonians, have you signed up for #OpenEnrollment? #GetCovered today at https://t.co/AD8JO4YBzf https://t.co/SVlq50QYfQ"]["RT if you're ready to fight this with everything you've got. I know I am. https://t.co/6nfVofUq4N"]["The American people deserve to know if this administration is manipulating economists to do their political bidding."]["I’m asking a top ethics watchdog if @USTreasury @stevenmnuchin1 interfered with the decision to bury a 2012 report proving trickle-down economics harms American workers. https://t.co/b7TxRxKbMr"]["Slow speeds, high costs, the end of internet startups – THIS is the future of the internet if @AjitPaiFCC repeals #NetNeutrality. #RIPinternet\nhttps://t.co/Oqj6jls3ku"]["By repealing #NetNeutrality, the @FCC and @AjitPaiFCC would destroy Americans’ internet freedom. #RIPinternet. #SaveNetNeutrality for a free and open web. https://t.co/aRjfXF3w2S"]["I expect that Senator Franken will announce his resignation tomorrow. It is the right thing to do given this series of serious allegations."]["It’s not too late for Republicans to change course. Instead of going to a sham conference - the Senate can have a REAL  bipartisan debate on a tax plan that gives every American a chance to get ahead."]["I heard repeatedly at town halls in Oregon last weekend that the American people do NOT want #GOPTaxPlan to become law."]["Now @realDonaldTrump is calling for MORE speed and secrecy in the #GOPTaxPlan process-- just so he can claim a victory and Republicans in Congress can appease mega-donors."]["There is no telling what swamp creatures have crawled their way up Capitol Hill to get their claws on this bill at the eleventh hour."]["The Conference Committee meeting in days ahead is nothing more than THEATER. House and Senate Republicans are already meeting about the #GOPTaxPlan behind closed doors."]["Turning it over to my staff."]["Join me LIVE on the Senate floor where I’ll speaking about the motion to go to conference on the #GOPTaxPlan racing to completion in secrecy and shame: https://t.co/HOrAjcQsVb"]["We must protect Cascade-Siskiyou for all Oregonians to enjoy this Oregon treasure. #MonumentsForAll https://t.co/OLFXNfXAZb"]["The fight will continue to protect Oregon’s treasures. We must end this spiteful campaign to stop American families from having access to the national treasures they know and love. #MonumentsForAll"]["The #GOPTaxPlan is one big grab bag of holiday goodies for multinational corporations, tax cheats and lobbyists. https://t.co/ZWWXXe5rfq"]["While @realDonaldTrump works to CLOSE access to public lands, bipartisan proposals like my Recreation Not Red-Tape Act would make it EASIER for Americans to explore our nation’s treasures. #GetOutdoors #KeepItPublic. https://t.co/4FmNGeOikh"]["Only 10 days left for #OpenEnrollment. #GetCovered on https://t.co/AD8JO4YBzf"]["Congress must protect the rights of innocent Americans against government spying. I responded to myths about reforming Foreign Intelligence Surveillance Act’s Section 702 for @just_security:\nhttps://t.co/bHOhw5q6J3"]["Everyone deserves access to affordable health care. Visit https://t.co/AD8JO4YBzf to learn how you can #GetCovered during #OpenEnrollment. Don’t wait – Open enrollment ends December 15! https://t.co/iiAQl36jVx"]["I’m standing up for public lands, scientific discovery &amp; the outdoor recreation economy– and against @realDonaldTrump’s announcement to decimate Bears Ears and other monuments. #MonumentsForAll #KeepItPublic https://t.co/bg68JpiBLb"]["Here’s the Republican double standard in action. The government MUST fund millions of children’s health care - NOT give massive handouts to corporations. #GOPTaxPlan https://t.co/uozCckHynu"]["Republicans are pushing through their “tax cheats appreciation bill” so recklessly that they’ve undermined a research-and-development tax credit key for innovation. Another failed portion of the #GOPTaxPlan. https://t.co/mxbR99ghvj"]["National monuments President Obama created or expanded generate $156 million+ in local economic activity. @realDonaldTrump’s rollback harms rural economic progress &amp; job creation. #MonumentsForAll https://t.co/LYdZkGU8I0"]["Right now @realDonaldTrump is endangering ALL monuments including Oregon’s Cascade-Siskiyou. #MonumentsForAll"][".@realDonaldTrump’s unprecedented rollback of #BearsEars and #GrandStaircase is a grave mistake destined for the courtroom. From Former Secretary of the Interior @SallyJewell: https://t.co/amWPpZKmjR"]["Spoke this AM w/ @SenJeffMerkley at the #OLSummit in Portland about how the #GOPtaxbill would hurt middle class in Oregon &amp; nationwide. Now going bacK to DC to fight against this bad bill. https://t.co/pTzS9JjJpi"]["Celebrated with a Burgerville shake after today’s town hall at Cleveland HS In Southeast Portland. Huge kudos to my staff for 80 #2017townhalls this year! https://t.co/Lko29yu1ae"]["Congrats to @CommCyclingCtr &amp; @repblumenauer for today’s incredible #HolidayBikeDrive in Portland. Great volunteers + great bikes = happy kids. https://t.co/xXMoBhoCw6"]["Thnx @townhallproject for your MVP award at my 80th #2017townhall —today in Portland. And thnx to Oregonians in all 36 counties for attending this year’s town halls. Participatory democracy is alive &amp; well in our state. #OregonWay https://t.co/E84FkqnHAJ"]["After hearing Oregonians’ concerns and stories this weekend, I’m sharing a #GOPTaxPlan update here in Portland for a special edition of the #RonReport https://t.co/bkyeeQQbNk"]["Looking forward to my 80th #2017townhall of the year — at 1 pm today in Portland.  No need to RSVP. Just bring your questions about the #GOPtaxbill or any other topic. Town hall location here: https://t.co/rQAQbKNAXx"]["Thanks Clackamas County for today's great #2017townhall in Molalla. So many concerns raised about #GOPtaxplan &amp; equally good ?s about transportation, health care, Russia investigation &amp; more. https://t.co/XdrVyYdUHi"]["Americans don’t want this bill – and they are NOT going to forget the #GOPTaxPlan in months and years to come."]["The only tweaks Republicans have made to their #GOPTaxPlan are more perks for multinational corporations."]["Working and middle class Americans WILL lose health care coverage. They WILL face tax hikes."]["It’s a frustrating day for America when Senators aren’t listening to their constituents. Americans DON’T want the #GOPTaxPlan. They’ve made it clear. They’ve shared their stories."]["@SenateFinance Speaking on the floor now: https://t.co/8rvaTqje0B"]["I don't remember this being debated in @SenateFinance committee. https://t.co/TvbgDO69F0"]["BE WARNED – Next up are Republican attacks on Medicaid, on Medicare, on Social Security, on anti-hunger programs. https://t.co/Eb6slHrDBs"]["The #GOPTaxPlan is a dagger in the heart of the #ACA. This con job is DANGEROUS for health care access and coverage."]["In order to shut down internet freedom and appease Big Cable, @AjitPaiFCC is relying on alternative facts so far from the truth they debunk themselves. #SaveNetNeutrality https://t.co/OCVIc3EaFQ"][".@AjitPaiFCC’s proposal to repeal #NetNeutrality slams the door shut on entrepreneurs and the internet as we know it. #SaveNetNeutrality\nhttps://t.co/qy0CpZKYhl"]["Second day of debate – and the #GOPTaxPlan is still a GUT PUNCH to America’s middle class. #RonReport https://t.co/ODVTBxmRG8"]["The American people don’t like the #GOPTaxPlan. They KNOW it’s a con job on the middle class. The @stevenmnuchin1 Mnuchin Rule is the BIGGEST LIE."]["DON’T BE FOOLED -  Massive giveaways to corporations are NOT going to pay for themselves. Trickle down doesn’t work."]["The Mnuchin Rule is now a broken promise for the books. Right now, Republicans are rushing to pass a #GOPTaxPlan that rips off working people to shower trillions of $ in handouts to corporations and tax cheats. https://t.co/frI6AnWB1W"]["\"Any reductions we have in upper-income taxes will be offset by less deductions so that there will be no absolute tax cut for the upper class.\" @stevenmnuchin1, remember when you said this to @CNBC a year ago today?"]["It’s a BIG DAY for @stevenmnuchin1 - the 1-year anniversary of the Mnuchin Rule. #TBT https://t.co/dkwQTZpqqG"]["Join me on the Senate Floor for #GOPTaxPlan debate. I know @stevenmnuchin1 won’t want to miss this. #MnuchinRule https://t.co/anHvbbnVwg"]["FACT CHECK – The #GOPTaxPlan is NOT going to pay for itself. The bill has a net cost of 1 TRILLION over a decade, according to non-partisan @jctgov. https://t.co/GbOIggxGiq"]["I’m LIVE on the Senate floor sharing @jctgov analysis of #GOPTaxPlan. https://t.co/QBesPKWamD"]["REMINDER: The #GOPTaxPlan is not only a tax bill - it’s a Republican attack to TAKE AWAY health care. https://t.co/ZcDrVOFIHN"]["It’s here in black and white. Republicans are rushing their con job on the middle class to COVER UP devastating tax hikes. https://t.co/ycivCXeOZu"]["The floor fight on taxes is ON. Americans deserve to know the consequences of the #GOPTaxPlan. I’m not going to stop fighting for American values. #RonReport https://t.co/Qz1BR5auoB"]["Democrats believe our tax code is broken. There is bipartisan agreement that this system needs a major overhaul. Let’s give this another shot. The #GOPTaxPlan is not the answer."]["The #GOPTaxPlan is built on an economic double standard. https://t.co/SrDuFRC9wM"]["Make no mistake – millions of working and middle class Americans will see their taxes increase under the #GOPTaxPlan. Who wins in this plan? Tax cheats and multinational corporations."]["The #GOPTaxPlan is a con job on the middle class. I’m offering an amendment to send this bill BACK to the @SenateFinance committee and have a true bipartisan process. https://t.co/aHoyN21o9J"]["Republicans are already saying “entitlement reform” and “welfare reform” are up next. DON'T BE FOOLED -- that’s just code for attacks on Medicaid, Medicare, Social Security and anti-hunger programs."]["REMEMBER, working Americans and families will be on the hook for massive handouts to multinational corporations."]["What does #GOPTaxPlan mean for the middle class? Everything will become more expensive:\n- Buying a house\n- Buying a car\n- Getting a credit card\n- Taking out student loans"]["Every day there’s more frightening news about how the #GOPTaxPlan will hurt working and middle class Americans."]["That is NOT what was promised in the 2016 campaign. That’s NOT what Republicans have spent month after month telling Americans their #GOPTaxPlan would do."]["If the #GOPTaxPlan passes, Washington will reach into the pockets of working Americans and cut a BIG CHECK to multinational corporations, tax cheats and the politically powerful."]["The Senate is 20 hours of debate away from a broken promise of historic proportions – the #GOPTaxPlan."]["Join me LIVE from the Senate floor where I’ll be speaking out against the #GOPTaxPlan – a massive con job and injustice to the American people. I’ll be turning it over to my staff. https://t.co/riUBg3A7eA"]["CEOs KNOW that the #GOPTaxPlan’s corporate tax giveaways don’t result in job growth and higher wages. Thank you, @toddcarmichael for speaking out. https://t.co/X710affqOw"]["Remember when Republicans said the #GOPTaxPlan would be good for the middle class? 👇 https://t.co/eOFjHLef6b"]["Repealing the individual mandate in the #GOPTaxPlan means premiums will be 10% higher EACH YEAR. https://t.co/imJfdSRyoW"]["@SenRubioPress @MarkWarner Our Student Right to Know Before You Go Act is the FIRST bill to use advanced encryption technology to protect student privacy during critical consumer information production. https://t.co/G1b1XccSM3"]["Today, I re-introduced my bipartisan bill with @SenRubioPress &amp; @MarkWarner to empower students and families. https://t.co/tXJFXuuILb"]["Either @realDonaldTrump doesn’t understand or doesn’t care that spreading hateful filth online puts American lives in danger. It is wrong &amp; a poor distraction from the Republican corporate tax handout &amp; his inability to deal on spending."]["Just 👏 get 👏 a 👏 warrant. https://t.co/DOy4KDvqOa"]["We need the courts and Congress to step up and make sure that our Constitutional rights don’t disappear simply because technology makes it practically effortless to violate them."]["The government does NOT have the right to see where you’ve been every second of the day  without a warrant. https://t.co/y70zHNIfoZ"]["REMINDER: Turning over profits to shareholders does NOT create jobs and boost wages for the middle class. Multinational corporations are already awash in cash. https://t.co/f8XarthQfv"]["This is RECKLESS HASTE and lives are at stake. Stop the #GOPTaxPlan. https://t.co/wvaAgr6Zju"]["Let’s not forget that the #GOPTaxPlan continues to be revised and rewritten behind closed doors. What we see here is a CON JOB on the middle class."]["The #GOPTaxPlan pays for trillions of dollars in handouts to corporations and the powerful specifically by taking money and health care AWAY from working people and the middle class."]["The #GOPTaxPlan has real consequences on children, families and seniors. I’m speaking out against the Senate bill with my friends, the @LittleLobbyists. #RonReport https://t.co/N8eYg4rBOP"]["The #GOPTaxPlan will be devastating for middle class and working Americans. I’m joining Americans speaking out against this tax con job: https://t.co/ZUtdhIOlWz"]["Our government made a promise to #DREAMers. Congress cannot go back on that promise now. It’s time to pass the #DREAMAct."]["I spoke with @jaketapper about how the #GOPTaxPlan is designed to collapse the #ACA and hurt those who need affordable health care. https://t.co/cd5QJ8Iyqj"]["I’m fighting the #GOPTaxPlan to give @LittleLobbyists and their families a fair shot! https://t.co/kUkHgZ6f0X"]["I’ll be joining @SenateDems to share what’s at stake under #GOPTaxPlan. Tune in to the Facebook Live at 5:00pm: https://t.co/KLZ4RTPKYJ https://t.co/kOv6J2n28J"]["Dismantling @CFPB goes back to the days when Wall Street bankers’ profits are valued more than Americans’ hard-earned paychecks. Protect consumers and #DefendCFPB."]["If @FCC @AjitPaiFCC repeals #NetNeutrality, #CyberMonday fans are in for a bad deal. It’s time to fight to #SaveNetNeutrality https://t.co/SKPNBNBKpb"]["The #GOPTaxPlan is moving at lightning speed and it’s out to hurt Americans and their families. Here’s what you need to know about the plan: https://t.co/y4o5Rw6Vut https://t.co/yj4vSEeEFT"]["Sign up for #OpenEnrollment NOW through December 15. Don’t miss your change to #GetCovered. https://t.co/dvJ3IJTEjn"]["The #GOPTaxPlan gives massive handouts to corporations at the expense of millennials and students. I'm standing up to this injustice. https://t.co/YgL7893NNs"]["Only 24 days left for #OpenEnrollment. #GetCovered on https://t.co/AD8JO5gcqN https://t.co/lSzRZdYYpt"]["Thanks, @SenBillNelson for having me! https://t.co/SMCaU34Y79"]["I stand for policies that preserve the Internet as a platform for learning, speech and commerce and a level-playing field for businesses. By rolling back the current rules, Chairman Pai is doing the opposite. https://t.co/uKnuPupLem"]["Everyone – consumers, rural Americans, small businesses – except Big Cable LOSES with this proposal. Americans deserve a free and open internet. #NetNeutrality"]["It’s official. @AjitPaiFCC plans to shred the @FCC's 2015 Open Internet Order and destroy #NetNeutrality protection. https://t.co/6N9sZvGqS6"]["Everyone needs access to affordable health care. The #ACA is helping make that possible. Sign up for #OpenEnrollment at https://t.co/AD8JO4YBzf #GetCovered"]["While you’re reaching for the cranberry sauce this week – congressional Republicans will be reaching into your wallets. Stay tuned for the #GOPTaxPlan fight. https://t.co/OxF4lc6zPS"]["I will never stop fighting to ensure #transgender Americans are treated equally. We must all keep working toward a country where LGBTQ people are met with the love, respect and acceptance every person deserves."]["Today is Transgender Day of Remembrance. I’m taking time to remember the lives lost to violence and hate. #TDOR #TransWeek https://t.co/IU8Cjff4k8"]["The #GOPTaxPlan is not just an awful tax plan – it’s an ATTACK on your health care. It’s time we make our voices heard and STOP this bill. https://t.co/eAxd72z719"]["Only days ago the Keystone pipeline dumped 210,000 gallons of oil onto rural South Dakota - and cleanup is ongoing. The Keystone XL Pipeline puts our environment at risk only to benefit foreign oil executives, NOT American consumers: #NoKXL https://t.co/HWg2aT6348"]["The administration left out something CRITICAL in its disaster aid request – much needed aid for communities hit hard by wildfires and a permanent funding fix. We must #EndFireBorrowing."]["The Trump administration has a responsibility to help Americans in Puerto Rico, the U.S. Virgin Islands and communities across the West recover from record-breaking wildfires and other natural disasters. This funding request is woefully inadequate."]["Oregonians, need assistance enrolling in health care? Find help near you and #GetCovered: https://t.co/WjKFYWc6JC"]["Great read about an exciting journey &amp; what it means for all the fantastic progress at Pendleton’s new hangar. Good news for all of Eastern Oregon. https://t.co/y8ilJIcHhc"]["THE VOTES ARE IN: Senate Republicans put corporate handouts over the health and well-being of America’s middle class. 🚨 SPEAK OUT. The time for action is NOW. 🚨 #RonReport #GOPTaxPlan https://t.co/i4qMeHe8jw"]["This is indefensible, partisan legislation, and this is a dark day for this storied committee. But Democrats will continue to fight."]["Don’t forget - 13 million Americans are going to get kicked off their health care. Premiums will skyrocket for millions more. All because of massive handouts to corporations."]["Because of the #GOPTaxPlan, millions and millions of low-income and middle-income Americans are going to get HIT with a tax hike they can’t afford."]["@RoyBlunt @USTreasury It’s going to stifle investment, hiring, and HURT communities where the craft beverage industry is primed to take off. #GOPTaxPlan"]["@RoyBlunt The @USTreasury has told us that a 2-year provision would expire before they can even write the regulations to implement it."]["@RoyBlunt A short-term proposal puts small brewers, vintners, cider makers &amp; distillers in a position where every year or 2 they have to grovel for lawmakers to extend their tax incentive."]["@RoyBlunt The #GOPTaxPlan makes it temporary, and turns it into a full employment program for lobbyists paid to keep it from dying."][".@RoyBlunt and I wrote a bipartisan bill contributing to jobs in the beverage industry. What’s in the Chairman’s modified mark is NOT our whole bill. Instead - it’s a 2-year version."]["Bottom line - Tax cuts for hard-working families should NEVER, ever be held hostage to lock in tax cuts for corporations. #GOPTaxPlan https://t.co/bOmgArjUI6"]["Making tax cuts for families contingent on tax cuts for multinational corporations in #GOPTaxPlan is WRONG, reckless, and the kind of cynical legislating the American people find revolting."]["FACT CHECK – The Senate #GOPTaxPlan child tax credit does NOT help lower income Americans. @SenBennetCO, @SenSherrodBrown and @SenBobCasey have an amendment to help all families.\nhttps://t.co/lmI03fxntH"]["Have questions about enrolling in #ACA health care? Get answers. #GetCovered: https://t.co/ws9e4BLuNk"]["The allegations against Sen. Franken are serious. Harassment in any setting is clearly unacceptable. The Ethics Committee should investigate this matter."]["Senate Republicans need to face the facts instead of trying to obscure them. https://t.co/M3GrcQPLRR"]["@jctgov @SenateFinance @SenSherrodBrown @realDonaldTrump When the history of the @SenateFinance Committee is written, this will be a dark, dark chapter."]["@jctgov @SenateFinance @SenSherrodBrown @realDonaldTrump It’s easy to see this #GOPTaxPlan process is about getting this bill out of committee and back behind closed doors."]["@jctgov @SenateFinance Yesterday @SenSherrodBrown proposed an amendment to keep red, white and blue jobs from going overseas. @realDonaldTrump has TWICE said he supports it. Senate Republicans BLOCKED it."]["@jctgov @SenateFinance Americans, while you’re reaching for the cranberry sauce, Republicans are going to be reaching for your pocketbooks to give handouts to multinational corporations."]["@jctgov This is shameful and reckless haste. And once this @SenateFinance process wraps up, the #GOPTaxPlan is back behind closed doors."]["@jctgov Senate Republicans, why is it a good idea to hike taxes on parents who are barely staying afloat to pay for a massive corporate handout?"]["@jctgov In 2027 – Families earning $75,000 and under would have a tax hike of $27 BILLION. Meanwhile,  multinational corporations get a PERMANENT CUT."]["Day 4 of the @SenateFinance #GOPTaxPlan markup - Senate Republicans want to write tax policy in the dark. Democrats are turning the light on Republican double standards. Handing it off to my team. WATCH: https://t.co/fAoXHtTTzr"]["JUST IN: Not only are Republicans trading Americans' health care for corporate handouts, but they shot down every amendment for veterans, Medicare &amp; Social Security and red, white and blue jobs. Recap of @SenateFinance #GOPTaxPlan markup day 3 #RonReport https://t.co/QgmSzDF01c"]["The public is not going to get any time to see what the House and Senate Republicans hash out. Americans deserve to know where the Senate stands on the House #GOPTaxPlan."]["Tonight @SenBennetCO gave Republicans a chance to protect Social Security and Medicare from cuts caused by their plan. They voted NO."]["The revisionist history in this room is shocking. Republicans claiming to be solving problems in the economy but they conveniently forget that Republicans CAUSED those problems in the first place. How can they be trusted to FIX them?"]["These are amendments that impact millions of Americans, and we’re hastily rushing through this #GOPTaxPlan markup. We NEED time to ask questions. The American people deserve answers."]["I can’t say it enough. TEMPORARY tax cuts for the middle class to pay for PERMANENT tax cuts for multinational corporations is wrong. That’s the #GOPTaxPlan. https://t.co/YPRheuAnQl"]["It's time we melt away the façade on the caribou for millionaires bill. If congressional Republicans line the pockets of oil company executives with this bill, the damage to our nation's treasures cannot be undone. https://t.co/JeDwwLUkc9"]["Now Republicans are pushing to take away one of the last wild places on Earth and transform it into an industrial landscape. #ProtectTheArctic https://t.co/PvXYPrVhl6"]["For congressional Republicans, it’s not enough to take away health care from millions by making the middle class pay for multinational corporation tax cuts."]["Millions of Americans are going to lose their health care, see their premiums skyrocket, and get hit with a tax hike – all to give multinational corporations massive handouts. https://t.co/wWqgNeDo6Q"]["Bottom line - My colleagues on the other side have shown their hand. For middle class families, this deal is looking worse and worse."]["Does the Treasury Secretary remember when he said the administration would draw a line in the sand for permanent breaks for multinational corporations. But where are they now when it comes to helping middle class families?"]["Today, Americans are learning that what they’re getting out of the bill as individuals is TEMPORARY, and what corporations are getting is PERMANENT, set in stone."]["Let’s not kid around. This is not just a another attack on the Affordable Care Act. This is repeal of that law and officially a health care bill."]["Cut to yesterday 1:30pm- The new scheme? Permanent corporate tax cuts should be paid for, in part, by kicking 13 million Americans off their health care and raising premiums for millions more."]["This #GOPTaxPlan proposal seems to be getting worse by the hour. It began as a tax hike on nearly 14 million Americans to pay for multi-trillion dollar handouts to corporations and new loopholes for tax cheats."]["I’m back in @SenateFinance on markup day 3 to protect the middle class and wage earning Americans from a #GOPTaxPlan that gets worse by the hour. My staff will be providing updates here. Tune in: https://t.co/VnnYQGciWe"]["The deficit hawks flew away when $1.5 trillion in corporate handouts were on the table. Now they're flying back to demand CUTS to Medicare, Medicaid and Social Security.\nhttps://t.co/Ir8jmLXcom"]["ATTN: Senate Republicans are trying to pull off a backdoor repeal of the #ACA by raising health insurance premiums for millions of Americans. Day 2 of @SenateFinance #GOPTaxPlan markup #RonReport https://t.co/DTFwOsZf5r"]["It seems the Republicans in Congress can't go to lunch without hatching a plot against American families. https://t.co/sUcP7RZTBV"]["Senate Republicans raising middle-class Americans’ premiums exposes the #GOPTaxPlan for what it is – a massive con job on the American people. My statement on the inclusion of individual mandate repeal: https://t.co/MTCxceApWn"]["I’m speaking with teachers, seniors, individuals with disabilities, and families facing high medical expenses that would be devastated by #GOPTaxPlan. Tune in: https://t.co/Afyr1HCXhQ"]["@SenateFinance Members will have less time to debate and amend this bill. That is not in the public’s interest. https://t.co/2EzmDnGDAm"]["@SenateFinance Millions and millions of middle class families are going to pay higher taxes under this proposal. It’ll open up a bonanza of new loopholes for multinational corporations. \nhttps://t.co/qKfaiW9t4L"]["@SenateFinance This is even more evidence that @SenateFinance isn’t ready to move with a bill that makes trillions of dollars of changes to the tax code. This does NOT resemble the regular order – it’s reckless haste."]["@SenateFinance It’s day 2 of markup – committee members STILL don’t have the bill text. How can we write up legislation when we don’t have text? The questions members ask today may not be relevant in 5 or 10 hours."]["What’s happening right now in the @SenateFinance markup is not right. Last night, Democrats were told we’d receive a modified Chairman’s mark first thing this morning. But where is it?"]["I'm turning it over to my staff. Follow along for updates."]["It's day 2 of the @SenateFinance #GOPTaxPlan markup. Democrats will be asking tough questions about the impact on wage earning and middle class Americans. Tune in LIVE:  https://t.co/hQ6pmDpelb"]["Day 1 of the @SenateFinance markup is over, and Democrats are determined to stop Republicans’ middle class con job. I’ll be sharing markup updates here each night. #GOPTaxPlan #RonReport https://t.co/ozonYZI0Oz"]["@SenateDems @SenateFinance I’ll be holding Senate Republicans accountable for their middle class con job. Tune in and follow @SenateFinance for updates. #GOPTaxPlan"]["@SenateDems @SenateFinance Middle class families will face tax increases. Why? Because Senate Republicans want to shower multinational corporations with massive tax cuts."]["@SenateDems @SenateFinance Middle class and wage earning Americans are already uncertain about their economic futures. And as I’ve heard at my town halls, they are afraid of this plan."]["Today begins the @SenateFinance markup of the #GOPTaxPlan, a bait-and-switch on the middle class: https://t.co/QJ3CNrtFdi"]["@realDonaldTrump @HHSGov Health care is too personal to be driven by politics. I’ll be asking tough questions. https://t.co/HGRDD7jWb5"][".@realDonaldTrump hasn’t done a thing to bring down drug prices. Today, he nominated a pharma executive to lead @HHSGov. https://t.co/1HPIVeCLRK"]["Sign up for #ACA #OpenEnrollment before December 15. ➡️ Visit https://t.co/AD8JO4YBzf to get covered today."]["Honored to be in Salem today on #VeteransDay with veterans &amp; their families saying a huge thank you for their service and sacrifice. https://t.co/FOoESO3j37"]["📢 #GetCovered 🖥️ 👇https://t.co/AD8JO4YBzf"]["Proud to be with so many incredible Oregon veterans &amp; their loved ones this #VeteransDay at Albany’s always-awesome Veterans Day parade. https://t.co/YRbp8TDFtZ"]["Thanks Junction City for last night’s outstanding Lane County #2017townhall. This #VeteransDay &amp; every day, we thank our veterans for defending the participatory democracy Oregonians treasure. https://t.co/eR3k0SbHIi"]["Great to hear about &amp; see all the outstanding innovation during today’s visit to @Arcimoto in Eugene. https://t.co/wsEDzN61WP"]["Heard this #VeteransDay weekend in Eugene from veterans &amp; their advocates about the urgent need to redouble efforts on reducing suicide rates among vets. https://t.co/0gs3HsC5f3"]["Enjoyed meeting Marlena War Bonnet this morning at the @vaportland. Veterans health=top priority this #VeteransDay weekend &amp; every day. https://t.co/V3RBwNhCqy"]["Listening w/great allies @RepBlumenauer &amp; @RepBonamici at @vaportland about need to reduce troubling veterans suicide rates in Oregon &amp; the West https://t.co/Evr5sEMC4h"]["Families have been kept in the dark by how they’ll be harmed by the #GOPTaxPlan. With only 4 days, I'm racing to do the math and shine a light on what Congressional Republicans don’t want you to see."]["Middle class and wage-earning Americans are already uncertain about their economic futures as we near the holiday season, Republican tax bill adds layer of fear."]["Senate Republicans released tax bill rewriting American economy; 4 days until @SenateFinance markup and NOT A SINGLE hearing. This legislative malpractice is wrong."]["Great talking with Rebecca and her family from Salem, OR about why ALL families need access to affordable health care. https://t.co/xLl7UYRh6X"]["The time is now for Congress to pass a clean #DreamAct. I’m proud to stand with the hardworking #Dreamers who made their voices heard today. https://t.co/bzMR4BAKIy"]["🤔 If only there was some way to verify this… #ReleaseTheReturns https://t.co/pclp4ZKvCd"]["Thank you, @SenJeffMerkley, @SenToomey, @SenatorBaldwin, @SenThomTillis, @SenatorShaheen, @SenRubioPress, and @SenatorCollins for joining in a bipartisan effort to not let reported human rights violations go unaddressed."]["I’m calling on @StateDept to investigate reported persecution of LGBTQ people in Azerbaijan. U.S. foreign policy must promote both our values and our interests. https://t.co/uIYMmP92kn"]["Proud to join @JohnBoozman today to speak on our bipartisan law that corrects a glaring injustice for wounded members serving in the @USNationalGuard and Reserve. #GIBillFairness https://t.co/cROayHtVHF"]["Let’s make sure this promise about workers getting a $4,000 raise isn’t just an empty Republican talking point."]["Let’s be clear – the #GOPTaxPlan is huge tax cut for corporations. If Congressional Republicans truly believe the trickle-down myth - they need to stand by it."]["@realDonaldTrump It’s time to limit ALL presidents’ spying powers and protect the Constitution. It starts with the USA RIGHTS Act. #Section702"]["@realDonaldTrump Lawmakers must ensure that the government doesn’t have unchecked surveillance powers making the abuses the President wants so easy. #Sec702"]["@realDonaldTrump Some politicians want you to trust there isn’t anyone in the government who will do what the President is publicly begging them to do."]["Straight from the authoritarian playbook, @realDonaldTrump is directing government officials to investigate his political enemies. https://t.co/OgD2xTG6EF"]["Open enrollment is going strong. If you need health care, enroll today at https://t.co/AD8JO5gcqN #GetCovered https://t.co/NasRbX7eXO"][".@realDonaldTrump, it's not really winning when the U.S. is first place in the race to the bottom. #COP23 https://t.co/nUtHHaE9bq?"]["I’m joining @TaxPolicyCenter’s Mark Mazur this morning to discuss the #GOPTaxPlan. @urbaninstitute #LiveatUrban https://t.co/7VK4KGbTmr"]["Share your story on my website: https://t.co/0KJnkWXPBQ https://t.co/SZh896SPI2"]["This tax bill is riddled with double standards that are hard on wage earning families. I need to hear your stories.\nhttps://t.co/zHsoY5j27X"]["Looking forward to Lane County this Friday for my 78th #2017townhall this year in Oregon. Details here: https://t.co/fj1BTSthbJ"]["Thanks Washington, Clackamas &amp; Marion counties for such great #2017townhalls this weekend."]["Enjoyed visiting all the great vendors at yesterday's @AdelantesMujeres farmers market in Forest Grove. Small biz drives much of Oregon econ https://t.co/NoSL3QOMGX"]["Congressional Republicans are looking out for Wall Street - not Main Street. My op-ed for @FortuneMagazine: https://t.co/O37GjeF2Yh"]["Thanks. Great meeting with @MET_PDX — steadfast allies in our work to make our community &amp; world a better place free of prejudice. https://t.co/z9ws7GW0Fs"]["The only way to stop this gruesome procession of gun tragedies is to act. At every level, America needs action, not words."]["Enjoyed meeting w/these smart @CelticTerritory students after today’s #2017townhall in Keizer. Great ?s abt DACA, women’s healthcare &amp; more. https://t.co/8alIX8c4aM"]["Thnx Marion County for attending my 76th #2017townhall this yr. Great conversation in Keizer on education, Russia, tax reform &amp; healthcare. https://t.co/dXICG2QNYu"]["Heard at today’s ClackCo #2017townhall in Sandy about climate change/wildfires , healthcare, net neutrality &amp; need for actual tax reform. https://t.co/7mrld5C135"]["Enjoyed catching up w/ OR Treasurer @tobiasread at today’s WashCo #2017townhall. He’s a great ally in the work to boost retirement savings. https://t.co/Br9Z2SVDYz"]["Thnx @TigardTigers for hosting today’s Washington County #2017townhall. Great discussion abt tax reform, #DACA, healthcare &amp; net neutrality. https://t.co/BoFq1VQfw4"]["The House Republican tax bill hurts wage earning Oregonians. I want to hear your story. https://t.co/DD25N4JeTj https://t.co/OmEwUCFpeO"]["cc: @EPAScottPruitt https://t.co/a50FWyy0Gw"]["Oregonians, have you signed up for #OpenEnrollment? #GetCovered today ➡️ https://t.co/AD8JO5gcqN https://t.co/vPB0Nsy6bD"]["Very impressed w/the new permafrost exhibit at @OMSI — where Oregonians &amp; visitors can learn the facts about climate change. https://t.co/vxB5B7ql0s"]["No matter how you play with the math, this is a massive tax increase on the middle class in the end. 👇 https://t.co/bwiTdHBXpi"]["Eager to hear from Oregonians today &amp; this weekend at these four #2017townhalls: https://t.co/fj1BTSthbJ"][".@realDonaldTrump may be silent about #openenrollment, but we are not. https://t.co/kzZl0Z9hm9 is open for business. #GetCovered today!"]["Spoke to @chrislhayes last night about the indictment of Paul Manafort and the importance of releasing Trump's tax returns."]["Paul Manafort is not going to be able to sweep this indictment under those expensive rugs he bought. https://t.co/SMNyALZEov"]["I believe in calling things what they are. Russia has descended into fascism. https://t.co/8WL72AKYti"]["@POTUS Bottom line, this entire bill is about putting an economic double standard into black letter law – and the American people won’t like it."]["Medical expense deduction: gone. @POTUS didn’t tell seniors during his campaign that they'd lose the ability to deduct health expenses."]["College grads will lose their write-off for student loan interest, but corporations will still be able to write off their interest payments."]["Corporations will still get to deduct their state and local taxes, but individuals and families won’t."]["It’s a double standard. Corporations get permanent breaks while wage-earning families get the rug pulled out from under them."]["The bill's about giving enough crumbs to some of the middle class to distract from multi-trillion $ giveaways &amp; shipping jobs overseas."]["Republicans released their middle class con job. @SenSchumer, @NancyPelosi, @RepRichardNeal &amp; I are speaking out \nhttps://t.co/8lvnTHFnCQ"]["@SenJeffMerkley @POTUS We must protect this Oregon treasure and its irreplaceable qualities. #KeepItPublic"][".@SenJeffMerkley and I are pushing back on @POTUS’s secret, error-riddled Cascade-Siskiyou Monument report. https://t.co/C1NsM0N9BR"]["Share widely → #OpenEnrollment begins today. #GetCovered on https://t.co/AD8JO5gcqN today until December 15. https://t.co/GHSolZZy4b"]["The middle class will be the ones paying the price for the Republican tax scam. @SenStabenow &amp; I are speaking out: https://t.co/ogiG6D7TZa"]["This isn't a real concession, it's a head fake. Between new passthrough loophole &amp; capital gains rate, this is a rate no one will pay. https://t.co/3up7Q42E4X"]["Americans deserve answers about Russia’s use of social media to influence our election. https://t.co/I7Za1KHc3u"]["The more Americans learn about what Congressional Republicans want to do on taxes, the less they’re going to like it https://t.co/kXmwPM39TW"]["The Republican tax scam is less simple, less fair, and less hopeful to the hardworking middle class who’d like to save &amp; get ahead."]["Instead, they’re breaking promises behind closed doors to the middle class and making plans to snatch away your 401k."]["Republicans have over-promised their mega-wealthy supporters more than $4 trillion in tax promises &amp; have virtually no revenue to pay for it"]["Republicans can’t keep their hands off 401(k)s &amp; the middle class is in for a scare. Join me &amp; @SenateDems 11:00EST https://t.co/rSFTGwwHNn"][".@realDonaldTrump’s awful ban on transgender troops is un-American &amp; makes us less safe. Glad a federal judge agrees https://t.co/yeBhvP5VD6"]["Remember, @realDonaldTrump STILL hasn’t released his taxes. My statement on the indictments against Trump campaign officials filed today: https://t.co/1vhmHyMkCj"]["Alarming reports, working to get all the facts about possible illegal toxic waste dumping at Hanford https://t.co/hM3DjVdWnZ"]["@SecretaryZinke I called on @Interior to reverse course. Don’t price American families out of visiting our national parks: https://t.co/abhxqQWUCz"][".@SecretaryZinke cuts costs for oil companies, but raises fees for American families to visit national parks https://t.co/NmlkHuAC0U"]["About Trump's corporate tax cut helping workers ... CEO's have something else in mind: windfalls for Wall Street. https://t.co/BwvuLV80j5"]["Visited the “I Am Not Invisible” exhibit honoring Oregon’s female veterans. I’m so grateful for their strength and service. @OregonDVA https://t.co/5tObPoxgyy"]["Impressed w/these amazing women investors talking this week @xxceleratefund in PDX about need to invest in women entrepreneurs/startups. https://t.co/cbYwwCTBns"][".@SenatorCantwell and I asked @USGAO how &amp; why Whitefish Energy got $300 mil contract for Puerto Rico: https://t.co/o0mXerMzV2"]["The tax debate is coming, and Republicans want it over before anybody catches on. Sounded the alarm today: https://t.co/Nv79jvrh0k"]["Great to have such strong bipartisan &amp; national support for my bipartisan #firefix to #EndFireBorrowing https://t.co/3BUuLPthfN"]["My bipartisan Wildfire Disaster Funding Act will end fire borrowing for good. Must-pass this year. #EndFireBorrowing"]["The cycle of fire borrowing must end. Fire prevention saves communities and lives. Forest Service needs the $ to do it. #EndFireBorrowing"]["Years of fire borrowing have allowed fuel for wildfires to build up, increasing the danger to lives and property #EndFireBorrowing"]["Budgeting for wildfires is BROKEN. The problem is “fire borrowing.” When firefighting $ runs dry, gov’t siphons $ from fire prevention"]["In Oregon, Eagle Creek fire, Chetco Bar fire &amp; more have burned more than half a million acres. Ash fell on Portland like snow."]["Wildfires have devastated Oregon &amp; the West this year. Fires are getting bigger, hotter, costlier to fight https://t.co/Xi1M6aJ0zN"]["My path to marijuana reform gets us to legalization responsibly:\nhttps://t.co/T8yzN3x5zA"]["Federal policy on marijuana is way behind the times and a big majority of the American people know it: https://t.co/nG8ake7XdU"]["More to say soon, but remember: you can still get health care for you and your family. November 1-December 15, go to https://t.co/AD8JO4YBzf"]["Health plans change year to year – that means looking around for the lowest price and the best benefits before the Dec. 15 deadline"]["You could get help - financial aid is available for 8 of 10 people. 2/3s of Oregonians bought a plan for $50 or less per month last year"]["Open enrollment for health insurance in Oregon starts in 7 days on Nov. 1 and runs through Dec. 15. You can shop at https://t.co/AD8JO4YBzf"]["PSA: There’s a lot of confusion in Oregon and across the country about buying health care. So here are some facts."]["1st it was the new Grocery Tax. Then nixing State &amp; Local Deduction. Personal &amp; dependent exemptions. Now 401(k)s. Middle class always loses"]["Why is it every plan Republicans in Congress put forward to pay for tax cuts for the wealthy reaches straight into middle-class pockets? 🤔"]["Nixing State &amp; Local Deduction isn't about red vs. blue. From WI to TX, it means taxing millions of Americans TWICE https://t.co/uhTjHyKkDX"]["Huge congrats to @FriendsNational for today’s great expansion news of the ground-breaking program to help more kids. #ChangetheStory https://t.co/NdvQn4Rc5q"]["The government wants Congress to extend 702 spying but won’t say what powers it provides.  RT to say we deserve answers, not secret law."]["@RepZoeLofgren @JudgeTedPoe @MartinHeinrich @SenSanders @SenWarren @SenatorTomUdall\n@SenatorBaldwin\n@SenJeffMerkley\n@maziehirono\n@SenMarkey\n@SenatorTester\n@RepBetoORourke"]["Proud to work with strong allies co-sponsoring USA Rights Act: @RepZoeLofgren @JudgeTedPoe\n@MartinHeinrich @SenSanders\n@SenWarren https://t.co/DSTJyW9U6n"]["Meanwhile the Senate Intelligence Committee is debating this law in secret today. I objected to that: https://t.co/kfocN9QePG"]["It’s pretty simple. The USA RIGHTS Act says target foreign intelligence, but get a warrant to search Americans’ communications."]["It ends warrantless backdoor searches of Americans &amp;focuses FISA Section 702 spy program on real overseas threats. \nhttps://t.co/lKUErmQy20"]["Introduced the USA Rights Act today with @RandPaul and bipartisan coalition that knows liberty and security aren’t mutually exclusive. https://t.co/gQoGHEAyD0"]["👇 @SenateFinance thread on the gulf between what Trump says he wants on taxes and what Republicans are delivering https://t.co/eCF5HzNS5K"]["Think Trump's excitement that the budget passed might have anything to do with this? #ReleaseTheReturns https://t.co/hf7KvjHNxx"]["Targeting middle-class retirements to line the pockets of big corporations and the mega-wealthy might be the @GOP's worst idea yet. https://t.co/kKQ9mgIEvI"]["Massive corporate rate cut, estate tax gone, huge new passthrough loophole for tax cheats &amp; the wealthy. A 4th bracket is just a head fake. https://t.co/WtYFjr11lR"]["@SecretaryPerry I’m demanding @FERC withdraw this @DOE rule that will falsely prop up Big Coal and raise utility rates https://t.co/k0OSasumoA"]["If you pay an electric bill @SecretaryPerry is taking money out of your pocket and giving it to coal executives https://t.co/p0mxBXwp1S"]["I warned in January that Director Pompeo’s views on Russia shifted with those of the president. Today is more evidence of that sad fact."]["In fact, intelligence agencies didn’t look at how Russian interference affected the election. https://t.co/lNwfWy1CeZ"]["Today Director Pompeo mischaracterized the Intelligence Community's report about Russia’s impact on the election. https://t.co/mOqqO6ToZ2"]["Inaction in Congress is making wildfires worse. Time to fix the broken system of funding and fighting wildfires: https://t.co/V9JwHTrSi3"]["Once again, the Trump rhetoric on tax reform is completely out of touch with reality. https://t.co/otAg8TfUsB"]["I pushed the Dept. of Homeland Security to make government email more secure. This week, they finally listened. https://t.co/CFjUCqqOFV"]["Mr. Sharpley gave away his only copy of the torture report. He won’t commit to protecting a Russia report. I will oppose his nomination. https://t.co/f2LPc4vQjL"]["We can’t let the GOP open the Arctic National Wildlife Refuge to oil &amp; gas drilling or sell off public lands #KeepItPublic\n#ProtectTheArctic https://t.co/lzWbJRphbq"]["@senorrinhatch No child should be unsafe in foster care yet far too many are. Our legislation increases oversight of child welfare https://t.co/eZqK20bLHf"]["@senorrinhatch What’s even more outrageous is that efforts to fix flaws in the system have been held up by stonewalling in the United States Senate."]["@senorrinhatch The system has so little oversight the government can’t even collect data about gaps in the system that advocates tell us are getting worse."]["@senorrinhatch It exposes widespread failure to protect children at every level of our child welfare system."]["@senorrinhatch Our investigation examined the circumstances around multiple cases of child abuse, neglect &amp; even child deaths."]["Released bipartisan investigative report with @SenOrrinHatch today on privatization of foster care https://t.co/NdPEMLlp03"]["Now the White House Dept. of Alternative Facts is out with this hocus-pocus math. A con job on the middle class."]["Wrong. The Trump team is hiding a recent Treasury report showing that the wealthiest shareholders are the big winners from a corp tax cut. https://t.co/Fc0FsORlEI"]["Congrats @ThornsFC. All of us in Soccer City USA are thrilled by today's #NWSLChampionship win."]["Can't wait for @ThornsFC to bring back the #NWSLChampionship today to Soccer City USA -- right where it belongs."]["Healthcare, #DACA, Iran agreement, wildfires &amp; more made for a serious &amp; good Wasco County #2017townhall discussion tonight in The Dalles. https://t.co/hFp0zQO8Y2"]["Hearing from Oregonians at this week's #2017townhalls about need right now to fix the badly broken system of wildfire funding."]["Heard during today's Union County #2017townhall in La Grande about need for real tax reform, good healthcare &amp; Russia investigation. https://t.co/cM5BzyYlOS"]["Great to catch up at today's Union County #2017townhall with @eoumountaineers student body president &amp; #DACA star Daysi Bedolla. https://t.co/HezDtHh5vK"]["Good #OregonWay conversation at tonight's Baker County #2017townhall on ag economy, wildfires, North Korea, #DACA, rural healthcare &amp; more. https://t.co/WirgxovYOI"]["Thanks Nyssa HS for hosting today's great Malheur County #2017townhall to discuss #DACA, healthcare, economy, net neutrality &amp; more. https://t.co/gDxYyQVvdF"]["Congress may renew a major spying program, but the Trump admin won’t tell the public how it impacts Americans. That’s unacceptable. https://t.co/enKnChUAWg"]["Eager to hear from Oregonians at #2017townhalls Thursday &amp; Friday in Malheur, Baker, Union &amp; Wasco counties: https://t.co/fj1BTSKS3h"]["It is more important now than ever to use the strongest protections for Americans data &amp; devices."]["This is an ignorant view of encryption and will make Americans less safe. https://t.co/R25KC32geN"][".@SenBobCasey laying out how Trump &amp; GOP tax plan RAISES taxes for the middle class. Not the tax cuts Trump is claiming. https://t.co/HraSyk5FJP"]["Who benefits from the GOP’s giveaway? Big coal.  \n\nWho gets hurt? Your wallet. \n\nA winning equation only for Big Coal &amp; GOP fundraisers."]["Another corporate giveaway in the works by Trump &amp; GOP– this proposal will raise utility rates for American families https://t.co/EWfhMFfyuj"]["Great discussion at today's Multnomah County #2017townhall in Corbett about wildfires &amp; urgent need for tax reform that helps all. https://t.co/GQ2JgUlLP7"]["At @Portland_State w/ @brendatracy24 &amp; @SenJeffMerkley hearing why Trump admin. Is totally wrong to reverse work to stop campus sex assault. https://t.co/N9s7cfsNsz"]["Dismantling Clean Power Plan = one more glaring example how this administration can't grasp climate change reality:\nhttps://t.co/RUUFq2Pjlv"]["Great conversation today in Ashland with @ppsworegon friends &amp; allies in the fight to defend women's healthcare. https://t.co/uvuHd5Fwkn"]["So great to meet the new Dean of @Oregon_law @Marcilynn_Burke at today’s @OregonFootball game. #GoDucks https://t.co/UBAfJQeadP"]["Thanks to all the #Dreamers &amp; their advocates who spoke so eloquently today at the @uoregon about the urgent need for #DACA. https://t.co/7t1j0uMMRU"]["Can feel all the incredible #GoDucks energy tonight at @MattArena for @OregonVB. https://t.co/YbPSemnx0I"]["With @SenJeffMerkley in Portland today hearing incredibly powerful #DACA voices who will fuel our fight for all #Dreamers. https://t.co/XWF0R6pMe9"]["Shameful. You know who should be in charge of women's bodies? Women. Not employers. Not insurers. Not Donald Trump. https://t.co/KDqhTm39h8"]["This is another heartless, brainless attack on the civil rights of LGBTQ Americans: https://t.co/mttjFMCplV"]["The GOP tax plan is a heist to take trillions from Social Security &amp; Medicare &amp; give it to the wealthy in tax breaks. We will not stand for it. 15/15"][".@SenateDems laid out our principles on #taxreform. @SenateMajLdr rejected them within hours. That’s not bipartisanship. 13/"]["The Republican framework looks less like a real effort at tax reform than a shameless attempt to accommodate the president’s boasting about the biggest tax cut ever. 12/"]["#TrumpTaxScam means millions of middle-class Americans are facing the prospect of a big tax hike. 11/"]["Current middle-class tax breaks on the chopping block:\n❌The personal exemption. \n❌The state and local tax deduction. \n❌Incentives for retirement savings, education, home ownership, &amp; more.\n10/"]["When you do the math on what Republicans have on offer, you’re looking at upward of 4, 5, 6 TRILLION dollars in tax giveaways to the most fortunate. 9/"]["The top income tax rate goes down, the bottom income tax rate goes up. #trumptaxscam 8/"]["#TrumpTaxScam eliminates the AMT &amp; the estate tax, which today only touches estates worth more than 11 million dollars or 5.5 million for a single individual. 7/"]["There’s a brand new passthrough loophole -- the Grand Canyon of loopholes -- that invites tax cheats to skip out on paying their fair share to Social Security &amp; Medicare. 6/"]["The Republican tax cut framework green-lights the entire wish list for big corporations and the wealthy. 5/"]["There is no comparison between the bipartisan #taxreform I wrote &amp; the #TrumpTaxScam – ZERO. 4/"]["What GOP have offered in the Trump tax plan is a tax INCREASE to millions of middle-class families to pay for massive, unprecedented tax giveaways to corporations and those at the top. 3/"]["If you have a minute, I laid out exactly what real bipartisan #taxreform looks like. It is the opposite of what GOP is pushing. 2/ \nhttps://t.co/FY4oibYjxN"]["GOP claims that they have attempted to work across the aisle on #taxreform couldn’t be further from the truth. 1/"]["Retweet &amp; share WIDELY. https://t.co/GSOUNVnLwK"]["...let's not forget the $1.5 trillion tax giveaway to the wealthy and corporations. Hey, those numbers add up! https://t.co/V2IWsoIGqU"]["Big congrats to @OregonState researchers for this innovative help they're providing to Hurricane Harvey survivors: https://t.co/twP1ki00SP"]["American elections must be protected against cyber attacks. Wrote to 6 major voting machine manufacturers on their security protocols https://t.co/r7wOZUB4vD"]["I do not have confidence @AjitPaiFCC will stand up for consumers instead of kowtowing to Big Cable’s demands. I voted no on his confirmation."]["Given that Congress is completely unwilling to act to pass common-sense gun laws, it’s up to state legislatures to pass laws to protect their residents."]["Horrific news. Praying for the victims, their families &amp; friends, &amp; all those affected by this senseless act of gun violence."]["The #Trumptaxscam is an appalling threat to the middle class, and I'm going to keep calling out the lies."]["TAX HIKE on ONE IN THREE middle class households. 80 PERCENT of the benefit goes to the top 1%. This is Trump's con job on the middle class. https://t.co/NtfkIiWpr0"]["Just because you resign doesn't mean you're off the hook. @SecPriceMD must pay back every penny the taxpayers paid for his private jets."]["Good. Trump should nominate someone who is looking out for the taxpayers &amp; the country. https://t.co/Aopa1dBDMt"]["I've long held @SecPriceMD wasn't fit for office, the only question now is whether he should be allowed to take taxpayers for hundreds of thousands of dollars on his way out the door."]["#TBT when I called out @SecPriceMD on his unethical stock trades \nhttps://t.co/OwiPOMUgNI"]["Probably, Brian, probably. https://t.co/sOkaUPPsSI"]["@SecPriceMD As a public official, @SecPriceMD can’t just buy his way out of the misuse of private jets. The Inspector General and Senators are investigating."]["Until @SecPriceMD has paid back the full amount of his private jet flights he is still ripping off taxpayers https://t.co/ckFNMK1fu2"]["Trump &amp; his parade of millionaire minions are executing a middle-class con job. I’m taking down his lies on the Senate floor ⬇️ https://t.co/h71iUd1hvl #trumptaxscam"]["@AjitPaiFCC Watch shortly ➡️ My floor speech opposing his confirmation https://t.co/MpgYmFvhOJ"][".@AjitPaiFCC stands in the corner of Big Cable not consumers. Unacceptable for a FCC chairman."]["It's simple Mr. President - you can do more for Puerto Rico. Do more. https://t.co/WH12nJiK6U"]["⚡️ “Trump isn't telling the truth about his tax plan. So I am.”\n\nhttps://t.co/thaOTtRDFM"]["@ericgeller @KeithChu No."]["@realDonaldTrump Bottom line: Nothing in this #TrumpTaxScam for the middle class. Big, fat giveaways to Trump &amp; his friends."]["Hey @realDonaldTrump - what happened to closing the carried interest loophole? Remember this from your campaign? https://t.co/UrCGAGzNWW"]["#TrumpTaxScam to multinationals: Take the money and run (overseas)"]["@realDonaldTrump Congress did one-time tax holiday in 2004. What happened? NO jobs. COST taxpayer $$. REWARDED CEOs. Sad!"]["Quite the opposite @realdonaldtrump - #TrumpTaxScam rewards companies leaving the U.S."]["There is no repatriation rate in this plan. This is pure Trump speculation. #trumptaxplan"]["#TrumpTaxScam creates huge new passthrough loophole. Christmas morning for tax cheats &amp; a huge benefit to Trump &amp; his 500+ passthroughs."]["The #TrumpTaxScam rewards companies that sends red, white, and blue jobs overseas."]["More people will have a net tax increase. See pages 4 &amp; 5 of your #TrumpTaxScam plan. https://t.co/QvRP4hMCPg https://t.co/UHutp3jjJL"]["Eliminating the estate tax = another great example of how Trump's family would save billions under #TrumpTaxScam"]["This is not true. Only estates worth more than $11 million have to pay the estate tax. #TrumpTaxScam"]["Repealing the AMT *will* personally benefit you @realDonaldTrump based on your 2005 tax return. #TrumpTaxScam https://t.co/2AhyrcZcEu"]["A middle-class family with 4 children will LOSE at least $4900 of tax benefits under #TrumpTaxScam"]["Warning: I may go over 140 characters in my fact-checking. But I will try my hardest not to."]["The people who benefit from the #trumptaxscam ARE the donors, ARE the special interests, NOT hard-working, tax-paying citizens."]["The #TrumpTaxScam raises taxes on many middle-class families"]["Health care fact-check: There are NOT the votes for #GrahamCassidy"]["Fact-check: it is the biggest tax cut for the *wealthy* #TrumpTaxScam"]["Let the fact-checking begin #TrumpTaxScam https://t.co/JUIt7Ya8Az"]["Stay tuned for more fact-checking of Trump’s tax claims at 3:20 pm ET!"]["Remember this when the GOP tells you we can't afford health care for people with disabilities https://t.co/ewbgCSctjX"]["If this framework is all about the middle class, then Trump Tower is middle-class housing https://t.co/s89SypSAhI"]["This is a step backwards from multiple bipartisan deals to 3x standard deduction. This is a bad deal for middle-class families. https://t.co/yePSN85gI0"]["I will be live tweeting and fact checking Trump's tax \"reform\" speech this afternoon. And I don't need 280 characters to do it."]["Deeply concerned the Trump administration is using NAFTA 2.0 to undermine the internet as a platform for speech, innovation and US jobs."]["I doubt any conversations he wants to have in that booth are to the benefit of the American people https://t.co/KleyqpOw3K"]["This battle won't be the last, but I believe people power will win out against policies that hurt folks when they are the most vulnerable."]["You called. You emailed. You showed up. YOU saved access to affordable care for the American people. https://t.co/FN0PFZzNCI"]["Great read in @DailyAstorian abt Knappa mom Kerry Strickland's work w/Jordan’s Hope in the opioid abuse fight: https://t.co/akD3xSOXj3"]["We will not stop fighting! #GrahamCassidy cuts to #Medicaid devastating for people with disabilities. LIVE: https://t.co/9SYLGx1FWX"]["Good. Now Congress should pass my #FreeCreditFreeze Act https://t.co/avepnTdvzv"]["There is a humanitarian crisis in Puerto Rico and the USVI, @realdonaldtrump. Stop dividing our country and help these Americans."]["#Trumpcare zombie has come back to life too many times to quit fighting now. People power is working. Keep it up! https://t.co/SCDIILHxs9"]["CBO reports: Millions of Americans lose their coverage under #GrahamCassidy. That is NOT health care. https://t.co/LeHRHpMUtu"]["This is exactly why @senatefinance Democrats requested to have this #GrahamCassidy hearing in a bigger room. https://t.co/ncFTx4lALm"]["Follow @SenateFinance during the hearing for updates and real-time factchecks on#GrahamCassidy #Trumpcare"]["Your stories matter! @senatefinance Democrats read some of the 27,000+ constituent comments in meeting before #GrahamCassidy hearing. https://t.co/p4VuMsn6uH"]["#GrahamCassidy is a #PorkParade. Trying to buy off votes doesn't make a terrible bill any better https://t.co/nHMXuGZiXL"]["Make your voices heard now! Submit comments to the hearing record ➡️ gchcomments@finance.senate.gov"]["Instead GOP is jamming thru a bill that sends the cost of care skyrocketing for millions. All to chase an ideological trophy. #GrahamCassidy"]["Senate Finance Committee should have multiple hearings to consider #GrahamCassidy. One is a joke."]["On top of that, a still horrible new version of #GrahamCassidy was released late last night."]["We should not be having only one hearing on #GrahamCassidy. Yet here we are. It's set for TODAY at 2 pm ET. https://t.co/cuRQ9Ic8GG"]["As ranking member on cmte w/jurisdiction over health care, I've seen a lot of health care proposals. #GrahamCassidy is BAD POLICY &amp; cruel."]["#GrahamCassidy defunds Planned Parenthood. Cuts to #Medicaid prevent women from seeing the doctor they choose!"]["#GrahamCassidy cuts #Medicaid. 2 out of 3 seniors rely on #Medicaid to pay for their nursing home."]["#GrahamCassidy strips important protections like those for pre-existing conditions, lifetime caps, &amp; other essential health benefits."]["TOMORROW Senate is holding the one and only hearing on disastrous #GrahamCassidy. Make your voice heard now! https://t.co/HABTtANQV4"]["Sad to have to say this, but this is a lie. https://t.co/Nd7ZaBNXzI"]["Heard from Lane County at tonight's #2017townhall in Oakridge good ?s about education &amp; wildfires -- and real concern over #CassidyGraham. https://t.co/Qd7R34XoVV"]["In La Pine at my 4th Deschutes County #2017townhall. Focus on the #OregonWay seeking solutions for healthcare, wildfires, veterans &amp; more. https://t.co/zq7f5iHExl"]["Make no mistake - what @BetsyDeVosED did makes students less safe. Just awful. https://t.co/d1dwcw9ExR"]["Thnx @StaytonEagles for hosting today's great Marion County #2017townhall covering #GrahamCassidy, net neutrality &amp; college affordability. https://t.co/QnkVxQQN9s"]["With @SenJeffMerkley today in Portland hearing from Laurelhurst Village residents how #GrahamCassidy would devastate their care. https://t.co/pwGXWB7BxL"]["Keep making your voices heard!! People power can stop #Trumpcare https://t.co/pAsXnvWMfm"]["Can’t wait for #2017townhalls today in Marion &amp; Clackamas counties, and tomorrow in Deschutes &amp; Lane counties: https://t.co/fj1BTSKS3h"]["RT to spread the word ➡️ Hearing MONDAY on #GrahamCassidy. You can submit comments for the hearing record to gchcomments@finance.senate.gov"]["👏👏👏 Another court rules the government needs a warrant to use stingrays. Now Congress should pass my #GPSact &amp; make it a law https://t.co/QVeHmnOFqU"]["Factcheck: True https://t.co/6awWdEl9mB"]["Belt tightening seems to be for the little guy - &amp; health care - not for @SecPriceMD. Will be looking into this flagrant waste of taxpayer $"]["The only folks who should be looking at a travel ban are Trump cabinet members https://t.co/saavVSKuSv"]["Go Jimmy &amp; Billy! Join @Jimmykimmel &amp; make your voice heard – we will not let #GrahamCassidy take away health care! https://t.co/lZF2X3WZPN"]["When your own bill cannot pass the test you devised, it’s time to stop trying to hurt people &amp; start coming up with bipartisan solutions. https://t.co/FO87OAMoLy"]["Testifying at @SenateDems hearing on #VoteByMail. Best solution to stop GOP attempts at #votersuppression  https://t.co/ntwNt8Hexo"]["#CDA230 is legal foundation of the internet, and #SESTA is the wrong answer to a serious problem https://t.co/66VShegTmZ"]["@GOPSenFinance @SenateGOP We have 11 days to speak out, show up &amp; educate Congress on the terrible consequences of #Trumpcare"]["@GOPSenFinance Worse even - @SenateGOP is going to vote on this bill not knowing how many people it will impact. That’s an abomination."]["@GOPSenFinance #Trumpcare could be passed in 11 days. It is the most damaging version yet. https://t.co/sRObNplurs"]["#Trumpcare is moving. @GOPSenFinance is ramming through a hearing at 10 am ET on MONDAY."]["ALERT: There is a dangerous &amp; reckless #Trumpcare bill being rammed through on party lines https://t.co/ecXQH7CIzQ"]["Watch live as I discuss dangerous, partisan &amp; reckless #Trumpcare on the Senate floor https://t.co/ecXQH7CIzQ"][".@SenateGOP is endangering your health with their eyes closed, fingers in ears #trumpcare https://t.co/oX8GVkremv"]["So the golf clubs are pay to play. Are the tax cuts pay to play, too? Probably so if Trump won't release the guest lists. https://t.co/SI0FI84DO1"]["That's why I introduced the #FreeCreditFreeze Act https://t.co/GJHrDvzsWv"]["This! You shouldn't have to pay to protect your identity - especially because a company screwed up #FreeCreditFreeze https://t.co/FK0JTNIOZZ"]["It's time to mobilize again folks. People power can stop this. https://t.co/v0EplyH9qs"]["Retweet if you support my #FreeCreditFreeze Act! You should not have to pay to protect your identity. https://t.co/ZCOQPvxVin"]["Rather that the end result of all #taxreform is at least as progressive as current law."]["Constant GOP red herring. Democrats are not calling for every change to the tax code to be progressive."]["Like I said - forehead slapping stuff. So obviously wrong. https://t.co/Bcj7Oo3QEY"]["Watch live as I discuss on the Senate floor the urgent need to pass a wildfire funding fix ➡️ https://t.co/MpgYmFvhOJ"]["@RichardRubinDC @burgessev 🏀⛹🏻🏀 https://t.co/fg2Qd3Caxl"]["Right, and next year I’m playing in the NBA https://t.co/53WY0y2ilj"]["@senorrinhatch Children's Health Insurance Program is crucial for our country's vulnerable kids #CHIPworks"]["Pleased to announce strong bipartisan agreement on children’s health with @SenOrrinHatch. Need to get this done ASAP https://t.co/ozYhr7D17m"]["Make no mistake \"tax cuts\" isn't tax reform. It's just crumbs for the many and 3-tiered cakes for the few."]["Retweet &amp; tell @KrisKobach1787 that we won’t let him get away with suppressing Americans’ right to vote!"]["Kobach voter suppression: attack the voting rights of students and members of the military https://t.co/fQ8QQ2oDcY"]["Also- how Kobach can be both at once defies common sense..."]["The voter suppression commission is  headed by Kris Kobach – paid Breitbart columnist &amp; Kansas SOS https://t.co/uofbC7mF31"]["They are actively looking for ways to suppress your vote by making up voter “fraud.” https://t.co/suAmwQIJSJ"]["The voter suppression commission also met today."]["Extremely disappointed OR SOS Dennis Richardson aided voter suppression commission by turning over Oregonians’ info https://t.co/AWoLsGRzba"]["We must call Trump &amp; Pence’s sham voter “fraud” commission what it is – a voter suppression commission."]["Serious bipartisan effort? As senior democrat on tax writing committee, my invite must've gotten lost in the mail https://t.co/97wRZP1yMO"]["Absolutely. Congress must move ASAP https://t.co/0zPEPLm2fN"]["@SenSherrodBrown Forced arbitration is like having to agree to not sue the arsonist if you want the fire department to come. It’s that absurd."]["Also joined @SenSherrodBrown to demand consumer protections against forced arbitration just to have their credit monitored https://t.co/sSqp3j5FKU"]["@senorrinhatch Questions include when top executives knew about breach, forced arbitration &amp; other consumer protections."]["Equifax data breach has extraordinary consequences. Demanding answers with @senorrinhatch https://t.co/bVDg37R7XS"]["Remembering the victims and heroic first responders of 9/11 today. #NeverForget"]["In Jackson County this afternoon at the #MillerComplexFire camp to visit firefighters working hard on this blaze. https://t.co/SaGnR9BXFt"]["In Cave Junction learning more today about what's being done in the east zone of the #ChetcoBarFire. Thanks to all battling this blaze. https://t.co/41qidkBPGC"]["With @OregonGovBrown &amp; @RepPeterDeFazio this morning in Brookings hearing about the heroic work fighting the #ChetcoBarFire https://t.co/HTNsIsMzMG"]["Briefed this AM by the incredibly hard-working people fighting the #ChetcoBarfire in southern Oregon. Big thanks for all they're doing. https://t.co/32fZDIOk9J"]["So impressed w/the #OregonWay spirit of the  firefighters protecting people facing the #EagleCreekfire https://t.co/b8P8j4POXA"]["Big thx to the firefighters &amp; @WillametteNF for last.night's briefing at Lowell base camp in Lane County on #JonesFire &amp; #HorseCreekComplex https://t.co/z2c58s4aCs"]["So wonderful to catch up today with @CommishFish in Portland. A great commissioner and great friend. https://t.co/ZGmy31t2KD"]["Updated on status of Oregon's wildfires at today's statewide fire briefing in PDX &amp; on what's underway to fight these devastating blazes. https://t.co/VYmoU8IMzD"]["Thnx to all the great Oregonians I heard from today in Troutdale who are working 24-7 to protect people &amp; the Gorge from the #EagleCreekfire https://t.co/krE41L1sc0"]["These are the fires burning right now &amp; how we fix funding https://t.co/GQzTlvmYX4:"]["The West is on fire. Heading to the floor now to demand Congress fund wildfire fighting like the disasters they are https://t.co/1XKnK0UOYT"]["Beyond me why Congress wouldn’t pass our funding fix https://t.co/GQzTlvmYX4"]["Our approach to fund wildfire fighting like other disasters is BIPARTISAN and costs ZERO dollars – it is an accounting fix."]["Joining @SenateDems on FB live to discuss immediate need to provide legal protections to Dreamers #HereToStay #DreamAct https://t.co/Np6TWKn8HG"]["Surprise this study was funded by an astro-turf, pro-big cable group. https://t.co/mftNHa522G"]["@realDonaldTrump I will keep pushing the president &amp; Congress to fix our backward system of funding wildfires."]["I urge you @realDonaldTrump, do not ignore the West."]["This fix makes sure we treat wildfires like the natural disasters they are. It's a must to maintain $$ for prevention &amp; for fighting fires."]["I wrote the president yesterday urging him to include a wildfire funding fix in any disaster aid request. #EagleCreekFire https://t.co/lu2BzyLrqE"]["Back to Oregon – this is a wildfire engulfing our beautiful Columbia River Gorge Monday night #EagleCreekFire https://t.co/kJwXja6q0w"]["Wyoming https://t.co/7RrfQuYYpl"]["Washington https://t.co/axN1siWdm7"]["Nevada https://t.co/kHBZHgb7LV https://t.co/KyniW2wMj2"]["Idaho https://t.co/hKsE4UBJ7P"]["Colorado https://t.co/bs1C3FZOSH"]["California https://t.co/LC8VZKajBb https://t.co/tUa5mHpUB2"]["Montana. https://t.co/hefxDZAE63 https://t.co/PkVPFhzn0n"]["This is Oregon today. Smoke is thick and it’s “raining” ash. https://t.co/WMh0p285Qp"]["There are 81 large fires burning right now on almost 1.5 million acres. https://t.co/eeGZ5i7Dwb https://t.co/VcxP0drPEQ"]["The West is burning. Fires rage in Oregon, Montana, California, Colorado, Idaho, Nevada, Utah, Washington &amp; Wyoming https://t.co/totg3u6ifE"]["Retweet if you submitted a comment to the FCC in favor of keeping the strong #netneutrality rules. https://t.co/ku4GQQtYpe"]["I'll fight w/every tool I have for legal protections these incredible young ppl need to continue contributing to our country—THEIR country"]["If you’re a #DREAMer in Oregon, I’m with you. Today is scary &amp; awful. But you are not alone."]["Fires raging throughout Oregon &amp; the West. Federal disaster $ needed ASAP.\nhttps://t.co/A7bdeaAFt1"]["Ending DACA to fulfill a bigoted campaign promise is cruel, unnecessary &amp; undermines our values."]["DREAMers &amp; the values they represent are the best of America. #DefendDACA"]["This thread is why we must use every legal avenue possible to protect our fellow Americans https://t.co/CPD2Pm4tGt"]["Ripping away legal protections for 800,000 DREAMers who make vital contributions to America is cowardly, Mr. President. #DefendDACA https://t.co/2FRwRnclkk"]["Huge thanks to all the firefighters on the front lines battling the fires burning throughout Oregon."]["20 senators support my #votebymail bill. Learn more here: https://t.co/KVKHiigbDx"]["#Votebymail means paper ballots, weeks to fix any registration problems and audits afterward."]["Too many questions about security last election. We need #votebymail for the strongest protection against hacking https://t.co/WkeJAQEeeb"]["I raised serious concerns about these abhorrent comments Bradford alleged a \"hacker\" made. https://t.co/K4dyyIUbGL"]["Good. There's one iota less of hate in the Administration today. https://t.co/n0aiCfC9Dt"]["Trump's tax \"plan\": Crumbs for the middle class, cakes for the fortunate few. That's not tax reform, that's highway robbery."]["Who benefits the most from the tax \"plan\" Trump's @whitehouse released? The top 0.1% https://t.co/6yjnBCsz0L"]["Wait, that's it?? No details?"]["Facts Schmacts https://t.co/pyIY3QLuAa"]["No evidence that lower corporate taxes mean higher wages. They mean higher profits and bigger dividends."]["The only thing you are surrendering to with this tax \"plan\" is big special interests"]["Democrats are not looking to obstruct *real* tax reform. Our letter to Trump &amp; GOP leaders: https://t.co/Q2k2UPTdhg"]["We will not know if Trump would benefit from tax \"reform\"since he refuses to release his tax returns."]["Tax cuts ≠ Economic Growth https://t.co/5Sfbn6d6oy"]["What do you know about workers, Mr. President? Besides ripping them off at Trump Org."]["Work with Democrats, Mr. President? Your office hasn't called..."]["This strikes at the heart of the rule of law in America. It violates his oath of office."]["The Arpaio pardon says, if you are a law-enforcement official who supports Trump, break the law &amp; he'll protect you."][".@realDonaldTrump playing politics w/military &amp; servicemembers makes us less safe/less free. This isn't who America is #ProtectTransTroops"]["Thx Tillamook Co. for coming on a beautiful Manzanita day to educate me about veterans, environment &amp; more at my 64th #2017townhall this yr. https://t.co/fX8cMzdp7H"]["Thnx Clatsop County for today's great #2017townhall in Seaside focused on the Oregon Way wanting solutions on tax reform, healthcare &amp; more. https://t.co/jnYm93MAhq"]["@SecretaryZinke Keeping this report secret = administration ignoring Oregonians who spoke publicly to protect #CascadeSiskiyou. #KeepItPublic"]["Retweet if you agree: Decisions about our #publiclands must be made in public. @SecretaryZinke #ReleaseTheReport #MakeItPublic"]["Looking forward to tomorrow's Clatsop &amp; Tillamook #2017townhalls -- #63 &amp; #64 so far this year. Details here: https://t.co/fj1BTSthbJ"]["Great visit today in Portland with the outstanding @HousecallPDX folks to hear all they're doing to make healthcare better. https://t.co/EF5Jx5uK86"]["Gratified to hear this AM in PDX how @Lines_for_Life is expanding its role on the front lines helping veterans needing crisis hotline help. https://t.co/vXvxWpuifD"]["If Trump pardons this man and sanctions this brand of lawlessness, he will again be endorsing white supremacy and attacking the rule of law."]["Law enforcement refusing to obey the courts threatens the foundations of our republic. That’s what Joe Arpaio did."]["Joining w/all Oregon to say thanks to the firefighters battling the Chetco Bar, Milli, Warm Springs fires &amp; all the blazes raging statewide."]["Bannon is gone, but Trump hasn't changed. When someone shows you who they are, believe them. We have to keep up the pressure."]["When there are so many patients who can't afford EpiPens, Mylan's low-ball settlement adds insult to injury."]["A $465 million settlement to a single firm that ripped off taxpayers by $1.3 billion looks like another awfully sweet deal for big pharma https://t.co/B63pU5UEb9"]["Claiming you'd murder prisoners only helps recruit more terrorists. https://t.co/c69enoWhNM"]["We must stand against all terrorism, including the heinous attack in Barcelona."]["The president is too busy defending 20th century shrines to white supremacy to focus on fixing roads or creating jobs https://t.co/LqG3LzTuyi"]["Immigrant youth make such valuable contributions to Oregon &amp; America. #DefendDACA"]["My parents fled Nazi Germany. There's no \"many siding\" this Mr. President."]["Off prompter and in his own words, the president gives comfort to white supremacists and neo-Nazis. Absolutely horrifying."]["That's only making insurance companies \"great\" - not America."]["Trump's games will cause Americans' health premiums to skyrocket 20 percent. https://t.co/DIe3XWUX6W"]["White supremacists and neo-Nazis are truly bad people. Try saying that. https://t.co/20f0iCppv2"]["What happened in Charlottesville is domestic terrorism. The President's words only serve to offer cover for heinous acts."]["Big thanks to state Rep. Janelle Bynum for being such a big part of last night's outstanding Clackamas County #2017townhall. https://t.co/DS8Ji1Yv94"]["Serious discussion at last night's Clackamas County #2017townhall about North Korea, healthcare, education &amp; more. Thnx to all who attended. https://t.co/RCfL9rV8ER"]["Much better than any official portrait https://t.co/4q8xEfOHHG"]["What a blast getting to hang out with all the great kids this afternoon at the Warm Springs Community Center. https://t.co/vyz4wBaV4p"]["Very impressed with the Warm Springs Academy students I met this afternoon &amp; the research they're doing into their tribal history. https://t.co/BbddMMyGI0"]["Huge thanks to the @RedCrossCasc volunteers helping out at the shelter for folks facing the dangers from the fire in Warm Springs. https://t.co/dZLwjPkwmJ"]["Thanks Confederated Tribes of Warm Springs for hosting my 61st #2017townhall so far this year. Great ?s abt jobs/economy, education &amp; more. https://t.co/uyquAxdguW"]["Thanks @SOAROregon for inviting me to speak at today's Oregon #UAS summit in Bend about how #UAS industry can soar to even greater heights. https://t.co/xodRpW4dIu"]["Admin. full of Wall Street bankers &amp; Exxon CEO refuses to listen to science. #ClimateChange is happening whether you acknowledge it or not. https://t.co/GLCt4afl1e"]["Heard today in Redmond at @CentralORFire how central Oregon is working to protect lives/property from wildfires &amp; prepping for 8/21 eclipse. https://t.co/Py2sylDLLc"]["Today's Marion County #2017townhall in Silverton included smart questions about foreign policy, healthcare &amp; more. Thnx to all who attended. https://t.co/rTENRs4aYd"]["Thnx Blount Int'l for today's @IMakeAmerica tour of your impressive Portland facility &amp; meeting w/all the great employees. https://t.co/edqvu9MPYw"]["Fantastic conversation in Cornelius at today's WashCo #2017townhall - 58th this year in Ore. - about healthcare, N. Korea, veterans &amp; more. https://t.co/GU3itM6BKm"]["Thnx Columbia County for today's #2017townhall in Vernonia -- showed the #OregonWay at its best w/a real conversation focused on solutions. https://t.co/i0ceUyIpaD"]["Happy to volunteer today at the @oregonfoodbank with all these great volunteers in the year-round battle to #FightHunger. https://t.co/QgNpoTFHUu"]["Briefed today in Medford on S. Oregon wildfire conditions &amp; fire officials' response as weather heats up &amp; eclipse-related traffic looms https://t.co/utJVDQJ4Ts"]["Proud today to honor Oregon teacher of year Gloria Robertson &amp; elementary principal of year Kelly Soter, both from @MSD549C in Medford. https://t.co/3mCQCHT5Oc"]["Enjoyed meeting w/the great @MSD549C students &amp; staff today in Medford working together on summer learning while getting a summer lunch. https://t.co/wROKheeNmL"]["Heard so many good ideas from nursing home workers &amp; patients today in Medford on how to keep healthcare strong for seniors &amp; all Americans. https://t.co/IstTFDrDPH"]["Fantastic conversation at today's Hood River County #2017townhall about healthcare, my recreation bill &amp; work to take vote-by-mail national. https://t.co/kww5tet6op"]["Great MultCo #2017townhall -- 55th this year in Oregon -- thanks to all who came out today to @Wilson_Trojans. https://t.co/ucEwH3gN4I"]["Looking forward very much to hearing from Oregonians at my eight upcoming #2017townhalls. When &amp; where details here: https://t.co/fj1BTSKS3h"]["Great to meet this afternoon w/metro-area Somali leaders in Portland &amp; hear from them about all we can do to work together. https://t.co/72YrdIhAuL"]["I will continue to press, as I have for months, for the Senate Russia investigation to follow the money https://t.co/tMLufqGOyU"]["This is a dangerous threat to stifle speech https://t.co/LgVCFZJDne"]["Briefed this morning in PDX about wildfires statewide &amp; preparations to deal both w/current heatwave &amp; Aug. 21 eclipse traffic. https://t.co/EpqWqsT6JF"]["Women &amp; minority entrepreneurs should have equal &amp; fair access to capital to start &amp; grow their businesses! https://t.co/bJeXsVTJsd"]["Surprise, surprise – Trump’s FCC is halving comment time for #netneutrality from what it was under Obama. We urge them to use same standard. https://t.co/ZVR2VQYZgd"]["Proud to lead @SenateDems to introduce the #EqualDignity for Married Taxpayers Act. https://t.co/usSMcHWYjc"]["Checking in on the swamp draining... https://t.co/QSqhT00qr8"]["Past FBI directors have undermined Americans' security by seeking to weaken strong encryption. Wray wouldn't promise to change course. https://t.co/MzujxLh6ml"]["As of today, the middle class is getting crumbs in #TaxReform while the fortunate few are drooling over big tasty cakes."]["Retweet if you agree: Sessions should not keep DOJ Marijuana, Violent Crime &amp; Immigration task force recommendations a secret! https://t.co/UzBQmqMcpU"]["Bill intro'd today destroys the foundation of the internet &amp; social media &amp; leaves new websites open to millions in lawsuits #CDA230 https://t.co/VazuA8mzn9"]["So you're a yes then on making sure these corporations pay their fair share? https://t.co/JMa6EHsB0A"][".@SenateGOP: Time to govern so we can provide economic relief to middle class. That means including @senatedems today in #taxreform talks."]["All @senatedems agree: #TaxReform must help middle class, not the fortunate few https://t.co/KcCp5G2vSB"]["Basic proposition: #TaxReform should put money in the pockets of the middle class. Should not lower taxes for wealthiest few or add to debt. https://t.co/GiB63QvGBD"]["This is damaging &amp; irresponsible. Joined @SenSherrodBrown &amp; @SenFeinstein to demand answers. https://t.co/RkMcblD25s"]["Kobach's voter suppression commission published Americans' sensitive, personal information from when they commented to the commission. https://t.co/BlCswH4Ryf"]["This sabotage will cost families dearly. Expected to raise premiums by double digits in just a few months."]["Trump is gambling with people's health care to score political points. It's small, petty &amp; will hit Americans’ pocketbooks."]["Working to build out cell service &amp; wireless Internet coverage that’s much needed in Eastern Oregon: https://t.co/1TJLgytEPm"]["As ranking member of @SenateFinance, let's move forward on a bipartisan basis to ⬇️ health costs &amp; improve care."]["Thanks to all of your voices millions of Americans can breathe a little easier tonight. https://t.co/26brLBmb0Y"]["On the floor now speaking out against this travesty of a bill https://t.co/MpgYmFMSGh"]["This isn't \"freedom.\" This is gutting for millions of Americans"]["#Trumpcare \"skinny\" repeal text is out. Destroys insurance markets &amp; defunds Planned Parenthood."]["How come no GOP senator will come on the floor and defend their #Trumpcare bill?"]["How much time will the @SenateGOP make the #Trumpcare bill public before the vote? (Price is right rules)"]["Don’t be fooled. ‘Skinny bill’ packs a wallop. Premiums soar 20% IN ONE YEAR. 16 million lose coverage."]["Correct video link: https://t.co/QLWe1RR8Aq"]["Correct link for video! https://t.co/QLWe1RzxIS https://t.co/6KIPtU0RTl"]["On the day Senate is set to vote, the future of American health care got a rewrite btwn the salad course &amp; entrée https://t.co/pXwTeDmulw"]["This fight for our health care is just one example of what’s at stake if GOP rolls back #netneutrality protections that allow us to organize"]["Strong #NetNeutrality protections make sure that Big Cable or moneyed interests cannot filter out our speech."]["In all of this, we cannot forget our fight for #netneutrality. Net neutrality is what allows us to organize &amp; communicate online!"]["@SenateGOP What we do know is that we have to leave it all on the field. Make those calls. Show up. Do not relent. Your pressure is key."]["Today is the day. @SenateGOP will have a \"final vote\" sometime in the next 24 hours on a bill. Which bill? We don't know."]["This is why @PattyMurray and I fought to get this CBO score so quickly. Americans deserve to know what impacts policies have!"]["Worked with @RepRobBishop, @Wilderness, &amp; outdoor industry groups to re-introduce &amp; update the #RNRAct: https://t.co/KyrD7H0MVF"]["Even in this polarized political climate, we must find ways to work together."]["The truth is #Medicaid helps many disabled Americans work &amp; lead fulfilling lives: https://t.co/fz3XgZxmZI"]["Read this thread right now. This is why we fight. No greater champion for people with disabilities than @SenBobCasey https://t.co/dFfUljxpHR"]["Remember: Mitch McConnell's end goal is \"skinny\" repeal. It's a fraud. House won't accept it. It's an on-ramp to #Trumpcare, nothing less."]["America isn’t fooled. Laid out with @SenSanders the damage #Trumpcare does to Americans &amp; the gifts it gives the wealthy. https://t.co/FhxvZx5W7U"]["I see your tweets. Thank you for continuing to fight even when it's exhausting. We cannot relent."]["On the floor to lead @SenateDems against this partisan plan to rip health care from millions of Americans &amp; raise costs for millions more. https://t.co/A6rCtgch73"]["Trump chooses bigotry over security. Shutting out transgender Americans who want to serve our country makes us less safe, not safer."]["It's on us to make sure every senator knows they will be held accountable if they vote for a policy that hurts Americans."]["Mitch McConnell will swoop in with a mystery bill at the end.  It will be a mystery to your GOP senator, too."]["Senate GOP voted to move onto Trumpcare without knowing what the bill will be. Wrong &amp; irresponsible."]["Mitch McConnell is working hard to get this bill passed. We need you to work harder to stop it."]["This is not over. You've got time to call, to tweet, to email, to show up."]["It's 12:30 pm in DC, vote is in 2 hours, have you called your senator on health care today? Retweet once you have!"]["As I said on @maddow, you are a grassroots juggernaut. #Trumpcare vote is hours away. KEEP IT UP. https://t.co/WZzgEle4xs"]["It says a lot about the president that he's attacking his single most loyal supporter -- Jeff Sessions."]["About to be on @maddow discussing health care &amp; Russia investigation. Tune in if you can."]["This is it, folks. Leave it all on the field. Call. Tweet. Text. Email. Show up. https://t.co/GIcaI40Vye"]["Kushner’s statement sounds like lawyers protecting a client, not real transparency. Testify in open session. https://t.co/tm7XoS6VOB"]["🚨🚨🚨\n\nCall, call, call today. \n\nVote could be in less than 24 hrs! \n\n#Trumpcare #KillTheBill"]["We're now a day away from a vote affecting the well-being of nearly every American. What are we voting on? @SenateGOP won't say. #Trumpcare https://t.co/eyGwmAmGjk"]["Every senator needs to be on the record now that it's unacceptable to fire Mueller. NOW. https://t.co/fe2wP9jOEf"]["So proud of Justin – our intern this summer thru @CCAInstitute #FYI2017 https://t.co/d8rheB5FdO"]["Democrats &amp; Republicans must work together to roll back this abuse of executive power."]["There is bipartisan outrage against Sessions &amp; Trump admin move to trample the property rights of Americans  https://t.co/KTDjrzduul"]["Liberals &amp; conservatives both agree. Civil asset forfeiture is a violation of due process https://t.co/Y1WjdswQZL"]["Why the CBO is one of the most important institutions. It's what allows Congress to fight back against an Administration's alternative facts https://t.co/EG6e0YwzvC"]["Importance of a Congressional Scorekeeper by @RonWyden https://t.co/FZh9Ee8mUK"]["When GOP rejects false choice of repeal only or #Trumpcare on steroids, we are ready to work on bipartisan solutions that help all Americans"]["This is anything but \"better care\" https://t.co/bwl33hKHdb"]["Another CBO score, a \"new\" #Trumpcare, same devastation for Americans' health care. Higher costs, millions out in the cold. Tell GOP to stop"]["Remember - talking about \"Russian adoptions\" is code for lifting sanctions on Putin cronies &amp; human rights abusers https://t.co/E0WzGTpwFc"]["Counting on the legendary John McCain strength to give cancer its toughest fight ever. Rooting for you, dear friend."]["We won't be distracted by @SenateGOP games. All their bills have scored with higher costs, worse health care https://t.co/8oyI0jOtOw"]["Two year “delay” built into ACA repeal is a fantasy. 17 million more uninsured in first year. https://t.co/4all5nYYXs"]["Proud of the work these bright young Oregonians are doing to make education more accessible for women everywhere. #GirlsLead17 https://t.co/IMc8zPTZW4"]["Submitted my official comment to the FCC on #netneutrality yesterday. TL;DR current rules are strongest https://t.co/lGq4RpUc4g"]["Tell Republicans: Do not let Trump steer health care off a cliff. https://t.co/qhBHgpJKHr"]["It's clear the buck stops anywhere but with the Commander in Chief."]["The president would rather sabotage health care markets &amp; gamble with people's health than do bipartisan work https://t.co/IA9hHgOJze"]["Republicans have had 7 years to agree on a replacement. 6 months in full control of gov't. It is not happening. #RepealAndRun"]["HALF of US will have no insurance options in market next yr if #RepealAndRun passes. That’s no stable transition GOP https://t.co/4G3LrIxv8e"]["The GOP talk about a 2 year transition is a fraud. With #RepealAndRun, health care markets collapse instantly, and GOP knows it."]["#RepealAndRun is back. \nTax cuts for the wealthy.\nMedicaid slashed. \nNo tax credits for middle-class families."]["Instead of working together to improve health care Republicans would rather rip it away for political gain."]["#Trumpcare is on the brink because people are speaking out and standing up. Keep pushing to make health care better, not worse."]["When you don't like the rules so you make yourself the umpire https://t.co/MIAXFcsl0n"]["See you there! People power is what will stop this #Trumpcare bill! https://t.co/K0Y0enD8o9"]["We fight for people. Health care should not just be for the healthy &amp; wealthy. Share your story: https://t.co/4RzWbJEKZG #ProtectOurCare"]["How many hearings have we had in @SenateFinance on #Trumpcare? Zero. GOP is completely bypassing the legislative process."]["GOP #Trumpcare Checklist:\n✔️Age tax\n✔️Big pharma tax breaks\n✔️Lifetime caps\n✔️Ripping off middle class"]["#FF @SenateFinance! If #trumpcare was receiving hearings like the ACA did, that’s where the updates would be!"]["In today’s foreign policy flub: Trump praises China’s leader hours after China’s only Nobel Peace Prize winner dies in custody."]["The GOP plan: Obamacare for Congress, #Trumpcare for everybody else! https://t.co/4wUeMtrMFT"]["Republicans are buying votes by blowing a hole in the American health care system, and then they're shoveling taxpayer dollars into it."]["Taxpayers are going to get stuck with the astronomical costs of cleaning up the damage from this Cruz scheme."]["By including Cruz proposal, Trumpcare will:\n—destroy marketplace\n—send premiums skyhigh\n—make care unaffordable if you have pre-ex condition"]["No one in Oregon or in America is ok w/a #Trumpcare bill that just delays tax breaks for the fortunate few. Yet that’s what the GOP is doing"]["HAPPENING NOW: Press conference on still disastrous version of #Trumpcare https://t.co/dbZdUeAjkJ"]["This is what it looks like when the GOP turns its back on Americans who are afraid they're about to lose their health care. https://t.co/uLsagOyiHK"]["Remember this. No matter what GOP does in health care reform, gifts for wealthy &amp; special interests is their #1 goal https://t.co/VbxLRwa1ZQ"]["No, @comcast. Today’s Day of Action is to support the current, strong #NetNeutrality rules, not legislation that you fill with loopholes https://t.co/PIJ17UoJPg"]["Just like with your broadband privacy, GOP is trying to give big cable another hand out. Rollback #NetNeutrality &amp; consumer costs increase. https://t.co/91ja6L39i8"]["You’ll be able to watch LIVE here w/o it being slowed down by your ISP because of #NetNeutrality protections https://t.co/4sysbPG2K9"]["Joining @SenateDems on the floor to stop GOP’s FCC rollback of #NetNeutrality protections for internet access"]["8 town halls, 2 rallies &amp; 1 message from Oregonians: Stop #Trumpcare &amp; work together to make health care affordable for ALL Americans https://t.co/ulCg7sGlXR"]["👏 stop 👏 lying 👏 about 👏 the 👏ACA 👏 and  👏defend 👏 your 👏 terrible 👏 bill 👏 https://t.co/d0hqiV83Mv"]["Joining @senmarkey, @senatedems &amp; internet users to rally to save #NetNeutrality from GOP &amp; Big Cable! https://t.co/TCmhf5aWBT"]["#NetNeutrality is the internet as we know it. Rolling it back increases your costs &amp; would limit your internet access."]["TOMORROW! #NetNeutrality Day of Action. How are you going to make your voice heard? https://t.co/4JByuDXxnW"]["Heading to the floor. GOP is still trying to steamroll Americans on health care. We won’t take it! https://t.co/MpgYmFvhOJ"]["Nice try. The public isn’t fooled. #NetNeutrality https://t.co/5gFD5vwAHc"]["It is now incumbent on elected officials of both parties to stand up &amp; do their duty: protect &amp; defend the constitution."]["No longer a question that the Trump campaign sought to collude with a hostile foreign power to subvert American democracy."]["This is who we are fighting for when we fight to stop #Trumpcare https://t.co/m7gUSwv1mb"]["FCC must be prepared to accept a surge of comments on our #NetNeutrality day of action this Wednesday. https://t.co/qnciAWiZf0"]["Today's Yamhill County #2017townhall in Newberg was my 8th this past week, 54th so far this yr &amp; 835th overall. Big thnx to all who attended https://t.co/16zInpAaFN"]["Today's Lane County #2017townhall in Springfield had many ?s about #Trumpcare. My answer: defeating #Trumpcare is the fight of our lifetime. https://t.co/HKohJg9ceY"]["@DirtyHippyChimp In the high school gym at 11 am. Hope you can make it. Details here: https://t.co/ScJtQzw6Uz"]["Great to meet Kelly at his Leaburg Country Store during a stop en route from today's #2017townhall in Redmond to tomorrow's in Springfield. https://t.co/rWKQBB5iF1"]["Today's Deschutes County #2017townhall in Redmond included fantastic ?s about free press' importance, climate change &amp; of course #Trumpcare. https://t.co/ya2KbUbYgY"]["Met today in Bend w/seniors in Central Oregon concerned that #Trumpcare would devastate healthcare in our state &amp; country. https://t.co/JulvkQ9d4M"]["If your \"solution\" makes high-quality health care an unaffordable luxury good, you’re doing it wrong https://t.co/AE1g5ejMXc #trumpcare"]["Great #2017townhall today with @repbonamici.\nWe heard from WashIngton County on #Trumpcare, Russia, education, need to #fighthunger &amp; more. https://t.co/Xyeyu81hi2"]["More than 180 countries have accessible currency. Why not ours? My letter w/@JohnBoozman &amp; @SenSherrodBrown to @USMoneyfactory: https://t.co/cVEJiVbMMS"]["Clear message today in PDX: #Trumpcare must be stopped. Proud to work w/ @SenJeffMerkley &amp; @RepBonamici in this fight of our lifetime. https://t.co/TAFGMWpXyx"]["A fantastic 50th #2017townhall today. Heard from Linn County at the veterans home in Lebanon about issues affecting vets &amp; more. https://t.co/ekot7fGfq7"]["Heard loud &amp; clear w/ @SenJeffMerkley &amp; @RepPeterDeFazio in Eugene that we can't rest in the battle to stop #Trumpcare in its tracks. https://t.co/kUFJCNUf7S"]["Met today at @EugenePublicLib w/great allies like Mayor Vinis &amp; many other eloquent voices in our #protectnetneutrality fight. https://t.co/086vF91Ug2"]["Proud to be at the Cow Creek tribe’s #FourthofJuly dinner honoring veterans and my late friend Sue Shaffer. https://t.co/G76L03JAlA"]["Huge thanks to Bruce for driving my car in today's fantastic #FourthofJuly parade in Ashland. https://t.co/jTc0rUItnR"]["Caught up today at Ashland's #FourthofJuly parade w/retired Navy Cdr. Beth Coye, who worked tirelessly to abolish \"Don't Ask Don't Tell.\" https://t.co/BahjPotWzI"]["Thanks Ashland for today's great #FourthofJuly parade. Always a blast. https://t.co/R7g5kZfvKV"]["No Ashland #FourthofJuly parade is complete without the tuba player. And Eric is one fine tuba player. https://t.co/k5e8DicqqW"]["Always fun to be in Ashland’s #FourthofJuly parade. Great day, great crowd. https://t.co/LMIwzexvLP"]["Heard this morning in Eugene how #Trumpcare would devastate people counting on Medicaid for nursing home care. https://t.co/C0EjK5qa5g"]["Talked with @KalynNorwood tonight at @KEZI9 in Eugene about how America is strongest when we set the bar high. https://t.co/Aac9AeWcXL"]["Great discussion at today’s #2017townhall in Reedsport w/Douglas County residents very concerned about #Trumpcare. https://t.co/NtWyigefCk"]["Here's the schedule for my upcoming #2017townhalls: https://t.co/fj1BTSKS3h"]["Ready after a beautiful evening last night in Newport's bayfront for #2017townhalls today &amp; in the week ahead. https://t.co/rJJGEpzpc6"]["Narrator: And so they did. \n#protectnetneutrality https://t.co/ZwYy9JjLoV"]["Lincoln County showed democracy is alive &amp; flourishing this #FourthofJuly weekend at today’s #2017townhall. https://t.co/aqEtsHzaRR"]["Stopped at the landmark Otis Cafe while heading to today's Lincoln County #2017townhall &amp; had the tasty tunaburger. https://t.co/yKR82gk30x"]["Thnx to the @CTGRgov for hosting today’s Polk County #2017townhall. Heard major concerns about #Trumpcare. https://t.co/IqVnQuKg7D"]["Looking forward to these eight #2017townhalls starting tomorrow throughout Oregon: https://t.co/fj1BTSKS3h"]["Led letter to @OregonSOS Richardson. Asked him to confirm he will not comply with Kobach’s dangerous voter data request https://t.co/oqVTUDnttj"]["We remember today in Portland &amp; always the MAX attack heroes &amp; the two girls they bravely defended. #Hearts4PDX. https://t.co/8Cn7s1Jpog"]["Great discussion at today’s #Fridayforum co-hosted by @PDXCityClub &amp; @worldoregon about the need to #protectnetneutrality. https://t.co/ysnrkKZdSj"]["In this @GOP debate, all roads lead to #Trumpcare. https://t.co/X20wJW0aId"]["Stop the Senate #Trumpcare bill. This is a sideshow. https://t.co/WCRKEXEHWW"]["Honored to stand today w/Portland City Commissioner @dansaltzman in the battle to #protectnetneutrality. https://t.co/0ScfigDGZh"]["Trump also wants Oregon to send voters’ personal information to an insecure email address – a bonanza for hackers. https://t.co/d7bV2lVMQs"]["There is no way the federal govt should get Oregonians’ sensitive information when it can’t even keep classified staffer data safe."]["This request is also a tool of voter suppression and should not be validated in any way, shape or form."]["Complying with the request is a direct threat to Oregonians’ security, privacy &amp; right to vote."][".@OregonSOS Richardson should follow the lead of other SOSs &amp; not send Oregonians’ voter data to Kobach's commission https://t.co/cWwuqDYjob"]["Here is a link to the full CBO report on the long-term effects of #Trumpcare cuts to #Medicaid https://t.co/OoNyMwSHFW"]["I asked for this report from CBO because @SenateGOP was trying to hide the truth by not looking past 10-year impacts https://t.co/TNS8UbJYof"]["Anyone who tells you #Trumpcare isn’t cutting #Medicaid is full of it. https://t.co/mBkoDDJN5R"]["For more red-white-and-blue jobs, U.S. should insist on upgrading digital trade rules in NAFTA 2.0\nhttps://t.co/Qt78BDmtlk"]["So if the plan to slash health care for millions and give tax breaks to the wealthy becomes a two-step process, suddenly it's A-OK? 🤔 https://t.co/RaRwDN8W0n"]["Must-watch video. @SenDuckworth lays out why this nominee 's support for torture violated fundamental American values she fought to defend https://t.co/di9r0exPBP"]["Eager to discuss the need to #protectnetneutrality tomorrow at @PDXCityClub: https://t.co/sAyQT9BQB7"]["Joining the #peoplesfilibuster &amp; supporting Planned Parenthood. #Trumpcare hurts women https://t.co/j8Nya3PzLg"]["Increase in uninsured by state under #Trumpcare. NOT A HEALTH PLAN. https://t.co/6m14Rxy7RW"]