["Inspired by the recipients of the @ClevelandClinic's Service Awards and the work they are doing to make their community a better place. https://t.co/VxUEtFZeA3"]["Celebrated the life and legacy of Dr. Martin Luther King Jr. today at the @ClevelandClinic with Mayor Jackson and the Cleveland community. #MLK https://t.co/4RWMIOcQm3"]["It is time for the Senate to #ListenToSurvivors and pass #SESTA. #HumanTraffickingAwarenessDay https://t.co/G1BNXSnKQR"]["#TaxReform is leading to more investments in American workers, in American #jobs, in American families,  and in American businesses. https://t.co/rvThrCaw4S"]["#TaxReform is resulting in higher paychecks, more investments in plant &amp; equipment, and more: https://t.co/rvThrCs6Wq"]["If you haven't yet seen it, please listen to Yvonne Ambrose's story. This is why #SESTA must be passed: https://t.co/fR7OSAJLGl"]["It is because of mothers like Yvonne Ambrose that #SESTA now has 65 bipartisan supporters in the Senate. Got to meet with her again today &amp; I am confident that, w/ the courage of women like her, we will #PassSESTA. #HumanTraffickingAwarenessDay https://t.co/YgsJY4GYjx"]["At rally with trafficking survivors and advocates today, I called on the Senate to pass #SESTA. It is time to get this done. #HumanTraffickingAwarenessDay https://t.co/sBLcqrQrq6"]["As I’ve said many times now, the proof will be in the paycheck. American families will soon see an increase in their take-home pay: https://t.co/FUER3gMKtN #TaxReform"]["This is another milestone day in our efforts to deliver historic tax relief for hard-working Americans across the country. https://t.co/FUER3gMKtN #TaxReform #Jobs"]["BREAKING: The IRS has announced updates to its withholding tables for employee paychecks as a result of the Tax Cuts &amp; Jobs Act. Means more take-home pay: https://t.co/FUER3gMKtN"]["Inspired by the courageous women who came forward to share their stories. They are fighting so future generations don’t suffer from trafficking. #SESTA #PassSESTA #ListenToSurvivors #HumanTraffickingAwarenessDay https://t.co/wVizbkI1D2"]["#SESTA will ensure freedom of the internet but also help ensure that this kind of horrific behavior, human trafficking, will not continue. #HumanTraffickingAwarenessDay https://t.co/m1CiV7d5jF"]["Thank you for your support! #SESTA #PassSESTA #ListenToSurvivors #HumanTraffickingAwarenessDay https://t.co/Do4JQBKI9G"]["For years, I have been concerned about Russian disinfo and propaganda against the U.S. and our allies. https://t.co/tsImYardKS"]["Join me live for a discussion on “Disrupting Online Exploitation: Why Survivors Are Standing Up for #SESTA.\" https://t.co/hkvDEzFiYf #HumanTraffickingAwarenessDay"][".@toledonews is urging Congress to vote on #SESTA. RT if you agree. https://t.co/JsauqNNdAC #HumanTraffickingAwarenessDay"]["On @CNN w/ @ChrisCuomo, I discussed how the bipartisan Stop Enabling Sex Traffickers Act (#SESTA) will help end online sex trafficking. #HumanTraffickingAwarenessDay https://t.co/zPQHVML98z"]["Today is #HumanTraffickingAwarenessDay. It is a stain on our national character that sex trafficking is increasing. Excited to join survivors &amp; advocates today to push for Senate action on #SESTA."]["Pleased to attend signing ceremony for the INTERDICT Act with President Trump at the White House to help give @CustomsBorder agents more tools to help keep fentanyl out. More must be done. #STOPAct"]["#Ohio companies are announcing more investment in plants and equipment, wage hikes, bonuses &amp; increased 401(k) matches for their workers b/c of #taxreform: https://t.co/afK0KZu7CE"]["For the 219,000 #Ohio kids, and the 9 million children nationwide who rely on this program, Congress must #SaveCHIP."]["We need bipartisan cooperation to enact a long-term funding solution for CHIP. #SaveCHIP https://t.co/0wJH4IKoEU"]["It is crucial that countering foreign disinformation &amp; propaganda remain a bipartisan priority. Russian disinfo was a threat long before 2016 and will remain so long after."]["Although progress has been made to counter Russian disinformation, much more work remains to be done. Looking forward to working with my Senate Foreign Relations Cmte colleagues to defend our allies, institutions, and values."]["Courts have said it us up to Congress to act to help bring online sex traffickers to justice. That means passing #SESTA. #CDA230 https://t.co/gw6MvkBUHw"]["The 1996 Communications Decency Act is a well-intentioned law, but it needs to be updated for the 21st century. #SESTA #CDA230 https://t.co/BLb1XrJqiF"]["#SESTA is narrowly crafted, common-sense legislation that will help put an end to online sex trafficking in this country. It is needed now: https://t.co/a0rTXo4BWK"]["The bipartisan legislation will help ensure that tax dollars aren’t used to create #jobs overseas. It is needed now to protect American jobs. Read more about our bill here: https://t.co/JalvKK9gOd"]["We must do everything we can to protect and maximize American #jobs. That is why I introduced the https://t.co/kgjXRgkXmf Act with @ChrisMurphyCT, @LindseyGrahamSC, &amp; @SenSherrodBrown: https://t.co/JalvKK9gOd"]["It is unbelievable that in this century, in this country, sex trafficking is increasing. It is up to Congress to act: https://t.co/a0rTXo4BWK"]["The time is now for the Senate to crack down on online sex trafficking &amp; pass #SESTA: https://t.co/XdIreQxIZT"]["It takes courage to wear the badge. Thank you to police officers in #Ohio and across our country who have dedicated their lives to keeping others safe. #LawEnforcementAppreciationDay https://t.co/6YSmCvp5Ge"]["Good meeting w/ Jay Powell today. He has the qualifications necessary to make him a highly-successful Chairman of the Federal Reserve. https://t.co/tP7DH7DNJU"]["Worth reading from the @USATODAY ed board: \"To catch mass killer, focus on fentanyl shipments\" https://t.co/txeSZKuvcE #STOPAct"]["We now have 64 bipartisan supporters of #SESTA in the Senate. Most importantly, it is supported by victims and anti-trafficking advocates. Senate must act this month: https://t.co/IZxV9JT1gJ #HumanTraffickingAwarenessMonth"]["We have every reason to act on #SESTA and no reason not to. These victims deserve justice. Congress should help provide it: https://t.co/IZxV9JT1gJ #HumanTraffickingAwarenessMonth"]["Today on the Senate floor, I urged my colleagues in the Senate to pass #SESTA to help stop online sex trafficking. The time is now: https://t.co/IZxV9JT1gJ #HumanTraffickingAwarenessMonth"]["This is exactly what we had in mind when we passed long-overdue #TaxReform. Will lead to more economic growth, investment, and money in the pockets of #Ohio workers: https://t.co/afK0KZu7CE"]["#Ohio companies are responding to #taxreform with more investment &amp; benefits for their workers: https://t.co/afK0KZu7CE"]["Headed to the Senate floor to deliver a speech on #SESTA and the need to #EndHumanTrafficking. Tune in: https://t.co/WY1nLy1iWU #HumanTraffickingAwarenessMonth"]["Workers in Chillicothe &amp; around #Ohio deserve the opportunity to compete on a level playing field with workers in other countries. #TaxReform helps provide that: https://t.co/2Aet6hUkLf"]["Treatment centers like @Alvis180 in Columbus are working. But we must do more to keep deadly drugs like fentanyl out of #Ohio: https://t.co/nDYR6C1Hlz"]["Fentanyl is being shipped to drug traffickers in the U.S. from countries like China. @USAToday editorial highlights need for the #STOPAct to help keep these drugs out: https://t.co/txeSZKM6Be"]["Big night for Buckeye basketball! OSU takes down no.1 Michigan State 80-64"]["Companies will be bringing #jobs and investment back from overseas because America is now a more friendly place to do business: https://t.co/m88xl0jbOm"]["More and more companies in #Ohio and around the country are putting more money in the pockets of their workers because of #taxreform. See the list: https://t.co/MYK1NpnQzA"][".@Nationwide is giving $1,000 bonuses to 29,000 employees and increasing 401(k) matching contributions for 33,000 employees. #TaxReform"][".@WesternSouthern is giving $2,000 bonuses to its full-time employees &amp; $1,000 to part-time employees. Goes to all of their more than 3k employees except senior management. #TaxReform"][".@FifthThird is raising the base wage to $15 for nearly 3,000 hourly employees &amp; giving $1,000 bonuses to 13,500 employees. #TaxReform"]["As a result of #taxreform, Wolf Metals in Columbus is purchasing new equipment to help their company, their workers, &amp; those who rely on us to deliver top-of-the-line product: https://t.co/X2yplUbBV8 #Jobs https://t.co/uTP3oQ2C0s"]["Exciting visit on Tuesday to Cincinnati's Sheffer Corporation, where it announced new investments in its plants and equipment as well as $1,000 bonuses for all its 126 workers b/c of #taxreform: https://t.co/uK8uLmicPI"]["The Senate is hitting the ground running in the new year. Here’s a look back at my 2017 working on behalf of #Ohio: https://t.co/Bq3IaSg0Hg"]["On @SquawkCNBC, I discussed how #taxreform is already helping #Ohio workers. Check out the interview here: https://t.co/hlYmtArNcV"]["In the @ChilliGaz, I detail how families get tax help, job opportunities, &amp; higher wages from the tax bill: https://t.co/2Aet6hUkLf #TaxReform #Jobs"]["All over #Ohio, I have met with dedicated people working to help others break the cycle of addiction. I am inspired by their work, &amp; I will continue to do my part at the federal level to help combat the #opiodcrisis. #CARA #STOPAct"]["And yesterday, I returned to @Alvis180 in Columbus. Alvis has helped provide support &amp; hope to thousands of individuals returning to their communities after spending time in the criminal justice system. https://t.co/JYVSvG9O0N"]["On Tuesday, I visited Healing Hearts in Mansfield &amp; heard directly from those working to turn their lives around. There is hope: https://t.co/0SOp4LViQN #OpioidCrisis"]["The #opioidcrisis is at epidemic levels. Sadly, I am told that more Ohioans overdosed in 2017 than ever before. We need all hands on deck to turn back the tide of addiction. https://t.co/XusytBjiSw"]["It was a pleasure to meet Jazzmine and Josh &amp; hear their stories. They are proof that, with the right treatment and recovery programs, with the right support system in place, you can beat back the disease of addiction. https://t.co/5cET8fmEDz"]["ICYMI, here is my floor speech from last year honoring @Alvis180 for their 50 years of providing highly effective re-entry treatment programs: https://t.co/mwCUL6tF0J"]["Proud that the Second Chance Act is working to help @Alvis180 to help people reach their God-given potential. The people I met today are an example of how re-entry programs can work. https://t.co/E7zXRuGLRJ"]["When I talk to the people who work at @Alvis180, or those they are helping, it is clear that their method to turn lives around 180 degrees is working. https://t.co/HfAmld1yur"]["I had a great visit to @Alvis180 in Columbus! They have become a model for re-entry and treatment service programs. https://t.co/YTeHt5rLD6"]["The impressive entrepreneurs I met w/ today are driven to solve big problems in a way that helps everyone. I'll continue to do my part to help them succeed. #TaxReform #Jobs https://t.co/ANANhT1Hrq"]["The U.S. no longer has the highest business tax rate in the industrialized world. This will help start-ups and entrepreneurs compete on the global stage. #TaxReform #Jobs https://t.co/GgkEfPm5tW"]["Enjoyed meeting w/ entrepreneurs in Columbus today at @CoverMyMeds. Cbus is at the forefront of entrepreneurship &amp; big ideas. @VentureOhio https://t.co/wkziUWW9yr"]["Worth the read: @ShopFloorNAM CEO: \"Manufacturers Intend to Deliver on Tax Reform's Promise\" https://t.co/KSBdmFWxYb #TaxReform #Jobs"]["Enjoyed taking questions from Wolf Metals employees &amp; touring the facility. I'm pleased that #taxreform is paying dividends for them &amp; their families. More success stories to come! https://t.co/axtGZelsnA"]["This investment isn’t just important for companies like Wolf Metals and the workers it employs, but also for their surrounding communities and the economy as a whole. #TaxReform #Jobs https://t.co/0oKjQS39Ku"]["The results of the historic tax cuts have already begun to be reflected in the decisions of #Ohio #smallbiz like Wolf Metals. New equipment will lead to more efficiency and more savings. #TaxReform #Jobs https://t.co/EdlCoSrxIx"]["Proud to introduce the Fallen Warrior Battlefield Cross Memorial Act to help ensure that veterans buried in #Ohio and around the country can be properly honored with the Battlefield Cross: https://t.co/3NIhZfLIVn"]["The list continues to grow! More and more companies responding to #taxreform by announcing wage increases, bonuses, higher 401(k) matches, and more investment in plants &amp; equipment: https://t.co/AWSCzuxWQd #Jobs"]["Because of #taxreform, people are seeing pay raises &amp; bonuses, and more companies are investing more in plants and equipment and worker 401(k)s: https://t.co/1Vx3RkRmlb"]["On @SquawkCNBC, I discussed the positive impact that #taxreform is already having on #Ohio workers and families: https://t.co/Bml0cobapF"]["Congrats to 2018 #Ohio Teacher of the Year Jonathan Juravich, one of four finalists for Nat'l Teacher of the Year! Proud to have such dedicated educators in OH. #NTOY18"]["The U.S. must stick up for American companies like @WhirlpoolCorp who have been hurt by unfair imports: https://t.co/c8Yd2woMe4 #jobs #Ohio"]["That human trafficking is occurring in this country is a stain on our national character. W/ 61 bipartisan supporters, Senate should act on #SESTA now to help #endhumantrafficking: https://t.co/bJcCWXMext"]["We must do more to tackle the #OpioidCrisis &amp; the disease of addiction. In Mansfield this week, I heard stories of recovery &amp; hope, and discussed how #CARA will help: https://t.co/0SOp4LDHZf"]["There is strong bipartisan support &amp; momentum for #SESTA. Senate must act to help ensure that sex traffickers are brought to justice: https://t.co/6IAQYDVX9I"]["Pleased that @SenatorRounds, @SenShelby, &amp; @SenPatRoberts have cosponsored the Stop Enabling Sex Traffickers Act. #SESTA now has 60 bipartisan supporters in the Senate: https://t.co/6IAQYDVX9I"]["More money in the pockets of hard working Americans. More investment here in America. That is what we wanted when we passed #TaxReform. And now it's happening: https://t.co/Ky7V5mpS75"]["More great news as a result of the new #taxreform law, as another #Ohio company puts more money back into the pockets of its workers: https://t.co/Ky7V5mpS75"]["@WhirlpoolCorp You can read my letter w/ @SenSherrodBrown fighting for a level playing field for #Ohio workers at @WhirlpoolCorp here: https://t.co/YXoq9pJa59 #jobs"]["The International Trade Commission has agreed that @WhirlpoolCorp has been hurt by unfair imports. Now the U.S. must provide broad relief for the U.S. washing machine industry in response to these trade violations: https://t.co/80qPOHulTg #Ohio #jobs"]["#TaxReform is already paying dividends for hardworking people of #Ohio as companies increase their investments in their business &amp; their workers: https://t.co/8AiqC3FNje"]["Workers at Sheffer Corporation in Cincinnati, and companies around #Ohio &amp; the U.S., will have more money in their pockets because of #TaxReform. https://t.co/FO05uHERl4"]["Honored to swear in new Ashland Mayor Matt Miller and City Council Members Al Farnam and Dennis Miller this evening. Looking forward to working with them for #Ohio https://t.co/mnctYnRZpB"]["During our roundtable discussion today at Healing Hearts in Mansfield, we discussed the importance of passing legislation like #CARA that provides resources for prevention, treatment and recovery. https://t.co/G38MeccyMX"]["I’m proud of the work organizations like Healing Hearts are doing to help their communities. We must continue our efforts to help organizations that provide treatment and assistance to those in need. https://t.co/DIK3zTc0r9"]["I’m pleased that we’re already seeing employers like @ShefferCorp reward their workers with higher pay and bonuses—and increase their investments in their businesses and their communities https://t.co/yqW84Ez9bl #taxreform"]["The historic tax cuts that recently became law are already helping make a difference for middle-class families &amp; raising wages for #Ohio’s workers #taxreform https://t.co/yqW84Ez9bl #jobs"]["Great tour of @ShefferCorp’s Cincinnati facility today. Honored to take part in the announcement of the bonuses they are giving their workers thanks to #taxreform https://t.co/uaSfZrN2LH"]["January is National Slavery &amp; Human Trafficking Prevention Month. We must do more to combat this horrific crime &amp; passing #SESTA will help. I urge the Senate to pass it."]["Looking forward to a new year of working on behalf of #ohio. Here is what we accomplished in 2017: https://t.co/2MsqyLTlJV"]["For a reminder on why #SESTA is needed now, please listen to those who have been directly impacted: https://t.co/Oh1MqNCr7b"]["After delivering the first significant #taxreform since 1986, I’m optimistic that we will deliver more results this year. It is time for Congress to pass #SESTA, pass the #STOPAct, &amp; more."]["I stand in support of Iranians speaking out against oppression and tyranny. Freedom-loving countries around the world should support #IranProtests."]["Wishing everyone a Happy New Year! I look forward to getting back to work for #Ohio."]["So many great options for fireworks throughout #Ohio for NYE! Where are you and your family headed tonight?"]["This year, my focus was on delivering results for the people I represent. Proud to help lead the effort to pass historic tax cuts that will help the middle class, create more and better jobs, and boost wages: https://t.co/U7JVF9KkLs"]["My most important job is representing you, the people of #Ohio. I’m proud of my team’s casework efforts, and I’ll continue to make that, and helping you, a priority."]["During my time in the Senate, my office has opened more than 20,000 cases and have saved more than 80% of those successfully. This year alone, we closed almost 3,000 cases favorably."]["Also this year, significant progress was made in the fight to #endhumantrafficking, help Ohioans struggling w/ addiction, &amp; provide resources to our men &amp; women in uniform. But there is more to do. https://t.co/U7JVF9KkLs"]["I know that for many #Ohio families, navigating the federal bureaucracy when in need of assistance can be a frustrating experience. That’s why my office puts a priority on casework. My office is always here to help. https://t.co/U7JVFa1VD0"]["Great win by the #Buckeyes last night! Congrats to J.T. Barrett and the seniors on an incredible season. #GoBucks! https://t.co/kSnn2fFQRl"]["The new #TaxReform law will create more #jobs &amp; help hardworking #Ohio families keep more of the money they earn: https://t.co/svfzmiHTKb"]["#TaxReform is an investment into American families, American workers, &amp; American businesses. It is time we have a tax code that works for them: https://t.co/xs9k9dKCFq @recordherald"]["Many Americans have been displaced from their homes and their families this year because of natural disasters. @M25M_org has been playing a key role in helping them while they get their lives back on track. https://t.co/FDiozMTnmS"]["It was wonderful to visit @M25M_org today, an organization that truly does the Lord’s work in giving back to the community and helping those in need. https://t.co/TpxIWXOKix"]["I’ll continue to work to deliver results for the thousands of Ohioans who depend on Lake Erie: https://t.co/U7JVF9KkLs #GreatLakes"]["I enjoyed traveling the state this year to hear about how the Great Lakes Restoration Initiative is working for #Ohio. https://t.co/ro57cmq1QM"]["Lake Erie is a part of #Ohio’s character, and it’s critical for the future of our state and country. I’ll continue to fight to keep our Great Lakes clean: https://t.co/rcXM3jd7NJ"]["Sadly, women &amp; children are trafficked every day in #Ohio. I travelled the state this year meeting w/ victims to hear their stories. #SESTA is designed to help them. https://t.co/lvAXMOhYC1"]["This year I also met with those in recovery and those on the frontlines of this #opioidcrisis. From those at @Racing4Recovery in Holland, to @Maryhaven in Columbus, &amp; many more, it is so important for me to hear directly from them. https://t.co/esR0UVtwt0"]["The #taxreform bill will make a real difference for the people of #Ohio. I describe how in my op-ed in the @recordherald: https://t.co/xs9k9dt1NS"]["Another #TBT to my #Ohio Defense Tour that took me to 13 counties over 5 days. I got to meet with the best that OH has to offer: https://t.co/0t6WIHxhkA"]["#TBT to my #Ohio Auto Manufacturing Jobs Tour, during which I covered more than 700 miles to hear from auto manufacturers about how I could help: https://t.co/o3WY1v6iXz"]["A highlight of my job is getting to travel the state to meet with #Ohio workers and families from all different backgrounds with all kinds of jobs and interests."]["Happy 229th birthday to my hometown of Cincinnati! Proud to call the Queen City home."]["The #taxreform law preserves the new markets tax credit and the work opportunity tax credit, which will help economic distressed communities and help give people a second chance: https://t.co/U7JVF9KkLs"]["The #taxreform law preserves the Historic Tax Credit, which is critical to numerous #Ohio historic buildings like Cincinnati’s iconic Music Hall. https://t.co/7FPUd9f7t4"]["The #taxreform law levels the playing field for American companies &amp; workers by reforming the international tax code. Means more #jobs &amp; investment here in the U.S. https://t.co/HYR1mm0XAM"]["The #taxreform law expands tax relief for #smallbiz. This pro-growth reform will grow our economy, create more #jobs, &amp; make American more competitive w/ our foreign counterparts. https://t.co/U7JVF9KkLs"]["The #taxreform law expands the child tax credit, helping families spend more of their hard earned money how they see fit. https://t.co/U7JVF9KkLs"]["The Tax Cuts &amp; Jobs Act will deliver real #middleclass tax cuts. This chart shows who gets the biggest proportional tax break: https://t.co/a32gFAKk5E"]["The Tax Cuts &amp; Jobs Act means you get to keep more of your paycheck &amp; it means more #jobs &amp; investment here at home: https://t.co/wyG4oTjrjI"]["Enjoying time in Ohio with Jane and the kids. I hope everyone had a Merry Christmas and is enjoying the holiday season!"][".@cavs are on a roll! Hoping to see King James and co get the win against the Warriors today."]["Wishing you all a very Merry Christmas! https://t.co/GzuKTaukHs"]["Beautiful candlelight service at our church tonight with plenty of carols and a powerful reminder of the meaning of Christmas"]["Thankful for our brave men &amp; women in uniform serving our country across the world. It is your courage and sacrifice that allows us here at home to enjoy the freedoms of this great country that we too often take for granted. https://t.co/ZVuGW2y4hx"]["Hope every has their holiday shopping done! I’ve still got some to do. Wishing everyone a Merry Christmas and Happy Holidays."]["Congress did pass a short term CHIP funding extension through early next year, but we must do better.  We need a long-term funding solution now to help more than 200,000 #Ohio kids: https://t.co/lQ5xwLRZC2"]["It is outrageous that we have had a tax code that is sending jobs &amp; investment overseas. With the Tax Cuts &amp; Jobs Act now law, this will change. https://t.co/AidKE0gO0q"]["The last time Congress passed comprehensive tax reform? Ronald Reagan was president, Pete Rose was still playing for the Reds, &amp; Top Gun was dominating the box office. https://t.co/wGmy7aNUKi"]["For years, #middleclass families have been promised a tax code that works better for them. Congress has finally delivered: https://t.co/kjFOhtivOO"]["We’ve accomplished a lot for #Ohio this year, but there’s much more work to be done. See our end of year report: https://t.co/U7JVF9KkLs #taxreform #jobs #SESTA  #STOPAct"]["Back home in #Ohio for my favorite time of the year. Family and last minute shopping for gifts. Hope you are getting to spend time with family and loved ones."]["Pleased that @POTUS has agreed to provide the capabilities #Ukraine needs to defend itself against Russian aggression. Bipartisan majority in Congress stands with him on this important step. https://t.co/XAshaXC29c"]["How does #taxreform affect you? @CBSThisMorning looked at how three different households will fare under the tax bill https://t.co/VuYisVpoHA"]["@RealDonaldTrump: Appreciate your leadership on #taxreform, which will help create more #jobs &amp;  better wages for all Americans."]["Last night I spoke on the #Senate floor about #taxreform and how it will help #middleclass families with more and better #jobs and higher wages https://t.co/72eaJmRmxG #Ohio"]["Our tax code is broken. But today our #taxreform bill is the law of the land after @POTUS signed it into law. Will help create more #jobs, better wages &amp; a brighter future for #Ohio families &amp; #SmallBiz. https://t.co/mejxfVRNNx"]["Providing tax relief for #middleclass families &amp; reforming our business tax code to create more #jobs and boost wages is the right thing to do, and I was proud to play a significant role in helping craft this measure. https://t.co/eZt989H3pP #taxreform #Ohio"]["BREAKING: @POTUS signs historic tax cuts to help #middleclass families, create more #jobs &amp; increase wages for #Ohio workers. https://t.co/eZt989H3pP"]["Last night on the #Senate floor, I spoke about the importance of the Children's Health Insurance Program &amp; the need for a long-term funding solution https://t.co/2SXdQe5CCs"]["In fact, Ohio’s overdose rate is twice the national average. We must stop these deadly poisons from getting into our communities. Pass #STOPAct now. \nhttps://t.co/s8yPlKro7G"]["Ohio ranks second among all states for drug-related deaths having lost 4,539 Ohioans in 2016. There is no time to waste. Pass #STOPAct now. \nhttps://t.co/s8yPlK9Ng8"]["New data from CDC shows that overdose deaths continue to rise across the country and that fentanyl is a leading cause. We must pass the #STOPAct now \nhttps://t.co/s8yPlK9Ng8"]["After today’s #taxreform enrollment ceremony, historic tax cuts are now on the way to @POTUS @RealDonaldTrump’s desk.  Important for more #jobs &amp; better wages. https://t.co/iBkXdl10vm"]["This bill is made in America, for America #taxreform https://t.co/rCmIkryZ9B"]["Our plan will create a fairer tax system that encourages #jobs and investments to occur right here in this country rather than sending them overseas  #taxreform https://t.co/9Vr2ObQLAS"]["Our plan will reform the business tax code to create more #jobs and create higher wages while making American workers more competitive in the global marketplace #taxreform https://t.co/VsYn4o7aOM"]["Our plan gives middle-class families a tax cut so they can keep more of their hard-earned money  #taxreform https://t.co/Pky8cY5sDu"]["Joining @Varneyco on @FoxBusiness to discuss delivering historic #taxreform to the American people. Tune in!"]["Pleased to see Fifth Third Bank and others reward their employees and boost investment in the US after historic #taxreform #jobs #Ohio\nhttps://t.co/sf2rNrgQlN"]["Americans across the nation are eager to see their paychecks reflect the benefits of these historic tax cuts, and today I urged the IRS to move quickly on implementation. https://t.co/qC3FedbYqi #taxreform"]["Providing lethal weapons to #Ukraine will send a clear message that America stands with the Ukrainian people in their nearly four year struggle to secure a democratic, prosperous, and independent future for Ukraine in the face of Russian aggression."]["Pleased that, for the first time, the president will be providing lethal military assistance to #Ukraine: https://t.co/TS5DEytAr9"]["ICYMI, last night on the Senate floor I detailed how this bill will help #middleclass families &amp; create #jobs. You can watch here: https://t.co/7fmSbfAWr4"]["The #TaxCutsandJobsAct is now on its way to the president's desk for signature! This is a historic moment, and one that will result in more &amp; better #jobs &amp; higher wages."]["#Ohio children rely on CHIP. I'll keep fighting for a long-term re-authorization on behalf of them and their families. #ExtendCHIP"]["Congress should include a long-term extension of #CHIP in any CR. I discussed why this program is so critical in a recent committee hearing: https://t.co/ku6DfMZHzW"]["This bill will cut taxes for middle-class families, and reform our business tax code to create more jobs and higher wages for #Ohio workers. https://t.co/kjFOhtA7do"]["BREAKING: The Senate has passed once-in-a-generation #TaxReform. Passage of these historic tax cuts are a big victory for the American people."]["Under this #taxreform proposal, every single one of the seven tax brackets gets a tax cut, with the biggest proportional tax cut going to those making between $20,000 and $40,000 per year. https://t.co/ETMwpy3gbn"]["I believe this once-in-a-generation #taxreform legislation will reopen our economy as the best place in the world to do business and create a brighter future for all Americans: https://t.co/ktyWNUxibv #jobs"]["We're creating a fairer tax system that levels the playing field and creates jobs and investment here in America rather than overseas."]["We're putting faith in American entrepreneurs and workers to compete and win in the global market."]["We’re giving families the freedom to spend more of their own money how they see fit."]["This #taxreform bill is an investment we are making in American families, American workers, &amp; American businesses: https://t.co/ktyWNUxibv"]["On the Senate floor, ahead of tonight’s historic vote, I detailed how #taxreform will help the #middleclass, boost #jobs, &amp; increase wages: https://t.co/ktyWNUxibv"]["This #taxreform bill provides real #middleclass tax cuts and it will give the economy an important shot in the arm. #Jobs https://t.co/ExCAx014fp"]["#TaxReform is going to make America a better place to do business. This means more #jobs and better wages. https://t.co/SBMvEC89yQ"]["Tune into @FoxNews -- will be discussing #taxreform &amp; #jobs momentarily. https://t.co/juOa5STM6j"]["Congratulations to @SpeakerRyan, @RepKevinBrady, @PatTiberi &amp; my colleagues in the House of Representatives for passing #taxreform that will boost the middle class, create #jobs, &amp; raise wages."]["I've been volunteering w/ @Habitat_org for more than 20 years &amp; I'll continue to support this great org. Already looking forward to my next build! https://t.co/bx3K5utTkd"]["It was great to have Caroline from Cincinnati helping me out during today's build! Always enjoy meeting impressive young Ohioans. https://t.co/JLWE7cKzA7"]["Continuing the birthday tradition with a @Habitat_org build out in DC before votes today! https://t.co/nV2SHxPLIN"]["The workers at the JSMC in Lima are helping provide our military with top-of-the-line tanks &amp; equipment. Proud to support them: https://t.co/3dqwY9Dr8s"]["We are allowing people to keep more of their paycheck, and spend more their money how they see fit. https://t.co/3dqwY9Dr8s #TaxReform"]["By passing the first significant #taxreform legislation since 1986, Congress will help create a better economy &amp; a better future for workers in towns like Lima: https://t.co/3dqwY9Dr8s @limanews"]["Important that we retain tax incentives for redevelopment and urban renewal. Proud to fight for that: https://t.co/7FPUd9f7t4 #TaxReform"]["\"Preserving Key Tax Incentives a Big Win for Cincinnati.\" My op-ed in the @Enquirer: https://t.co/7FPUd9f7t4 #TaxReform"][".@Cavs vs Wizards never fails to disappoint. Another 57 from the King today?"]["Had a great time visiting with graduates before today’s ceremony. Impressive group of students with a bright future. Congrats @OhioState Class of 2017! https://t.co/Wv1Vx5APfi"]["Honored to speak at the @OhioState commencement today. I encouraged this group of future leaders to be kind and true &amp; to always work hard for their dreams. https://t.co/1EABTQ92VI"]["My recent op-ed in the @DispatchAlerts discusses how funds I fought for are making a real difference in #Ohio communities to combat opioid addiction. Read it here → https://t.co/XusytBAUh6"]["Hopeful that this week, the president will sign into law legislation that will reform our broken tax code for the first time since 1986. More importantly, it will help deliver long-promised jobs &amp; increased wages."]["The EMPOWER Care Act will help ensure that all Ohioans can continue to have a choice in where they seek long-term care support: https://t.co/hTC82JQ57o"]["Intro'd a bill this week with @SenatorCantwell to help people receive care in their homes and reduce health costs: https://t.co/hTC82JytIO"]["Happy Wright Brothers Day to all the #Ohio scientists, entrepreneurs, inventors, builders, and doers who carry on their legacy!"]["We cut down our own tree for Christmas this year - an Ohio cedar! https://t.co/LsBvOYoaTn"]["To see how the Tax Cuts &amp; Jobs Act will help individuals and families, go here: https://t.co/GV9RM4Y5Y8"]["Senate should act on #SESTA - we need to get this bill signed into law ASAP to protect women &amp; children from traffickers. https://t.co/MpMprAPdbj"]["#SESTA is supported by victims and advocates, law enforcement, the civil rights community, faith-based groups, and the larger tech community because it will help #EndHumanTrafficking."]["We spent years in the Senate coming up with a bill that would address the scourge of sex trafficking. The result was #SESTA: https://t.co/MpMprAPdbj"]["I have seen these tax incentives work to leverage more private sector funding for  #Cincinnati &amp; #Ohio and generate more economic growth &amp; more tax revenue over time."]["As a member of the tax-writing committee and the tax conference I fought hard to retain these important tax incentives for redevelopment and urban renewal  across #Ohio. https://t.co/OM3dYjp7Rq"]["The key tax incentives I helped preserve for #Ohio include the historic tax credit, the new markets tax credit, and private activity bonds. These urban  renewal tools have been successful in our state. https://t.co/OM3dYjp7Rq"]["The final House-Senate tax agreement preserves important tools for urban renewal that have worked well in Over-the-Rhine in #Cincinnati &amp; other areas of #Ohio, and I fought to preserve them."]["On @FoxNews, I discussed how the tax reform bill will result in substantial #middleclass tax relief: https://t.co/pJJZSFpLKq"]["American workers deserve better than our current tax code. Last night, Congress took action. This bill will result in more &amp; better #jobs and higher wages. It's about time. https://t.co/1W9gkUSfvn"]["I look forward to both the House and Senate passing this legislation next week and the president signing these historic tax cuts before Christmas: https://t.co/GJVjdaOvV4"]["Through this #taxreform plan, Congress is helping create a better economy and a better future for all Americans. Here is a summary of our plan: https://t.co/fvyZ1Cl0i3"]["I was proud to play a significant role in this conference, working alongside my colleagues in the House and Senate to craft this bill and improve it on behalf of #middleclass families. https://t.co/GJVjdb66MC #TaxReform"]["Today marks another important milestone in our efforts to provide tax relief for middle-class families and reform our business tax code to create more jobs and increase wages for American workers."]["The #Ohio &amp; Erie Canalway National Heritage Area supports 4,200 Ohio #jobs and I’m proud to work in a bipartisan way to protect the site.  https://t.co/ytW50AhMCr"]["Honored to have worked with Chairman @RepKevinBrady on the #taxreform conference committee to update our broken tax code so that it works for America’s middle class by boosting #jobs and wages. https://t.co/2neVnm9eQ7"]["Pleased to sign the conference report on the Tax Cuts &amp; Jobs Act which will bring much needed tax relief to our middle class while boosting #jobs and wages. #taxreform https://t.co/s7QcqXJybI"]["Under our #taxreform bill, every income level gets tax relief \nhttps://t.co/riRSEKwnSR"]["We’re in this fight to help trafficking survivors who’ve long been denied justice &amp; to hold accountable bad actors that knowingly facilitate online sex trafficking. #SESTA will do that: https://t.co/MpMprAPdbj"]["Thank you @SenBlumenthal, @SenJohnMcCain, @clairecmc, @JohnCornyn, &amp; @SenatorHeitkamp for supporting #SESTA &amp; its mission of ending human trafficking: https://t.co/MpMprAPdbj"]["The new House bill on #humantrafficking won't help trafficking survivors get justice. We need serious solutions to #endhumantrafficking: https://t.co/MpMprAPdbj #SESTA"]["I applaud #Canada for authorizing defensive lethal assistance to help #Ukraine defend itself. It’s long past time for U.S. to do the same. https://t.co/RcsF7OGHWO"]["The changes we are making on the business side of this tax reform proposal will make American workers more competitive and attract more investment and #jobs. That is good news for #Ohio workers: https://t.co/tkdQ7vN066"]["On @FoxBusiness, I discussed the importance of providing #MiddleClass tax relief: https://t.co/qUiRAw3cyn"]["Thanks @SenGillibrand for cosponsoring #SESTA and standing with victims and survivors to help #EndHumanTrafficking."]["Had our bipartisan Secret Santa exchange here in the Senate last night. Hope @SenDonnelly from neighboring Indiana gets to enjoy the @GLBC_Cleveland Christmas Ale I got him!"]["In a recent op-ed, I outline how, with real #taxreform, Congress has a chance to deliver on our promise to help create a stronger economy with more #jobs, higher wages, and a better future for #Ohio families: https://t.co/aVqB9788yM"]["Congress has been talking about delivering #middleclass tax relief for a long time. We are finally delivering on it. #TaxReform https://t.co/FKMo7ieOOw"]["Working with members of the House &amp; Senate to come up with a tax bill that helps the #middleclass. I discussed how I believe #taxreform will help: https://t.co/GbXuROMA6o"]["New #NDAA funding will make a difference for our military &amp; allow JSMC to continue assisting our men and women in uniform:https://t.co/xnGziRo77T"]["I have seen firsthand the innovative research &amp; development conducted at the Air Force Research Lab at @WrightPattAFB. Proud to support their mission: https://t.co/EokypCbvf4 #NDAA"]["In #Ohio, there are 219,000 kids who get high-quality health coverage through #CHIP. It is critical that Congress #ExtendCHIP to support these children."]["Jane and I wish our friends in the Jewish community preparing to celebrate the Festival of Lights a Happy Hanukkah!"]["That’s what #taxreform is all about – it will provide more opportunity for workers in #Ohio, South Carolina, &amp; across the country and lead to more #jobs and better wages. https://t.co/KJeLaYYNlg"]["My bipartisan measure in the #NDAA will help ensure that disinformation and propaganda used against us, our allies, and our interests will fail: https://t.co/kDFoZLJKAU"]["The U.S. must better coordinate &amp; synchronize our government’s response to foreign propaganda &amp; disinformation from countries like #Russia: https://t.co/kDFoZM1lZu"]["An independent #Ukraine is critical not just to Eastern Europe, but it also impacts broader U.S. interests in the region and beyond. #NDAA underscores our commitment to an independent Ukraine: https://t.co/yjJLFxbQnr"]["The Lima Tank Plant makes the best tanks in the world. Proud to fight for funding for them so the workers there can continue to help our military: https://t.co/ZkmHqaf1uo https://t.co/P2X3OumsGD"]["Defending the homeland is the number one national security mission for our military. New hangars will help the @180thFW perform their mission: https://t.co/e9MdmF1mPQ https://t.co/3r3Uz7nIVA"]["#NDAA includes funding to support #jobs &amp; the important research mission at @WrightPattAFB Air Force Research Lab: https://t.co/xiS4rND9YB https://t.co/S11N7OSbm0"]["#Ohio is home to some of the best and brightest serving our country, &amp; is home to some of our nation’s premier defense installations. Proud to fight for them in the #NDAA: https://t.co/LqIzq85iX5 https://t.co/LXSXt044px"]["Pleased the president signed the #NDAA into law to help ensure that our armed forces have the resources they need to carry out their critical national security objectives: https://t.co/LqIzq85iX5"]["Congress must act on #SESTA to help end the heinous crime of human trafficking that is devastating far too many families here in the U.S. https://t.co/rJcsBVKYb0"]["#SESTA is widely supported by anti-trafficking groups, law enforcement, and most importantly, the victims of trafficking who deserve their voices to be heard: https://t.co/guu5keczBQ"]["We should be encouraging companies to bring money back to the U.S. and to invest in America. This will result in more #jobs: https://t.co/Wn5WyrtbEb #TaxReform"]["#TaxReform will level the playing field internationally for American workers and businesses. My op-ed in @logandaily: https://t.co/Wn5WyrbAMD"]["Always inspired by our first responders who are so quick to respond and put themselves in danger to protect others. Their response in NYC this morning is another reminder of their heroic efforts."]["My team held a workshop today w/ community leaders in Fayette County to strategize on how to help the county fight drugs and get the federal resources it needs. More here: https://t.co/qtiZhWJNPM https://t.co/HXndwTf4EN"]["With real #taxreform, Congress has a chance to deliver on our promise to help create a stronger economy with more #jobs &amp; higher wages: https://t.co/aVqB97pJqk"]["Ohioans are one step closer to getting tax relief. My op-ed in the @delgazette: https://t.co/aVqB9788yM #TaxReform #Jobs"]["Seeing a lot of great Christmas decorations around #Ohio this weekend. Nothing beats the Festival of Lights at the @CincinnatiZoo!"]["We have a once-in-a-generation opportunity to pass a #taxreform bill that will improve our economy and expand opportunity for all Americans. I'll continue to work to get this done."]["I am pleased that new @DHSgov Secretary Kirstjen Nielsen supports the #STOPAct. Senate needs to act to keep deadly drugs like fentanyl out of #Ohio &amp; our country: https://t.co/WkoJw3f43O"]["One way that Congress can help those on the frontlines better deal w/ the scourge of addiction is to pass the #STOPAct: https://t.co/Wz3vDQg1cl"]["Groups like @Alvis180 in Columbus, #Ohio are doing their part to turn the tide of addiction. Important that we all work together to combat the #opioidcrisis: https://t.co/INEExdGZE2"]["#SESTA has broad bipartisan support in the Senate because it will help bring traffickers to justice &amp; stop this crime from happening. #EndHumanTrafficking"]["That we are actually seeing an increase in #humantrafficking in this country, in this century, is a stain on our national character. #SESTA https://t.co/4YbUNIA6Q8"]["#TaxReform will lead to economic growth &amp; more investment here in the U.S. https://t.co/zmmWPMfdpw"]["In @ohiodotcom, I discuss how #taxreform will put more money in the pockets of average #Ohio families: https://t.co/GcKaPn36B2"]["In an op-ed in @clevelanddotcom, I outlined how the GOP tax cuts will be good for the #middleclass, good for America, and good for business: https://t.co/xDF2O0RsYR #TaxReform"]["My hope is that the House and Senate will send a final bill to the president’s desk before Christmas. #TaxReform #Jobs #MiddleClass"]["This effort to fix out broken tax code is about giving #Ohio families a better future with more #jobs &amp; higher wages: https://t.co/oIstbNA3F0"]["In 2010, I made a commitment to the people of #Ohio that I would fight to reform our broken tax code that is driving jobs and investment overseas &amp; to provide relief to families &amp; #smallbiz. This bill does that."]["I agree with Rev. Brooks Berndt who says \"the true test of a nation's moral character is how it treats its children.\" This Lead-Safe Housing for Kids Act is needed to protect American children: https://t.co/eLo3mK1C53"]["Christmas tree is up in my DC office! https://t.co/eQcVGEW6BF"]["It has been an honor to serve with you in the United States Senate. I urge everyone to watch @SenatorStrange’s speech on the Senate floor yesterday. https://t.co/G7EhxN1LJ4"]["Good #JobsReport today, but too many families still feeling the middle-class squeeze. Why we need #taxreform to create more #jobs &amp; higher wages.  More in my @ohiodotcom op-ed here: https://t.co/GcKaPn36B2"]["Congratulations to @EdwinsCLE &amp; the documentary \"Knife Skills\" for making the #Oscars short list! I'm always impressed by the people I meet at Edwins &amp; of course the amazing food! https://t.co/yOVFhKjGmU"]["Today, my staff hosted a grant-funding workshop with our partners in Union County and Marysville to help the community get access to funding to combat the #opioidcrisis. #CARA https://t.co/2iRBsDG6dw"]["#MiddleClass families will get immediate relief through the tax cuts in our #TaxReform plan. See how in my @ohiodotcom op-ed: https://t.co/GcKaPnkHsA"]["A typical #Ohio family will save about $2,400 a year on their taxes. This will help families in Akron &amp; all over our state. My op-ed via @ohiodotcom: https://t.co/GcKaPnkHsA"]["#TaxReform is about giving #Ohio families a better future with more #jobs &amp; higher wages. I'm optimistic we will get this done soon: https://t.co/oIstbNisgq"]["Excited to serve on a House-Senate conference committee to help finalize the Tax Cuts &amp; Jobs Act. We've made important strides toward providing #middleclass tax relief &amp; reforming our tax code. More to do: https://t.co/oIstbNA3F0"]["Today, we remember those who were lost in the attack on Pearl Harbor and the incredible sacrifices of the #GreatestGeneration on that day and the years that followed."]["I've heard from Ohioans all over the state who are frustrated that they have a tax code that doesn't work for them &amp; encourages investment overseas. #TaxReform will change that: https://t.co/xDF2O0zS7j"]["#TaxReform helps #middleclass families directly in three main ways. It lowers tax rates, doubles the child tax credit to $2,000, and doubles the standard deduction to $24,000 per family: https://t.co/xDF2O0zS7j"]["#Jerusalem has always been the capital of Israel. I’ve long supported moving the U.S. embassy there, including voting for the bipartisan Jerusalem Embassy Act in 1995."]["\"Why the GOP Tax Cuts Will be Good for the Middle Class, Good for America and Good for Business\" -- my op-ed in @clevelanddotcom: https://t.co/xDF2O0zS7j #TaxReform #Jobs"]["#TaxReform is about #middleclass tax relief. It's about helping #smallbiz compete. It's about creating more &amp; better #jobs. It's about encouraging investment here in the U.S. https://t.co/VK8WLpigkI"]["Discussed tax negotiations between the Senate &amp; House as well as how #taxreform will boost the #middleclass, #jobs &amp; wages on @SquawkCNBC: https://t.co/JiTKaiKnQj"]["Proud to vote to support Kirstjen Nielsen for Secretary of the Department of Homeland Security. I look forward to working with her on critical issues like terrorism, stopping the flow of drugs into the U.S. &amp; more: https://t.co/WkoJw3f43O #STOPAct"]["#TaxReform will create a pro-growth environment that will help cities like Columbus, #Ohio thrive. That's why the Columbus Partnership supports this bill: https://t.co/QxSbiGla4S"][".@Alvis180 has helped provide support and hope to thousands of individuals who are returning to their communities after having spent time in the criminal justice system. Proud to support them. #Ohio https://t.co/4S7aVi2QKo"]["Proud to recognize the 50th anniversary of @Alvis180 in #Cbus, #Ohio on the Senate floor: https://t.co/izQJVewp2s"]["Proud to have the support of @OhioMerchants for #taxreform bill that will create #jobs &amp; boost wages: https://t.co/1FvqGFeADl"]["Kirstjen Nielsen is needed now to help tackle the many challenges that the DHS faces, including stopping the flow of deadly drugs into our country. #STOPAct https://t.co/WkoJw3f43O"]["Proud to support nomination of Kirstjen Nielsen for the position of Secretary of the Department of Homeland Security:https://t.co/WkoJw3f43O"]["The Senate #taxreform bill will \"provide substantial relief to the vast majority of small businesses in Ohio.\" Thanks @nfib_oh for supporting this bill: https://t.co/z8cMSlZTdM"]["Thanks to @OhioFarmBureau for supporting the Tax Cuts &amp; Jobs Act: https://t.co/9uTUXTMAbi"]["CHIP is a vital program that helps 219,000 #Ohio kids and nine million children nationwide get high-quality health coverage. Congress must vote to #ExtendChip: https://t.co/VWwdhbDzsn"]["By doubling the standard deduction, doubling the child tax credit, and lower tax rates across the board, the Senate #taxreform plan will boost the #middleclass: https://t.co/IXKRhnWAkX"]["#TaxReform will spur economic growth and job creation. Here is how: https://t.co/g4ED1MuHfe"]["Here is my floor speech on how #taxreform will benefit the #middleclass. https://t.co/xP9inHJXEW"]["Here's what #Ohio #SmallBusiness leaders are saying about the Senate #TaxReform bill: https://t.co/82qGNXNRCO"]["The last time Congress enacted comprehensive #taxreform, Pete Rose was still playing for the Reds. With the Senate's vote, we are one step closer to deliver much-needed and long-overdue tax relief to the #middleclass."]["And the #BigTenChampionship belongs to Ohio State!! Two more games to go."]["Looking forward to the #Buckeyes game tonight! https://t.co/hMnSk7D75c"]["Traffickers have moved from the street corner to the smartphone, and they are operating with immunity. #SESTA changes this. Congress must act. https://t.co/5WI2C30mGj"]["The Stop Enabling Sex Traffickers Act is needed to help stop the heinous crime of sex trafficking &amp; get victims the justice they deserve. #SESTA https://t.co/a9wa6ACRkK"]["This is about giving the economy a shot in the arm and helping those who need it the most. #Ohio families &amp; workers will be helped thanks to this #taxreform bill: https://t.co/1W9gkUAEDP"]["Last night's vote was an important step forward in reforming our outdated tax code. The Senate #TaxReform plan will cut taxes on the #middleclass, create more &amp; better #jobs, increase wages, and encourage investment here in America."]["To see what #Ohio #smallbusiness, manufacturers, farmers, &amp; other groups are saying about the Senate #taxreform bill, go here: https://t.co/82qGNY5sum"]["This is once-in-a-generation #taxreform that will improve our economy and expand opportunity for all Americans. I look forward to working with the House to get this done."]["I’m also proud to have worked to preserve the Historic Tax Credit, help families combat unfair taxes on student loans, ease the burden of high medical expenses &amp; more: https://t.co/ZzFFuuDdog"]["I’m proud to have worked to push for #middleclass tax cuts, expand tax relief for #smallbiz, &amp; level the playing field for American companies &amp; workers: https://t.co/ZzFFuuDdog"]["I want to commend the @SenateMajLdr, @OrrinHatch, and all those involved in passing this historic bill through the Senate. #TaxReform #Jobs https://t.co/1W9gkUSfvn"]["The Tax Cuts &amp; Jobs Act gives families freedom to spend more of their money how they see fit, puts faith in American entrepreneurs &amp; businesses to compete in the global market, &amp; creates a fairer tax system that encourages #jobs and investment in the U.S."]["BREAKING: After decades of talk and years of planning, the Senate passed historic reforms that will provide tax relief for #middleclass families, create more #jobs, and increase wages for American workers. #TaxReform"]["The middle-class squeeze is real. Wages are flat but costs are rising. #TaxReform will help #middleclass families keep more of their paychecks https://t.co/rU4WRJCPrx"]["Continuing the discussion on #taxreform on the Senate floor. Working hard to get #middleclass families the tax relief they deserve: https://t.co/NIIQTNPEJF"]["#TaxReform helps the #middleclass by:\n\n1) Doubling the standard deduction\n2) Doubling the child tax credit\n3) Lowering tax rates for middle-class families\n\nhttps://t.co/IXKRhnWAkX"]["We are creating a fairer tax system that encourages #jobs and investment here in this country rather than overseas. #TaxReform https://t.co/pCIcjwHXyA"]["#TaxReform brings back money that's locked out overseas and encourages businesses to stay in America, leading to more #jobs &amp; more investment. https://t.co/sYWZbuyTFj"]["#TaxReform puts faith in the American entrepreneur &amp; #smallbusiness owner to compete in the global market w/o one hand tied behind their back. https://t.co/RIMpREOIBy"]["#TaxReform gives families the freedom to spend more of their own money how they see fit: https://t.co/Rhj9vLUVk0"]["Congress must act to give the #middleclass the kind of economic growth that will give the economy a shot in the arm &amp; allow them to keep more of their paycheck https://t.co/G8NpvtHIfR"]["#TaxReform will lead to significant economic growth. I discussed how on the Senate floor: https://t.co/nxD2kJG7hp"]["The Senate #taxreform plan lowers tax rates across the board for #middleclass families. Nearly $2,400 a year more in the pockets of working #Ohio families. https://t.co/IXKRhnEZtp"]["The Senate #taxreform plan doubles the #ChildTaxCredit. This will help working families afford child care while also helping strengthen middle-class family budgets all across the country. https://t.co/IXKRhnEZtp"]["The Tax Cuts &amp; Jobs Act is a once-in-a-generation opportunity to improve our economy &amp; help the #middleclass. Congress must act. #TaxReform #Jobs https://t.co/xmDsY6qFpJ"]["Good discussion with my friend @OSUPrezDrake on #taxreform &amp; higher education. We are committed to giving more Ohioans the chance to reach their God-given potential. https://t.co/eZZqoBNxrz"]["We are losing #jobs &amp; investment overseas because of our broken tax code. We need a tax code that encourages job creation &amp; investment here in the U.S. https://t.co/5WzMwQpnSV"]["The biggest proportional tax cut goes to the folks who need it the most. #TaxReform #MiddleClass #Jobs https://t.co/SiWzPjDMLx"]["The Senate #TaxReform proposal helps the #middleclass in three main ways. It doubles the standard deduction, doubles the child tax credit, &amp; lowers tax rates across the board. https://t.co/LG5MsnvpMW"]["Last night on the Senate floor, I detailed how the Senate #TaxReform bill will help boost the #middleclass. You can watch the full video here: https://t.co/4bjsQ0Tny9"]["We're making progress on a long overdue #taxreform bill that will boost the middle class, help create #jobs, and raise wages. I discussed on the Senate floor tonight: https://t.co/hSlk6l5tik"]["Senate just took another important step toward pro-growth #taxreform that will help the #middleclass, create more #jobs &amp; increase wages. Looking forward to the full debate #VoteARama"]["Congress has to get #SESTA passed so the president can sign it into law to help protect women &amp; children from the crime of sex trafficking: https://t.co/k7NKUfSJCR"]["It’s a stain on our national character that sex trafficking continues today. On @FoxNews w/ @DanaPerino, I discussed how #SESTA will help https://t.co/0YlWOSzori"]["\"Economic growth will accelerate if the Tax Cuts and Jobs Act passes, leading to more #jobs, higher wages, and a better standard of living for the American people.”  https://t.co/dj5tPdetri #TaxReform"]["In an open letter to Congress today, 137 economists back the Senate #taxreform effort: https://t.co/dj5tPdetri"]["Coming up live on @FoxNews with @DanaPerino. Talking bill to #EndHumanTrafficking (#SESTA), #taxreform &amp; more. https://t.co/bZg9Qg5EMQ"]["We must do a better job of monitoring prescription drugs, getting people the long-term treatment they need, &amp; keeping deadly drugs out of our communities. #STOPAct https://t.co/T0VfZEUrMu"]["Thanks to @CaseWesternRe for hosting a critical conversation on the #opioidcrisis today. Tragically, this epidemic continues to get worse. We must do more. #STOPAct https://t.co/gEb4SXfN1u"]["Congrats to @Maryhaven on the ribbon cutting today for their new stabilization center in @ColumbusGov to combat the #opioidepidemic &amp; save lives. Proud to help secure over $1 million for this facility to support those who need treatment. https://t.co/27GPXjU9xD"]["#TaxReform will generate more #jobs and higher wages because of increased investment &amp; productivity. Congress must get this done. https://t.co/Xntw54IjJU"]["On @FoxBusiness, I discussed the timetable for #taxreform that will create #jobs &amp; help save the typical #Ohio family nearly $2,400 per yr: https://t.co/qaY5yYjEnW"]["Honored to help kick off Ohio Aerospace Day at the @OhioStatehouse with @OhioAerospace and @OhioAeroCouncil.  This event highlights a key industry for #Ohio and I’m proud to fight for these #jobs https://t.co/ubZHzSuLMk"]["On @CNN earlier today, we discussed #taxreform will help us stop losing #jobs and investment overseas. https://t.co/BKX4zndVHI"]["#TaxReform = not just more #jobs but better jobs: https://t.co/1eCzVxH79n"][".@MariaBartiromo &amp; I discussed how #taxreform will result in more economic growth for every working family. https://t.co/7ALfdnwBcp"]["If you’re a median income family in my home state of #Ohio, you will get a tax cut—on average—of about $2,375. https://t.co/WAspiGbF9B"]["On @CBSThisMorning, @CNN, &amp; @FoxBusiness this morning, I discussed how #taxreform will help boost the #middleclass: https://t.co/rNlVcWTWar"]["This morning I joined @CBSThisMorning to discuss how #taxreform will help middle-class Ohioans keep more of their paycheck https://t.co/KPBaOTq9Pf"]["#TaxReform will create #jobs, increase wages and help Ohioans keep more of their paycheck. It is long overdue: https://t.co/p7Nr6eqNxe"]["On @FoxNews, I discussed today's meeting w/ @POTUS and how #taxreform will help the #middleclass: https://t.co/MRIit9nzuL"]["Under the Senate #taxreform plan, a median income #Ohio family will save $2,375 annually on their tax bill. We must get this done: https://t.co/MeGO8yEZCy #jobs"]["Our tax code is long overdue for reform, and it’s critical we get this done to help middle-class families, to help create more #jobs, and to increase wages for American workers. https://t.co/MeGO8yEZCy #TaxReform"]["After meeting w/ @POTUS &amp; several of my Senate Finance Committee colleagues at the White House today, I am confident that the Senate will approve the Tax Cuts &amp; Jobs Act. https://t.co/MeGO8ynoL0"]["Critical that we hold @USACEHQ accountable as we work to protect Lake Erie and our #GreatLakes from Asian carp. Important for fishing, recreation, &amp; local #jobs: https://t.co/dIhOzt8qvT"]["The American people deserve to have the highest standards of ethical conduct by their elected officials: https://t.co/yPRiRz7Tu6"]["On @MeetThePress, I discussed #taxreform and several ongoing congressional ethics issues, including the fact that taxpayers have been wrongly forced to fund harassment settlements involving members of Congress: https://t.co/yPRiRz7Tu6"]["Approximately eight Ohioans a day die from unintentional drug overdoses. We must turn the tide of addiction. https://t.co/RnIudRxSjm #STOPAct"]["#Taxreform will give Ohio families a boost with more #jobs and higher wages and re-open the American economy as the best place in the world to do business https://t.co/uUnULy2q36"]["This week, the Senate is expected to begin considering the Tax Cuts &amp; Jobs Act on the Senate floor. Looking forward to advancing #taxreform to create more #jobs &amp; increase wages."]["Also discussed how #taxreform will help the #middleclass by doubling the standard deduction, doubling the child tax credit &amp; lowering their tax rates #meetthepress #jobs"]["“The American people deserve to have the highest standards of ethical conduct by their elected leaders” #meetthepress"]["Lake Erie is a treasure for #Ohio. We need to protect this precious resource. https://t.co/0EHLZpsf93"]["Looking forward to joining @chucktodd on NBC’s @meetthepress tomorrow to discuss #taxreform, #jobs &amp; more"]["#Smallbusinesses are the backbone of #Ohio’s economy. #Smallbizsat is an opportunity for all of us to rally behind these businesses that employ so many hard-working Ohioans. #jobs"]["Our economy is improving, but too many families are still dealing with the #middleclass squeeze of flat wages &amp; higher expenses. That’s why #taxreform is so important https://t.co/uUnULy2q36 #jobs"]["Last week, after a lot of discussion over a lot of years, the Senate took a major step toward fixing our broken tax code. https://t.co/uUnULyk1rG #taxreform #jobs"]["Tomorrow is #Smallbizsat! Let’s #shopsmall and celebrate the small businesses that are the cornerstone of our #Ohio communities."]["So much to be thankful for today! Let's renew our commitment to helping friends &amp; neighbors in need this holiday season. #Thanksgiving"]["Thinking of our men &amp; women in uniform who can't be home: we all give thanks for their service. #Thanksgiving"]["From my family to yours, I hope you have a very happy #Thanksgiving!"]["There are an estimated 200,000 Ohioans suffering from opioid addiction. We must turn the tide of addiction. https://t.co/S7LSveRPUk #CARA #STOPAct #ohio"]["I take pride in working with my bipartisan colleagues to support Lake Erie and deliver results for #Ohio. My op-ed in @toledonews: https://t.co/0EHLZpJQxD"]["Looking forward to spending tomorrow with plenty of family and plenty of good food! What are your favorite #Thanksgiving traditions?"]["Addiction affects Ohioans regardless of age, area code or economic status. While we have made some progress, we must continue developing better strategies to turn the tide of addiction in our communities. #CARA #STOPAct #opioidcrisis  https://t.co/S7LSveAf2M"]["The Senate #taxreform proposal will create a better economy and a better future: https://t.co/uUnULy2q36 #jobs"]["I want the next generation of Ohioans to fully enjoy and experience the beauty of Lake Erie, and I work every day in Congress to protect the future of our lake. https://t.co/0EHLZpsf93"]["My op-ed on @toledonews: Sea lamprey, other invasive species continue to threaten Great Lakes #GLRI #ohio\nhttps://t.co/0EHLZpsf93"]["Last week, the President signed my TSP Modernization Act into law. The bipartisan measure makes the TSP more responsive to the needs of its participants, and gives federal employees the retirement flexibility they deserve\nhttps://t.co/8B62C0komB"]["Community leaders like those I met at today’s Kiwanis and the Rotary Clubs of Lebanon event will help turn the tide of addiction across #ohio https://t.co/NGUEqgPKYc"]["My op-ed on @WCPO: Senate bill will 'create a better economy and a better future’ #taxreform #jobs https://t.co/uUnULyk1rG"]["I visited the @ColumbusiF earlier this year. It’s a great example of how #Cbus is helping encourage more entrepreneurship &amp; innovation https://t.co/KwclyQI2wH #Jobs #ohio"]["Good @nytimes read on the effort to bring more tech capital &amp; investment to the midwest, including #Ohio, featuring the @ColumbusiF in #Cbus  https://t.co/sCiVKSbCoM #Jobs"]["Great discussion with the Kiwanis and the Rotary Clubs of Lebanon, #ohio about how #taxreform will help everyone in our community through more #jobs, higher wages, and economic growth https://t.co/66QcDaUuDP"]["Thanks to my many colleagues who joined me to press this admin to redesignate #NorthKorea as a state sponsor of terror months ago. https://t.co/aovUjDWIUa"]["Pleased that @POTUS @RealDonaldTrump will relist #NorthKorea as a state sponsor of terror. This dangerous regime must be held accountable.\nhttps://t.co/Bemh89qn5H"]["We’ve made some progress in our efforts to combat the drug crisis in #Ohio, but there is much more to do, including the #STOPAct https://t.co/pv4ErxIgQG"]["My op-ed in the @CantonRepdotcom: “Turning the tide of addiction in #Ohio\" https://t.co/pv4ErxIgQG #STOPAct #CARA"]["The #taxreform bill will also make American companies more competitive so we can create more #jobs and increase wages in the United States rather than sending them overseas. https://t.co/2ZtjSnmkrW"]["Under the Senate #taxreform bill, a median income #Ohio family will save $2,375 annually on their tax bill that they can instead use for gas or groceries, a car payment, retirement, college savings, or a family vacation."]["Congress can help save lives by passing the #STOPAct. You can learn more about this critical bill here: https://t.co/P75QBZ46Hd"]["Every week, I hear stories of Ohioans whose lives were cut short due to drug overdoses. Only a few flakes on fentanyl can be lethal - so we must do everything we can to keep these drugs out of our communities. #STOPAct"]["\"#SESTA would close the egregious loophole and strip the immunity for sites that knowingly facilitate sex trafficking.\" Editorial via @toledonews: https://t.co/HPfb5oXHtn"]["Craft breweries are a booming #smallbiz in #Ohio. The business now supports more than 15,000 OH #jobs. Senate tax plan will help them grow: https://t.co/7FOk4bOj0c"]["Got out in the beautiful marshes of Lake Erie this weekend for a wet duck hunt with friends. https://t.co/sL3WiXn54F"]["I’ve held roundtable discussions across #Ohio to discuss #taxreform and get input and ideas about how best to improve our economy, create more #jobs &amp; help the #middleclass. The Senate will act after #Thanksgiving. https://t.co/4gY6X2I4wC"]["I enjoyed receiving input on how we can make our tax code work better for  #smallbiz, #Ohio workers, &amp; middle class families. OH workers deserve tax relief https://t.co/nZNgoXnj0q"]["#TaxReform is about providing tax relief to the middle class, growing our economy  and creating more #jobs, and increasing wages for American workers. https://t.co/x0QMjMb081"]["In Cleveland this afternoon, I had the opportunity to participate in a forum on #taxreform hosted by @AfpOhio. https://t.co/MotqcMrZt7"]["It is outrageous that we have a tax code that is not working for American workers. #TaxReform #Jobs https://t.co/VDW55HeFaA"]["Right now, in this country, in this century, women &amp; children are being sold &amp; trafficked online. Senate can do something by passing #SESTA: https://t.co/yV8mUOzMU4"]["We must continue to ensure that our armed forces receive the funding they need to carry out their critical national security objectives. https://t.co/EERTty3cYT"]["The #NDAA that is headed to the president's desk includes important funding for #Ohio's men &amp; women in uniform. https://t.co/xSG9s81MIY"]["On @FoxNews today, I discussed the Tax Cuts &amp; Jobs Act &amp; how it will help save the typical #Ohio family $2,375 annually on their tax bill: https://t.co/STXI1adAPD"]["Proud to support the #Ohio workers at the Joint Systems Manufacturing Center in Lima. They build the best tanks in the world: https://t.co/fcnQFMfsP5 #NDAA"]["Proud to stand with #Ohio’s craft brewers &amp; help these entrepreneurs reinvest more in their businesses &amp; our communities. Ohio is number four in the country in craft beer production, and supports 15,000 #jobs. https://t.co/7FOk4bwI8E"]["Particularly pleased that our #taxreform plan includes the Stop Taxing Death and Disability Act, bipartisan legislation to help families after the death of their child and Americans who develop permanent disabilities. https://t.co/2ZtjSnmkrW"]["Last night the Senate Finance Cmte advanced our plan to provide middle class tax relief, create more #jobs &amp; boost wages for #Ohio workers. https://t.co/2ZtjSnmkrW"]["Here is my full statement on the Senate Finance Committee passing our #taxreform bill, which will improve our economy, grow #jobs &amp; provide higher wages https://t.co/2ZtjSnmkrW"]["Under our #taxreform plan, a median income #Ohio family will save $2,375 annually on their tax bill that they can instead use for gas or groceries, a car payment, retirement, college savings, or a family vacation. https://t.co/2ZtjSnmkrW"]["Tonight’s Senate Finance Committee approval of the Tax Cuts &amp; Jobs Act marks an important step forward in our effort to provide tax relief to the middle class, grow our economy and create more #jobs, and increase wages for American workers. https://t.co/2ZtjSnmkrW #taxreform"]["Pleased to lead effort to provide security assistance, including lethal and non-lethal equipment, training, and technical assistance to #Ukraine. US must stand w/ our Ukrainian friends: https://t.co/oiNfF51shU"]["Critical that we double down on our efforts to counter foreign propaganda &amp; disinformation from countries like #Russia &amp; #China. We are making progress but must do more: https://t.co/1afR1g9LcU"]["#Ohio is home to some of the best &amp; brightest serving our country &amp; is home to some of our nation’s premier defense installations. The #NDAA will help Ohio's men &amp; women in uniform: https://t.co/xSG9s81MIY"]["Proud to help secure important wins for the @180thFW in Toledo, @WrightPattAFB in Dayton, &amp; the Joint Systems Manufacturing Center in Lima in the #NDAA Conference Report. https://t.co/xSG9s81MIY"]["@SpeakerRyan @RepKevinBrady @PatTiberi It is now time for the Senate to act, and act quickly. #TaxReform is long overdue. It will help create better and more #jobs, boost wages, and help the middle class keep more of their paycheck."]["Congrats to @SpeakerRyan, @RepKevinBrady, @PatTiberi &amp; the House of Representatives for passing meaningful tax relief for the middle class. #TaxReform #Jobs"]["On @BloombergTV, as the Senate Finance Cmte continues to consider the Tax Cuts &amp; Jobs Act, I discussed why the Senate must act. #Jobs https://t.co/1kMvOZmOoG"]["ICYMI: @toledonews editorial on why Congress must pass #SESTA. https://t.co/HPfb5pfiRX #EndHumanTrafficking"]["Important day at Finance Cmte discussing #taxreform. We're making good progress - will help the #middleclass, boost wages, &amp; create #jobs: https://t.co/2WydQYzQR6"]["Pleased that the bipartisan Stop Taxing Death and Disability Act has been included in the Senate #taxreform bill. Another reason why the Senate must get this done: https://t.co/JDdtYFpidU"]["Pleased to see the @NFIB supports the Senate #taxreform plan because it helps #smallbiz &amp; will help create #jobs: https://t.co/et1CHNrDEc"]["The updates to our Senate #taxreform plan strengthen the tax relief for #middleclass families, which is critically important. More info on our plan here: https://t.co/tdjtgkwz8h"]["It's time to get #taxreform through committee and to the floor so we can debate it and deliver results for the people we represent. #Jobs https://t.co/YKK07cuVpe"]["Too many Ohioans haven't seen their wages go up in decades. #TaxReform will help boost wages &amp; allow people to keep more of their paycheck. https://t.co/PWKG5L6Wc8"]["#TaxReform will help the typical #Ohio family save nearly $2,400 annually on their tax bill. Congress needs to get this done. #Jobs https://t.co/FxtQ4apCmc"]["Congress must pass #SESTA to help stop this heinous crime. It is time for Senate to act. https://t.co/HPfb5pfiRX #SESTA #EndHumanTrafficking"]["\"The full Senate should quickly move to pass [#SESTA], which would allow victims to get justice and would give law enforcement a valuable tool in reining in the trafficking of children and young women on the Internet.\" https://t.co/HPfb5oXHtn @toledonews #EndHumanTrafficking"]["\"Senate Needs to Pass the Stop Enabling Sex Traffickers Act\" Editorial via @toledonews: https://t.co/HPfb5pfiRX #SESTA #EndHumanTrafficking"]["$2,375 → that's how much of a tax cut the typical #Ohio family will receive under the Tax Cuts &amp; Jobs Act. https://t.co/lrz6Andy2e"]["#TaxReform will help middle class Ohioans keep more of their paychecks &amp; increase wages. Congress should work together to get this done. https://t.co/QwNw7kV8lR"]["The Finance Cmte has begun its work to pass #taxreform. Our plan will save the typical #Ohio family $2,375 annually on their tax bill. #Jobs https://t.co/6fKmtNcXRs"]["We need to get #taxreform done now to help #Ohio families keep more of their paycheck. https://t.co/YOJplft29j"]["That’s $2,375 for #Ohio families to use more of their own money for groceries, gas, a car payment, retirement and college costs, a family vacation, or whatever they choose. https://t.co/lrz6AmVXaG"]["#Ohio families will save on average $2,375 annually under the Senate #taxreform plan: https://t.co/lrz6AmVXaG"]["An independent #Ukraine is critical not just to Eastern Europe, but it also impacts broader U.S. interests in the region and beyond. It is time to supply lethal defensive aid: https://t.co/iHyPzNTiB6 @weeklystandard"]["On @FoxNews, I discussed how the Tax Cuts &amp; Jobs Act will help create #jobs, raise wages, &amp; boost the middle class. #TaxReform https://t.co/sBVKuqc7ns"]["We’ve listened to the American people. Now it’s time to deliver on our promise to reform this broken tax code. #TaxReform #Jobs https://t.co/4hIFpmXwIV"]["It's outrageous that we have a tax code that isn't working for #Ohio workers. The new Senate plan changes that. #TaxReform #Jobs https://t.co/8CPLxAIxul"]["Last night I was honored to receive the Panetta Institute's bipartisan Jefferson-Lincoln award. Doing the hard work to find common ground isn’t easy, but it isn’t supposed to be. I'll continue reaching across the aisle to find solutions that help Ohioans. https://t.co/iDvW9jLyZ7"]["Pleased that @DHSgov Secretary Nominee supports the #STOPAct. Critical to keeping fentanyl and carfentanil off our streets: https://t.co/BPveCqHwub"]["There are serious issues facing our country: the #opioidcrisis, a tax code that doesn't work for American workers, a scourge of sex trafficking, &amp; threats from #NorthKorea, #Iran, #Russia &amp; others. We must work together to address these issues."]["Americans want results, not partisan bickering. In this highly charged political environment, it is more critical than ever that we in Congress find common ground so that we can successfully address the serious issues we face as a country."]["Humbled to receive 3 awards this week: the Panetta Institute’s Jefferson-Lincoln Award for Public Policy, the Jacob K. Javits Prize for Bipartisan Leadership, &amp; the Fetal Alcohol Syndrome (NOFAS) Leadership Award. Encourages me to redouble efforts to achieve results."]["#SESTA is bipartisan, and widely supported by law enforcement, anti-human trafficking advocates, tech groups &amp; more. Senate should act now https://t.co/FN9oulyfYU"]["Human trafficking is a stain on our national character. Now that #SESTA has passed in committee, Senate must act quickly to pass this bipartisan legislation &amp; the House must act as well. https://t.co/16krjdVDPJ"]["#SESTA holds traffickers accountable. https://t.co/lqBdtwv1T8"]["Sex trafficking has moved from street corner to smartphone, &amp; online sex trafficking has predominately occurred thru one website: #Backpage https://t.co/wqZbEefbhq"]["#TaxReform will do three things. First, it will help address the #middleclass squeeze. Second, it will make American companies more competitive, meaning more &amp; better #jobs &amp; wages. Third, it will level the global playing field and allow us to bring back money from overseas."]["For too long, #Ohio workers have had to compete with one arm tied behind their back. The Senate tax plan is good news because it provides a more level playing field for our workers. #Jobs. #TaxReform"]["This week on the Senate floor, I delivered two speeches on #taxreform. You can watch them here: https://t.co/w78OTbs1Ec. And here: https://t.co/nGF79gpgLP #Jobs"]["ICYMI: My Senate floor speech from yesterday on how #taxreform will boost the middle class, create more &amp; better #jobs, and boost wages: https://t.co/cIkqi8zmv6"]["It’s crazy that we have a tax code that encourages companies to send #jobs and investment overseas, and it’s outrageous that Congress has allowed this to happen. We need #taxreform now."]["Since I came to the Senate in 2011, we've had 70 hearings on #taxreform in the Finance Committee. Looking forward to the open process in committee next week of our new Senate tax reform bill. #Jobs"]["Important op-ed in @Newsday: \"Get opioids out of the U.S. mail.\" #STOPAct is needed now to keep these dangerous synthetic drugs out of our country: https://t.co/m2V4oQ4EMk"]["Happy 242nd birthday to the few, the proud, the United States Marines!  #SemperFi"]["On this day, I think about my father and grandfather, both of whom were Army infantry officers, and give thanks to them and all our Veterans."]["Our veterans made sacrifices to protect the freedoms we enjoy here at home. Jane and I are forever grateful for their service. #VeteransDay"]["Senate must act on #TaxReform ASAP. It is long overdue. https://t.co/l5gvPs2L1P #Jobs"]["Our plan is focused on middle class tax relief, making American companies more competitive (more #jobs), and leveling the playing field. https://t.co/alXjASVbcZ"]["I’m excited about the opportunity to provide tax relief to #middleclass, create more #jobs, &amp; increase wages for American workers.#TaxReform https://t.co/7EYGm0S6fY"]["#TaxReform is the single most important thing we can do to grow our economy. #Jobs https://t.co/BSzSLWNHKD"]["ICYMI: my op-ed in the @Enquirer lays out how #taxreform can raise wages:  https://t.co/MZVhVEG1Ta #Jobs"]["Congress can help make American workers more competitive &amp; boost their wages by acting on #taxreform. It is time to get this done. https://t.co/2wUWl7rQKk"]["On @BloombergTV this morning, I discussed how the Senate tax bill will boost the #middleclass &amp; help create #jobs. #TaxReform https://t.co/YJLp9490Py"]["Good discussion with @IvankaTrump today on #SESTA, #TaxReform &amp; more. Appreciate her work to #EndHumanTrafficking &amp; her leadership on the child tax credit. https://t.co/2IOrllzUhO"]["It’s time for Washington to listen to the American people and fix our broken tax code: https://t.co/MZVhVEG1Ta #TaxReform #Jobs"]["We have a chance to enact once-in-a-generation #taxreform that will re-open the American economy as the best place in the world to do business, create more #jobs &amp; better wages for our workers, &amp; give #middleclass Ohioans more money in their pockets: https://t.co/MZVhVEXCKI"]["My op-ed in the @Enquirer: \"Tax Reform Can Raise Wages\" https://t.co/MZVhVEG1Ta #TaxReform #Jobs"]["#TaxReform will help give our economy a shot in the arm. I discussed the details on @FoxNews yesterday: https://t.co/ky52AAiHIL"]["It is outrageous that in this country, in this century, women &amp; children are being sold online for sex. Time is now for Senate to act.#SESTA https://t.co/jLCLd2TfvE"]["A reminder of why #SESTA is needed, and needed now: https://t.co/wSLXy8mzRr"]["Kirstjen Nielsen's work ethic, her experience, &amp; her leadership is needed now: https://t.co/5Zlt2vyv0Z"]["Honored to introduce @DHSgov Secretary Nominee Kirstjen Nielsen at the Homeland Security Committee hearing today. https://t.co/VcITTwwHZe"]["BREAKING: #SESTA has unanimously passed the Senate Commerce Committee &amp; is now headed to the Senate floor! #EndHumanTrafficking #CDA230"]["I'll continue working in a bipartisan manner to deliver results &amp; get meaningful legislation passed for ppl of #Ohio:https://t.co/EhHeBdJQUo https://t.co/ZS0r4mdmKy"]["In this highly charged political environment, it is critical that we in Congress work to find common ground:https://t.co/EhHeBdJQUo"]["Humbled to receive the Jacob Javits award for bipartisan leadership today: https://t.co/EhHeBdJQUo https://t.co/VkLE9kn7XW"]["#TaxReform is an opportunity to help Americans who need relief as they face the #middleclass squeeze: https://t.co/Zuv0ZERMN0 #Jobs"]["#TaxReform is about helping the #middleclass, creating #jobs, &amp; boosting wages. My floor speech: https://t.co/w78OTbaqME"]["My office held a workshop in @UrbanaOhio to help community get access to #CARA funding today. https://t.co/FpZdEji5MV #opioidcrisis https://t.co/WmCYFzcyf2"]["Congress has made important progress in tackling the #opioidcrisis but more must be done. #STOPAct is needed: https://t.co/foOS8FhFV6"]["Cases of sex trafficking skyrocketed w/ the growth of the internet. Law enforcement agrees that #SESTA will help them to stop this crime. https://t.co/fZL2HK5vrY"]["#SESTA now has 41 bipartisan cosponsors in the Senate. I urge all of my colleagues to support this bill to #EndHumanTrafficking."]["All around #Ohio, I hear from workers who want a tax code that works for them. It is time for Congress to deliver. #TaxReform #Jobs https://t.co/7HiWuNkZ5B"]["Wages are flat and expenses are up. We need #taxreform now to help put more money in the pockets of #Ohio families &amp; workers. #Jobs https://t.co/WPd0zZzbHq"]["Every woman or child that is sold online for sex is one too many. Senate must pass #SESTA ASAP to help #EndHumanTrafficking. https://t.co/BEyGCVJ7is"]["Senate is 1 step closer towards holding online traffickers accountable &amp; getting victims justice they deserve:https://t.co/dK32TPENgW #SESTA"]["Jane &amp; I are devastated by the news out of Sutherland Springs, Texas. We send our prayers to that community &amp; first responders at the scene"]["Congress must redouble efforts to counter Russian disinformation &amp; propaganda. https://t.co/1355wEGkrc"]["Reminder of why Senate must act on #SESTA. #CDA230 https://t.co/ftebDhfJYq"]["Proud to work w/ @SenWhitehouse, @SenatorShaheen &amp; others to help roll back the tide of addiction in the U.S. https://t.co/abNjKQKRUR"]["The #opioidcrisis is devastating #Ohio and communities in every state. The problem requires bipartisan solutions: https://t.co/p48Oaq0YRI"]["It is hard to believe, but all over #Ohio, women &amp; children are being trafficked online. Congress must act to stop this crime.#SESTA #CDA230 https://t.co/AtepiTBwwm"]["I'm working to put good ideas I've heard into action. #Taxreform is long overdue. Please share your thoughts w me on how to make plan better"]["On the Senate Finance Committee, we've held 70 hearings on #taxreform over last 5 years. I've also held tax reform roundtables across #Ohio https://t.co/07Chh3JL71"]["Congress is making progress on #taxreform. This weekend, I'm reviewing details of House plan. You can read more here:https://t.co/B7TlNNrGSX"]["Took questions on #taxreform, #CHIP, environment &amp; more during this week's Facebook Live. You can watch it here: https://t.co/K4R8fn6YRv"]["#SESTA has now achieved a broad consensus that will help get it over the finish line to help #EndHumanTrafficking:https://t.co/dK32TPENgW"]["#SESTA will hold online sex traffickers accountable and help give trafficking survivors the justice they deserve: https://t.co/dK32TPENgW"]["Pleased to welcome additional tech industry support for #SESTA. @InternetAssn now supports the bill: https://t.co/dK32TPENgW"]["Thanks to leaders in the recovery community in Youngstown, #Ohio for holding an educational forum on the #opioidcrisis today. #STOPAct #CARA https://t.co/u1ykNu9VBY"]["Will be discussing the #opioidcrisis w/ @SenatorShaheen &amp; my #CARA co-author @SenWhitehouse. Live at 3pm: https://t.co/Ii0gtn177d"]["We have a significant opportunity before us, and I’m optimistic we can get #taxreform done soon: https://t.co/nqTf7vc1yP #Jobs"]["Time to deliver results by reducing tax burden on #middleclass, helping American biz grow, &amp; creating better #jobs &amp; wages for our workers."]["I commend @SpeakerRyan &amp; @RepKevinBrady for their hard work in the House. #TaxReform = more #Jobs + better wages: https://t.co/nqTf7vc1yP"]["For years, Americans have called on Congress to fix broken tax code. Today was a big step forward: https://t.co/nqTf7vc1yP #TaxReform #Jobs"]["Looking forward to another Facebook Live Q&amp;A tomorrow at 5:00pm. You can start submitting your q's here: https://t.co/dbOyhxfvdl https://t.co/tSC61UyLeQ"]["It is especially imp't that Senate move on #STOPAct to stop flow of fentanyl into our states. Will help save lives: https://t.co/t1QXICLtZd https://t.co/OJFVRqxVcR"]["@realDonaldTrump I am hopeful that Congress will act w/ urgency on these recommendations: https://t.co/t1QXICLtZd"]["@realDonaldTrump Pleased the commission endorsed the bipartisan #STOPAct &amp; Prescription Drug Monitoring Act. More info on bills here:https://t.co/t1QXICLtZd"]["I commend @realDonaldTrump's opioid commission for putting forward a serious &amp; detailed set of recommendations to help address #opioidcrisis"]["Foreign propaganda and disinformation is an urgent national security threat. Our nation must do more to combat it. https://t.co/SluW2XslAh"]["People are being radicalized in this country. We need to redouble our efforts to reach those most vulnerable to terror propaganda. https://t.co/MHF99CjCIy"]["Imp't that @StateDept use every resource available to counter propaganda &amp; disinfo from countries like #Russia &amp; terror groups like #ISIS https://t.co/EqjvhP9UK4"]["Tax reform is a win-win for American workers – it will create more &amp; better #jobs, increase wages &amp; boost the #middleclass. https://t.co/jZWYwkKrh2"]["On @BloombergTV this morning, I discussed how pro-growth #taxreform will give our economy a shot in the arm. #Jobs https://t.co/jRFPGgoQrV"]["Thanks Summit County Councilmembers for supporting #SESTA. Important we all work together to #endhumantrafficking:https://t.co/QEdaBmRmpL"]["Jane and I are praying for all those impacted by the terrorist attack in NYC. Thankful for the first responders on the scene immediately."]["#AUMF should empower our troops, not constrain them. US must be able to adapt to evolving terrorist threat https://t.co/hDhxdXWjgZ"]["In addition to fighting ISIS, the United States must have strategy for what comes next in #Iraq and #Syria. https://t.co/GKS6wMjyMA"]["Thank you to Secretary Mattis &amp; Secretary Tillerson for speaking w/ us yesterday on the #AUMF: https://t.co/UcysXIjAn0"]["#SESTA is widely supported because it narrowly amends #CDA230 to help protect women &amp; children from being sold online. #EndHumanTrafficking https://t.co/oPuQ5iCsYy"]["A law written in 1996 makes it easy for traffickers to sell women &amp; children online w/ impunity. #SESTA changes that. #EndHumanTrafficking https://t.co/DZAhH4iJ58"]["Wages are flat and expenses are up. We need to put more money in the pockets of #Ohio &amp; American workers. #TaxReform #Jobs https://t.co/ONgf1YFYco"]["In #taxreform roundtables across #Ohio, I've heard about business that can't hire more bc expenses are too high. Tax reform will help. #Jobs https://t.co/OSN7vvZ8za"]["The current tax code is hopelessly broken. Right now, our tax code is encouraging #jobs &amp; investment to go overseas. We need #taxreform now. https://t.co/Isf8V8DyXz"]["#TaxReform is needed now. Discussed how it will help create more &amp; better #jobs, increase wages, &amp; boost the middle class on @FoxNews: https://t.co/9IWm4ztUx7"]["ICYMI: my interview on @MeetThePress yesterday with @ChuckTodd on #TaxReform, #Jobs, #Russia &amp; more: https://t.co/xMdTbalONd"]["#SESTA will hold accountable companies like #Backpage that knowingly facilitate trafficking of women &amp; children online. #EndHumanTrafficking https://t.co/nYWn1iG1mB"]["The bipartisan Stop Enabling Sex Traffickers Act is the result of a 2 year investigation into #Backpage: https://t.co/636xppPUT0 #SESTA"]["#NorthKorea should be re-designated as a state sponsor of terror. I am urging @StateDept to act: https://t.co/R7Iqcft0Cz"]["How will #SESTA help #endhumantrafficking? Check out my latest op-ed in @WIRED:  https://t.co/RRX46p5CeM"]["Fentanyl is now killing more Ohioans than heroin. And it's coming in from overseas. #STOPAct will help keep drugs out &amp; save lives."]["If you're an #Ohio student looking to intern on Capitol Hill this Spring, we're now accepting applications! https://t.co/Cz8e6XapQY"]["Congress should get #taxreform done ASAP to help create more &amp; better #jobs, boost middle class, &amp; increase wages. It should be bipartisan https://t.co/siBTBG5eK4"]["It is outrageous that workers in this country have to compete on the global market w/ one arm tied behind their back bc of a broken tax code https://t.co/GXLDsYdROf"]["All over #Ohio, I hear from workers who are frustrated that they are operating under a tax code that is doing more to hurt than help. #Jobs https://t.co/lEX5DxmRtp"]["Will be on @MeetThePress this morning! Looking forward to discussing #taxreform, #jobs, &amp; more."]["OSU comes back! The lesson: never ever give up! GO BUCKS https://t.co/rlvjqLB50M"]["Nothing better than a big conference game at The Shoe! Hoping for a big second half. #GoBucks #BeatPennState https://t.co/XOvK4vIU4s"]["Senate must act on #SESTA ASAP so traffickers can be brought to justice. #EndHumanTrafficking https://t.co/Xwe4dwBrLl"]["Proud to support @RooseveltCoffee &amp; their mission to #endhumantrafficking - so important to have people fighting this crime at local level https://t.co/0xuLomi406"]["Good to meet w/ the folks at @RooseveltCoffee who are working every day to make their community a better place. #EndHumanTrafficking https://t.co/TMegsTkIW4"]["Brought lunch to my service academy review board today from @freedomalacart. Proud to recognize @rbuergel w/ flag honoring his retirement https://t.co/L0v22AB9Kv"]["Fighting #opioidcrisis in #Ohio must be a community effort. Please encourage others to go here for #DrugTakeBackDay:https://t.co/aMAl1sxKzr"]["Pleased that so many #Ohio communities are participating in #DrugTakeBackDay. You can see a list of locations here:https://t.co/aMAl1sg9HT"]["4/5 ppl addicted to opioids start out on prescription drugs. Important that we safely dispose of unnecessary prescription meds.#DrugTakeBack"]["It's outrageous that women &amp; children are being sold online in this country, in this century. #SESTA is needed to help #endhumantrafficking https://t.co/gxZKccEWSi"]["I am urging @TheJusticeDept to reverse cuts to critical halfway houses &amp; other programs that reduce recidivism: https://t.co/HhITNlcCQX"]["Must read from @USATODAY: \"Opioid crisis has a new leading killer: fentanyl\" https://t.co/zTQEGtItof #STOPAct"]["Thanks to @JMS_Jaguars for coming to see me in DC today! #jmsdc17 https://t.co/yfQtsrfK5D"]["Because of this #opioidcrisis, far too many kids are born to addicted parents. Thank you to the Swafford family &amp; others who are helping https://t.co/19dUI6wiXV"]["#NorthKorea should be designated a state sponsor of terror. US must continue to exert peaceful pressure on NK regime.https://t.co/R7Iqcft0Cz"]["I am urging @StateDept to list #NorthKorea as a state sponsor of terrorism. Deadline for decision on Nov 1: https://t.co/R7Iqcft0Cz"]["Also got to see Stephen Loomis, President of the Cleveland Police Patrolmen's Association. Thankful for his work combating addiction in OH https://t.co/PXs43i4Yzl"]["Good to see Olmstead Twp PD Chief Matthew Vanyo at POTUS' speech. He is working tirelessly in his community to fight the #opioidepidemic. https://t.co/r2DC4hREV8"]["We must act w/ a greater sense of urgency on the part of the admin, this Congress, &amp; key stakeholders to turn the tide of addiction"]["The American people deserve a comprehensive plan to help turn the tide of addiction: https://t.co/DiRdrZMGC0 #opioidepidemic"]["There are steps Congress can take now to help fight back against the #opioidepidemic, like passing the #STOPAct: https://t.co/DiRdrZMGC0"]["Appreciated @POTUS' speech today on the #opioidcrisis &amp; his decision to declare it a public health emergency. Positive step forward."]["There is no doubt that this heroin and prescription drug epidemic is a national crisis, and it’s getting worse. https://t.co/DiRdrZMGC0"]["Human trafficking is a stain on our national character. But there is something Congress can do abt it. #SESTA will help #endhumantrafficking https://t.co/KYZA4D0vMk"]["Right now, a federal law from 1996 is protecting sex traffickers. #SESTA will update that law for the 21st century: https://t.co/Xwe4dwT2CT"]["In my recent #Ohio Auto Tour, I met w/ auto workers who are competing w/  one arm tied behind their back. #TaxReform will help these workers https://t.co/85QQdoqgD8"]["We have #jobs and investment leaving this country in large part due to our broken tax code. Congress must act. #TaxReform https://t.co/DoaGCZefwZ"]["We should all be for creating more &amp; better #jobs, increasing wages, and boosting the middle class. #TaxReform should be bipartisan. https://t.co/WKeZQIBWKi"]["Every day Congress doesn't act, hundreds of American are dying from overdose. We must get the #STOPAct passes ASAP to help save lives."]["Good discussion w/ @IvankaTrump on the urgent need to #EndHumanTrafficking today. #SESTA is needed to help bring traffickers to justice. https://t.co/WneklwQACs"]["It's crazy that we he have a tax code that is not serving the American worker. It is passed time we do something about it. #TaxReform #Jobs https://t.co/cNlZVM88j2"]["#TaxReform should not be a partisan issue. There’s no question it will increase economic growth which will raise revenue. #Jobs https://t.co/UHWV3WeJ82"]["Companies are leaving the United States and taking #jobs &amp; investment w/ them. #TaxReform will help bring money back to the U.S. https://t.co/MxeB5e7vbH"]["#TaxReform will increase wages, create more #jobs, &amp; help the middle class who for too long have dealt w/ flat wages &amp; higher expenses. https://t.co/KVxzmEu3Ce"]["Voted to provide more resources to Hurricane victims in #PuertoRico, TX &amp; FL &amp; wildfire victims in CA.  Impt we get them the help they need"]["#Ohio workers I meet w/ across our state want more investment &amp; #jobs in America. #TaxReform will deliver: https://t.co/UAWTo9MmXX"]["Congress must act quickly on #TaxReform. Our broken tax code hasn’t been reformed in 31 years. #Jobs https://t.co/sGFvqWfgGf"]["Also discussed #taxreform meeting w/ POTUS &amp; my hope that Congress can work together on a bipartisan basis: #Jobs https://t.co/q0T0Gtc6QQ"]["On @FoxNews, discussed how #taxreform will help create more &amp; better #jobs, increase wages, and boost the middle class: https://t.co/4T83hyvXln"]["I’m hopeful that more in the tech community will partner w/ us to hold online sex traffickers accountable: https://t.co/Xwe4dwBrLl #SESTA"]["It is time to bring the 21 y/o Communications Decency Act into the 21st century. https://t.co/Xwe4dwBrLl #SESTA #EndHumanTrafficking #CDA230"]["Right now, a federal law is protecting online sex traffickers. #SESTA will change that. My op-ed via @WIRED: https://t.co/Xwe4dwBrLl #CDA230"]["Coming up live on @HappeningNow with @JonScottFNC. Discussing #taxreform &amp; the president's visit to Capitol Hill. #Jobs https://t.co/D7xPosOZ5a"]["Now is not the time to scale back our nation’s commitment to restore the #GreatLakes environment and economy: https://t.co/8HwEq6F9ai"]["Joined @SenStabenow to call on admin to support the #GreatLakes Restoration Initiative. Critical for Lake Erie: https://t.co/8HwEq6F9ai"]["Pleased #CARA is being implemented to help turn the tide of addiction. More must be done. https://t.co/AbdYQ0dQKD #STOPAct"]["New #CARA grant money headed to Franklin County, #Ohio - will help those on the frontlines combat the #opioidcrisis: https://t.co/AbdYQ0dQKD"]["Got to see an impressive demonstration of improvements being made to telemedicine which is helping to improve access to primary medical care https://t.co/qBwoyxiPrN"]["Congress must help #smallbiz in Cleveland &amp; around #Ohio &amp; the US by passing #taxreform. Have to get this done https://t.co/m1bvdLk45Q"][".@COSEsmallbiz knows #taxreform will help #smallbiz in Cleveland grow and create more #jobs and better wages. https://t.co/j57DQJ8ioa"]["Another productive #taxreform roundtable with #Ohio business leaders. Thanks to @COSEsmallbiz for hosting the conversation. #Jobs https://t.co/bkeWRCA3xz"]["Big game for the Bengals to get back in the hunt for the AFC North. I’ll be watching  AJ Green! #WhoDey"]["All over the state I’ve heard how #taxreform is needed. Congress is finally taking steps towards getting this done. https://t.co/o871lmMQdA"]["#TaxReform means more opportunity, more and better #jobs, and better wages. This should be a bipartisan effort. https://t.co/c2ZL0RUmJp"]["Trillions of $ are currently locked out overseas for 1 reason: our broken tax code. #TaxReform will bring #jobs &amp; investment back to the US https://t.co/gN8wJJkOop"]["#SESTA is a commonsense solution to a growing problem that must be addressed. Victims of trafficking deserve justice. #EndHumanTrafficking https://t.co/ukpceLIJTC"][".@NatUrbanLeague is latest group to endorse #SESTA. I encourage everyone to back this bill &amp; urge Congress to act. https://t.co/CG2rwVzJnf"]["Law enforcement, faith leaders, and--most importantly--victims of #humantrafficking all support #SESTA b/c it will help end this crime. https://t.co/OiJwTu2wMg"]["Powerful testimony from Yvonne Ambrose shows why #SESTA is needed: https://t.co/q4kuH3uQ06"]["#TaxReform will lead to more opportunity for #Ohio workers, create #jobs, and boost wages. https://t.co/xqbctNRtIT"]["The Senate passed budget paves the way for once-in-a-generation #taxreform. Senate must act soon. #Jobs https://t.co/uY9s71AEqb"]["Important that we continue to do all we can to help in #PuertoRico. Proud that our @OHNationalGuard is helping: https://t.co/hkwaYMzlT8"]["Senate needs to get moving on the bipartisan #STOPAct. Fentanyl is killing Ohioans &amp; this bill will help stop it:https://t.co/5ZVNHRREii"]["Happy to support @ChickenTakeover and provide lunch to my service academy review board screening candidates today https://t.co/BEyc83U4X4"]["Senate took important step this week towards getting #taxreform done. We have to get this done for #Ohio’s workers. https://t.co/rhGL869bQ9"]["Our auto workers deserve a tax code that works for them. That's why I am fighting for #taxreform to create #jobs &amp; boost wages https://t.co/ESOhQKDnP8"][".@uofcincy continues to produce leaders in all sectors of life. I look forward to seeing the progress UC &amp; @Prez_Pinto continue to make. https://t.co/4GxwxakrKl"]["The University of Cincinnati is in good hands! Proud to take part in the inauguration of @Prez_Pinto as the 30th @uofcincy president. https://t.co/2JYC266QCT"]["How does this comprehensive #taxreform help the middle class? Watch below: https://t.co/4damAw4w09"]["#TaxReform should be bipartisan. It has been in the past and it is my hope that it can be again. We need to get this done. #Jobs https://t.co/egFbLlM5MS"]["The Senate passed budget provides a once-in-a-generation opportunity to reform our broken tax code: https://t.co/yyGAxfM4yq #TaxReform #Jobs"]["Congress must act with urgency to fix our broken tax code &amp; give our economy a shot in the arm. Will help #Ohio auto workers. #Jobs https://t.co/BBHoTK5L44"]["Great work by @TheJusticeDept &amp; @FBI to help save children from sex trafficking. We must do more by passing #SESTA. https://t.co/LlxrEUQkFl"]["The horrific crime of sex trafficking disproportionately impacts African Americans. Proud to have @NatUrbanLeague’s support for #SESTA. https://t.co/Xwz6xxftXz"][".@NatUrbanLeague joins anti-trafficking advocates, law enforcement and members of the faith community in urging Senate to act on #SESTA. https://t.co/LwvI73ji7l"]["Proud to have the support of @NatUrbanLeague for bipartisan Stop Enabling Sex Traffickers Act. Their letter:https://t.co/KnVPlg4SsS #SESTA"]["Unfortunately, our auto workers are fighting w/ one arm tied behind their back because we have an outdated &amp; burdensome tax code.#taxreform https://t.co/ECS8nPuXNU"]["This is an imp't step towards improving early hearing detection - will help children w hearing loss keep up w/ peers:https://t.co/m6gy2A31CO"]["Thank you @POTUS for signing my bill w/ @timkaine to promote early hearing detection in newborns &amp; infants: https://t.co/m6gy2zLqee"]["United States must continue to fight back against foreign competitors who are attempting to cheat our trade system:https://t.co/P3uRHXLfEg"]["I urge the ITC to will provide broad relief for the @WhirlpoolCorp workers in #Ohio &amp; US washing machine industry: https://t.co/P3uRHXLfEg"]["Imp't that ITC ensure that workers &amp; manufacturers in #Ohio have an opportunity to compete on level playing field:https://t.co/P3uRHXtEfG"]["#Ohio has the best auto workers in the world. I got to see that firsthand on my Ohio Auto Manufacturing #Jobs Tour last week: https://t.co/69vaC70lH2"]["Another story highlighting need to #endhumantrafficking. #SESTA will help deliver justice for trafficking survivors. https://t.co/NYvCsb0A5E"]["Proud to call @PatTiberi a close friend.His commitment to service &amp; ability to deliver results for OH will be missed:https://t.co/9vfJEsU8aN"]["Good discussion on the #opioidcrisis w/ @SenatorHassan &amp; @Sen_JoeManchin today. Congress must work together on this: https://t.co/8dwD2NE3vb"]["Our #taxreform framework will help create more #jobs, increase wages, &amp; encourage more investment in America: https://t.co/hNoptFns5f"]["We all agreed #taxreform should focus on helping middle-class families, and that’s what our plan does. https://t.co/hNoptFns5f #Jobs"]["Productive meeting at the WH today on #taxreform. Pleased that POTUS is engaging both Rs &amp; Ds: https://t.co/hNoptFns5f #Jobs"]["Thank you @GLFOP for your work to protect children from online sex trafficking &amp; your support for #SESTA https://t.co/YmImoj3Cj0"]["Thank you NCMEC (@MissingKids) for your support of #SESTA &amp; all you do to support trafficking survivors. https://t.co/JB5pgYT7FH"]["Thx to all those who came to my #Buckeye coffee this morning to discuss what's important to them. Good discussion on #taxreform, PR &amp; more https://t.co/44Qj4xkBxR"]["Discussing the #opioidcrisis with @SenatorHassan &amp; @Sen_JoeManchin. Watch live here: https://t.co/ybw6EdTxYi"]["More must be done to stop these drugs coming in from countries like #China. #STOPAct will help: https://t.co/Pf1ieiPcEI #OpioidCrisis"]["Good news: @TheJusticeDept taking action to hold traffickers in #China who ship deadly drugs into the US accountable:https://t.co/Pf1ieiPcEI"]["The #STOPAct will help keep deadly drugs off our streets. Law enforcement supports this bill. Senate must act on it. #opioidcrisis https://t.co/uDMJyuMegJ"]["#OpioidCrisis is a complex problem that requires a comprehensive solution. The #STOPAct will help turn the tide: https://t.co/UZvAyASkyM"]["Heroin, and now fentanyl, has devastated far too many families in #Ohio. Why we need the #STOPAct: https://t.co/eheG4XKUJ3"]["From 2010-2015, #humantrafficking in the United States is said to have increased 846%. Congress has a duty to act. #SESTA https://t.co/WX7DyR9OmK"]["#TaxReform is focused on #jobs and wages. It is needed to let our economy reach its full potential: https://t.co/EH0CXhsFDw"]["Got good feedback from #smallbusiness owners yesterday about how #taxreform will help them grow and hire more workers. #Jobs https://t.co/3nsn5bNErj"]["See my testimony on why the Stop Enabling Sex Traffickers Act will maintain internet freedom while fighting to #EndHumanTrafficking. #SESTA https://t.co/ogGuNtkrVe"]["#SESTA will help #endhumantrafficking. Senate must get this done for moms like Yvonne Ambrose: https://t.co/saYVYRjtL6"]["#TaxReform will help bring back #jobs and boost wages. That's why I'm excited about the opportunity to get this done. https://t.co/GkDhaJElVd"]["I appreciate hearing the input from biz leaders in Springfield &amp; across #Ohio. I'll continue to work in the Senate to enact #TaxReform.#jobs https://t.co/tP21Qjkour"]["Congress must act quickly to reform the tax code. It is long overdue. #TaxReform will help bring investment back to #Ohio &amp; boost wages. https://t.co/VxCUnUHAdU"]["Our tax code is broken. At a roundtable in Springfield, #Ohio today, I heard from business leaders who say #taxreform will help create #jobs https://t.co/YvA6C1ARfS"]["Driving my 100 yr old Ohio Model T - great way to cap off this week's auto industry tour of #Ohio. https://t.co/lOU8Dilm3e"]["Traffickers have moved from the street corner to the smart phone - &amp; this evil biz is growing &amp; thriving. #EndHumanTrafficking now. #SESTA https://t.co/CIxfIsFEZQ"]["Imp't that Senate renew &amp; improve Perkins Career &amp; Technical Education Act to help close skills gap. https://t.co/73ei7TDFKH #CareerTechEd"]["#TaxReform is urgent. Congress should act ASAP to stop jobs/investment from going overseas &amp; provide working families relief they deserve."]["Tune in to @FoxNews at 1pm! Will be discussing #taxreform and how it will create #jobs &amp; boost wages."]["Momentum for #SESTA continues to grow but more support is needed to get this bill past the hurdles &amp; signed into law.See why bill is needed: https://t.co/SJoFFsKXjE"][".@BenSasse, prediction for the Buckeyes vs Cornhuskers? I'm going with 34-17 good guys. #GoBucks!"]["We need #taxreform now to help bring more investment to #Ohio. #TaxReform will help create #jobs, boost wages, &amp; bring investment back to US"]["Washington should do more to help make our #Ohio auto manufacturers more competitive. First &amp; foremost, Congress must pass #TaxReform. #Jobs"]["Marysville is Honda's biggest plant &amp; I got to see brand new Accord coming off the line. Good to see Honda investing in new tech and #jobs https://t.co/K5LbIeWFuA"]["At the Fiat Chrysler US Toledo Assembly Complex I saw the iconic Jeep Wrangler in action. Proud that Toledo Wranglers go all over the globe. https://t.co/DXo0EgFyJV"]["Great mtgs w/ employees at the @GM Toledo Transmission Plant &amp; the GM Parma Metal Center. Easy to see why GM is investing in #Ohio. #Jobs https://t.co/8LcraglxnS"]["Having been to the Ford Sharonville plant over the years, great to go back this week &amp; see how they are adding new product and #Jobs https://t.co/DPly3YBhGp"]["At factories in SW, NE, NW &amp; central OH this wk, I was inspired by hard working #Ohio auto workers on the cutting edge of innovation.  #Jobs"]["Fun to join big crowd in Cinti tonight for BLINK light/art festival. 2 more nights! https://t.co/yMvVMkzYEw"]["Websites like #Backpage are trafficking women &amp; children. And they are doing so with immunity. #SESTA changes this to hold them accountable https://t.co/jskxlwvYB4"]["It is critically imp't that we put in place a comprehensive regional strategy to combat #Iran’s dangerous behavior:https://t.co/8YQO28sWXe"]["My statement on @realDonaldTrump's announcement regarding #Iran: https://t.co/8YQO28sWXe #IranDeal"]["I look forward to taking what I learned on my #Ohio auto tour w/ me back to DC &amp; making a difference for these #Ohio workers. #Jobs"]["#TaxReform will help our #Ohio auto manufacturers &amp; workers compete w/ their global competitors. All they need is level playing field. #Jobs https://t.co/FiL8znQMqV"]["It was imp't for me to hear firsthand from hundreds of auto workers about how I can help. I heard often about the need for #taxreform. #Jobs https://t.co/TLL52bbjqA"]["#Ohio is one of the top states in the country in terms of auto manufacturing. At plants like this in Marysville, it's easy to see why. https://t.co/ierw0DnnBV"]["Last visit of my #Ohio Auto Manufacturing #Jobs Tour: The @HondaInAmerica Manufacturing Plant in Marysville. https://t.co/FXDuCoA981"]["Happy #242NavyBday to our @USNavy Sailors past &amp; present who served to keep our country safe."]["We must get #TaxReform done to help keep our auto-industry strong to continue to attract investment &amp; #jobs. https://t.co/EA6mUVlA28"]["There is a reason auto manufacturers continue to invest in #Ohio: we have the best workers anywhere. #Jobs https://t.co/Dd9EzCNu8c"]["Today, I saw firsthand how the hundreds of millions of dollars of investment in this plant is helping to produce top-of-the-line product. https://t.co/3j1wsr4Yzw"]["Continuing my #Ohio Auto Tour today. Visited the Fiat Chrysler US Toledo Assembly Complex  -- a world-class facility. #Jobs https://t.co/pcMBDxghFv"]["Working hard to lead this congressional effort to bring Amazon 2HQ to #Ohio and 50k new #jobs! https://t.co/jOdgS6pjiN"]["Enjoyed discussing #taxreform, #healthcare, #jobs &amp; more with the workers here. The #Ohio auto industry is strong! https://t.co/ABVvCGLcFe"]["Pleased that General Motors has committed more than $600 million in investments to support future projects here. Investment is paying off https://t.co/kjzmlpSkUe"]["This world-class plant partners the American ingenuity @GM has long embodied with Toledo’s first-rate, dedicated workforce. #Ohio #Jobs https://t.co/mSVYnyMz8K"]["Third visit of my #Ohio auto tour: @GM's Toledo Transmission Plant. Inspiring to see the great work being done in Toledo. https://t.co/vvQGZrJDxx"]["#TBT to my visit to Kurt Farms in Dunkirk, Ohio earlier this year - one of the many #Ohio farms leading the way in #agriculture innovation. https://t.co/BlwUOCNMnT"]["Happy #NationalFarmersDay to the thousands of #Ohio farmers who are helping our agriculture industry thrive!"]["Workers here in Parma are at the cutting edge of innovation &amp; development. As co-chair of Sen. Auto Caucus, I'll continue to fight for them https://t.co/gRZSlVhDIZ"]["To help plants like the one here in Parma continue to thrive, we need to simplify &amp; reform our tax code. #Jobs #TaxReform https://t.co/AlARsElChF"]["The auto industry is one of the main drivers of #Ohio's economy, employing more than 108,000 Ohioans &amp; contributing more than $13B annually https://t.co/jlphviDBUO"]["Great visit to the @GM Parma Metal Center on day two of my #Ohio auto tour to discuss #TaxReform &amp; #Jobs https://t.co/lqLYeJoYEq"]["Every day in #Ohio &amp; around this country, innocent women &amp; children are sold by online traffickers on websites like #Backpage. #SESTA https://t.co/ud7DSITajf"]["Congress must work together in bipartisan fashion to ensure students have opportunity to participate in CTE programs:https://t.co/73ei7TDFKH"]["#CareerTechEd programs help Ohioans acquire the skills they need for the #jobs of today. https://t.co/73ei7TDFKH"]["2 innings to go. Slider and I are hoping for one more run! #RallyTogether https://t.co/GIrlnZ1k0i"]["Game 5 in Cleveland. Amazing crowd. #RallyTogether #GoTribe! https://t.co/ZQsUcOYetP"]["I will continue to fight to keep our auto industry strong so we can create new #jobs &amp; higher wages for #Ohio workers. #taxreform https://t.co/MN2SiqHHLN"]["Simplifying our broken tax code will create more #jobs and increase wages, &amp; it will boost #Ohio’s auto manufacturers as well. #taxreform https://t.co/XpJG6bW0Dj"]["For too long, our tax code has caused #Ohio workers like those here in Sharonville to compete w/ one hand tied behind their back. #taxreform https://t.co/r5frMKAAEn"]["Kicked off my #Ohio auto tour today at @Ford in Sharonville. Did you know Ford employs more than 6800 Ohioans? https://t.co/bEMNJkG9WU"]["#TaxReform is critical to jumpstarting our economy, creating more #jobs &amp; boosting wages for #Ohio’s workers https://t.co/8jGBCC0vAD"]["Worth reading from Lawrence Lindsey in today’s WSJ: “Tax Reform Will Give Workers a Raise” https://t.co/suiJOGGl4p #Jobs #TaxReform"]["Honored to be selected to receive the Panetta Institute for Public Policy Award for Bipartisanship. \nhttps://t.co/9fbd5cGGaa"]["#SESTA will allow sex trafficking victims to get the justice they deserve. The time to #EndHumanTrafficking is now. https://t.co/Sd3oaZOWlp"]["The Senate needs to act on #SESTA Everyone should support this bill to help #EndHumanTrafficking. https://t.co/r5RwFrtAbH"]["I’m excited about the opportunity to get #TaxReform done for American workers &amp; families. #Jobs https://t.co/aSZPQrtKYj"]["Simplifying &amp; reforming our tax code will create more #jobs &amp; increase wages. Congress needs to get this done. #TaxReform https://t.co/OU4lFnHOny"]["#Ohio's #CHIP funding is set to run out at the end of the year. Congress must #ExtendCHIP: https://t.co/2KjQUsBtmC"]["The JSMC in Lima is critical to local economy &amp; our national security. Proud to fight for them: https://t.co/GL9VSa2FMS #Jobs"]["Online traffickers must be brought to justice. Congress must hold them accountable and help to #EndHumanTrafficking. #SESTA #CDA230 https://t.co/dAN120oXcW"]["#SESTA narrowly targets only those who knowingly facilitate sex trafficking. The Courts have asked for this bill - Congress should deliver https://t.co/wGlxytWbaX"]["Proud of the bipartisan support behind #SESTA to help #EndHumanTrafficking. This bill is “a no-brainer.” https://t.co/V9dP85O5tZ"]["Human Trafficking is a stain on our national character. It is appalling that it is happening in this country, in this century. #SESTA https://t.co/g9MdJSRwvQ"]["Buckeyes looked great last week against Rutgers. Let's keep the momentum going at The Shoe today! #GoBucks"]["Discussed steps to help #PuertoRico relief efforts at Homeland Security hearing last wk: https://t.co/idnYcrHT9m"]["We must continue to do all we can to help our fellow citizens in #PuertoRico. https://t.co/NmHRDjtqdd"]["Inspired by the good work our @OHNationalGuard and our military is doing to help with relief efforts in #PuertoRico. https://t.co/BXWQK6yMlA"]["Tired of a tax code that keeps US profits overseas (nearly $3 trillion!) that should be invested here in America. #BringItBack #TaxReform https://t.co/nt0LIrOc87"]["Tired of hearing about companies- including in OH-that move overseas because US tax code is so bad. That must change.https://t.co/Wp2F3ihp3P"]["Check out #TaxReform video. This is about #jobs. It's about wages. It's about opportunity: https://t.co/aq2QNglxPk"]["I’m excited about the opportunity before us, and I’m optimistic that Congress can get #TaxReform done for American workers &amp; families. #Jobs https://t.co/FVLLJmXo4j"]["#SESTA continues to gain momentum in Congress &amp; in tech industry but more support is needed. SESTA is needed to help #EndHumanTrafficking https://t.co/tggEtkBQiH"][".@Whirlpool workers represent the best of #Ohio and American manufacturing. All they need is a level playing field. #MFGDay17 #Jobs https://t.co/2r1hwsHiKJ"]["Pleased that the International Trade Commission has ruled to protect @WhirlpoolCorp #jobs from unfair foreign trade:https://t.co/Iz7snL4GbS"]["Thankful for the survivors of #humantrafficking who are speaking out. They deserve justice. #SESTA https://t.co/ciEVQ3bpOP"]["I’ll continue to fight for pro-growth policies that create good-paying #Ohio #Manufacturing #Jobs. #MFGDay17 https://t.co/SrC1OwxBqV"]["#Ohio has the best manufacturers in the world! Always impressed by the amazing work I see as I travel the state. #MFGDay17 https://t.co/krajZxesl8"]["Too many #Ohio families are facing the middle-class squeeze of flat wages &amp; a higher cost of living. They deserve relief. #TaxReform #Jobs https://t.co/WFVgPoJVqE"]["Let’s go Tribe! #RallyTogether https://t.co/09qAOYPqCy"]["Our tax code is outdated and broken, and it's hurting workers in #Ohio and across the country. American workers deserve better. #TaxReform https://t.co/scq0GdnHU6"]["Senate needs to act on #SESTA. It is needed now - for moms like Yvonne and daughters like Desiree. #EndHumanTrafficking https://t.co/Ov8JYAFMBU"]["More &amp; more tech companies are getting on board and supporting #SESTA. Everyone should support this bill to help #EndHumanTrafficking."]["Awesome to see what's being done by #Ohio manufacturers. Best cars in the world being built in the Buckeye State! @HondaMfgOhio #Supercar https://t.co/CHI7JuKoEI"]["Got to learn abt the @Honda NSX Supercar today - the first to be built in #Ohio! They told me it might be slightly faster than my Model T https://t.co/73u4uPS4mJ"]["Enjoyed meeting w/ @XavierUniv President Father Graham (and member of my staff &amp; XU alum Meghan)! Exciting things happening at Xavier. https://t.co/MtLMppAZco"]["#CHIP helps 219,000 #Ohio kids &amp; 9 million children nationwide get high-quality health coverage. Senate must act: https://t.co/2KjQUsBtmC"]["The \"Hack DHS\" Act is a creative solution to a complex problem. Senate should act: https://t.co/HNbAkV9Hv8 #CyberSecurity"]["#TaxReform is about helping the #middleclass, creating more #Jobs &amp; providing better wages for all Americans https://t.co/YRSiuii3bQ"]["@SenatorHassan @DHSgov It is imperative that we take every step to protect our DHS networks from the threats they face every day. https://t.co/YVtekOjdiB"]["Senate Homeland Security Cmte passed my bipartisan bill w/ @SenatorHassan to strengthen cyber defenses at @DHSgov: https://t.co/YVtekOjdiB"]["I urge the Senate to move quickly to extend #CHIP funding so that children &amp; families who rely on this program are not left behind. https://t.co/6rbLarKd7g"]["#Momentum: Anti-trafficking &amp; faith-based groups, law enforcement, @IBM, @Oracle, @HPE, @21CF, @HomeDepot &amp; @WaltDisneyCo all back #SESTA"]["Pleased that @HomeDepot is now backing bipartisan #SESTA bill to help #EndHumanTrafficking https://t.co/mJFfCUzVSQ #CDA230"]["So thankful for our military and first responders helping w/ relief efforts in #PuertoRico. They are doing all they can to help. https://t.co/MCBRzlfL28"]["It's crazy that we have a tax code that is driving #jobs &amp; investment overseas. Congress needs to act on #taxreform to bring these jobs back https://t.co/KqcF9KlVJF"]["Good story on the @OHNationalGuard heading down to #PuertoRico to help their fellow citizens in need: https://t.co/AS7BFPNn0v #Ohio"]["Enjoyed meeting w/ constituents during an important time in Washington. Thank you for sharing your thoughts with me. #Ohio https://t.co/yffeQI0QUm"]["On @FoxBusiness, I discussed #taxreform &amp; how it will help #middleclass families with more #jobs &amp; better wages: https://t.co/oBL3pWltJq"]["@timkaine The bipartisan bill will help children w/ hearing loss to not fall behind. I urge POTUS to sign it into law: https://t.co/NDmDGFPMfw"]["Pleased House passed my bill w/ @timkaine to promote early hearing detection in newborns, infants &amp; young children:https://t.co/NDmDGFPMfw"]["Looking forward to Finance Cmte considering bipartisan #CHIP legislation tomorrow - imp't for children’s #healthcare:https://t.co/CxnU9TwAc2"]["They are leaving from the @121ARW, where I visited in August. So impressed by the men &amp; women in uniform serving in our @OHNationalGuard. https://t.co/jH8oYgk60H"]["Proud of our @OHNationalGuard for helping with relief efforts in #PuertoRico: https://t.co/3ZpFoWbWCc"][".@IBM: #SESTA is a \"necessary and carefully targeted step to address a serious and growing societal problem\" https://t.co/A0FZwvRRSe"]["Proud to have the support of @IBM for the bipartisan Stop Enabling Sex Traffickers Act. https://t.co/A0FZwvRRSe #SESTA #EndHumanTrafficking"]["Pleased w/ support #SESTA has received from tech companies who support effort to #EndHumanTrafficking. Everyone should support this bill."]["We have no choice but to act to help stop online sex trafficking of women &amp; children. #SESTA #CDA230 #EndHumanTrafficking https://t.co/OJHrkCNo1O"]["So thankful to the victims of #humantrafficking &amp; advocates who are speaking out so more innocent people don’t have to suffer.#SESTA #CDA230 https://t.co/Ldp0kPcSUf"]["Spoke w/ anti-trafficking advocates at DC screening of @IAmJaneDoeFilm today, which illustrates why Congress must pass #SESTA. https://t.co/tWSleyCXhF"]["The JSMC, or the Lima Tank Plant, is finally receiving the level of support it needs. My op-ed in @limanews: https://t.co/GL9VSakhbs"]["Our heartfelt thanks to all of the police officers, first responders &amp; others who helped people to safety."]["We are praying for those taken from us, their families &amp; all those injured in this attack."]["Jane &amp; I mourn the loss of innocent lives in this horrific attack in Las Vegas last night."]["Sally and I at finish of Little Miami Triathlon: Good cause, great crowd, beautiful day. https://t.co/nZSZVyqKLa"]["102 wins &amp; counting! Incredible regular season for the @Indians. Can't wait to see what the post season has in store. #RallyTogether"]["#TaxReform is about better #jobs and more jobs. It's about increased wages. And it's about more opportunity. Time to get this done. https://t.co/OoLKtEruYU"]["#SESTA has growing bipartisan support. Please add your voice to those fighting to #endhumantrafficking by encouraging Congress to pass SESTA"]["It's for girls like Desiree and moms like Yvonne that Congress must pass #SESTA: https://t.co/9diULJLIL2"]["#SESTA narrowly targets only those who knowingly engage in criminal sex trafficking. If passed, it will help to #endhumantrafficking.#CDA230 https://t.co/DR1a7mWMIJ"]["#HumanTrafficking is something many think couldn't happen here in America. But it does, &amp; it's happening online at an appalling rate. #SESTA"]["Beautiful day to canoe, run and bike in the 38th annual race with daughter Sally. https://t.co/IU7U0xZd8A"]["Racing again today in the Little Miami Triathlon which benefits @boyscouts and Cincy Assoc for the Blind. https://t.co/kWXGoGQMiU"]["Thank you to the men &amp; women of the @179AW helping w/ hurricane relief efforts in the Virgin Islands. https://t.co/bAhnTr1fZD"]["Pleased to see @POTUS discussing benefits of #taxreform. I'm optimistic we can get this done to provide relief to #Ohio families. #Jobs"]["#TaxReform will encourage more investment in America, bring #jobs home, &amp; give American workers a competitive advantage. https://t.co/NdbXIIJXPG"]["Our current tax code encourages U.S. companies to take #jobs &amp; investment overseas. We need to encourage companies to invest here at home. https://t.co/ZzoMY015FQ"]["Tech communities should support #SESTA. I discussed why on the Senate floor: https://t.co/qIjT8rYM1b"]["Lake Erie provides drinking water to millions of Ohioans - and it's critical to tourism, fishing, recreation &amp; more. We must protect it. https://t.co/xdFHaO62QT"]["Important that Congress act to protect Lake Erie and our fresh water sources from Harmful Algal Blooms: https://t.co/xpelaN22TU #GreatLakes"]["#SESTA is needed to stop online trafficking and get victims of trafficking the justice they deserve. #EndHumanTrafficking #CDA230 https://t.co/VGnsEcDbIV"]["ICYMI: My speech on the Senate floor last night on why the tech industry should support our efforts to #EndHumanTrafficking. #SESTA #CDA230 https://t.co/kkG55ojZsy"]["Jane and I wish all those observing #YomKippur in Ohio and around the world a meaningful fast. G'mar Chatima Tova"]["Thank you for coming! An important day for the workers in Piketon. https://t.co/csXUylMJeD"]["I will continue to work w/ @SecretaryPerry, @RepBradWenstrup, @RepBillJohnson and others on behalf of these workers and their mission. https://t.co/Jie974TIoz"]["The U.S. should get back to producing its own enriched uranium, and it is the workers here at Piketon that can make that happen. #Jobs https://t.co/UdeSjNcXIo"]["Pleased that we now have an Energy Secretary &amp; an administration that support this plant &amp; these hardworking Ohioans. #Jobs https://t.co/EHUZIWBLSL"]["Proud to show @SecretaryPerry the top-notch infrastructure &amp; highly-skilled workforce at the Portsmouth Gaseous Diffusion Plant today. #Jobs https://t.co/7TDAEmQLpM"]["As @POTUS says, this is about creating #jobs and boosting wages. We need to get #TaxReform done for the American people."]["We need to get the economy moving for #Ohio families and workers. #TaxReform will help: https://t.co/ZLHhpijrN8"]["Because of our outdated tax code, trillions of dollars are stuck overseas. #TaxReform will help bring back investment to America. #Jobs https://t.co/dMyNkGkN8A"]["#HumanTrafficking is a stain on our national character. We should all work to hold traffickers accountable &amp; give victims justice. #SESTA https://t.co/ASJHZ9PaYT"]["Sex trafficking is happening online &amp; courts have said that Congress must act to hold traffickers liable. #SESTA #CDA230 https://t.co/42LFtCB8tn"]["The tech community should partner with us in the effort to stop online sex trafficking. #SESTA #CDA230 https://t.co/ccdSHvAqxX"]["We need to help #Ohio families by creating more #jobs &amp; better wages. #TaxReform will do just that. https://t.co/5MGL1aAAX9"]["#TaxReform is an exciting opportunity. We must stop sending jobs &amp; investment overseas and create #jobs here in America https://t.co/kEN9XNj6IU"]["Great news! Welcome back to the Capitol, Steve. https://t.co/sPnqZ0DxyH"]["#TaxReform can help bring back hundreds of billions, maybe trillions of dollars from overseas to be invested here in America. #Jobs https://t.co/WaYy3ZJ1rz"]["#TaxReform will get this economy moving and will generate more #jobs &amp; better wages. https://t.co/6QYC1f4Azh"]["#TaxReform is about #jobs. It's about wages. It's about opportunity. https://t.co/PItlekd98r"]["The #STOPAct will help law enforcement better detect these drugs coming in from countries like #China. Congress must act on this bill. https://t.co/ZYrwEbEIjN"]["The #opioidcrisis is getting worse as fentanyl &amp; carfentanil come in from overseas. There are steps gov can take to keep drugs out. #STOPAct https://t.co/LtJAcuZDAl"]["The situation in #PuertoRico is urgent. The federal government must do all it can to help. #PuertoRicoRelief https://t.co/ud68Eka13n"]["More must be done to help our fellow citizens in #PuertoRico. I discussed the relief effort w/ @DHSgov Acting Secretary Duke: https://t.co/gSa3wLzH6O"]["Will continue to work w/ @POTUS, @SpeakerRyan, @SenateMajLdr, @OrrinHatch, @RepKevinBrady &amp; others to get #taxreform done &amp; create #jobs"]["Current tax code encourages US companies to take #jobs &amp; investments overseas. #TaxReform will bring investment back:https://t.co/6z83P1J0wx"]["They deserve relief, and a strong economy that enables them to live out their God-given potential. https://t.co/6z83P1J0wx #TaxReform #Jobs"]["Too many #Ohio families are facing middle-class squeeze of stagnant wages &amp; a higher cost of living:https://t.co/6z83P1J0wx #TaxReform #Jobs"]["Simplifying &amp; reforming our broken tax code will create more #jobs &amp; increase wages: https://t.co/6z83P1J0wx #TaxReform"]["Critical that Congress protect #GreatLakes - important for drinking water, tourism, fishing &amp; more. https://t.co/RQIwgkP3YH #Ohio"]["@SenBillNelson @SenGaryPeters This legislation takes critical steps toward protecting Lake Erie &amp; other freshwater bodies throughout #Ohio and the nation from toxic algae https://t.co/hoSn1kcC8h"]["Senate passed my legislation w/ @SenBillNelson &amp; @SenGaryPeters to help combat harmful algal blooms: https://t.co/RQIwgkP3YH"]["Enjoyed meeting w/ Ohioans interested in #taxreform, pensions, #healthcare &amp; more during this morning's constituent coffee. #Ohio #Jobs https://t.co/hkP98C5EBa"]["I've visited treatment centers in towns like Youngstown. New grant $ will help them push back against addiction:https://t.co/bF25RAcD10"]["Celebrating Tim O'Neill's 27 years of federal service. His perseverance and dedication is an example to all of us. https://t.co/xKDzcACLOK"]["I offer a special thank you to our first responders like #Ohio Task Force 1 (#OHTF1) who are helping in the hurricane relief efforts. https://t.co/rw8sXMi7VM"]["My heart goes out to all those in TX, FL, the Virgin Islands, Puerto Rico &amp; elsewhere who are rebuilding after devastating hurricanes. https://t.co/gJIrMjM8Df"]["Fayette County has been hit hard by the #opioidcrisis. Funding will help those on the front lines: https://t.co/lmaIVipDog Via @recordherald"]["Pleased that #DrugFreeCommunities program through @ONDCP is working to combat the #opioidcrisis. https://t.co/0MyrQQ2AxL https://t.co/SzZMaNEAiY"]["Thx @CVSHealth for working to combat the #opioidcrisis. We must all work together to turn the tide of addiction: https://t.co/LLR1mTLBd8"]["Thx @SenatorBurr for adding your name to the growing list of bipartisan Senators backing the Stop Enabling Sex Traffickers Act (#SESTA)."]["Thank you @DickDurbin for supporting the bipartisan Stop Enabling Sex Traffickers Act (#SESTA) and your leadership to #EndHumanTrafficking"]["A reminder on what #SESTA is all about:\n\n#CDA230 #EndHumanTrafficking #Bipartisanship https://t.co/MxX0dZ8QNm"]["We must lower #healthcare premiums &amp; I support this effort led by @SenCoryGardner https://t.co/gwxy960YYf"]["Every day the Senate does not act, more women &amp; children are trafficked online. We must act on #SESTA to help stop this horrible crime. https://t.co/B7zKDkgG3p"]["#SESTA narrowly targets only those who knowingly facilitate sex trafficking. That's why it is so widely supported. https://t.co/j66HDevWKB"][".@MissingKids says that more than 80% of reported child trafficking happens online. The main culprit is #Backpage. #SESTA https://t.co/l102A4Vdpm"]["Huge investment in #Ohio workers and Ohio steel! All OH workers need is a level playing field to win &amp; thrive: https://t.co/qsCykTkI1k #Jobs"]["Discussed #GrahamCassidy at Finance hearing &amp; shared stories from Ohioans impacted by skyrocketing #Healthcare costs:https://t.co/mnIPlJ0b9K"]["I spoke about the impact of the #opioidcrisis on #Ohio in a recent convo w/ @thehill. You can watch here: https://t.co/gVKyMzD55U #STOPAct"]["The #STOPAct addresses the devastating impact of fentanyl &amp; other drugs being sent from countries like #China. https://t.co/FSN14dETRg"]["The #opioidcrisis continues to devastate #Ohio. There is a bill that Congress can act on called the #STOPAct that will help keep drugs out. https://t.co/rYOBAxyTZD"]["#SESTA is gaining momentum here in Congress &amp; around the country as support continues to grow. Imp't reminder of why this bill is needed: https://t.co/rCCNplTTAL"]["Last wk, @SBALinda &amp; I heard from #smallbiz owners in #Ohio who are facing serious roadblocks to growing their biz &amp; creating more #jobs. https://t.co/hcFhic85GF"]["Important @GOPSenFinance hearing today on the #GrahamCassidy #healthcare plan. Look forward to hearing from the witnesses"]["Too many #Ohio biz  are saddled w/ burdensome regulations &amp; high taxes. Congress needs to get moving on #taxreform &amp; reg form."]["27 new grants recently announced to help #Ohio turn the tide of addiction. See where these grants are headed here: https://t.co/0MyrQQkbpj"]["The Drug-Free Communities program is providing resources to those on the frontlines battling the #opioidcrisis: https://t.co/0MyrQQ2AxL"]["ICYMI: a powerful recap on the Senate hearing on #SESTA: https://t.co/5V1SbJd15u"]["Imp't that Congress act on my bipartisan North Korean Enablers Accountability Act to accomplish this objective:https://t.co/vKIWpnkRWr"]["The Trump Administration is right to put additional sanctions on entities that do business w/ #NorthKorea: https://t.co/vKIWpnkRWr"]["Proud to support conservation efforts in #Ohio and across the country to protect our natural resources for future generations. #NHFday"]["Happy National #huntingandfishingday to my fellow outdoorsmen! No better place to hunt and fish than right here in #Ohio https://t.co/fWD0I1AwsJ"]["Had the opportunity to visit those sites and more during my #Ohio defense tour last month. Thankful for the service of so many Ohioans https://t.co/7Ux1WpHAam"]["#NDAA includes funding for the @180thFW in Toledo,  the JSMC in Lima, @WrightPattAFB in Dayton &amp; more: https://t.co/DTh6qhIh7c"]["In our #smallbiz roundtable in Cbus this wk heard again abt the need 4 better workforce training, fewer regulatory burdens, simpler tax code https://t.co/ZpZqz14YG2"]["#Smallbiz are the backbone of the #Ohio economy. Congress should not burden them w/ regulations &amp; higher taxes:https://t.co/m3NKtm3m1Q #Jobs"]["If you haven't had the chance to watch it, I strongly urge you to watch Yvonne's testimony to see why #SESTA is needed: https://t.co/TYLtoZF7rF"]["Thanks to the courage of mothers like Yvonne Ambrose who share their stories so we can prevent these tragedies from happening in the future. https://t.co/b3HKorUWNS"]["#SESTA is a narrowly-crafted bill that will hold companies like #Backpage accountable. It is widely supported:https://t.co/0HzuEBDMaP"]["Companies like #Backpage knowingly facilitate the selling of women &amp; children online to increase their profits. This cannot continue. #SESTA https://t.co/9u41tXUF3D"]["Victims of #humantrafficking deserve justice. #SESTA will help get them that justice. #CDA230 https://t.co/WkqqfrGNrd"]["It's too easy for drug traffickers from #China &amp; other countries to ship drugs into the US. #STOPAct closes loophole:https://t.co/HKVySq2YRY"]["Good column on why Congress must pass the #STOPAct to help keep drugs out of #Ohio &amp; our communities: https://t.co/HKVySq2YRY"]["Yvonne Ambrose's courage to come forward &amp; talk about the tragedy her family experienced demonstrates why Congress must act on #SESTA. https://t.co/6oukVuHwGx"]["#HumanTrafficking is a stain on our national character. #SESTA #CDA230 https://t.co/RxK1eHpFG8"]["Thank you for joining me in listening to the concerns of our #Ohio #SmallBusiness owners! Look forward to continuing to work w/ you https://t.co/MytOY238cX"]["I will continue working with my colleagues in Congress &amp; the administration to help #Ohio’s #smallbusiness owners and workers grow &amp; thrive https://t.co/yAwOc6aXSo"]["#Ohio is the proud home of more than 900,000 #smallbiz, like the family-owned @Burtonmetal, that employ more than two million workers. #Jobs https://t.co/cajkxUHgZ1"]["Gov't should be a partner to these small businesses, not an obstacle to progress by imposing higher taxes and burdensome regulations. #Jobs https://t.co/lqFWMa70KI"]["We heard from #SmallBusiness owners who are facing serious roadblocks to growing their biz, creating more #jobs and boosting wages. https://t.co/gUfhKaMrEk"]["Visited @Burtonmetal today for a great visit w/ @SBALinda to hear from #SmallBusiness owners on how we can help. #Jobs https://t.co/D045UXzL0k"]["I urge the Senate to act on my bipartisan North Korean Enablers Accountability Act to help accomplish this goal: https://t.co/vKIWpn3h4T"]["It is unacceptable that many Chinese companies continue to do business with #NorthKorea, enabling its dangerous and destabilizing actions."]["I strongly support @realDonaldTrump's announcement today on #NorthKorea: https://t.co/vKIWpn3h4T"]["Appreciate the work that LifeTown is doing on drug prevention and their work to help disabled kids learn important life skills https://t.co/oet7aHl0PH"]["Today is the beginning of the yr 5778 on the Jewish calendar and a time of reflection &amp; spiritual renewal https://t.co/BbDPfJzMi4"]["Honored to visit the Chabad Center on a day of such great meaning to the Jewish people. #RoshHashanah https://t.co/MEuIDLxDmF"]["We must continue our work to reduce substance abuse among #Ohio's youth. Drug-Free Communities Program is helping:https://t.co/0MyrQQkbpj"]["Pleased that 27 new grants through the Drug-Free Communities program are on their way to help #Ohio: https://t.co/0MyrQQkbpj #opioidcrisis"]["Drug-Free Communities program is proven to work. Sadly, amidst today's #opioidcrisis, it's needed now more than ever:https://t.co/0MyrQQ2AxL"][".@WhirlpoolCorp in Clyde, #Ohio is the backbone of local economy. Proud to stand w them &amp; against unfair trade:https://t.co/dXkJIOwp55 #Jobs"]["Strong bipartisan consensus emerging that Congress pass #SESTA. Good recap from yesterday’s @SenateCommerce hrg here:https://t.co/7Edah2dH6P"]["Congress must act on #SESTA to make sure what happened to Desiree Robinson doesn't happen again.https://t.co/4pAP7kGqQS"]["Jane &amp; I are praying for everyone in Puerto Rico and all those in the path of #HurricaneMaria."]["At yesterday’s @SenateCommerce hrg, there was bipartisan consensus that Congress must pass #SESTA to help #EndHumanTraficking. #CDA230"]["#HumanTrafficking is a stain on our national character. #SESTA is a common-sense, bipartisan bill that will help to end this heinous crime. https://t.co/WkhNCrjpLb"]["Jane &amp; I wish a happy and healthy New Year to all those in #Ohio &amp; around the world observing Rosh Hashana. Shana Tova!"]["Yvonne Ambrose's testimony yesterday was heartbreaking - but it needs to be heard. Victims of trafficking deserve justice. #SESTA https://t.co/Ou4mqGDSLs"]["Important that U.S. gov’t take on unfair trade in order to boost the steel industry and protect #jobs: https://t.co/pwDQQ8Me7o #Ohio"]["Congress should come together in bipartisan way to extend #PerkinsLoan program to help students pursue their dreams:https://t.co/7YQtVPZ0I8"]["Toledo's @180thFW is critical to our nat'l defense. Proud to have secured $15M in funding to help secure new hangars:https://t.co/jPdBVILqUd"]["#Ohio is home to some of the best &amp; brightest serving our country. Proud to support many of their initiatives:https://t.co/DTh6qhZSvM #NDAA"]["Yvonne has a simple request to us here in Congress: Pass #SESTA so what happened to her daughter never happens again. RT to share her story https://t.co/HVEleuBMYD"]["\"This is not a race, gender or economic problem, this is a people problem, a human problem.\" #EndHumanTrafficking #SESTA https://t.co/PpVyofn9bI"]["MUST WATCH: Yvonne Ambrose tells tragic story of her daughter, Desiree, who was trafficked on #Backpage. https://t.co/k6nKTU7K8A"]["Congress can fix the injustice of online sex trafficking. We have a duty to act. #SESTA #EndHumanTrafficking https://t.co/FuJgrZvG22"]["That instances of #humantrafficking &amp; sex trafficking are actually increasing in this country is an outrage. My testimony on #SESTA: https://t.co/ZgDNijrnqb"]["Happening Now: Senate hearing on bipartisan Stop Enabling Sex Traffickers Act (#SESTA): https://t.co/EjsZrAdHht"]["Proud to have the support of @Disney for the bipartisan bill to #endhumantrafficking. Their letter here: https://t.co/v7gtK0EFWE #SESTA"]["My op-ed in the @guardian details why #SESTA is needed. Please read and share: https://t.co/4pAP7koPZk #EndHumanTrafficking #CDA230"]["History will judge those who don't help to stop #humantrafficking. This crime is a stain on our national character - and it must stop.#SESTA"]["#SESTA will also help get victims of #humantrafficking the justice they deserve. Justice that is long overdue. https://t.co/4pAP7koPZk"]["#SESTA is designed to hold accountable companies like #Backpage that knowingly facilitate the trafficking of women &amp; children online. https://t.co/YTvk4GCljD"]["I will be testifying along w/ Yvonne Ambrose, a mother whose daughter was trafficked on #Backpage. Her story: https://t.co/4pAP7koPZk #SESTA"]["At 10:30 this morning, the Senate will hold a hearing on the bipartisan bill to #endhumantrafficking: https://t.co/EjsZrAdHht #SESTA #CDA230"]["United States must support our allies in #Ukraine. Senate took big step forward today to helping our imp't ally: https://t.co/lZHfSTAoMZ"]["Important that the United States bolster its defense against foreign propaganda &amp; disinformation: https://t.co/3zPOktPHPf #NDAA #Russia"][".@WrightPattAFB is at the cutting-edge of Air Force technology. #NDAA supports WPAFB #jobs &amp; research mission:https://t.co/KP6ZG9QIFp"]["Lima builds the best tanks anywhere in the world. #NDAA authorizes funding to increase production. Good for #jobs: https://t.co/AYDAzzna1Y"]["#NDAA authorizes $15 million to support construction of new hangars at the @180FW in Toledo: https://t.co/gxuwaoZGLI"]["Pleased that the #NDAA includes my priorities that provide necessary resources to #Ohio servicemembers: https://t.co/DTh6qhIh7c"]["Today, the Senate took a big step toward ensuring that our men &amp; women in uniform have the resources they need:https://t.co/DTh6qhZSvM #NDAA"]["I'm looking forward to testifying tomorrow on the Stop Enabling Sex Traffickers Act. Live stream will be here:https://t.co/EjsZrAdHht #SESTA"]["Thank you to @AHLA for your support of #SESTA and your work to #endhumantrafficking: https://t.co/JCL48yi2FY #CDA230"]["With growing support for this legislation and tomorrow’s hearing on #SESTA, momentum is building for this important legislation. https://t.co/y5qbiUt0sf"]["Sex traffickers have escaped justice for too long. Companies like @HP are joining in the fight to change that.https://t.co/sWDuTC8yc5 #SESTA"]["Proud to have the support of Hewlett-Packard (@HP) for the Stop Enabling Sex Traffickers Act: https://t.co/sWDuTC8yc5 #SESTA"]["Happy 70th to the @usairforce! Proud of the many men &amp; women serving our country's Air Force in #Ohio. #AFBday https://t.co/TDbaJu0Job"]["1,000 @amazon #jobs officially on their way to SW #Ohio! Companies continue to invest in OH &amp; our great workers:https://t.co/PaQoH9VhWs"]["Biggest Oktoberfest anywhere outside of Munich right here in Cincinnati! Sponsored by @SamuelAdamsBeer. #OktoberfestZinzinnati https://t.co/hqvuGe8oa7"]["Fun to be at #OktoberfestZinzinnati with daughter Sally. https://t.co/nq0u1OkfYc"]["On Tuesday, the Senate is holding a hearing on the Stop Enabling Sex Traffickers Act (#SESTA). https://t.co/T5NXiB1YxU"]["We are facing a scourge of online sex trafficking in this country. Congress can act to stop it: https://t.co/Eu4aNPmcyB #SESTA #CDA230"]["As @toledonews said in their recent editorial, \"lawmakers need to act with a sense of urgency\" &amp; pass the #STOPAct:https://t.co/eBp7Juut35"]["The #STOPAct will help keeps drugs like fentanyl, which is worsening the #opioidcrisis, off our streets. More here:https://t.co/gVKyMzltHk"]["The #opioidcrisis affects the fabric of our society in fundamental ways. We've never seen anything this bad. That's why #STOPAct is needed https://t.co/1F97CVpywe"]["Hundreds of thousands of people here in #Ohio are addicted &amp; are unable to reach their God-given potential.https://t.co/gVKyMzD55U #STOPAct"]["Drug overdoses are the #1 cause of accidental death in America. This epidemic affects every community: https://t.co/gVKyMzltHk #STOPAct"]["#PerkinsLoan Program has helped low-income students attend college for years. Important this program continue: https://t.co/7YQtVPZ0I8"]["I'm fighting to reauthorize #PerkinsLoan Program. It fills an important niche to give low income kids the chance to pursue higher ed"]["#TaxReform will help grow the economy, create #jobs, increase wages, and boost the middle class. Congress needs to act. https://t.co/SZjok8ysLU"]