["My colleagues and I have reached a bipartisan agreement on the #DreamAct https://t.co/5BdOgXBOz2"]["Agree with @SenJohnMcCain. Repeatedly, I have asked for answers about the unjust imprisonment of the two @Reuters journalists, but have received silence from the Burmese Embassy. https://t.co/wzwmL89Nk5"]["These Dreamers – studying to be future doctors at @LoyolaChicago's Stritch School of Medicine – deserve the chance to be part of our country’s future. The @CBSThisMorning story on them here: https://t.co/WzFTru1ZJp"]["MORNING READ: Republicans continue to cut corners in their desperate rush to score political points. Taxpaying Americans and small businesses deserve better than to bear the cost of this sloppily drafted and partisan bill. https://t.co/IOTyv7AtAd"]["Happening now: @SenateDems sharing stories about Dreamers across America on the Senate floor. Time is running out and we have to pass the #DreamActNow. Live stream:  https://t.co/IPGMk8SzZL"]["Deeply troubled by this arrest. Legitimate democracy in Russia must allow free participation of civil society and political opposition. https://t.co/xNanFZvnVn"]["The Department of Education is proposing to disburse federal student aid through prepaid cards.  This raises concerns about fees, privacy, and how student info is used. I’m pressing for answers. https://t.co/n5McCqZuZ0"]["I look forward to casting my vote in favor of #NetNeutrality because every single Illinoisan deserves a free and open internet. https://t.co/NcDzUOghlY"]["@SenStabenow @SenatorHassan @SenateDems Time is short, and too many lives are hanging in the balance. That’s why I’m working night and day to pass the #DreamAct. These young people are American in every sense of the word and they deserve to stay in our communities. Let’s pass the #DreamActNow. https://t.co/bfu1LPro2a"]["Funding CHIP has always been a bipartisan issue. 100 days since funding ran out, it’s past time to end the anxiety that countless parents are facing. 300,000 kids in Illinois need us to do the right thing, now. https://t.co/GAbgM3cQLo"]["Extending a warm welcome to my friends @SenBooker and @SenKamalaHarris to the Senate Judiciary Committee. Their powerful voices will be an asset to help ensure justice and equality for all."]["Agreed https://t.co/Lwx4dn2znw"]["The next step is for bipartisan negotiators, who have already been working for months, to immediately reach an agreement that can pass both chambers and be signed into law by January 19th."]["If the #DreamAct was called for a vote today, it would pass. It’s long past time to get serious about the fate of hundreds of thousands of young people brought to America as children. Let’s pass the #DreamActNow. https://t.co/OlWi1dSJcr"]["MORNING READ: A costly and ineffective border wall will not make America safer. Instead the White House should work with Congress on a bipartisan solution combining the #DreamAct and reasonable border security. https://t.co/mCewspkmvw"]["Bipartisan negotiations continue in good faith among senators who understand what is at stake. These young people are simply out of time. #DreamActNow."]["I’ve been clear from the start: I will consider reasonable border security measures to pass the #DreamActNow. $18 billion for a wall we don’t need and the American people don’t want doesn’t fall into the “reasonable” category."]["The White House set this crisis in motion when it ended DACA four months ago. Now, they are using Dreamers as a bargaining chip to pass a wish-list of hardline anti-immigrant bills. That’s being unreasonable #DreamActNow."]["From the Trump Administration’s own travel advisory: “El Salvador has one of the highest homicide levels in the world...There are thousands of gang members operating in the country, including members of MS-13 and M18.”"]["A heartless &amp; dangerous decision. Ending this protection will tear families apart and expose 200,000 people to deportation to a country where their lives will be placed at risk. https://t.co/TlRPXlJhJI"]["Almost 40% of low-income seniors in the U.S. pay more than half their monthly income for rent. Now is the time to invest in @HUDgov programs like HOME and the Low Income Housing Tax Credit, which provide critical support to families."]["Glad to attend the groundbreaking for Metro Landing of Swansea – a new development that will provide seniors in the community with affordable, quality housing. https://t.co/QE5MJXfl2C"]["Natural disasters have caused a record-setting amount of damage in the U.S. this year. There’s no denying that climate change will cost the U.S. trillions more in the next decade and that we have a financial and national security reason to act. https://t.co/ZIFqFX0kD1"]["Bipartisan negotiations continue in good faith among senators who understand what is at stake. #DreamActNow"]["Latest White House demand on immigration: $18 billion for a border wall. Outrageous. President Trump has said he may need a good government shutdown to get his wall. With this demand, he seems to be heading in that direction."]["I urge Gov. Rauner to present a real plan to turn this around and I’ll be there to help at the federal level. Implementing CDC’s recommendations and committing to disclosing all new cases of Legionnaires’ disease to the public in a timely manner would be a good start."]["Today I toured Quincy Veterans’ Home and met with leadership to make certain the state is taking serious steps to prevent future Legionnaires’ outbreaks. After 3 years in a row of tragic outbreaks, we can’t just throw up our hands and say ‘these things happen.’"]["MORNING READ: State officials must heed CDC advice and begin considering options that can fully guarantee safety for our veterans. I’m visiting the veterans’ home in Quincy today to get an update from folks on the ground. https://t.co/Y7lW7W4nUO"]["The clock is ticking on Dreamers like Zarna, a @LoyolaChicago medical school student who has signed up to serve in an underserved community once she graduates. Why on earth would we expose this bright, aspiring doctor to the threat of deportation? #DreamActNow https://t.co/KlqrrdsH8J"]["Congratulations to my two new Democratic colleagues who were sworn in today, @SenTinaSmith &amp; Senator Doug Jones! Looking forward to our work ahead this year."]["A group of former DHS Secretaries join the bipartisan calls for swift passage of the Dream Act. The Senate can’t afford to delay any longer #DreamActNow https://t.co/gJiuYHanxF"]["14,586 DACA recipients have lost their status as of today. As the Senate convenes for 2018, we must prioritize fixing the crisis President Trump created by immediately passing the #DreamActNow"]["Tim was a great reporter whose work made Springfield and Illinois better. My condolences to his family, friends, and the SJ-R. https://t.co/J5MpMr4R9b"]["@ChicagoOEMC More than 100 days after Hurricane Maria, over 1 million Puerto Ricans are still without power and thousands have been displaced. We must do better for our fellow Americans."]["Visited the City of Chicago’s Hurricane Resource Center today to thank staff and hear about the services they have provided to Puerto Rican evacuees in the wake of Hurricane Maria https://t.co/eqzUtWnwKm"]["It’s cruel and counterproductive for this Administration to put more red tape between Congress and the people we represent. But my casework staff is second to none -- we won't stop fighting for the people we serve.  https://t.co/p3iOigfkdD"]["Merry Christmas!"]["The richest 1% will get 83% of the tax cuts from the Republican tax plan while the bottom 99% share the leftovers. President Trump knows who he's helping and it's not middle-income families. https://t.co/d88gxr2zIA"]["My Senate colleagues are joining me on the Senate floor again today to demand immediate passage of the #DreamAct. Watch live here: https://t.co/Tt5Rh68Kzp"][".@SenDuckworth &amp; I are pressing @Metra, @Amtrak, and @AAR_FreightRail for an update on implementation of #PTC safety technology in Illinois following Monday's Amtrak derailment https://t.co/RWdYbJUWL4"]["To every member of the @SenateGOP and @HouseGOP: wake up to the urgency of this crisis and pass the #DreamActNow. https://t.co/M9O5ztaVfV"]["Today, I shared the story of Karen Reyes on the Senate floor, a #Dreamer, a special education teacher, a remarkable young woman. Congress must do what is right, what is just, and pass the #DreamActNow https://t.co/hrrF8LPbf1"]["So let me get this straight: @BetsyDeVosED protects poor performing for-profit schools from being held accountable under the Gainful Employment Rule, but she's going to punish defrauded student borrowers? This is an outrage. https://t.co/rnVybfiRgm"]["Yes, sir, you do.  https://t.co/pH6CTPlhHa"]["Republican and Democratic Governors are standing up for the #Dreamers in their states. RT to make sure Congress gets the message to pass the #DreamActNow. https://t.co/loQjZAxgS7"]["Just in: Senate GOP rams through partisan tax bill that will hurt millions of working families across the country while the wealthiest 1% &amp; largest corporations receive nothing short of a windfall #GOPTaxScam"]["The bottom line is that Republicans believe we can afford to add $1.5T to the national debt when it comes to giving tax cuts to the wealthy, but we can’t afford it when it comes to helping the most vulnerable in our society. #GOPTaxScam"]["The real surprise here is that many of the so-called “fiscal hawks” in the Republican Party are ready to add $1.5 trillion to the deficit after complaining about our national debt for the last 8 years under President Obama. #GOPTaxScam"]["I’m on the Senate floor touting the #GOPTaxScam for what it is – a massive give-away to corporate special-interests, campaign donors, and the wealthiest Americans. Watch live here: https://t.co/x87BhFnet2"]["The nonpartisan @USCBO says that 13 million Americans will lose their health insurance &amp; insurance premium costs will go up by 10% each year if the #GOPTaxScam is signed into law."]["After failing miserably to achieve one of their campaign promises to repeal the #ACA &amp; take away #healthcare from millions of families, Republicans have slipped in to the #GOPTaxScam a provision that will undermine our health care system."]["Why are the GOP rushing through their partisan #GOPTaxScam? Because if the bill were to receive proper scrutiny, it would be revealed for what it is—a monumental give-away to corporate special-interests, campaign donors, and the wealthiest Americans."]["For Maria Rocha, for hundreds of thousands of other young people, they’re counting on Congress to do something. Let’s not come up with excuses. Let’s come up with answers. Let’s pass the #DreamActNow."]["Maria was accepted into @TeachForAmerica after graduating from @UTSA &amp; currently teaches third grade in her home town. But without #DACA, Maria would not be able to work and could be deported immediately."]["Today I shared the story of Maria Rocha, a #Dreamer from San Antonio, on the Senate floor. It was the 103rd #Dreamer story I’ve told to date. https://t.co/kP5kiJT21Y"]["Let’s be clear: the Senate will not be voting on the #TaxCutsandJobsAct tonight. We will be voting on the mashed-up #GOPTaxScam / #ArcticRefuge Drilling / #Healthcare Repeal bill."]["Calling on @BetsyDeVosED and @usedgov to update Congress &amp; the public on its development and future release of the second round of debt-to-earnings rates under the Gainful Employment Rule https://t.co/7yLqmKgknu"]["Proud to stand with the @InsideOutProj &amp; @umcjustice to call on the Republican Congress to pass the #DreamActNow https://t.co/oXJQLN96Vh"]["Senate GOP now saying they want to vote on the #TaxScamBill TONIGHT. Mark my words, their partisan &amp; rushed approach will hurt millions of middle-income families across America."]["83% of Americans support keeping Dreamers in America. Retweet if you do too. #DreamActNow https://t.co/CfJohdJAyJ"]["First we had George Carlin. Now we have the Trump Admin - and it isn't funny. \n \nThese are the 7 words that the Trump Admin is reportedly prohibiting officials at CDC from using. I wrote to the CDC Director today in an attempt to get to the bottom of this supposed gag order. https://t.co/gRxvsYROZ1"]["“evidence-based”"]["“fetus”"]["“transgender”"]["“diversity”"]["“entitlement”"]["“vulnerable”"]["AFTERNOON READ: There’s no town too big or too small, too rich or too poor to be spared from the national opioid epidemic and its devastating impacts https://t.co/sZboD9JPn0"]["#Dreamers are teachers, lawyers, nurses &amp; much more. They are integral parts of our communities, yet 12,000 have already lost their DACA status. We need the #DreamActNow."]["Today I joined #Dreamers at Benito Juarez Community Academy to discuss why Congress must take action on the bipartisan #DreamActNow https://t.co/3LRWpXPMeh"]["I promised then that I would never give up the fight to pass the #DreamAct. I will continue to stand by the #Dreamers until Congress recognizes that this great land is their home."]["It was a moment for Congress to show courage, but it didn't. I hope history won’t repeat itself. We must pass the #DreamActNow &amp; give these courageous, inspiring young people a path to citizenship."]["Seven years ago today, a bipartisan majority of the Senate voted for the #DreamAct but it didn’t become the law of the land because of a partisan filibuster. https://t.co/3W0Urekj5i"]["We cannot allow the horrific state of life in Puerto Rico to become the status quo. Congress must approve critical disaster relief funding now."]["For the last 3 months, Puerto Rico has been without power, and without power there has been no reliable source of clean water, schools have remained closed, health care is questionable, and small businesses are struggling https://t.co/Anf3elddXg"]["Through history, banning words has worked about as well as banning books. This is outrageous. https://t.co/yY9mAnqe36"]["In Springfield today to break ground on the next phase of the Springfield Rail Improvement Project -  a great example how federal investments in transportation infrastructure create jobs and allow communities to prosper. https://t.co/WepcvI0toV"]["Glad to join @ILComptroller today at Our Lady of Angels 3rd Annual Christmas Luncheon. And thanks to Chicago high schoolers who helped prepare the food https://t.co/iUR5NF5VNp"]["TODAY is the last day for Illinoisans to sign up for 2018 health insurance – call and leave your name and number to get covered! 1-800-318-2596 https://t.co/VWjegmZose"]["Met with veteran students and instructors at @codeplatoon_org today, a Chicago non-profit that trains veterans for careers in software development https://t.co/ApMC01hzb8"]["Even Brett Talley has had more appearances in court than Matthew Petersen. Federal judges need to know what they’re doing on day one. Litigants deserve judges who are experienced and competent. https://t.co/FNAAfgxPhI"]["We can't leave these students holding the bag. @usedgov &amp; @BetsyDeVosED should immediately provide the full relief to which these and other defrauded student borrowers are entitled under the law."]["Last month, @SenWarren &amp; I released report showing how @usedgov &amp; @BetsyDeVosED have failed tens of thousands of Americans by refusing to cancel the loans of students who were defrauded by predatory colleges https://t.co/6SbJBek53O"]["Once again, thank you IL AG @LisaMadigan for standing up for IL students &amp; calling on @BetsyDeVosED to provide federal loan discharges to students victimized by predatory for-profit college Corinthian Colleges https://t.co/Mw55n3shbI"]["Illinoisans: TODAY is the last day to sign up for health coverage for 2018! Take a short break from your holiday shopping and instead shop for health coverage! https://t.co/rW86Mg65fH https://t.co/JHto6dwAbd"]["Meanwhile in DC, Republicans continue to work behind closed doors to ram through a partisan #TaxScamBill that no one has seen, will add more than a trillion dollars to the national debt, &amp; increase taxes on millions of middle-income families https://t.co/6bJ8Tcivpa"]["Congrats to my friend @jonbonjovi on @bonjovi’s induction into the @rockhall #RockHall2018 https://t.co/8LovlLoJPu"]["It’s a reminder of the critical importance of a free press to democracies."]["Pleased to see that he was released from dubious arrest and allowed to continue his important work. I hope the same will be done for others detained for political reasons."]["Glad to meet with the head of Azerbaijan’s last independent media outlet, Mehman Aliyev, of the Turan Information Agency."]["I promise to continue to fight on behalf of gun violence victims, including the children &amp; women who were murdered at #SandyHook five years ago. They will not be forgotten. https://t.co/Yz5fWHUeuX"]["We have seen far too many lives lost – in #SandyHook, in Chicago, in towns and communities across America – to stand by silently.  We must act to reduce the deadly toll of gunfire."]["While mass shootings continue to occur with horrifying frequency in the U.S., the gun lobby and the Republican Congress are trying to weaken laws that keep guns out of the hands of dangerous individuals.  That is wrong."]["And sadly, Congress has done nothing – nothing – to try to prevent another senseless tragedy like #SandyHook from happening again. Instead, last week, the GOP-controlled House of Reps. passed legislation that would weaken gun laws on the books in many states, including Illinois."]["5 years ago today, 12 little girls, 8 little boys, and 6 educators were senselessly &amp; heinously murdered at #SandyHook a mere 11 days before they were supposed to celebrate the Christmas holiday w their family &amp; friends. It remains one of the darkest days of my time in Congress."]["Thank you IL AG @LisaMadigan &amp; AGs from 17 other states &amp; DC for calling on @FCC to delay today’s vote to repeal #netneutrality protections https://t.co/H066PVfrDu"]["Thanks @Lin_Manuel for using your voice to bring attention to the devastating situation in Puerto Rico. Great talking to you today.\n \nCongress must include much needed disaster relief funding for PR in any government funding deal, along with the #DreamAct. https://t.co/wOdpFllVkS"]["Read Senator @ChrisMurphyCT's moving reflection five years after 20 children and six educators were killed at Sandy Hook Elementary. https://t.co/2wZnqfYAym"]["My Senate colleagues are joining me on the Senate floor again tonight to demand immediate passage of the #DreamAct. Watch live here: https://t.co/Tt5Rh68Kzp"]["Welcome home from Afghanistan to the @IL_Natl_Guard’s BEST-A19 soldiers, deployed with our Polish partners."]["It’s time for Congress to get serious about addressing for-profit colleges. We’ve been bystanders for too long as for-profit colleges have taken advantage of veterans, service members, and their families."]["Our request comes after a @CIRonline report showed notoriously predatory for-profit college - University of Phoenix - received special treatment at @FortCampbell in exchange for spending $250k over 3 years to sponsor 89 events https://t.co/YBLYHr2ajK"][".@SenJackReed &amp; I are pressing @DeptofDefense to release contracts between for-profit colleges &amp; military installations. Read our letter below https://t.co/oO6rnOZWCQ"]["Proud to stand with immigrant youth from across the country on our National Mall today to call on the Republican Congress to pass the #DreamAct before the end of the year #HereToStay https://t.co/i8Qle72vt7"]["Calling on @FCC Chairman Pai to abandon his plan to repeal the agency’s #netneutrality rules, which would give internet providers the ability to freely block or slow down consumers’ access to the internet."]["Senate Republicans now have a lame duck problem. The Senate should not take another vote on the #GOPTaxScam until Senator-elect Jones is seated. Senate Republicans must respect Alabama's decision."]["Only 3 more days to sign up for 2018 health insurance! Deadline is Fri 12/15. \n\nSo far, 4.7 million Americans have signed up. \n\n#GetCovered"]["My Senate colleagues are joining me on the Senate floor tonight to demand immediate passage of the #DreamAct. Watch live here: https://t.co/Tt5Rh68Kzp"]["Wishing a Happy #Hanukkah to everyone celebrating the festival of lights in Illinois, America, and around the world. Chag Sameach!"]["Good. GOP has been rubber stamping judicial nominees despite a lack of complete information about the nominees’ records &amp; despite clear warning signs about the nominees’ ideologies, temperaments, and judgment #CourtsMatter https://t.co/37zwdiCdWw"]["That is far too high. I'll continue to work with DEA to bring these opioid quotas down to a lower level of legitimate medical need. \n \nWith over 200 million opioid prescriptions written and tens of thousands of people dying, Congress &amp; the DEA have a responsibility to act."]["However, drug companies still flood the market with an estimated 14 billion opioid pills – enough for every adult in America to have a one-month prescription."]["Since 2016, DEA has met with me several times &amp; worked to lower opioid quotas 2 years in a row. Aggregate production quotas are now down by an average of 41 percent from where they were in 2016 https://t.co/m3zv9fbY5e"]["Between 1993 &amp; 2015, DEA allowed production of oxycodone to increase 39-fold and hydrocodone to increase 12-fold.  With higher quotas, opioid prescriptions soared – from 76 million in 1991 to 245 million in 2014 – and overdose deaths quadrupled to more than 33,000 in 2015."]["At today's Judiciary Committee hearing, I questioned the DEA Acting Assistant Administrator on the DEA's role in the rise of the national opioid addiction epidemic. Watch below https://t.co/speMaCe2vJ"]["@jimmykimmel And Illinoisans: the deadline to sign up for 2018 health insurance is THIS FRIDAY – sign up today! https://t.co/rW86Mg65fH"]["Thank you for sharing your heartfelt story @jimmykimmel – I couldn’t agree more. \n \nGOP, listen to Jimmy: take a break from tax cuts for the wealthy and reauthorize children’s health insurance now. https://t.co/0bCdjC3fmZ"]["Bipartisan consensus is growing for Congress to pass the #DreamAct this year. It is my friend @lisamurkowski’s holiday wish. Retweet if you agree https://t.co/gRjqoBeFcK"]["Illinoisans: The deadline to sign up for health insurance that starts on Jan 1 is this Friday, 12/15. Visit https://t.co/rW86Mg65fH and sign up before it’s too late. #GetCovered https://t.co/jPeiv3tLc5"]["Despite the efforts of President Trump and the frenzy in Washington over health care, health insurance under the ACA is open for business. #GetCovered before the deadline this Friday. https://t.co/aA2oP6iJbS"]["Today I visited @JoslinDiabetes in Springfield to urge Illinoisans to take action and #GetCovered for 2018 health insurance before the December 15 deadline. https://t.co/JEeJ2fmKqn"]["The United States must promote human rights around the world, but we also have a responsibility to look in the mirror and speak out when human rights are violated at home. #HumanRightsDay"]["Congress must act to combat white supremacist terror threat if Trump won’t https://t.co/CLeNvpLIRe"]["Congratulations to @MarkSuppelsa of @WGNNews on his retirement after a 36-year career in TV news---25 of them as an anchor in Chicago. #GoodbyeSuppelsa"]["See you Sunday https://t.co/qw96X6QUew"]["Illinoisans: You only have one week left to sign up for health insurance that starts on Jan 1. Visit https://t.co/rW86Mg65fH and sign up before it’s too late. #GetCovered https://t.co/Ks68IYONfX"]["@greta I have legislation that will hold those committing these crimes against humanity accountable. The United States cannot stand by and let this horrific violence against the Rohingya continue."]["@greta I went to Burma and saw Rohingya men, women, and children in a prison camp. I heard about villages burned to the ground and stories of mass slaughter. I couldn’t believe this was going on in the 21st century."]["I talked to @greta about how Congress must sanction the Myanmar military for their act of ethnic cleansing against the Rohingya people. https://t.co/hVq38wpiJ4"]["MORNING READ: Tucson's Police Chief Chris Magnus says Trump-Sessions anti-immigrant policies will empower criminals — and make our cities more dangerous. https://t.co/Ki5Epatpzx"]["This is not just a bad dream. Republicans like Speaker Paul Ryan will try to fulfill their fantasy of gutting Medicaid if the #GOPTaxScam passes. https://t.co/llkRfMYqFN"]["@HHSGov I also pressed him on how he would address the rising cost of prescription drugs and the ongoing opioid crisis."]["Met with Alex Azar, President Trump’s nominee to be Secretary of @HHSgov. First and foremost, I urged him to oppose Republican ACA sabotage efforts and instead work to protect health insurance coverage for all Americans. https://t.co/9cxWBur6ME"]["@USArmy More than 900 #DACA recipients just like Kyungmin have joined the military. It's not just morally right to pass the Dream Act, it's also in our national security interest."]["Kyungmin Cho has enlisted in the @USArmy. He's the 100th Dreamer whose story I've told on the Senate floor. \n\nHow can you question his commitment to America if he's willing to lay down his life for this country? #DreamActNow https://t.co/JtQiDCfcrB"]["Today should be a reminder that we cannot simply commemorate the service of our veterans with words and accolades. We must express our gratitude through action."]["76 years ago, brave Americans answered the call to defend our freedom. On #PearlHarborDay, we honor their service and sacrifice."]["Make no mistake—Republicans in Washington are on a mission to cut Medicare and Medicaid next if their plan to cut taxes for the wealthy passes.\n \nAnother way to tackle the deficit is not to explode it by more than $1.4 trillion in the first place. https://t.co/0VbMmpRCyV"]["The Capitol Christmas tree is officially lit. From my family to yours, have a joyful and safe holiday season. https://t.co/iehbq8pXn8"][".@NRA-backed bill to undermine state concealed carry laws just passed in the U.S. House of Representatives.\n\nEarlier today, Police Chief Thomas Manger of the Major Cities Chiefs Association described the bill as \"misguided\" and \"dangerous for his police officers.\" \n\nCc:@HouseGOP https://t.co/L0hshhXLwk"]["Republican health care promises do not match reality. I urge my colleagues to actually do something for the Americans we serve and and work with us to strengthen our health care system."]["Republicans promised to lower health insurance premiums.\n \nInstead they’ve acted to increase premiums via repeal, sabotage, and refusing to pass bipartisan health care stabilization bills."]["Republicans promised to treat the opioid epidemic like an emergency.\n \nYet there has been no emergency funding to respond to it."]["Health care funding for 9 million kids expired more than 2 months ago. \n \nRepublicans promised to reauthorize CHIP — so far all they’ve offered are words and half measures."]["Illinois native Heather Gooze is a Las Vegas shooting survivor. Listen to her describe the heartbreaking story of what she saw that night. You won't be able to forget it.\n\nRetweet if you think Congress must ban bump stocks once and for all. https://t.co/achrjmxvcT"]["Ashford is in danger of losing GI Bill eligibility; I have called on VA and DoD to prohibit new enrollments at this predatory #4profit: https://t.co/MEeNanDIv2"]["Glad states are stepping up to protect students because we know the Trump-DeVos Department of Education won’t."]["About a week ago, California sued predatory #4profit Ashford University for defrauding low-income students and vets."]["Senator Franken’s behavior was wrong. He has admitted to what he did. He should resign from the Senate."]["We have a doctor shortage in America and deporting smart young people like Blanca will only make it worse. We must pass the Dream Act and we need to do it now. No excuses."]["Blanca is enrolled at the Harvard School of Medicine. Her dream is to become a doctor and serve her community. Without #DACA she will be unable to work or be deported. That is plain wrong."]["Please retweet and help me share Blanca Morales' story. She is the 98th Dreamer whose story I’ve told on the Senate floor. #DreamActNow https://t.co/3JR1BLOwLE"]["@CDCgov Every medical professional who prescribes opioids should have training on the latest understanding and risks of these addictive painkillers."]["More than 91 Americans die every day from our nation’s opioid crisis.  Last year, the US Surgeon General sent these @CDCgov guidelines on responsible opioid prescribing to every doctor in the country. https://t.co/00SyCnbHnE"]["Pleased to see the Honduran election commission agree with @OAS_official and European Union calls for a partial recount in the Honduras election. The Honduran people peacefully protesting during this troubling time deserve to have their voices heard. https://t.co/7ulyc0yTD7"]["It’s been 3 months since the President’s cruel decision to end #DACA. My colleagues are joining me on the Senate floor to demand passage of the #DreamActNow. Watch: https://t.co/84TECLBRin"]["The Cornyn-Grassley immigration proposal is not a good faith effort to protect #Dreamers. My statement → https://t.co/zfv6ohCYAn"]["@SecretaryZinke .@SecretaryZinke broke his word to protect the rugged and unique Grand Gulch. https://t.co/tuVmuoG7i6"]["@SecretaryZinke .@SecretaryZinke broke his word to protect the scenic Valley of the Gods, a monument of major religious significance to Native American tribes. https://t.co/eL8AF7TBV6"][".@SecretaryZinke gave me — and the American people — his word that he would protect our country’s historic and magnificent antiquities like the Citadel Ruins. He broke his word. https://t.co/ZPh1Cl2UCH"]["This Senate has been empty the entire year and we’ve done little. Passing the #DreamAct could be a matter of life and death for these young people — and there is no excuse for Congress’ inaction."]["Here we are 3 months after the President’s cruel decision to end #DACA and this Republican Senate has done nothing.\n\nNothing. https://t.co/EENYZM4nEk"]["MORNING READ: Big banks scored big from the #GOPTaxScam while working Americans were left behind. \n\nThis is not what we were sent here to do. https://t.co/ZnqD4ZlLZE"]["Congrats to Col Nezamis and airmen of @ScottAFB’s @126ARW for their 8th Outstanding Unit Award!"]["This holiday season, have the peace of mind that you and your family have health insurance. \n\nYou have 11 days left to #GetCovered for 2018. https://t.co/mVMEjKLwo7"]["#StandWithBearsEars https://t.co/mcxydXc8SS"]["The Honduran Supreme Electoral Tribunal should act immediately to ensure fair and transparent elections for the Honduran people."]["The reports of election irregularities in #Honduras are extremely concerning. This Presidential election will impact the lives of every person in Honduras — they deserve a voice in its direction. https://t.co/kky6YqrSVS"]["This reckless decision by @POTUS and @SecretaryZinke threatens our important natural, archeological, and cultural resources. These monuments are for all of us. #StandWithBearsEars #SaveGrandStaircase"]["BREAKING: President Trump says he will decimate the size of Bears Ears &amp; Grand-Staircase National Monuments. \n\nWe should be protecting them for generations to come, not tearing them down. #MonumentsForAll"]["I’m proud to have helped secure funding for this project and will continue working to ensure that @MWRDGC and @USACEHQ have the federal resources needed for construction to stay on track"]["Glad to be at the opening of Stage 1 of the McCook Reservoir– a major infrastructure project that provides flood relief for 3.1 million people in the Chicago area. https://t.co/FnUTCEiPU5"]["@ILBizImmigrant More than 10,000 Dreamers have already lost DACA since Sept 5, and beginning March 5, 1,000 more per day will lose their work permits and be subject to deportation"]["Today I joined Illinois business, faith, community leaders and Dreamers to discuss why passing the #DreamActNow is the right thing to do morally and economically https://t.co/m4OCQiehEs"]["MORNING READ: What were Republicans doing in the early hours of Saturday morning? Adding tax breaks for their wealthy donors to the #GOPTaxScam. https://t.co/3Ldk26QgSx"]["@SecretaryZinke This lack of transparency coming from the Trump-Zinke Department of @Interior is a disservice to the Americans they serve. #KeepItPublic"][".@SecretaryZinke and the Trump Administration are keeping Americans in the dark about their plan to shrink our national monuments. #MonumentsForAll https://t.co/qHmOtf7xVW"]["It is time to pass my bipartisan bill sanctioning the Burmese military responsible for this crime against humanity"]["@janschakowsky What we saw in Burma and Bangladesh was heartbreaking and horrifying. We must be crystal clear that the US will not tolerate persecution of Rohingya men, women, and children"]["Today @janschakowsky and I visited the Rohingya Cultural Center in Chicago to talk with the community about our recent visit to Burma and Bangladesh https://t.co/v0aSFbsO33"]["The #DreamAct would allow young immigrants to continue contributing to the country they love. Today @ChicagoTM and I met with some of these young patriots in Chicago to discuss why the legislation is more critical than ever. https://t.co/AcqKTQcskL"]["While the country slept, Republicans clapped and cheered their bill to take your hard earned money and give it to their richest donors. Keep watching this until you can never forget. https://t.co/Pc5Ws8YDb3"]["JUST IN: #GOPTaxScam passes. \n\nOn the floor of the world’s greatest deliberative body, @SenateGOP rammed through a bill without even reading it."]["I'm willing to bet that not even one Republican Senator can tell us what their final tax bill will mean for American workers and their families. #GOPTaxScam https://t.co/5YxlqSg1TB"]["BREAKING: Senate Democrats just tried to get Senate Republicans to adjourn for a few days and take the time to actually read their tax bill. \n\nRT if you agree that reading bills before they’re voted on is the least we can do."]["UPDATE: Senate Republicans are so desperate to pass their tax bill tonight that they're now making handwritten changes to their already handwritten changes... \n\nSeriously. https://t.co/KQfW7bOyk1"]["Senate Republicans can’t put their own scribbled amendment into the record because nobody can read it. This is what we’re voting on. #Page257 https://t.co/SoEo4TvfBc"]["I just tried to enter this page into the record so the American people know the kind of stunts @SenateGOP is pulling to pass their tax scam. But they wouldn’t take it. Why? Because NOBODY can read it. #Page257 https://t.co/AFw6bza3fd"]["Trying to review the #GOPTaxScam but they are making hand-written changes to brand new text as we speak – can anyone else read this? https://t.co/JX8v1v4gyi"]["Senate Republicans can pontificate forever about how they’re doing this so that “middle class families can keep more of their paychecks.” That bears absolutely no resemblance to what is in their bill."]["I challenge any Republican Senator to come to the floor and explain what’s in this bill. It looks like the real bill was just delivered to the Senate floor. Republicans will vote yes TONIGHT on a bill they haven’t read."]["Prediction: Right after they vote to explode the deficit with unpaid tax cuts for the wealthy, Republicans will magically turn back into \"deficit hawks\" so they can gut Medicare and Medicaid. https://t.co/UgZzbxCX2V"]["Republicans have the votes…on what? No one has even seen the final bill yet. What a disgrace. https://t.co/3C1CR3L2Wq"]["Ordinary Americans will pay a heavy price just so Republicans can deliver a desperate political victory to their deep-pocketed donors. #GOPTaxScam"]["@USCBO @jctgov This is what the greatest deliberative body has come to. A sad day for the United States Senate and the people we are supposed to be serving."]["The non-partisan @USCBO and @jctgov have not analyzed the bill’s impacts on our economy and American taxpayers."]["There have been 0 hearings on this tax bill that’s being clumsily put together behind closed doors."]["Let’s talk about how today Senate Republicans will force a vote on a bill that neither of them has read. #GOPTaxScam"]["America already has a big doctor shortage and we could lose 5,400 more physicians unless Congress passes the #DREAMActNow. https://t.co/vRgzhc1cSo"]["All the soft-focus hype videos in the world can’t change the fact that this horrific bill is getting worse by the minute and that Republicans are desperate to pass something—anything—before anyone can read it or the CBO/JCT can score it. https://t.co/RYX0phtFeC"]["It's still not over. Senate Republicans will be trying again tomorrow morning to pass a bill that hasn't been written. #GOPTaxScam"]["Of course they are. Republican Senators will try to jam through a trillion dollar tax cut bill without even reading it. https://t.co/I9BYydjQYI"]["Let's be clear: Voting yes on this #GOPTaxScam is a vote to cut Medicare and Medicaid down the road."]["Republicans: The jig is up. https://t.co/yw3Ciasx9j"]["cc: @SenateGOP https://t.co/uJOdGh4Qj2"]["Under the Republican tax plan, America’s seniors will see their health insurance premiums increase by an average of $1,490 according to the @AARP.  \n\nOur seniors deserve better that this."]["Reminder: Republicans are still making last minute changes to their tax bill — and they want to vote on it tonight. The American people don’t even know what’s in their final #GOPTaxScam."]["Just when you thought the #GOPTaxScam couldn’t get any worse, Senate Republicans just voted to let corporations ship jobs overseas. My amendment with @SenSherrodBrown would have stopped that. https://t.co/5ro2rDrrrO"]["Republicans have lectured us on fiscal responsibility for years, but now they want to explode the deficit by $1.5 trillion to give tax cuts for the wealthy few. \n \nIt seems the deficit hawks have flown away."]["Just some of the headlines on the #GOPTaxScam. Do I need to say more? https://t.co/x2D7DfQEVs"]["According to the @AARP, more than 5 million seniors could see their taxes increase under the Republican tax bill. That's a disaster for seniors living on a fixed income."]["Corporate CEOs come right out and say they’ll use their massive tax cuts to pay out shareholders instead of creating jobs &amp; helping American workers. Republicans, will you believe it now? https://t.co/54Ey9mPNeD"]["@collegetrack @EmCollective Read what @laurenepowell has to stay about this Administration’s cruel decision to end #DACA. Congress must act. https://t.co/v7Vove0VPl"]["Republicans could be working to pass a tax reform bill that benefits working families instead of this partisan boondoggle for the wealthy. But they’re not."]["Republicans could be working to pass comprehensive background checks for every gun sale which 95% of Americans support (94% of gun owners)."]["Republicans could be working to reauthorize funding for community health centers which serve 27 million Americans."]["Republicans could be working to strengthen our health care system instead of throwing 13 million off their health insurance and raising premiums by 10%."]["Republicans could bring the bipartisan #DreamAct to the floor so 800,000 young people aren’t deported from the country they love."]["Instead of ramming through their tax scam, Republicans could be working to reauthorize health care for 9 million children. It’s been 2 months."]["Senate Republicans just voted to advance a bill that will lead to 13 million Americans losing their health care, insurance premiums increasing by hundreds of dollars, and taxes going up for working families."]["The Republican tax plan is for their deep-pocketed donors, not ordinary Americans. Retweet if you think so too."]["Cesar’s dream is to become a practicing physician and a scientist so he can help develop tools to diagnose &amp; treat diseases better. We need him in America. #DreamActNow https://t.co/JO1lQhSO1T"]["Republicans wanted spending offsets for food stamps for hungry Americans. Spending offsets for Hurricane Sandy victims.\n \nBut they're just fine with trillions in unpaid tax cuts for the wealthy."]["Get this: The President’s top outside economic adviser says the GOP tax scam is “not a true tax reform bill” and it’s going to “hurt a lot of different people.” https://t.co/NCcinQXMuV"]["Under the Republican tax plan, 13 million Americans will lose their health care and health insurance premiums will go up. They just can’t help themselves. https://t.co/nbpKHAhKM4"]["Almost 3 million Americans have enrolled for their 2018 health insurance. Have you? \n\n17 days left. https://t.co/mVMEjKLwo7"]["@politico On top of the glaring conflict of interest, Katsas refused to say at his hearing whether waterboarding is torture. Another extreme Trump nominee has been handed a lifetime appointment to the federal bench by @SenateGOP"]["From @politico: Republican Senator “Kennedy said he opposed Katsas’ confirmation to the appellate court in D.C. because of a ‘conflict of interest’ that the senator argued ‘a first-year law student would see.’”"]["What issues did Katsas work on? The Muslim ban, emoluments, the Administration's cruel decision to end #DACA, and much more."]["Senate Republicans confirmed a Trump White House lawyer to serve on America's second highest court. Gregory Katsas can now rule on policies he played a role in creating. Plain wrong. #CourtsMatter"]["My statement on @RepGutierrez announcing that he will not seek re-election: https://t.co/LNl9Uh1H2y"]["Fourth, the Rohingya prison camps in Myanmar must be closed and all Rohingya must be free to travel, work, send their kids to school, access to health care, and gain citizenship."]["Second, we must require that those in the Myanmar military responsible for crimes against humanity be held personally accountable in an international tribunal."]["First, we must demand full access by the official UN fact-finding mission, NGOs, and the press to North Rakhine to verify the devastation &amp; discourage even more exploitation."]["The Myanmar military has burned hundreds of villages to the ground and there are countless reports of rape, starvation, and mass killings. America cannot ignore it."]["A #Rohingya woman told me the ghastly story about how the Myanmar military killed her husband &amp; baby son right in front of her. Read about my travel to Burma and Bangladesh: https://t.co/x1xNGqPbG0"]["Corporate profits are at record highs. The last thing Republicans should be doing is ramming through massive tax cuts for corporations. https://t.co/V6YGlk06Em"]["10,000 Dreamers have already lost their DACA status. Retweet if you agree: Congress must pass the #DreamActNow."]["This holiday season, Dreamers deserve the peace of mind that they won’t be ripped away from the country they love. We must pass the #DreamAct this year."]["According to the nonpartisan @USCBO, the tens of millions of Americans making $75,000 or less will be worse off because of the Republican tax plan. What a scam."]["Met with #Dreamers from @Hunter_College this morning. These young people only want to contribute to the country they love. We must pass the #DreamActNow https://t.co/sPls7COZZo"]["This week, Republicans are desperately trying to ram through massive tax cuts for the wealthy — by leaving working families in the dust. Shame."]["Remember the @CFPB was the agency that fined @WellsFargo $100 million for defrauding its own customers creating phony accounts. #WallStreet hates it like the devil hates holy water."]["MORNING READ: After 15 years of Republican filibusters, the Senate now has a huge opportunity to finally pass the bipartisan #DreamAct https://t.co/ENpAOnbs24"]["Sen. Graham and I agree Congress must pass our bipartisan #DreamAct this year. #DreamActNow https://t.co/h6GPHWgST0"]["@SenateGOP Break's over. @SenateDems will fight tooth and nail to beat back partisan, secret schemes that raise costs for you and your family."]["13 million Americans will lose their health care and health insurance premiums will skyrocket...because of the @SenateGOP \"tax\" plan."]["Reminder: Senate Republicans will try to ram through their billionaires first tax scam this coming week. Get ready to fight."]["Less than 20 days left to sign up for 2018 health insurance.\n\nGrab some turkey leftovers and #GetCovered today: https://t.co/mVMEjKLwo7"]["27,000 Americans have parents who are TPS recipients from Haiti. The Trump Admin is forcing parents to choose between leaving their kids behind or living in fear of deportation. Cruel."]["It’s dangerous and irresponsible to force local police departments to choose between redirecting scarce policing resources to carry out the Trump/Sessions mass deportation agenda or else sacrificing critical violence prevention funds."]["This decision is good news for the rule of law in America. Attorney General Sessions cannot hold hostage the federal funds our police departments count on to fight violent crime in cities like Chicago. https://t.co/NImxAIb4Jr."]["This will tear families apart, damage our economy, and harm U.S. national security interests. I call on the Trump Admin to reverse this heartless decision. #SaveTPS https://t.co/rwHbcR3MaC"]["Since President Trump won't do his job, we will.\n\nSpread the word: Less than 1 month left to sign up for your 2018 health insurance. https://t.co/mVMEjKLwo7"]["We will not stand by and allow the Burmese military to continue their human rights abuses against innocent men, women and children."]["I urge Aung San Suu Kyi to do more for her fellow countrymen and women in a desperate situation. Sadly, she has done too little."]["I’ve introduced bipartisan legislation to impose targeted sanctions &amp; travel restrictions on senior Burmese military officials responsible for the atrocities against the Rohingya."]["The United States will not tolerate the systematic campaign of violence and discrimination against the Rohingya people. https://t.co/PhEFgCfIHk"]["Force $25 billion in automatic Medicare cuts, raise health care premiums, and leave 13 million without health insurance. This is your TAX plan?! https://t.co/TaWcGnG1l0"]["FBI &amp; Homeland Security found ‘white supremacist extremism poses persistent threat of lethal violence’ - responsible for more killings than any other domestic extremist movement. https://t.co/IGGZa1ImiX"]["My Domestic Terrorism Prevention Act would require the federal government to focus on the threat of violent white supremacists. https://t.co/oVV26g87Bo"]["I'll save you a click. It's easy for dangerous people to get guns in America. https://t.co/Bqat9Tk63F"]["It's sad how much this doesn't surprise me. Shameless https://t.co/yl384OoFjt"]["Russia launched a cyber war against our election. They attacked our democracy. We need to be honest about what's at stake, not joke about it. https://t.co/Pc131SzrIl"]["Less than a month left to sign up for your 2018 individual market health insurance – plans may be more affordable than you think. #GetCovered this weekend https://t.co/74XCNDE2rR"]["I’ve introduced legislation to ensure the FBI focuses on the real domestic terrorism threat – violent white supremacists. https://t.co/JmJwVE139C https://t.co/FeeRNNzoPy"]["@POTUS Senate Republicans blocked Obama nominees who had used marijuana after passing the bar. Now they want a more flexible standard for Trump nominees."]["@POTUS That’s not all. Yesterday I said Senate Republicans should be honest and transparent about their effort to change the rules on judicial nominees’ past drug use. https://t.co/ASdaWVK3CM"]["Senate Republicans have decided to give Trump nominees hearings over the objection of home state Senators.  A big giveaway to @POTUS."]["That’s the 100-year-old Senate blue slip tradition, which was respected throughout the Obama Administration.  Senate Republicans used blue slips to block 18 qualified Obama nominations. https://t.co/FoidEk4lNX"]["In March 2009, all Republican Senators wrote to President Obama and insisted that they get to approve nominees from their home states. https://t.co/zKzbZgEQki"]["Senate Republicans are abandoning their own standards to try to ram through President Trump’s extreme judicial nominees. #CourtsMatter https://t.co/5LQhtzS3pZ"]["Best wishes to civil rights icon @RevJJackson in his battle with Parkinson’s disease. https://t.co/CiI2j0Filk"]["@FCC This decision by @FCC also paves the way for the Sinclair – Tribune mega–merger. Simply put, this is bad news for America."]["@FCC What does this mean? Now, corporate agendas will drive your local news instead of the issues &amp; concerns most important to your community."]["Yesterday the @FCC made it easier for big media companies to buy your local newspapers and television stations."]["Republicans: The American people don't like your tax plan. They don't like #Trumpcare. And they don’t want to see their costs rise.\n\nJust give it up already."]["Their cowardly decisions, including  a  ban on political opposition and robbing Cambodians of the right to democratically choose their own leaders, must be reserved."]["Last night, the Senate passed a bipartisan resolution condemning Prime Minister Hun Sen and his cronies for undermining Cambodian democracy. https://t.co/RjNcdr6z0R"]["@ADL_National @AAIUSA @MuslimAdvocates @splcenter Our own federal law enforcement agencies recognize that terrorism is on the rise in our own backyard, and it’s time that Congress take steps to address it."]["Thanks to @ADL_National, @AAIUSA, @MuslimAdvocates, and @splcenter or your work &amp; support on this critical national security issue."]["5 years ago I held first hearing on domestic terrorism threat after massacre at a Sikh temple by a white supremacist.  Watch Harpreet Saini’s compelling testimony here:  https://t.co/rBxkEKVHfK"]["Domestic Terrorism Prevention Act requires annual domestic terrorism report &amp; gives federal &amp; local law enforcement resources and training to counter these threats. Read more: https://t.co/JmJwVE139C"]["Violent white supremacist groups &amp; other right-wing extremists are the most significant domestic terror threat facing the U.S. today. I'm introducing legislation to address that."]["There is never an excuse for this behavior—ever. What Senator Franken did was wrong, and it should be referred to the Ethics Committee for review."]["Yep. https://t.co/iN7TNsS9s3 https://t.co/DRpSOfqMVR"]["Republicans seem like they’re proud of working overtime to raise taxes and health care costs for working families. I wouldn’t be. https://t.co/DSOpoDaRBP"]["@FCC @AjitPaiFCC @SenatorTomUdall @SenatorCantwell Mr. Pai should recuse himself himself from Sinclair-related business until matter is fully investigated."]["We asked @FCC Inspector General to investigate potential quid pro quo between @AjitPaiFCC, Trump Administration, &amp; Sinclair Broadcasting https://t.co/xLYsxt3lJV"]["Just one month left to sign up for your 2018 health plans — deadline is December 15th. #GetCovered today! https://t.co/JIZ9H8j3ds"]["@SenWarren @BetsyDeVosED Our new report details how the DeVos Department of Education is failing defrauded students. Read more here: https://t.co/p1Bl33IIvo"][".@SenWarren &amp; I called out @BetsyDeVosED for refusing to cancel student loans of those defrauded by predatory #4profit colleges. https://t.co/mKty7UbPUp"]["Yesterday in the dark of night, Senate Republicans decided they want to raise your taxes and health care costs at the same time. How have they not learned their lesson? https://t.co/02ndVg9In2"]["Bloomberg: Weakening government oversight of #4profit colleges by @BetsyDevosED is a bad deal for students and taxpayers. https://t.co/1c2TDDaa81"]["Congratulations to Mark Esper — just confirmed as the new United States Secretary of the Army. I look forward to working with him."]["Senate Republicans snuck #Trumpcare in their tax bill. Doctors, hospitals, and patients are united against it — again. https://t.co/1aMviaRnHV"]["The Republican tax plan has gone from bad to worse for working families."]["Tax breaks for the wealthy, higher taxes on working Illinoisans, and now this bill will raise health insurance premiums by at least 10%."]["Republicans now want to pay for tax cuts for the wealthy by taking health care away from 13 million Americans."]["They did everything right but the system failed them. Pleading with @DHSgov to show common sense &amp; a little bit of heart for these young people."]["Because the Post Office failed to deliver on time, Dreamers' DACA applications were rejected. Our government should be better than this. https://t.co/Wt8mtLxS6Q"]["Turns out that Republicans want to raise your taxes and your health insurance premiums in the same bill. https://t.co/bcJY5Nt7dh"]["The Republican tax plan is simple: massive tax cuts for the rich &amp; a gigantic $1.5 trillion hole in our nation’s deficit — and they want you to pay for it. https://t.co/eQPaXF59xF"]["I guess massive tax cuts for the wealthy few is a priority over health care for 9 million children &amp; pregnant women. It's been 45 days since CHIP expired."]["MORNING READ: Senate Republicans are trying to ram through a partisan bill that will raise taxes on their middle-class constituents. Unbelievable. https://t.co/VWbh3pO9yt"]["@FCC The public's interest should come before corporate growth. Rolling back media ownership rules will be a blow to diversity &amp; competition in local news."]["The @FCC wants to allow one company to control hundreds of local broadcast stations nationwide — bad news for America. My letter: https://t.co/rXe7G4XTMs"]["Talley is an unqualified, right-wing ideologue who also did not disclose his marriage to a senior White House lawyer — a potential conflict of interest: https://t.co/FV3wRXIBvT"]["The latest nominee Brett Talley has zero trial experience but Senate Republicans want to give him a lifetime appointment as a federal trial judge."]["Why is it that more and more of these Trump judicial nominees have minimal experience? #CourtsMatter https://t.co/Hp2NG3ZOws"]["@CDCgov The health and well-being of our nation’s veterans should be top priority across the VA. For their lifetime of service and sacrifice, we owe them nothing less."]["According to @CDCgov, smoking is the leading cause of preventable death in the US, and there is no risk-free level of exposure to secondhand smoke."]["I introduced legislation to make the VA smoke-free and protect our veterans from the deadly effects of tobacco use &amp; secondhand smoke: https://t.co/dtkVgDLsPl"]["@shrivercenter @CTBA_online @nasfaa @RooseveltU Congressional Republicans want to bankroll massive cuts for the top one percent on the backs of working families, students, and seniors. We need to do better."]["Thanks to @shrivercenter, @CTBA_online, and Illinois @nasfaa for joining me at @RooseveltU to discuss ways the GOP tax plans would hurt Illinoisans. https://t.co/lC8Jg6e4A7"]["This week, Republicans in Congress continue their rushed, partisan effort to pass tax cuts for the wealthy at the expense of the middle class https://t.co/f3HuiUwLqf"]["MORNING READ: One of the most underreported stories of the Trump Admin are these lifetime appointments for unqualified rightwing ideologues. #CourtsMatter https://t.co/P33cZYrqx2"]["Meanwhile, in Rockford, IL https://t.co/ISRTJ5KOSI"]["Honoring all the men and women who have protected our country at Chicago’s annual #VeteransDay ceremony at @SoldierField https://t.co/mLOwocgd9A"]["He has done nothing to protect us from another Russian attack and is now actively making America less safe. When will his GOP enablers in Congress take a stand for their country?"]["President Trump just took Putin's word over that of the American intelligence community. Frightening on so many levels https://t.co/4TiRNXjFyB"]["This #VeteransDay and every day, we have a duty to uphold the promises we made to our veterans and their families."]["To our veterans: Thank you for your courage and sacrifice for our freedom. https://t.co/hBdE3vYus1"]["Partnership between @USArmy &amp; our research universities is a needed investment in scientific discovery and a boost to Chicago &amp; our nation"]["Proud to join U.S. Army Secretary Ryan McCarthy in Chicago to cut the ribbon on @ArmyResearchLab’s new Central Site at @polskycenter. https://t.co/4R40camKqb"]["@PeterRoskam Sadly, it seems like for @PeterRoskam and @HouseGOP, it's billionaires first and working families last."]["@PeterRoskam llinoisans in Rep. Roskam's 12th district and across the state would see their taxes go up while the wealthy and corporations get a massive tax cut."]["Honoring those who served in the Vietnam War at today’s @ulcchicago’s #VeteransDay ceremony https://t.co/5KxxnYA4my"]["Illinoisans deserve better than the House Republican Tax Plan which @PeterRoskam enthusiastically supports. https://t.co/zcOkXNzKAe"]["The bottom line is it’s easy for dangerous people to get guns in America. Congress has the power to act — and we must."]["Over the last week, more than 600,000 Americans signed up for their 2018 health plans. Have you? Deadline is December 15. https://t.co/rW86Mg65fH"]["Harminder has skills our military couldn’t find anywhere else. Without the #DreamAct, he could be kicked out of the Army &amp; deported."]["Harminder Saini is a Dreamer prepared to lay down his life in defense of our country. Deporting young people like him is wrong &amp; hurts our national security. https://t.co/ttTnQFlho3"]["Our Military and Veterans Education Protection Act is a commonsense bill to hold #4profit colleges accountable and protect our veterans https://t.co/keXsQI1DQ3"]["@SenatorCarper For too long, #4profit colleges have lured our vets &amp; service members with false promises while leaving them with worthless diplomas"][".@SenatorCarper &amp; I are reintroducing bill to close the 90/10 loophole used by greedy #4profits to prey on veterans &amp; service members. Watch: https://t.co/RbV6iTBDvf"]["If Congress fails to pass the #DreamAct, Dreamers could be forced out of our military and at risk of deportation. That is just plain wrong."]["Right now more than 800 Dreamers are willing to serve and lay down their life for the country they love — the only country they know."]["MORNING READ: Former Defense Secretary Gates: Dreamers deserve the opportunity to serve the country they love. We must pass the #DreamAct. https://t.co/lWFz6gaGjm"]["Reminder: The Republican tax plan is based on fake math and the debunked theory of trickle down economics."]["I met with Sister Rosemary &amp; accomplished Illinoisans with developmental disabilities. Disability rights are civil rights. https://t.co/4pbNCSz5gm"]["Republicans in Congress want to add $1.7 TRILLION to the national debt so they can give a tax break to the wealthy few. https://t.co/8zlOv371Lw"][".@SenWarren and I requested information from @CDCgov on the spread of water- and vector-borne diseases in Puerto Rico and the USVIs. https://t.co/d11we3EGip"]["In the wake of Hurricane Maria &amp; Irma, many Puerto Ricans continue to be exposed to unsafe water—including streams and rivers contaminated by raw sewage"]["Good news → General Assembly overrode Governor Rauner's veto of @LisaMadigan's Student Borrower Bill of Rights. New law will provide great protections for IL students. https://t.co/6jYw5fDPUV"]["I joined @SenFeinstein to introduce an assault weapons ban. Weapons of war don't belong on America's streets."]["MORNING READ: The President has surrendered our global leadership. It's now us being left behind by the rest the world. https://t.co/5XV8U2DslQ"]["I'll be on @MSNBC @Morning_Joe in a few minutes. Tune in."]["Data of 2017 mass shootings across America via https://t.co/L1y4A8p7fv"]["311 days into 2017 and America has already seen 307 mass shootings. We can't go back to business as usual."]["@purduemitch And we are still waiting for a reply to our letter asking for clear protections for students to be built into this deal. https://t.co/KdqqSaynGz"]["@purduemitch I’m not the only one with concerns. 300 Purdue faculty oppose deal w/predatory #4profit college https://t.co/4wThMy5rL3"]["Taxpayers &amp; students the ones being \"misled\" by @purduemitch. Embracing predatory #4profit Kaplan poses major risks. https://t.co/Jdw1qT8syi"]["Deporting Dreamers like Ha Eun Lee from the only country she knows is wrong. Congress must pass the #DreamAct before the end of the year."]["2 months since the Trump Administration repealed #DACA &amp; we still don’t have a plan to protect Dreamers from Republican leaders in Congress."]["For #Dreamer Ha Eun Lee, America is her home. She wants to be a lawyer so she can defend the rights of her fellow Americans. https://t.co/xwacHqSo67"]["The President should change his slogan to “America Last.” https://t.co/JTyyUI6ii6"]["93% of gun owners want background checks on every gun sale. Why can’t the United States Congress take this up? https://t.co/Bv0LudbbFe"]["Syria has now joined the Paris Climate Agreement leaving the U.S. as the only country that's rejected it.\n\nThis is embarrassing."]["How many moms, dads, kids, grandparents, friends, loved ones have to die before Congress has the courage to act on gun violence? https://t.co/pSMQHNaEki"]["Make sure to sign up for a 2018 health plan before the holidays sneak up on you – deadline is December 15! https://t.co/wM43riYGt2"]["The Sandy Hook Elementary shooting — 27 dead — was about 5 years ago. To my colleagues: Is it still too early?"]["The Orlando shooting — 49 people dead — was more than year ago. To my colleagues: Is it still too early?"]["The Las Vegas shooting — 58 people dead — was more than a month ago. To my colleagues: Is it still too early?"]["Republicans in Congress say it’s too early to talk about gun violence. But for 26 victims &amp; loved ones in Sutherland Springs, it's too late."]["AFTERNOON READ: The Republican tax scheme would pull the rug out from under older, sicker Americans.  https://t.co/RZEVRt6pxI"]["@POTUS #Trumpcare would have also eliminated coverage &amp; gutted funding for mental health preventive &amp; treatment services → https://t.co/rvuZEKyVfk"]["@POTUS Budget also cuts Medicaid - #1 mental health funder - by over $600B, with an additional $839B cut via #Trumpcare →  https://t.co/ekOUYOaQeG"]["@POTUS .@POTUS 2018 budget cuts $400 million from two mental health agencies and decreases funding for mental-health block grants."]["In February @POTUS &amp; GOP blocked Social Security Administration from sharing mental illness info with the NICS gun background check database https://t.co/P3s4M2Ddc4"]["What does the GOP do with the money from raising taxes on 1/3 of working families? They give a tax cut to big corporations &amp; the wealthy."]["Eliminating or gutting SALT deductions will result in 1/3 of Illinois families getting taxed twice on their income."]["Today I joined local stakeholders in Crystal Lake to discuss how the GOP tax plan would hit Illinois working families especially hard https://t.co/d86k1spnhA"]["94% of Americans (93% of gun owners) want background checks on every gun sale. Retweet if you do too."]["The shooter turned his gun on people -- kids -- in a place of worship. America is in the grips of a gun violence crisis. Congress must act. https://t.co/CIJX3jM3Tq"]["Reminder: You have until December 15th to sign up for 2018 health insurance. #GetCovered today: https://t.co/wM43rjghRC"]["@CDCgov Thank you to all @CDCgov employees who work day in and day out to keep us safe."][".@CDCgov’s hard-working “disease detectives” are on the case—traveling the world to prevent &amp; respond to outbreaks often risking their lives"]["A disease outbreak in a remote village can reach major cities anywhere in the world in less than 36 hours. https://t.co/W7epHUxBi1"]["Recognized those on the frontlines of protecting displaced children in Chicago &amp; around the world at @UNICEF's Humanitarian Awards today https://t.co/B9zS7tpwEA"]["@UChicagoSSA I’ve intro'd bipartisan legislation to give federal judges more discretion in sentencing those convicted of nonviolent drug offenses."]["@UChicagoSSA The War on Drugs didn’t end drug trafficking or addiction. It led to an era of mass incarceration that's unjust and fiscally unsustainable."]["Glad to join #SmartDecar17 at @UChicagoSSA today to discuss ways to break the cycle of recidivism and end mass incarceration"]["The Republican claim that cutting taxes for the wealthiest will benefit everybody else is bogus — and has been proven wrong every time."]["@POTUS To sign up for 2018 health insurance, please visit https://t.co/rW86Mg65fH or call 1-800-318-2596. Sign up today!"]["MORNING READ: @POTUS is trying to discourage you from getting health insurance. Don’t let him. Affordable options available until 12/15. https://t.co/rz1dkX4jOg"]["Republicans are back at it: Trying to ram through a partisan tax plan that caters to the wealthy &amp; leaves working families out in the cold. https://t.co/qP4ZtLDSyZ"]["Latinas are paid just 54¢ for every $1 paid to white men. Equal pay isn't a radical idea, it's a fundamental American right. #LatinaEqualPay"]["Fascinating meeting with Director of the National Cryptologic Museum on the Enigma code machine &amp; the Polish mathematicians who cracked it. https://t.co/eV2peAKRpz"]["I’ve said it before and I’ll say it again: Congress must pass the #DreamAct before the end of the year."]["The Republican tax plan gives massive tax cuts to corporations &amp; the wealthiest while middle class families are left behind. My statement → https://t.co/zZkJ8PvQJ2"]["MORNING READ: @chefjoseandres has served more than 2.2 million meals in Puerto Rico. We need more people like him. https://t.co/zzrl7Bzbzz"]["I'll be on @MSNBC @Morning_Joe in a few minutes. Tune in."]["Bump stock manufacturer Slide Fire has resumed taking orders for bump stocks.\n\nIt's been one month since the Las Vegas shooting."]["@SenDuckworth Thanks to @SenatorBaldwin and @RepSeanMaloney for leading over 200 Congressional members in taking a stand against bigotry &amp; discrimination."]["@SenDuckworth Our brief in the Masterpiece Cakeshop case explains to #SCOTUS why businesses must be #OpenToAll"][".@SenDuckworth and I joined in an amicus brief to support rights of LGBTQ Americans. Discrimination because of who you love is un-American."]["I grew up in a Union household. The Janus case is an attack on workers' right to organize, plain and simple. #StandWithWorkers"]["If you listen closely, you can hear Wells Fargo &amp; Equifax cheering as @POTUS signs away your right to sue big financial companies for fraud. https://t.co/s2x8bkAEMC"]["As a fellow Gang of 8 member, @JeffFlake is right. @POTUS should unite – not divide - us in fight against terrorism. https://t.co/ME9iQKb3dC"]["Illinoisans: To sign up for 2018 health coverage, call @CoveredIllinois at 866-311-1119 or visit https://t.co/GyehtTU831. Retweet to share."]["We must put end to predatory #4profits exploiting veterans, service members, their families. My POST Act does that: https://t.co/CVXh9L25HG"]["MORNING READ: Open enrollment for 2018 health coverage begins today. Sign up early and #GetCovered. https://t.co/WblfzRwA4g https://t.co/y6bRkfr9Tg"]["I’m thinking about the victims and loved ones of this cowardly attack. To the brave first responders and police: thank you. https://t.co/TtDfQzABhY"]["I questioned Facebook, Twitter, and Google about extremist content and Russian disinformation on their platforms. https://t.co/T7VR1P2Hbt"]["Reminder: Open enrollment for 2018 health coverage begins tomorrow. Sign up early! https://t.co/vjwIfDWsyB https://t.co/h7HU4HaXIh"]["@SenateGOP .@SenateGOP turned obstruction into an art form under President Obama. For them to complain about Democratic obstruction is pure hypocrisy."]["Judge Garland not the only victim of @SenateGOP's systematic obstruction. In 2016, they denied a floor vote to 30 non-controversial nominees"]["Senator McConnell likes to complain about Democratic obstruction of judicial nominees. Did he forget about Merrick Garland? https://t.co/7OlvZSlbcN"]["Don't forget about this: It's been more than a month since Hurricane Maria hit and 70% of Puerto Rico is still without power."]["MORNING READ: In the time it likely took you to read this article, six Americans have fatally overdosed on opioids. https://t.co/y7pi0gBkwe"]["I've joined @ChrisMurphyCT to introduce Background Check Expansion Act. Can’t pass a background check? You shouldn’t be able to buy a gun"]["Tom Mauser is wearing the shoes his son Daniel was wearing the day he was killed in Columbine in 1999. Please retweet to share their story. https://t.co/UW0X6eTZRn"]["The proposed Sinclair-Tribune mega-merger would threaten objectivity and diversity of local news &amp; harm competition. My letter to the @FCC. https://t.co/OxsvHs3mOF"]["Good. @POTUS’s attempt to ban thousands of transgender service members harms the military and insults American values. Glad court agreed. https://t.co/JcbmrEagEl"]["@Chicago_Police @ChicagosMayor A few gun dealers in Illinois sell a disproportionate number of guns used in crime. Tougher dealer standards are needed."]["@Chicago_Police @ChicagosMayor Tracing crime guns helps reduce gun violence. Reintroducing a bill soon to encourage law enforcement to take full advantage of gun tracing."]["@Chicago_Police @ChicagosMayor 1 out of 5 crime guns recovered in Chicago came from Indiana — we must crack down on this gun trafficking pipeline"]["New @Chicago_Police &amp; @ChicagosMayor report: 60% of traceable crime guns recovered in Chicago come from out of state https://t.co/uKPwpP3Fzj https://t.co/am2DVbxxkL"]["8 in 10 people looking for insurance on the ACA marketplace qualify for assistance to help keep their premiums under $100 #GetCovered"]["Joined Illinois colleagues at @CookCtyHealth today to spread the word to #GetCovered. ACA open enrollment starts Nov 1 and ends Dec 15! https://t.co/NoVNNxSEue"]["Health insurance open enrollment for 2018 coverage begins Wednesday, but you can review your options now: https://t.co/zdtyHS0maU"]["Retweet and share: 2 days until ACA open enrollment for 2018 health coverage begins. Sign up early! https://t.co/vjwIfDWsyB https://t.co/hkSjDZ5q6b"]["MORNING READ → A reminder that the President wants to raise your taxes so he can hand out a massive tax break to the wealthy few. https://t.co/RhfkDQWK6M"]["Almost a month since CHIP expired and @SenateGOP has focused on: Tax cuts for the wealthy &amp; rigging the system against American consumers"]["Spread the word: ACA Open Enrollment for 2018 health coverage begins November 1st &amp; ends December 15. Sign up early! https://t.co/vjwIfDWsyB"]["Despite @POTUS' ACA sabotage, consumers should know that insurance options &amp; financial help are available.My report: https://t.co/Ngea4RkpSh"]["To review options &amp; buy insurance for next year, please call 866-311-1119 or visit https://t.co/zdtyHS0maU"]["Open enrollment to buy health insurance for 2018 starts Nov 1 and ends Dec 15! Today I joined @memhosp to encourage people to #GetCovered https://t.co/mweoUg4Ojk"]["Congress must crack down on the illegal trafficking of guns and impose strict federal punishments on those who supply guns to criminals."]["Gun trafficking is one of the key drivers of gun violence in Chicago. Republicans: Do more than just hold another moment of silence. https://t.co/w3g25tG7tA"]["In today’s least surprising news, more false claims on immigration from Attorney General Sessions https://t.co/i8dUOfM5Xj"]["We are a nation of immigrants. That’s my story, that’s my family’s story, and that’s America’s story. #WithDreamers https://t.co/BkzwPUq24O"]["Dreamer William Medeiros has enlisted in the Army. He'd never turn his back on the country he loves. How can we turn our back on him? https://t.co/iaeZkT0x2y"]["I wish the #Bahai community of Illinois a very happy bicentenary of the birth of Baha’u’llah. #Bahaullah200"]["@POTUS .@POTUS, your commission says proposal in my bill would be \"the single fastest way to ↑ treatment availability across the nation”"]["@POTUS I've introduced the bipartisan Medicaid CARE Act to lift an outdated barrier that restricts addiction treatment: https://t.co/Jj7dzdfYIW"]["@POTUS .@POTUS needs to quickly invest money and heed his own opioid commission's recommendation to expand access to treatment under Medicaid."]["Glad the opioid epidemic is finally being treated as a national public health emergency. But @POTUS must do more. https://t.co/fS5lOGSi43"]["Trump Admin says they focus limited resources on violent criminals. So why did @CustomsBorder agents target &amp; arrest 10 year old Rosamaria? https://t.co/5orFKB4wCC"]["For years, Filipino veterans weren’t recognized by the US for their bravery &amp; sacrifice. I told Marlon I’ll keep working to right that wrong"]["Marlon Pecson was my guest at the Congressional Gold Medal Ceremony in honor of Filipino Veterans. His grandfather fought in World War II. https://t.co/x9TYHdSkmx"]["MORNING READ: The Republican legislative playbook → keep Americans in the dark to ram through massive tax cuts for the wealthy few. https://t.co/uLj6mMvuma"]["At our constituent coffee, @SenDuckworth &amp; I talked to Illinoisans about the issues most important to them. Looking forward to the next one https://t.co/VMrBCOAhP7"]["If 94% of the American people are ready for comprehensive background checks, why aren't Senate and House Republicans? https://t.co/7CuprxFDA8"]["Sat down with Burmese Ambassador to the US Aung Lynn to call for an end to the atrocities &amp; systematic discrimination against the #Rohingya. https://t.co/0gb2LBRcbk"]["Talked with members of My Sister's Keeper about what we can do together to improve the health &amp; wellness of 21 million black women and girls https://t.co/4zeniS1l7v"]["The President’s idea of “making America great again” is giving tax breaks to companies that ship jobs overseas. That’s in Trump’s tax plan. https://t.co/o1N7ErXRc3"]["It’s simple: If you can’t pass a background check, you shouldn’t be able to buy a gun. Retweet if you think so too. https://t.co/VeRK0p32rM"]["The American people overwhelmingly support background checks (94%). But Republicans in Congress won’t stand up to @NRA and do their job."]["AFTERNOON READ → Late last night Republicans rolled over American consumers for their friends: Wells Fargo, Equifax, and big banks. https://t.co/U06iGNtLNg"]["Let’s pass the Dream Act for these young students and teachers — we cannot turn our backs on them. #DreamActNow"]["DACA recipients are teachers too. If Congress fails to pass the #DreamAct, our school districts could lose an estimated 20,000 educators."]["94% of DACA recipients pursued higher education thanks to the program. Ripping away their chance to follow their dreams is not who are. https://t.co/m5sJfBsKkC"]["72% of DACA recipients are pursuing a bachelor's degree or higher. These young people are the future of our country. #DreamActNow https://t.co/IHR488n6RN"]["Young people in school shouldn’t have to live in fear of deportation from the only country they love. Which is why must pass the #DreamAct."]["NOW: University chancellors and presidents are standing with me to call for passage of the #DreamAct. Watch here: https://t.co/Vk2jC2FsXs"]["My next constituent coffee with @SenDuckworth is this Thursday in DC! Call my office for details: 202-224-2152."]["@SenateGOP @CFPB Republicans to American consumers tonight: We work for big corporations and seedy special interests here in Washington, not you."]["@SenateGOP By voting to repeal @CFPB’s #RipOffClause rule, Republicans refused to hold big financial companies accountable for their fraud or misdeeds."]["@SenateGOP Here’s what happened →Wells Fargo, Equifax, &amp; big banks took away your right to go to court with help from their friends: Senate Republicans"]["Under the cover of darkness and distraction, @SenateGOP just voted to rig the system against millions of American consumers. https://t.co/yz5enqeS8S"]["In about 1 hour, @SenateGOP will throw American consumers under the bus so big financial companies can avoid accountability for fraud. https://t.co/ayFr3FnJpD"]["I called on @POTUS to ensure these monuments remain in their natural condition for current and future generations to enjoy. #MonumentsForAll https://t.co/jRjiNnxmDV"]["Deporting Dreamers who want to contribute to the country they love would not only be a moral disaster but an economic one. Data via @amprog"]["Ending #DACA will cost the United States $460.3 billion in national GDP over the next decade. We need the #DreamAct"]["Wyoming has more than 600 #DACA recipients. Deporting them would cost Wyoming nearly $39.1 million in annual GDP"]["Wisconsin has nearly 7,600 #DACA recipients. Deporting them would cost Wisconsin more than $427 million in annual GDP"]["Washington has more than 17,800 #DACA recipients. Deporting them would cost Washington nearly $1.1 billion in annual GDP"]["Virginia has more than 12,100 #DACA recipients. Deporting them would cost Virginia more than $711.4 million in annual GDP"]["Vermont has 42 #DACA recipients. Deporting them would cost Vermont more than $2.4 million in annual GDP"]["Utah has more than 9,700 #DACA recipients. Deporting them would cost Utah nearly $476.5 million in annual GDP"]["Texas has more than 124,000 #DACA recipients. Deporting them would cost Texas nearly $6.3 billion in annual GDP"]["Tennessee has more than 8,200 #DACA recipients. Deporting them would cost Tennessee more than $347.3 million in annual GDP"]["South Dakota has nearly 300 #DACA recipients. Deporting them would cost South Dakota more than $12.2 million in annual GDP"]["South Carolina has more than 6,400 #DACA recipients. Deporting them would cost South Carolina nearly $252.1 million in annual GDP"]["Rhode Island has more than 1,200 #DACA recipients. Deporting them would cost Rhode Island nearly $61.1 million in annual GDP"]["Pennsylvania has nearly 5,900 #DACA recipients. Deporting them would cost Pennsylvania nearly $357.1 million in annual GDP"]["Oregon has nearly 11,300 #DACA recipients. Deporting them would cost Oregon more than $605.6 million in annual GDP"]["Oklahoma has nearly 6,900 #DACA recipients. Deporting them would cost Oklahoma nearly $343.6 million in annual GDP"]["Ohio has more than 4,400 #DACA recipients. Deporting them would cost Ohio more than $251.6 million in annual GDP"]["North Dakota has nearly 100 #DACA recipients. Deporting them would cost North Dakota more than $8.6 million in annual GDP"]["North Carolina has nearly 27,400 #DACA recipients. Deporting them would cost North Carolina nearly $1.2 billion in annual GDP"]["New York has nearly 42,000 #DACA recipients. Deporting them would cost New York nearly $2.6 billion in annual GDP"]["New Mexico has more than 6,800 #DACA recipients. Deporting them would cost New Mexico more than $384.6 million in annual GDP"]["New Jersey has more than 22,000 #DACA recipients. Deporting them would cost New Jersey nearly $1.6 billion in annual GDP"]["New Hampshire has nearly 400 #DACA recipients. Deporting them would cost New Hampshire nearly $26.9 million in annual GDP"]["Nebraska has nearly 3,400 #DACA recipients. Deporting them would cost Nebraska $150.2 million in annual GDP"]["Montana has nearly 100 #DACA recipients. Deporting them would cost Montana more than $3.5 million in annual GDP"]["Missouri has more than 3,500 #DACA recipients. Deporting them would cost Missouri more than $209 million in annual GDP"]["Mississippi has nearly 1,500 #DACA recipients. Deporting them would cost Mississippi more than $62.3 million in annual GDP"]["Minnesota has nearly 6,300 #DACA recipients. Deporting them would cost Minnesota more than $376.7 million in annual GDP"]["Michigan has more than 6,400 #DACA recipients. Deporting them would cost Michigan more than $418.6 million in annual GDP"]["Massachusetts has more than 7,900 #DACA recipients. Deporting them would cost Massachusetts nearly $606.6 million in annual GDP"]["Maryland has nearly 9,800 #DACA recipients. Deporting them would cost Maryland more than $509.4 million in annual GDP"]["Maine has nearly 100 #DACA recipients. Deporting them would cost Maine nearly $4 million in annual GDP"]["Louisiana has more than 2,000 #DACA recipients. Deporting them would cost Louisiana more than $91 million in annual GDP"]["Kentucky has nearly 3,100 #DACA recipients. Deporting them would cost Kentucky nearly $155.6 million in annual GDP"]["Kansas has more than 6,800 #DACA recipients. Deporting them would cost Kansas more than $335.9 million in annual GDP"]["Iowa has nearly 2,800 #DACA recipients. Deporting them would cost Iowa nearly $188.5 million in annual GDP"]["Indiana has more than 9,800 #DACA recipients. Deporting them would cost Indiana more than $516.4 million in annual GDP"]["Illinois has nearly 42,400 #DACA recipients. Deporting them would cost Illinois nearly $2.3 billion in annual GDP"]["Idaho has more than 3,100 #DACA recipients. Deporting them would cost Idaho more than $159.5 million in annual GDP"]["Hawaii has nearly 600 #DACA recipients. Deporting them would cost Hawaii more than $28.8 million in annual GDP"]["Georgia has more than 24,100 #DACA recipients. Deporting them would cost Georgia more than $1 billion in annual GDP"]["Florida has nearly 32,800 #DACA recipients. Deporting them would cost Florida more than $1.5 billion in annual GDP"]["DC has nearly 800 #DACA recipients. Deporting them would cost DC more than $48.4 million in annual GDP"]["Connecticut has more than 4,900 #DACA recipients. Deporting them would cost Connecticut nearly $315.3 million in annual GDP"]["Colorado has nearly 17,300 #DACA recipients. Deporting them would cost Colorado more than $856.9 million in annual GDP"]["California has nearly 223,000 #DACA recipients. Deporting them would cost California more than $11.6 billion in annual GDP"]["Arkansas has nearly 5,100 #DACA recipients. Deporting them would cost Arkansas more than $236 million in annual GDP"]["Arizona has nearly 27,900 #DACA recipients. Deporting them would cost Arizona more than $1.3 billion in annual GDP"]["Alaska has more than 100 #DACA recipients. Deporting them would cost Alaska nearly $8.6 million in annual GDP"]["Alabama has nearly 4,300 #DACA recipients. Deporting them would cost Alabama more than $182 million in annual GDP"]["THREAD: Why we must pass the bipartisan #DreamAct state by state. Retweet to spread the word."]["MORNING READ: Climate change is costing American taxpayers billions of dollars but the Administration refuses to act. https://t.co/gbuM3q3iaM"]["@POTUS Republicans: put aside your political crusade and support the Murray-Alexander bipartisan agreement to strengthen our health care system."]["Because @POTUS won’t do his job,  consumers should know that ACA open enrollment is from November 1st-Dec 15. https://t.co/mVMEjKLwo7"]["President Trump and Republicans have their hands around the Affordable Care Act's throat. My report: https://t.co/Ngea4RkpSh https://t.co/dNJcaIzHID"]["The Sinclair-Tribune mega-merger is bad news. It will permanently damage objectivity and diversity of local news. https://t.co/EnrdfWsAN4"]["@StateDept Browder came to the Senate in July to testify about Russian election interference– we must not let Putin silence him https://t.co/Z6c8pf0Uen"][".@StateDept should not follow Putin's lead &amp; bar human rights advocate Bill Browder from the U.S. – must review ASAP. https://t.co/2Fgnb0EpIC"]["@Suntimes @POTUS The grim outcomes outlined in my report wont become reality if we take common-sense, bipartisan steps to strengthen our health care system."]["@Suntimes @POTUS To ensure Illinoisans are aware of these cruel efforts, I’ve put together a report on the GOP health care sabotage: https://t.co/15RmtfaenV"]["My op-ed in the @Suntimes: Congress must take steps to improve the Affordable Care Act. https://t.co/zb94m8x9Of"][".@SecretaryZinke has recommended shrinking the size &amp; protections of the Bears Ears and Grand Staircase monuments. Urge @POTUS not to do so."]["I pressed President Trump to protect the Bears Ears and Grand Staircase Escalante National Monuments in Utah. #MonumentsForAll https://t.co/zieV2zwYbY"]["If @POTUS won't spread the word, we will. ACA open enrollment begins November 1 &amp; ends December 15. #GetCovered \n \nhttps://t.co/aA2oP6iJbS"]["MORNING READ: @WhiteHouse claim that their tax plan will give a $9,000 raise to middle class families is a con. https://t.co/dUzdztY994"]["@POTUS → Promote bare-bones health plans that don't cover basic health needs\n\n→Read: https://t.co/15RmtfaenV"]["@POTUS → Slash funding for outreach efforts\n\n→ End cost-sharing subsidies that help keep health care costs lower for families"]["@POTUS → Cancel television and radio ads that educated people about how to enroll for insurance\n\n→ Slash funding for patient navigators"][".@POTUS's health care sabotage step-by-step:\n\n→ Instruct federal agencies not to enforce the law\n\n→ Cut open enrollment period in half"]["Despite Trump’s sabotage efforts, health care consumers should know that ACA open enrollment starts Nov 1 and lasts until Dec 15 #GetCovered https://t.co/6S927YU4VJ"]["@ProtectILCare @SaintAnthonyHos Since his inauguration, Trump has used every tool at his disposal to raise costs and set roadblocks between Americans and their health care"]["Thanks to @ProtectILCare for joining me at @SaintAnthonyHos to discuss how we should be strengthening the #ACA, not destroying it https://t.co/Kz9uRT3WJz"]["Today I released a new report detailing Trump’s deliberate efforts to undermine the ACA and the impact on Illinois: https://t.co/15RmtfaenV"]["MORNING READ: New study by @BUSPH finds states with looser concealed carry laws have more gun deaths → https://t.co/qQuRyh78uo"]["Republicans in the Senate just paved the way to cut Medicare &amp; Medicaid to pay for a massive tax giveaway to the wealthy few. My statement: https://t.co/Dj6nKFeZHH"]["Congress must summon the courage to pass common sense gun reform and this bill should be part of that conversation."]["Gun dealer burglaries are up 48% since 2012. Better security will mean fewer guns stolen by criminals."]["I introduced the SECURE Firearm Storage Act to curb gun violence from stolen firearms. https://t.co/9OUdOHtI1K"]["@timkaine @SenatorCardin ~ 200,000 Salvadorans &amp; 61,000 Hondurans have TPS - valuable contributors to US economy, pay millions in taxes,csupport their communities"]["@timkaine @SenatorCardin Temporary Protected Status (TPS) provides safety to those in the US from designated countries w/ unsafe conditions preventing their return"]["Joined @timkaine and @SenatorCardin in urging the Trump Admin to extend Temporary Protected Status for Salvadorans and Hondurans living here https://t.co/IIAQEr4Jgr"]["@PattyMurray @POTUS I wont stand by as the Trump Administration plays politics with women's health and creates chaos in our health care system."]["Joined @PattyMurray to intro the Protect Access to Birth Control Act. It will rescind @POTUS rule attacking women's contraceptive coverage."]["Get this: To pay for tax cuts for the wealthy few, Republicans want to gut Medicaid by $1 trillion and Medicare by $470 billion. https://t.co/wi6HEwdlth"]["Congressional GOP is so obsessed with their health care sabotage that they've abandoned 9 million kids in need of health care. Disgraceful. https://t.co/X8eKwdPqMz"]["MORNING READ: Americans see right through the President’s empty rhetoric. This tax plan is nothing but a windfall for the wealthy few. https://t.co/quYBGeSSN2"]["I'm on @CNN right now to talk AG Sessions appearance at judiciary committee hearing and next steps on health care. Tune in!"]["Did Attorney General Jeff Sessions collude with @TXAG Ken Paxton to shut down #DACA? He wouldn't say. https://t.co/g9ZZlxz9D8"]["I'll be on @MSNBC with @ChuckTodd in a few minutes to discuss AG Sessions' visit to the Judiciary Cmte and @POTUS health care sabotage."]["Met with my Senate colleagues this morning to discuss humanitarian crisis in Puerto Rico. This Admin must commit to our fellow Americans. https://t.co/5QLXZ3bbKD"]["AG Sessions is forcing Chicago local law enforcement to choose between critical funding for policing or becoming a federal deportation force https://t.co/EXiuYukX4V"]["Reminder: This Republican Congress still hasn't reauthorized funding for health insurance for 9 million kids. Unbelievable."]["MORNING READ: The @WhiteHouse inflated numbers to say that giving tax cuts to corporations helps workers. A complete sham. https://t.co/HpI7SCx7xl"]["Met with UN High Commissioner for @Refugees Filippo Grandi on Rohingya humanitarian crisis and US response to refugees fleeing war &amp; terror. https://t.co/juiOWqVQy0"]["Republicans' idea of a tax plan for working families is giving 80% of the benefits to the wealthiest 1% https://t.co/1yflVIVrFY"]["@BetsyDeVosED .@BetsyDeVosEd has set up a corporate takeover of @usedgov by for-profit colleges, putting students &amp; taxpayers at risk. Enough is enough."]["Illinois &amp; 17 states are holding @BetsyDevosED accountable for illegally refusing to enforce Gainful Employment rule https://t.co/4I0ciQvhgZ"]["@NRA Without action, Congress is complicit in the gun violence taking the lives of thousands of Americans, including children."]["The American people overwhelmingly support background checks. But Republicans in Congress won’t stand up to @NRA and do their job."]["Using bump stocks, shooter turned a concert into a war zone. Congress must ban them — ATF can’t do it on their own."]["It's been 17 days since the mass shooting in Las Vegas. No more silence — It's time Congress acts. #Enough"]["MORNING READ: Without the #DreamAct, college students wanting to serve their country will be at risk for deportation\nhttps://t.co/IMykvgkVjC"]["750 million reasons it’s a good thing that @CFPB is involved in protecting student loan borrowers. https://t.co/PRe7nZFZ7K"][".@WashingtonPost: Bipartisan Sentencing Reform &amp; Corrections Act an important first step to address overincarceration crisis. #CJreform https://t.co/snrTQ75ZeW"]["I've intro'd legislation to support kids address emotional scars &amp; decrease likelihood they become involved in the criminal justice system."]["When I visited Cook County Juvenile Detention Center last year, more than 90% of youth had experienced serious trauma early in their life."]["AFTERNOON READ: Unaddressed childhood trauma can impact a child's long term wellbeing &amp; contribute to cycle of violence and incarceration https://t.co/6Y26ZweTKI"]["Under the GOP plan, 80% of all tax breaks go to the top 1% wealthiest Americans. That doesn’t sound like relief for working families to me."]["The Republican plan eliminates the state and local tax deduction, a deduction that is used by 1/3 of all taxpayers to reduce their tax bill"]["Joined @CTBA_online to discuss how the GOP tax plan would benefit the wealthiest of Americans and hurt Illinois working families https://t.co/c458WXfVII"]["No proper medical care or food. A humanatarian crisis on U.S soil. We must stand with Puerto Rico &amp; the USVIs until they rebuild and recover"]["86% of fellow Americans in Puerto Rico without power. They're drinking water from polluted sites.History will remember this Admin’s inaction"]["MORNING READ: President Trump's sabotage by executive order is the new #Trumpcare. He owns the consequences. https://t.co/UpLTRwncXO"]["The White House is trying to rush the Russia probes. We can’t let that happen. https://t.co/K1jRYRb02U"]["Visited @Rohingyachicago to see some of the important work they are doing to help the community in Chicago and address the crisis in Burma https://t.co/mJyU4HXoxn"]["Stopped by @1milliondegrees at Truman College to see how they're helping low income community college students succeed in school and work https://t.co/7c3YYEYPvN"]["Let me be clear: @POTUS decision to decertify the Iran Deal goes against America's national interest. His own Defense Secretary agrees."][".@POTUS ending ACA subsidies will increase premiums 20% by 2018 &amp; 25% by 2020. This isn't about helping people, it's about hurting people."]["@WoodstockInst @CFPB I’ll continue to push for more comprehensive solutions to predatory lending practices, like my bill to cap outrageous interest rates."]["@WoodstockInst @CFPB With this new @CFPB rule, lenders will be required ensure that a consumer has the ability to repay a loan."]["@WoodstockInst @CFPB Payday lenders offer a quick way to make ends meet, but often with devastating consequences."]["Joined consumer advocates at @WoodstockInst to discuss @CFPB’s new rule to protect consumers from predatory payday loans https://t.co/Y0BWkR5Ve9"]["My statement on President Trump decertifying the Iran Nuclear Deal → https://t.co/IU7tfcfd6a"]["America and the world do not need another nuclear threat. Playing fast and loose with nuclear weapons invites disaster. https://t.co/Jvh3do94RL"]["We must stop the flow of illegal guns into neighborhoods, improve economic opportunity &amp; address trauma in hard-hit communities"]["Thanks to the 7th Circuit Bar Association for hosting this morning’s symposium about efforts to curb gun violence in Chicago and the US https://t.co/lfcVUWxkQT"]["@POTUS These are people’s lives we’re talking about."]["@POTUS As a result of his most recent action, individual market premiums will increase 20% next year. 25% by 2020."]["@POTUS Perhaps @POTUS thinks it's comical or fun to hurt American families out of spite. The actions he's taken this week make it seem that way."]["After failing to convince GOP to pass heartless #TrumpCare, @POTUS now single-handedly destroying our health care system by Executive Order."]["Born into wealth, President Trump has likely never spent a day of his life worried about being able to afford health care for his family."]["The nonpartisan CBO estimates this will raise premiums by 20%. The President is destroying health care to make a political point. https://t.co/XWJSroY1ye"]["Great meeting students at Morton Grove’s Muslim Community Center Academy, including 7th graders who wrote to me about the Rohingya crisis https://t.co/W8vOkL256X"]["Americans support universal background checks by a STAGGERING 94% - 5% (93% - 6% for gun owners). Are you listening, @SenateGOP &amp; @HouseGOP?"]["The worst of politics: For 10 months, @POTUS has been sabotaging your health care for political gain. https://t.co/ilril7Iwtx"]["According to @QuinnipiacPoll, Americans support stricter gun laws 60% to 36% — that’s record high support."]["Met with doctors at @lovellfhcc to hear about challenges and successes they experience in providing care for our servicemembers &amp; veterans https://t.co/vm5C8USONI"]["President Trump is sabotaging America’s health care system and hurting working families to make a political point. My statement → https://t.co/jBxUgxbW7Q"]["Without #DACA and Dreamers, we would lose $433 billion in the next 10 years. America needs the #DreamAct. https://t.co/4nnEquYZjJ"]["@ChicagoCouncil On #DayoftheGirl, it’s an important time to discuss ways we can protect children from traffickers and help those who have been abused"]["Honored to speak at the @ChicagoCouncil’s conference on combatting human trafficking. You can watch live here: https://t.co/M4HVXg9Ezt"][".@POTUS anti-immigrant wish list puts the onus on Congress to pass the bipartisan #DreamAct to protect hundreds of thousands of Dreamers."]["Republicans say they want a regulatory fix on bump stocks. If so, will gun lobby groups pledge not to sue to overturn it?"]["This is a cop out. The Speaker could call up legislation this week to prohibit bump stocks for good. \nhttps://t.co/VfqGsUrZy7"]["@RooseveltU I’ll be introducing the Senate version of @RepSchneider’s SECURE Firearm Storage Act to safeguard against gun dealer thefts"]["@Bradybuzz @MomsDemand @RooseveltU Increasingly, criminals thwart the background check system through straw purchases and theft from gun dealers. We need to address this."]["@Bradybuzz @MomsDemand @RooseveltU Progress on gun safety starts w/ stronger background checks. Must close loophole that lets buyers walk out w/ guns before check is complete"]["Proud to stand w/ @Bradybuzz &amp; @momsdemand at @RooseveltU to call on Congress to act on common-sense reforms to reduce gun violence. #Enough https://t.co/LpoIh4BnA0"]["MORNING READ: Puerto Rico is facing a life and death situation. This crisis is happening on U.S. soil — and we have no excuse for inaction. https://t.co/Kg4XmyZFtI"]["Honored to give the keynote address to celebrate the 20th anniversary of @PSimonInstitute. You can watch live here: https://t.co/MAwLDwAf1g"]["Ending DACA means ripping away doctors, nurses, &amp; health care workers from their patients. To avoid this crisis, America needs the #DreamAct https://t.co/SSH5kvsr3x"]["I will continue to hold Marion VA accountable for implementing reforms that enhance the quality of care for our nation’s veterans"]["Visited Marion VA Medical Center today to meet w/ leadership and concerned staff about the ongoing investigations related to mismanagement"]["I’ll continue to press @SecretaryCarson to ensure those affected by Cairo’s housing crisis get access to the safe housing they deserve"]["MORNING READ: @POTUS holding Dreamers hostage for an anti-immigrant, far-right wishlist. This isn’t a game. Dreamers are people, not pawns. https://t.co/GbTM2seEhG"]["Making thousands of young Dreamers the pawns in the Washington chess game is unfair."]["Thanks to @ActiveRetirees for inviting me to speak today in Chicago about the importance of protecting Social Security, Medicare &amp; Medicaid https://t.co/THOQInwEyX"]["The Administration has chosen politics over science. This is about the world we leave our children. https://t.co/jxNGiq9LNB"]["I thought it was Mexico who was supposed to pay for the wall. Now the President tells us it's the Dreamers."]["My statement on the Trump Administration's immigration wishlist https://t.co/PBki8bRy9P"][".@POTUS handing the reins over a women’s health care decisions to her employer is dangerous and wrong."]["90% of Americans support gun background checks. It’s our responsibility as lawmakers to act."]["Congress must close the so-called “Charleston Loophole” that lets buyers walk out with guns before a check is complete"]["Republicans (so far unsuccessful in throwing millions off health insurance) settle for sabotaging care instead. https://t.co/kSxsQzO9iR"]["@ChicagoState Too many service members return home not only suffering from the physical and mental wounds of war, but struggling to find work or a home."]["Thanks to @ChicagoState for hosting today’s Veterans Stand Down, helping connect veterans in need to housing, employment and more. https://t.co/y699xBSRCL"]["@fly2midway I’ll continue to work with @ChicagosMayor, @TSA, and the airlines to ensure @fly2midway has the resources it needs to continue to grow"]["At @fly2midway to break ground on a new security checkpoint that will create jobs and lead to a safer, more convenient travel experience https://t.co/KubObVmIaE"]["I started my career as an intern for Senator Paul Douglas 45 years ago. Apply to intern for my office here: https://t.co/Zv6dlQuigf"]["@POTUS By eliminating protections for women's health that benefit 62 million, this is the latest in a long list of Republican health care sabotage."][".@POTUS playing politics with contraceptive coverage is an attack on American women, plain and simple. https://t.co/s5g5sx9Gv1"]["We can’t sit back and shrug our shoulders as 30,000 Americans are shot and killed year after year. https://t.co/v677SVsbbY"]["Congress must come together NOW to help these Americans access life-sustaining supplies and rebuild their homes and businesses"]["Our fellow American citizens in Puerto Rico are facing a life and death situation."]["Our priority should be to fund CHIP and our nation’s community health centers immediately. These kids are counting on us to do our job."]["AFTERNOON READ: Health insurance funding for 9 million kids expired under Republican watch. Absolutely disgraceful. https://t.co/KsxkNWk168"]["A bump stock allows shooters to fire at rates between 400 and 800 rounds-per-minute. I will work to close this loophole with @SenFeinstein. https://t.co/uBIdjtkesA"]["Dreamers: you belong here, don’t ever forget it. We will be a stronger and better nation on the day we pass the #DreamAct. https://t.co/NwW5Wo9jdZ"]["@NIHDirector Thanks University of IL Pres. Timothy Killeen, Health Affairs Vice Chancellor Bob Barish &amp; Cancer Center Director Robert Winn for joining."]["Today, I convened an Illinois delegation meeting with @NIHDirector Collins to discuss the importance of NIH funding and biomedical research. https://t.co/dyzDwGvneq"]["@ChuckGrassley @SenMikeLee @SenWhitehouse We may not always see eye to eye, but this bill will help us to uphold America’s promise of justice for all."]["@ChuckGrassley @SenMikeLee @SenWhitehouse Our bill could be a significant bipartisan achievement of this Congress &amp; an important step in our nation’s ongoing quest for justice."]["@ChuckGrassley @SenMikeLee @SenWhitehouse It will reduce taxpayer costs and empower law enforcement to keep dangerous criminals off our streets."]["@ChuckGrassley @SenMikeLee @SenWhitehouse Nonviolent offenders who’ve done significant time will get a second chance to rejoin their families and contribute to their communities."]["@ChuckGrassley @SenMikeLee @SenWhitehouse The goal of this bill is simple: To improve public safety and the rule of law by ensuring that penalties match their crime. #CJReform"]["The most comprehensive criminal justice reform in a generation: Our bipartisan #SentencingReform &amp; Corrections Act →https://t.co/55IiXa6HyS https://t.co/R4yr0346Yy"][".@FoxNews found that 79% of Americans support a path to citizenship for Dreamers. Answer is clear: #DreamActNow"]["And it would result in a $280 billion reduction in economic growth over 10 years."]["The Cato Institute estimates that ending DACA and deporting DACA recipients will cost $60 billion over the next decade."]["Non-partisan Institute on Taxation and Economic Policy: DACA-eligible individuals contribute $2 billion/year in state &amp; local taxes."]["#Dreamers belong here — forcing them out of the only country they’ve ever known will lead to an economic and humanitarian crisis."]["The Trump Administration’s deportation clock is ticking for these young people. We must pass the #DreamAct before it’s too late."]["Beginning on March 5, 2018: 1,400 Dreamers will lose their work permits and be subject to deportation every work day for the next 2 years."]["SOON: @LindseyGrahamSC and I will stand with 100 Dreamers to call on Congress to pass the #DreamAct. Watch here: https://t.co/buuMGZX7Hc"]["Retweet if you agree: The #DreamAct should be the law of the land. Dreamers are #HereToStay."]["Dreamers: We are fighting tooth and nail to pass the #DreamAct. Your country stands with you."]["@ChuckGrassley The American public deserves greater access to the arguments and decisions that will shape our society for years to come."]["My bill with @ChuckGrassley would require television coverage of open sessions of the Court. Read more: https://t.co/VqMSJMCP5D"]["With the Supreme Court back in action, a reminder that Americans deserve greater transparency from the highest court in the land. https://t.co/6U1xGuLMb6"]["MORNING READ: After each shooting, we ask what can we do — but then do nothing. The time for common sense gun safety reform is now. #Enough https://t.co/u7ezmwEZor"]["After a mass shooting in America, there is always a cycle of grief, outrage, and then silence. No more. Not here. #Enough https://t.co/WXvDpIGvb8"]["Dreamers never gave up on this country and this country won’t give up on them. We will pass the #DreamAct so they are #HereToStay."]["@ChrisMurphyCT @SenBlumenthal @amyklobuchar @SenBobCasey Congress must act to prevent the next massacre. #Enough"]["DACA recipients: If your DACA permit expires by March 5, you must submit your renewal TODAY so it is received by the October 5th deadline."]["Encouraged to see the Trump Administration endorse a path to citizenship for Dreamers at today’s DACA hearing. We need the #DreamActNow."]["The Administration’s deportation clock is ticking for Dreamers. We need to pass the #DreamAct now. https://t.co/Zwu0nYefAr"]["Dreamers: your courage inspired us &amp; kept us together. Your faith in the only country you have called home should be rewarded. #DreamActNow"]["Young people like Tereza shouldn't have to live in fear in their own country. It's time to make the #DreamAct the law of the land."]["Tereza was a musical prodigy. Her parents brought her to the United States when she was two, but there was a problem: she was undocumented."]["I introduced the #DreamAct 16 years ago — inspired by the story of Tereza Lee, the first Dreamer. https://t.co/zyclLC0M0H"]["Happening now: Hearing on the future of #DACA recipients. Tune in to watch why we must pass the #DreamAct now → https://t.co/17Tcm7IWGe"]["MORNING READ by @ChrisMurphyCT: Thoughts and prayers aren't enough — As lawmakers, it's our duty to prevent these sickening tragedies. https://t.co/rlbDZBBUTf"]["We're not just casual observers of the gun violence in Las Vegas last night. As U.S. Senators, we can pass laws to make America safer. https://t.co/dWFDKpJzJI"]["AFTERNOON READ: There are millions of Americans without food, water, or electricity right now. It's our duty to help them rebuild &amp; recover. https://t.co/AqGvX6fVsW"]["The notion that there’s no way to prevent gun violence is false—and without action to stop gun attacks, Congress is complicit in them."]["There’s a tendency in Congress to debate how the latest attack could have been prevented. But what are we doing to prevent the next attack?"]["@eriehouse I'll continue to press DHS to extend #DACA deadline, but in the meantime I urge Dreamers who are eligible to renew to do so before Thursday"]["@eriehouse Dreamers were given just one month to collect all of the information required and save the $495 filing fee to reapply for #DACA."]["My thoughts are in Las Vegas with the dozens of victims of this horrific gun attack. What a nightmare."]["By slashing number of refugees, @POTUS is turning his back on Rohingya fleeing ethnic cleansing. This is not who we are as Americans. https://t.co/I3VSPiRCF0"]["Wishing all those observing in Illinois and around the world an easy fast and a meaningful Yom Kippur."][".@SenDuckworth and I sent a letter to @USDA Secretary to quickly provide Puerto Rico with food aid our fellow Americans desperately need. https://t.co/6OyNOWrW1J"]["This is a humanitarian crisis occurring on U.S. soil and it is our duty to provide aid and support to our fellow Americans in Puerto Rico"]["Met with members of the Puerto Rican community in Chicago to discuss efforts to speed federal assistance following Hurricane Maria https://t.co/h6MjSGcyzC"]["Dreamers, do not lose faith. We are fighting to pass the #DreamAct once and for all. https://t.co/mO4DUP0Ei0"]["Trump tax plan would get rid of the estate tax — ripping off working families to boost the wealthiest 0.2%. https://t.co/tBIeXIcWRh"]["Admiral Mullen, former Chairman of the Joint Chiefs of Staff, is right. Slashing number of refugees is un-American &amp; hurts national security https://t.co/wbf8kjffgy"]["MORNING READ: The situation in Puerto Rico is dire. Our fellow Americans need us to act — and act quickly. https://t.co/trGh020fWr"][".@SenateDems are determined to pass the bipartisan #DreamAct so Dreamers can continue contributing to the country they love. https://t.co/rkwtvlC4OU"]["AFTERNOON READ: President Trump's tax plan will give a massive tax cut to the wealthy on the backs of America's working families. https://t.co/hfLJUCGNtl"]["10,000 Americans are about to be without food or water. The Trump administration must act swiftly to provide the critical aid they need. https://t.co/lRHjtbGpSp"]["Congratulations to the NL Central Champion Chicago @Cubs! Winning is sweet—winning at Busch Stadium is just a bit sweeter. #FlyTheW"]["Meeting with Chief of the National Guard General Lengyel about the humanitarian crisis in Puerto Rico. https://t.co/W4nbZqMXbc"]["Congress must act — our fellow Americans in Puerto Rico can't wait. https://t.co/9M0DYhfuhw"]["Proud to join you in this effort to put the power of our political system back into the hands of the American people — where it belongs. https://t.co/Xv8p0SKMZD"]["Unconscionable the Trump Administration is setting the lowest refugee ceiling ever during the worst refugee crisis in history. My statement: https://t.co/YIgb7nZJDN"]["@MWRDGC The McCook Reservoir will ensure access to clean water for millions of Illinois families, protect from flooding, &amp; drive economic growth."]["Students: Tell your colleges to adopt open textbooks. Skyrocketing cost of textbooks shouldn't stand in the way of your education."]["The Affordable College Textbook Act will expand access to open or online textbooks, keeping more money in students' pockets."]["Pricey textbooks are an overlooked barrier to college affordability. I introduced a bill to do something about that: https://t.co/J8tbSSAu8g"]["Hundreds of evacuees from Puerto Rico are arriving at O'Hare. Illinois stands with them. https://t.co/JxEbdsW8tf"]["I joined @BillNelson in requesting an extension of the October 5 DACA deadline. Urge @DHSGov to give #Dreamers more time to renew their DACA https://t.co/nUkE1vurXo"]["Recent storms have devastated areas where tens of thousands of DACA recipients live and many served as first responders in rescue &amp; recovery https://t.co/fXvdcMxFF7"]["The Jones Act was waived for Texas and Florida. @DHSgov must do the same for hurricane-ravaged Puerto Rico. https://t.co/1IbTnFkcr0"]["MORNING READ: Time to work together to strengthen our health care system. Let's do what’s right for the people we serve. https://t.co/cHPCiNFceA"]["It is our duty to provide aid and support to our fellow Americans in Puerto Rico. Congress must act now. https://t.co/ZgluFgaFkJ"]["Republican and Democratic Mayors agree: Congress must pass the #DreamAct for their cities and towns, as well as the entire country. https://t.co/7gpDo91Z5t"]["Met with the IL Primary Health Care Assn—representing IL’s 350 community health centers. Their funding runs out Oct 1 unless Congress acts. https://t.co/ELHXN44Wj8"][".@SenDuckworth &amp; I called on Mitch McConnell and Paul Ryan to take action immediately to provide aid to our fellow Americans in Puerto Rico. https://t.co/BWkUj6RofY"]["Looking forward to my next constituent coffee in DC with @SenDuckworth this Thursday! Call my office for details: 202-224-2152."]["Thanks @AmerAcadPeds @AmerMedicalAssn @IHAhospitals @ACSCAN @AARP @MarchofDimes @ahahospitals @jimmykimmel @NationalADAPT &amp; all who spoke up"]["It's time for Republicans to sit down with Democrats and work to strengthen our health care system—not repeal it."]["Students: Join us &amp; ask your colleges to adopt open textbooks. Pricey textbooks shouldn't stand in the way of your education. #TextbookBroke https://t.co/iNZ1X5R2qO"]["Students and their families deserve to keep their hard-earned money. The Affordable College Textbook Act will do just that. #TextbookBroke"]["The Affordable College Textbook Act will build on how successful open textbooks have been at @Illinois_Alma. #TextbookBroke"]["In the ongoing debate about the rising cost of college, one of the most direct costs to students is overlooked: textbooks. #TextbookBroke https://t.co/eQ1Q3WTz4Y"]["Today, we introduced the Affordable College Textbook Act. Costly textbooks shouldn’t be a barrier to any student's education. #TextbookBroke https://t.co/yqmr4dVqHs"]["AFTERNOON READ: Congress needs to pass the #DreamAct so doctors and nurses can keep caring for their patients:\nhttps://t.co/qbyPL1BywJ"]["Retweet if you'll fight with us to defeat the most heartless version of #TrumpCare yet."]["Dreamers need our prayers, but more than that they need our voices to push Congress to finally pass the #DreamAct."]["I encourage faith communities around the country to sign up now to take part in this year’s #DreamSabbath → https://t.co/lfV8Y7y3zm"]["Six years ago, I launched the first #DreamSabbath with faith leaders to build support for the #DreamAct: https://t.co/h8Lbw2ZqR8"]["#Trumpcare would rip health care away from tens of millions of Americans — one million Illinoisans. Premiums in our state would ↑ by $1,000."]["A hero teacher, quick first responders and a community coming together https://t.co/103tsBMvd9. Proud of response to tragedy in Mattoon."]["Republicans' idea of a “health care” bill:↑premiums, gut protections for pre-existing conditions &amp; rip care away from millions. Cruel."]["I urge Republican leadership to bring the bipartisan #DreamAct to the floor. The Tillis/Lankford bill falls short. My statement: https://t.co/ZHLkx3tcQx"]["Republicans are trying to rush through a secret #TrumpCare bill that would impact every single American. This whole process is a disgrace."]["@POTUS I urge the administration to table their proposal. U.S-made arms should not be falling into the hands of dictators and rogue groups."]["AFTERNOON READ: This move by @POTUS could facilitate gun crimes by human rights abusers and terrorists around the world. https://t.co/zMxUSfOp7k"]["We should be focused on reauthorizing funding for health centers &amp; the Children’s Health Insurance Program before they expire on Oct 1."]["Instead of repealing health care, we should be working on bipartisan improvements to strengthen the ACA"]["The GOP is rushing to vote on #TrumpCare – despite the fact that final bill text is still not available &amp; there’s been no CBO analysis"]["Thanks to @advocatehealth, @ACCESSHealth &amp; @JDRF for joining me to discuss the impact #TrumpCare would have on IL patients and providers https://t.co/8c8wGUsZxk"]["Reminder: Republicans want to ram through #TrumpCare without a non-partisan @USCBO analysis on how many Americans it will hurt."]["It's clear the American people don't want this. As their representatives, Republicans should join us to solve problems, not create them. https://t.co/DhDKA4zjOH"]["Premiums skyrocket, protections for pre-existing conditions gutted, and tens of millions lose their health care. We need to stop this bill."]["MORNING READ: \"Revised\" #TrumpCare, like all cruel versions before it, is still terrible. We won't be fooled. https://t.co/DZ0aSatSJS"]["Public lands like Bears Ears in UT belong to us all. Let's ensure future generations get to experience their magnificence.  #MonumentsForAll https://t.co/adapj1rD2Z"]["Thanks @SouthernUTWild for showing me around Bears Ears &amp; for working to safeguard our magnificent lands for current and future generations."]["Enjoyed my time at Bears Ears in UT, a national treasure. It's our duty to protect our awe-inspiring public lands for generations to come. https://t.co/J3cyiqyfk7"]["#TrumpCare would bring back the days where insurers could jack up costs for people with preexisting conditions like congenital heart defects"]["At @LurieChildrens for Heart to Heart Day - an event to support young children and families with congenital heart conditions https://t.co/NA2uj4wd8q"]["I've been working to increase @NIH funding so researchers can discover ways to slow the progress of Alzheimer's disease and find treatments."]["@alzassociation Every 66 seconds, someone in the United States develops Alzheimer’s disease. #ENDAlz"]["Proud to join 1000s in Chicago today to kick off the @alzassociation's #Walk2EndAlz https://t.co/VHOcCx0A1x"][".@SenateGOP: Doctors, nurses, hospitals &amp; the American people stand against you ripping health care away from tens of millions of people https://t.co/KFDFAKwdze"]["My bill with @AmyKlobuchar would give states resources to protect election infrastructure from future attacks. Republicans: stop blocking it"]["States need the tools to safeguard our democracy from a hostile Russia determined to undermine it. The stakes are too high to ignore."][".@SenateGOP to millions of Americans with pre-existing conditions: We are just fine with insurers jacking up your health care costs."]["The Senate should not race to pass a bill that reorders 1/6 of our economy &amp; impacts every American without analysis from nonpartisan @USCBO"]["Don't believe the spin from Republicans. #TrumpCare would repeal protections for people with pre-existing conditions."]["MORNING READ: Latest #TrumpCare is an age tax. Premiums for an average 60 year old in Illinois could increase by up to $11,777. https://t.co/sQ8UID16Yu"]["Latest #TrumpCare is “even more damaging than the previous Senate and House repeal proposals.” https://t.co/0hSuAU6Luh"]["AFTERNOON READ: Yankees must act now and extend protective netting at Stadium. https://t.co/h1dlOJrxNA"][".@SenateGOP abandoned bipartisan effort to strengthen health care for political gain. This is exactly what the American people are tired of."]["Read her op-ed calling on Congress to act and pass #DreamAct: https://t.co/LQSuxeDN3U"]["Now as President of the University of California, she sees how student and faculty Dreamers just want to contribute to the country they love"]["I met with Janet Napolitano, who as DHS Secretary, did the right thing in extending temporary legal status to Dreamers in 2012. https://t.co/XR6PaF8UlD"]["Pleased to see @CVSHealth taking important steps to address Rx opioid epidemic, which kills 91 Americans every day. https://t.co/pYJrawwed9"]["As Senators, we have access to health insurance. How could Republicans rip away health care from the people we represent?"]["MORNING READ: Rather than strengthening health care for 9M children, @SenateGOP is more interested in ripping health care away from millions https://t.co/CCXyNYX2It"]["Retweet to tell @SenateGOP you stand against their latest #TrumpCare"][".@SenateGOP, America’s doctors are against #Trumpcare. Enough is enough. https://t.co/IJskg9rnDd"]["Warmest wishes to families across the country and around the world celebrating Rosh Hashana. L'Shana Tova!"]["Instead of taking time to fund children’s health insurance &amp; community health centers, @SenateGOP wants to rip health care from millions."]["Passing the #DreamAct is the right thing to do for our economy and for our country. https://t.co/fI9R0jefbF"]["It’s time. We’ve got to get back on the field and fight #TrumpCare tooth and nail https://t.co/dm4Ltn2or4"]["@ChuckGrassley Sentences for nonviolent drug crimes are unfair and wasteful and make us less safe. Our bill will reform these outdated laws."]["We incarcerate more people than any other country on earth. @ChuckGrassley &amp; I are re-introducing the #SentencingReform &amp; Corrections Act. https://t.co/x0aqgdrJMQ"][".@SenateGOP desperate to pass a bill—any bill—but don't care who gets hurt. But the \"details\" are people's lives.\nhttps://t.co/GXAoyv3gi4"]["MORNING READ: #TrumpCare would bring back days when insurance companies jacked up health care costs for those with pre-existing conditions https://t.co/K51CjMMj9M"]["We’re fighting against #TrumpCare because we’re fighting for America. Together — we can win. https://t.co/sLXYTXvVw9"]["Republicans are putting politics over the American people. \nhttps://t.co/o2BhflmnVW"]["An intern in my DC office, Alyssa Mendez is 1st recipient of our Ed Greelegs Scholarship. Looking forward to seeing her bright future unfold https://t.co/sDU6ID66wQ"][".@SenateGOP: Every major medical &amp; patient group stands against your \"health care\" bill. https://t.co/uxpXbCRdJi"]["Illinois would be robbed of $1.4 billion, forcing benefits to be slashed &amp; millions of Illinoisans to lose their health care. https://t.co/Fuz5bkEyHv"]["I don't know how any Senator can in good conscience vote to take health care away from tens of millions of Americans. #TrumpCare"]["MORNING READ: Republicans want to push through a health care repeal bill without knowing how many people it would hurt. https://t.co/2r85N41ieo"]["Retweet if you think Congress should pass the #DreamAct NOW."]["RT to spread the word: working Americans will lose coverage if Republicans ram through latest health care repeal for a cheap political win."][".@SenateGOP doesn't seem to care that Americans have already rejected #Trumpcare. They've brought it back — and it's the worst one yet. https://t.co/bQ71ay5eJw"]["Yet another repeal bill with no hearings, no amendments, no expert analysis. #Trumpcare is back. We must defeat it."]["Ends the Affordable Care Act's Medicaid expansion – hurting children, pregnant women, seniors, and the disabled"]["Eliminates protections for pre-existing conditions\n \nImposes an age tax on those 50+\n \nOpposed by major medical &amp; patient groups"]["By selling junk plans &amp; slashing Medicaid, #GrahamCassidy:\n \nRips coverage from tens of millions of working families\n\nHealth care costs ↑"]["Republicans will try to ram through their health care repeal without knowing how many Americans it will hurt."]["Dreamers, we are with you. Don't lose faith. #HereToStay"]["I first intro'd the #DreamAct 16 years ago to ensure these young people could stay &amp; contribute more fully to the country they grew up in"]["Many JROTC cadets and servicemembers who are DACA recipients are at risk of deportation if Congress does not pass the #DreamAct."]["At @ChiPubschools’ Phoenix Military Academy discussing the #DreamAct &amp; the many contributions of Dreamers in our military &amp; JROTC programs https://t.co/htD1SZVDpe"]["MORNING READ: @SenateGOP trying again to rip health care away from millions of Americans. We must stop them — again. https://t.co/uVn7zHo3Om"]["@POTUS Bipartisan effort to improve health care ongoing but Trump &amp; some in @SenateGOP continuing 7 year crusade to destroy our health care system."]["Reminder: @POTUS is sabotaging the health care of millions of Americans for political gain https://t.co/eY0Ge19loc"]["Celebrating #CitizenshipDay at @hanacenter today and calling on Congress to pass the #DreamAct https://t.co/txHGyi3YzF"]["Sent a letter just last month critizing this coercive move by the Admin that'll only make our communities less safe: https://t.co/B7Amjozu5z"]["Good news: A federal court blocked Attorney General Sessions’ ill-advised effort to hold city violence prevention funds hostage. https://t.co/yvJNv2zsCq"]["See you Sunday https://t.co/mzFOfaWleW"]["I agree with my counterpart @WhipHoyer. More important now than ever to stand up for American values of democracy. https://t.co/8L666BWstb"]["Glad to be at the opening of the new @Amtrak station in Alton - an important upgrade to the Chicago-St.Louis corridor https://t.co/JCShon8hE0"][".@BetsyDeVosED is shirking her responsibility to provide relief for students whose lives were upended by predatory &amp; fraudulent #4profits. https://t.co/6LY3wwdD2k"]["MORNING READ: Bipartisan effort underway to improve #ACA but some in GOP still pushing repeal &amp; @POTUS continues to sabotage our health care https://t.co/dEz9tsDa5b"]["I stand with #Dreamers. Retweet if you do too. https://t.co/xma9N0YqV6"]["@LoyolaChicago Cesar and Alejandra will make great doctors one day. Congress must step up to pass the #DreamAct to ensure that’s in America."]["Dreamers Cesar and Alejandra are enrolled at @LoyolaChicago Stritch School of Medicine. I'm inspired by their courage to share their stories https://t.co/2IcrgMB1sQ"]["Today thousands of Dreamers and their families across the nation are afraid. We must right this wrong and pass the #DreamAct."]["I don’t often agree with @POTUS, but he is right. https://t.co/t6Qj3W7nFi"]["AFTERNOON READ: #Dreamers deserve a shot at the American Dream. They belong here. #HereToStay https://t.co/N54qKkzLGQ"]["@POTUS @SenFeinstein We cannot abandon America’s tradition of giving safe haven to vulnerable families fleeing war &amp; terrorism."][".@POTUS must consult Congress if he wants to lower the number of refugees accepted into the United States. My letter with @SenFeinstein: https://t.co/lCws4LTrwv"]["@Snapchat My friends @RepCheri @CoryBooker @ChrisMurphyCT are already pros at this so tips and advice are welcome!"]["Signed up for @Snapchat today to connect with even more of the people I’m proud to serve in the United States Senate. Follow me: dickdurbin https://t.co/VJrEP8mz2l"]["More than 60 million Americans call rural communities their home. We must do all we can to ensure they thrive."]["We can do that by pursuing creative solutions for the opioid epidemic and providing better access to health care and the internet."]["Almost two-thirds of Illinois' counties are rural and we must address the challenges facing rural areas."]["Today, I attended the Democratic Rural Summit with my guest Richard Burns — a corn, soybean, alfalfa, &amp; beef farmer from Kickapoo, Illinois. https://t.co/XptotQxrsR"]["It's been 16 years since I introduced the #DreamAct. Retweet if you agree: this year, we get it done."]["America's relationship with Ukraine has never been more important. Proud to co-chair the #Ukraine Caucus with you, @senrobportman. https://t.co/iRwHZEehMO"]["MORNING READ: #Dreamer Saba Nafees:\"I want a chance to pay my country back for everything it gave me.\" https://t.co/FldQMp2WSg"][".@POTUS must not abandon the American tradition of giving safe haven to the most vulnerable fleeing war &amp; terrorism. #RefugeesWelcome https://t.co/2Uctm1BtCU"]["Let’s be clear: For Dreamers, America is their only home. It is un-American to tear them away from it."]["Let’s show the American Dream is still alive by passing the #DreamAct. https://t.co/tz90j5lHaw"]["Cristina starts @TeachForAmerica next summer. Without #DACA or #DreamAct, she'll be forced to leave her students. https://t.co/q3Axlb4jRP"]["Deporting young people like Harminder is not only immoral and cruel, it is against our national interest. We must pass the #DreamAct NOW."]["I shared Harminder Saini's story on the Senate floor — a Dreamer prepared to die in defense of our country. https://t.co/2Q3tNM87nR"]["It's our duty to step in on behalf of innocent Americans wronged by Equifax. Thank you @SenFranken and @SenCortezMasto for your work on this https://t.co/jZ5siPR3q2"]["MORNING READ: Dreamers just want to serve their country. We won't give up until they can. https://t.co/kekYae5Iqm"]["The moment of reckoning is here. We need Republican leaders to join us and make the #DreamAct the law of the land. https://t.co/xN0t1ygLzN"]["RT if you agree: Congress must pass the #DreamAct to protect 800,000 Dreamers from being rounded up &amp; deported from the country they love."]["Passing the #DreamAct is the right thing to do for America. https://t.co/TYonnYUPYF"]["Hope move will be followed by dropping of all charges and an end to his house arrest."]["Welcome the release of Mehman Aliyev, the director of Turan, Azerbaijan’s last remaining independent news outlet."]["MORNING WATCH: Bono's got it right →\"This country was built for and by #Dreamers.\" https://t.co/6j3fjLv4yN"]["The horrific morning of 9/11/01 was one of the worst in our history. The heroism in its aftermath was the very best of America."]["Beautiful day in Chicago for the 26th Street Mexican Independence Day Parade &amp; breakfast with the Little Village Chamber of Commerce https://t.co/88y9vS9HHg"]["Thinking about the people affected by Hurricane Irma. Please be safe and know the entire country is with you."]["We MUST pass the #DreamAct and do what's right for 800,000 Dreamers, their families, the communities they serve, and the country they love. https://t.co/S97hY4ommp"]["Good luck to Rock Island native @Madison_Keys in the @usopen final today! Illinoisans will be watching as you serve your way to victory."]["My thoughts are with the people in Hurricane Irma's path. Illinoisans stand ready to assist and support those affected in any way we can."]["Retweet to tell Congress to bring the #DreamAct to the floor NOW."]["Their courage and strength inspires us all. We won’t stop fighting. #withDreamers https://t.co/5492NUzhZO"]["@IABH_1967 Had the GOP's ACA repeal succeeded, mental health and substance abuse treatment would no longer be designated as essential health benefits"]["@IABH_1967 In the face of an opioid epidemic, only 12 percent of Illinoisans who need substance abuse treatment actually receive it."]["Spoke at @IABH_1967’s conference today to discuss the importance of expanding &amp; improving mental health &amp; substance abuse treatment"]["Kris Kobach's half-baked conspiracy theory on voter fraud in New Hampshire is disqualifying. https://t.co/zU28p5HBsT"]["I talked to the New York Times about my 16-year history with the #DreamAct. Congress must pass it NOW. https://t.co/0ffLqPTUwg"]["Great meeting students at Hadley Jr High in Glen Ellyn today to learn more about their project regarding energy drink consumption in youth https://t.co/TSela08zR7"]["Under Trump and @BetsyDeVosEd, the United States government is turning its back on campus sexual assault survivors. https://t.co/XWIvmWslyZ"]["I’m confident that if the GOP brings the #DreamAct to the floor, it will pass both chambers. Congress must act on this bipartisan bill."]["I first intro'd the #DreamAct 16 years ago to ensure these young people could stay &amp; contribute more fully to the country they grew up in"]["@LoyolaHealth DACA opened doors for 800K young people, including 32 current med students at @LoyolaHealth. Trump's decision puts their status in jeopardy"]["Proud to stand with #Dreamers at @LoyolaHealth to call on GOP Congressional leaders to bring the #DreamAct to the floor. https://t.co/FxMKdi8Vti"]["President Trump’s travel ban will always be unconstitutional and un-American. https://t.co/FBJ1ZWNyyx"]