["Congrats again to my friend and colleagues @RepDonYoung for becoming Dean of the House. https://t.co/j3BWUGeBJo"]["I applaud @POTUS EO to expand mental health benefits &amp; care for our veterans.It’s our obligation to pursue all of the causes and all of the factors that contribute to the scourge of veteran suicide, and bring it to an end. https://t.co/aXaHcLgUao"]["When I look out at 2018, I am struck by one overriding feeling for our state: optimism. There are numerous reasons for this. Read my op-ed on the many positive things happening for Alaska and the nation --https://t.co/cawtWSIviv https://t.co/ldqClmtzqA"]["Historic tax bill is all about jobs, growing the economy &amp; allowing middle class families to keep more of their hard earned dollars. It's already having a real impact, w/ businesses across the country reinvesting in their employees &amp; in their communities. https://t.co/p52L9Go1iS"]["Earlier today, I spoke with @DanaPerino on a number of issues, including North Korea, military readiness, and the recent change to federal marijuana enforcement policy.\n\nhttps://t.co/qkkn2XLkuR https://t.co/zHEVUF7lEZ"]["https://t.co/uqnKdvZxxL"]["Happy Birthday Alaska! Fifty nine years ago — as a result of tremendous work by Alaskans and allies across the country — Alaska became the 49th state to join the Union. https://t.co/EjHbfrfwPO"]["@OrrinHatch is a true American statesman who has represented the state of Utah with dignity &amp; grace for over four decades. He has also been a steady and strong friend to Alaska. I'm proud to call him my colleague &amp; my friend. He'll be greatly missed."]["As protests in Iran continue, I share my support for the brave men and women who are speaking out against a corrupt regime and the leaders of the world's largest sponsor of state terrorism."]["Earlier today, @POTUS signed H.R. 1 into law -- opening ANWR's 1002 to responsible resource development and exploration. https://t.co/3vQ7yp5STk"]["This historic moment, opening ANWR to responsible resource development, is good for Alaska and good for the nation. Today, I told Fox News' @TeamCavuto exactly why Alaskans are so proud of this major achievement.\n\nhttps://t.co/lUGAxdiPs8 https://t.co/jR7KvUPd2r"]["BIG NEWS: Congress just sent @realDonaldTrump legislation to unlock ANWR's 10-02 area for responsible energy development and exploration. Historic moment for Alaska and the nation! https://t.co/j50rcJsxS0"]["Live on @radiostieren to discuss historic passing of legislation to open ANWR's 10-02 area to resource development."]["For decades, AKns have fought for the right &amp; opportunity to allow for responsible resource development in ANWR's 10-02 area. But for decades, we’ve been denied that right. Today that changes! https://t.co/4jWDnz4Fzj"]["Just voted to cut taxes for middle class Alaskans and at long last, open the 1002 area of #ANWR for responsible resource development -- a decade's-long effort!"]["I'll be speaking on the Senate floor in support of the H.R. 1, the Tax Cuts &amp; Jobs Act, legislation that updates our nation's outdated tax code and unlocks ANWR's rich energy resources in the 1002.  Tune in! This is an important moment for AK &amp; the nation https://t.co/5weSBnMmE8 https://t.co/CYK6EI7kLb"]["On Dec. 11th, Alaska lost a son, respected noncommissioned officer and revered team leader, Staff Sgt. David T. Brabander to a vehicle accident in Afghanistan. We will keep his family and loved ones in our thoughts and prayers during this difficult time. https://t.co/wI05RvwniH"]["Tonight, the first candle on the on the menorah will be lit, reminding all of us how the Jewish community has spread their light around the world and to us here in Alaska. Happy Hanukkah to all! https://t.co/tPLOv4FdVw"]["Great story about the historic Great Alaska Shootout and my Alaskans of the Week, the UAA’s women’s basketball team—a Division II powerhouse. As my UAA grad staffers say, “It’s a great day to be a Seawolf!” #SeawolfNation  \nhttps://t.co/37mNwlGM9e"]["77 years ago, America experienced “a date which will live in infamy,” with the devastating attack on Pearl Harbor. We honor the 2,403 Americans we lost that day and we thank the brave men and women who answered our nation’s call, ensuring that freedom would endure for all of us. https://t.co/xWhUCiKJ3h"]["@KSRM recently featured a story on a hearing I held on the nominee to become the next NOAA administrator.  Of the many issues raised-- the misguided practice of locating Alaska-based NOAA personnel, infrastructure and missions outside our state. https://t.co/Yr7k9LCfzN https://t.co/HQfXUuzvXl"]["I applaud the International Olympic Committee for taking this decisive action against Russia and their state-sponsored doping program. See my full statement https://t.co/hKclyzXimj"]["Big day for @repdonyoung. Not only was he named to the Conference Committee tasked with negotiating the final terms of the tax and ANWR bill, but he also became the Dean of the House. Congrats &amp; here’s to many more yrs of success for AK &amp; the nation! https://t.co/T7nUHdtvNc"]["Tonight, the Senate passed legislation to open the 1002 area of ANWR to exploration and development. It’s an important milestone, one that brings us one step closer to truly unlocking Alaska’s energy potential and achieving historic tax reform for American families. https://t.co/ymbQPVgBn0"]["I spoke w/@RebeccaPalsha @ch2ktuu on a number of important issues currently before Congress &amp; the nation, including efforts to hold North Korea accountable, the passage of the NDAA &amp; tax reform. https://t.co/20pYTHmCF7"]["I was honored to attend the @SpecialOlymAK Bowling Tournament this weekend w/ my wife Julie &amp; our daughters. It's always amazing to spend time w/ our friends at @SpecialOlymAK There is no better example of pure heart, enjoyment of sport &amp; comradery. Thanks 4 having us &amp; congrats! https://t.co/DRbpOJyisG"]["Huge congrats to my former D.C. Intern, Samantha Mack for being named a 2018 Rhodes Scholar. Originally from King Cove, Samantha has not only excelled in her academic career at UAA, but she is now their 1st student to receive this prestigious scholarship. Best of luck at Oxford! https://t.co/saVanvVkMK"]["Not only did I turn another year older this month, so did the United States Marine Corps, celebrating its 242nd birthday. The famous USMC Mascot, Corporal Chesty XVI stopped by the Senate yesterday to celebrate! Semper Fi! https://t.co/fxIcwmrtpX"]["Congratulations! Sawyer Marie is lucky to have such great grandparents. https://t.co/33P2TH7gp8"]["Great news for AK and the country &amp; thanks @lisamurkowski for your leadership. https://t.co/riBc9l1Yex"]["Matthew Rexford from Kaktovik only village in ANWR says 2 continue 2 lock up resources in area is like saying “it’s okay for everyone else in this country to have a THRIVING economy, but you can’t have one at all.” I agree w/@lisamurkowski. His voice needs to be heard #1002 #ANWR"]["Thanks for stopping by @SteveDaines! https://t.co/5NPkoZnO65"]["Had your morning cup of kuukpiaq to go w/ tasty muqpaurat? Kudos to ACC in AK for preserving indigenous languages!  https://t.co/PQY4ueNmT3"]["Powerful testimony from Matthew Rexford of Kaktovik, only village in #ANWR re opening #1002 4 jobs &amp; hope 4 Kaktovik https://t.co/yB0FJ6DeQX"]["Great point by @Sen_JoeManchin: Point Thomson, 2 miles from #1002Area is in same ecosystem &amp; is being developed responsibly. #ANWR"]["@SenJohnMcCain Opening #1002Area of #ANWR with most stringent enviro standards &amp; most advanced technology in the world will produce more American energy!"]["@SenJohnMccain &amp; I met w/senior Russian dissident &amp; asked: How can we counter Putin? Answer: Produce more American energy! #ANWR"]["Energy is used as a tool for good, productive diplomacy &amp; for troublesome power-grabs by our nation’s foes like Russia. #1002area #ANWR"]["Producing more energy in US will dramatically increase our country’s national security. #1002area #ANWR"]["When development in AK is killed capital goes to Nigeria, Venezuela, Iran &amp; Russia—places with very few enviro standards #1002Area #ANWR"]["In AK we have the highest environmental standards and most advanced technology. #1002Area #ANWR"]["Going on Rick Rydell now to talk about the #ANWR hearing. Tune in here: https://t.co/mFQBvnPOfL"]["Per @AkGovBillWalker: As other states develop resources ON the ground, AK must be allowed to develop our resources IN the ground. #1002Area"]["Nobody in Congress cares more about Alaska environment than @repdonyoung, @lisamurkowski and me. #1002Area #ANWR"]["If you're having problems following the link for #ANWR hearing, click here: https://t.co/D5oH5ypDwI"]["Opening up #1002Area of #ANWR hearing in @EnergyGOP starting at 9:30 ET. Many great Alaskans testifying. Tune in! https://t.co/lYtrWo3AbH"]["Watch great Alaskans testify re: AKs whaling culture &amp; necessity to keep tradition alive 4 culture &amp; food 4 families https://t.co/bGhi0x3HrJ"]["Next month former Fairbanks Goldpanner pitcher &amp; current #WorldSeries2017 coach, Bret Strom will be coaching in AK! https://t.co/e727ic8gYs"]["S/O to Alaskan @JamesGilchrest1 for his service and support for veterans and military families through his @NewmansOwnFdn fellowship. https://t.co/mulLuksEDg"]["Thank you @POTUS for declaring the opioid crisis a public health disaster &amp; @AkGovBillWalker for joining me in DC for this significant event https://t.co/oKbrvLGhyV"]["This is an #Alaskaproblem if I've ever seen one. You'll be glad to know the 450 lbs seal was successfully returned to safety. https://t.co/Z4SgVhvqDu"]["My statement on @POTUS decision to not certify the #IranDeal https://t.co/3zcvuak1xE"]["It's a beautiful tradition to witness, and there is no healthier or better tasting food in the world!"]["One woman who knows salmon is my wife, Julie. For generations, her family has fished the Yukon &amp; passed down knowledge of preparing salmon. https://t.co/HfbF2W3MdL"]["Senator @lisamurkowski &amp; I passed a Senate resolution recognizing September as \"#Alaska Wild Salmon Month.\""]["I had the honor of recognizing an extraordinary woman, Rozann Kimpton of Wasilla, as our Alaskan of the Week. https://t.co/azzWN0Vzfq"]["This was a big week for the @USMC. #Marines https://t.co/sKiL9uXjcE"]["I've joined bipartisan effort to simplify the National Suicide Prevention Hotline, vital resource for those in need. #SuicidePreventionMonth https://t.co/0cCJDbu4jO"]["Weigh in on your favorite pics of the Great One and Alaska’s world-renowned Denali Park! https://t.co/Pz5GijV140"]["Glad to have Rep @SteveScalise, a patriot and strong public servant, back in Congress. https://t.co/URfj8u6M1z"]["@SenBillNelson Glad to see @uafairbanks, @SitkaTribe &amp; @sardfa among recipients of $742,941 @NOAA award to preserve Southeast #Alaska geoduck clam fishery."]["@SenBillNelson HABs, produced when certain colonies of algae grow out of control, pose real threat to marine life, including shellfish &amp; marine mammals."]["My statement on the Graham-Cassidy Senate healthcare reform proposal. https://t.co/g1skp0MlG0"]["Congrats to the 1st female Marine to graduate from Infantry Officer Course, an outstanding accomplishment that will inspire women worldwide! https://t.co/29gG49kl0Q"]["Flashback to some great fishing on the Yukon over Labor Day weekend. #flashbackfriday https://t.co/WEJv8WbTdS"]["#ShanahTovah to Alaska’s Frozen Chosen celebrating #RoshHashanah this week! https://t.co/70wLsBzFbR"]["Kudos to @USArmy #Alaska 1LT Charles Bierwirth who snapped stellar shot of Strykers training under Northern Lights near Ft. Greely. https://t.co/ypRMWrkCzi"]["I spoke with @TeamCavuto about the #GrahamCassidy proposal to send federal healthcare dollars back to the states. https://t.co/JORdvFKbRl"]["Importantly, FY18 #NDAA also includes a well-deserved across-the-board 2.1% pay increase for U.S. Soldiers, Sailors, Airmen &amp; Marines."]["With up to 6 new icebreakers authorized, #NDAA improves U.S. #Arctic capabilities amid new commercial activity &amp; Russia's military build-up. https://t.co/lnosB68Vpz"]["In passing #NDAA, Senate also approved my amendment with single largest authorization of icebreakers ever, critical to #Arctic presence."]["My #NDAA missile defense amendment includes increase of up to 28 ground-based interceptors (GBIs), incl. up to 20 at Ft. Greely #Alaska."]["U.S. missile defense is vital as Kim Jong-un in 6 years has conducted more nuclear &amp; missile tests than his father &amp; grandfather combined. https://t.co/Um0J1BLoHx"]["FY18 #NDAA includes vast majority of my missile defense bill, and shows the Senate is serious about defending our homeland from #NorthKorea."]["The Senate sent powerful message to our Armed Forces, allies &amp; adversaries that we intend to substantially increase military funding. #NDAA"]["At a time when global threats have grown in number &amp; severity, our defense budget has declined 24% over the past several years. #NDAA"]["The overwhelmingly bipartisan passage of FY18 #NDAA is a significant &amp; long overdue step toward rebuilding America’s military strength. https://t.co/Ui0khsFtne"]["I'm joining @TeamCavuto on @FoxNews momentarily to discuss President Trump's address to the UN this morning."]["Wishing all of Alaska’s brave airmen – active, reserve, guard, and veteran – and their families a Happy #AFBday! https://t.co/wcORDX31EP"]["On #POWMIA Day we keep in mind the brave men &amp; women in uniform who’ve gone missing or been held captive while in service to our country. https://t.co/Pw6k9jqnWk"]["#Alaska lost great matriarch in Ermalee Hickel who'll be remembered as wonderful mother,  active community member, &amp; role model for us all."]["On #Senate floor discussing need to pass the #NDAA, which includes critical funding for missile defense. Watch live: https://t.co/gw7r5pSIsb"]["On #PatriotDay, let's #NeverForget those who sacrificed, pray for those they left behind, &amp; rekindle unity we experienced on that grave day."]["… and the brave men and women of the U.S. military who brought the fight to the enemy and have kept the homeland safe."]["1st responders racing into burning buildings, everyday Americans sacrificing their lives to protect neighbors &amp; prevent further mayhem..."]["Terrorists were gravely mistaken about our resolve. What emerged was a bravery &amp; compassion that for centuries has defined American spirit."]["16 years ago on #September11, America was faced with attack of unspeakable evil &amp; cowardice that took lives of 1000s of our fellow citizens."]["I commend the many Alaskans who've helped victims of #HurricaneHarvey, &amp; now support fellow citizens in danger along eastern Gulf Coast."]["To help victims, @FEMA recommends donating to reputable recovery organizations where 100% of your resources go to relief efforts."]["Julie &amp; I are praying for people of Florida as they weather through #HurricaneIrma, &amp; for Caribbean communities already devastated by storm."]["You can watch the ceremony live via a 360-degree live-stream provided by U.S. Army Alaska: https://t.co/fdqhmdJB4a"]["Alaskans could not be more proud of these Spartans as they prepare to deploy in support of Operation Resolute Support. https://t.co/IsKZf7XKOM"]["I'm out at JBER to help give a strong send-off to brave men and women of the 4-25 Infantry Brigade Combat Team deploying to Afghanistan. https://t.co/cpBUP9S0bU"]["Girls and I had a blast in Resurrection Bay – even clouds were foreshadowing a day full of “bites.” Sure enough, we came home with a haul. https://t.co/RMeOFgtUi6"]["A big thank you to Alaska's hard-working men &amp; women. You make our state best in the country and our country best in the world. #LaborDay https://t.co/TJHWTgcvBr"]["Had great time at @MSBSD Mat-Su Career-Tech High, touring the school &amp; meeting with bright young Alaskans in Mr. Lanphier's history class. https://t.co/ycimNovZl2"]["Bittersweet day seeing our staff assistant Xavier go. Wishing him all the best in next adventure, pursuing master's degree at @UniofOxford. https://t.co/OBAffGd5Dp"]["I appreciate the inspiring work being done by the mentors, #Alaska Dept of Law, Court System &amp; other partners 2 change lives for the better. https://t.co/s6ZAOXCOpZ"]["Program brings together attorneys, mentors, providers &amp; judges to ensure justice is served while giving veteran opportunity to rehabilitate. https://t.co/JJ0MOVXsAT"]["Checking out the 1,231-pound winning pumpkin, &amp; enormous runners up at the @AlaskaStateFair. How much pie do you think these could make? 🍽 https://t.co/rPTYowNeUo"]["Never gets old waking up to a momma moose and her calves relaxing in the back yard! https://t.co/wazxjpj7RB"]["Spoke w/ @KyungLahCNN on need to strengthen reliability, capability &amp; capacity of US missile defense in light of threat from #NorthKorea. https://t.co/y8WjFBqyDk"]["Great piece by @KyungLahCNN on @CNN highlighting Ft. Greely &amp; #Alaska Guard’s 49th Missile Defense Battalion—the 300 protecting 300 million. https://t.co/VaCLL9CxaS"]["For years, Alaskans have been calling for the life-saving King Cove road. The mayor &amp; residents have a message for DC: Let’s start digging! https://t.co/2vcFlPxDik"]["I'll be cohosting the world famous Dave Stieren Show today from 4-5:00pm. Tune in on AM 750 @KFQD, or at: https://t.co/H94LNlxnaw"]["@USDOT @SecElaineChao .@SecElaineChao heard about the unique challenges we face moving goods &amp; services, but also the immense opportunities we have in Alaska."]["I want to thank all who attended the #Alaska Transportation Summit I hosted last Thursday in Anchorage with @USDOT @SecElaineChao. https://t.co/uqIEOo4Uvk"]["Grateful for @RedCrossAK, brave men &amp; women of #Alaska Guard &amp; @USCG, &amp; all Alaskans heading south to help those in need. #HurricaneHarvey https://t.co/1L1qaWJt1T"]["I want to thank @POTUS for signing #Veterans Appeals Improvement and Modernization Act - overdue step to improve #VA appeals process. https://t.co/Z9F7GEKxUa"]["I am live on the #Kenai hosting a @SenateCommerce hearing on the Magnuson-Stevens Act and fisheries management: \nhttps://t.co/mr0GyGWNT0"]["Great pick by @GUPolitics. @mikedubke has a lot of knowledge &amp; insight to offer my fellow #Hoyas. #HoyaAlum https://t.co/ZS6cuK6Ot3"]["@CNORichardson @USNavy We need @SASCMajority oversight hearings – we are losing too many of our nation’s finest to operational &amp; training accidents."]["I fully support @CNORichardson's global operational pause for the @USNavy in wake of this tragedy &amp; #USSFitzgerald collision in June."]["Thoughts and prayers are with the missing and injured sailors of the #USSJohnSMcCain and their families today. https://t.co/3uy4wUR09t"]["Glad to recognize Kathy Heindl, who devotes her summers to cleaning the Kenai River &amp; educating anglers, as our Alaskan of the week. https://t.co/GJfMa2eSDR"]["#Alaska is home to 160 community health centers, constituting 10% of the CHCs in the country, &amp; serving more than 100,000 Alaskans annually."]["Thank you to the staff at the Anchorage Neighborhood Health Center for incredible work you do, &amp; for inviting me to celebrate #NHCW17. https://t.co/ZVQGwxniCt"]["America stands together with our friends in #Spain in mourning the loss of their fellow countrymen."]["The scourge of radical Islamist terrorism has taken so many innocent lives, but our resolve to defeat them &amp; defend freedom will not waver."]["Our hearts go out to the people of #Spain in the wake of this morning's tragic terrorist attacks in the streets of #Barcelona."]["Appreciated the tour of @BloodBankofAK, a vital resource for Alaskans &amp; health institutions across the state, especially in times of crisis. https://t.co/7kO8ZDmXS7"]["Anything less than complete &amp; unambiguous condemnation of white supremacists, neo-Nazis, and the KKK by the @POTUS is unacceptable. Period."]["@NOAADebris @GoAKorg Legislatively, our next objective is moving the #SaveOurSeas Act through the House and to the President's desk. https://t.co/NWtRptwdjE"]["@NOAADebris We had a great discussion with Chris Pallister, director of @GOAKorg, &amp; Molly McCammon, director of the #Alaska Ocean Observing System."]["Honored to welcome @NOAADebris Director Nancy Wallace to #Alaska. Our state feels brunt of #marinedebris crisis due to massive coastline. https://t.co/rm2X2HIlbN"]["As Americans, we must always remain united against those seeking to divide us."]["What's going on in #Charlottesville is deeply troubling. We should never tolerate hatred &amp; bigotry."]["Looking forward to working with the @SenateMajLdr and his leadership team to get the job done."]["Senate has critical work to do on behalf of the American people this fall. Cooperation from Executive Branch, not infighting, will be vital."][".@potus Mr. President, on #NorthKorea, we need calmness, credibility and strategic focus. Robust homeland missile defense is also critical."]["The cowards who attack our fellow Americans because of their religion should be prosecuted to the full  extent of the law. https://t.co/Qbj59OWExf"]["Had great time w/ #veterans service orgs celebrating Senate's passage of #ForeverGIBill eliminating expiration date &amp; expanding eligibility. https://t.co/wqKAcJHyfD"]["On behalf of a grateful state and nation, I want to wish all members of the @USCG a Happy Birthday! #SemperParatus https://t.co/8MCe4DrKuN"]["Honored today to recognize Mark Braudis, an extraordinary man who overcame great odds to raise his family, as our Alaskan of the week. https://t.co/1xUtskANG1"]["Had great chat w/ Sen. @lisamurkowski's summer interns. Excited to see what the future has in store for these exceptional young Alaskans. https://t.co/PFNldX0w5J"]["I'm chairing a @SenateCommerce Subcommittee hearing on the Magnuson Stevens Fishery Act. Watch live at: https://t.co/ukkBW6rROw https://t.co/XsFIhzb7Zh"]["Wrapping up a great weekend in Ketchikan, Klawock, Craig and Metlakatla with a visit with the Ketchikan Daily News—at the airport! https://t.co/CqyKaUExP6"]["From #NorthKorea's provocations, meddling by #Russia, to Iranian maleficence, Rs &amp; Ds agree - US adversaries must be held accountable."]["The #Senate sent clear message to #Iran, #Russia and #NorthKorea that we will not tolerate their aggressive behavior around the world. https://t.co/WnFtFsmfI7"]["#Alaska #veterans - don't miss VA Wellness Fair, Claims Clinic &amp; Motorcycle Rally this Saturday from 10am-2pm in Anchorage. https://t.co/iTqhdK7FGY"]["Speaking now @Heritage on need to bolster American missile defense in light of the threat from #NorthKorea. Watch: https://t.co/JRqBqWz9VH"]["This afternoon, I joined @JulieBanderas on @FoxNews to discuss the #Senate vote to debate healthcare reform legislation. https://t.co/uvBBLEoWf8"]["I'm on the Dave Stieren Show on AM 750 @KFQD right now talking about healthcare reform. Tune in at: https://t.co/H94LNlOYz6"]["My statement on the Senate's vote today to allow debate on healthcare reform legislation: https://t.co/LzfrBtByOG"]["Chairing a @SenateCommerce subcommittee hearing on the global marine debris crisis. Watch here: https://t.co/wHMdXfZggd"]["Encouraged each to tell constituents: when looking for a great \"foodie\" trip, or trappings of a delicious home meal—it’s time to look North."]["Glad to share \"Taste of #Alaska\" with my #Senate colleagues, &amp; highlight local farms &amp; businesses offering up the best of the Last Frontier. https://t.co/U6pbGgCwdT"]["@SecretaryZinke @Interior I look forward to working together on charting a new path toward American energy dominance, of which #Alaska is a critical element."]["@SecretaryZinke @Interior His wealth of knowledge &amp; passion for #Alaska – and more broadly, federal land issues – cannot be overstated."]["While I’m sad to see Joe leave the Senate, his departure is a big gain for @SecretaryZinke, @Interior, the United States, and #Alaska. https://t.co/1XjPkCt6Hq"]["Keeping my friend @SenJohnMcCain in my prayers. My colleagues in the Senate &amp; all Americans stand behind this American hero in his fight. https://t.co/aRmC3oyK1P"]["My statement on efforts to advance healthcare reform in the Senate: https://t.co/iRyU7JsNmD"][".@POTUS @RealDonaldTrump #Iran is not in compliance with JCPOA. Read my op-ed w/strategy on #IranDeal going forward: https://t.co/KRkH5WAdTB"]["I condemn the senseless terrorist attack on the Hindu pilgrims in Kashmir. My deepest sympathies and prayers to the victims and families. https://t.co/dx8Dd7RYnP"]["Had honor today of swearing my staffer Micah into the @AKNationalGuard. Proud of him &amp; all who seek to serve &amp; defend our great country. https://t.co/vOzykMqdNR"]["@SenateMajLdr The American people are expecting a lot more progress to be made this year &amp; so am I. It’s time to get results."]["I appreciate Senate leaders &amp; @SenateMajLdr for taking these calls into consideration and taking action."]["We have a big agenda: reforming onerous reg. &amp; tax systems, fully supporting our military, fixing disaster of Obamacare, &amp; growing economy."]["For weeks, my #Senate colleagues &amp; I have been saying now is not the time to recess when we have so much work left to do. https://t.co/gvrjOAsV7y"]["Deeply saddened by loss of 16 U.S. service members in a Marine Corps plane crash last night. Julie &amp; I are keeping families in our prayers."]["Congrats to Alaska's young track star @Allie_Ostrander, and to Scott Patterson, Luke Jager, Molly Gellert - 2017 #MountMarathon champs! https://t.co/VjMljm1imv"]["I recently introduced a bill - majority of which was included in NDAA &amp; passed out of committee - to significantly boost US missile defense."]["Today Alaskans awoke to disturbing news that #NorthKorea tested missile that some experts say may be able to reach #Alaska in near future."]["Ran my @USMC PFT (fitness test): 17 pull ups; 100 sit-ups; 22:40 three-mile run. @SenThomTillis, what do you got? https://t.co/AevLtFevqx"]["Here is an update on the Senate's latest draft healthcare bill, and what #Alaska-specific issues I’ll be working on going forward. https://t.co/8g9uRW7MgX"]["I hope that these cease and we can focus on moving our country forward."]["I've said repeatedly that President's tweets insulting others don't help country or advance the civility &amp; respect we sorely need right now."]["My statement on the decision today to not hold a vote on the Better Care Reconciliation Act prior to the July 4th recess: https://t.co/OITYVZ8WHi"]["@SecShulkin As such, I expect to see swift action to ensure #veterans receive the care they have earned and deserve."][".@SecShulkin now has tools &amp; flexibility to change culture within VA, including ability to fire employees who are ill-serving our #veterans."]["The #VAAccountability Act is a step toward restoring the trust and confidence of #veterans in the VA."]["I want to thank @POTUS for signing #VAAccountability Act into law, the product of bipartisan work &amp; cooperation on Vets' Affairs Committee. https://t.co/kUVg6dTtGo"]["My statement on the Better Care Reconciliation Act, released earlier today: https://t.co/zG4s57WMNE"]["As the Senate approaches consideration of a new healthcare reform proposal, I wanted to share my thoughts. Please take a listen: https://t.co/qLHpMsMNsh"]["Happy 40th Birthday to the Trans #Alaska Pipeline! Here’s to many more years of production for our great state and country. https://t.co/zGmhTyhunm"]["Chris is an exceptional choice to lead @NOAAFisheries. He's the first Alaskan ever to permanently hold this important role. @NOAA https://t.co/hIREKJ1qje"]["My life has been so blessed by examples of my father Tom Sullivan &amp; father-in-law Bud Fate. Wishing them &amp; all dads a very #HappyFathersDay. https://t.co/XiR81JkdmA"]["Great to see my friend Tully &amp; his dad from Craig #Alaska. Tully is a stellar student who aspires to be a Marine one day. https://t.co/7PKbvbiVtX"]["Sorry I missed you, but you’re in good hands with Scott! Thank you for your advocacy on behalf of pilots @alpapiloteric, @jastoharb. https://t.co/ImScQyXzsu"]["Proud of these young Alaskans who’ve studied &amp; researched hard, sharing fascinating history projects at #NHD2017 this week. https://t.co/RNP1q6yUNI"]["Thanks @eilperin for hosting great discussion w/ @SenWhitehouse &amp; @RepDerekKilmer on opportunity for bipartisan progress on oceans policy. https://t.co/9SttHrO55T"]["Wishing the @USArmy a happy 242nd birthday, including Alaska's brave Arctic Warriors. Keep up the great work. #ArmyBDay https://t.co/KlghNTkL6d"]["Looking forward to a great discussion this afternoon at #CHOW2017. Watch live at: https://t.co/PIcg9z3w9k https://t.co/SeXg32bgEp"]["We are grateful for their courage. Praying for a speedy recovery for Congressman Scalise and the other victims."]["Law enforcement officers across the country, including Capitol police, stand on duty 24/7 ready to sacrifice for others, as we saw today."]["Great interns helping out in my DC office this summer from all across #Alaska. Check out internship opportunities at https://t.co/e0uV53T4Aj https://t.co/IRzrrMZGbW"]["The well-being of our seas and coastal ecosystems, including in #Alaska, is a main focus here in Washington during #CHOW2017. https://t.co/pI8vEr6ctj"]["Getting ready to question #SECDEF Mattis and Chairman of Joint Chiefs @GenDunford in @SASCMajority. Tune in at: https://t.co/hzJcdWTdhz https://t.co/qHiLyIpcWH"]["Congratulations, Allie, on your impressive achievement! https://t.co/RIzOZbhDpc"]["Replenishing the stocks of qualified fisheries stewards will help ensure #Alaska remains the superpower of seafood. https://t.co/6St9BlJ8zG"][".@SenMarkey @lisamurkowski, @SenatorCantwell, &amp; I yesterday introduced the Young Fishermen's Development Act:\nhttps://t.co/EP4vTEKqRb"]["Happy Birthday to my friend and colleague @RepDonYoung, a man with a great sense of humor, a deep love for #Alaska, and a strong grip. https://t.co/KcyOuFdB6c"]["@FDNMeditor @lisamurkowski Busy day. Commerce hearing. Presided over Senate. Healthcare meetings and met w/ Alaskans. No time for TV. May catch rerun enroute 2 Kodiak."]["@jerricorn4eva Thanks, Jerri. Alaska is beautiful this time of year - you should definitely see it for yourself!"]["Happy Birthday, @VP Mike Pence, a man of character and humility – with a young son in the Marines! https://t.co/OkUnUC0O80"]["Congrats to Alaskan Robb Kulin, selected out of 18,300 applicants to join @NASA 2017 Astronaut Candidate Class. #NewAstronauts https://t.co/rL9EfIvflo"]["Spectacular shots of Bogoslof eruption in Aleutians. @Alaska_AVO does great job keeping Alaskans apprised of volcanic rumblings &amp; hazards. https://t.co/CYFYWWZmw6"]["Passage of #VA Accountability Act is good news for #veterans in #Alaska &amp; across the country. Important step in restoring veterans' trust. https://t.co/USgNCXAhDN"]["Today we remember the thousands lost on #DDay, bravely fighting to end the reign of tyranny &amp; preserve freedom for generations to come. https://t.co/EXN7fV5G0T"]["This weekend, I stopped by @JERonFNC on @FoxNews to make the case for bolstering America's missile defense. #NorthKorea https://t.co/RfKvHJK26T"]["There’s nothing quite like a summer in Alaska! https://t.co/wOfBNQbLZ1"]["#ICYMI, I joined Brian @Kilmeade on @foxandfriends this morning to discuss #NorthKorea and my Advancing America's Missile Defense Act. https://t.co/S8FkfA1ifG"]["Joining @foxandfriends this morning to discuss the need to bolster America's Missile Defense. Hope you can watch!"]["Also today, @SecretaryZinke announced @Interior will update the geological assessment for ANWR, last done in the 1980s."][".@SecretaryZinke on today's order rolling back the Obama Admin's lockup of NPR-A in #Alaska: \"The war on North American energy is now over.\" https://t.co/PaORLhwYPN"]["@SecretaryZinke: \"There is no path to energy dominance that doesn't go through Alaska.\" What a difference 6 months make! https://t.co/yJEN3CrKIJ"]["We’re sending a strong signal to the unhinged dictator in #NorthKorea that the U.S. can &amp; will shoot down a rogue missile. https://t.co/JxzSwzowcX"]["@kyledcheney I don’t know of a more capable, talented communications professional than Mike Dubke. He has a bright future wherever he goes."]["Mike Dubke’s departure is a loss for White House. I’m fortunate to have him as a trusted advisor &amp; know he’ll be an asset wherever he goes."]["Honored to meet w/ Canadian @NationalDefence Minister @HarjitSajjan, discuss close relationship between our 2 nations, #Arctic cooperation. https://t.co/tgrqLhHP4z"]["Glad to welcome nine students from all corners of #Alaska this week – Togiak, Shishmaref, Nikiski, St. Mary’s, Akiachak, Seward and Bethel! https://t.co/UelOGWVY7G"]["Looking forward to welcoming @SecretaryZinke, a true westerner and friend of #Alaska, to the Last Frontier!"]["Must-read piece by @JoshRogin in @WashingtonPost on #NorthKorea threat, &amp; Advancing America’s Missile Defense Act: https://t.co/Sud18SPfT7"]["I appreciate @SenBrianSchatz @SenTedCruz @SenGaryPeters @SenTomCotton @Sen_JoeManchin @MarcoRubio &amp; SenCapito for cosponsoring AAMD Act."]["Spoke on Senate floor about the \nAdvancing America’s Missile Defense Act, which would bolster this vital system. https://t.co/FShnW0GaM6"]["America’s missile defense is a critical insurance policy that protects our citizens and our allies from a nuclear catastrophe. #NorthKorea"]["We need to be able to say: Yes, we are safe, we saw this coming. And, yes, we have world’s most robust &amp; capable missile defense system."]["When that day comes, Americans will ask us – Did we see this threat coming, and what have we done to protect our country? #NorthKorea"]["Top military leaders have been sounding alarm – it’s not a matter of “if” but “when” Kim Jong-un can range US w/ nuclear ICBM. #NorthKorea"]["In short time he’s been in power, Kim Jong-un has conducted twice as many missile tests as his father &amp; grandfather combined. #NorthKorea https://t.co/ZsZMLFZq51"]["@LeoShane @SecShulkin We’re moving bill to address backlog - my Express Appeals Act would expedite process, reduce bureaucracy so VA can better serve #veterans."]["My statement on the White House's FY 2018 budget request: https://t.co/wUiO2PaPTm"]["I had a great time cheering on so many inspiring Alaskans at the Law Enforcement Torch Run, supporting the athletes of @SpecialOlymAK. https://t.co/1fQsSlKSu7"]["Horrified by the cowardly attack on innocents, many children, in #Manchester. Americans stand in solidarity with our friends in the U.K."]["I want to wish my friend and colleague @lisamurkowski a very happy birthday! It is an honor getting to serve Alaskans alongside you. https://t.co/apnSLvckuO"][".@Enric_Sala Heard you on @NPR today-gr8 interview. I’ve introduced Save Our Seas Act to help address marine debris: https://t.co/EitAiUHOeu"]["Today we salute the brave men and women who serve in the U.S. Air Force, Army, Coast Guard, Marine Corps, and Navy. #ArmedForcesDay https://t.co/xhZt3R68NK"]["Congrats to Michael Carson, an avid Mat-Su volunteer and co-founder of MYHouse homeless youth center, on being our Alaskan of the Week. https://t.co/TgBmMcV96I"]["I applaud today’s vote by the @FCC to seek input from all Americans on the best path forward to protect a free &amp; open Internet."]["Had good visit w/ group of Fairbanks police officers &amp; their families. Grateful for all they do to keep Alaskans safe. #NationalPoliceWeek https://t.co/j8n7ckNqSE"]["On Saturday, I’ll be hosting another town hall, this time in Anchorage. It is an honor to serve you and I hope you are able to join. https://t.co/Adq5RxuMav"]["Glad to hear my good friend @SenThomTillis is recovering well. Expect to see him back in the Senate soon. https://t.co/EJQmZef3rj"]["Visited National Law Enforcement Officers Memorial where fallen Fairbanks Police Sergeant Brandt's name was added during #NationalPoliceWeek https://t.co/j7aMOk4VTV"]["Had great time in Galena, incl. visit to Interior Learning Academy &amp; delicious moose soup &amp; baked salmon lunch. Thank you for warm welcome! https://t.co/5dRy3508DE"]["I'm live now on @aprn Talk of Alaska. Tune in at: https://t.co/UCZjOm4B4E"]["Congrats to Andrew Hampton (West Point-bound) &amp; to all of the young Alaskans nominated to America's prestigious service academies. https://t.co/1gNVywcWDS"]["Honored to recognize Alaskan of the Week Sherry Bess, of Homer, who has dedicated nearly 3 decades to caring for abused &amp; abandoned animals. https://t.co/VBr8EyehZF"]["Happy #MothersDay to my wife Julie, mom Sandy, mother-in-law Mary Jane - and to all mothers across #Alaska. We love you all very, very much. https://t.co/YP8zesEbFT"]["@SecretaryZinke Grateful to have an Interior Secretary intent on filling the Trans #Alaska Pipeline. God bless you Ryan Zinke! https://t.co/VbtuPrK7DP"]["Fairbanks has done a fantastic job hosting the 10th Ministerial of the @ArcticCouncil. Chairmanship now passes from US to Finland. #Arctic https://t.co/Tbc8Fe1GMk"]["Sen. @lisamurkowski and I had a great time meeting with students from Girdwood Middle School who are visiting D.C. this week. https://t.co/mG0UjNNRY6"]["My statement on the firing of FBI Director James Comey: https://t.co/9FCKlt5uKn"]["Alaskans – this Friday from 5:30-7:00pm, I will be holding a constituent town hall in North Pole. I hope to see you there! https://t.co/sVuPxK1mB3"]["We know Russia regrets selling Alaska, but they aren't getting us back &amp; better back off. Thanks to our F-22 pilots. https://t.co/8ckhQOsCME https://t.co/58ki79kwUu"]["My statement on Senate's passage today of legislation funding the government, including a number of Alaska's priorities, through Sept. 30. https://t.co/x6lyrezOhG"]["The 1-in-5 Americans under 9th Circuit deserve better than “fast food justice.” Made case on @FoxandFriends that a circuit split is overdue. https://t.co/GZzHb9KNZ3"]["Americans living under 9th Circuit Court of Appeals – including Alaskans – wait 40% longer to access justice due to its size and delays."]["Congratulations to the 2017 BP Teachers of Excellence! Thank you for the passion &amp; hard work you devote to seeing our young people succeed. https://t.co/rIim7VaeqS"]["Sen. @lisamurkowski and I had a blast today meeting with students from Unalaska! @CloseUp_DC #CloseUpDC https://t.co/jx1fbd5Jb2"]["I had a great time welcoming the Harvey family, from Eagle River, to D.C. for #StrollingThunder! #ThinkBabies @ZerotoThree https://t.co/WdMQAXhcgu"]["Thank you to the many Alaskans in Homer who welcomed the sailors of the USS Hopper to #Alaska! https://t.co/xCV41HtCpU"]["Honored to speak at @ABAesq in support of Legal Services Corp, which provides vital pro bono representation in #Alaska &amp; across country. https://t.co/DCx9K97geo"]["Southeast awoken to series of earthquakes. Glad to hear no reports of significant damage or injuries. Stay safe! https://t.co/QC3BKiMWZL"]["Honored to recognize Madison Englund &amp; Jennifer Troutman, two accomplished Special Olympians &amp; our Alaskans of the Week! https://t.co/NVRdj4E3qW"]["Honored to witness @POTUS signing an EO today lifting President Obama's last-minute lock-up of #Alaska's #Arctic OCS resources. https://t.co/78acXiiknz"]["Tomorrow is #TakeBackDay, opportunity from 10am-2pm to safely dispose of unneeded medications that can fall into wrong hands. #TurntheTide https://t.co/hzw8wiLktr"]["#ICYMI, I joined @WillieGeist on @msnbc's @Morning_Joe to discuss yesterday's meeting at the White House on the threat from #NorthKorea. https://t.co/9ZyK6gKZaJ"]["Glad to welcome to DC a big group of Alaskan high schoolers from Colony, Redington, Wrangell, South Anchorage, and Voznesenka! https://t.co/wYexn2uIxl"]["My thoughts following a meeting at the @WhiteHouse with my Senate colleagues regarding the continuing threat posed by #NorthKorea. https://t.co/MZXL8fq9y0"]["Appreciate APD Chief Tolley's years of service. Captain Doll, fellow Marine I've served with, will lead dept. well.\nhttps://t.co/Nk19KuwlRo"]["Congrats 2 #Alaska National Guard Rescue Squads &amp; Rescue Center on winning @usairforce 2016 Jolly Green Assoc. Rescue Mission of the Year! https://t.co/cGa6630TPP"]["Great time visiting w/ Romig students who were preparing for a \"Mock Congress\" debate. I'm sure it will rival anything we see in the Senate! https://t.co/mMI2PaeSRA"]["Who wants to sit inside to talk to Alaskans when you can be outside in beautiful Homer? #townhallAKstyle https://t.co/rmHgBdM6bD"]["Thanks to principal Dr. Sherry McKenzie for an informative tour of Barrow High School. https://t.co/viRwab9Dhv"]["Great discussion with students taking Mr. Price's AK Studies class at Barrow High School. Insightful questions. Go Whalers! https://t.co/HC39yXEh9P"]["It’s great to be on the North Slope this week!  Started my morning in Barrow  on KBRW “Top of the World Radio\" with Bob Thomas https://t.co/7yC4Vg6DwF"]["I hope Alaska’s Jewish community had a wonderful #Passover, commemorating the Exodus of the Israelites from Egypt. Chag Sameach! https://t.co/jcllMn4Zbc"]["Grateful to the Alaskans, including bugler Gene Horner, who commemorated 100th anniversary of US entry into WWI at Ft. Richardson Cemetery. https://t.co/7qVuRWyRQJ"]["Honored to meet at White House w/ our courageous #woundedwarriors, here for a 4-day @wwp \"Soldier Ride\" through our nation's capital. https://t.co/wljm0SZ8aY"]["Finally, I want to thank the men &amp; women of the 4-25, and their families. You represent America’s finest. Godspeed on your next deployment."]["Also want to thank Sen. @LisaMurkowski, @RepDonYoung and all Alaskans for helping show how strategically important the 4-25 is to the U.S."]["I want to thank @ArmyChiefStaff &amp; @SecArmy22 for traveling with me to #Alaska, making this 4-25 decision a reality."]["Today’s decision keeping the @USArmy 4-25 IBCT intact is important for #Alaska as well as our national security interests."]["For 2 yrs, my team &amp; I relentlessly advocated for the #Army to reverse planned reduction of only airborne brigade in Arctic or Asia-Pacific."]["I applaud @USArmy formal decision today to retain – in its entirety – the 4/25 Infantry Brigade Combat Team at JBER. https://t.co/G2gmKEilgm"]["Wishing all Alaskans a Happy #NationalBeerDay! https://t.co/xNPsYRu8kb"]["Joining @TeamCavuto on @FoxNews at 4:45pm ET to discuss yesterday’s strikes against #Syria’s Assad regime."]["Congratulations to Neil Gorsuch, newest justice of #SCOTUS. Proud to confirm this eminently qualified man to the nation’s highest court. https://t.co/OobfAHk3Uu"]["We must continue reestablishing U.S. credibility in region, working closely with our allies to advance collective security interests. #Syria"][".@POTUS said Assad had crossed lines by using banned chemical weapons against his own people and, this time, the US President acted. #Syria"]["I commend brave men &amp; women of the US military who carried out @POTUS orders against the Assad regime. #Syria https://t.co/rp2DkvjzXt"]["Speaking now @csis_isp on U.S. missile defense &amp; importance of staying ahead of threats to homeland. Watch live: https://t.co/Oo29tHbnkZ"]["Always. https://t.co/HpBEHbyGac"][".@SenWhitehouse and I discussed the impacts of marine debris on our coastal communities/ecosystems, &amp; how the Save Our Seas Act can help. https://t.co/vl3nA895vH"]["I want to thank my @SenateCommerce colleagues for advancing the Save Our Seas Act, addressing marine debris crisis.\nhttps://t.co/EitAiUHOeu"]["I'll be on the Senate floor in a few minutes to discuss the #SCOTUS nomination of Judge Gorsuch. Tune in at: https://t.co/AUOKhvjizm"]["Alaskans - Join me for a Facebook Live event 1:30pm Thursday regarding #SCOTUS nomination of Judge #Gorsuch. Share your questions on my FB. https://t.co/5GLIcuOsBo"][".@SenatorCardin and I also urged @POTUS to discuss how #China can play a more productive role in achieving denuclearization of #NorthKorea."]["China has considerable influence over #NorthKorea, but has done little in recent years to slow or halt regime’s missile &amp; nuclear programs."]["THAAD system is critical to protecting the Korean people, and is entirely the result of #NorthKorea’s continued aggressive behavior."]["We urged @POTUS to call on President Xi to cease China’s economic retaliation against South Korea for the THAAD missile defense deployment."][".SenatorCardin &amp; I, along w/ bipartisan group of 24 senators, sent @POTUS letter prior to Chinese Pres. Xi’s visit. https://t.co/Hj4gWCnBf9"]["Joined @ADMZukunft for unveiling of newest @USCG cutter, named for WWII hero Douglas Munro, killed while saving 500 Marines in Guadalcanal. https://t.co/hTrPoRLfKX"]["Glad to welcome Alaska's 2017 Cherry Blossom Princess, Caitlin Sweeney, to Washington. Congratulations, Caitlin! https://t.co/14N8gAbDr0"]["Julie &amp; I had great time @ RAM #Alaska Rodeo Awards ceremony in Anchorage. I encourage Alaskans to make it to the rodeo circuit this summer! https://t.co/4UecK7Mj7q"]["Had wonderful reception w/ Alaskans and Under Secretary Tom Shannon at @StateDept commemorating 150th anniversary of the #AlaskaPurchase. https://t.co/QGVD740nus"][".@LisaMurkowski &amp; I welcomed a BIG group of young Alaskans to DC today from Cordova, Juneau, Ketchikan, Petersburg &amp; Anchorage. @CloseUp_DC https://t.co/il2RTCJJ0h"]["Great honor to receive President's Legacy &amp; Leadership Award from Healthy Alaska Natives' Foundation at the Raven's Ball this weekend. https://t.co/Iihg9e0aQF"]["Today we celebrate a great American statesman who saw the boundless, untapped potential of #Alaska. Happy Seward's Day! https://t.co/nrYNOKRuTa"]["Open minds, full bellies, can’t lose. #SolutionSundays. Thanks @SenatorTimScott @SenatorLankford https://t.co/t0JW8lgiAH"]["Thanks to many Alaskans who participated in Choose Respect marches, giving hope to victims &amp; survivors of domestic violence &amp; sexual assault https://t.co/YhojpfCy85"]["In approving #KeystoneXL, @POTUS sent message that strong economy &amp; North American energy independence will strengthen our national security"]["Today, @POTUS &amp; the Trump administration stood up for the hardworking men and women of this country. #KeystoneXL"]["For 8yrs Obama Admin did bidding of special interest groups, needlessly delaying 1000s of good-paying jobs for American workers. #KeystoneXL"]["Joined Alaskans on Capitol grounds for 8th annual Choose Respect rally showing support for victims of domestic violence &amp; sexual assault. https://t.co/lYZIRM7tXm"]["Thank you @ADMZukunft for sharing your insights today w/ the Subcommittee. Look forward to working w/ you to support the @USCG’s missions. https://t.co/jRQBrwQ82L"]["I shared my thoughts today on #SCOTUS nominee Judge Neil #Gorsuch and how I think his confirmation hearing is going. #ConfirmGorsuch https://t.co/c33z3Iu3yu"]["I applaud @POTUS &amp; Trump administration on the strong choice of Dina Powell as deputy national security adviser. https://t.co/AoQppROF0o https://t.co/pxLWYsVI3t"]["Chairing my first @SenateCommerce Subcommittee (Oceans, Atmosphere, Fisheries &amp; @uscoastguard) hearing. Watch live: https://t.co/Gtxup2PdBP"]["I'm on the Rick Rydell Radio Show on @650keni discussing #HJRes69. Tune in at: \nhttps://t.co/AkHWpAbrvB"]["Proud to don a pair of funny socks provided by Corbin, a bright young Alaskan from Anchorage, in honor of World Down Syndrome Day. #WDSD17 https://t.co/uAZLFYqV2Z"]["The Obama #USFWS didnt issue rule b/c #Alaska fish&amp;game or habitats were threatened, but because it wanted control over management. #HJRes69"]["The Obama #USFWS Rule is not based on sound science, or established wildlife management principles, or federal law.  #HJRes69"]["In 2016 despite federal law, Obama #USFWS finalized rule restricting #Alaska wildlife management practices &amp; limiting public input. #HJRes69"]["Alaska's ability to manage our fish &amp; wildlife resources, granted at statehood, is stated explicitly in federal law. #HJRes69"]["In #Alaska, many hunt for survival, both personal &amp; cultural. We have the best managed fish and wildlife anywhere in the world. #HJRes69"]["Spoke today on #HJRes69 which rolls back an Obama-era rule subverting Alaska’s authority to manage fish &amp; wildlife.\nhttps://t.co/32pBDxPluX"]["Few people - if any - in the world love their lands &amp; wildlife more than Alaskans. In #Alaska, our lands sustain us. #HJRes69"]["Proud of my staffer who helped Ramon Whittaker of Wasilla – Vietnam &amp; Desert Storm Veteran – get &gt;14 medals he'd earned but never received. https://t.co/rgzpcoLnyx"]["Great to see #Alaska's world-class fish and seafood products on display at the @BostonSeafood Expo! #SENA17 https://t.co/p1ZpUkrPxL"]["Today I recognized Rev. Evelyn Erbele of Ketchikan as the Alaskan of the Week. Thank you Evelyn for upholding the dignity of homeless AKns. https://t.co/RDv54vKogf"]["Still having a hard time? Clearly @SenThomTillis is the sharper dresser. @kristina_wong @HopeSeck https://t.co/Lmy9tRRdyR"]["Sincere thanks to @USAirForce Gen. \"Hawk\" Carlisle for his years of service, including time stationed in #Alaska.\nhttps://t.co/WztuNCNpqr"]["Congratulations, Mitch and team, on a record-breaking #Iditarod victory! Best wishes to the remaining mushers making their way to Nome. https://t.co/eVaQKlL1C6"]["I’m sure Dallas isn’t excited to see his  3-year #Iditarod winning-streak end, but he must be very proud that his dad was the one to do it."]["For six years going, the Seaveys have led the pack in the Last Great Race, a proud distinction for this revered #Alaska family. #Iditarod"]["As a Marine, I'm disgusted by reports of female #Marines being degraded online. @SASCMajority held an important hearing on this perversion: https://t.co/jy7UKhoTha"]["Here are the 5 brilliant finalists for our Frontier in Focus winter photo contest! Vote for your favorite at: https://t.co/Z76V6efxEB https://t.co/zhg9bs6oHS"]["Congrats Madeline Ko of Palmer, &amp; Wilfried Zibell of Noorvik, Alaska’s representatives w/ the competitive Senate Youth Program. #ussyp2017 https://t.co/r7AlEx1hbG"]["As the son of a @USNavy veteran, it was a huge honor last night to receive the Association of the U.S. Navy's Legislative Advocacy Award. https://t.co/ghdPNLvBv2"]["#Alaska Legal Services Corp is celebrating 50 years with free legal clinics across the state for Alaskans in need: https://t.co/SmX7shxFvm"]["Best wishes to Jennifer &amp; Madison of @SpecialOlymAK, competing at the #2017Austria Special Olympics World Games! https://t.co/FPHvEeOD2S"]["I had great time meeting with more than 20 bright @4H students from Palmer on the steps of the Capitol today. https://t.co/Mzd7rZYlWx"]["Congrats to Armstrong Oil&amp;Gas and #Repsol on making biggest US onshore oil discovery in 30 years. 1.2 billion barrels. WOW!! #policymatters"]["I appreciate @SecretaryZinke rescinding a last minute Obama admin. ban on traditional tackle &amp; ammo on @USFWS land.\nhttps://t.co/DDladcJNbF"]["Met w/ @POTUS's #SCOTUS nominee Judge Gorsuch. Like late Justice Scalia, he has deep respect for the law, federalism &amp; separation of powers. https://t.co/aVhN7bvocF"]["#ICYMI I joined @CNBC's @SquawkCNBC to discuss @CommerceGov Secretary Ross's focus on reigniting the engine of the American economy. https://t.co/G8yGIs1khi"]["Pleased to announce @NOAAFisheries is implementing necessary regs for a timely open of the #Alaska halibut fishery.\nhttps://t.co/qoDy28YOEQ"]["Congrats to #Alaska Guard 212th Rescue &amp; 249th Airlift Squadrons nominated for National Aeronautic Association's prestigious Collier Trophy! https://t.co/IGu215C8ML"]["Glad to vote to confirm @RyanZinke - a public servant, trained geologist, avid sportsman &amp; fmr Navy SEAL - as next Secretary of @Interior. https://t.co/GjnzpVi84c"]["Last week, 200 @USArmy paratroopers conducted another successful operation 200miles north of #Arctic Circle. Congrats 2 the 4/25 IBCT (ABN)! https://t.co/TUfEuCTVwm"]["Here are my initial thoughts following @POTUS's strong &amp; unifying first #JointAddress to Congress. https://t.co/WIM7kfHwVy"]["Glad to join @POTUS &amp; @EPWGOP for signing of a new order to review &amp; roll back expansive overreach of #WOTUS Rule. (Photo: @NACoTweets) https://t.co/nOFR87FvRq"]["Calling all #Alaska photographers: Send your best shots for our winter Frontier in Focus contest to photos@sullivan.senate.gov by March 10. https://t.co/osdZJGbSWy"]["Congrats to 2017 #Alaska Military Service Members of the Year! You've exhibited excellence in your work &amp; set high standard for your peers. https://t.co/XeIHwOSBx8"]["The U.S. military should continue to fly, sail and operate in the #SouthChinaSea, and everywhere else international law allows."]["$5.3 trillion of trade – $1.2 trillion of it from the U.S. – passes through the #SouthChinaSea each year."]["Building 2 dozen structures to house surface-to-air missiles clearly violates China’s previous promises not to militarize this vital region."]["Despite claims to the contrary, China is continuing to change the facts on the ground in the #SouthChinaSea. https://t.co/tvDkJJkpRn"]["Good luck to all of the Iron Dog racers making the 2,000-mile trek to Nome and Fairbanks! #IronDog2017 https://t.co/KcYO68w4VC"][".@AKScottPruitt understands #EPA must respect rule of law, input of states. Proud to confirm him as administrator. https://t.co/LxQNbO1fHQ"]["I want to thank Gov Walker for disaster declaration, putting forward resources to combat #Alaska's opioid epidemic.\nhttps://t.co/XBjgeoxSDu"]["Congrats to Matt Hall, of Two Rivers, &amp; his Smokin’ Ace Kennels team on winning @theyukonquest Sled Dog Race!\nhttps://t.co/u6n4WIuXFQ"]["Had a great time meeting remarkable young men &amp; women of 477th Fighter Squadron and congratulating honorees at their annual awards ceremony. https://t.co/0iRcbvEQ9D"]["Thank you 2 volunteers who assembled kits of Naloxone, essential to reversing overdose &amp; combatting opioid epidemic.\nhttps://t.co/Zo3HHp3UYw"]["Honored to meet w/ Japan PM @AbeShinzo, a once-in-a-generation leader working toward a safer &amp; more prosperous Asia-Pacific. @JPN_PMO https://t.co/qhbWiQi2Lt"]["Look forward to welcoming Prime Minister Shinzo Abe of Japan, one of America's most crucial longstanding allies. https://t.co/QnU7Z6kpLA"]["US must reenergize alliances w/ Israel &amp; Arab states, all of which languished during the Obama admin. due to its focus on placating #Iran."]["Recent missile tests and provocative actions against US and allied forces in the region, demonstrate these penalties are long overdue. #Iran"]["#Iran has been intent on undermining #IranDeal at every turn. Yet P5+1 countries (incl US under Obama) havent called them out for violations"]["I applaud the Trump Administration today announcing new sanctions against #Iran after ballistic missile test. https://t.co/6m5dbQRq28"]["These delay tactics by Senate Democrats do not serve the American people. It’s time to get to work. #epa"]["Their calls for greater time, scrutiny ring hollow: @AGScottPruitt answered 1,000+ more Qs than any previous #EPA nominee in recent history."]["Senate Democrats boycott of an @EPWMaj vote on @agscottpruitt to lead #EPA is nothing more than a senatorial temper tantrum. https://t.co/DcRbJSqeQq"]["My statement on President @realDonaldTrump's nomination of Judge Neil Gorsuch to the U.S. Supreme Court. #SCOTUS https://t.co/agUyR8mOrc"]["Staff &amp; I had honor of surprising Will Lee, a Vietnam Vet from Mat-Su, w/ a Bronze Star he earned but never received. Congratulations, Will! https://t.co/oOvn51Bl9E"]["Applaud Pres @realDonaldTrump for issuing EO reflecting RED Tape Act, my 1-in-2-out reg bill. Now we should pass bill for full force of law."]["Today @POTUS made good on promise to cut excessive regs, something I’ve been focused on in Senate w/ RED Tape Act: https://t.co/CLIxA5J9Sl"]["After 8 years of stagnant growth, reigniting the American economy should be job #1 for Congress, @POTUS. That starts with regulatory reform."]["#Alaska snow-machine champ @CDSIX competes today in his 11th @XGames. Wishing Cory a great competition &amp; hoping he adds to his 6 medals! https://t.co/kQ66OrX4UC"]["Proud to #MarchForLife w/ Americans from across the country to affirm our belief that life is precious &amp; we need to protect most vulnerable. https://t.co/QDaRFnQ3xa"]["I had the honor of recognizing Eileen Dubowski, a beloved educator &amp; wrestling coach from Salcha, as my Alaskan of the Week. Take a listen: https://t.co/pRHA7pIjE5"]["Congrats to Andrew Kurka, world-class #Alaska Paralympic skier, on taking home his 1st World Championship! \nhttps://t.co/oHxIJrCi88"]["I call on my Dem colleagues to join me in voting for permitting reform as part of any new #infrastructure package. https://t.co/AOvk25JhpR"]["Pres. Obama’s $800 billion stimulus in 2009 (w/o reg reform) wrecked the country’s balance sheet while doing little to spur economic growth."]["We need new #infrastructure now. New highways take 19 yrs. 14 yrs for a dam expansion in CO, &amp; 15 yrs to permit a new SeaTac runway!"]["I support new infrastructure investment. But we must reform permitting &amp; #regulation, or else billions will go to red tape and litigation."]["Hats off to the 47 #Alaska Guardsmen in DC this weekend to support security operations during the #inauguration. @AKNationalGuard https://t.co/3Pmd7ZjukU"]["Proud to cast my 1st vote under new Admin for Gen. #Mattis, man of courage &amp; integrity. He'll make a great Secretary of Defense. #semperfi"]["Celebrating historic moment of inaugurating new @potus with bipartisan group of friends, colleagues. #Inauguration https://t.co/j2TCEltRQG"][".@AGScottPruitt testifying at @EPWMaj w/ ease &amp; intelligence. He knows what we in AK know: healthy environment &amp; strong economy not at odds."]["Pleased to join 25 of my colleagues on #SASC to approve nomination of General #Mattis to be #SECDEF. Now on to full Senate for vote!"]["My statement on President Obama's decision to commute the sentence of Private #Manning. https://t.co/WiE6sUdwRr"]["#ICYMI, I joined Arthel Neville on @FoxNews to discuss the process for reviewing #PEOTUS @realDonaldTrump's cabinet nominees. https://t.co/eLyHt359Ok"]["Today we remember Dr. Martin Luther King, Jr.—a true American hero. Let's work together to continue to realize Dr. King’s dream. #MLKDay https://t.co/RY345PKqGc"]["Condolences to the family of @KaladiBrothers CFO Dale Tran, an active &amp; beloved member of the Alaska community. https://t.co/5KekXZ87eV"]["Gen. Mattis understands &amp; respects Constitution, and has admiration of our service members. I look forward to voting for his confirmation."]["In these times in which our adversaries no longer fear us &amp; our allies no longer trust us, General #Mattis is uniquely qualified to serve."]["Today I joined 80 of my #Senate colleagues in voting for a waiver enabling retired General James Mattis to serve as our next #SECDEF."]["We must reduce cost of healthcare without growing size of government, &amp; ultimately provide greater affordability and choice for Alaskans."]["In new Congress, I'm committed to working w/colleagues of both parties on orderly transition w/ market-oriented, patient-centered reforms."]["The Affordable Care Act is not affordable for thousands of Alaskans. Doing nothing was not an option. #Obamacare #ACA"]["With skyrocketing premiums and  deductibles &amp; 1 provider left on exchange, #Alaska healthcare system is in downward spiral. #Obamacare #ACA"]["President Obama's promises have not proven to be true for millions across our country – and Alaska is ground zero. #Obamacare #ACA"]["In 09, Pres. Obama said, \"If you like your healthcare plan, you can keep it. If you like your doctor, you can keep your doctor.” #ObamaCare"]["Early this morning, the Senate took the first major step toward repealing the #ACA, keeping our promise to the American people. #ObamaCare"]["Getting ready to question Gen. James #Mattis, #PEOTUS @realDonaldTrump’s nominee to lead the Defense Department, in @SASCMajority hearing. https://t.co/txw1z8Wl0w"]["Condolences to family on passing of Ms. Josephine “Jo” Ke-A who faithfully served #veterans free coffee at Anchorage VA clinic for 19 years. https://t.co/YIWnkYjlen"]["Sec. #Army designee Viola &amp; I agreed: @USArmy force structure is much too small. We must increase size &amp; improve readiness of ground forces."]["We discussed importance of #Alaska's strategically positioned @USArmy forces, incl. 1-25 Stryker Brigade in Interior and 4-25 IBCT at JBER. https://t.co/JFVva5n6Vf"]["I had a productive meeting w/ Vincent Viola, #PEOTUS @realDonaldTrump's designee as Secretary of the #Army. https://t.co/6oSANp7cbU"]["Appreciate House's passage of #REINSAct, a major step toward reining in out-of-control federal agencies.  https://t.co/jEMTJRfQjC"]["Honored to recognize my first \"Alaskan of the week,\" the talented Tlingit writer &amp; 2017 #Alaska Writer Laureate Ernestine Hayes. https://t.co/iMuKaN1Mtu"]["#ICYMI, I joined @EricShawnTV on @FoxNews to discuss the recently released intelligence report on the 2016 Russian hack. https://t.co/I4yGNyBvdD"]["Wishing #Alaska legends, Urban Rahoi, of Fairbanks and George Brown, of Anchorage - both veteran WWII pilots - a very Happy Birthday! https://t.co/tzOUJL4jX0"]["We discussed much-needed water &amp; wastewater infrastructure funding &amp; need to lift burdensome regulatory/mitigation requirements. #EPA"]["AG @ScottPruittOK has clear vision: return #EPA to role of reasonably implementing laws, protecting environment w/o stifling development."]["As a member of @SenateCommerce Committee, I will work w/ incoming @CommerceGov Sec. Ross to ensure #Alaska remains superpower of seafood."]["#Alaska is superpower of seafood thanks to science-based management &amp; hard-working Alaska fishermen."]["I was impressed w/ Mr. Ross’s knowledge on variety of issues–trade, infrastructure, permitting reform–&amp; his business experience in #Alaska. https://t.co/kccwFJQSbj"]["Wilbur Ross, #PEOTUS @realDonaldTrump’s Commerce Sec. nominee, discussed w/ me importance of #Alaska fisheries to state&amp;national economy. https://t.co/5uPUxUyrC1"]["I’ve long been impressed by @ScottPruittOK's legal analysis &amp; incisive refutation of lawless overreach seen from Obama #EPA these past 8 yrs https://t.co/wWNe2zh9iR"]["Met with Oklahoma AG @ScottPruittOK, Pres. Elect @realDonalTrump’s nominee to head #EPA. Look forward to his speedy confirmation. https://t.co/ivVSFUhDit"]["Gen. #Mattis deserves swift confirmation so he can refocus our military on its primary mission: to close with &amp; destroy the enemy. #SECDEF"]["I also highlighted critical role of the F-35 to our nation’s defense &amp; need for deeper engagement in #Arctic &amp; Asia-Pacific. #Mattis #SECDEF"]["General “Mad Dog” #Mattis &amp; I today discussed Alaska’s strategic location and the importance of a robust missile defense system. https://t.co/Vo0aj1I2e0"]["It’s not every day I get to have another Marine Corps infantry officer in my office discussing national security issues. @USMC #Mattis https://t.co/xLz3iIEE6X"]["Joined @SquawkCNBC to discuss investigations into the recent large-scale #Russia hack. @JoeSquawk #cyberattacks https://t.co/snUzJslmpU"]["Intel Dir. Clapper among those testifying in #Senate Armed Services on growing #cyberattacks against US, including by #Russia &amp; China. #SASC https://t.co/Gd2ZImmPMT"]["I had the pleasure of meeting with Gov. @NikkiHaley of South Carolina, nominee to be U.S. ambassador to the United Nations. https://t.co/eLnDu5xLTw"]["Proud of my 5 exceptional Fall 2016 interns. To learn more about interning in my DC office, go to: https://t.co/EHPGbZCsWS https://t.co/ZEqwSr8OfM"]["58 years ago today, as a result of tremendous work by Alaskans &amp; many Americans who saw our great potential, #Alaska became the 49th state. https://t.co/oyXJPThNfi"]["We enjoyed skiing in Girdwood &amp; seeing the stunning annual torchlight parade down Mt. Alyeska. Wishing you &amp; your family a #HappyNewYear! https://t.co/hItsIMNekg"]["\"For today in the city of David there has been born for you a Savior, who is Christ the Lord.\"\nMerry #Christmas from the Sullivan family! https://t.co/4ri2iFyyb4"]["Alaskans - serving as your senator is the honor of a lifetime. Wishing you a happy first day of #Hanukkah and a peaceful #Christmas Eve. https://t.co/lHwXdLV2Ms"]["Honored to present Mark Boberick of Fairbanks w/ Vietnam Service Medal he earned, but waited 30yrs to receive. Thank you for your service! https://t.co/vLgfmqoTZJ"]["Joined by ~20 Denali Elementary students to congratulate our newest fellow American citizens at their naturalization ceremony in Anchorage. https://t.co/W75seVL8pr"]["This is hopefully last act of a callous presidency, 1 that lacks any regard for our economic future or hardworking #Alaska families. #Arctic https://t.co/qp0ppOujJC"]["President betrayed Alaskans, especially those living in the #Arctic who weren't consulted before this offshore ban:\nhttps://t.co/ToSmpfVgIh"]["Had a great time at Elmendorf-Richardson's USO pancake breakfast, thanking some of our nation’s finest and their families for serving us. https://t.co/JyL31P7Q5H"]["Shared lunch today with two Alaska legends: Lucky Wishbone founder &amp; WWII vet George Brown, &amp; renowned KTUU news anchor Steve MacDonald. https://t.co/dGxky7i6BO"]["Julie and I were #FreezinForAReason for the #PolarPlungeAK at Goose Lake in Anchorage to support the mission and athletes of @SpecialOlymAK. https://t.co/PF8uGsR0I4"]["Agree w/ PACOM Admiral Harris: “We will not allow a shared domain to be closed down unilaterally no matter how many bases are built...”"]["Freedom of the Seas has been a core national interest of US since founding, &amp; a foundational principle of the post-WWII international order."]["Regardless of attempts by Chinese leaders to militarize #SouthChinaSea, US should to fly, sail, &amp; operate there &amp; wherever int’l law allows."]["Despite promises 2 halt cyber-attacks, theft of US intellect. property &amp; militarization of S. China Sea, China’s actions speak much louder."]["Deeply disturbed by reports of China installing weapons systems on contested #SouthChinaSea islands. https://t.co/8tAJvZLeRk"]["Chatted recently w/ members of #Alaska Guard's 212th Rescue Squadron (RQS) who stand guard whenever their unsurpassed skills are needed. https://t.co/kihSuuekOC"]["Took in sights &amp; smells of Captain Cook's incredible Christmas gingerbread village with the creator himself, master pastry chef Joe Hickel. https://t.co/boVAJ5WJ0C"]["Today we said goodbye to our military fellow, Dave \"Ghost\" Deptula. Couldn't have asked for a more knowledgeable, driven &amp; congenial fellow. https://t.co/TCmUS3G8Ud"]["Deeply saddened to learn of passing of fmr #Alaska legislator Mike Kelly, a passionate &amp; principled public servant. https://t.co/btuB5RbByf"]["“Oh, that view is tremendous!\" –#JohnGlenn, during his 1st orbit. Because of him, that view is even more tremendous for all of us."]["#JohnGlenn was also a decorated veteran, serving as a fighter pilot during World War II and the Korean War."]["#JohnGlenn &amp; his fellow astronauts inaugurated a golden age of exploration, expanding our horizons to encompass limitless boundaries space."]["As the 1st American to orbit the earth, #JohnGlenn captured the imagination of the world, and buoyed the resolve of Americans to dream big."]["Today we mourn the loss of #JohnGlenn – an astronaut, Marine, senator and true American hero. https://t.co/hUuIsr6zbO"]["The nomination of AG Pruitt sends a strong signal that the #EPA will be returned to its congressionally defined scope of authority."]["AG Pruitt has stepped up time and again to defend his constituents when the federal government overreaches."]["Americans want clean air &amp; clean water. But they don't want out-of-control agencies issuing endless regs more about control than environment"]["In @EPWMaj hearings, AG Pruitt impressed w/ his eloquent legal analysis &amp; incisive refutation of Pres. Obama's lawless EPA overreach."]["I commend President-elect @realDonaldTrump on choosing Oklahoma AG Scott Pruitt to be our next #EPA Administrator. https://t.co/oSGGMIJ5MG"]["75 years ago at #PearlHarbor, America experienced one its darkest days. We remember those we lost &amp; many who answered our nation's call. https://t.co/HqSu81LgcI"]["My staff members are doing a great job gathering #ToysforTots! Keep an eye out for donation boxes in your community. https://t.co/6w1yeEZrzR"]["Saddened 2 learn of passing of legendary #Alaska painter Byron Birdsall. His unique perspective of the Last Frontier will always be with us."]["The Rebuild America Now Act would prevent billions from being wasted in red tape/litigation, make it easier to overhaul U.S. infrastructure."]["My bill will include a builder's &amp; worker's bill of rights, requiring timely permitting decisions, and transparency from federal agencies."]["Rebuild America Now Act would limit sue-and-settle practices used by radical groups to abuse the judicial system, delay projects to death."]["This simple one-in one-out rule on federal regulations has been successfully implemented in the UK and Canada. #RegulationNation"]["My bill would also cap regulations, requiring old regs to be eliminated for every new reg enacted by a federal agency (RED Tape Act)."]["Rebuild America Now Act would (2) create 1-stop shop for environmental reviews, ensuring projects don't get bogged down by endless agencies."]["President-elect @realDonaldTrump is set to reverse Obama Admin's abysmal permitting record. Members of Congress should join this effort."]["Labor leader Terry O'Sullivan, with @LIUNA, called Pres. Obama's actions a “cynical manipulation of the approval process.” #RegulationNation"]["#KeystoneXL languished in permitting purgatory for two Obama terms before the President finally killed it in 2015. #RegulationNation"]["Obama Admin's capricious permitting was part of why @Shell halted its #Alaska operations, stranding resources and killing 1000s of jobs."]["It took @Shell 7 years and $7 billion to get White House permission to drill a single exploration well off #Alaska coast. #RegulationNation"]["The problems of the U.S. regulatory state have grown for decades. #RegulationNation https://t.co/u7oCAEDSiv"]["Todd Hauptli of @aaaedelivers testified before @senatecommerce, \"It took longer to build that runway than the Great Pyramids of Egypt.\""]["It took 4 yrs to construct a new SeaTac Airport runway - but it took 15 YEARS to get the permits. #RegulationNation"]["It will have taken 14 yrs to permit Gross Reservoir expansion in Colorado; 20 yrs to permit Alaska's Kensington Mine.  #RegulationNation"]["New US highways today take between 9 and 19 years from initial planning and permitting to completion of construction. #RegulationNation"]["We used to b envy of world in building projects: Pentagon built in 16 months, 1,500-mile ALCAN in 8 months. Not so, today. #RegulationNation"]["America's much-needed roads, bridges, airports, pipelines &amp; rail lines too often hit federal regulatory roadblocks… https://t.co/AOvk260SOr"]["I am eager to continue working with my friends and colleagues in the freshman class on moving America forward in the new Congress. https://t.co/0LPDQVeIh2"]["I look forward to working w/ colleagues on both sides of aisle to ensure Mattis has swift confirmation, incl. statutory waivers. Semper Fi!"]["General Mattis believes in importance of our allies &amp; will bring a warrior’s ethos to address challenges of an increasingly dangerous world."]["After a 1-on-1 meeting w/ Gen. Mattis, I have every confidence he will bring @USMC virtues of honor, courage &amp; commitment to #SECDEF role."]["As a Marine &amp; member of Senate Armed Services, I commend Pres-elect @realDonaldTrump on his inspired choice of General Mattis as #SECDEF."]["Another #Alaska #NHL great is hanging up his skates. Congratulations, Matt Carle, on an impressive career.\nhttps://t.co/1P3jENAKZj"]["Proud to conduct re-enlistment ceremony for JBER's CMSgt. David Wolfe who joined @USAirForce in 1997 &amp; plans to retire at end of this tour. https://t.co/yJgw0U9mZ8"]["Congrats Paul Campbell, of Chester Valley, one of 35 teachers nationwide to receive prestigious Milken Award! \nhttps://t.co/9jIZHO7jqn"]["Honored to visit with true hero, #Marine Colonel Hall Campbell, recipient of the Navy Cross, who fought in many Pacific battles of WWII. https://t.co/g1ieV8B6nM"]["Alaskans, a family in the Mat-Su needs our help. David Grunwald has been missing since Nov. 13. If you have an info, call 800.478.9333. https://t.co/GPzxxZ5y7f"]["Honored to be adopted into Gaanaxteidì Clan of Chilkoot Valley. The Tlingit name I received, “X’aak Éesh,” means “Father of the Valley.” https://t.co/O41xjI9prg"]["Congrats Charity Carmody &amp; Beacon Hill team in Anchorage on receiving Hope Award for Effective Compassion at @Heritage '16 Antipoverty Forum https://t.co/hQqfjyOJ9U"]["Best of luck to all of the bowlers participating this weekend at @SpecialOlymAK Bowling Tournament at Polar Bowl on JBER. https://t.co/BasV4CX5Ag"]["#Alaska has promising future in responsible development. I am hopeful w/ incoming Admin. we will be able to reach our potential as a state."]["Hopefully this is the final chapter in Admin’s harmful legacy of putting the interests of anti-energy activists above hard-working Alaskans."]["We will work hard to reverse the latest damage the Obama Administration has done to our citizens, economy and future."]["For nearly 8 years this Administration has given lip service to an \"all of the above energy strategy,\" when their actions say the opposite."]["In blocking #Alaska OCS lease sales, Obama Admin. is once again capitulating to extreme environmentalists. \nhttps://t.co/rgYoorqywl"]["I am encouraged by President-elect @realDonaldTrump's nomination of @SenatorSessions, a passionate defender of our Constitution, as next AG."]["If @POTUS blocks future lease sales in #Alaska OCS, he will be blocking good-paying jobs and economic opportunity for Americans. https://t.co/3VmadPoOuG"]["Fellow Marine @SenPatRoberts took a liking to my Semper Fi-tastic tie as we celebrated the @USMC's 241st birthday on the Hill today. https://t.co/wl72WK4CLX"]["Kudos @AlaskaAir &amp; @WSUPullman on developing  biofuel from tree limbs &amp; branches, a milestone in renewable energy. https://t.co/AhTlp14OCT"]["#Alaska is No. 9 in volunteering among the 50 states! Find ways to #GoVolunteer &amp; serve others at:  https://t.co/phqy6kpVq0 @NationalService https://t.co/PqPkTVsbze"]["Attended the installation Mass of Anchorage's new Archbishop Paul Etienne. I wish him all the best as he leads Alaska's Catholic community. https://t.co/AhNs1KCsKs"]["For 241 years, @USMC has proven itself to be one of the greatest fighting forces the world has ever known. Semper Fi. #HappyBirthdayMarines https://t.co/6O5Rzufdhi"]["I want 2 reinforce unifying words of @realDonaldTrump calling on \"America to bind wounds of division, &amp; come together as one united people.\""]["Congrats to @lisamurkowski  @repdonyoung. Alaskans have a strong, united congressional delegation that will fight for Alaska's interests."]["Congratulations 2 my new&amp;returning Senate colleagues on their hard-fought victories. Voters chose to keep @SenateGOP working for the people."]["We'll work on energy independence, economic growth, a strong military, &amp; rolling back Obama executive orders &amp; overregulation of our economy"]["I look forward to working closely with our new president and his administration on issues critical to #Alaska and America."]["They clearly heard and gave voice to the concerns of millions of our citizens who feel the American dream is slipping away."]["I want to congratulate President-elect @realDonaldTrump and Vice President-elect Mike Pence on their historic victory last night."]["#Alaska has lost a great leader with the passing of whaling captain and former North Slope Mayor Edward Itta.\nhttps://t.co/uufo07qxFA"]["Had the privilege of meeting the team at Snow White Linen Supply, a staple small business in the Anchorage community since 1926! https://t.co/2zjUIJpLuP"]["Honored to train with world-renowned APU ski team, though I must admit I was only able to handle one interval before calling it a day. https://t.co/TXf3RV1cMV"]["I appreciate @usairforce Chief of Staff General Goldfein coming to #Alaska to see our nation's hub of combat airpower. https://t.co/TeYtxTWDJE"]["Sgt. Allen Brandt is a hero who gave his life for the safety of his community. We will never forget his sacrifice. https://t.co/XdrXoagJSJ"]["Congratulations to the 5 fantastic finalists for our Frontier in Focus fall photo contest. Check them out &amp; vote at https://t.co/KewCkgdvgZ https://t.co/8lA3KHB1tL"]["Will continue making case to my colleagues, as I’m sure their constituents are too: championing broken #Obamacare system is unsustainable."]["I joined @SenateGOP colleagues in passing #Obamacare repeal to give the people relief from what fmr Pres. Clinton called a \"crazy system.\""]["Rest of nation isn't faring well either. Obama Admin announced unconscionable 25% average hike in premiums in 2017. https://t.co/J6GKbJ0qWb"]["Each of the last 2 yrs, Alaskans endured 40% health insurance rate increases. In 2017 #Alaska will be 1 of 5 states w/ 1 insurer. #Obamacare"][".@LisaMurkowski &amp; I signed copies of our Senate resolution commemorating @NativeFed's 50th Anniversary. Congratulations, AFN! #2016AFN https://t.co/uA3uXwFTnu"]["23 WWII, Korea &amp; Vietnam War vets on Honor Flight from #Alaska arrived at Arlington Cemetery today. Grateful for their service &amp; sacrifice. https://t.co/QLeFBYDph5"]["Had great time talking with Soldotna &amp; Kenai Central High School student councils – future #Alaska leaders. We couldn't be in better hands. https://t.co/Gf3HxxEpsE"]["Im calling on Trump to step aside for Gov. Pence. Trump can’t lead on critical issue of ending dom violence &amp; sexual assault. Full statement https://t.co/e47h6MAdmH"]["Calling all photographers! Send your best shots of #Alaska to photos@sullivan.senate.gov. https://t.co/npAnfOctCF https://t.co/8213mGU6cl"]["Julie&amp;I send condolences to family of fmr. AK LG Lowell Thomas Jr, a public servant who led a truly incredible life. https://t.co/u0xNzDs3d4"]["\"1 US sub in region w/ growing Russian military presence\" not sufficient. Good doc w/ Gen. Breedlove on US #Arctic: https://t.co/uoaIwd22kj"]["It was an honor meeting Baseball Hall of Famer Ozzie Smith, known as The Wizard for his incredible talent &amp; career as a shortstop. https://t.co/TbPVxPfb0g"]["My office was packed today with bright young students from Anchor Lutheran School in Anchorage. They had great questions &amp; were enjoying DC. https://t.co/9jVgWIAhX0"]["Naloxone, used to treat opioid overdoses, more accessible thks to AK Legislature &amp; recent CVS change. #TurnTheTide\nhttps://t.co/rN2VGDwfDF"]["Appreciate @SenDavidPerdue calling on our colleagues to fix the broken budget process &amp; work on real solutions to our fiscal challenges. https://t.co/WBYZrpyHKL"]["Check out my latest e-newsletter w/ visits to many #Alaska communities this summer &amp; important developments from DC: https://t.co/Yl3DEYtmxM"]["Proud of young AKns from Gambell, Akiachak, Mtn Village, St Michael &amp; Barrow, who presented at @CloseUp_DC Expo of Local Empowerment Plans. https://t.co/EC20o1FQOZ"]["Welcomed ~50 @USMC 2nd Lt's to Capitol Hill following graduation from Basic School. Our nation's \"ready force\" is in good hands. Semper Fi. https://t.co/fc5oXIXEM6"]["Americans from near &amp; far came to DC to see grand opening of @NMAAHC. Honored to attend this incredibly moving ceremony. #APeoplesJourney https://t.co/FzpKBuGAxu"]["Joined Dave Stieren on @KFQD to discuss legislation to give AKns choice of policies w/o certain #Obamacare mandates: https://t.co/1G8u8gOCpE"]["Thank you @repjoekennedy &amp; @repdonyoung for introducing a House version of the POWER Act. @SenatorHeitkamp \nhttps://t.co/Pdjv9wzY3F"]["#Alaska today welcomed its 1 millionth cruise ship passenger this year, great news for our tourism industry. https://t.co/71UNNJaJwZ"]["Thoughts &amp; prayers to officers and the community during the standoff in Anchorage."]["Glad to join @SenatorTimScott's #SenateOpportunityCoalition with my colleagues @marcorubio @SenatorLankford &amp; @SenJoniErnst. https://t.co/VaGT9jdJ8U"]["Great job to Shirley Reilly &amp; Seth McBride who both took home medals at this year's Paralympic Games in Rio! https://t.co/vagTefE7h9"]["Stunning failure at DHS. Little wonder why Americans have so little faith in their gov't &amp; this administration.\nhttps://t.co/rLbM3PfJmw"]["Congratulations to newly promoted Army Brigadier General Laurie Hummel, Adjutant General of the @AKNationalGuard. https://t.co/wEYq1e87q0"]["#Alaska is the proud home of Eielson &amp; Elmendorf. Wishing our Airmen &amp; their families a Happy #AFBday! @usairforce https://t.co/hoZzqUqChG"]["Proud 2 join fellow servicemembers @SenJoniErnst &amp; @SenTomCotton in reciting Preamble to celebrate #ConstitutionDay. https://t.co/GOlRTKJQ2x"]["Senate today passed #WRDA w/ major provisions to advance much-needed water &amp; sewer infrastructure in rural #Alaska. https://t.co/t1wqAruCsu"]["Had an amazing ride on White Pass-&gt;Yukon Railroad through stunning Klondike Gold Rush Park from beautiful Skagway. https://t.co/YsGWF7cbye"]["My freshmen colleagues and I will continue coming to the floor until Senate Dems relent and support our men&amp;women in uniform. #FundOurTroops"]["What are our troops – 5,000 of whom are in combat today in Iraq – to think of the Democrats filibuster? It’s a disgrace. #FundOurTroops"]["Because of Sen. Reid’s repeated filibuster of troop funding, our most sacred &amp; important responsibility isn’t getting done. #FundOurTroops"]["There is no more important job for Congress than to provide for our national defense. #FundOurTroops https://t.co/qBZLvcWHsx"][".@AK_OK, glad to welcome you to Washington! Hope u stop in for a chat w/ Sec. Jewell with that shirt. #BuildTheRoad https://t.co/dLTVMpq6PG"]["If you ever worry about next generation, look no further than young Marines of world-renowned 8th &amp; I Drill Platoon. https://t.co/bZpwYru7uj"]["Visited the incredibly moving Pentagon Memorial to pay respects to those we lost 15 years ago today. #NeverForget https://t.co/obeQ7my1fW"]["Kim Jong Un is irrational, inexperienced &amp; determined to destabilized international order &amp; threaten our freedom here at home. #NorthKorea"]["#NorthKorea’s progress reinforces our need for a more robust missile defense system that will keep us safe against rogue actors."]["Deeply troubled by news today of #NorthKorea’s fifth test of a nuclear weapon. https://t.co/ZuhpWBtWWv"]["Glad to join @FoodBankofAK in donning orange to raise awareness of 1in7 AKns lacking food security. #HungerActionDay https://t.co/2fqyBU9Wz8"]["Had gr8 time running J’eet’s Challenge, 8.5 mile race uphill in Hoonah with trip down 1 of world’s longest ziplines! https://t.co/qiGBPw4ZKc"]["Sen. Harry Reid yesterday filibustered defense approps bill - critical troop funding - for 6th time in ~1.5 years. https://t.co/6jEDaRAR1D"]["Saddened 2 learn Joe Kellwood, 1 of last last remaining WWII Navajo code talkers has passed. Grateful 4 his service. https://t.co/44aarTyWJm"]["Word to the wise for those visiting Unalaska: eagles are always on the look-out for a quick meal — or a new iPhone. https://t.co/oywNv0nBBS"]["We have 5 superb finalists for our Frontier in Focus photo contest. Check them out &amp; vote at https://t.co/KewCkgdvgZ https://t.co/Vw9AZY1xsB"]["Scotty has been a star on &amp; off ice for years, providing stellar example for young Alaskans. We’ll miss you, Gomer. https://t.co/OMbedZAn0V"]["Julie and I send our deepest condolences to the families of those five individuals lost yesterday in a mid-air collision in Western #Alaska."]["Had a great visit to Unalaska, home of the largest US fishing port by volume. Can't wait to get back again soon! https://t.co/clyJdk7y6s"]["US-India military support agreement marks a deepening of our partnership based on common values &amp; mutual interests. https://t.co/duHNWRwB4A"]["Toured #Alaska Regional's new NEST facility, 1st dedicated unit treating babies born with substance addictions. https://t.co/HA34ZUA7B1"]["Congratulations to #Alaska Job Corps graduates, and special thanks 2 families &amp; instructors who supported them. https://t.co/AlzgYGI5Fm"]["Congrats to Curtis Thayer, CEO of @AlaskaChamber, who will bring #Alaska's perspective to @USChamber Cmte. of 100. https://t.co/MuvyViwmbs"]["Appreciated briefing by FBI &amp; US Attorney on heroin epidemic facing #Alaska &amp; work they're doing to conquer crisis. https://t.co/7FuYGcm82z"]["Deeply saddened to learn of passing of Kotzebue's Maj. Gen. John Schaeffer, great Alaskan &amp; true American patriot. https://t.co/NZ9b7Jf0SQ"]["An incredible day to be @ the #Alaska State Fair. Good news for fair-goers: sun is sticking around for a whole week! https://t.co/wGYsM5jx1L"]["Congratulations 2 the Plagerman family - bison herders from Delta Junction &amp; Alaska's 2016 Farm Family of the Year! https://t.co/nK0nn4JA5Z"]["1 week left to submit your photos for our Frontier in Focus contest! All skill levels are welcomed to participate. https://t.co/NnZicaSEzS"]["Had a great discussion &amp; delicious Yukon king salmon lunch with Denakkanaaga elders in #Fairbanks this weekend. https://t.co/QYca4TXQed"]["Got to chat about the Olympics with 3x Olympian Kikkan Randall &amp; her colleagues on world-class APU Nordic Ski Team. https://t.co/lQlczpRPen"]["Enjoyed a tour of Mountain View that included the incredible art studio of Alaskan painter/sculptor Alvin Amason. https://t.co/I4tuuNtetx"]["@SenatorBurr - not sure they can compete w/ Dino’s in Anchorage or The Donut Shoppe in Fairbanks. You'll need to come up &amp; help us decide!"]["Couldn’t think of a better guest to kick off my inaugural podcast than Alaska’s @RepDonYoung. Take a listen: https://t.co/F5IeEW0DFh"]["For weeks Obama Admin misled public. Now admits $400M paid b/c of release of #Iran prisoners - definition of ransom. https://t.co/SWZFyCHcWg"]["Honored 2 meet today w/ Gen. Lori Robinson, 1st female commander of major Unified Combatant Command. @NoradNorthcom https://t.co/I7pNQBtCn9"]["Aetna's departure from exchanges further confirms broken promises made by President &amp; those who voted for #Obamacare\nhttps://t.co/hHeU7MBPCF"]["Appreciated the tour, @DougMore42, &amp; the chance to meet with the superb @NorthwestUPSers mechanics, ramp agents &amp; drivers!"]["Woodland Park Boys&amp;Girls Club offers kids in Spenard engaging after-school activities &amp; safe place to be w/ friends. https://t.co/fX92Eq5PYr"]["Great visit to #Kotzebue included interview w/ KOTZ, tour of magnet school, meet w/ Coasties and vets in the region.\nhttps://t.co/YoVsX3asHg"]["6 years ago, #Alaska lost a true champion &amp; other AKns near &amp; dear to us. We'll always remember Sen. Ted Stevens &amp; all he did for our state."][".@SECARMY joined me in Interior to see #ArcticWarriors of 1-25 Stryker brigade &amp; real-world training they receive.\nhttps://t.co/kMNsCjUaNK"]["Gr8 dinner at #Anchorage Fire Station 4 w/ brave men who are determined to keep our community safe &amp; to save lives. https://t.co/Kmz7bkisGx"]["Huge thanks 2 Alaskans who made #AKConquersOpioids Summit a success. Working together, we can conquer this crisis.\nhttps://t.co/ozr1g91KqG"]["Thnks #Kenai River Foundation 4 hosting 10th annual Wounded Heroes event, showing appreciation 2 our servicemembers.\nhttps://t.co/Xgtm3UOIz1"][".@USFWS rule preempting state management ignores federal law, &amp; disregards #Alaska culture,  conservation ethic. https://t.co/wbZeFjYVpp"]["Gr8 wrap-up panel of providers moderated by Dr.Butler. Takeaway: working together, there is hope. #AKConquersOpioids https://t.co/BmT8BiX1D9"]["We are live for our final session of the #AKConquersOpioids Wellness Summit. Watch live at: https://t.co/y4fUMm2TYf https://t.co/ONLaxCcqko"]["\"AK is an incredibly beautiful state w/ strong resilient people committed to addressing this problem.\" - @Surgeon_General #AKConquersOpioids"]["US @Surgeon_General &amp; AK Chief Medical Officer in informal discussion on addiction &amp;  prevention. #AKConquersOpioids https://t.co/bXXJfEGDb7"][".@Surgeon_General Dr. Vivek Murthy speaking live at #AKConquersOpioids Wellness Summit. https://t.co/FDdtPyjFTT https://t.co/7ebwmyb6kJ"]["Senator @lisamurkowski speaking live now at the #AKConquersOpioids Wellness Summit. https://t.co/y4fUMm2TYf https://t.co/FvaJZ7xJaX"]["4 military members who suffer: getting involved in recovery community= key. Medication-assisted treatmt saves lives. https://t.co/TzFWOc2GQe"]["LIVE: Dr Joshua Sonkiss, #Fairbanks Mental Health Services presents on science of addiction. https://t.co/y4fUMm2TYf https://t.co/bjBES7ghiW"]["#Veterans suffer high rates of chronic pain. Most docs are well meaning but don't always have right tools. -Dr. Lee https://t.co/y2IDAUpqGc"]["Speaking now at #AKConquersOpioids Summit, Senior @VeteransHealth Officials, Dr. Jennifer Lee &amp; Dr. Karen Drexler. https://t.co/88cN0O8cXI"]["Traveled 1000s miles 2b here, but my journey nothing compared 2 journey many here have traveled-@HHSGov Dr Wakefield https://t.co/adP4cL2BqB"]["Our military service members in the audience get a big shoutout at the #Alaska Wellness Summit. #AKConquersOpioids https://t.co/CYBmb7V1dT"]["Speaking now at the #AKConquersOpioids Summit, @HHSGov Dep. Secretary Dr. Mary Wakefield. https://t.co/y4fUMm2TYf https://t.co/a40AxFrdg4"][".@CITCAlaska announces new partnership with @SCFinsider to expand treatment services. #AKConquersOpioids https://t.co/QmmaEIrAeK"]["\"I'm proud of recovering addicts. I think they are the bravest people on earth.\" #AKConquersOpioids https://t.co/KedreZDn5l"]["Gloria O’Neill of @CITCAlaska and Jeff Jessee of @AlaskaTrust speak next: https://t.co/y4fUMm2TYf https://t.co/bvtDo5BF5E"]["The AK women who inspired the #Alaska Wellness Summit are speaking live. #AKConquersOpioids https://t.co/y4fUMm2TYf https://t.co/2DrkkOeQ8S"]["The Alaska Wellness Summit: Conquering the Opioid Crisis begins at 9:00 am (AKST). Watch live at: https://t.co/y4fUMm2TYf #AKConquersOpioids"]["Watch the #AKConquersOpioids Wellness Summit live tomorrow beginning at 9:00am at https://t.co/h98d81KveE. https://t.co/p5eaFF7TdH"]["F-35A has met initial operational capability requirements, a positive step toward their arrival at Eielson by 2020. https://t.co/XdxzkcUY1Z"]["Most poignant meeting I've had since becoming US senator spurred #Alaska Wellness Summit: Conquering Opioid Crisis. https://t.co/uodVa96PZJ"]["Honored 2 welcome Commandant @genrobertneller to #Alaska &amp; share our unique training advantages to the @USMC.\nhttps://t.co/h14rsL1SFk"]["Was honored 2 speak at #Alaska homicide Victims Memorial, remembering loved-ones gone but not forgotten. @VFJAlaska https://t.co/2gBlYb0ung"]["Great to have the whole delegation together back in Alaska at the @AnchChamber Make It Monday Forum! https://t.co/McPKyFbIrF"]["Attended premiere of Chasing the Dragon documentary exploring heart-wrenching personal stories of opiate addiction. https://t.co/uUYGfbRsl0"]["I invite all Alaskans to the Alaska Wellness Summit to help us conquer opioid epidemic ravaging our state &amp; country. https://t.co/koGKGIAPqY"]["Happy Ted Stevens Day, Alaska! Let's get out and play in this great land we call home — just as he would want us to. https://t.co/OROlECu2M2"][".@lisamurkowski &amp; I couldn’t have been prouder 2 display beautiful Arctic #Alaska Peonies all the way from Interior! https://t.co/jvwLeGs0Mf"]["Shared bounty of #Alaska w/ my @SenateGOP colleagues today — fresh salmon, halibut, pasta, Mat-Su carrots &amp; more! https://t.co/1SpSln3qYf"]["I urge my colleagues on other side of the aisle to bring back longstanding tradition of bipartisan funding of our military. #FundOurTroops"]["Our enemies &amp; adversaries are the ones who truly gain leverage when we in Congress don’t commit to funding our troops. #FundOurTroops"]["Sen. Harry Reid has filibustered troop funding 4 times since I’ve joined Senate, more than any other legislation. It’s a disgrace."]["…3) #NorthKorea tests submarine-based missile 4) Last Wed, @POTUS announces plans to leave 8400 troops in Afghanistan to combat Taliban."]["… 1) #SecDef Carter announces US deploying 560 troops to fight ISIS 2) @POTUS announces 1K troops to Poland to strengthen NATO east flank…"]["Our nation &amp; our troops need this defense funding especially when, just in past week, major global security developments…"]["Sen. Harry Reid filibustered defense funding in the wee hours last Thursday, probably hoping no one would notice. https://t.co/IaVTHsov0r"]["Strong US leadership is what our adversaries fear, what our allies desire, and what the American people expect. #SouthChinaSea @CSIS"]["America has the opportunity to act as a stabilizing force for peace &amp; prosperity in the Asia-Pacific. #SouthChinaSea @CSIS"]["In future, US must clearly communicate interests b4 China initiates “Gray Zone” maneuver to knock us on heels, limit our response. @CSIS"]["Agree w/ #SecDef – we must fly, sail &amp; operate wherever international law allows, as we have done in western Pacific for more than century."]["US will stand by our longstanding allies and should fully embrace new friends driven to our aid by China’s actions. #SouthChinaSea @CSIS"]["China’s aggressive actions are alienating itself from neighbors. #SecDef Carter said China risks erecting Great Wall of self-isolation."]["Since 2014 China reclaimed 500 football fields of land on Fiery Cross Reef, 40x all other claimants. #SouthChinaSea https://t.co/kBFkaTFX6V"]["China is employing intimidation &amp; coercion toward its #SouthChinaSea neighbors, rejecting idea of being responsible stakeholder. @CSIS"]["Ensuring freedom of nav. plays critical role in preserving rules-based order, maintaining peace, &amp; enabling commerce. @CSIS #SouthChinaSea"]["Freedom of seas is bedrock commitment ingrained in bones of America. It is an integral part of who we are as a people. @CSIS #SouthChinaSea"]["Honored to deliver keynote remarks at @CSIS 6th Annual #SouthChinaSea Conference.  @SoutheastAsiaDC https://t.co/bamLQK2nYJ"]["@SteveDaines stop by my office — we have live bear cams running 24/7! https://t.co/0g754etN4E"]["#Alaska and America’s officers regularly display uncommon courage &amp; professionalism. They deserve the support of all Americans."]["We expect our brave 1st responders to keep our communities safe and risk their lives under great scrutiny. #DallasPoliceShooting"]["Best of luck to Allie Ostrander, #Alaska star runner competing in Olympic track team qualifying finals this Sunday!\nhttps://t.co/AGSZCiJX0X"]["My Express Appeals Act, part of #VeteransFirst, aims to fix VA’s broken benefits appeal process. #Vote4Vets1st #VAAccountability"]["We’re putting #VeteransFirst by strengthening #VAAccountability. #Vote4Vets1st https://t.co/SMxbiXdBgy"]["Wishing all Alaskans a Happy Independence Day! https://t.co/Nm7bz5LNBg"]["I'll be joining Charlie O'Toole on @970KFBX Fairbanks Newsradio in a few minutes. Tune in at https://t.co/qIoZ2k4sbY"]["It’s absurd to suggest #EPA can’t work with local law enforcement, instead needs armed guards w/body armor to conduct compliance checks."]["I believe in an armed citizenry, not an armed bureaucracy. #EPA’s actions in Chicken Alaska demonstrate the problem.\nhttps://t.co/FarYhBovbl"]["The Missile Defense Agency will appreciate all that Kodiak has to offer, including a community that strongly supports our military."]["This year &amp; last in the #NDAA, I highlighted importance of Kodiak Spaceport. I am glad the Missile Defense Agency was listening."]["Great news for Kodiak &amp; #Alaska — Missile Defense Agency awards $80mill contract to AK Aerospace to support missile defense testing."]["#Alaska is the cornerstone of America’s missile defense. Today’s announcement reinforces that fact. https://t.co/VXGkwHmN5o"]["Humbled to meet @SenatorDole, American war hero and legendary statesman with incredible wisdom &amp; stories to share. https://t.co/5gY1dpriQ7"]["Honored 2 meet Marc Rayos #Alaska @CMNHospitals Champ. His spirit&amp;optimism in face of health challenges is inspiring https://t.co/1uTEhXJWxv"]["Proud to raise awareness about #veterans suicide w/ #22Pushups. I challenge my friend &amp; colleague @SenThomTillis.\nhttps://t.co/Ia5a3nArBr"]["@SalenaZitoTrib Glad you’re enjoying the Last Frontier! Beware though — many Alaska residents start out as tourists."]["I’ll be on #Senate floor at 4:50 (12:50 AKT) discussing unique Alaskan tradition of subsistence whaling. Watch at: https://t.co/DstQyHZLQo"]["POTUS: ruling takes us further from country we aspire 2be. I disagree. Our aspirations, from Founders, r 2 not b ruled by aristocratic fiat."]["4 justices, who swore oath to support Constitution—which clearly states Congress writes laws—are willing to discard separation of powers."]["#SCOTUS dealt blow to President’s executive amnesty, which he initiated after failing to get his plan thru Congress. https://t.co/e70WMbYPLb"]["I included a provision in this year’s Defense Authorization mandating a flight test of our missile defense system at least once per year."]["With each #NorthKorea missile launch, Alaska’s missile defense assets become more critical to the defense of our homeland."]["#NorthKorea today launched another ballistic missile “demonstrating progress after 5 failures in 2 months.” https://t.co/WOiELmOgBN"]["Proud to join @VAChair @SenThomTillis @SenatorRounds @JohnBoozman &amp; Sen. Cassidy in discussing #VeteransFirst Act on #Senate floor."]["Took VA nominee to task for not notifying Congress that #VA was abandoning fast-track firing of bad actors.\nhttps://t.co/LmBoQaH4YD"]["Gr8 2 see Tully, from Southeast, who is participating in a swim camp at the US Naval Academy in Annapolis this week https://t.co/4WEgbkMqsT"]["You can't beat the energy of the #Fairbanks Midnight Sun Run where, without fail, you'll make some new friends. 😀 https://t.co/4hKXi4cilv"]["Joining Rick Rydell on AM 650 KENI momentarily to discuss our Second Amendment rights. Tune in at https://t.co/4K3sUIKSR8"]["Wishing my dad, Tom, father-in-law, Bud, and all the great dads across #Alaska a Happy Father's Day! https://t.co/HOPQEQQFYe"]["Met with Interior #Alaska peony farmers, great Alaskan entrepreneurs building new industries &amp; growing our economy! https://t.co/4cXXF781ap"]["Proud to \"Walk a Mile Barefoot\" in Mat-Su, raising awareness about scourge of sex trafficking on our young people. https://t.co/wlGAW1X0qi"]["Has #VA learned nothing? Unconscionable that VA no longer using law 2 quickly fire employees ill-serving our vets. https://t.co/WofgkC29ua"]["Glad to speak with the exceptional young men participating in the American Legion's Boys State program in Wasilla. https://t.co/qbyalZvOCQ"]["No better running buddy than my daughter, Laurel. Getting ready for Midnight Sun Run this weekend in #Fairbanks. https://t.co/jCBUTLxvju"]["Had gr8 time meeting w/ students from Barrow &amp; Fairbanks, as well as bright young Alaskans competing in #NHD2016.\nhttps://t.co/uehUUEgQ49"]["Convened “Polar Bear Summit” in Capitol 2 help resolve NSlope AKns’ concerns about fed. restrictions on subsistence. https://t.co/DRttWrL9AO"]["Proud 2 join @SteveDaines on bill exempting small businesses from FCC’s onerous enhanced transparency requirements.\nhttps://t.co/McCK4w1WKo"]["AK advantages 2 @USAirForce: AsiaPacific combat air power hub; world-class training areas; 3 Red Flag exercises/year; 100 5th gen. fighters."]["Gen. Goldfein, nominee as @USAirForce chief of staff, commits 2 serious look @ basing KC-46 fuel tanker in #Alaska.\nhttps://t.co/t1Kv6VTPjC"]["Stars&amp;Stripes are a symbol of freedom &amp; justice for all because of sacrifice of US military members. Happy #FlagDay!\nhttps://t.co/pMT7ea2lPv"]["Deeply saddened by passing of Fred “Bulldog” Becker IV, selfless advocate for #Alaska #veterans &amp; service members. https://t.co/f3YBNTVaK6"]["Wishing #Alaska @USArmy Spartans, Arctic Wolves, #Army Guard &amp; Reserves a happy #ArmyBDay. Thank you for serving. https://t.co/2bXekjFu7K"]["#VA announces #Alaska Choice Act appt scheduling will soon be handled by local personnel, not Lower48 call-centers. https://t.co/SAG8oGhfgL"]["Horrified by the tragedy this morning in Florida. Thoughts &amp; prayers with the state &amp; families of the victims."]["Glad to speak w/ bright group of @lisamurkowski's interns from all across #Alaska &amp; hear about their future plans. https://t.co/dBoJHLjd0O"]["Lively discussion in @EPWMaj w/ top legal minds about #SCOTUS historic decision to stay #EPA Clean Power Plan.\nhttps://t.co/MKvIU4LH0a"]["Inaugural meeting of the Senate Running Caucus? Good 2 see Sen. @CoryBooker recently out for a jog on the Mall. #tbt https://t.co/nNCSzDDx5A"]["Wishing @repdonyoung — a great friend &amp; strong advocate for Alaskans — a happy birthday &amp; happy anniversary w/Anne. https://t.co/btkiu98PCP"]["Gr8 privilege 2 hear from PM @narendramodi of India, the world’s largest democracy &amp; longstanding friend of America. https://t.co/9JR9SoKCML"]["Proud to join @SenatorIsakson &amp; @SenBlumenthal in cosponsoring bill to increase #veterans disability benefits. https://t.co/W1m5Uuiu15"]["Congratulations to Cam Bohman of Anchorage, celebrating 50 years as a music educator! https://t.co/tr60AJ0MUl"]["Today we honor the troops who stormed Normandy beaches 72yrs ago to liberate Europe from clutches of tyranny. #DDay\nhttps://t.co/fEj7Y9A2W7"]["Why is @POTUS lifting sanctions on the regime his own State Dept said continues 2 be #1 global sponsor of terrorism? https://t.co/of3sB7AdgF"]["Technical glitch or creative editing? The Obama State Dept. is having trouble keeping its story straight: https://t.co/YcQQyRlIaV"]["0.5% GDP growth is abysmal. The American people deserve more than big promises/soaring rhetoric of President Obama.\nhttps://t.co/d16RhpYvBd"]["Joined @SenJoniErnst &amp; @SenCoryGardner at Korea DMZ border; sobering reminder of threat posed by #NorthKorea. https://t.co/HGXImiBmXi"]["Wishing you a safe &amp; peaceful #MemorialDay as we honor our fallen heroes whose sacrifices make our freedoms possible\nhttps://t.co/gkhUt0OD28"]["We are sad to see Alaskan #Senate page Delana go, but she has a bright future and big plans ahead! https://t.co/V5YdSFEJvY"]["I'll be joining the Dave Stieren Show on @KFQD AM 750 / FM 103.7 in a few minutes. Tune in at https://t.co/0djo4XPZTt"]["If we’re serious about growing economy, then commonsense fixes, like relieving regulatory burdens, cannot keep failing on party-line votes."]["During #ObamaEconomy, lowest labor partic. rate since 1978, more in poverty, paychecks have declined, Americans on foodstamps skyrocketed."]["President #Clinton: “Millions of people look @ pretty picture of America @POTUS painted and they can’t find themselves in it.” #ObamaEconomy"][".@TheAtlantic author: \"In the 50s &amp; 60s, US growth democratized prosperity. In 2010s, we’ve managed to democratize financial insecurity.”"]["Recent @TheAtlantic article identified troubling fact: nearly 1/2 of Americans would have trouble finding $400 in event of emergency."]["Today I described the dire straits many Americans find themselves in during this lost decade of economic growth. https://t.co/UIe0KtgCru"]["Americans don’t give up hope easily. But many are losing hope because they haven't seen opportunity during the #ObamaEconomy."]["@1bobcohn You’re welcome. Thanks for publishing quality work."]["#VA Sec comparing wait time 2 waiting 4 ride @ Disneyland is offensive, undermines little confidence vets have left.\nhttps://t.co/8aFTAL0rEi"]["Happy birthday to my good friend, colleague and avid sportswoman @lisamurkowski. https://t.co/H9JE6iktCk"]["Congrats 2 #Alaska service members recognized at @missiledefadv ceremony. Your work keeps our state &amp; nation safe. https://t.co/kPJVFsHkjN"]["IOC must also look at past #Olympics, strip doping athletes of medals. Good-faith athletes &amp; rightful winners deserve nothing less."]["Many athletes have overcome great odds &amp; obstacles to compete at #Olympics. Their hard work &amp; unbridled determination must be respected."]["Russian doping scandal, allegedly w/ endorsement of Putin, undermines trust in fair competition, spirit of respect among nations. #Olympics"]["Today I sent letter 2 IOC President urging him 2 ban Russia from #Olympics, pending outcome of doping investigation. https://t.co/etzUG28tXN"]["President of Int'l #Olympics Committee said alleged Russian doping scheme would represent “unprecedented level of criminality.”"]["I was disturbed 2 learn of Russia's alleged widespread doping scheme at prior #Olympics across a variety of sports. https://t.co/99C8W50djR"]["This #PoliceWeek we honor our noble officers who risk their lives 2 protect us. May God bless them &amp; their families. https://t.co/hkp9ED9NYJ"]["Gr8 videos happen when GOP channels Wes Anderson. Gr8 things 4 America happen w/GOP majority: Senate #BackToWork. https://t.co/BFiagb0nCy"]["#EPA settles w Wyoming man after threatening $16mill fine over pond on his property. Outrageous example of overreach https://t.co/noZS8jcaKn"]["Joining @hughhewitt shortly. Hope you can tune in! Listen live here: https://t.co/8w8lgIvgwr"]["Great write-up of memorable, tense, historic landing of world-record holder, 97lb. king salmon, 31yrs ago today. https://t.co/x4Lwire6r9"]["Congrats to Eric Fanning, just confirmed as SECARMY. Appreciated his recognition of Alaska’s strategic importance &amp; need for larger @USArmy."]["Honored to meet Captain Jim Lovell of the Apollo 13 mission recently at the National Air &amp; Space Museum. https://t.co/jAKgMwWXjr"]["Thanks 2 the Alaskans who honored the service of Hmong-American veterans of Vietnam War yesterday in Anchorage. https://t.co/jhRg8DEh9S"]["#Fairbanks Ice Dogs take home their 3rd national championship in the last 6 years. Great job, guys! @fbx_IceDogs https://t.co/gZ6D6l11y1"]["Congrats to Alexie Evan, middle schooler from Goodnews Bay #Alaska on winning a national reading award! https://t.co/lfNXlB3qwW"]["Economic future 4 our children is limitless if we have a federal government that is a partner in opportunity, not the obstacle it is today."]["For decades, the American economy &amp; our workers have been the envy of the world. Not with #ObamaEconomy \"new normal\" of  &lt; 2% growth."]["The % of Americans who own homes—a marker of the promise of the American Dream—is down 5.2 percent during #ObamaEconomy."]["During nearly 8 years of the #ObamaEconomy, # of Americans participating in the labor force is now at its lowest rate since 1978."]["Honored 2 deliver Weekly #GOP Address on the lost decade of economic growth we've experienced in the #ObamaEconomy.\nhttps://t.co/lDHsOiDAq0"]["Hopefully we can restore separation of powers, enshrined by Constitution, which #Obama Admin has persistently &amp; egregiously disregarded."]["Judge Collyer's #Obamacare ruling is an overdue rebuke of President Obama’s habit of acting well beyond his constitutional authority."]["Judge Collyer wrote Obama Admin’s defense was “a most curious &amp; convoluted argument whose mother was undoubtedly necessity.” #Obamacare"]["Court found Obama Admin. “violated Constitution” in sending billions in subsidies to health insurance companies, w/o the assent of Congress."]["Federal court delivers major victory for American people &amp; rule of law, striking down portion of #Obamacare. https://t.co/ySAaraT2Ih"]["Thank you to all of our #Alaska State Troopers who have admirably protected our communities &amp; wildlife for 75 years. https://t.co/IpJaBXhHoD"]["Joining the Tom Anderson Show momentarily on KOAN AM 1080 and FM 95.1 in Anchorage. Listen online at: https://t.co/uq4cXlrlo1"]["NYT: Euro banks scared 2 invest b/c terrorism &amp; human rights. Yet @JohnKerry in Europe drumming up business 4 #Iran. https://t.co/b6VEQVkzwH"]["Group combating terror financing called Iran a threat 2 global financial system. @JohnKerry pushing banks 2 invest. https://t.co/yB6J4E4IUx"][".@JohnKerry=1-man Chamber of Commerce 4 Iran, urging Euro banks 2 invest in world’s largest state sponsor of terror. https://t.co/3lfTj435Cc"]["Americans deserve the truth about our stagnant economy. And they need less government burdens on job growth &amp; economic opportunity."]["Obama administration will soon be 1st in history to propose 80,000 new pages of federal regulations in a single year. #regulationnation"]["Year after year, bureaucrats keep piling on more &amp; more regulations. It’s unsustainable, and a drag on our economy. https://t.co/XDt4oN8BCx"]["We can create opportunity for all Americans. First, we need 2 get control of a fed. gov’t that wants 2 regulate every aspect of our lives."]["I was shocked when Secretary #Clinton said she’d put coal miners out of work. That mentality is part of the problem.\nhttps://t.co/kTkOwY3XBt"]["We can’t settle for another lost decade of economic growth. Growing our economy is a moral imperative. #obamaeconomy\nhttps://t.co/moJCG58mTG"]["President Obama’s “new normal” of economic growth means our kids &amp; future generations won’t have same opportunities we had. #obamaeconomy"][".@POTUS claims by every economic measure we’re significantly better off than 7yrs ago. That’s simply not true:\nhttps://t.co/OjnGswMhXl"]["The only comparison that should matter is how our current economic growth stacks up against historic American growth."]["President Obama also says at least we’re growing better than Europe. Even that isn’t true anymore: Last quarter – US: 0.5%, Europe: 2.2%."]["Obama admin. defends &lt;2% growth as the “new normal.” The American people should not be satisfied with that explanation. It’s a surrender."]["America was made greatest nation in world with avg. historic growth of about 3.7%. Obama administration has failed to ever even reach 3%."]["Stagnant economic growth of Obama administration is an outlier among Dem &amp; Repub administrations. https://t.co/FGbYXzzK1e"]["Gross Domestic Product (GDP) is basically the health of the American economy – a measure of opportunity available to our citizens."]["The troubling 0.5% growth last quarter went unaddressed by the Obama administration and most reporters, leaving Americans in the dark."]["Congress and the President aren’t talking enough about the stagnant economic growth over last 10 yrs &amp; what it means 4 average American."]["Speaking now on the #Senate floor about America's lost decade of economic growth during the Obama administration. https://t.co/h70s6Kcf0K"]["Spoke today on floor about Pres. Obama’s emerging legacy of not leveling w/ the people about our involvement in Iraq https://t.co/tNCPaqJTQW"]["Congrats 2 Liam, Johann &amp; Lyndsay of Homer High - top10 finalists in nationwide Toyota TeenDrive365 video challenge! https://t.co/2WC5CZfrtA"]["Opportunities for #Alaska #veterans to speak with #VA Asst. Dep. Undersecretary Dr. Yehia in Fairbanks &amp; Anchorage. https://t.co/zsmHMcRr7K"]["Been blessed w/ 3 strong women who exemplify the unique, selfless love we recognize in moms. Happy Mother’s Day! https://t.co/iiuxVBjjdL"]["Strength&amp;resilience of military spouses is testament 2 their deep love of country &amp; our brave servicemembers. #MilitarySpouseAppreciationDay"]["Team Sullivan was out in force this week for Spring Clean! Thanks 2 all AKns preparing for an epic #Alaska summer. https://t.co/gngHAUuuzc"]["China pursuing a “strategic triangle” in S.ChinaSea. Frequent US freedom of navigation exercises are imperative. https://t.co/mpT96tK0zY"]["Glad 2 welcome #Alaska students from Unalaska, Nenana, Wrangell, Craig, Ninilchik &amp; Mat-Su 2 Capitol w/ @Closeup_DC! https://t.co/C0Jy0JHS5e"]["So glad I was able to welcome distinguished #Alaska Honor Flight #veterans of WWII, Vietnam &amp; Korean Wars to DC.\nhttps://t.co/6ihzntbYH0"]["Kudos to DeAndre Levy w/ @Lions for encouraging athletes to speak up against sexual assault, culture of violence. https://t.co/bk7HNUWwhm"]["Greg Razo of Anch is 1of10 recognized @ WhiteHouse 4 giving those w/ criminal record a 2nd chance @ successful life. https://t.co/ljzdcn03w0"]["Group of #Alaska vets departed Anchorage today on an Honor Flight to DC. Can't wait to welcome them later this week. https://t.co/l0qC8QsdJr"]["Most importantly, production at Pt. Thomson brings #Alaska closer to realizing an Alaska natural gas pipeline."]["The 10K barrels/day that will flow thru trans-Alaska pipeline will boost state coffers &amp; open up eastern North Slope for more exploration."]["So far, Exxon has spent $4 billion+ on developing Pt. Thomson, contracting with more than 100 #Alaska companies."]["I’m pleased Exxon abided by terms my #Alaska DNR team and I negotiated, including firm time tables &amp; strong Alaska-hire provisions."]["AKns finally seeing production @ Pt Thomson, foundational to commercializing North Slope gas. Good news for #Alaska. https://t.co/p9Y923iuee"]["Joined @ktmcfarland on @FoxNews to discuss President’s visit to Saudi Arabia and America's standing with our allies. https://t.co/3CiuTf3p7z"]["Had great big group of young AKns visit from Colony, Juneau-Douglas, Thunder Mtn, and Aleutians-East w/ @CloseUp_DC. https://t.co/60xJLKkNJn"]["Doves crying today. Farewell to one of the most talented and creative musicians of my generation. #Prince\nhttps://t.co/e9tmttHtOD"]["How many more choices eliminated, families crippled, promises broken b4 @POTUS works 2 fix unraveling #Obamacare catastrophe he created?"]["Largest health insurer departs nearly 34 #Obamacare exchanges, leaving 1million Americans with 1 health plan choice. https://t.co/FxElzv7Crb"]["Proud of athletes &amp; volunteers of @SpecialOlymAK. We had fantastic time @ annual auction benefitting a great cause. https://t.co/c2tTdxdM2u"]["Gr8 meeting w/ Pastor Natcher, Fr. Mencias, Jessie Vizcocho &amp; Joseph Cayabyab of our strong AK Filipino community. https://t.co/eAJxcRsx5D"]["Celebrating @KaladiBrothers 30th anniversary the best way I know how - a delicious latte. #kbc30 https://t.co/uHNzdMJ7iU"]["More AKns are employed by fishing industry than any other, and countless #Alaska communities rely on our healthy, abundant fisheries. #MSA40"]["Today is 40-year anniversary of the Magnuson-Stevens Act, which resulted in world’s best-managed fisheries, particularly in #Alaska. #MSA40"]["I've run the Mall countless times, but it's amazing how you can always come across something new &amp; inspiring.\nhttps://t.co/Y07aHNx4FU"]["With our unmatched training ranges &amp; strategic location, #Alaska will continue to play important role in deepening US relationship w/ India."]["Later this month, components of Indian Air Force will join in Red-Flag #Alaska, most realistic, large-force air exercise in entire DoD."]["Close US-India relationship key 2 safeguarding trade, ensuring freedom of nav. in AsiaPacific, given China’s ongoing hegemonic aspirations."]["Encouraged by important US &amp; India bilateral agreement – sharing military bases for repairs, refueling &amp; support. https://t.co/e9roZ8XGQF"]["Glad to hear the two Alaskans stranded on Bear Glacier have been rescued. A big thank you to the brave #Alaska Air Guard rescuers!"]["Maddie goes to leaps&amp;bounds to put a smile on your face. Wishing u &amp; your 4-legged friends a Happy #NationalPetDay! https://t.co/fxTZb8I434"]["To stop the Obama Administration's effort, I introduced a simple bill: state terror sponsors should have no access to US dollars. #Iran"]["Yet now reports are Obama Administration poised to give Iran access to US dollars through offshore “clearing houses,” bypassing Congress."]["President's nuclear deal did not mandate lifting US financial sanctions on #Iran, or giving regime access 2 most powerful currency in world."]["Giving #Iran, the world’s largest state sponsor of terrorism, access to U.S. dollars is unacceptable. https://t.co/Y1wphMpiiu"]["Had a gr8 meeting w/ Cindy Harris of Soldotna, Alaskan ambassador for the @alzassociation. #ENDALZ #alzforum https://t.co/UCNTqYnJjR"]["Best wishes to the 40 young Alaskans gathered at @ANSEP_AK Academy, learning STEM fields for great future careers. https://t.co/lBclfzc89u"]["Congrats 2 Levi, Anna, John and Kyle of #Kodiak High; winners of 2015 NASA World Wind Europa Challenge! https://t.co/2oEJ7vUedy"]["Honored to join @Bonnie_at_Taps, Catherine Stevens &amp; Taylor Dudley at #TapsGala. @TAPS4America https://t.co/p2yrSFhVK4"]["Gr8 to see high schoolers touring nation’s capital from Delta Junction, Bethel and Susitna Valley! @CloseUp_DC https://t.co/FBDSIxktf2"]["Voted early, but sported my sticker today in DC. Anchorage, exercise your right - and duty - to vote! #VoteANC2016 https://t.co/oKoyVT58ny"]["#Alaska @girlscouts sold 375,000 cookie boxes this year (a few of which went 2 Sullivan household). Great job girls! https://t.co/dODVAujvS5"]["With rising threats in Arctic, on Korean Peninsula, &amp; in South China Sea, these elite aircraft cannot arrive soon enough. #EielsonF35s"]["Combined w/ existing F22s, C17s, F16s, E3s and Air Guard C130s, KC135s &amp; rescue squadrons, #Alaska has become critical hub of air power."]["Appreciate @usairforce responsive 2 AK CODEL's language included in defense authorization, re: #Alaska's strategic location, training assets"]["The @USAirForce decision will bring 54 new aircraft and 2,765 additional residents to Interior #Alaska. https://t.co/pVoibVzVlI"]["At the table as we get word @usairforce is basing F-35 squadrons at Eielson. Couldn't be happier 4 Interior #Alaska. https://t.co/XKq1LuA2C6"]["Denali, in all its glory, on my flight up to Fairbanks. #onlyinalaska https://t.co/7YCQBffS1j"]["The final is just about an hour away as @UAAWBB compete in NCAA DII National BBall Championship. Go @UAASeawolves!! https://t.co/vrpy5MrnnS"]["A Sullivan family favorite for Sunday lunch after church - Judy's Cafe in Anchorage! https://t.co/4a8Dk7WvaY"]["Glad 2 speak with #Alaska Youth Court students. Justice is in good hands with this next generation. https://t.co/UYztaGOmo9"]["Toured the newest &amp; best the @uscoastguard has to fly, the MH 60T, at #Kodiak Air Station. https://t.co/eeNaJxhQyz"]["Official meeting of #Alaska Congressional Beer Caucus @ #Kodiak Island Brew Co (keeping a seat warm 4 @RepDonYoung)! https://t.co/YTLfvE9dc7"]["My staff members are proud to #907goblue today in support of victims &amp; survivors of child abuse and neglect. https://t.co/PyZiPc1CZe"]["Having wonderful time in #Kodiak, home to some great Alaskans, &amp; of course, the biggest brown bears in the world! https://t.co/7reuVmzwxW"]["Congrats 2 #Juneau's new mayor, Ken Koelsch, a distinguished community leader, who was sworn in this evening. https://t.co/QlanXFFih1"]["1867 cartoon shows ridicule William Seward endured 4 #Alaska purchase. Today, we celebrate his foresight &amp; wisdom. https://t.co/rBt5Fmh3Eh"]["My DC staff are safe &amp; accounted for amid reports of a shooting at the #Capitol. Grateful for the professionalism of @CapitolPolice."]["I hope you are enjoying a restful, blessed day with family and friends. Happy Easter! https://t.co/WP2vYh7Dwo"]["I'm disappointed John Sturgeon didn’t get decisive victory he deserved. We must continue 2 stand up when fed agencies ignore ANILCA. #Alaska"]["In #Alaska, our land and waters are our lifeblood. The more the federal gov't takes, the less control we have over our economic destiny."]["Alaskans are gratified #SCOTUS, in 8-0 ruling on Sturgeon v. Frost, recognized unique nature of #Alaska &amp; 9th Circuit's flawed decision."]["We must remain vigilant in face of terrorism, which threatens all free people, regardless of ethnicity, age, gender, creed. #BrusselsAttacks"]["The United States will always stand in full faith with the people of Belgium and all our European allies. #BrusselsAttacks"]["Americans join the people of Belgium in mourning tragic loss in a horrific act of murder. #PrayforBelgium #Brussels https://t.co/pRZxaoHq43"][".@USArmy officially announced today it's delaying reduction of #Alaska 4-25 stationed @ @JBER_Official. My reaction:\nhttps://t.co/3cI7NevOu5"]["#SecDef Carter testified today he would support @USArmy rec. to retain 4-25 Infantry BCT in #Alaska @JBER_Official.\nhttps://t.co/nfZrvpYmBd"]["40 days since #Alaska AG Richards requested authority 2 prosecute Bill Allen. Here is background on case: https://t.co/RMfRtZR4L2"]["No visit is complete without a selfie! Good 2 have #Alaska @CloseUp_DC students stop by my office. https://t.co/MfbBpjo8X5"]["Kudos @AKSenMajority @AKSenateDems 4 passing April Sexual Assault Awareness Month resolution. Let’s keep at it to end  the scourge! #akleg"]["Voted against making labeling of genetically modified salmon optional. Americans should know if “salmon” they’re eating is real deal. #GMO"]["Here is my full statement on the President’s #SCOTUS nomination. #GiveThePeopleAVoice https://t.co/1JscyGlzuG"]["Shell’s #Alaska ordeal: 7 yrs &amp; $7 billion to drill one well, largely due to confusing regs. Few, if any, companies could afford a repeat."]["For #Alaska OCS production 2 be realized, we need regulatory certainty &amp; willingness by feds to work with, not against, lease holders."]["Dept of Interior’s #Alaska OCS lease plan is akin 2 car dealership announcing lease sale without providing any keys. https://t.co/AvOqhRnup5"]["From carrots, berries &amp; Qiviut, 2 our lettuce &amp; hardy barley, #Alaska #ag is diverse &amp; growing. Happy #AgDay2016! https://t.co/1knwgFKQhU"]["Congratulations Dallas on your record-breaking victory w/ dad coming in close 2nd! Mitch must be a proud dad &amp; Dallas a proud son. #Iditarod"]["It’s been an honor serving alongside @repdonyoung who today begins his 44th year serving as Alaska’s Congressman. https://t.co/apY7PiHqQE"]["Rooting 4 the Lady @UAASeawolves as they compete tonight in the NCAA D-II West Region basketball championship! @uaanchorage @uaawbb"][".@repdonyoung and I took questions from astute young students visiting DC from Colony, Mears and Houston Jr. High. https://t.co/cck17WQtpF"]["Wishing Todd Palin, #Alaska snowmachine champ, a speedy recovery."]["Great feature of #Alaska Air Guardsman Lt Col Komatsu, helping veterans tell their stories &amp; engage their community. https://t.co/m1UcHfBj0y"]["Good luck to all of the athletes competing this weekend at the @SpecialOlymAK Winter Games! https://t.co/EcOvtZDiO4"]["Congrats Lucas Arthur, Wasilla &amp; Kiera O'Brien, Ketchikan, Alaska’s exceptional delegates 2 #USSYP! @SenateYouth https://t.co/U7vWRES8LQ"]["Grateful 2 have served under General Lloyd Austin, 1 of finest military officers I've known, now CENTCOM commander. https://t.co/SxiLIT6Hyp"]["Happy to welcome Canadian PM Trudeau to DC, &amp; discuss strong, cooperative relationship btwn #Alaska and #Canada. https://t.co/v41hPdOSoJ"]["Honored 2 recognize my wife Julie, a treasure to me &amp; our state, @ last week’s speech to #Alaska Legislature. #tbt\nhttps://t.co/2HKtAKrfcw"]["#CARA is comprehensive — bolsters prevention, new tools for law enforcement, &amp; proven recovery methods 2 help give people their lives back."]["Their testimony reinforced for me that #Alaska is grappling with this opioid epidemic just like other states. #CARA"]["Met recently with a group of Alaskans from across state who described abject devastation from rampant heroin and opioid abuse. #CARA"]["Proud to be a cosponsor of #CARA addiction and recovery bill, which just passed the #Senate by a vote of 94-1.\nhttps://t.co/GYgxxYH5bx"]["Great 2 meet with young #Alaska fishermen &amp; women in DC with @AKFish4Future #aknextgenfishtour! https://t.co/9dHmj7ANpI"]["Today’s #Iran missile test demonstrates regime is intent on being destabilizing force. Administration's response must be swift &amp; deliberate."]["Good luck to our amazing young #teamalaska athletes competing at #AWG2016 in Nuuk! Thank you for representing #Alaska well. @AWGTeamAlaska"]["@FoodBankofAK Thank you for stopping by and for your incredible work to feed Alaskans in need."]["Saddened to learn of the passing of Nancy Reagan, one of our nation's foremost first ladies. Our prayers are with her family."]