["@PattyMurray @SecretaryZinke La Push, WA. We're fighting for these views and the coastal economies that surround them. https://t.co/NqFHoERBTZ"]["WA’s coastal economies rely on healthy, sustainable oceans with strong fisheries, recreation opportunities, shipbuilding, trade, seafood processing, transportation, and tourism. Developing oil and gas off our coasts threatens every one of these industries."]["My firefighting technology legislation would combine real-time fire mapping and GPS locating to give our firefighters more safety and security as they deal with these unbelievable conditions. https://t.co/3e3zPSCUEs"]["Offshore oil and gas development poses a direct threat to Washington state jobs in coastal communities like Grays Harbor, Ilwaco, Aberdeen, and Port Angeles. See my full statement --&gt; https://t.co/dT4O7Mfj1c"]["Today, I demanded answers and greater transparency about @interior's decisions in preparing and revising the offshore oil and gas drilling plan. I am strongly opposed to this plan. https://t.co/JzfOz3zumy"]["Yesterday, @SenCoryGardner and I introduced bipartisan legislation to modernize firefighting technology. https://t.co/JOx8nsg2OQ"]["Washingtonians want to keep thriving on the coast and I will fight to protect their jobs, communities, and environment. https://t.co/XHPMKlcX6B"]["We can save serious $$$ and improve health outcomes by helping patients transition from nursing homes to community-based care. I received a commitment today from HHS Sec. nominee Alex Azar that he'd help me pursue faster implementation of critical community-based care programs."]["This morning I made it clear to HHS nominee Alex Azar: proposals to block grant and cap Medicaid are NOT innovation. They are simply a budget mechanism to cut Medicaid."]["ICYMI: Earlier today I stood up for net neutrality and the open internet. Here's what I had to say. https://t.co/dA6ujCXYBI"]["Today, 36 of my Senate colleagues and I told @SecretaryZinke to abandon this effort to allow offshore drilling."]["The Trump Administration’s proposal to allow drilling off the coast in the Pacific region represents an outrageous attack on our coastal economies, culture, and environment."]["Over the last several years the biggest job growth we have seen in America has come from internet businesses. We cannot allow the FCC to put a chokehold on the internet by allowing big corporations to artificially charge consumers more. #ProtectNetNeutrality"]["In October, GAO put out a report that the cost and impact to the federal government of #climatechange is in the billions of dollars. This NOAA report underscores our need for action. See the full GAO report here: https://t.co/DUXCNmOiwk"]["According to @NOAA, 2017 was the most expensive year for climate and weather disasters. We must start doing things that will help us address climate change, reduce the risk, lower the cost, and better protect our communities. https://t.co/4YcQS6rAPB"]["Coastal communities will face drastic sea level rise and changes in the frequency and intensity of storms."]["Western states will continue to face record-breaking wildfire seasons."]["Ocean acidification will mean a decrease in Washington state’s shellfish harvest."]["Congrats to Washington state Teacher of the Year @MandyRheaWrites of Spokane for being named as a finalist for national teacher of the year! #TOTY18"]["This @NOAA report is real life picture what the GAO told us in October: the cost and impact to the federal government of climate change is in the billions of dollars, and in the trillions of dollars over the next decade. The time for action is now. https://t.co/pTlAWFFRd7"]["This plan is an outrageous attack on our coastal communities. will fight to protect their jobs, culture, and environment. https://t.co/AlFZdAzjhg"]["This is an outrageous attack on our coastal economies, culture, and environment. Washingtonians want to keep thriving on the coast and I will fight to protect their jobs, communities, and environment. #ProtectOurCoast https://t.co/hmtjE6OEiA"]["The Trump Administration’s proposal to allow drilling off the coast in the Pacific region, despite the vocal opposition of local communities and every west coast Senator, represents an outrageous attack on our coastal economies, culture, and environment. https://t.co/yp6fS6fPgx"]["“Modernizing the [Columbia River] treaty to suit current and future needs is critical to both [US and Canada].” @theColumbian https://t.co/CLuH2xfNXw"]["Millions of Americans depend on rail service each day, and businesses in every corner of U.S. depend on freight rail to keep commerce running. We should be doing everything in our power to address train safety issues as quickly as possible. @seattletimes https://t.co/lIwzhnGw1F"]["Congrats to @SenTinaSmith and @GDouglasJones, who were both sworn in earlier today as my colleagues in the Senate!"]["#ArcticRefuge: Many people over many decades have fought for this great area of our country to maintain its environmental stewardship. Republicans are trying to throw it away to pay for tax breaks for corporations."]["Get this: The #GOPTaxBill REQUIRES that the #ArcticRefuge be managed as a petroleum reserve."]["The #GOPTaxBill could never pass through regular order. And under this sham process, one of our nation’s wildest and most pristine areas will be turned into an oil field."]["The #arcticrefuge is home to:\n \n47 different species of mammals – including Polar bears, grizzlies, caribou\n \n40 species of fish \n \n200 species of birds\n \nWhy would we destroy this? Why? https://t.co/ZPln8H6cSe"]["Do not sacrifice the Arctic National Wildlife Refuge to oil development. Don't take one of the great wild, pristine places on this planet and turn it into an oil field. We can do better as a nation."]["We didn't create the Arctic Coastal Plain, but I can tell you this: We cannot recreate it. \n\n#ArcticRefuge \n\nhttps://t.co/xreUXJLPXs"]["Under this sham process, this bill will turn one of our nation’s wildest and most pristine areas into an oil field."]["Congrats to @PNNLab for receiving grant as part of @ENERGY's $12 million program to improve #solar forecasting https://t.co/dS7PJXn2mk"]["Under this #GOPtaxscam 35.08 million middle class households will see a tax INCREASE by 2027 via Joint Committee on Taxation. The #GOPtaxplan gives more than a trillion dollar tax break to Wall Street, but leaves Main Street and middle class families behind."]["I'll be on the Senate floor soon to talk about the Arctic National Wildlife Refuge and the #GOPtaxscam bill that turns the refuge into an oil field. Watch here: https://t.co/aH7uKf26B2"]["Thanks @MClyburnFCC for joining me today to talk about #netneutrality. Did you miss our town hall? Watch it here --&gt; https://t.co/nBWAUz28be"]["I’m live NOW with @mclyburnFCC to answer your questions about #NetNeutrality. The fight is not over. Reply with your questions! https://t.co/1PFrKm32rZ"]["Senator Cantwell and FCC Commissioner Clyburn Host a Town Hall on Net Neutrality https://t.co/sxfUI9zgCb"]["I applaud the @SenateBanking decision to reject Mr. Garrett’s nomination to the @EximBankUS . The president needs to send us a qualified nominee who wants to see the bank succeed. Here's my full statement: https://t.co/Gb1KEmAMcJ"]["Get your questions in now! #NetNeutrality https://t.co/dImyLMYaqu"]["Join @mclyburnFCC and me TODAY 11 am PST for an online town hall on #NetNeutrality The fight to save and protect the open and free internet isn’t over. We have to keep the conversation going. Ask your questions using #NetNeutrality"]["Keep your questions coming! @MClyburnFCC and I will be answering them live on Twitter today at 2:00ET/11:00PT #netneutrality"]["Here's my full statement on today's tragic train derailment near Olympia https://t.co/PWV36XwNlQ https://t.co/d80qfhHBbe"]["The fight to save #netneutrality isn’t over. We have to keep the conversation going. Join @mclyburnFCC and me TOMORROW (12/19) at 11 am PST for an online town hall."]["Retweet if you'll be joining @MClyburnFCC and I for our online townhall tomorrow at 11:00am PT/2:00pm ET! https://t.co/LiocQt1Fdm"]["@MClyburnFCC @PeriscopeCo @Twitter What do you want to know about #NetNeutrality and the free and open internet? We want to hear from YOU. cc:"]["I want to hear your questions about #netneutrality. @MClyburnFCC and I will answer them live TOMORROW on @PeriscopeCo @Twitter at 11am PST."]["Following the derailment near Olympia closely. Praying for everyone on board and affected by this. Thanks to our first responders. Follow @wsdot_tacoma and @wspd1pio for updated information."]["Today, this became a reality for rural schools: “By allowing ISPs to limit access and increase costs, the draft order could threaten educational equity and exacerbate the digital divide.” -\n @the_daily_news https://t.co/AIbwI3Dckn"]["Today’s #NetNeutrality decision threatens our booming innovation economy and is going to cost consumers. That’s why I’m introducing legislation to block the @FCC’s decision and save the #openinternet https://t.co/iKwex5b3Bm"]["The battle for net neutrality is one of the most important economic battles here in Puget Sound. It’s about keeping innovation going. We never know who the next big internet or tech company is going to be. #ProtectNetNeutrality"]["The GOP tax bill will potentially have a crippling impact on our nation’s most important program for building and preserving affordable housing. As many as 800,000 fewer units of affordable housing will be built over the next ten years because this bill."]["Something to think about before you repeal #netneutrality rules, @FCC: Every business plan of every start-up relies on the ability to contact consumers and communicate. Keep the internet free and open."]["I joined @PattyMurray and 20 of our colleagues calling on the @FCC to delay its decision on #NetNuetrality. Repealing open internet rules could harm our nation’s students and schools—especially those in rural and low-income communities. https://t.co/M9G7JlKQNu"]["Repealing #NetNeutrality rules creates two lanes for the internet. Fast for those who can pay. Slow for people who can’t. \n\nRetweet to tell @AjitPaiFCC to abandon his ill-conceived plan to dismantle strong open and free internet rules."]["We have an #internet economy that is the envy of the world. 5 of the top 10 #fortune500 companies are US #tech companies. On Thursday, @ajitpaifcc is planning to REPEAL THE RULES THAT MAKE THIS INTERNET ECONOMY POSSIBLE."]["When you have a lack of investment in affordable housing, the problem exists everywhere. Expanding the #LIHTC will help us address the housing crisis in both our rural and urban communities."]["Washington state's internet economy:\n\n- 13,000 #tech companies\n- 250,000 jobs\n- 13% of state economy\n\n#ProtectNetNeutrality"]["Live on Senate floor: I don't think the American people want cable companies to be the gatekeeper on the #internet. They want to have the @FCC continue to play a role in making sure that an open internet is there for all. https://t.co/aH7uKf26B2"]["Today at 1:15ET/10:15PT I will be joining @BPC_Bipartisan to talk about how affordable housing &amp; #LIHTC can improve health and reduce health care costs. Watch live here: https://t.co/iTA4MTp6TN"]["Tearing down #Netneutrality rules is going to cost $$$ for consumers and internet businesses. https://t.co/aKOmMHLMO8"]["A patient is on her way to Harborview in an ambulance. Her medical records have to get from one hospital to another at life-or-death speed. Her home town doctors rely on a free and open internet to respond quickly and save her life."]["Net Neutrality rules are essential EVERYWHERE. Here’s an example:"]["Congratulations to my newest colleague in the Senate, @gdouglasjones. Looking forward to working with you!"]["Warmest wishes to all our friends and those around the world celebrating the first night of #Hanukkah tonight. https://t.co/cxQFkGHfPc"]["We expect #AI will be an incredibly transformative force for growth and productivity.  We need to be ready for it. See my FUTURE of AI Act here ---&gt; https://t.co/l6Cwf91o8E"]["Looking forward joining @BPC_Bipartisan to talk about  expanding the #LIHTC to address the #affordablehousing crisis and improving health https://t.co/4rG1mSRjpj"]["Today I introduced a bipartisan bill with @SenToddYoung @SenMarkey @RepJohnDelaney @RepPeteOlson to further understand and promote development of artificial intelligence and drive economic opportunity https://t.co/FqlkNA4doJ"]["In Olympia today talking with housing advocates on how the GOP tax bill will do irreparable harm to affordable housing and home ownership https://t.co/yBCqMpuxST"]["I'm calling on @Interior Inspector General to add @SecretaryZinke's use of taxpayer-funded helicopter rides to the ongoing investigation into his use of taxpayer-funded private jets. If he misused public funds, he should write the treasury a check for the full amount &amp; apologize."]["Congress should strike the language turning the #Arctic National Wildlife Refuge into an oilfield and start over."]["The dismal response to this lease sale proves what we’ve been saying all along: even the small amount the GOP claims will be raised by drilling in the #Arctic is a sham. https://t.co/GYi4MSPAq8"]["DYK - Record number of people are spending more than 50% of their income on housing and it is unsustainable. Great conversation today on #affordablehouing with @AtlanticLIVE https://t.co/d5az0uF625"]["It’s time to address the affordable housing crisis and yet the GOP tax bill will make it harder to build more affordable housing."]["I’ll be talking soon with @beccarosen about the dire need to address our nation’s housing affordability crisis at a housing forum hosted by @theatlantic. Tune in here: https://t.co/4apDD9AFmR"]["Take a stand for net neutrality and the #OpenInternet https://t.co/NWQkilDgYF"]["Dear @FCC, don’t slow down our internet connections. Don’t hurt our economy. Don’t hurt American business. Invest in innovation and keep an #openInternet for the future."]["DYK - Almost three million Americans rely on the internet economy today. We must keep an #openinternet and #netneutrality"]["Seattle-based @Avvo on #NetNeutraility: “Turning the internet into a toll bridge could bring on an ice age — potentially chilling how consumers access information.” https://t.co/cs4pQiL7B8"]["Senator Franken’s actions are disturbing, egregious, and demonstrate a pattern of serious misconduct and abuse. It is time for Senator Franken to resign from office."]["Our economy needs to continue to grow, and it needs to grow for EVERYBODY. Spending this much money on the GOP tax plan without focusing on middle class priorities like making housing more affordable is just wrong. https://t.co/Ph5dBfcTvF"]["We need to give the 17,000 Dreamers in Washington state the certainty they need to continue to live out the American dream. https://t.co/qlNOlOQ0KV"]["Crazy idea: we should be investing in health care, education, and affordable housing. \n\nPer @voxdotcom, the GOP tax bill “is investing heavily in the wealthy and their children” https://t.co/AOGU0P2SJf"]["The bad news on the #GOPTaxBill won’t stop coming. \n\n“Tax reform in 2017 doesn’t include any ideas for making homes more affordable.”  via @CityLab https://t.co/Ph5dBeViE7"]["RT if you’re one of the 56% of Americans who disapprove of the GOP tax plan. \nhttps://t.co/QcEr5QWYqm"]["One of the first pieces of legislation I sponsored when I got to the Senate was the DREAM act. We need to pass this legislation before the end of the year to protect Dreamers. Read: https://t.co/IBojGVUsyJ via @EverettHerald"]["From Seattle to Spokane, Washington state has led the way to make certain that all residents feel part of our communities. Our economy and society are better for Washington state’s determination to create an inclusive society. #protectDACA"]["Graciela N. is a former intern in my office and a #DACA recipient. She graduated from @UW and has set a new goal of attending law school. Ending the #DACA program is a heartless decision that will hurt people like Graciela and denies economic prosperity."]["#Arctic National Wildlife Refuge. #BearsEars National Monument. #GrandStaircaseEscalante National Monument. What next? Drilling on #MtRainier or in #GrandCanyon?\n\nI will fight any attempt to undermine protections for our national monuments and public lands every step of the way."]["Bears Ears and Grand Staircase-Escalante have been driving a vibrant outdoor economy for years. Now President Trump is using unlawful authority to pollute these special places. https://t.co/H5RVljUTFG"]["#DACA recipients are telling their stories at the Capitol today https://t.co/KejYVaHw6M I have met many of these families traveling around the state.  We all have one thing in common – we want to live the #AmericanDream!"]["Today's announcement makes it clear: the Trump Administration deserves an 'F' for stewardship. #Standwithbearsears #KeepItPublic"]["Here's my statement on the Trump Administration’s unlawful attack on our #publiclands https://t.co/sYmRWQ8Mfl"]["Chad Brown, veteran and founder of @TheSoulRiver, shares why our #PublicLands are so important to him and so many other veterans https://t.co/69iR6ETqie #keepitpublic"]["The Trump Administration proposes cuts that would reduce Grand Staircase-Escalante by nearly 50%. Why? To line the pockets of polluters #MonumentsForAll #SaveGrandStaircase https://t.co/uyNPuElfMm"]["Rolling back #NetNeutrality protections is unacceptable. All consumers and all innovators deserve equal access to an open internet. https://t.co/p8p9XNiKbz"]["American citizens deserve open spaces to recreate, to hike, to climb, to hunt, and to ski! #KeepItPublic #SaveGrandStaircase"]["@sallyjewell: \"There’s no doubt that overseeing public lands for the benefit of all Americans – current and future – is complicated. But America’s wonders should inspire a commitment to protecting the timeless.\" #StandWithBearsEars #MonumentsForAll https://t.co/pmWjHCtDyI"]["Our outdoor recreation economy is now over $800 billion of annual revenue and dwarfs what the oil and gas industry represent as an economy of the future. #KeepItPublic #MonumentsForAll"]["Retweet if you #StandWithBearsEars https://t.co/pAVdDhrvhg"]["President Trump claims he is giving #PublicLands back to the people, when in fact he is giving them to industries that would permanently damage both the environment and sacred sites. #MonumentsForAll"]["Our national monuments and public lands are special places that belong to the people, not to corporate polluters, and I will continue fighting to keep them that way #Keepitpublic https://t.co/Xj0tzxImfj"]["President Trump plans to shrink #BearsEars National Monument by 85% - handing over 1.35 million acres to drilling &amp; mining corporations. The #ArcticRefuge, #BearsEars, #GrandStaircaseEscalante… what’s next? #MonumentsForAll"]["We are a great society in the USA, but we shouldn't be a 1% society. We should have an economy that works for everyone and that means making sure that the we are investing our resources in education, job training, and small businesses. The #GOPTaxBill simply does not do that."]["There’s nothing in the #GOPTaxBill that says corporations will raise wages and increase productivity if they get a tax cut. If my colleagues want to make that kind of commitment, I’m all ears."]["https://t.co/c2rEhm7SK2"]["Tonight in the 5:00pm ET hour I’ll be joining Chuck Todd on @MeetThePress to talk about the rushed #GOPTaxPlan and the real, negative consequences this bill will have on the middle class and #SmallBusinesses."]["It’s the middle class who’s hurting. Corporations are making huge profits. But the #GOPTaxBill gives away deductions that have protected the middle class for 100 yrs to pay for corporate tax breaks.  I fight for these deductions on Senate floor at 3pm PT https://t.co/jEC8EZpLzd"]["SOON: We are rallying against Republican’s sneak attack against the #Arctic Wildlife Refuge. We cannot allow drilling in one of the most intact ecosystems we have on the planet. Watch live here: https://t.co/mUcSLRfk9V"]["@thenewstribune: “Charging visitors nearly 200 percent more to enjoy many of America’s transcendent open spaces is a harsh and ultimately ineffective idea” #HikeTrailsNotFees https://t.co/YnqyZnDK1j"]["Opening the #ArcticRefuge would never be approved under regular order in the Senate so they are using a backdoor scheme to sneak it through. I will be fighting on the Senate floor to stop this. #ProtectTheArctic  https://t.co/P1vcSTRyyD"]["Tearing down the free and #openinternet jeopardizes the access and innovation that have driven the Internet economy to become a trillion-dollar economic powerhouse that employs millions of Americans. #protectnetneutrality"]["Here is a chart for Senator Cruz. We need tax reform that invests in the middle class and grows our economy from the middle out. #taxdebate https://t.co/XApdXts4eo"]["Let’s not be afraid of this transition to a modern economy for the middle class, let’s prepare by training our workers, providing affordable housing, and making our economy grow. #CNNTaxDebate #GOPTaxBill"]["Thanks for your service and your question, Victor from Snohomish. I have faith in you and I have faith in us. #CNNTaxDebate #GOPTaxBill"]["The #GOPtaxplan will raise health care costs on middle-income Americans. The nonpartisan @USCBO says that this policy will raise premiums by an average of 10 percent EVERY YEAR in the coming decade."]["The #GOPtaxplan gives more than a trillion dollar tax break to Wall Street, but leaves Main Street behind. We need a tax bill that supports small businesses so Main Street can thrive #TaxDebate"]["You'd think we can sell this president on more #Apprentices in America  #CNNDebateNight #GOPTaxBill"]["We need to invest in education, job training, working toward the future, not corporate tax breaks. I want to work with Sen. Scott to boost #apprenticeships."]["Couldn't agree more with Mr. Mendels: corporate tax breaks don't lead to higher middle-class wages #CNNDebateNight #GOPTaxBill"]["Joe Fugere, a small business owner and the founder of @MyTuttaBella is joining me as a guest at tonight’s #taxdebate. Joe knows gouging middle-class Americans to give tax breaks to corporations is just WRONG."]["Sen Scott is wrong on SALT: 86% of those who take the deduction earn under $200,000 according to the IRS #CNNDebateNight #GOPTaxBill"]["The GOP is trying to pass this bill in the dark of night. They need to slow down and understand what it means. #GOPTaxBill #CNNDebateNight"]["FACT: If state and local deductions are repealed, almost 30% of taxpayers, including individuals in very state and in all income brackets, would be adversely impacted. #TaxDebate"]["From my opening statement: @CNN #taxdebate: We are a great society in the USA but we shouldn’t be a 1% society. We should have an economy that works for everyone."]["The #GOPTaxBill will have real, negative consequences for great community businesses like Seattle’s @mytuttabella and its employees. That’s why one of my guests at tonight’s #taxdebate is Joe Fugere, Tutta Bella’s founder and a small business leader."]["Michael Orbino is in the audience at @CNN #taxdebate tonight. Michael is a real estate broker in Puget Sound and he can tell you first-hand: #GOPTaxBill will hurt middle-class families’ dreams of homeownership."]["At 6pm PT, I will be joining Senator Bernie Sanders on @CNN to debate Senators Cruz and Scott on the GOP's dark-of-night tax plan. It is not right that the Republican tax plan pays for corporate handouts on the backs of middle-class families. https://t.co/Su7ujh5Kcz"]["Congrats to the Port of @Pasco_WA for being chosen as the as 2017 Port of the Year by @WAPorts! Was proud to be with you to break ground on the new airport and look forward working with you more to bolster the Tri-Cities economy. https://t.co/ltnuMhE0KO https://t.co/5LPOVPabKf"]["I will do everything I can to block drilling in one of the most intact ecosystems we have on the planet. Retweet to join me in the fight to protect the Arctic Wildlife Refuge."]["The nonpartisan Congressional Budget Office confirms the GOP tax plan will raise taxes on low- and middle-class Americans by taking away important tax deductions families rely on https://t.co/rybPpLrO2X"]["Gouging middle class families to pay for corporate tax breaks is just wrong. We need tax reform that invests in the middle class and grows our economy from the middle out.  https://t.co/24l0JYh6F9"]["In repealing #NetNeutrality rules, the @FCC is creating a two-tiered Internet, allowing corporations to pay for special #Internet access and leave slow lanes for innovators, small businesses, and consumers."]["RT to stand with me on one of the most important economic issues before us -- the need to preserve an #openinternet with strong #NetNeutrality laws. #SaveNetNeutrality"]["@SeaTimesOpinion: “Gutting #NetNuetrality rules is a giant step backward” #OpenInternet https://t.co/RnxdULoRHL"]["The nonpartisan Congressional Budget Office shows what we’ve known all along – the #GOPTaxBill would significantly cut taxes for the wealthiest Americans while raising taxes on people making less than $30,000 a year https://t.co/okVHTFrM7a"]["According to the nonpartisan Congressional Budget Office, low income families would be worse off under the #GOPTaxBill  https://t.co/24l0JYh6F9"]["I could not agree more @thenewstribune, “Hiking #NationalParks good; hiking entry fees bad” #HikeTrailsNotFees https://t.co/YnqyZnDK1j"]["It’s critical we provide tools &amp; training to help Native Americans thrive &amp; strengthen the communities around them. Our Native American Tribes are a cherished part of the history, culture &amp; economy in Washington state #NAHM17 https://t.co/xmACJCjDOQ"]["#NationalParks are #publiclands – &amp; they should be affordable for everyone #HikeTrailsNotFees\nhttps://t.co/v7U7fxGGyc"]["We’re so blessed to live in the #PNW &amp; be able to enjoy places so special &amp; unique. Hiking the fees at our #NationalParks would be detrimental to our #outdoor economy, visitors &amp; maintaining recreational opportunities. #HikeTrailsNotFees"]["The #GOPTaxPlan that just passed out of the Senate Finance Committee had a new deduction for #BigOil—a $4 billion tax break for oil companies in the U.S. — &amp; other loopholes Republicans failed to close"]["There is a real disparity in what’s being touted as tax breaks in the #GOPTaxBill &amp; what will be the reality for middle-class families. We cannot afford to go backwards, we cannot afford this #GOPTaxPlan"]["If we really want to focus on the middle-class – helping them &amp; helping our economy grow, we need to make an investment in #AffordableHousing https://t.co/VyRbmDdwGA"]["Today on Small Business Saturday I encourage fellow Washingtonians to visit the small, local shops in their neighborhoods. Supporting local #smallbiz means investing in local jobs &amp; the future success of our communities! #ShopSmall https://t.co/sHcU7m9VLm"]["We need to slow down. We need to slow down and start listening to middle class families – not raising their taxes &amp; the debt of America by $1.5 trillion like the #GOPTaxPlan will"]["We should be helping people access the outdoors – not hiking the fees. It’s not only great for our veterans, young people, seniors &amp; families, it’s an investment in growing the economy &amp; jobs in our region #HikeTrailsNotFees"]["Today is recognized as #NativeAmericanHeritageDay to honor the great achievements &amp; contributions of our Native Americans communities and their ancestors to the United States of America. Happy #NAHM17! https://t.co/uYzH9c5PAK"]["Wishing you &amp; your loved ones a relaxing &amp; joyful Thanksgiving holiday filled with cheer, gratitude &amp; good food! #HappyThanksgiving https://t.co/oA8OXg5ZgG"]["When #TaxReform was first discussed it was about closing corporate loopholes to have a #TaxBill that pays for itself. But this #GOPTaxPlan let loopholes exist &amp; even created new ones, shifting the tax burden to middle-class families"]["If implemented, plan to hike National Park fees WHILE cutting agency funding would serve to shift major costs to park visitors, undermine public access to our #NationalParks &amp; be a disservice to the American people #HikeTrailsNotFees"]["Hiking the fees at our #NationalParks would be detrimental to our #outdoor economy, visitors to our parks &amp; maintaining recreational opportunities in the #PNW #HikeTrailsNotFees https://t.co/oPbCHdAnGJ"]["@SecretaryZinke’s proposed fee hike at our #NationalParks is unconscionable #HikeTrailsNotFees https://t.co/qEUZorPLLV"]["#TaxReform should be about lowering the burden on the middle class &amp; helping our economy grow. We need to slow down &amp; start listening to middle-class families telling us they don’t want the #GOPTaxPlan https://t.co/VyRbmCVVP2"]["@SecretaryZinke's proposal to hike entry fees to our #NationalParks, slash the @NatlParkService budget by 13% &amp; cut 1,200 park service employees: Bad for parks &amp; people. #HikeTrailsNotFees https://t.co/GxxKjd0YL3"]["UPDATE: The @NatlParkService has extended the comment period = more time to stop this unconscionable proposal by @SecretaryZinke to hike fees at our #NationalParks! #HikeTrailsNotFees https://t.co/Ug4Kr0oge9"]["Our #NationalParks are wonderful places &amp; are ALL of our #publiclands that should be affordable to ALL Americans #HikeTrailsNotFees https://t.co/hZXFe6FXES"]["Thank you to everyone for helping us make the case for why our #NationalParks &amp; access to them is so important! And why these exorbitant fee hikes would be detrimental #HikeTrailsNotFees https://t.co/jn9SSZNimw"]["Preventing Americans from enjoying #NationalParks by significantly hiking fees is contrary to @SecretaryZinke's oft-stated goal of improving access to our #PublicLands #HikeTrailsNotFees"]["This is unacceptable. We must protect #NetNeutrality. Whether doing homework or creating the next technological advancement, Americans rely day in and day out on a free &amp; #OpenInternet https://t.co/Q8jwuK8Czk"]["With Vancouver, Portland housing prices skyrocketing to record highs – #GOPTaxPlan would halt construction on 2,088 #AffordableHousing units and eliminate homeownership deductions – all to fund corporate tax breaks instead"]["While huge corporate tax breaks are being discussed in the #GOPTaxPlan – @SecretaryZinke is proposing to nearly triple fees for entry at our #NationalParks. This fee increase is unconscionable. #HikeTrailsNotFees"]["#GOPTaxPlan would severely hobble #AffordableHousing construction by decimating the Low Income Housing Tax Credit – the single most important program in creating affordable housing #ExpandLIHTC"]["**TODAY AT 11:30 AM IN VANCOUVER** Sounding the alarm: #GOPTaxPlan takes wrecking ball to #AffordableHousing &amp; homeownership for middle-class families by eliminating deductions for state &amp; local tax – including income taxes paid by those who live in Vancouver, but work in Oregon"]["This is unacceptable. All consumers &amp; all innovators deserve equal access to an #OpenInternet. We cannot allow the @FCC to imperil access to the Internet &amp; stifle #innovation https://t.co/FsOJnSWMcb"]["@SecretaryZinke needs to withdraw his National Park fee increase &amp; work to support a strong @NatlParkService budget that will ensure that all Americans have affordable access to #NationalParks #HikeTrailsNotFees"]["@SecretaryZinke's plan to hike the fees American families would pay to enjoy our #NationalParks is not the way to improve them #HikeTrailsNotFees https://t.co/TtOqNlRjI5"]["*DEADLINE* to comment on the @NatlParkService proposed visitor fee increase for #NationalParks is November 23, 2017 (Thanksgiving Day) #HikeTrailsNotFees https://t.co/ZljEUeF4bN"]["@OlympicNP generated $286.8M for WA state's economy. So restricting affordable access &amp; hiking entry fees is not how we keep our #NationalParks or our #outdoor economy strong #HikeTrailsNotFees https://t.co/kJl5MGUIV3"]["While @SecretaryZinke flies around on private jets using our taxpayer dollars, he plans to hike up the fees all American families would pay to enjoy our #NationalParks #HikeTrailsNotFees"]["**SOON @ 11:00 AM IN SEATTLE, WA ** \nCalling on Trump Administration &amp; @SecretaryZinke to withdraw @NatlParkService plan to nearly triple entrance fees at 17 #NationalParks @OlympicNP &amp; @MountRainierNPS #HikeTrailsNotFees https://t.co/DBHkIDepJX"]["Very concerned about the level of media concentration these mergers create, and their impact on the public interest https://t.co/wNoDQU31SW"]["This #GOPTaxPlan – taxing Americans twice by not allowing them to deduct their state obligation is going along way down the wrong road, it’s against what Republicans have stood for in the past &amp; sets very bad precedent nationally"]["The Senate #TaxBill forced through by Republicans has loopholes for #bigoil without fixing problems like provisions that make #AffordableHousing more expensive. Too many Washington families will be negatively affected by losing local sales tax and property deductions. #GOPTaxPlan"]["It’s a tragedy that Republicans will run over something so precious as the #ArcticRefuge — land that has stood undisturbed for thousands of years — all for a giveaway to oil corporations that allows them to ignore important environmental protections. #ProtectTheArctic https://t.co/TTG0kaqLU7"]["“Asking millions of middle-class families to pay more in taxes so that corporations &amp; the wealthy few can pay less is bad enough. But to use those cuts to also undermine #healthcare for middle-class families is unconscionable.” #GOPTaxPlan https://t.co/ZClhnG9mnV"]["Senate #GOPTaxPlan “would substantially increase premiums in the individual market for health insurance, and middle-class families would bear the brunt of the price hike.” https://t.co/ZClhnFRKZl"]["Every family deserves access to clean drinking water. Passage of this provision will help clean up these chemicals and move us towards clean groundwater in these communities https://t.co/hrlSWi1lkH"]["“@SenateGOP announced that they plan to pay for their tax cuts for large corporations and millionaires not only by imposing tax increases on the middle-class but also by undermining people’s access to #healthcare.” https://t.co/ZClhnFRKZl"]["Opening up the #ArcticRefuge to drilling would be a dramatic change. It would turn this pristine wildlife refuge into an oil field. We should not be debating this, we should #ProtectTheArctic https://t.co/ZeCjjMQsOs"]["It’s a tragedy that Republicans will run over something so precious as the #ArcticRefuge #ProtectTheArctic https://t.co/w4lsGUNaZ3"]["Re: Al Franken – Treating all women with dignity is of paramount importance. These actions are disturbing. I support an ethics committee investigation into this matter."]["NEW: JCT info TODAY exposes false GOP claims that #GOPTaxBill doesn’t raise taxes on middle-class families: In 2027, families earning less than $75,000 see an over $27 BILLION tax increase, yet millionaires get a tax cut of $5.5 billion"]["ICYMI: Yesterday Senate Republicans attached a measure opening up the #ArcticRefuge to #OilandGas drilling to budget legislation, which needs only 50 votes to pass the Senate #ProtectTheArctic https://t.co/RNLOIP6Oa0"]["TAKEAWAY: Under the #GOPTaxBill Americans making between $10,000 to 30,000 in 2027 will see nearly a $15 BILLION dollar tax HIKE while millionaires get a $5.5 BILLION dollar tax CUT. #GOPTaxPlan https://t.co/pv1VOH7u9R"]["Why is it that the President of the United States deserves a $32 million dollar tax break under this #GOPTaxPlan &amp; my constituent, a military veteran who is struggling to make ends meet, could be met with a #tax increase?"]["This situation merits immediate action by DHS. I urge DHS to reverse this decision to reject #DACA renewal requests that were received after the deadline due to mail delays https://t.co/b0lK9uxUDJ"]["Why are we rushing this process? Why are we trying to rush this dark-of-night #GOPTaxPlan to change our tax code in ways that we can’t even get answers on for our constituents?"]["I don’t know if the @SenateGOP is trying to break a speed record for passing a major tax bill?– but it’s clear this #GOPTaxPlan needs to be slowed down. We need to get this right."]["Republicans need to go back &amp; cut corporate loop holes instead of doing the opposite &amp; giving foreign oil companies a $4 billion dollar tax break in addition to cuts in the corporate rate #GOPTaxPlan"]["More than 300K people in the state of WA state could pay as much as $900 dollars more under this #GOPTaxPlan – and for what? To give tax breaks to corporations? \nI don’t think so."]["We're fighting to #ProtectTheArctic from drilling in the #ArcticRefuge when 27 different scientists &amp; biologists have said #OilandGas exploration is incompatible with the purpose of the #ArcticRefuge"]["Kept behind closed doors – this #GOPTaxPlan continues to be the product of a flawed process to draft a constantly changing #TaxBill that continues to propose raising taxes on middle-class families. I know we can do better than this. https://t.co/pXk7qEZwrB"]["Today the @SenateGOP continued their push to turn this coastal plain &amp; wildlife #ArcticRefuge into an oil field #ProtectTheArctic https://t.co/HuXF8B1am2"]["TODAY: After unveiling a troubling timeline, @SenatorTomUdall &amp; I are leading the call for @AjitPaiFCC to recuse himself from #Sinclair-related business until the matter is fully investigated."]["My colleagues &amp; I are very concerned that the @FCC’s ongoing review of the proposed merger of #Sinclair Broadcasting &amp; Tribune Media may be tainted by a series of actions and events that raise questions about the independence &amp; impartiality of the FCC"]["Right now we're being asked to vote on a bill – different from any previous Arctic drilling bill – not subject to a single hearing to help evaluate the impacts on this crown jewel &amp; changes current law of the #ArcticRefuge to turn it into an oil field #ProtectTheArctic https://t.co/e7EY4sCulh"]["NEWS: Led by myself &amp; @SenatorTomUdall,13 @SenateDems are calling for impartial investigation into potential quid pro quo between chairman @AjitPaiFCC, the Trump Administration &amp; #Sinclair broadcasting. READ our letter to the @FCC Inspector General https://t.co/B0oI2HMPIg"]["This @SenateGOP effort to open up the #ArcticRefuge to #OilandGas exploration does NOT protect environmental law or stewardship &amp; it’s very frustrating we’re being asked to vote on legislation incompatible with the purpose of the refuge #ProtectTheArctic"]["The purpose of the #ArcticRefuge was to protect a precious ecosystem &amp; #wildlife that lives there – and we should not be managing it as petroleum reserve #ProtectTheArctic"]["This morning Senate Republicans are moving to push through a bill to open up the #ArcticRefuge to drilling &amp; turn this #wildlife refuge into an oil field #ProtectTheArctic https://t.co/OFapqeauJ0"]["@USCBO: #GOPTaxPlan now undercuts the Affordable Care Act – leaving 13 million Americans without #healthcare insurance &amp; increasing average premiums in the individual market by 10% per year"]["Requesting an investigation of @SecretaryRoss to ensure his conduct &amp; representations are consistent with all ethical requirements of the U.S. Department of Commerce  https://t.co/oi5HTyV842"]["This #GOPTaxPlan proposing to raise taxes on 14 million Americans &amp; 300,000 in WA state is not simply raising taxes on just a few people – these are middle-class families striving for the American dream &amp; they deserve better"]["Under this #GOPTaxPlan, the average Seattle school teacher &amp; police officer, with two kids &amp; a new house, working hard to live the American dream, will pay $900 dollars MORE in taxes. That means less money to save for #college or #retirement, for groceries &amp; for a rainy day https://t.co/AZ0BqwyoTS"]["This isn’t simplification of our tax code – it’s simply raising taxes on middle-class families #GOPTaxPlan https://t.co/5sz0JsiJEF"]["A big chunk of this #GOPTaxPlan would be paid for on the backs of middle-class families by taking away their tax deductions like state &amp; local sales tax &amp; property tax deductions. This isn’t simplification of our tax code – it’s simply raising taxes on middle-class families."]["The #GOPTaxPlan isn’t a simplification of our tax code – it’s simply raising taxes on middle-class families in my state and its raising taxes on millions of Americans across the United States to give a tax break to corporations!"]["We don’t want a #Taxbill that gives tax breaks to corporations on the backs of middle-class families who take deductions for education or their property tax or sales tax. There are better ways to do #TaxReform than this horrible #GopTaxPlan"]["It is very wrong-headed that our @SenateGOP colleagues are choosing to give tax breaks to corporations on the backs of hard-working, middle-class families #GOPTaxPlan"]["I’m at the @SenateFinance markup of the #GOPTaxPlan to say: This process is a sham and this bill is flawed. It simply raises taxes on middle-class families in WA state &amp; across the country https://t.co/i93dwShySi"]["A #TaxBill that puts a greater tax burden on the middle-class and makes it harder for them to keep their home &amp;  AffordableHousing options is a bad idea"]["I believe there are much better ways to do #TaxReform than raising taxes on middle-class families &amp; destroying the wildlife habitat of caribou &amp; wildlife in the treasured #ArcticRefuge https://t.co/dlSUU5d0YI"]["Our veterans sacrifice so much, which is why in Congress I am committed to delivering on the promises we have made to our veterans regarding educational opportunities, job training &amp; high-quality #healthcare"]["Today I especially want to recognize the brave men &amp; women from WA state who volunteered their service and their lives to defend our freedoms. We thank you today &amp; always. #VeteransDay https://t.co/p1jh5kHJHw"]["On #VeteransDay, we recognize the bravery &amp; sacrifice of our veterans, and that of their families. We thank our military families for strength that sustains &amp; energizes our armed forces"]["We owe our gratitude &amp; respect to the millions of American veterans who served our country honorably continue to strengthen our communities with their knowledge &amp; dedication #VeteransDay"]["We CAN do better than this rushed #GOPTaxPlan giving tax breaks to corporations on the backs of working-class families in America, taking away viable deductions for education, housing &amp; property taxes"]["Scientists across the country are saying it is too dangerous to have oil drilling in the same place as a wildlife refuge, that they cannot coexist &amp; it will destroy the refuge #ProtectTheArctic https://t.co/2wUZevK52V"]["HAPPENING SOON in SEATTLE: I’m holding a press conference to expose disastrous effects the NEW Republican #TaxBill will have on America’s supply of #AffordableHousing – decimating the Low Income Housing Tax Credit #ExpandLIHTC"]["Things a #TaxBill should NOT do: Make #AffodableHousing more expensive for millions &amp; make middle-class families pay more taxes #GOPTaxPlan https://t.co/pHfUeeSiKv"]["The American public must be made fully aware of the #GOPTaxPlan dark-of-the-night tactics. Republicans want us to leave town on Thursday night only to come back on Monday &amp; take up a #TaxBill we haven't even seen yet"]["I remain very concerned about the measures in the #GOPTaxPlan that raise taxes on middle-class families https://t.co/KTc48sbyHZ"]["We can do better than rushing through a tax break for corporations while raising taxes on middle-class families &amp; destroying the #ArcticRefuge that scientists tell us is so important to protect! #GOPTaxPlan"]["Republicans in both the House and the Senate are marching down a path to making housing even more unaffordable for many Americans #GOPTaxPlan"]["I stand with thousands of young people who call the U.S. home, benefit from our education system, work hard &amp; produce for our economy. It’s time to pass a clean #DreamActNow!"]["TUNE IN NOW: I'm joining @CNBCClosingBell to talk about the #GOPTaxPlan that would raise taxes for middle-class families to give tax breaks to the wealthy"]["TODAY at 10:15 AM PT/1:15 PM ET: Join our fight against the NEW GOP bill to turn the #ArcticRefuge into an oil field! #ProtectTheArctic \n\nTUNE IN &amp; SHARE: https://t.co/cUWupPLgM6"]["It’s clear Republicans want to give corporations massive tax handouts while sticking middle-class Americans with a bigger bill #GOPTaxBill https://t.co/ARx5VKgex1"]["This Republican tax scheme raises taxes on middle-class Washington families &amp; makes it harder to buy or own a home #GOPTaxPlan"]["The U.S. should be leading as the world's #cleanenergy superpower – not the only nation to reject the climate accord https://t.co/JfXX1hDJFs"]["In 50 years what’s going to matter most is whether we’ve preserved a place as unique as the #ArcticRefuge #ProtectTheArctic https://t.co/nd7J8qaI27"]["The most damning part of the #AffordableHousing crisis is that we know how to solve it. We just need the courage to act. #ExpandLIHTC"]["\"Experts say both the drilling and any revenue are strictly hypothetical at this point.\" We should not risk this precious place #ProtectTheArctic https://t.co/nd7J8qsjqH"]["\"Republicans in Congress have added a proposal to allow oil drilling in a long-disputed Alaskan #WildlifeRefuge to their tax reform bill, but experts say that #oilandgas companies might not even be interested.\" #ProtectTheArctic https://t.co/nd7J8qaI27"]["That's why I joined @senorrinhatch to introduce the Affordable Housing Tax Credit Improvement Act, something that will help us build hundreds of thousands of new #AffordableHousing units in the next 10 years"]["The good news is we have good bipartisan support for the #LIHTC. Enacted in 1986 – it’s helped build 3 million rental units across this country over the last 30 years"]["We need a very big systematic investment in #AffordableHousing all across the United States. And expanding the #LIHTC is one of the best ways to do that"]["The combination of increased demand and lack of production has caused the explosion of our #AffordableHousing crisis. We need to #ExpandLIHTC to fill the gap"]["The United States has become a rent-burdened economy, and if we don't address the #AffordableHousing crisis, the problem is only going to get worse"]["I'm calling on Republicans to address #AffordableHousing by including #LIHTC expansion in the #TaxReform proposal \nTUNE IN NOW: https://t.co/5C7z8ahEda"]["SOON at 12:45 PM ET: I'm taking the fight for #AffordableHousing to the Senate floor &amp; calling on my Republican colleagues to address our affordable #housingcrisis &amp; include the #LIHTC in their #TaxBill"]["As a member of the Senate Commerce Committee I've long fought against this kind of consolidation in the media market https://t.co/DR8ChPvVLu"]["The #AffordableHousing crisis &amp; number of severely cost-burdened renters is only going up, expanding #LIHTC can help https://t.co/s2iOpQcyAC"]["Staggering cost we pay for #climatechange is money that could go to things like education, #healthcare or reducing the overall tax burden"]["This Republican tax scheme raises taxes on middle-class Washington families &amp; make it harder to buy or own a home https://t.co/e11IdBG5Qq"]["\"Rare piece of legislation where everyone can check off a win,\" the Wildland Fires Act will help protect communities https://t.co/Fc66XvO0eJ"]["A ludicrous idea https://t.co/6iSYRrZ50l"]["\"The time for sound policy on #wildfire suppression is now\" https://t.co/Fc66XvO0eJ"]["Ludicrous: A #TaxReform bill that raises the deficit, increases our taxes &amp; that'll take a #WildlifeRefuge to do it https://t.co/6iSYRrZ50l"]["Republicans want to give corporations massive tax handouts while sticking middle-class Americans with a bigger bill https://t.co/iJSDPlOueR"]["Need health insurance? @WAplanfinder can help! Sign up for private insurance, Apple Health &amp; Apple Health for Kids: https://t.co/F7lXS9X2uC https://t.co/efWJqgsQs7"]["Studies show 80% of the benefits of the GOP #TaxBill would go to the richest of the rich= a big hit to pocketbooks of middle class Americans"]["#OpenEnrollment through @WAplanfinder has started!  #GetCoveredWA! https://t.co/ohvOEf3UdC"]["Confused about health insurance? Get enrollment help tomorrow Nov. 4th 10am-3pm @ Columbia Health Center #GetCovered https://t.co/lJfrB5l81q"]["\"Aspiring homeowners in the Seattle region dealing with the hottest housing market in the country would be hit\" hard https://t.co/gGPlpvFTtT"]["SOON @ 11AM in SEATTLE: I'm fighting GOP Tax plan to squeeze middle class WA families to pay off tax breaks for corporations &amp; the wealthy"]["Republicans are giving corporations massive tax handouts while sticking middle class Americans with bigger tax bill  https://t.co/FayPjmE7et"]["The Republican tax plan is a big hit to the pocket books of middle-class Washingtonians https://t.co/YzXVXwBvnT"]["By eliminating our tax deductions the GOP #TaxBill would raise taxes on middle class Washington families, make it harder to buy &amp; own a home"]["NEW Republican tax plan is a big hit to the pocket books of middle class Washingtonians &amp; I demand #taxfairness for every WA state family"]["#Open Enrollment through @WAplanfinder is open now so let's #GetCoveredWA! Explore your health insurance options at: https://t.co/F7lXS9X2uC"]["TMRW @ 11AM PT IN SEATTLE: I'm uniting w/ working &amp; middleclass Washingtonians to reject the NEW GOP tax bill that raises taxes on families!"]["The sportsmen, fishermen &amp; hunters I know value #PublicLands &amp; don't want a “for sale'' sign on them just to give tax breaks to millionaires"]["Our #PublicLands are under assault from this administration, including – but not limited to opening up our #ArcticRefuge for oil drilling https://t.co/RQ3l19HzNo"]["“Drilling for the deficit” is a ludicrous idea #ProtectTheArctic https://t.co/uyMNZDjFPc"]["Be assured we will never stop trying to protect the #ArcticRefuge, its uniqueness &amp; working with indigenous people #ProtectTheArctic"]["An expanded #LIHTC can solve our #AffordableHousing crisis &amp; help devastated communities in Puerto Rico, Texas &amp; Florida recover &amp; rebuild https://t.co/V8a3OEbTVB"]["The notion that wildlife can exist in the #ArcticRefuge with the proposed drilling is just wrong #ProtectTheArctic"]["I call this \"caribou for millionaires\" it's the most ridiculous idea I've heard as it relates to meeting tax reform agenda #ProtectTheArctic https://t.co/EVmyL1NzVJ"]["As we discuss the future of the #ArcticRefuge let's remember we set aside this pristine area for a very specific purpose: TO PROTECT IT https://t.co/rov8gKYFMS"]["It's ludicrous to try to pass a tax reform bill that raises the deficit, increases our taxes &amp; opens up drilling in #ArcticRefuge to do it"]["The #ArcticRefuge has been attacked many times - none successfully &amp; I don't think Americans will agree to destroy it - not now, not ever."]["Let's remember we set aside the pristine #ArcticRefuge for a specific purpose: to conserve fish, wildlife &amp; their habitats #ProtectTheArctic https://t.co/6TVqafKtO6"]["HAPPENING NOW: Full ENR committee hearing on GOP plan to drill in the Arctic National Wildlife Refuge \nWATCH HERE: https://t.co/US8R65UC10"]["The #ArcticRefuge is so precious to America it's a haven for wildlife &amp; an intact ecosystem that doesn't exist anywhere else in the U.S. https://t.co/dNchFE2JLU"]["Looking forward to joining  #NAAHL2017Conf tomorrow to talk about how we can respond to natural disasters with #AffordableHousing  &amp; #LIHTC"]["Our #PublicLands are under assault from this administration, including - but not limited to opening up our #ArcticRefuge for drilling"]["TMRW @ 12:45 PM ET I'm speaking at #NAAHL2017Conf @PressClubDC about how an expanded #LIHTC program can solve our #AffordableHousing crisis"]["@EximBankUS So I'm urging the Senate Banking Cmte to reject the nomination of Scott Garrett to chair the @EximBankUS. https://t.co/HxC0ROtBMR"]["Scott Garrett refused to retract any of his past comments disparaging and opposing the @EximBankUS mission."]["In 2008 we bailed out big banks while everyone else’s 401k, pensions &amp; retirement savings took a hit. But again the GOP wants to limit 401ks"]["All investigations, as well as Congressional investigations, must continue and the justice system must act https://t.co/9Whr2Tv9UR"]["Diana &amp; her family, like many Washingtonians who depend on state &amp; local tax deductions would see their taxes raised under the GOP tax plan https://t.co/cOZGmtVOCP"]["The Republican plan to limit 401k plans will only make it harder for Americans to save for their future &amp; will hurt hard working families https://t.co/eMp8Sn0j3X"]["Investigations must continue and the justice system must act. No one is above the law. https://t.co/ngp5gs24OU"]["We owe it to Americans to ensure they can invest &amp; they can save in their future. The Republican plan to tax 401k plan only make it harder"]["These charges may only be the beginning of holding individuals accountable https://t.co/7Gjl0EIBJf"]["We should be incentivizing hard working Americans &amp; families to save by investing in their 401k retirement savings plans, not limiting them"]["We should not be taxing working people &amp; put the burden on working families to pay for tax cuts for huge corporations a.k.a the GOP tax plan https://t.co/N3rTEP220c"]["No one is above the law https://t.co/0nX5IrjhTk"]["Mueller’s investigation, as well as Congressional investigations, must continue &amp; the justice system must act https://t.co/ngp5gs24OU"]["We need #taxreform that invests in our workers, provides relief to families &amp; takes our #innovation economy to the next level #TaxFairness"]["An investigation to determine how we got into this situation in the first place must continue. https://t.co/gkPWLC4CiH"]["The latest Republican tax plan to eliminate state &amp; local tax deductions would be a damaging tax increase for many Washington state families"]["Whitefish Energy was charging US taxpayer as much as 30% - 40% over what would be normal rates for repairs in this kind of disaster recovery"]["Taxpayers should pay a fair rate for the emergency repairs #PuertoRico desperately needs – not be gouged. https://t.co/BoY3CKvphR"]["An investigation must continue so we can learn from this situation &amp; never let it happen again. https://t.co/1Hhk1mCyEm"]["Our transgender service members are honorable &amp; patriotic. I'm very glad to see this discriminatory policy defeated https://t.co/1G6SrPlVH4"]["Congrats to Zoe from Richland WA! 2017 #bcrmMASTERS &amp; 1st place Mathematics Award winner. Can't wait to see the great work in  #STEM you do! https://t.co/Ow2nGfPuFh"]["Under the GOP's tax plan tens of millions of hard-working Americans will suffer because it eliminates our state &amp; local sales tax deduction"]["In failing to preserve &amp; instead eliminate our state &amp; local tax deductions Republicans will be failing hard-working families across America"]["TODAY in Renton I'm sounding the alarm: GOP tax plan to eliminate state &amp; local tax deductions would hurt working families who depend on it"]["In WA state &amp; many others, state &amp; local sales tax deductions mean #TaxFairness for working families &amp; a way for our citizens to save money"]["I'm fighting to stop Republicans who want to eliminate our state &amp; local tax deduction &amp; a tax increase for many middle-income WA families"]["GOP plan to eliminate state &amp; local tax deduction means middle class families get double taxed; making it more expensive to buy &amp; own a home"]["TMRW @ 10AM in Renton I'm sounding the alarm over Republican's plan to eliminate our state &amp; local tax deduction &amp; hurt WA state families"]["This situation warrants an investigation https://t.co/W8piiwJ5Un"]["It's essential that as we deliver resources we have confidence the funds are being spent wisely &amp; cost-effectively https://t.co/If5DbnrgZf"]["In WA state we understand fire risks &amp; why this \"Bipartisan PNW #wildfire legislation should be approved\" -@ubnews https://t.co/suiFMUSAoh https://t.co/fwupim9Ogm"]["@SecretaryZinke must provide Congress with the justification for this proposed #NationalPark entrance fee increase https://t.co/ixMI4fTEyV"]["Multiple recent media reports raise serious allegations around a $300M contract to Whitefish to restore #PuertoRico's electric power system"]["It is very problematic for @SecretaryZinke to propose fee hikes at the same time this Administration is recommending slashing #NPS funding"]["Among the principal concerns raised in reports is the opaque &amp; limited nature of PREPA’s bidding process that led to this Whitefish contract"]["Let's work together on a plan to ensure #TaxFairness for all residents – not a #TrumpTax plan that will cost our working families more"]["We don't want this Republican #TrumpTax plan that raises taxes on working families in WA state &amp; steals the tax deductions they depend on"]["NEW: @RonWyden &amp; I request a @USGAO investigation to ensure taxpayer resources are being appropriately used to restore power in #PuertoRico https://t.co/3DDQ9KPPY8"]["We need a tax discussion that's about a fair &amp; open process to ensure that working families get #TaxFairness – not a #BillionairesFirst deal"]["Bipartisan #PNW #wildfire legislation should be approved -@ubnews https://t.co/suiFMUSAoh"]["Today I'm calling for a hearing on @SecretaryZinke’s shocking decision to increase entrance fees during the peak season at 17 #NationalParks"]["When I asked @USGAO for a report on the costs of #climatechange, I never imagined the costs would be so staggering https://t.co/jD6gy8BtUu"]["We are already seeing the huge costs of #climatechange &amp; unless we #ActOnClimate now they will only continue to grow https://t.co/TH7D84JNfd"]["Let’s quit thinking about #climatechange in political terms &amp; start thinking about it in fiscal terms – or it will keep costing us billions"]["I've called on #GAO to investigate a multi-million dollar contract awarded to this brand new company w/ 2 employees https://t.co/tClVz5g71W"]["It was wonderful to attend the Gold Medal Ceremony honoring Filipino Veterans of WWII today with so many Filipino-American Washingtonians! https://t.co/5IUGg6rG7l"]["@SecretaryZinke is flying around on private jets using our taxpayer dollars, then hiking fees at our #NationalParks? https://t.co/m9H1I4SUuD"]["And yet a groundbreaking new #GAO report just told us the impacts of #climatechange are costing us billions... https://t.co/BNQ9C9CDHn"]["We are seeing the impacts of #climatechange &amp; increased costs associated with it – we must address it now to mitigate huge future costs https://t.co/XzRXHCc63N"]["#ClimateChange isn't just a major global issue, but a serious fiscal issue because it's impacting our budget &amp; costing us billions right now"]["We can do better &amp; we must #ActOnClimate now #climatechange https://t.co/nqkwxwZuvr"]["#Climatechange challenges &amp; the devastation caused is something we need to take into serious consideration. It's time to #ActOnClimate NOW"]["The cost trajectory is real. That's what the #GAO says. Hundreds of billions of dollars now, trillions in the future https://t.co/644uQQ1dIS"]["Taxpayers must not be left alone to deal with greater devastation &amp; storms each year, we need better strategies to mitigate #climatechange"]["Yet @SecretaryZinke flies around on private jets using our taxpayer dollars... https://t.co/BGbRyz6jPa"]["2 yrs ago @SenatorCollins &amp; I requested #GAO study the cost &amp; impact of #climatechange to our nation. It's finally out &amp; the costs are huge"]["Hiking the fees for us to enjoy #NationalParks while @SecretaryZinke flies around on private jets with taxpayer $$$ https://t.co/5sfYQxGNQ6"]["We must take the #GAO report on #climatechange very seriously &amp; start doing things to help U.S. reduce risk &amp; better protect our communities"]["We cannot afford to continue to pay this kind of money to deal with the impacts of #climatechange \nhttps://t.co/CDaFdJMsr8"]["This bill provides additional funding to treat our most-at-risk forests &amp; better protect communities from #wildfires https://t.co/fcUuhri4wV"]["#Climatechange will cost taxpayers over half a trillion this decade &amp; trillions more unless we mitigate the impacts https://t.co/IY727Tv5ma"]["Bipartisan Wildland Fires Act of 2017 introduced by Western Senators &amp; will help protect communities from #wildfires https://t.co/b03QSbkYJF"]["The chaos the Trump administration has caused means insurers are raising rates &amp; making insurance less affordable https://t.co/HEOvg61sie"]["We must address &amp; reduce #wildfire risk around our most vulnerable #forests in order to help protect our communities https://t.co/fcUuhr0t8l"]["We need to stop President Trump's sabotage &amp; propose more #affordable options in the individual #healthcare market https://t.co/HEOvg6j3GO"]["My NEW bill will direct the @forestservice to address devastating #wildfires in our most vulnerable #forests https://t.co/xi6FtHjfgr"]["This is a sneak attack on our #PublicLands. We are going to fight this. #ArcticRefuge #ProtectTheArctic https://t.co/bivxKDIDNL"]["It's time we reduce risk, help better protect our communities &amp; address devastating the #wildfires we have seen https://t.co/aYAQ7NPi4d"]["This #wildfire bill introduced by fellow Western senators &amp; I will reduce risk &amp; help better protect our communities https://t.co/o9aoUezVst"]["The disastrous #wildfires we've seen recently are a new normal – so we need new approaches to address &amp; reduce risk https://t.co/xi6FtHjfgr"]["This fight isn’t over yet. #ANWR #ProtectTheArctic #KeepItPublic https://t.co/7TRgR3s4SC"]["I support the #MurrayAlexander agreement which stops the President’s sabotage of our #healthcare system https://t.co/9i39Uvm1hN"]["Our legislation protects women’s access to contraceptives and #birthcontrol – no matter who their boss is.\nhttps://t.co/uiLy37pJCE"]["This Administration has continued to roll back #womenshealth, #womensrights &amp; access to vital preventive #healthcare https://t.co/dKZqnt0CP7"]["Tens of millions of hard-working middle-class families would have their state sales tax deductions eliminated under this Republican budget"]["The Republican-controlled Senate voted to repeal our state’s ability to continue state &amp; local sales tax deductions. This fight is not over. https://t.co/lGef44NGeA"]["Proud to introduce this bill w/ @PattyMurray to protect women’s access to #birthcontrol, no matter who their boss is https://t.co/mKhxWPk3RT"]["Today is #SpiritDay so join me &amp; Go Purple to stand up against bullying &amp; show your support for #LGBTQ youth! @glaad https://t.co/anVlWcxUcJ https://t.co/OLgE14SIL8"]["I support #MurrayAlexander which stops the President’s sabotage of our #healthcare system. We need a comprehensive affordability solution"]["Republicans want to repeal our ability to continue state &amp; local sales tax deductions, raising taxes on WA families https://t.co/sGCiFi8GIn"]["I want our country to move forward economically in the best way, a way that ensures we have #TaxFairness for working families in all states"]["This is why @ChrisVanHollen &amp; I introduced an amendment to protect state &amp; local tax deductions that have been so important to our taxpayers"]["We need an open and fair discussion on #TaxFairness &amp; continued dialogue to ensure working families in America get a fair tax deal"]["I will fight this sneak attack GOP attempt to turn over our #publiclands to polluters #ProtectTheArctic #ANWR https://t.co/3NxvMDh8Mq"]["Don't forget tmrw's Great #ShakeOut #earthquake drill! Emergency preparedness is vital to protecting our communities https://t.co/ZuGpICF87f"]["Our public lands are under assault. We will fight this unbelievable attempt to turn #PublicLands over to polluters  https://t.co/LSDOPxkWs3"]["We will resist this unbelievable assault on the Arctic National Wildlife Refuge #SaveANWR #ProtectTheArctic https://t.co/3NxvMDh8Mq"]["Now we need to ensure access to #affordable #healthcare in the individual market  https://t.co/8wcFtQb6ko"]["I demand tax fairness for middle-class families from Republican’s proposal to nix state &amp; local tax deductions \nNOW: https://t.co/aH7uKf26B2 https://t.co/F0eI1iQ2Qs"]["TONIGHT: I'm talking #healthcare &amp; more w/ @HardballChris on @MSNBC &amp; why we must work in a bipartisan way to expand affordable care access"]["Agreement stops the President’s sabotage of the #healthcare system, now we need to ensure access to #affordable care https://t.co/UDP2vbgC7O"]["Unbelievable attempt by Republicans to turn our #PublicLands over to polluters #KeepItPublic #ProtectTheArctic https://t.co/4XeOrorHjg"]["This bipartisan agreement stops the President’s sabotage of our #healthcare system https://t.co/uUehULE1Px"]["Republicans must stop trying to hold #Congress hostage by trying to ram through the opening of #ANWR to drilling https://t.co/DcnV357JAj"]["Unbelievable attempts to turn #publiclands over to polluters &amp; take the #outdoor recreational opportunities we all hold so dear, MUST FAIL."]["Attempts to open up #ANWR to drilling cannot stand on their own. Every time the GOP must pair it with something else – a clear sneak attack"]["Now we need to ensure access to affordable health care in the individual market."]["This bipartisan agreement stops the President’s sabotage of the health care system."]["This attempt to open up #ANWR to drilling cannot stand on its own. Every time the GOP must pair it with something else, a clear sneak attack"]["Thank you @nhpfoundation for honoring me with the Trailblazer Award &amp; helping make #AffordableHousing a reality for families across America! https://t.co/CNUg3XNfq0"]["SOON: On the Senate floor I'm fighting a GOP plan to open up our Arctic Wildlife Refuge to oil drilling #ANWR\nWATCH: https://t.co/aH7uKf26B2"]["Over 10 years ago we fought to prevent an attack on #ANWR &amp; today we're seeing the same Republican attempt to sneak it in a budget proposal"]["Our #publiclands are currently under assault &amp; now the GOP wants to open our most beautiful &amp; pristine #Arctic #wildlife refuge to drilling https://t.co/XPmejFOrDW"]["I hope we will all fight to protect &amp; not give away on our watch this crown jewel of our nation, the Arctic National Wildlife Refuge #ANWR"]["AT 11:15am ET: @SenateDems &amp; #wildlife advocates &amp; I oppose NEW GOP Plan to Drill in the #Arctic Refuge #ANWR\nWATCH: https://t.co/DIWUxVdtwC"]["This action will threaten #healthcare insurance for millions of Americans https://t.co/MiJD72IKm8"]["Instead of cutting people off #healthcare insurance the President should be working across the aisle to drive down costs &amp; increase access"]["We have good #healthcare ideas working right now, like giving states the ability to bundle people like we've done in WA w/ Basic Health Plan"]["#PuertoRico should not have to wait any longer for assistance to begin the long process of rebuilding their #infrastructure &amp; communities"]["President Trump’s actions will throw Americans’ #healthcare insurance into chaos https://t.co/MiJD730lKI"]["I hope @FEMA will work to ensure that #PuertoRico receives all the appropriate assistance it deserves as it continues to recover &amp; rebuild"]["NEW: I joined @SenateDems to urge @FEMA to take immediate steps to ensure #PuertoRico receives all resources &amp; assistance for rebuilding https://t.co/zZKzpmZdM0"]["STOP: Threatening #Healthcare for millions of Americans &amp; trying to throw our health insurance markets into chaos https://t.co/FzWKhkimE1"]["Cutting essential benefits out of health insurance puts patients at risk of having no coverage for basic #healthcare https://t.co/LE8dm84bxa"]["Takes us in the opposite direction of the bipartisan policies to drive down #healthcare costs we should be enacting https://t.co/5TQaV2uqNq"]["Opening the door to #junkinsurance &amp; cutting essential benefits out of health insurance plans is not what we need https://t.co/iE7yO1QGUs"]["I remain committed to enacting bipartisan policies to drive down #healthcare costs as we've done for years in WA https://t.co/AWevIqtqTq"]["We must enact bipartisan policies to drive down #healthcare costs. This action takes us in the opposite direction https://t.co/AWevIqtqTq"]["This action will threaten health insurance for millions of Americans &amp; those currently receiving comprehensive care https://t.co/5TQaV2M1EY"]["President Trump is doubling down on throwing our health insurance markets into chaos https://t.co/GsxllJx5yR"]["We must permanently ban offshore #drilling on the W. Coast to protect our coastal communities, economies &amp; ecosystems from risk of #oilspill"]["Today the #WestCoast supports thousands of jobs from fisheries, trade, tourism &amp; recreation— these jobs &amp; livelihoods cannot be risked"]["President Trump should not try to open the door to #JunkInsurance. Cutting essential benefits out of health insurance puts patients at risk"]["We need to protect the Arctic National Wildlife Refuge, not raid it for oil. #ANWR https://t.co/ej5Hy3sYY9"]["So disappointing. https://t.co/4A8dBnCxt0"]["#JunkInsurance puts patients at risk of having no coverage for basics like hospitalizations &amp; prescription drugs https://t.co/92hfdNh9v2"]["President Trump shouldn't try to open the door to #JunkInsurance – but work across the aisle to improve #healthcare https://t.co/XcoaRMGRFj"]["This decision must be based in science. We risk ruining a fishery that so many jobs &amp; so many family wages depend on https://t.co/7qujJ0pT4R"]["We must make investments in #cleanenergy alternatives to help meet America’s energy needs https://t.co/c6vRzi1m8A"]["Learn more about the Arctic National Wildlife Refuge &amp; why it’s so important that we protect it #ANWR https://t.co/qX6IwW1PFq"]["@EPAScottPruitt is signing up to kill the largest #salmon run on Earth &amp; thousands of fishing jobs #SaveBristolBay https://t.co/7xKY0uOGNX"]["I'll continue working with my colleagues to safeguard access to vital preventive #healthcare including #birthcontrol https://t.co/z2rOJ9mwNF"]["Happy Birthday @PattyMurray! So proud to serve Washingtonians alongside my friend &amp; a tremendous leader for WA state, Senator Murray! https://t.co/kXYQ72OWV1"]["We need #OpenInternet for all &amp; the strong #NetNeutrality rules that protect it https://t.co/bCFAVynQKy"]["SOON: 8:45 PM ET on @CNN I'm talking about why this Administration must maintain strong protections &amp; #cleanwater safeguards in #BristolBay"]["The livelihoods of fishermen, hunters, anglers, local business owners &amp; other stakeholders could be devastated if #BristolBay is put at risk"]["Women have made great strides in achieving equal opportunity &amp; every girl needs our support to continue to push the boundaries #DayoftheGirl"]["This Administration must maintain strong protections &amp; #cleanwater safeguards for #BristolBay https://t.co/ktpIMT8ByN"]["#BristolBay protections were reversed without a single public hearing &amp; zero public input from fishermen, hunters, anglers, local businesses https://t.co/SY0fZlWWI5"]["TONIGHT: I'll be on @AC360 to talk @EPAScottPruitt &amp; mining CEO meeting to reverse protections for #BristolBay jeopardizing 1000s of US jobs"]["@EPA’s plan to reverse #BristolBay #cleanwater safeguards is egregious &amp; inconsistent with science &amp; frankly, inconsistent with basic logic."]["This Administration continues its troubling rollback of #womenshealth, rights &amp; access to #birthcontrol https://t.co/z2rOJ9E7Fd"]["Thank you to the firefighters &amp; first responders battling these horrific fires. Our hearts are with all Californians &amp; loved ones impacted. https://t.co/eSjBnxG6L4"]["A #PebbleMine directly threatens our maritime economy &amp; thousands of American jobs that rely on #BristolBay fishery https://t.co/ZkcaKPnvj1"]["I urge President Trump to listen to our fishermen &amp; businesses before removing science-based environmental rules that protect #BristolBay https://t.co/zL4MQqcyiY"]["Since elected to the U.S. Senate I’ve been a strong advocate for #CHIP. #CHIPworks &amp; we must focus to get it done https://t.co/WbAduLe7gh"]["The science is clear: a #PebbleMine would result in catastrophic &amp; irreversible damage to #BristolBay #salmon &amp; jobs https://t.co/ZkcaKPnvj1"]["It's vital we all understand how important #Medicaid is to #mentalhealth, addressing #addiction &amp; the #opioidepidemic #WorldMentalHealthDay"]["Polluters need to pay. Period. https://t.co/LfAM3xbrZz"]["Families shouldn't have their jobs risked to pave the way for foreign mining companies to skirt U.S. laws protecting #cleanwater #BristolBay"]["We can’t afford to replace aging #infrastructure w/ anything but smart infrastructure &amp; my new bill does just that  https://t.co/A65CBxfsP7"]["Sabotaging our chances of becoming the world’s #cleanenergy superpower in order to line the pockets of polluters https://t.co/fddWQBoW6g"]["Losing focus on what the Children’s Health Insurance Programs means for millions of kids &amp; families is unacceptable https://t.co/WbAduLe7gh"]["An @EPA Administrator who isn't working to cut down carbon emissions &amp; disputes #ClimateChange is putting a lot of #PNW &amp; WA jobs at stake"]["I've urged for safeguards to protect #BristolBay #salmon &amp; thousands of jobs that depend on its thriving fisheries https://t.co/ZkcaKPnvj1"]["I stand firmly with fishing families &amp; businesses that reside in WA &amp; the nation. I demand we protect their livelihoods &amp; future #BristolBay"]["This dire humanitarian situation requires our assistance. More help is needed for the people of #PuertoRico https://t.co/qqFlawaQOD"]["As the world moves towards #cleanenergy power sources - we can either lead on these technologies or get left behind https://t.co/46KUAkCmix"]["@EPA is needed \"To protect human health by safeguarding the air we breathe, water we drink &amp; land on which we live\" https://t.co/kfGxQXx8qD"]["Very concerning. \nhttps://t.co/kfGxQXx8qD"]["#CHIPworks and is \"credited with helping to drive the proportion of uninsured children in WA to an all-time low of less than 3%\" https://t.co/dXEE6vGX6s"]["Another irresponsible retreat from making polluters pay, promoting #energyefficiency &amp; our #cleanenergy economy https://t.co/fddWQB7leI"]["FACT: 86% of Americans (91% Democrats &amp; 83% Republicans) support policies that make it easier to get the full range of #birthcontrol methods"]["We can't allow one of our most successful conservation tools to continue to flounder in uncertainty. We must permanently reauthorize #LWCF"]["Like so many, these WA state #DREAMers pursued degrees in #STEM &amp; are helping to fill a huge demand for skilled workers we face as a nation https://t.co/WzDCI8QRNH"]["FACT: #Birthcontrol access hasn't just opened up educational &amp; career opportunities for women but catapulted them into more leadership roles"]["Another Republican attempt to destroy &amp; turn over this iconic national #wildlife refuge to the oil &amp; gas industry https://t.co/uAjRouEL0T"]["Women cannot be discriminated against by employers who want to cherry-pick essential benefits #HandsOffMyBC https://t.co/O7l7ly0Fi2"]["Today’s rule continues this Administration’s troubling rollback of #WomensHealth &amp; rights https://t.co/8zcJh7nMUr"]["Destroying #ANWR a national #wildlife #refuge is not the answer to our nation’s energy problems #ProtectTheArctic https://t.co/uAjRouna9l"]["The #ACA's #birthcontrol provision saved women an est $1.4B on birth control in its 1st yr alone – something the majority of U.S. women use"]["Again the leadership of this Administration threatens to roll back decades of progress on #WomensHealth &amp; our rights\nhttps://t.co/yU59bxkUz5"]["Since President Trump’s inauguration, women &amp; their families have been under a constant &amp; unprecedented attack https://t.co/vFD5VfzvYr"]["#LWCF has successfully worked to conserve #outdoor spaces for last 25 yrs &amp; it's time to make that success permanent for generations to come"]["So impressed by WA state #DREAMers I met today. Contributing to our communities, they have achieved so much despite unimaginable challenges https://t.co/lq648UEn2I"]["#DREAMers need to know they have a place in our country, economy as we move forward on passing comprehensive #immigration reform"]["After meeting so many #DREAMers, I know how much they invest in their communities, our state of WA &amp; help local economies tremendously"]["Time is running out for one of our more successful conservation programs, which preserves our #GreatOutdoors with NO taxpayer funding #LWCF https://t.co/Rmrkrvnpta"]["This does not protect the freedoms &amp; values we hold dear as Americans. This discrimination is unacceptable. https://t.co/pt7Ime6EiG"]["We need to pass the #DreamAct. The current level of uncertainty &amp; anxiety experienced by #DREAMers is not what we should be striving for."]["Talking to #DREAMers today from WA state it is so clear we need these extremely hard-working &amp; intelligent young people in America #DreamAct https://t.co/aJghXIATfM"]["Taking refuge in the #outdoors whether you’re a hunter, fisherman or recreating with friends &amp; family is one our greatest treasures #LWCF"]["This morning we gathered together, Democrats &amp; Republicans, because we love the land &amp; water &amp; love what it provides for America #SaveLWCF https://t.co/JVDh5Qxwkl"]["Speaking now on why we need the #LWCF\nTUNE IN: https://t.co/ooYOWsEDjv"]["SOON: I'm calling for reauthorization of #LWCF one of our oldest &amp; most successful #conservation programs!\nWATCH: https://t.co/DIWUxVdtwC"]["We need a more aggressive response. And we need to prioritize humanitarian assistance to #PuertoRico now https://t.co/K8qNzgtVH7"]["We must ban the sale &amp; possession of bump stocks &amp; other devices that convert guns into unlawful automatic weapons https://t.co/ewy412l3c3"]["With this level of crisis, we must make sure the resources are there to support #PuertoRico's #healthcare system https://t.co/l2LV6nNszJ"]["We must fully fund #CHIP &amp; never forget what this program means for millions of children and their families.  https://t.co/yMm4Tsj0J6"]["We must close this loophole that allows the sale of bump stocks &amp; all similar devices immediately https://t.co/6T8Mseftl8"]["I’ve cosponsored @SenFeinstein's bill to ban bump stocks &amp; devices that convert guns into unlawful automatic weapons meant for war zones https://t.co/8Yh5ZE1eYU"]["And the Republican sneak attack to cut people off #healthcare continues. https://t.co/gyzYqMdItw"]["If @SecretaryZinke misused public funds, he should promptly reimburse the taxpayers. Period. https://t.co/yK2F7JayHA"]["TUNE IN HERE: https://t.co/rEmLZqhC7g"]["SOON @ 10AM: Commerce Cmte considers #TSA Modernization Act, which includes my provision to deploy more bomb-sniffing dogs to U.S. airports https://t.co/aRPsZy1Dqi"]["The majority of Americans support #DACA &amp; over 300 business leaders agree #DREAMers help our country be more dynamic &amp; prosperous"]["@EPAScottPruitt should be protecting #BristolBay salmon &amp; thousands of US jobs that depend on its thriving fisheries https://t.co/OyE7PGgaFV"]["A fair deal for the American #taxpayers doesn't look like: letting coal &amp; oil companies off the hook on royalties &amp; it should end now. https://t.co/qMvdyK0AjT"]["The GOP needs to stand up, show what a fair deal for taxpayers looks like. NOT let coal &amp; oil companies off the hook https://t.co/WD4B0o121o"]["#DYK? #LIGO facility in #Hanford, WA built by #NobelPrize Winner Barry C Barish detected collision of 2 black holes a billion light-yrs away https://t.co/ppikIO2meY"]["The American taxpayers deserve answers. https://t.co/GFUa7u5SBS"]["We need a #PuertoRicoRelief coordinator at the @WhiteHouse for all the various agencies that'll have to work on the recovery of #PuertoRico"]["We need the #DreamAct bc the diversity of our residents is part of WA's strategy for moving forward, for a better economy &amp; a better society"]["#DREAMers are working, going to school, supporting their families &amp; need the certainty to keep contributing. We need to pass the #DreamAct"]["I hope today with President Trump's visit he will make a full federal disaster declaration for all of #PuertoRico, every municipality."]["Congrats #NoblePrize Winners! Barry C Barish led creation of #LIGO facility in Hanford, WA that detected the wave of 2 black holes colliding https://t.co/U6R7ndQgjr"]["We must work together to find bipartisan solutions to increase #healthcare affordability &amp; access for all Americans https://t.co/Eux6k7We8q"]["The @FCC's mission isn't to undo existing #NetNeutrality laws on the books, it isn't in the public interest &amp; won't promote access we need"]["It doesn't make sense to nominate @AjitPaiFCC who has pledged to roll back #OpenInternet which will create throttling &amp; slow down content"]["@AjitPaiFCC @FCC WATCH LIVE: https://t.co/pQbMPn6n9H"]["SOON: Headed to the #Senate floor to speak on why @AjitPaiFCC is the wrong choice for our @FCC &amp; #OpenInternet"]["@AjitPaiFCC wants to end #NetNeutrality – going against more than 22M American consumers &amp; innovators who've told him to keep #OpenInternet"]["All previous attempts to destroy #ANWR have failed &amp; I’m going to fight tooth and nail until this attempt fails too https://t.co/UPMQAnlwl9"]["Today we vote on @AjitPaiFCC, someone against the #NetNeutrality that today supports 7M #Internet economy jobs w/ nearly 250K of them in WA"]["With another GOP Congress comes another attempt to turn over this iconic #wildlife refuge to the #oilandgas industry https://t.co/UPMQAnD7JJ"]["Today I'm voting NO on @AjitPaiFCC for @FCC Chair bc he will not preserve #NetNeutrality &amp; protect our #OpenInternet https://t.co/7WTdQPVsue"]["We thank our police officers and first responders for the service, bravery &amp; dedication. #LasVegas"]["News from Las Vegas this morning is horrifying. My heart breaks for the victims, their families &amp; all impacted by this senseless violence."]["Attempts to eliminate #outdoor recreation lands for #veterans &amp; all Americans by giving them away to special interests is unacceptable #NPLD"]["We cannot let this administration turn our #PublicLands, #NationalMonuments, #NationalParks &amp; #Forests over to #oilandgas companies. #NPLD"]["Happy #NationalPublicLandsDay! Today we celebrate &amp; give thanks to America’s protected #PublicLands that give us so much in return! #NPLD https://t.co/tkBnsbXZEP"]["Truly saddened to see @SecretaryZinke dismantle years of bi-partisan work and put our #Outdoor economy at risk https://t.co/6Q1gip1Z4e"]["Expanding #Apprenticeships has bipartisan support and we need the Administration will join us fully in this effort. https://t.co/FVgMzXSap7"]["A #FBF for #NationalCoffeeDay! And my favorite drink from @Starbucks – a Grande #PikePlace Roast – hasn’t changed! What's your favorite? https://t.co/WgdRrmhdTT"]["There is not a second to lose, the health and well-being of millions of Americans in U.S. territories is at risk. https://t.co/BZddY5Grvv"]["The taxpayers need answers. https://t.co/mV5nnNcgYc"]["Using taxpayer money to charter a private flight on an oil executive’s plane is not how @Interior @SecretaryZinke should do business."]["#Apprenticeships help close our skills gap, get more Americans back to work &amp; raise wages https://t.co/FVgMzY9LNH"]["I won't vote for someone who could make it possible for big telecom &amp; cable companies to erect #Internet toll lanes https://t.co/3CxD7vvrJt https://t.co/9cZcN8NeCq"]["...@SecretaryZinke wants to take a bi-partisan agreement to protect #sagegrouse, rip it up &amp; turn it over to mining &amp; petroleum companies."]["After spending this entire year wasting #taxpayer $ on conducting a sham report to hand over our #publiclands to the #oilandgas industry..."]["We must unite in our support for Americans in #PuertoRico who are in a very desperate situation https://t.co/iB83TT8xka"]["@SecretaryZinke’s comments betray a fundamental misunderstanding of the role of federal civil service https://t.co/875OQTvRKe"]["#PuertoRico must know we'll be with them every step along this long road, ensuring their survival &amp; robust recovery https://t.co/0o9jBhwpV5"]["Always wonderful to talk to young constituents about the great strides women have made in achieving equal opportunity &amp; the work still ahead https://t.co/HYSKu1UwaF"]["My provision to bring bomb-sniffing dogs to @SeaTacAirport &amp; other airports has been included in @TSA security bill https://t.co/608EblFnh7 https://t.co/BcvpQoDPud"]["We have no time to lose. The health &amp; well-being of millions of Americans in U.S. territories depend on swift action https://t.co/0o9jBhO0MD"]["The public servants at the Department of the @Interior deserve respect from the man charged with leading them https://t.co/875OQTegSG"]["The #OpenInternet and the #Internet economy have supported more than 1.7M jobs in US &amp; nearly 92,000 of them are in WA state #NetNeutrality"]["I will continue to fight for my state's economy that depends so greatly #OpenInternet &amp; for millions of consumers who need #NetNeutrality"]["@AjitPaiFCC plans to go against more than 10M American consumers &amp; innovators who have told him to keep internet open &amp; free #NetNeutrality"]["@AjitPaiFCC could let big telecom companies run over #SmallBiz &amp; consumers &amp; make them pay more for the same service https://t.co/M0wmnMMdPp"]["Our strong, robust #NetNeutrality rules, have without question, boosted growth as our economy is in a massive technological transformation"]["Chairman @AjitPaiFCC wants to make it possible for big telecom &amp; cable companies to erect toll lanes that would further burden #OpenInternet"]["@AjitPaiFCC has demonstrated disdain to important public interest principles he's supposed to uphold #NetNeutrality https://t.co/YbBto72stZ"]["“Instead of working with Democrats ... @SenateGOP spent the last two weeks trying and failing to pass another repeal bill.” https://t.co/FOWqjNaf9s"]["NOW: At @SenateCommerce Aviation Sub Cmte hearing on TSA Modernization: Improvements to Aviation Security\nWATCH: https://t.co/ojJlqwTv2z"]["I will not vote for someone who is going to slow down and clog #OpenInternet. https://t.co/B2tM7YKeO6"]["Last week I intro'd #Wildfire Disaster Funding Act to end destructive cycle of borrowing from fire prevention funds https://t.co/z7xm3wD5se"]["We must now focus on solutions for affordability and access by innovating in the delivery of #healthcare https://t.co/6wQu7wy0a6"]["36 Senators &amp; I express our deep concern about the dire humanitarian situation in #PuertoRico &amp; U.S. Virgin Islands https://t.co/sUJweoirSK"]["We must stop the #wildfire fire-borrowing that is currently crippling the @forestservice https://t.co/z7xm3wD5se"]["A strong &amp; #OpenInternet is key to an economy of the future. \nREAD why I oppose the Nom. of @AjitPaiFCC to the @FCC: https://t.co/crAD5NGSX1 https://t.co/eADTXDNxLy"]["In the information age of today, making sure you have a free &amp; #OpenInternet is the key to growing #innovation &amp; new business #NetNeutrality https://t.co/EQyM3VIXB8"]["TUNE IN NOW: https://t.co/aH7uKf26B2  \nSpeaking in opposition of @FCC Chair Nom. @AjitPaiFCC because we need #NetNeutrality &amp; #OpenInternet!"]["We must not allow the turnover of this iconic national #wildlife refuge to the #oilandgas industry #ANWR https://t.co/6r9jnUkafy"]["TUNE IN: Another busy day in Congress &amp; I'm discussing it all from #healthcare to #PuertoRico w/ @Lawrence O'Donnell on @MSNBC @TheLastWord"]["The public servants @Interior deserve respect from the man charged with leading them—not cheap shots in the press. https://t.co/90V2oV9xE7"]["SOON: Looking forward to joining @TheLastWord w/ @Lawrence O'Donnell on @MSNBC tonight at 10 PM ET / 7 PM PT to discuss the news today!"]["Honored to meet Association for Rescue at Sea Gold Medal winner for bravery @USCG Boatswain Mate 1st Class Jacob M Hylkema &amp; his wife today! https://t.co/8ifpb3e6BJ"]["I'm calling for creation of a @WhiteHouse position to ensure every agency is working to coordinate what will be a long #PuertoRico recovery."]["The crisis in #PuertoRico demands we continue to be vigilant with help and assistance for #PuertoRicorelief. https://t.co/Pl7YhOo0fg"]["#PuertoRico is a U.S. Territory &amp; we need to make sure they get every bit of our assistance &amp; focus as possible https://t.co/vJjT9uq2a1"]["We must now focus on solutions for affordability &amp; access by innovating in the delivery of #healthcare. https://t.co/N0nrV4qKjE"]["I’m glad this misguided #GrahamCassidy effort was successfully stalled. https://t.co/ZcOVjZGaPI"]["@SecretaryZinke’s comments yesterday betray a fundamental misunderstanding of the role of federal civil service. https://t.co/v7Zojx9GFJ"]["Replacing civil servants w/ political people wont protect #publiclands or protect #taxpayers from special interests https://t.co/vM1E7KzQEY"]["This is great news for #DREAMers in our state &amp; their families https://t.co/BcjyDPCHVn"]["@SenateGOP seems to think the only way to cut costs, is to cut care – to cut millions of Americans off #Medicaid. And I totally disagree. https://t.co/jKHiFKZgub"]["We must work diligently to encourage @WhiteHouse to appoint a Czar to lead the coordination of federal agencies in #PuertoRicoRelief efforts"]["I view the situation in #PuertoRico as very critical. We need a federal #FEMA declaration for all of Puerto Rico &amp; action by the @WhiteHouse"]["NOW: @SenateFinance hearing to question #GrahamCassidy &amp; how its deep cuts to #healthcare will benefit America \n→ https://t.co/n9aRdmAj2c"]["My Republican colleagues suggesting a winning solution to #healthcare affordability is kicking people OFF their care - are misguided at best"]["Joined fellow Democrats to read the 27K+ comments submitted ahead of the @SenateFinance Hearing on the #GrahamCassidy bill \n→TODAY @ 2PM EST https://t.co/WjQva7yRv7"]["Republicans must stop this #GrahamCassidy disaster that would throw millions of people off #Medicaid &amp; work with us for more affordability"]["We've a lot to do to deliver for kids &amp; their access to #healthcare. We can't let Republicans foolishly cut #Medicaid &amp; care of our children https://t.co/BNsaAdWrAc"]["#GrahamCassidy would cut #Medicaid -- a literal lifeline for children with special needs, complex help conditions and rare diseases"]["TUNE IN NOW: I'll be on @KING5Now to talk NEW Republican #Trumpcare bill - #GrahamCassidy &amp; what it could mean for WA state families"]["We need to stop #GrahamCassidy &amp; move on to a #healthcare solution that will help us create better care &amp; more affordability in the market"]["We must come together &amp; pass a #DACA fix. Creating this level of uncertainty &amp; anxiety for #DREAMers is not what we should be striving for."]["From Seattle to Spokane the #diversity of our residents is part of WA's strategy for moving forward, for a better economy &amp; a better society"]["The majority of the American people support #DACA &amp; over 300 business leaders agree #DREAMers help our country be more dynamic &amp; prosperous"]["I've met &amp; talked to many #DREAMers, I know how much they invest in their communities, help our state &amp; local economy tremendously #DreamAct"]["ICYMI this week I intro'd the #Wildfire Disaster Funding Act. Permanent #wildfire funding fix must be a top priority https://t.co/T8wR30ZUyh"]["I'm very concerned about the millions of kids who'd be hurt by no longer having access to affordable #healthcare w/ #Medicaid #GrahamCassidy"]["Calling on Republicans to abandon #GrahamCassidy #Trumpcare bill that will hurt kids &amp; families in WA\nTUNE IN: https://t.co/WyWxU44p0a"]["SOON: Sounding the alarm 🚨 on NEW Republican #Trumpcare sneak attack &amp; the harmful effects it will have on WA\nWATCH: https://t.co/W5YVOTY6Ix"]["TODAY @ 11AM PST I'm joining patients, doctors &amp; health leaders to sound the alarm on new #Trumpcare bill’s effects on WA’s kids &amp; families"]["There's nothing good about #GrahamCassidy kicking 15M people off #Medicaid. We must get this right the #healthcare of America too important"]["I'd never have guessed a decade after passing the bipartisan #DreamAct we'd be fighting an Admin trying to strip protections from #DREAMers"]["17,000 #DREAMers working, going to school, supporting their families &amp; WA’s economy need the certainty to contribute &amp; live out their dreams"]["We should tell #DREAMers they have a chance in our country &amp; economy &amp; continue moving forward on passing comprehensive #immigration reform https://t.co/0hd1Lap5xW"]["We must make sure we are giving #DREAMers - who contribute so much to our country - the certainty they deserve &amp; pass a permanent #DACA fix"]["NOW: I'm with @PattyMurray @RepAdamSmith @RepJayapal calling on Republicans to #DefendDACA, protect #DREAMers\nWATCH: https://t.co/0uQyRcgiZh"]["Pacific salmon are central to #PNW economy, culture, environment &amp; these released Atlantic salmon pose a real threat https://t.co/ipt2SjSBfz"]["100 years of #conservation &amp; open space for all to enjoy through hunting, fishing and recreating are in danger https://t.co/jfZPuS9dyh"]["#Airports are economic drivers &amp; dog teams get passengers through checkpoints sooner while increasing safety levels https://t.co/BNvb9qKFqF"]["Happy to join @awolympia at #AWBsummit17 to talk about how Washington state is leading the way in #innovation #manufacturing &amp; #jobcreation! https://t.co/PVWChmmxed"]["Bipartisan governors' letter is something we must listen to because the affordability of #healthcare is important https://t.co/wwnTbswEP3"]["#Medicaid - in helping our most vulnerable citizens gain access to #affordable health care, ends up reducing everybody's #healthcare costs"]["We can never forget what the Children’s Health Insurance Program means for families &amp; the kids impacted #CHIPworks https://t.co/x6bCrTgk91"]["Graham-Cassidy basically ends the 52-yr state/federal partnership that is #Medicaid\nhttps://t.co/3pqdD1XEJZ"]["FACT: #Medicaid helps the most vulnerable Americans gain access to affordable coverage which ends up reducing everybody's #healthcare costs"]["Giving our most vulnerable people affordable access to care is a priority because it actually reduces everyone's #healthcare costs #Medicaid"]["We have the ability to work together &amp; we're not going to take the bait that cutting essential services is an answer https://t.co/TFzLFg6jnC"]["Repealing #DACA will impose severe harm. Not only on 800,000 #DREAMers nationally but on communities across America. We need the #DreamAct https://t.co/JnzFfRvcYM"]["We expect due process &amp; facts to guide our President's actions, not repeated falsehoods about immigrants &amp; #DREAMers. We must #DefendDACA https://t.co/E2oLmXm08a"]["Like many immigrants before them, brave young #DREAMers strengthen our economy &amp; are valued members of our communities #DefendDACA #DreamAct"]["#DACA allows young #DREAMers to pursue their dreams to become teachers, doctors &amp; entrepreneurs in our communities. Must pass the #DreamAct"]["AKA: Yet one more Republican sneak attack to kick Americans off of #Medicaid #GrahamCassidy https://t.co/BV4wnRTD59"]["The latest Republican #Trumpcare #healthcare sneak attack – #GrahamCassidy bill – would hurt WA &amp; Washingtonians \nhttps://t.co/8PpHUd11tx"]["The #Wildfire Disaster Funding Act of 2017 we introduced today will stop the fire-borrowing that is currently crippling our @forestservice https://t.co/gY8kqvqgUY"]["Bill would sunset &amp; privatize Medicaid Expansion. There's nothing good about kicking 15M Americans off of #Medicaid https://t.co/WjeQqwTEb3"]["10 bipartisan governors are telling us to slow down &amp; work on #healthcare on a bipartisan basis. Not #GrahamCassidy https://t.co/9zXBuS0Yv3"]["The #GrahamCassidy #Trumpcare bill is just one more sneak attack by our colleagues at kicking people off of #Medicaid https://t.co/gpqoZ6ichX"]["Republicans are trying once again to repeal the Affordable Care Act without a successful strategy to move our nation forward #GrahamCassidy"]["We should be finding bipartisan solutions to improve #healthcare coverage for millions of Americans. #GrahamCassidy https://t.co/XpBX8FFIIn"]["I said it before &amp; I say it again to my Republican colleagues: Don’t play politics with #healthcare. #GrahamCassidy https://t.co/D3zZYn3sb0"]["Your stories, calls, emails, advocacy &amp; your hard work stopped #Trumpcare once before &amp; it can again #GrahamCassidy https://t.co/eCnfAkXwXP"]["Closing #NationalMonuments will cost Americans’ jobs, tourism &amp; access for outdoor recreation #KeepItPublic https://t.co/LepvVZybmd"]["We must do everything to protect our #oceans, fishing culture, shellfish &amp; fishery jobs from #OceanAcidification https://t.co/hCiyV8qU46"]["We need to protect #ANWR the #Arctic National Wildlife Refuge, not raid it for oil. https://t.co/igtUtk96Zw"]["Any proposal to destroy this pristine Arctic ecosystem #ANWR for the benefit of #oilandgas companies must be stopped https://t.co/wajg3PWc5m"]["Attempting to eliminate #outdoor recreation opportunities for #veterans &amp; Americans is unacceptable #KeepItPublic https://t.co/K990EqgkhI"]["Teddy Roosevelt would roll over in his grave if he saw @SecretaryZinke’s attacks on our #PublicLands https://t.co/fU87K51Rxd"]["This report and entire process have amounted to nothing but a colossal waste of tax payer dollars. #KeepItPublic https://t.co/LepvVZybmd"]["An attack on any of our #NationalMonuments is a threat to our most sacred sites, natural heritage &amp; outdoor economy https://t.co/K990EqgkhI"]["If this is true, @SecretaryZinke’s report is the latest attempt to turn over our #PublicLands to oil &amp; gas companies https://t.co/LepvVZgAuF"]["Glad to be in Tacoma to cut ribbon on new affordable housing. By passing my #LIHTC bill we can build more #affordablehousing across WA &amp; US https://t.co/Cg0sTT7fhA"]["We need to ensure every American can be skilled &amp; trained for the #jobs of the future &amp; that means making sure they have #AffordableHousing"]["I can't emphasize enough that #AffordableHousing is a crisis hurting families across America. It's why I'm fighting hard to expand #LIHTC https://t.co/6I5z3SbXE7"]["Will help communities to restore communications &amp; respond quickly regardless of what Mother Nature throws at them https://t.co/awjpCXwpRh"]["We must continue to work together to find every possible opportunity to ensure the economic and cultural success of Indian Country"]["From #AffordableHousing to #infrastructure these grants will help revitalize &amp; bolster our native communities in WA https://t.co/861dnQ660a"]["Phone service, broadband, and TV access are critical to saving lives and protecting property when disaster strikes https://t.co/2Lj6y7Tc22"]["President's proposal to eliminate WA's sales tax deduction is dead on arrival https://t.co/zfQ4ZigQjV"]["As extreme weather #wildfires &amp; #hurricanes become more severe we will rely on these critical communications systems https://t.co/awjpCXeOZJ"]["The rise in hate violence &amp; threats against immigrants, religious &amp; racial minorities across the US is unacceptable https://t.co/UG9n7kB2Xw"]["Here's my full statement on today's tragedy at Freeman High School: https://t.co/EqxnOAu1hv"]["Pete Domenici left a profound mark on the nation's energy policy. I offer my condolences to his wife Nancy and the entire Domenici family."]["Closely monitoring devastating news of the school shooting in Spokane County. My heart is with the Spokane community."]["President Trump’s reluctance to condemn hate, bigotry &amp; racism is deeply alarming to me and to millions of Americans https://t.co/UG9n7kSEm6"]["It's imperative we keep investing in #cybersecurity &amp; develop technology to make our economy safer &amp; more reliable https://t.co/kbNI326uoR"]["In wake of Harvey, Irma &amp; devastating #wildfires my bill will improve phone, internet, TV/Radio service in disasters https://t.co/DzHj7FjT9i"]["In WA the #SANDyAct will help communities respond to disasters in the #wildfire-prone &amp; coastal regions at risk for #tsunamis &amp; #earthquakes"]["Phone, #broadband &amp; TV access are critical to saving lives &amp; protecting property in disasters as #wildfires &amp; #hurricanes become more severe"]["#SANDyAct paves way for communities to restore communications &amp; respond more quickly before, during &amp; after disaster https://t.co/iD012SkzvM"]["#Senate passage today of my bill the #SANDyAct will help disaster-struck communities restore essential communication services in emergencies"]["Any reassigning of @Interior staff to force them to resign, silence their voices or to punish is extremely troubling https://t.co/9hlfmByx0F"]["It will cost us millions if not billions in the future if we don’t continue the investment in research now https://t.co/TzC6oXh89K"]["Lives depend on being able to communicate when disaster strikes – whatever the emergency may be https://t.co/4CtGZwwqFW"]["HAPPENING NOW: @SenateFinance Committee Hearing on #Healthcare issues impacting cost &amp; coverage\nWATCH LIVE: https://t.co/7GJInnMtCE"]["#DREAMers invest in their communities, they pay state &amp; local taxes, work hard &amp; contribute greatly to our economy https://t.co/6lE5etOoh2"]["The majority of Americans &amp; over 300 business leaders agree that #DREAMers help us build a better and more prosperous America."]["The farmed salmon that escaped pose a threat to wild Pacific #salmon including endangered &amp; threatened #PNW stocks https://t.co/1DnE2sAHAT"]["From #AffordableHousing to #MealsonWheels, these grants will help revitalize &amp; bolster underserved communities in WA https://t.co/Jao4xxRiSS"]["We honor the men &amp; women who serve this nation for their bravery on #September11, 2001 &amp; for protecting our freedom &amp; communities every day"]["As we recall the tragedy of 9/11 we are reminded of America's strength &amp; resilience by the tremendous heroism shown that day #NeverForget"]["Today we remember the lives lost, their families &amp; loved ones, as well as the outpourings of love &amp; support 16 years ago on #September11th"]["Ending #DACA would be misguided. #DREAMers invest in their communities, work hard &amp; contribute to our U.S. economy https://t.co/ccdm82YBS7"]["We can never forget the children who are affected by Children’s Health Insurance Program &amp; what having this program means to them #CHIPworks"]["These actions only reinforce the Trump Admin's efforts to curtail #civilrights protections for students &amp; families https://t.co/bnmZmaClhI"]["Despite success, HHS cut the final 2 yrs of #TeenPregnancy Prevention grants w/o cause or rationale for termination https://t.co/QzoBjTpGAt"]["@SenateFinance CHIP provides critical access for millions of children who need #healthcare"]["TUNE IN NOW: 10AM @SenateFinance hearing on reauthorizing the Children’s Health Insurance Program (CHIP)\nWATCH LIVE: https://t.co/zvzl6SazKV"]["#ICYMI this is a huge win for WA Dungeness #crab fishery, economic pillar of our coastal communities &amp; #job creator! https://t.co/DLdSxYINuY"]["I’m urging the Senate Approps Cmte to support programs that will clean up water contamination near military bases https://t.co/dNUfSVA9qg"]["We must work together in Congress to get this done: protect #DREAMers &amp; #DefendDACA https://t.co/q7UUBEJNQp"]["My colleagues must take #DACA seriously &amp; move towards legislation. It's simple: either you want to protect these young people, or you don't"]["Since 2001 I have been a supporter of the #DREAMAct &amp; I cannot believe that this is the message from our President to thousands of #DREAMers"]["In a remarkable act of courage and trust, 17,500+ young #DREAMers today are working &amp; contributing to our economy in the state of Washington"]["#DACA has given certainty &amp; predictability to so many young #DREAMers brought to the USA not through their own actions – but others’ actions"]["This repeal will impose severe harm not only on 800,000 #DACA recipients but the broader community. Congress must work to pass the #DREAMAct"]["Building new polar #icebreakers is critical to our long-term leadership &amp; economic vitality in the #Arctic #USCG https://t.co/nr6JYqspVx"]["I joined members of the WA Delegation to urge President Trump to protect #DREAMers. Read our full letter to @POTUS: https://t.co/s4p6qzbfUz"]["Nearly 18,000 #DREAMers in WA are our neighbors, our children's classmates, our members of our military, contribute to &amp; call WA state home"]["Decision to end #DACA is wrong. We must allow thousands of #DREAMers with great potential to continue contributing to our society &amp; economy"]["In so many ways our American workers are what make the opportunity &amp; prosperity of our great state of WA &amp; country a reality #LaborDay2017"]["Major victory for Washington state workers and manufacturers https://t.co/IqcppmslfM"]["We must ensure American workers are not left behind but rather leading us into the future. Today we honor their contributions #LaborDay2017"]["#LaborDay is a reminder that we must continue to fight for the American worker &amp; fight to ensure the #minimumwage is a #livingwage"]["Happy #LaborDay! Today and every day we celebrate the contributions of American labor, workers, and their families to our great nation"]["Without #broadband rural communities can’t access the opportunities presented by our increasingly connected economy https://t.co/FHnupLSgRs"]["Tribes, fishermen &amp; state agencies are all working to respond, but this release calls for immediate federal response https://t.co/ZPpL18GApm"]["“Last year the #solar industry employed many more Americans than coal while wind power topped 100,000 jobs” @nytimes https://t.co/QIFyBHRHHg"]["These farmed salmon could threaten our wild #salmon including multiple endangered &amp; threatened stocks in the region https://t.co/HAznjKtAPl"]["#DREAMers are our neighbors, our children's classmates &amp; our military members serving proudly. We see you. We stand with you to #DefendDACA!"]["Thousands of #DREAMers could be deported unless we #DefendDACA &amp; it would result in Washington state losing over $1 billion of annual GDP"]["#DREAMers have been carefully vetted &amp; granted permission to work – a clear indication they are not an enforcement priority #DefendDACA"]["Engaging in #immigration raids to simply detain people is damaging to our communities &amp; our country. #DREAMers need us to #DefendDACA"]["We must allow a generation of young #DREAMers with great potential to continue making many contributions our society &amp; economy #DefendDACA"]["The scale of this escapement calls for immediate &amp; direct federal response &amp; capture of the released farmed #salmon https://t.co/N40LaDSvs1"]["Farmed salmon threaten wild Pacific #salmon in #PugetSound, so central to our #PNW economy, culture &amp; environment https://t.co/ZPpL18GApm"]["Very concerned the Trump Admin has not prioritized #cybersecurity of #energy networks with any meaningful action https://t.co/llhcIRvbt4"]["#RenewableEnergy policies not only create #jobs, but they save consumers money &amp; can provide them with more choices https://t.co/QIFyBI9iyO"]["I remain concerned about President Trump's lack of action to prevent catastrophic #cyberattacks against our country https://t.co/llhcIRvbt4"]["Here are ways you can help local families &amp; those who have been impacted &amp; displaced by #HurricaneHarvey https://t.co/5qD5RuwHZd"]["Great news for #Seattle! Funding could save as much as 15,000 metric tons of #carbon #emissions from being dispersed https://t.co/58Is7jLJE4"]["Glad to see Washington state companies doing their part to help #HurricaneHarvey disaster relief efforts  https://t.co/7mMNgaLaq7"]["Proud of local @RedCross aiding disaster relief efforts, WA stands w/ Texas &amp; all those affected by #HurricaneHarvey https://t.co/tMZydUPR4V"]["Transgender service members are honorable, patriotic &amp; protect freedoms &amp; values we hold dear. This is unacceptable. https://t.co/nffrLrlMuT"]["In WA we are hikers, bikers, climbers, skiers &amp; outdoor enthusiasts &amp; we know we must protect #NationalParks #Forests #PublicLands #Parks101 https://t.co/0jfSohm1Mi"]["Today we thank &amp; celebrate @NatlParkService for 101 years of #NationalParks stewardship &amp; #publiclands preservation #FindYourPark #Parks101 https://t.co/PSTMbTMtV7"]["Happy 101st Birthday @NatlParkService! Enjoy #NationalParks with free entry to your favorite park today! #FindYourPark #NPS101 #Parks101 https://t.co/Q5CspBJL96"]["@POTUS doesn't have the legal authority to overturn these protections – it’s simply a giveaway to special interests https://t.co/ivogRWM9I6"]["These places represent 100 yrs of #conservation &amp; open space for all to enjoy through hunting, fishing &amp; recreating https://t.co/9zfUy9CnLB"]["@POTUS doesn't have the legal authority to overturn the protected status of #MonumentsForAll &amp; I'll continue fighting to keep them that way https://t.co/c0fDUGfFkd"]["Read my full statement on President Trump’s most recent effort to shut down our #NationalMonuments &amp; #PublicLands → https://t.co/MKYvObuIOz"]["The Trump Administration is trying to erase over 100 years of #conservation &amp; open space for all to enjoy in America https://t.co/uMiCTy6ovc"]["Any attempt to eliminate #outdoorrecreation opportunities for veterans &amp; Americans by giving them away to special interests is unacceptable"]["#TeddyRoosevelt would roll over in his grave if he could see what Donald Trump &amp; Ryan Zinke are trying to do to our national treasures today"]["This #NationalMonuments report &amp; entire process have amounted to nothing but a colossal waste of tax payer dollars. https://t.co/uMiCTy6ovc"]["@SecretaryZinke’s secret report to @POTUS is the latest step in a rigged process to try &amp; turn over our #publiclands to #oilandgas companies"]["“It’s a huge step in bringing the Makah Tribe into the 21st century,” said Crystal Hottowe, Tribe’s tech lead team. https://t.co/YLf2jT6p8t"]["Thanks to the work between @CenturyLink &amp; the Makah Tribe, Neah Bay has access to #broadband that will support local families &amp; the economy. https://t.co/h6DyEbO8Vj"]["We need more #broadband #internet access in Indian Country in the state of Washington and throughout rural America https://t.co/YLf2jSOOgV"]["In WA we officially put an iconic name next to an iconic place in honor of former governor &amp; U.S. Senator Dan Evans https://t.co/TQ2zKyTsMT"]["I was proud to join the ceremony to rename Olympic Wilderness in honor &amp; recognition of Sen. Dan Evans &amp; his work to protect our #wilderness https://t.co/4f891QjjEQ"]["ICYMI I was @ #LanderStreet to talk about improving our #infrastructure, reducing delays, boosting freight mobility, jobs &amp; our #PNW economy https://t.co/OgJGa5KOrt"]["Our economy depends on our ability to move freight efficiently to fuel #jobgrowth, exports &amp; WA state competitiveness in the global economy"]["Congrats Skokomish Tribe on new community center built w/#energyefficient tech to generate as much power as it uses! https://t.co/XqA4avY7Jn"]["It is so disturbing that the President of the United States has failed to uphold our nation's values. https://t.co/t0AHsM0xGi"]["In light of the horrific attack &amp; hatred in Charlottesville, I urge AG Jeff Sessions to act quickly &amp; address the alarming rise of hate"]["I’m proud to have helped secure the $45 million from the FASTLANE grant program I championed in the FAST Act in 2015 https://t.co/kWWoVcZr4x"]["President Trump’s reluctance to quickly &amp; directly condemn the hate, bigotry &amp; racism of the white supremacists &amp; members is deeply alarming"]["TUNE IN: My #CantwellTownHall in Spokane WA starts @ 6PM PST to talk issues important to WA &amp; E. Washingtonians!\n→https://t.co/DIWUxVdtwC"]["Following events in Charlottesville, 11 Senators and I renew the call for a federal response to hate crimes https://t.co/rt7e1tDnos"]["In nearly all circumstances, engaging in #immigration raids to detain people is unnecessary and damaging to our communities #DefendDACA"]["#DACA recipients have been carefully vetted &amp; granted permission to work, a clear indication DACA recipients are not an enforcement priority"]["Nearly 790,000 #Dreamers have received #DACA allowing them to contribute to our country as teachers, nurses, engineers &amp; #SmallBiz owners"]["We must #DefendDACA &amp; thereby allow a generation of young immigrants with great potential to continue contributing to our society &amp; economy"]["According to @CatoInstitute deporting #DACA recipients would cost us over $60B &amp; a $280B reduction in economic growth over the next decade"]["We invested in Dreamers. It makes no sense to squander their talents by deporting them to countries they don't know or remember #DefendDACA"]["Today on the 5th anniversary of #DACA’s implementation, we recommit to #DefendDACA &amp; pass the #DreamAct &amp; comprehensive #immigration reform https://t.co/T9giq7wAim"]["Thank you to everyone who joined my #Wenatchee #CantwellTownHall for many thoughtful questions &amp; a great discussion! https://t.co/inZIYXGDf3"]["My thoughts are with the victims of these acts and their families."]["The hate and bigotry shown in Charlottesville is deplorable and contrary to America's values of acceptance and respect."]["TUNE IN: @ 10AM PST for my Wenatchee #CantwellTownHall discussing issues important to WA &amp; Central Washingtonians! → https://t.co/DIWUxUVS82"]["#ICYMI: We need better technology to reduce the risk of #Wildfires to our communities &amp; enhance #firefighting safety https://t.co/QB3tU1nERC"]["The #OpioidEpidemic is hurting our communities. We need increased access to education, treatment &amp; recovery programs https://t.co/izgz1GT9Hl"]["#Infrastructure investments are critical to our economy. I look forward to working with my Senate colleagues on improving our infrastructure"]["“Housing isn’t a conservative or liberal issue it’s one that impacts all of our lives, in every corner” #ExpandLIHTC https://t.co/CoeevwaOYT"]["#Infrastructure investments like this are critical to keep our economy moving &amp; I will work to ensure they continue https://t.co/8lMmLtF8hS"]["Thank you to @USCG's Jacob Hylkema, awarded 2016 AFRAS Gold Medal, for your courage &amp; heroism during a rescue at sea https://t.co/Q41Ebst6E9"]["We must address the ongoing heroin &amp; prescription #OpioidEpidemic that is devastating communities across the nation https://t.co/1bQVIUjPWt"]["As incomes rose between 2013 &amp; 2015 rents increased as fast but outpaced income for the poorest renters #ExpandLIHTC https://t.co/xc1P534z9W"]["America's #AffordableHousing Crisis may be worse than we thought, according to a new @HUDgov housing needs report https://t.co/H8dGVfYPpO"]["NEW REPORT: Finds the number of families struggling to pay rent increased to the 2nd-highest level on record @HUDgov https://t.co/sXEOZBZMMx"]["Addiction to heroin &amp; other #opioids has reached epidemic levels. Over 30,000 Americans are estimated to die each yr due to opioid overdoses"]["We need a nominee who truly believes in the mission of #ExImBank to support &amp; defend its 80-yr history supporting American jobs &amp; businesses"]["Nom. clearly knew little of #ExImBank critical work to support #smallbiz &amp; expand opportunities for US manufacturers https://t.co/WaLuEWQ2l2"]["Suspending this #coal rule violates the @Interior Department's obligation to ensure a fair return to #taxpayers https://t.co/z8GmMmqKYP"]["Thank you to everyone for all your hard work, strength &amp; advocacy to protect our #PublicLands! https://t.co/CD5vqlfuTd"]["Investing in America’s #infrastructure is key to maintaining and growing our economy https://t.co/PIP1nLhlF8"]["Thousands in the state of WA live in #tsunami danger zones &amp; being prepared in the case of an emergency is crucial https://t.co/gRqUA9NyCQ"]["These “Citizen science” volunteer scientists are doing great work. We must understand and combat #ClimateChange https://t.co/Qhn3rn9Gxp"]["Looking forward to my upcoming #CantwellTownHall in #Spokane, WA at @GonzagaU! Look forward to seeing you! #GoZags https://t.co/2F86U5a8zS"]["Excited for my upcoming #CantwellTownHall in the \"Apple Capital of the World\" #Wenatchee, WA! Hope you can join me! https://t.co/aFCOzzinln"]["In WA state we're lucky to have the opportunity to explore some of the best #Outdoor places &amp; #PublicLands anywhere\nhttps://t.co/YPf3qNGUgh"]["#ICYMI: Grant to create aprx 13K new family-wage jobs, improve freight infrastructure &amp; bolster local manufacturing https://t.co/6oBtFTgzQk"]["Excited to hold a #CantwellTownHall in Wenatchee &amp; Spokane to meet &amp; hear from more Washingtonians!  \nRegister HERE: https://t.co/ic6q5O7voI https://t.co/kAGQv1LLNL"]["Big win for improving our infrastructure, reducing delays in freight movement, continuing to grow jobs &amp; economy https://t.co/6oBtFTgzQk"]["We must find a way to improve real-time weather forecasting everywhere, so no region is unprepared for #Wildfires https://t.co/GbchF6G1ey"]["I want us to work together in a bipartisan way on policies that benefit WA state &amp; our nation https://t.co/YX77O077Iv"]["Proud to announce a major win for WA Crab #Fishermen with the passage of my bill preserving the Tri-State Agreement! https://t.co/iX7bn5hWH5"]["WA state’s Dungeness crab fishery is an economic pillar of our coastal communities, supporting thousands of #fishing and processing #jobs."]["Major win for WA Crab #Fishermen! Tri-State Agreement will let us sustainably manage our crab fisheries for many yrs https://t.co/29gqBW9fbg https://t.co/S8PCwJQDnj"]["HBD @USCG Thank you to the brave @USCG men &amp; women stationed around the globe who protect our maritime interests &amp; national security #CG227 https://t.co/mM9g8ss11t"]["New $9.9M grant award could create 13,000 new jobs in our region as a result of the increased efficiency of freight! https://t.co/Q26wcuqnVK"]["Proud to work w/ @PattyMurray to improve our infrastructure, reduce delays in freight movement, grow jobs &amp; advance #PNW economic leadership"]["Happy Birthday @USCG! Celebrating 227 years of service, we honor the 88,000 #CoastGuard men &amp; women who bravely defend our nation #CG227 https://t.co/J1WpejZ0uD"]["Proud to announce Cantwell-created grant program award of $9.9M for Moses Lake #infrastructure project &amp; local jobs https://t.co/Q26wcu8N4c"]["Thank you to Wenatchee-native Steve King for your excellent testimony at our ENR hearing on #wildfires yesterday https://t.co/OMebEuc2ae"]["Proud to co-sponsor a bill now headed to President’s desk that would expand education opportunities for our veterans https://t.co/3AENEeSECS"]["We so are proud of Jeff and his leadership in the business world. He helped so many do great things in our state. https://t.co/m7kBmkmbUb"]["ENR hearing today on new tools &amp; technology to help decrease the risks of #fire fighting – as we see a new increase &amp; severity in #wildfires https://t.co/slGkqhL7ns"]["Our #FireFighters work tirelessly to protect homes, communities &amp; people, and their diligent work has saved many hundreds of homes this year"]["Our thoughts &amp; prayers are with those in Montana who lost a life yesterday &amp; to the brave #FireFighters who continue to battle the blazes"]["READ: I spoke with @CityLab about our #AffordableHousing crisis &amp; the critical tool we need to expand to fix it → https://t.co/GmSbGTK05X"]["Expanding the #LIHTC is the tool we need to build 400,000 new units nation-wide &amp; nearly 40,000 in Washington state https://t.co/K0xOqlah1E"]["Going forward we must work together to drive down costs/ increase access/ innovate in the healthcare delivery system https://t.co/dXoySL1g3a"]["Your stories, phone calls, emails, advocacy and all your hard work paid off – and it has not gone unnoticed. https://t.co/5zrzPNglpA"]["This #AffordableHousing crisis is both an urban &amp; rural problem – it’s everywhere – &amp; it's not going anywhere unless we #ExpandLIHTC now"]["Jeff’s life is an unbelievable story of a Tacoma-native who grew up to co-found and run one of the most successful companies in the America"]["We're shocked &amp; saddened by the passing of Jeff Brotman who helped so many do great things in WA. Our thoughts &amp; prayers are with his family"]["Transgender service members protecting the freedoms &amp; values we hold dear must receive our utmost respect &amp; dignity https://t.co/V3xL2Q6E6A"]["#Startups are creating #jobs every day in our own backyards! Proud to work to help them thrive &amp; support their efforts today on #StartupDay! https://t.co/EKtzWUZii4"]["One more reason we need #OpenInternet? Our #Startups &amp; #SmallBiz depend on it to #innovate, access customers &amp; compete globally #StartupDay"]["#Startups create 2 million jobs a yr, that’s why we must expand opportunities so they can continue to power our economic engine #StartupDay https://t.co/PbJ85U328V"]["We need to continue fighting to help #Startups &amp; #SmallBiz access the capital needed to expand &amp; create jobs in our communities #StartupDay"]["Over 11M renter families pay 1/2 their income in rent leaving little for necessities like transportation, food &amp; medical care #ExpandLIHTC"]["We must work together to get this right https://t.co/5KLcnFCAiC"]["TUNE IN NOW: @SenateFinance hearing to discuss the #AffordableHousing crisis: challenges &amp; solutions \nHERE: https://t.co/NGtVnvHjwc"]["“Women are doing the heavy lifting and wearing the pants, or at least the pantsuits, in our nation's capital.” https://t.co/GebTAeX6sP"]["TMRW @ 10 AM ET: @SenateFinance hearing on America’s #AffordableHousing Crisis: Challenges &amp; Solutions\nWATCH LIVE: https://t.co/DIWUxUVS82"]["Women in Washington state face a persistent #paygap. Our working families must have #equalpay now! #BlackWomensEqualPay https://t.co/O115J4H9cm"]["Men see $10. Black women see $6.30. We need #BlackWomensEqualPay now! https://t.co/c60wGc54zG"]["#Healthcare vote proves Senate women do heavy lifting #MondayMotivation https://t.co/GebTAeX6sP"]["Now we must chart a path to progress. Now we must find bipartisan solutions on #healthcare https://t.co/2qQ7r8BGJB"]["Coverage of millions has been preserved. Now we must find bipartisan fixes to drive down costs, innovate &amp; improve our #healthcare system"]["Unacceptable. All Americans protecting the freedoms &amp; values we hold dear, must receive our utmost respect &amp; dignity https://t.co/hFqNWXDPJ6"]["All of your hard work paid off. The voices of millions of Americans were heard. Coverage was preserved. Now we must chart a path to progress"]["Here's my statement on tonight's #ACA vote: https://t.co/eTGshLXNwU"]["Your stories, your phone calls, your emails, your advocacy, and all of your hard work paid off. Now we must chart a path to progress."]["Whether we are talking about one or all – every #Trumpcare proposal has meant kicking millions of Americans off their #healthcare https://t.co/IRX5s0SGCm"]["Letter from @AHIPCoverage, the largest national association of health plans: The status quo is not sustainable. https://t.co/6QHHwS9Grw"]["Health insurers agree #RejectRepeal https://t.co/w269EQjxK9"]["Make no mistake a “skinny” repeal will still strip #healthcare from millions of Americans https://t.co/qKCVUyxbvp"]["The fact @SeanteGOP are trying to pass a bill that no one has seen, just shows you – people are very worried about any #Trumpcare proposal"]["My Republican colleagues are trying to jam #Trumpcare through the only way they can: get something passed, no matter what it is."]["I've worked hard to make Congress recognize the value of freight &amp; transportation infrastructure to states like WA &amp; secure critical funding"]["In 2016, WA received $50 million from my INFRA program, supporting fixes for Lander Street’s notorious congestion → https://t.co/g1opRHTDqg https://t.co/9G3Pvqj7YT"]["With no substantive progress being made by @realDonaldTrump on his #infrastructure agenda, these funding programs are increasingly important https://t.co/bwwYP6ribG"]["I have been hard at work securing funding for #infrastructure projects that will help our #economy continue to grow https://t.co/g1opRHC21G"]["TUNE IN: Soon to talk w/ @MSNBC @AliVelshi &amp; @SRuhle about @SenateDems strategy to stop #ACA repeal &amp; our fight to save #HealthCare, &amp; more"]["This @SenateGOP version of a \"skinny\" #ACA repeal bill would result in premiums roughly 20% higher than under current law each year -@USCBO"]["Senate Republicans' rumored “skinny” #Obamacare repeal bill could lead to 16 MILLION MORE Americans being uninsured -@USCBO"]["The message from governors – even Republican governors – is clear: Protect #Medicaid. I hope my Republican colleagues will listen to them"]["#Medicaid boosts economic health too, reducing bankruptcy rates, cutting uncompensated care in half &amp; giving families access to #healthcare"]["@SenateGOP’s plan to pull the rug out from under #Medicaid recipients will hurt Americans, hurt jobs &amp; hurt economies across our nation"]["More than 600,000 in WA have gained coverage through #Medicaid expansion; we cannot allow this War on Medicaid to continue"]["Today I'm offering a measure to be voted on this afternoon to protect #Medicaid &amp; the Medicaid expansion from devastating cuts https://t.co/SrUaeuumMn"]["Transgender servicemembers are honorable &amp; patriotic. Discrimination in any form is unacceptable. We must defeat this discriminatory policy."]["NOW: I'm speaking on the Senate floor about my measure to protect #Medicaid\nWATCH HERE: https://t.co/aH7uKf26B2"]["Thank you to everyone who is keeping up the fight against this disastrous Republican #HealthCare bill, we must continue to be loud! https://t.co/wDwL7P0opc"]["Today I voted NO on the motion to proceed to Republican’s #ACA repeal. Here’s my full statement: https://t.co/McyhatNHCv"]["@SenateGOP I will continue to use every tool at my disposal to protect #healthcare for Washingtonians and all Americans"]["@SenateGOP Today’s motion to proceed formally declares a war on #Medicaid, and is a key step in taking #healthcare away from millions of Americans"]["@SenateGOP Instead, come work with us to fix the individual market and improve the Affordable Care Act #SaveACA"]["Since January, I have been repeating the same message to my @SenateGOP colleagues: don’t kick millions of Americans off of #healthcare"]["I ask my Republican colleagues to stop &amp; think about the millions of Americans who are scared to death about what is going to happen today."]["With today's vote @SenateGOP is saying: Jump off the cliff &amp; oh, by the way, I'll throw you a parachute on the way down. This doesn't work."]["The people of the United States have spoken very clearly. They're not interested in cutting millions of Americans off of #Healthcare"]["Now hours from a vote: We still don't know on what bill &amp; Americans still don't know if their #healthcare will be repealed w/ no replacement"]["WA’s maritime economy relies on healthy habitats that support fishing, transportation tourism &amp; recreation that #marine debris can devastate"]["NOW: Commerce Oceans Sub Committee Hearing on the disastrous effects of #marine debris in our #Oceans &amp; #GreatLakes→ https://t.co/LvOcgubnAE"]["The proposed Pebble Mine in #BristolBay is a direct threat to #salmon #jobs, &amp; our #PNW economy - we must maintain common-sense protections"]["The science is clear: a mine in #BristolBay would be catastrophic &amp; irreversible for #salmon &amp; the jobs it supports. https://t.co/vUvMDyf1Ed"]["The Department of the @Interior is key in protecting communities from these trends &amp; the effects of #ClimateChange. https://t.co/ExNBEtasvD"]["I believe that it's the consensus of the scientific community that #ClimateChange is real. It is happening now &amp; it is due to human activity"]["The nature and the pace of #ClimateChange will have serious impacts on our communities. https://t.co/ExNBEts3Ud"]["#Climate #science is not just some academic pursuit. We need this information for very important policy decisions. https://t.co/ExNBEts3Ud"]["I remain committed to protecting federal employees who should be allowed to speak freely about #climate &amp; #science. https://t.co/ExNBEts3Ud"]["@Interior employees must be allowed to speak freely about #science and not be silenced https://t.co/ExNBEts3Ud"]["I want to know: is @SecretaryZinke committed to protecting these individuals &amp; scientific budget that goes with them https://t.co/ExNBEtasvD"]["If Mr. Clement’s claims are true, this is unacceptable. @SecretaryZinke must explain his agency’s actions https://t.co/ExNBEtasvD"]["It’s mean of the @SenateGOP to keep Americans in the dark about a bill that could devastate their #healthcare future"]["I want to know if the Department of the @Interior is silencing #science. https://t.co/ExNBEts3Ud"]["The Trump Administration is singling out the @Interior Department’s scientists. I will not allow this to continue. https://t.co/ExNBEts3Ud"]["It appears once again that the Trump Administration is hostile towards those who have dedicated their lives to civil service."]["I am asking the @Interior Inspector General to investigate Mr. Clement’s claims https://t.co/ExNBEts3Ud"]["The #AffordableHousing crisis is exploding all across the country. Americans are facing pressures from all sides &amp; they need a #ABetterDeal https://t.co/gFm8oICdID"]["Whatever mean #healthcare bill @SenateGOP pick it will still slash #Medicaid &amp; offer no acceptable #ACA replacement https://t.co/bjNbNMxPl6"]["I joined @SenateDems to unveil our plan for #ABetterDeal because hard working Americans deserve a #FairWage, #BetterCare &amp; #EqualOpportunity https://t.co/jSPzwOeFUq"]["@AmeriCorps plays a vital role in strengthening communities across Washington state &amp; our nation &amp; must be protected https://t.co/6IjAdtrA1O"]["“Rural hospitals in states [like Washington state] that chose to expand #Medicaid would be the most vulnerable.” https://t.co/2zOjgzEqQ0"]["@AmeriCorps program is too important to risk - enriching both the lives of volunteers &amp; the communities they serve  https://t.co/6IjAdt9Zag"]["I'm concerned experienced staff &amp; scientists is being reassigned I’m going to ask the inspector general look into it https://t.co/OPo9QznbaG"]["Proud to support #LWCF grants to help underserved communities have access to local #outdoorrecreation opportunities https://t.co/fGX6PjnWdq"]["Your zip code should not determine your access to #healthcare &amp; neither should the @SenateGOP #healthcare bill https://t.co/2zOjgzW1Hy"]["Agree @mpdailynews &amp; add that this Administration is wasting taxpayer $$$ on an unlawful attack on #AntiquitiesAct https://t.co/ACA7UERBXc"]["This Administration has already gone too far. An attack on one of our #NationalMonuments is an attack on all of them https://t.co/ACA7UERBXc https://t.co/MkHysFGmmm"]["We need to talk about the challenges we face now in #healthcare &amp; move forward – not go backward &amp; cut millions of Americans off #Medicaid"]["@BetsyDeVosED claims to support #civilrights &amp; oppose #discrimination, but her actions discredit her assurances. https://t.co/MCP7Ae7vqB"]["@BetsyDeVosED appointed staff who fought #TitleIX guidance saying schools are responsible for addressing campus sexual assault &amp; protections"]["Extraordinarily disappointed &amp; alarmed by the actions of @BetsyDeVosED to diminish enforcement of #civilrights laws https://t.co/FMCTH6MjDO"]["Progress for women &amp; girls in #STEM! We must continue investing in #CSforAll to grow &amp; diversify our #tech industry https://t.co/x2Tfzo1qhN"]["We've seen it before. Republicans trying to turn over this iconic national #WildlifeRefuge to the oil &amp; gas industry https://t.co/lga5gbTlDo"]["We need to protect the #Arctic National #WildlifeRefuge, not raid it for oil. https://t.co/lga5gbBKLQ"]["Democrats &amp; Republicans both want to find cost savings for people – so let’s take politics out of it &amp; work together to improve #healthcare"]["Our thoughts are with my colleague from Arizona @SenJohnMcCain and his family, wishing him a swift return and full recovery."]["@SenateGOP must work with us to increase ways for states to develop #healthcare plans that reduce costs &amp; cover more https://t.co/mpa8EQGipW"]["Disappointed, but not surprised @HouseGOP budget includes a proposal to drill in the Arctic National #WildlifeRefuge https://t.co/lga5gbBKLQ"]["Meaner yet. https://t.co/KIO4GvfNPw"]["There are things that are working in the #ACA: the expansion of Medicaid has driven down price &amp; given #healthcare access to more Americans"]["Let's talk about what's working &amp; let's discuss what’s not with #healthcare – but we cannot cut millions of Americans off #Medicaid"]["The notion by Republicans that you can repeal the #ACA &amp; achieve \"#BetterCare\" by cutting millions of Americans off #Medicaid, is dead wrong https://t.co/Xzia1zyfcl"]["@AjitPaiFCC @JRosenworcel @BrendanCarrFCC TUNE IN: I'm questioning @FFC's @AjitPaiFCC @JRosenworcel @BrendanCarrFCC on America's need for #NetNeutrality protections for #OpenInternet"]["We must continue to protect America’s treasured #publiclands especially for our veterans who enjoy coming home &amp; being in the #greatoutdoors"]["NOW: Commerce Nom Hearing &amp; SOON to ask @AjitPaiFCC @JRosenworcel @BrendanCarrFCC about #NetNeutrality &amp; more WATCH: https://t.co/O55732xjOf"]["We have to keep fighting because we are not going to kick people off their #healthcare in an attempt to cut costs – it won’t work."]["TUNE IN NOW: I'm talking @SenateGOP #Healthcare bill failure w/ @HardballChris on @MSNBC &amp; why we need to improve NOT repeal the #ACA"]["If #TeddyRoosevelt was here today he would be fighting back to protect our #NationalMonuments https://t.co/ChotB2U08F"]["Our treasured #PublicLands &amp; #NationalMonuments are special to us as a nation – today – and will continue to be so for generations to come"]["Attempts by the Trump Administration &amp; @SecretaryZinke to try &amp; use the #AntiquitiesAct in reverse are unlawful &amp; wrongheaded https://t.co/KzQU5WmTDa"]["Passing the #LIHTC is critical to addressing our #HousingCrisis. Thank you @HousingACTION for your strong #AffordableHousing advocacy https://t.co/X2X88EgznE"]["TUNE IN NOW: To @ChrisJansing on @MSNBC, SOON I'm talking #healthcare strategy moving forward on a busy day in the #Senate"]["Let’s make sure people are covered, we're making improvements in #healthcare delivery &amp; keeping on a trajectory of ensuring we lower costs"]["In the #ACA under the Basic Health Plan we gave individuals as much clout in the market as large companies. This is a real solution."]["Stop the War on #Medicaid. Stop the #ACA repeal. Let’s work across the aisle to focus on driving down #healthcare costs for Americans https://t.co/UlOJ8veMLO"]