["#POTUS tweets: take care of “our Country, FIRST!” #DREAMers already are vibrant contributors to America. Their story is the American story. Taking care of them IS taking care of our country. POTUS compounds his heartless decision to end #DACA by now holding DREAMers hostage."]["The President absurdly claims that Democrats are responsible for a “big step backwards” on #DACA, when it is he who cynically and abruptly decided to end it. Enough with the grade-school fingerpointing, Mr. President. Do your job and protect #DREAMers."]["NEWS From Senator Leahy &amp; @GovPhilScott – Senator Leahy And Governor Scott Make Joint Recommendation For Vermont’s Next U.S. Marshal: https://t.co/sJsiRrHbjA"]["Breathtakingly offensive. Worse, it’s ignorant of American ideals, and of the strength we derive from E Pluribus Unum. This is not who we are. https://t.co/wHc4OwnDwu"]["The oozing spread of Trumpism's #AntiScience know-nothingism. \n#ScienceMarch https://t.co/gOjisOte01"]["I'm the lead Democratic author/sponsor of the leading FISA 702 REFORM bill, to protect Americans' privacy. Americans need &amp; deserve BOTH security AND privacy protection. More info on our Lee-Leahy reforms HERE:\n\nhttps://t.co/u1M1rjecAn\n\nhttps://t.co/jez7Dy6NBB https://t.co/yfPXy5Rd4k"]["“Unfortunately, the House #FISA 702 bill falls short…” Read my statement with @SenMikeLee on why we need to pass our USA Liberty Act to reform Section 702 HERE: https://t.co/u1M1rjecAn"]["POTUS has a fake news problem again when he talks about his budget and policies. The #BudgetTruthSquad is here to #RealityCheck these abundant Trump misstatements. FACT: The Trump budget would be disastrous for #RuralAmerica. https://t.co/VrtNDRv9BW"]["This is unacceptable—laws should protect the right to vote, not strip it away: “I started crying…. To come home after defending that fundamental right [to vote] and to be told that I couldn’t exercise it, that was heartbreaking.”\nhttps://t.co/b2jh4pJTpa"]["In 2016, more people were killed by #landmines than in any year since 1999. Ridding the Earth of these abhorrent weapons will take ongoing advocacy, and political will. Read my statement HERE: https://t.co/aUdwrC0dEp @BanMinesUSA"]["Senate Appropriations Committee Vice Chair Patrick Leahy, In Senate Floor Address, As Deadline Nears For Completion Of Budget Negotiations https://t.co/nB6vDyLMOW https://t.co/unjVZ9Mu2b"]["Looks like someone has a fake news problem. https://t.co/jlIpeF2EtC"]["Leahy And Sanders Help Net Neutrality Resolution Reach 40-Vote Milestone In The Senate https://t.co/eLZAd1Iczu https://t.co/x9H18aKiND"]["Welcome Kamala! You and Cory are strong additions to our ranks. Looking forward to the opportunity of working even more closely with you on a wide range of pressing issues of vital importance to the nation... https://t.co/IsGzrMo6Fn"]["Two marvelous additions to the Judiciary Committee. Cory, looking forward to continuing to work with you on justice system reform and on so many other high priority issues. https://t.co/POHPFJe2cS"]["I completely agree with @SenFeinstein. Our Judiciary Committee investigation should inform the American people of the truth. Transcripts should be presumptively PUBLIC, and not selectively exploited to amplify White House distractions. \nhttps://t.co/R5eSPESdan"]["#NetNeutrality is vital to make sure that powerful and deep-pocketed companies don’t squash smaller firms by deciding who gets heard &amp; who gets blocked from the internet. Freedom &amp; openness are the twin pillars of the internet, &amp; I’m working hard to restore these principles."]["Great photo John. Here’s my take on Instagram on this morning’s fog, in an image I captured from the Capitol. Seems to speak to what’s happening and not happening right now in Washington… https://t.co/Xco9RTtNI7 https://t.co/SFccv1x3cQ"]["In the #Trump budget, #RuralAmerica is #Forgottonia, and #farmers are an afterthought. The facts, threaded here from the #BudgetTruthSquad: https://t.co/Lp09cHWZo1"]["In the 100 days since CHIP expired, Republicans were able to jam through a hugely unpopular tax giveaway to giant corporations and the 1%. When will they start caring anywhere NEAR that much about America's children? https://t.co/Lx2Gm51GEI"]["Sending TPS recipients, and potentially their children, back to countries devastated by natural disasters and endemic violence betrays our vital role as a refuge for the persecuted and vulnerable. It is clear that this President doesn’t understand that – or simply doesn’t care."]["Now 200,000 of our neighbors and community members must decide whether to abandon their American citizen children or bring them back to an impoverished country overrun by gang violence. That is unconscionable."]["Yet again, Trump shows complete disregard for the lives of vulnerable immigrants who came to the U.S. lawfully. Forcing 200k law-abiding Salvadorans to return to one of the world’s most violent countries isn’t coherent policy. It’s callous xenophobia.  https://t.co/TiYmNegkDU"]["I sure am...and was one of the first, weeks ago, to join this latest effort to save #NetNeutrality. https://t.co/PgJaxjlIdi"]["And that’s only discretionary budget cuts. He also proposes cutting $46 billion in mandatory spending for USDA, limiting crop insurance, conservation programs and rolling back electric &amp; telecom expansion. The plain truth about the Trump budget is that it hurts #RuralAmerica."]["The Trump budget would ELIMINATE:\n- Rural Single Family Housing Direct Loans\n-Water and Waste Program\n-Rural Business Service\n-Distance Learning and Telemedicine (DLT) Grant Program"]["Budgets are where we set priorities, &amp; in the Trump budget, #RuralAmerica is #FORGOTTONIA. The Trump budget would ELIMINATE more than 40 programs benefiting small, rural communities. And it would SLASH rural development by $912 million (30 percent)."]["As President Trump brags that he’s “REBUILDING RURAL AMERICA,” here’s a reality check from the #BudgetTruthSquad: Donald Trump is a DISASTER for #RuralAmerica."]["So how about setting up an escrow account for Mexico to fund, before proceeding with this enormous boondoggle, instead of asking American taxpayers -- and not Mexico, as candidate Trump promised -- to pay for this cynical, costly and misbegotten campaign slogan. https://t.co/swKkT2leet"]["Given all that we’ve learned through the course of the investigations, it's telling that THIS is what Republicans are now choosing to pursue.  -Patrick https://t.co/DSE19qOIGX"]["Yes...signed onto this effort long ago... https://t.co/Y2Ex8UwHGG"]["(4/4) I'm now fighting to include my amdt in the final omnibus Approps bill so we can protect patients and law-abiding businesses. With an AG determined to waste finite DOJ resources to prosecute even those who are compliant with state law, this amdt is more important than ever"]["(3/4) We need to protect the patients and dispensaries in the 46 states with medical marijuana and CBD laws. As Vice Chair of Appropriations, I offered an amdt in Committee to do just that – and it was approved with a bipartisan voice vote."]["(2/4) Make no mistake, the Cole memo NEVER PREVENTED the gov from going after bad actors, like those who traffic marijuana to minors or across state lines. ONLY reason to rescind the memo is because the AG wants to target patients &amp; businesses that are COMPLIANT with state laws."]["In 2013, as chairman of the Senate Judiciary Committee, I held a hearing on the conflict betw. federal laws and evolving state laws on marijuana. That hg. prompted DOJ to release the Cole memo. Rescinding that memo is a terrible, facts-backwards decision by Atty Gen Sessions."]["A good assumption. Maybe even clean fusion... https://t.co/hwMm3toaz2"]["Can’t speak for the other superheroes, but #Batman certainly deserves more credit than this allows…for instance for saving countless lives and Gotham itself. And all with his wits, not with superpowers… https://t.co/1yiGCb7Wo6"]["No, she has not left my staff...Senator Jones and I will share Ann's skills and experience as she helps him stand up his staff and office...a complicated process that Ann knows like few others do on Capitol Hill. She's the best. https://t.co/gLbIWzW79S"]["Picking up where he left off in 2017, he's pushing conspiracy theories &amp; attacking the independence of law enforcement. Enough w the banana republic-like tactics &amp; daily assaults on our institutions. As Americans we must not normalize this dangerous behavior; it must be rejected https://t.co/jP2A1XONe7"]["And to you Kate. And a Merry Christmas and Joyful Holidays as well to all Vermonters. We're so proud of you all and of our Brave Little State.  -Patrick and Marcelle https://t.co/YEFjwfCz45"]["Sexual harassment, and harassment of any kind, cannot be tolerated.  We need to acknowledge this problem, wherever it persists, and bring it out of the shadows and into the light of public scrutiny.  This is a good first step for the Senate.  https://t.co/f79HnPWLNu"]["Sens. Paul, Wyden, Lee, and Leahy Release Joint Statement on FISA Reform https://t.co/6lofjuAs3M https://t.co/lEvQOLJeXp"]["Statement Of Senator Patrick Leahy (D-Vt.) On The Need To Pass The DREAM Act \n\nhttps://t.co/M4qPt0LsML"]["REAX of Appropriations Committee Vice Chair Patrick Leahy (D-VT) To The President’s Threat To Cut Support To The #UN And To Countries That Oppose His U.S. Embassy/#Jerusalem Decision \n\nhttps://t.co/OolYxGZXEZ"]["Congrats to all the communities receiving these important #CDBG funds. I am fighting hard to keep the program funded so it can keep working for #Vermont and the Nation. https://t.co/B7BdjkeONi"]["Congressional Record Statement of Senator Patrick Leahy In Support Of Democracy In Honduras\nhttps://t.co/TxZuKDuniW"]["Take just a moment to watch this: \n\n@SenSherrodBrown unmasks the cynical, swampy process used to write the #GOPTaxScam #travesty.  \n\nA bill OF the wealthy #elite, BY the wealthy #elite, and FOR the wealthy #elite. https://t.co/KTyvmM1bcs"]["MUST-SEE TV:\n\n@SenSherrodBrown unmasks the cynical, swampy process used to write the #GOPTaxScam #travesty.  \n\nA bill OF the wealthy #elite, BY the wealthy #elite, and FOR the wealthy #elite. https://t.co/KTyvmM1bcs"]["Oh you bet I will vote no. See my statement tonight on Twitter or on my website.  -Patrick https://t.co/SQglbQjyF4"]["This was a terrible tragedy, and Marcelle and I have held the victims in our thoughts.  We can and must do more to prevent this from ever happening again. #Amtrak"]["Mr. President, we are now almost a year into your administration, and you have done nothing to improve America’s infrastructure. Democrats presented a $1 trillion plan just days into your administration, but you were focused on dividing – not building -- this nation."]["Mr. President, your FY’18 budget proposed CUTTING infrastructure funding by 13% below FY ’17. That includes slashing $735 million in federal resources for #Amtrak. It’s time to seriously address our nation’s infrastructure, and not just pay lip service to it. https://t.co/d85HaXxkn3"]["Dems &amp; Repubs agree we must fully fund &amp; support our military. But the consequences of sequestration reach beyond the Pentagon to priorities like infrastructure, job training, education, public safety &amp;vets. We need to raise spending caps for both defense AND non-defense. #parity https://t.co/YV05JC59Wp"]["The Petersen nomination to the DC District Court has been withdrawn. There are MANY other unqualified or extreme judicial nominees from this president who also should never have been nominated… but this is a positive step. https://t.co/AhCObZo8Uz"]["Reaction of Senator Patrick Leahy To The TSE's Declaration Of Juan Orlando Hernandez As The Winner In The Honduran Election https://t.co/OVUO3iMBL9 https://t.co/DAg694iFOQ"]["The continuing, harmful, oozing spread of Trumpism's #AntiScience know-nothingism. https://t.co/Qdld7GP5p1"]["Mr. President, enough with Amateur Hour. There must be potential conservative nominees for these lifetime judicial appointments who can answer basic law school questions. You need to withdraw Petersen’s nomination. #CourtsMatter https://t.co/eyvGHPPe2F"]["Talley and Mateer have withdrawn their nominations to be federal judges—that’s a start. The fact that they were even nominated, and that Talley was favorably reported out of the Judiciary Committee on a party-line vote, is shameful. https://t.co/HsswlvGGTf"]["Shaun, this is simply incorrect. You neglected to mention my Deputy Chief of Staff. https://t.co/UJ7xEylbJv"]["Incorrect...my Deputy Chief of Staff. https://t.co/PGmgLRSIeD"]["Today is the LAST DAY to sign up for health insurance through Vermont Health Connect. Last chance to get health insurance for yourself and your family.\n\nhttps://t.co/RmzNxmKZdo\n1-855-899-9600\n\nGet covered today!"]["I'm an original cosponsor of this in the Senate. So is Bernie, and Peter supports the counterpart measure in the House. My Judiciary Committee hearing in #VT on #NetNeutrality several years ago showed how strongly, even then, Vermonters feel about protecting the Internet. https://t.co/55iZ9wCyCO"]["Leahy: USDA Economic Development Investments In Windham County This Year Now Top $3.1 Million https://t.co/pLDAuDdum7 https://t.co/x4dV383FVc"]["Leahy-Authored Farm Bill Provision Nets Millions For Northeast Kingdom @VTsNEK https://t.co/7BsZG7Qf0h https://t.co/Ihf8h2CDYz"]["Leahy: USDA Economic Development Investments In Vermont This Year Now Top $222 Million https://t.co/c2DVlgn4QD https://t.co/40OVyCH9I7"]["Yep...Bernie and I are cosponsors: \n\nhttps://t.co/q3VOFDkhGr https://t.co/jPdzlEuGMd"]["A crass and wretched decision, a harmful decision. Bernie and I will continue to do all we can to restore #NetNeutrality.  See this: \n\nhttps://t.co/q3VOFDkhGr https://t.co/yvdzjgUV74"]["Well @pkcapitol seems to be enjoying it anyway... https://t.co/ZRbgm3deku"]["Senator Patrick Leahy: ‘Through a rushed, cynical and slipshod process, the #FCC has taken a wrecking ball to the pillars of freedom and openness upon which the Internet was built. We will keep fighting for #NetNeutrality. ’ \n\nhttps://t.co/GihxCtr3U6"]["We do support a CRA reversal of today's #FCC action to repeal the #NetNeutrality rule. We're cosponsors: \n\nhttps://t.co/q3VOFDkhGr https://t.co/8oOscTVlab"]["Today we’re all reminded of the unspeakable horror in Newtown 5 years ago, &amp; the shameful, collective shrug that followed from those lawmakers who ignored the pleas of Newtown parents &amp; blocked commonsense gun safety reforms I had ushered to the Senate Floor. We must do better."]["BREAKING: Leahy, @SenSanders Join Markey On Resolution To Restore FCC’s Net Neutrality Rules https://t.co/q3VOFDkhGr https://t.co/fhOloJhmLr"]["BREAKING: Reaction Of Senator Patrick Leahy To The FCC’s Vote To Repeal Net Neutrality Protections https://t.co/GihxCtr3U6 https://t.co/6CLuukrEml"]["Leahy: Vermont Is A Crucial Step Closer To Improved Air And Rail Travel With Canada https://t.co/JNGHMc8Q9M https://t.co/Rx0HTadxYf"]["This #GOPTaxScam bill is an appalling mishmash of massive giveaways to corporations and the wealthy, all to set the stage for slashing cuts to programs like #Medicare, #SocialSecurity, #SNAP and #Medicaid. Americans are clear on this: Slow down this rushed, hyper-partisan process"]["We still have very little idea what’s in the #GOPTaxScam bill, but the American people have made it clear: Slow down this process and work on real, bipartisan tax reform."]["Happy Birthday to @USNationalGuard. Your work this last year to defend our nation and to serve our states and territories when disaster strikes has been world class. Just as we’ve always expected from the Green Mountain Boys. https://t.co/0FvH8KThdM"]["Floor Statement Of Senator Patrick Leahy On Repeal Of Net Neutrality Rules https://t.co/FzoGnymyH2 https://t.co/3ohoV5Rgkn"]["As the #NetNeutrality showdown looms at the #FCC tomorrow, I'll join Sen. Markey and other Senate supporters of net neutrality in speaking out again about this, \n\n** TODAY **\n\non the Senate Floor. I'll be speaking at about 12:50 or so. Watch LIVE on CSPAN2."]["NEW: Guest Column From Senate Appropriations Vice Chairman Patrick Leahy (D-Vt.): 'Why Budget Parity Matters: The Need For Investing Equally In Our Military And Our Communities.' (available for immediate use) https://t.co/QgIkjZcb2U"]["It’s irresponsible for @AjitPaiFCC to go forward with his #NetNeutrality vote on Dec. 14. Millions of Americans feel – and feel strongly – that his plan would hurt ordinary Americans, smaller firms, and the Internet as we know it."]["Like many of this administration’s decisions, the push to repeal #NetNeutrality has been a rushed, cynical &amp; slipshod process. @AjitPaiFCC should abandon his plan to kill the internet as we know it on Thurs., Dec. 14."]["A gorgeous shot, Chuck https://t.co/BkIhSibrO3"][".@LundVT has been recognized for their work providing services to keep families healthy, not just help pick up the pieces once families are destroyed. We need to allocate every necessary resource to confront the #opioid public health crisis."]["Proud to announce $3m for @LundVT for the Vermont Recovery Project, which will work to help at-risk VTers and confront the #OpioidCrisis. These investments in Americans cannot and should not be deferred to build a misguided wall. https://t.co/OV2Pml2HNX"]["I agree with internet pioneers like Sir Tim Berners-Lee and Vint Cerf, who are calling for the #NetNeutrality vote to be CANCELLED. Killing net neutrality would be bad for the internet, bad for smaller firms, and very bad for ordinary Americans. https://t.co/QZ1MQVX7WJ"]["Marcelle and I are glad to be back at home for one of our favorite holiday traditions @BTVPomerleau holiday party. Merry Christmas and Happy Holidays from #VT! https://t.co/3flkj7ZJur"]["#Vermont, leading again. Read about Champlain College and closed-loop recycling: \n https://t.co/1xvB4cbtFj"]["Sen Patrick Leahy,Vice Chair, Appropriations Committee:  “Whether the Honduran election is widely accepted as free and fair–in #Honduras and internationally–will determine its future, and the future of US aid to the Honduran government, a decision that will be made by Congress.”"]["Here's our latest today, in this fight: \n\nhttps://t.co/CYra4pAeFT #NetNeutrality https://t.co/gWaCSpjTNQ"]["As Repeal Showdown Vote Looms For #NetNeutrality Rules, Senator Blumenthal, Senator Leahy &amp; Other Senators Use @FCC Chair's Own Words To Urge Him To Delay Thursday's Vote, Until Full Impact Can Be Considered -- \n\nhttps://t.co/CYra4pAeFT #VT"]["Hi Peter...chances are, we'll see each other there...  \n\n#Batman https://t.co/T6Cs7ewtM2"]["Well reported, well worth reading... https://t.co/4DVUPXeQXP"]["Thank you @VTDigger for the forum on funding Lake cleanup. Julie, Kris and David are champions, I’m working hard to keep federal dollars from @USDA and @EPA as strong as ever. You can see some of the Lake Champlain wins in the Approps bill here: https://t.co/lMloQ58B9F"]["Senate Appropriations Committee Vice Chairman Patrick Leahy (D-Vt.) Statement On A Continuing Resolution Through December 22, 2017 https://t.co/sYWwNBk77W https://t.co/tMVObCg2pv"]["Pleased to have staff participate in today’s @VTDigger event on Lake Champlain cleanup. I’ve secured record funds for Lake cleanup &amp; I’m working to increase those investments. With state agencies, we will make sure that our children &amp; grandchildren have a Lake they can cherish."]["We're continuing the fight to stop this. https://t.co/FpdiakW3nR"]["Get health insurance for your family for the holidays before open enrollment closes Dec. 15. https://t.co/RmzNxmKZdo or 1-855-899-9600. WATCH my video below. https://t.co/DnvZkrTZsM"]["My staff visited the @sterncentervt today to learn about their leadership in education and literacy. Thanks to all #educators who are helping every student meet their goals."]["I loved chatting with students at @MorrisvilleVT Peoples Academy today.  Their dedication to human rights &amp; efforts to raise awareness about global issues is an inspiration.  \n\nhttps://t.co/gvZLuiRWv4 https://t.co/wl1PZi5WFa"]["We need to pass the #DREAMAct -- not just to defend these young people but the American Dream itself. Let’s prove that we can rise above xenophobic fear-mongering and unite behind our nation’s most cherished ideals.  #iMarch #DreamAct"]["These young people have so much to offer America…in most cases, the only country they’ve ever known. The 2013 immigration bill I shepherded through the Senate would have offered a number of protections for DREAMers. #iMarch #DreamAct https://t.co/RoH3ksucEN"]["The Trump Administration has shown its anti-immigrant bias again and again. Ending this program was a cruel mistake, and now it’s up to Congress to protect these impressive young people, for their sake, and our country’s. #iMarch #DreamAct"]["DREAMers are law-abiding strivers, brought here as children through no fault of their own. In our country, if you work hard and play by the rules, you should be able to achieve your dreams. That’s the American Dream.  #iMarch #DreamAct"]["‘How To Reduce Medical Drug Prices At A Stroke’--pass my bipartisan CREATES Act. Read Scott Knoer’s article in @Newsweek about how my bill would accomplish just that. https://t.co/vxrXmDbMDI"][".@realDonaldTrump, your party controls both chambers of Congress and the White House.  If there is a shutdown, it is because YOU, Mr. President, want one.  Enough of this rhetoric to set up your false narrative. Let's work together."]["Mr. President, Democrats do NOT want to shut down the government.  I have been calling for a bipartisan budget deal since March."]["Comment Of Senator Patrick Leahy On Senator Al Franken -- \n\nhttps://t.co/zWhV7CMxsT https://t.co/YrKpDVOk5e"]["Comment Of Senator Patrick Leahy On Senator Al Franken -- \n\nhttps://t.co/zWhV7CMxsT"]["MORNING READ: 'Holy crap' -- Politico: ‘Experts find tax plan riddled with glitches’ --  https://t.co/xWPtrGdFvP  #GOPTaxScam"]["BREAKING: REAX Of Senator Patrick Leahy To President Trump’s Decision On The U.S. Embassy In #Israel:  \nhttps://t.co/7X9PEu1Uwn  #Jerusalem"]["Hello Rob. Here's my Congressional Record statement today on this. Follow me on Twitter (and my website and my Vermont Judiciary Committee hearings on this) and you can keep up with my other actions on net neutrality.  https://t.co/6bD0OnSI89 https://t.co/NlshGlOzwK"]["Senate Appropriations Committee Vice Chairman Patrick Leahy’s (D-Vt.) Congressional Record Statement Tuesday Night On The Election Crisis In #Honduras --  https://t.co/ccVjLknVPG"]["Even Wall Street is concluding that the #GOPTaxScam would have only MINIMAL overall economic benefit, AT BEST.\n\nhttps://t.co/rys33XCPKA"]["Appropriations Vice Chair Patrick Leahy, At Today's #Opioid Hearing:  ‘We cannot be seriously addressing this crisis while (President Trump and Congress) simultaneously are kicking the legs out from under the recovery effort’ –\n\nhttps://t.co/9150ZhZI5W"]["BREAKING: Senator Patrick Leahy On The Election Crisis In #Honduras --  https://t.co/ccVjLknVPG"]["The oozing spread of Trumpism's #antiscience, anti-public #know-nothingism. Diminishing our national treasures and Americans' national heritage, step by step by step. https://t.co/dJ6VtmU6jw"]["No one but Senator Durbin has been working harder to get an agreement on Dreamers and DACA...and we'll continue to press for this, whatever the odds. Thanks so much for your interest and support for our efforts. \n\n -Patrick https://t.co/gVaEdtUCCl"]["So @SenateGOP, now that you've taken care of your donors, can we pass legislation for the rest of America? When can we expect the midnight vote to reauthorize CHIP for the nation's children, for starters?"]["Good for you.  Thank you. https://t.co/cGwW0PbRBD"]["It's almost here!\n\nNothing, anywhere, is quite like\n\n🎶Moonlight In Vermont🎶 https://t.co/M0WHw4P8Ku"]["36.7m people are living with #HIV around the world. This #WorldAIDSDay I pledge to continue fighting to protect funding for PEPFAR ($4.32b) &amp; the Global Fund to Fight AIDS ($1.35b). Lifesaving funding, but we can do more. We can stop the spread of this terrible disease."]["Want a breakdown of the lies and inconsistencies that brought us to voting on this #GOPTaxScam abomination? ‘In pursuit of a tax bill, Trump’s GOP keeps violating more governing norms’ https://t.co/t95Vk7Xndv"]["$25 BILLION in cuts to #Medicare EVERY YEAR. That’s what Americans get in return for the #GOPTaxScam cutting taxes for the Republican donor class, despoiling the environment, and destabilizing insurance markets. #ANWR https://t.co/d2aop8w4ab"]["#GOPTaxScam will fulfill one major GOP goal: The $1.5 TRILLION hole this will blow in the deficit will be used to justify Republican cuts to Medicare, Medicaid &amp; Social Security. This bill must be stopped."]["According to the CBO, EVERY promise Trump &amp; the GOP made about #GOPTaxScam bill has been BROKEN:\n\n‘Boost the economy’: ❌\n\n‘Help middle class Americans’: ❌\n\n‘Won’t explode debt/deficit’: ❌\n\n‘Won’t benefit @POTUS and 1%’: ❌"]["Big oil companies, in ADDITION to receiving massive tax cuts, will also get a free pass to despoil the Arctic National Wildlife Refuge #ANWR, turning one of the most beautiful areas of America into a wasteland and deepening our addiction to oil. #GOPTaxScam"]["Worth watching, to help understand the #GOPTaxScam's predicament tonite.... https://t.co/JOlzYIOflx"]["I don't think that term means what she thinks it means... https://t.co/5ZBqbrMS5Q"]["The ravages of the #GOPTaxScam bill are not confined to taxes. It will also strip health insurance from 13m Americans, which threatens to destabilize the health insurance market for everyone."]["#GOPTaxScam is a giant holiday gift for corporate CEOs, paid for on the backs of working Americans and the health of our economy. It will cheat our future for the sake of a tax-cut windfall for the Republican donor class."]["A mistake for SecDef to go back on commitment to replace these indiscriminate weapons. 1000's of civilians maimed &amp; killed each year by #UXO.  No nation, incl us, should be seeding fields w miniature bombs that linger for generations to kill innocents. https://t.co/9CkYf2V6sk"]["President Trump donating part of his salary to combat the opioid epidemic is a nice gesture. A better gesture would be to not propose cutting funding for the opioid epidemic by $104 Million as per his FY ’18 budget proposal."]["Nothing, anywhere, is quite like 🎶Moonlight in Vermont🎶 https://t.co/M0WHw4P8Ku"]["Rarely if ever have I seen such a secretive and slapdash process, and such a shoddy result.  Republican leaders purposely chose a partisan process, not a bipartisan process, for their #GOPTaxScam bill. \n\nhttps://t.co/3QnQ2DUapO"]["Critical deductions relied upon by many Vermonters, including the State and Local Tax Deduction, are reduced or eliminated in the #GOPTaxScam. https://t.co/3QnQ2DUapO https://t.co/gxTZtkwn4O"]["Blowing a huge hole in the budget will seed the ground for rising interest rates that will hit every family and drag down our economy -- and Republican cuts to Social Security, Medicare and Medicaid will follow. #GOPTaxScam   https://t.co/3QnQ2DUapO"]["#GOPTaxScam is not tax reform.  It's a cartoonish caricature of what real tax reform should look like. It is dishonest to its core. It is cynical, and it can only breed more cynicism. It is not only bad policy, it is horrible policy. And it is wrong. https://t.co/3QnQ2DUapO"]["#GOPTaxScam cheats our future for the sake of a tax-cut windfall for the one percent. It does absolutely wonderful things for the wealthiest taxpayers, like the President, his cronies and his family. But it does not advance the common good. https://t.co/3QnQ2DUapO"]["A disgraceful new low, even for this #POTUS. When a president retweets inflammatory, unverified videos from anti-Muslim bigots, he amplifies &amp; validates their hateful propaganda. Will he ever stop trafficking in fact-free fear mongering? Too much to ask?\n\nhttps://t.co/6dU1X1pIjU"]["BREAKING: Leahy Announces $1.3 Million Grant To Help The Vermont State Police Combat The Opioid Epidemic\n\nhttps://t.co/taSxwiKaZf https://t.co/CrnF5YzYJF"]["STILL one of the hottest tickets in town. And like all #Smithsonian museums, free to the public, too... https://t.co/nR3l8sSlSv"]["When powerful institutions try to cheat and swindle Americans out of their hard-earned money, @CFPB goes to the mat for ordinary people.  CFPB defends you, and the marketplace. #DefendCFPB"]["America is still recovering after Wall St greed wreaked havoc on our communities. Since @CFPB began, it has helped 29 million Americans.  We need to #ProtectConsumers. #DefendCFPB"]["This #CyberMonday I continue to support local businesses by supporting #NetNeutrality. @AjitPaiFCC’s plan would allow fast lanes for the internet, letting big national chains drown out local #VT businesses that rely on online sales."]["Today I’m giving thanks to the American farmers who grew the food on Americans’ tables. Are you having a delicious Thanksgiving meal today?  #ThankAFarmer https://t.co/bxSZQdIHnj"]["Just posted: My Guest Contributor #NYT piece on the innocent civilian victims of war:  \n\nhttps://t.co/Ob6sEbgabt #MarlaFund"]["Amen.  Well worth reading, at Thanksgiving time, or any time. https://t.co/SgO6Yww9fd"]["Appropriations Committee Vice Chairman Leahy Calls On Congress For Bipartisan Budget Deal https://t.co/PDnlvBPON4 https://t.co/tkaSyJx8P8"]["Durbin, Leahy Statement on FY18 Defense Appropriations Chairman's Mark https://t.co/6zTdDt3ryX https://t.co/h3ec0wFl0H"]["Border protection? Yes. A costly, ineffective, delusional wall? No. We should be investing in what brings us together, not what drives us apart. The wall has no place in this DHS appropriations bill. https://t.co/hOLEDjaff8"]["The wall is bumper sticker budgeting at its worst. We should be investing in the American people, not in this wasteful, ineffective &amp; xenophobic campaign slogan."]["Leahy Slams Border Wall Funding As “Bumper Sticker Budgeting” https://t.co/hOLEDjaff8 https://t.co/T3rPBxPPDQ"]["Appropriations Vice Chair Leahy’s SUMMARY of/REAX To Chairman’s Mark For The FY2018 Homeland Security Appropriations Bill https://t.co/3smEo43jWH https://t.co/q0nDIFlemM"]["Leahy Statement On Fed. Judge’s Injunction Blocking Trump Executive Order On “Sanctuary Jurisdictions” Incl. Vermont https://t.co/GMx1DFB9F4 https://t.co/BZ9bkPACld"]["Reaction of Senator Patrick Leahy (D-Vt.) To #Apple’s Response To The Letter From Senator Cruz And Senator Leahy (INCLUDES LINK to letter from Apple) -- https://t.co/KZ06LEcJlu  #China"]["This Thanksgiving @AjitPaiFCC is for repealing #NetNeutrality, letting corporations make big $$ while everyone else has to wait in line. Consider it Black Friday for ISPs and big corporations."]["International environmental agreements and action make a difference. The success of the Ozone Treaty is an example, and we each benefit from it, right now. The same with joint, concerted action to clean our air and water (and save our planet). https://t.co/9LR6E9bmj4"]["Appropriations Vice Chair Leahy Notches Key Victories For Lake Champlain In Interior Appropriations Bill @Lake_Champlain https://t.co/lMloQ5qcyf https://t.co/R6aBuHe6EP"]["BREAKING: Leahy Notches Key Victories For Lake Champlain And Vermont In Appropriations Bill https://t.co/lMloQ5qcyf https://t.co/03MSRYPDHw"]["Appropriations Vice Chair Leahy’s Summary Of Chairman’s Mark Of FY2018 Financial Services &amp; Gen’l. Govt. Appropriations Bill https://t.co/sXxwdTvcXv https://t.co/pFzWAyEMX0"]["Appropriations Vice Chair Leahy’s Summary Of Chairman’s Mark Of The FY2018 Interior, Environment Appropriations Bill https://t.co/G2nx9biEaY https://t.co/469RVFIHrE"]["Leahy: Federal Grants Totaling Nearly $600,000 To Help 5 VT Communities Hire New Officers (COPS Grants) – https://t.co/gunR0thikH https://t.co/npQYLYIv3U"]["This analysis, from the highly respected, nonpartisan Joint Committee on Taxation.  Incredible that WH &amp; GOP are still trying to sell this as a big present to middle class families. These numbers tell a different story, the real story. https://t.co/8K4rGl1MSg"]["@SenMikeLee and Leahy Intro The USA Liberty Act, With Key Privacy Improvements For FISA Section 702 https://t.co/jez7Dy6NBB https://t.co/ZEVIOvvgvs"]["Appropriations Vice Chairman Leahy's REAX To Trump Adm.'s 3rd Emergency Supplemental Request https://t.co/HDW6UgS8x5 https://t.co/BqE2Dlki0u"]["No one should suffer retaliation for blowing the whistle on criminal activity. My bipartisan bill w @ChuckGrassley to protect whistleblowers unanimously passed the Senate on Wed.  The House should act ASAP to pass this commonsense, bipartisan legislation.\nhttps://t.co/ROinHOhWkh"]["Senate Unanimously Passes Grassley-Leahy Bill to Protect Whistleblowers in Criminal Antitrust Cases https://t.co/ROinHOhWkh https://t.co/DkSUT33YLf"]["Reaction Of Appropriations Vice Chair Patrick Leahy (D-Vt.) To The House-Passed Tax Bill https://t.co/ABmHf6cXQT https://t.co/A24zKwTekp"]["What a treat to be enlisted as a presenter of the Gershwin Prize to Tony Bennett...last night at Constitution Hall. Now, and always, Tony Bennett is a National Treasure. https://t.co/lJRxFVSFcd"]["Mr. President, withdraw this nomination NOW. He is objectively unqualified, dishonest, doesn’t understand the history upon which hard-fought civil rights were earned. He is undeserving of a lifetime appointment to the federal bench. ENOUGH.  #BrettTalley https://t.co/I1JtECDOUK"]["Will we rise up and push back against Trumpism's #AntiScience Know-Nothingism? I'll continue to be there... https://t.co/oS4LfeSWMT"]["I KNOW I shouldn't have retweeted this.  A moment of weakness... https://t.co/xjRpsc3V93"]["BREAKING: Leahy Slams Atty Gen. Sessions For Threatening Public Safety $ To Burlington &amp; Vermont, Over Trump Adm.'s Misguided Anti-Immigrant Policies https://t.co/6J12e04zoo https://t.co/NVw0pKEXYt"]["Appropriations Vice Chairman Leahy Statement At Hearing On VA Efforts To Prevent And Combat Opioid Over Medication https://t.co/beiOYrLsCv https://t.co/w5HPp2lrR0"]["NRA leaders themselves also used to support this.  Commonsense action also means doing more to prevent criminals from straw purchasing &amp; trafficking in firearms, by passing my bill (S.1185).\nhttps://t.co/vZRrMApTEI"]["I strongly believe in the 2nd Amdt. I’m a gun owner. I also strongly believe that this right is consistent with commonsense gun laws. That means closing background check loopholes, a sensible step overwhelmingly supported by Ds, Rs &amp; Independents…even by the NRA’s own members."]["John, if I may:  A sitting state justice telling a transgender teenager to go away &amp; equating marriage equality to marrying bacon (even in jest) is sending a clear message: Not all are welcome in his courtroom. And that's no laughing matter. https://t.co/jWrBkYODWh"]["A sitting state justice telling a transgender teenager to go away &amp; equating marriage equality to marrying bacon (even in jest) is sending a clear message: Not all are welcome in his courtroom. And that's no laughing matter. https://t.co/X8CpCDQBK6"]["A sitting state justice telling a transgender teenager to go away &amp; equating marriage equality to marrying bacon (even in jest) is sending a clear message: Not all are welcome in his courtroom. And that's no laughing matter."][". . . and here's info on the Consumer Privacy Protection Act that I introduced yesterday in the Senate:   \n\nhttps://t.co/Zkflj8wi36\n\n#Equifax #privacy #databreach https://t.co/NJPBvLC5ji"]["Told them they'd have to do this one without me, this time...a way to prolong the anticipation..... https://t.co/86kdeTK9TH"]["Just intro’d my Consumer Privacy Protection Act, to require corporations holding and profiting from our sensitive personal info to take commonsense steps to keep it safe.  After #Equifax, needed more than ever.  https://t.co/Zkflj8wi36 https://t.co/BI8ZagCyek"]["Leahy Statement On the Attorney General’s Russia-related testimony before the Senate: https://t.co/xILB5Z0FLb https://t.co/mGDskDU6ej"]["AG Sessions green-lighted May 9 memo justifying firing Comey. Memo was a façade. Even POTUS admitted he fired Comey because of Russia. Firing an investigator to stymie an investigation is obstruction, &amp; prosecutors do not look kindly on those who aid others in covering up crimes. https://t.co/h9GJcTXAEE"]["AG Sessions needs to answer how he can reconcile his testimony, including his false and misleading testimony in response to my January question. https://t.co/v3KjyO2SOD"]["Contrary to his prior testimony, unsealed court records and recent reports reveal that AG Sessions knew about Russian connections to the Trump campaign. The notion that the AG is just forgetful – when this issue has been a major story for a year – is simply not believable."][".@SenFranken &amp; I are headed to Senate Floor at 4:30 TODAY. We will demand that Attorney Gen. #Sessions return to Senate Judiciary Comm., under oath, to explain why he can’t seem to get his Russia-related testimony straight. WATCH on CSPAN2 and HERE: https://t.co/evUVNoKBeQ"]["Proud of @norwichnews and Vermont’s @NUCorpsofCadets - many of whom are also serving and will be future #VTVets, for their honor &amp; support of #VTVets during yesterday's ceremony in Northfield."]["Northfield Elementary School students honored #veterans at The Veterans Place on Thursday. #proud #VTVets"]["Chapter 1 of @VVA works hard to identify &amp; honor Rutland Vietnam #VTVets for the re-dedication of Rutland’s new Vietnam Veterans Memorial so that all will be remembered and honored. Their roll of honor has grown 3x from the 125 vets originally honored: https://t.co/Pnw9yLegaC"]["Thursday the Senate passed S.324, the State Veterans Home Adult Day Health Care Improvement Act, which will let disabled #VTVets who need additional care to get it from @vtvetshome while still being able to live with their families. I cosponsored. Now on to the House."]["Many veterans have given so much for our country, with wounds visible and invisible. The @vtadaptive Sports’ Third Annual Veterans’ Day Weekend Retreat in Killington right now showcases these capable warriors’ impressive skill. #VTVets"][".@WRJ_VAMC is #honoringvets every day with compassionate and veteran-centric care. #service #VTVets https://t.co/rwirs8RhOV"]["From the beginning #VTVets have been woven into the fabric of our state. War of 1812 vets made Battery Park a landmark, and VFW Post 782, named for the 1st #VTer killed in WWI, is holding their annual ceremony there today. https://t.co/uMtKQZe2v7"]["So proud of #VT National Guard units and the VT veterans who have served and sacrificed to keep this country safe &amp; secure. @vtarngrrb #VTVets https://t.co/PhE02Zr2MJ"]["Truly disturbing https://t.co/ZrUDC6yO1x"]["WORTH WATCHING: On #PBS NewsHour -- Will U.S. Stay Committed To Toxic Agent Orange Cleanup In #Vietnam? --  https://t.co/S6WrTIJLEo #Danang"]["The successful Agent Orange remediation project at the #Danang airport and related work have greatly improved lives, and US-#Vietnam relations. Many years of effort. I'm proud to have initiated and steered this project in Congress.\n\nhttps://t.co/Uf0HDR1Y2j"]["This project has helped forge stronger relations between our two countries. I was on hand in 2014 when the cleanup phase was formally launched. There’s more work to be done."]["In Da Nang this morning, Air Force One landed at the Da Nang Airport, the site of the successful breakthrough US-Vietnam project to clean up toxic Agent Orange contamination, a lingering legacy of the #Vietnam War."]["I was on hand in 2014 when the cleanup phase was formally launched. There’s more work to be done. https://t.co/7fpgQ57oTm"]["Great to see Air Force One land at the Da Nang Airport, the site of the successful breakthrough US-Vietnam project to clean up toxic Agent Orange contamination, a lingering legacy of the #Vietnam War. This project has helped forge stronger relations between our two countries."]["When President Trump 1st sets foot in #Vietnam an hour from now, it will be at Danang Airport, a successful Agent Orange remediation project that I'm proud to have led in Congress. It's helping to transform the bonds between our 2 countries. https://t.co/Uf0HDR1Y2j"]["The legislation I introduced today would end this egregious loophole, and save American taxpayers hundreds of millions in lost revenues. Now that’s a REAL tax reform that should be in any tax plan. \n\nhttps://t.co/8ImuKB3jbx"]["Our tax code shouldn’t wink and nod at future wrongdoers who know that they can deduct the damages they owe for the damage they cause. \n\nhttps://t.co/8ImuKB3jbx"]["Today, corporate bad actors can lawfully write off court-awarded punitive damages as an “ordinary” business expense. That’s just wrong. \n\nhttps://t.co/8ImuKB3jbx"]["Leahy: No Tax Breaks For Corporate Misconduct https://t.co/8ImuKB3jbx https://t.co/Zq2erHGMPm"]["The continuing oozing spread of Trumpism's #AntiScience Know-Nothingism. The Trump anti-science agenda is a mounting hazard to health, safety, econ. strength &amp; America's techn. prowess, &amp; of course to the kind of planet we'll leave to our children &amp; grandchildren \n\n#ScienceMarch https://t.co/Wjf3KIwovA"]["DREAMers are standing up not just to defend their dreams, but the American Dream itself. #WeAreAllDreamers https://t.co/HO8wr6DN5b"]["America's promise. America's strength. America's example to the world. The American    Dream. https://t.co/cdTrb9TiIV"]["Leahy And Lee REAX To House Judiciary Approval Of Key Reforms To Section 702 Surveillance Authorities: https://t.co/VpOs33vPho https://t.co/GNPaVNstET"]["Leahy’s Bulletproof Vest Program Awards Grants To 34 Vermont Communities\nTo Help Equip Law Enforcement Officers With 280 More Lifesaving Vests: https://t.co/yidYebZeF5\n\n@GLFOP \n\n@BlueAlertUS https://t.co/0XjwjlXMKE"]["BREAKING: Senator Patrick Leahy -- REAX To New #Treasury Dept. Regs. Restricting Travel &amp; Transactions By American Citizens In #Cuba -- \nhttps://t.co/JNGwKzSH95 https://t.co/tsCmwQIuhG"]["Great to meet with #VT @Keurig Sustainability Officer Monique to talk about the new goals they are setting on recycling, water, &amp; emissions. https://t.co/UvdpTrsnou"]["Instead, Divide, Demean, Diminish and Retreat... https://t.co/5wzBNLI0V9"]["Senator Leahy Leads Senators Urging Senate Finance Committee To Reject #Tax Changes To 401(k)’s #Roth @AARPVT @AARP https://t.co/12MO6Sj1Uh https://t.co/FtzB3hs4AZ"]["Senator Patrick Leahy Leads Senators Urging Senate Finance Committee To Reject #Tax Changes To 401(k)’s    #Roth https://t.co/12MO6Sj1Uh"]["Exactly. An informed and discerning citizenry is fundamental to our democracy and our liberty... https://t.co/J4T8IKMyIp"]["Exactly. GOP leaders blocked the 4 sensible gun safety bills I moved thru Judiciary Comm. after Sandy Hook, &amp; they haven't budged a whit. https://t.co/d2wVw0OPd7"]["Xenophobic, AND malevolent https://t.co/nkU9nzMIKw"]["(2/2) Deporting people to countries besieged by murderous gangs &amp; devastated by natural disasters does NOTHING to protect our nat'l security"]["(1/2) Call this what it is: another xenophobic push to deport immigrants en masse, even those who came here lawfully https://t.co/syBKxAXKon"]["Our hearts are broken again. So much grief endured by so many in Sutherland Springs. Another horrific mass murder by a madman with a gun."]["Today marks 90 years since Vermont's greatest natural disaster. Deeply tragic time, as detailed by our superb #NWS:\n\nhttps://t.co/shWfV4WJci"]["New mural brightens Children's Library @kellogghubbard in honor of late MJ Monahan. Proud to support this great institution. @vtmontpelier https://t.co/N2DfHWGrJx"]["This escalating violation and erosion of norms – both presidential &amp; legal – is sickening. When will Rs stand up? Will they ever? https://t.co/5aLY3ASkGX"]["If you're a student or recent grad interested in a Spring internship in my office you can learn how to apply here: https://t.co/aQb0OqnZvX"]["[BREAKING] Leahy: AG Sessions Must Return To Judiciary Cmte For Under-Oath Testimony To Address New Revelations: https://t.co/Fj7CZNuMuw https://t.co/mj0bgNxAcG"]["Well said, and so true... https://t.co/evh7MOzztR"]["Hi Rob.  Actually, this was at the Judiciary Committee, on Tuesday... https://t.co/2ZRscoMzcv"]["Senator Patrick Leahy's Reaction To The Closed-Door GOP Tax Plan And The Frantic Rush To Pass It Without Hearings: https://t.co/qJETxHBRlW https://t.co/FeDQwVyStS"]["You bet. Tax 'reform' that hurts the middle class is not reform at all. https://t.co/5wwtMlCeHL"]["BREAKING: Leahy REAX On Withdrawal Of The Clovis Nom. To USDA’s Top Science Post: https://t.co/BmqAhQMUvs https://t.co/MHRvMB1z0A"]["But #POTUS screaming for death penalty only makes it harder to find impartial jury &amp; hold suspect accountable. He needs to stop. Just stop."]["Good that #POTUS now recognizes that sending terror suspects to #GTMO doesn’t work, for so many reasons. It’s past time to shut it down."]["Actually my office long ago became one of the first to offer paid internships...still is https://t.co/aqUyGvsRXo"]["Are you a student or recent grad interested in a Spring internship in my offices in Vermont or DC? How to apply: \n\nhttps://t.co/aQb0OqnZvX"]["#POTUS calls our courts a “laughing stock”? That’s a false, and unserious claim. But denigrating our federal judiciary is all too serious."]["Denigrating federal courts and talking about 'quick' &amp; 'strong' justice? #POTUS reveals he's dangerously uninformed.\nhttps://t.co/5akqWSxT7A"]["For the gorgeous Vermont scenery.  But mostly for the pups... https://t.co/13vb1Kyd8y"]["I call it #AntiScience Know-Nothingism ... which perfectly fits for so many Trump nominees and harmful Trump Adm. policies and false claims https://t.co/jOxzZtD3K4"]["Yes I'd ann'd that earlier, based on his complete lack of qualifications for this science post. It fits the Trump adm.'s anti-science agenda https://t.co/VXAikmHI1H"]["Leahy Announces $7.4 Million in Federal Funding To Support Victim Service Programs in Vermont: https://t.co/wToTrKsyBx https://t.co/0qT5PhdmTL"]["Swinging open the door instead to those dependent on deep-pocketed polluters. The oozing spread of Trumpism's #AntiScience Know-Nothingism https://t.co/ec6C53pbMf"]["WORTH READING: ‘Vermont Declared An Emergency Over The #Opioid Crisis — And Actually Did Something About It’ -- https://t.co/hJ0MGFFjKv #VT"]["And we STILL won't be intimidated by thugs... https://t.co/jM1jCJEtUy"]["America’s great tech firms were weaponized by the Kremlin to divide us and polarize our democracy. We should all agree: NEVER AGAIN."]["Russian covert propaganda reached at least half of US in 2016 election. What are tech firms doing to stop it from happening again? https://t.co/GJ5lArDSmO"]["Reflexive and baseless, and a regrettable mistake. SEE letter from 10 U.S. Senators to President Trump on this: \n\nhttps://t.co/drJ4kd09Pl https://t.co/AuMDm4udL3"]["My comments today about Sam Clovis, the Russia invest., and the Clovis nom. to the top science post at #USDA -- \n\nhttps://t.co/rHuX07cmQN https://t.co/c63hfvCz3P"]["Hg's underway. I’m pressing tech cos. on this Halloween to pull masks off Russian entities fomenting political &amp; social division in the US."]["10 Senators Led By Leahy Ask President To Abstain In Wedn UN G.A. Vote On The Failed 55-Year US Embargo Of #Cuba \n\nhttps://t.co/drJ4kd09Pl"]["Comment of Sen. Agriculture Committee Member Patrick Leahy About  Nom. Of Sam Clovis To Be #USDA’s Chief Scientist\n\nhttps://t.co/rHuX07cmQN"]["DREAMers were brought here as children through no fault of their own. We cannot betray our promise to these young people. #WeAreAllDreamers https://t.co/cazEyeNC81"]["As Mueller Investigation Proceeds, Leahy Calls to Protect Integrity And Independence Of Special Counsel: https://t.co/N1MgPgxiO1 https://t.co/CBIAfenibc"]["Jud. Chair Grassley &amp; I believe the American people deserve to know what govt. knows after 54 yrs, &amp; we intro'd our resol. on that principle https://t.co/mUEF5qsHmQ"]["Hypocrisy alert. Opening Americans' public lands for oil cos. at same time they'll DOUBLE park fees for families, blocking access for some. https://t.co/BUeCDsRH4u"]["Hypocrisy alert. Opening Americans' public lands for oil cos. at same time they'll DOUBLE park fees for families, blocking access for some. https://t.co/CqzwsslAvt"]["The AG wants to defeat my amdt to protect state-approved med marijuana laws. My Q: Show me an example of an investigation derailed by amdt? https://t.co/H5Xw95T8oc"]["Is AG Sessions enabling Trump’s delusional crackdown on the free press for simply doing its job? The American people need to know. https://t.co/AsScvXlYeF"]["How would AG handle investigations into Trump Org’s questionable business dealings when POTUS made it clear he does not like bribery laws? https://t.co/gck1CK8XoH"]["Why is POTUS personally interviewing US Atty noms—which is unheard of—in districts where he has property/associates under investigation? https://t.co/DZJ3pscFTM"]["Does AG Sessions agree with the national security professionals I asked that the underlying justification for the travel ban is nonsense? https://t.co/ONwZTpGh3k"]["We deserve to know how DOJ—once a powerful protector of the right to vote—is now coordinating with the sham Pence-Kobach voting commission. https://t.co/Injq5LmkQ4"]["I want to know the impact of AG Sessions’ #licensetodiscriminate, and whether anti-LGBTQ hate groups helped to develop it. https://t.co/0IOu6uQAkt"]["After testifying at his confirmation hearing he’d “never go back” on civil rights, why did AG Sessions do just that…in his first month? https://t.co/uWLRaea0rB"]["Does the AG agree with Sally Yates that U.S. officials are vulnerable to blackmail if a foreign adversary knows they’ve lied? https://t.co/hJXedKOItI"]["I want to know if the AG was truthful in his prior testimony to me about his contacts with Russian officials during campaign. https://t.co/tfbxuBLhYq"]["From Appropriations Vice Chairman Patrick Leahy: A Reality Check On The President’s Opioid Announcement https://t.co/A8vu2zPim0 https://t.co/oRe0AwFHki"]["Statement Of Appropriations Vice Chairman Leahy On the President’s Announcement On The Opioid Epidemic https://t.co/hDwFpLXVJX https://t.co/kWUdkTTCsr"]["From Appropriations Vice Chair Patrick Leahy: \n\nA Reality Check On The President’s Opioid Announcement: https://t.co/A8vu2zPim0"]["We are past the time for just talk on opioids. We cannot arrest our way out of this crisis. Time to provide adequate resources &amp; do better"]["But both R’s &amp; D’s on Approps Comm recognize the importance of this funding. The FY18 Senate Approps bill incl +$137m to fight addiction."]["Talk is cheap. REALLY handling the #opioid crisis takes RESOURCES and a commitment to make this a budget priority."]["Incredible that @POTUS is trying to take credit for funding that he’s repeatedly tried to CUT. His FY18 budget would reduce funding by $97m."]["It doesn’t matter what you call it; w/o dedicated resources we can’t stop the #opioid epidemic. @POTUS ann't adds NO $$ to fight addiction."]["W misguided, heartless leadership, we get misguided, heartless &amp; mindless results. Pres Trump, end this cruelty NOW. https://t.co/r5djlf3BpS"]["A delightful evening at the newly opened and impressive Wharf, among many friends and the talented Phil Baruth. https://t.co/G0oF2H1Zat"]["Well deserved, Tom! https://t.co/Wvsw97S5eC"]["The Joker is a sinister villain, but #Bats face a more insidious nemesis in #WNS. We need to protect our declining bat colonies. #BatWeek https://t.co/mWutJiQa4Q"]["LEAHY REAX: Senate Kills Consumer Protection Rule To Restore Americans' Rights When Harmed By Large Financial Firms\n\nhttps://t.co/NvYlINCITj"]["\"Both sides,\" like #POTUS's \"both sides\" nonsense on Charlottesville. The spread of Trumpism's #AntiScience Know-Nothingism. @ScienceMarchVT https://t.co/pDsBqedU57"]["Couldn't have summed it up better, Chris. A true and good public servant.  -Patrick https://t.co/41deXEZWnD"]["You shouldn’t be forced to sign away your rights just to get a credit card. I'm voting to protect the CFPB #RipoffClause rule."]["It's time to stand up for the American people, not cave to powerful corps. I support the CFPB’s #RipoffClause rule that protects your rights"]["Senate likely to vote TONITE to kill #CFPB rule protecting your right to go to court when cos. like #WellsFargo rip you off. This is wrong."]["Hurricane relief is not a game show. People are dying &amp; they need @POTUS longterm commitment and support. https://t.co/pNMi2mjEwM"]["It’s been 35 days since Hurricane Maria hit #PR. As Approps Vice Chair I pledged to continue helping #PuertoRico. Americans stick together. https://t.co/HIsIRx8UNm"]["To learn more about #bats, follow @bat_week or check out @VTFishWildlife website: https://t.co/Aoxomg2tpi"]["#WNS is more a more insidious nemesis than even the Joker. It affects bats across the country. Help stop its spread &amp; protect bats #batweek https://t.co/TOwUbdQgfa"]["#Bats are a vital part of the #VT ecosystem &amp; farms which is why I’m proud to support work to control &amp; counter #WNS, incl $30k this summer."]["#WNS, a fungus that was 1st ID’ed in #VT in 2006, has infected all 6 of VT’s cave bat species, reducing some populations by 90% or more."]["Approps Vice Chair Leahy, Senate Flr, On Emerg. Suppl Disaster Appropriations #PuertoRico #USVI #Wildfires #Fla #TX https://t.co/kx2o6beBPb"]["After more than 50 years, Americans deserve to know what our government knows. POTUS needs to follow through. #JFK"]["Imp. now to put ACTION and $ behind Pres.'s words. His budget proposes US w/drawal frm the multinational efforts that multiply US interests https://t.co/AbfMqO78dC"]["Good mtg w #PuertoRico Gov Rossello. We agree: ALL US citizens stand by each other in times of disaster. https://t.co/wA4ScOogkc @Lin_Manuel"]["Senate Appropriations Vice Chair Leahy Meets With #PuertoRico Gov Rossello Ahead Of Senate Debate On Emerg. Funding: https://t.co/wA4ScOogkc"]["Good meeting just now w Gov. @ricardorossello.  We stand by each other in times of disaster.  We will continue to stand with #PuertoRico."]["Sen. Patrick Leahy and @SenTedCruz Pen Letter Urging #Apple CEO Tim Cook To Stop Enabling China’s Great Firewall: https://t.co/tb4rG3oXs7"]["WATCH @washingtonpost video: \"Sessions stumbles through questions about communicating with Russia\" https://t.co/dlcvrCLvzn"]["In Jan. I asked AG Sessions if he met w Russian officials. He said no, under oath. But that’s not what we heard from him today. https://t.co/MwUudXxjrY"]["Happy Birthday Bob. I know you'll keep on truckin' ... https://t.co/D4Sw7QHhj0"]["How many independent fed judges must block this constitutionally &amp; legally suspect Muslim ban before @POTUS gets the msg? #NoMuslimBanEver"]["Hungry children cannot learn. #FarmtoSchool brings the healthy foods to school cafeterias so our children can succeed."]["My legislation will increase funding for &amp; expand the #FarmtoSchool program to incl pre-schools, summer &amp; after school programs."]["Last month I intro’d a bill to expand #FarmtoSchool. Looking forward to working w @SenThadCochran to pass the Farm to School Act of 2017."]["October is #FarmtoSchool month and a celebration of the 10th year of bringing fresh, healthy food to children from local #VT farms."][".@JoeBiden awards @SenJohnMcCain the #LibertyMedal today @ConstitutionCtr. Veteran, hero, statesman, &amp; friend. WATCH https://t.co/axN3RYVcZF"]["Statement of Senator Patrick Leahy on Pres. Trump's Decision To Not Certify the Iran Nuclear Deal:  https://t.co/m3bPhHddGV"]["REAX of Appropriations Vice Chair Leahy To Pres. Trump's Recent Actions To Sabotage The Health Care System:  https://t.co/7LnnEmPz6l"]["Spiteful Trump moves against #ACA will only cause higher premiums in 2018. Is this the “great” healthcare he promised? #MakeAmericaSickAgain"]["Of all POTUS acts to sabotage the health system, punishing millions of families, this is worst &amp; most destructive. Why spurn bipartsanship?"]["Not up to Sen McConnell, just as it wasn’t up to Sen Reid when I was Chair. This is dec. for Judic. Chair to make.  https://t.co/uhPiAiSuvs"]["Senator Patrick Leahy: REAX To Republican Leader McConnell's Remarks On The \"Blue Slip\" Tradition:   https://t.co/ahNVwcIOrC"]["Senate Appropriations Vice Chair Patrick Leahy’s REAX To The Trump Adm.'s Lifting Of Sanctions On #Sudan -- \n  https://t.co/hkp7xY4rPP"]["(2/2) Another word: #Shameful. A Pres. who called for discr. v. Muslims now cites “religious liberty” to discr. v. LGBTQ &amp; other minorities"]["(1/2) Our govt should NOT be in the discrimination business. POTUS granting a #LicensetoDiscriminate is – one word for it -- #Appalling."]["Appropriations Vice Chair Patrick Leahy’s Congressional Record Statement On “A History Of Impunity In #Indonesia”\n  https://t.co/YKb18V2zY6"]["Leahy Joins In Bipartisan Introduction Of Comprehensive Criminal Justice Reform Package https://t.co/ZUQyqVwcpM https://t.co/Z4UqL7qcG5"]["My bill would allow the #FTC and States to hold firms like Equifax accountable. Important steps to protect Americans’ privacy."]["It is time for Congress to act, which is why I announced today that I am reintroducing my Consumer Privacy Protection Act."]["Millions whose personal info was stolen in #Equifax &amp; other breaches have urgent &amp; personal interest in this being a priority for Congress"]["Firms like Equifax benefit financially from our personal information, and they have a trust obligation to keep it safe."]["I will be questioning Equifax’s former CEO at 2:30.  You can watch LIVE here: https://t.co/LVtHud7RJA"]["Leahy Joins In Introducing Bill To Close Automatic Weapon Loophole (On Bump Stocks, Other Accessories) https://t.co/eCqrJZWeyr https://t.co/rCKkoLZ9iv"]["We'll continue to #Resist Trumpism's #AntiScience know-nothingism for the good of all Americans, for our economy, and for people everywhere https://t.co/KtaEGGeSRu"]["#VT &amp; other states stand ready to do more to help address this humanitarian crisis, but #POTUS is callously directing them to do less."]["POTUS has lowered our refugee cap &amp; dimmed our nation’s beacon of hope for the persecuted, despite having no basis for this shameful retreat"]["Statement Of Senator Patrick Leahy On President Trump's Plan To Cut FY 18 Refugee Admissions\nhttps://t.co/0zqoWHBbaS https://t.co/EdT5v9vwjP"]["Leahy @SenSanders @PeterWelch: St. Albans Awarded $10.6M\nIn USDA Rural Development $ For Wastewater Sys Improvements https://t.co/3XxM0Evr2y https://t.co/mR8JxMRfmq"]["Leahy REAX To State Dept.’s Ann’t That It Will Expel Cuban Diplomats https://t.co/AqX0Ewb0UI https://t.co/CujmyZJXO7"]["My photo of fitting tribute of our flag at half-staff. Contrast w GOP ldrs who won’t allow vote on even minor commonsense gun safety reform. https://t.co/2RrXK8IVqZ"]["AG’s stmt suggesting #DACA puts Americans at risk of crime/terrorism is shameful &amp; false. DOJ didn’t defend it during my Q’ing today. WATCH: https://t.co/QHzuQCqPjM"]["#DREAMers are a huge benefit to this country. Even Trump officials admit that. Congress must pass the #DreamAct. It is immoral not to."]["At today’s hg I questioned DHS officials about the Administration’s plans to deprive #DACA recipients of their jobs &amp; legal status."]["Here's my full statement on voting NO on this nom., part of this Admin.'s continuing assault on #NetNeutrality --\n\nhttps://t.co/qfZOKUU6Ze https://t.co/ZaYbphHIGH"]["I oppose the nom of Ajit Pai as FCC Chair. #NetNeutrality &amp; other critical telecom issues are at stake. READ HERE: https://t.co/qfZOKUU6Ze"]["All Vermonters are further devastated to learn that Vermont’s Sandy Casey was a victim in Las Vegas. Our prayers are with her and her family"]["Comments Of Senator Patrick Leahy On The Las Vegas Massacre https://t.co/y09PAb7GM5 https://t.co/OhtTAYzAp5"]["Opening the Change Corridor prjct this a.m. w valued partners in the fight v. opioids. All hands on deck to tackle this crisis. https://t.co/CuSeGt9wUr"]["In Vermont this a.m. we're feeling the shock &amp; sorrow that the entire country is feeling abt the massacre in Las Vegas. Our sympathy to all."]["'Heckuva Job' -- Washington Post sums up White House's lack of focus on Puerto Rico's suffering. URGENT needs. \n\nhttps://t.co/9YwFmG3F9a"]["BREAKING: REAX of Approps Vice Chair Leahy To US Withdrawal Of Most US Emb. Personnel &amp; Their Families From #Cuba  https://t.co/7TqETiiOot"]["RT if you agree! Consumers, innovators, and ALL AMERICANS deserve equal access to a free and #OpenInternet. Protect #NetNeutrality https://t.co/TbRKH398sq"]["A YES vote for #NetNeutrality is a NO vote for @AjitPaiFCC for @FCC Chairman. I vote yes for protecting a free &amp; #OpenInternet. https://t.co/ukB250hbig"]["By slamming our doors to those fleeing tyranny and war, President Trump turns his back on our proud history as a refuge for the persecuted."]["This shameful retreat from our role as the world’s humanitarian leader will place tens of thousands of lives at risk."]["Trump caved to xenophobic voices around him, telling Congress he will set lowest refugee cap in mod. hist. - 45K. https://t.co/ooZm8qNLEl"]["My Record stmnt on SenApprops directing @USAID to use $15m for safe public latrines in Africa, Asia https://t.co/mYI5bkN9u0 @PSimonInstitute"]["Join Senate Democrats LIVE at 10:30 as we talk about why we must protect @CFPB &amp; end forced arbitration. WATCH LIVE: https://t.co/LAQ3z0ZHXv"]["An imp. step. The Comfort is kitted out with skilled professionals &amp; unmatched capabilities to offer to the struggling victims of #Maria. https://t.co/yI7Jd88ZAa"]["Thank you both for coming to the Capitol to stand against the Graham-Cassidy #Trumpcare bill with me. https://t.co/jRRmjQzrwy"]["It’s time to get rid of forced arbitration. We must protect this @CFPB rule &amp; also pass my Arbitration Fairness Act. #RipoffClause"]["I won't vote to deny Americans day in court. Class action often only way to hold companies accountable for sweeping misconduct #RipoffClause"][".@CFPB arbitration rule prevents Equifax &amp; Wells Fargo from hiding forced arb clauses in fine print. I stand w consumers. #RipoffClause"]["We must stand with the people of Puerto Rico and the VI. Millions of Americans need our help, and we must answer the call. https://t.co/fBFnzVQL0e"]["Great to meet w Steven Perrin of Brattleboro today, #VT HS Principal of the Year. Congrats and thank you, Steve. https://t.co/u5rT29JILE"]["Appropriations Vice Chair Patrick Leahy's Senate Floor Speech On Devastation To #PuertoRico &amp; U.S. Virgin Islands\n\nhttps://t.co/0LwRk3UNiK"]["Honored to meet @Malala yesterday to discuss the importance of educating girls around the world. Inspired by her courage &amp; dedication. https://t.co/Csdcj4gOx8"]["We can’t count on demise of latest #Trumpcare. Need to stake it thru heart &amp; move to bipartisan #ACA remedies. WATCH https://t.co/h2AGdJjPc4"]["Floor Statement On Health Care, The Affordable Care Act, And The Flawed Graham-Cassidy-Heller-Johnson Proposal https://t.co/kbMIcyL4VZ https://t.co/mwvItsRgrL"]["Statement of Appropriations Vice Chairman Leahy On The Devastation To Puerto Rico And The U.S. Virgin Islands\n\nhttps://t.co/cBb1X0Pn7J"]["A must read. The people of Puerto Rico &amp; US Virgin Islands need our help, &amp; we need to act quickly #PuertoRicoRelief\nhttps://t.co/90jzLZgVVN"]["Listen to Mari from Lincoln #VT, in line for today’s hg. Concerned that the young people she treats as a nurse will suffer. #KillTheBill https://t.co/vHFkIjwCe2"]["Listen to Drew from Readsboro #VT, in line for today’s hg. Concerned that #Trumpcare will deny insurance to Americans &amp; hurt VT’s budget. https://t.co/kweiCPNi74"]["Vermonters are among the 100s in line for today’s hearing on #Trumpcare. They agree we need to #KillTheBill &amp; #ProtectOurCare."]["How can @SenateGOP claim to be trying to help patients when 15m will lose or drop insurance on DAY ONE of this #Trumpcare plan?"]["This #Trumpcare bill will also take money away from #VT simply bc it did the right thing and expanded Medicaid. #ProtectOurCare"]["I will vote no bc this new #TrumpCare bill will hurt seniors, those with disabilities &amp; preexisting conditions, &amp; women. #ProtectOurCare"]["I will vote no because this is the worst #TrumpCare yet. It will allow the insurance companies to charge more for essential coverage."]["Once again, @SenateGOP is trying to ram through harmful legislation to gut the ACA. If it comes to the floor, I will loudly vote NO."]["#VT will lose $561M by 2026 if this terrible #Trumpcare bill passes. #ProtectOurCare https://t.co/Af7UVEMWoH"]["NEWS: Vermont Receives Fire Prevention and Safety Grant from FEMA https://t.co/AJTPi53kWH"]["I will work to #FixthecCiff in the Senate &amp; save the health care safety net they provide for 171k VTers &amp; 27m of Americans. #ValueCHCs"]["#VT Community Health Centers are healthcare oases for rural &amp; underserved VTers. If we don’t act by 9/30 they face a devastating 70% cut."]["Approps Vice Chair Leahy in CongrRecord, on Approps Action To Support Intl Efforts To Find &amp; Prosecute War Criminals\nhttps://t.co/1oqvMGATLT"]["Appropriations Vice Chair Patrick Leahy in CongrRecord, on Approps Cmte Action To Address Cholera In #Haiti   \nhttps://t.co/C7bshlIu4Y  #UN"]["Approps Vice Chair Leahy in CongRecord, on Approps Cmte Rejecting Trump FY18 Cuts In Intl. #HIV/AIDS Work: https://t.co/zDaqbBL8Bv #PEPFAR"]["Leahy in CongRecord on $ he &amp; @LindseyGrahamSC incl in StateDept/ForOps Bill, for protect'n of civil soc. activists https://t.co/o9xH6sjsYm"]["Leahy, Grassley Press Justice Department on Whistleblower Protections: https://t.co/GPAYKwfsph"]["Vermont hospitals know how damaging the newest version of #TrumpCare is to patients.  Why don’t Senate Republicans? https://t.co/wXA1MaQtcH"]["#MustSeeTV: Jimmy Kimmel on how GrahamCassidy #TrumpCare utterly fails Sen. Cassidy's own 'Jimmy Kimmel Test' --  https://t.co/KCeqNlsaMY"]["As these drastic #AntiScience know-nothingism Trump cuts come up in the Appropriations Committee, we are resisting--and, so far, prevailing https://t.co/gqNIkGAgjH"]["#VT leads again on clean energy. A true VT partnership w @BurlingtonElec @VEIC &amp; @RideGMT to make progress on clean energy &amp; transportation"]["On heels of @ccecon17, new grant to VTrans will help @RideGMT buy new all-electric busses. Great step fwd on reducing carbon emissions #BTV"]["#VT leads again on clean energy. Proud to have championed this grant w @SenSanders &amp; @PeterWelch https://t.co/2YDikT2fTI https://t.co/XvIvucFksg"]["4/ Admitting anything less than 75k refugees would be a shameful retreat from our position as a humanitarian leader in the world."]["3/ Bipartisan Senate State Dept./Foreign Ops bill, unanimously approved in Approps Cmte, provides resources to protect our refugee programs."]["2/ I urge @POTUS to not cave to the xenophobic voices around him – to not shut our doors to the innocent during a world humanitarian crisis."]["Leahy &amp; Van Hollen On US Decision To Deny Export of Firearms to Turkish Presidential Protection Directorate\nhttps://t.co/ITMxzB4ydF https://t.co/9mnpASMV2L"]["At #BTV Book Festival this weekend I spoke about my lifelong love of books and about my lifelong connection to the Kellogg-Hubbard Library https://t.co/WTTRWKtJkn"]["Thank you everyone for another successful #LeahyWEOC. Great to partner w @ChangestoryVT &amp; to meet so many inspiring #VT women https://t.co/rSxb5TPeCE"]["Great performance by Muslim Girls Making Change at #LeahyWEOC. More great stories to come in @ChangeStoryVT afternoon session. https://t.co/tTRy34AU5L"]["Great video from @ChangestoryVT on the young women of @BEGREATVT. So many future leaders. #LeahyWEOC"]["We need to work even harder to #resist the rollback of sound policymaking that promotes opportunity &amp; equal treatment.  #LeahyWEOC"]["This year Marcelle and I lent our voices to the swelling chorus, making it clear that women will not stand for losing ground.  #LeahyWEOC https://t.co/cP0Z3yQ0g6"]["Hundreds of #VT women are ready to take part in the inspiring &amp; practical workshops at #LeahyWEOC. https://t.co/ahKxWWjqLU"]["Today is #LeahyWEOC and it keeps getting better. Mary Alice McKenzie keynotes &amp; we launch an exciting new partnership w @ChangeStoryVT https://t.co/Oby65Bbvm8"]["#Vermont is No. 3 among all states in #solar jobs per capita. Again and again, the Green Mountain State is leading on renewable energy. https://t.co/pgkGI3LJTW"]["Our everyday heroes. https://t.co/ukrTOjikF3"]["A delight to escort @Lin_Manuel Miranda &amp; his wonderful parents for a photo w the \"other\" Alexander Hamilton in the Capitol Rotunda. https://t.co/jxCKem3HQm"]["Great news on eliminating VTs waitlist for heroin treatment. I am committed to securing the resources we need to fight this epidemic. https://t.co/LR1hVJiCOS"]["Appropriations Vice Chairman Patrick Leahy's Statement On House Passage Of An Omnibus Appropriations Bill: \n\nhttps://t.co/QFeS3bKGhv"]["Senate Panel (#Appropriations) Rebuffs Trump Adm.'s 'Doctrine Of Retreat,' in  @VTDigger -- @StateDept @USAID  https://t.co/IFLdD2xjQ8"]["Proud to be an original cosponsor of #MedicareForAll. @SenSanders &amp; I r making sure that #VT leads the way in healthcare for all Americans."]["Watch the launch video for #MedicareForAll.  We must build on the successes of the #ACA and bring health care to ALL Americans. https://t.co/yWQMsvnnKX"]["Why do you support #MedicareforAll?"]["I support #MedicareForAll because health care should be a right, not privilege, in the wealthiest nation on Earth."]["NYT: Graham/Leahy-led State Dept Appr Bill, per WH's \"apparent doctrine of retreat\" + Rpt\n \nhttps://t.co/wNYbqaBWkS\n\nhttps://t.co/1NivwsrHLl"]["Committee Report for our State Dept &amp; Foreign Ops. Bill from last Thurs.'s Sen. Appropriations Comm vote is must-reading  \n\n@LindseyGrahamSC https://t.co/KqOwygtt7R"]["Had the pleasure tonite of escorting Lin Manuel-Miranda, his parents, and Ron Chernow in the Capitol. We stopped at the Hamilton statue... https://t.co/4fZjLkZcFv"]["Glad to report that I did support this, which we added this summer to one of our annual Senate Appropriations bills. Further steps to go. https://t.co/1sqXre6N3G"]["Rs joined with Ds on Senate Appropriations -- this time -- to push back against Trumpism's #AntiScience know-nothingism. https://t.co/fxZ78EGT6R"]["Weekend Listen: I discuss many topics w. VTers &amp; @VPRKinzel, incl DACA, N Korea, &amp; engagement in the age of Trump. https://t.co/pjR8auWGM0"]["Appropriations Committee Vice Chairman Patrick Leahy Notches Key Win For Lake Champlain In Committee Vote https://t.co/sVm8ie79ip https://t.co/53JdsxHSuX"]["A Win For VT: Leahy Leads Appropriations Committee In Rejecting Trump Elimination Of LIHEAP Program https://t.co/EzdUhzUmqq https://t.co/JnOP9DWsWl"]["My Senate Floor address on #DACA (text). Video also available on my Facebook page. \n\nhttps://t.co/aID54AuD9L"]["Here it is...also on my Facebook page, in video. \n\nhttps://t.co/aID54AuD9L https://t.co/lRedDbZmX7"][".@SenateDems &amp; I stand ready to protect our nation’s DREAMERS and defend the American dream. It is time for @SenateGOP to join us."]["Dr. Conde is the face of DACA. Stories like his show why @POTUS decision to rescind #DACA is as senseless as it is callous."]["Dr. Conde is a VT #DACA recipient. He has a PhD in cancer research and studies medicine at UVM. He is #HereToStay and help cancer patients. https://t.co/Cp0oSQRrRK"]["It’s time to pass the #DreamAct and protect DREAMers who were brought here as kids through no fault of their own."]["Our president prefers to divide us, not unite us. I stand with DREAMers who are #HereToStay and contribute so much to our great nation."]["Appropriations Vice Chair Leahy’s Report On Today’s Approps Comte Appr Of Budget Bill For HHS/Labor/ #CPB / Others: https://t.co/3ppyI8nOya"]["Appropriations Vice Chair Leahy’s Rprt On State Dept/Foreign Ops Funding Bill, Passed Today By Appropriations Comm.\nhttps://t.co/nLy3NtuB16"]["Hungry children cannot learn. I will work to pass this bill to boost funds for #FarmtoSchool to bring healthy foods from local farms to kids"]["#VT is a leader in efforts to link local farms &amp; classrooms thanks to orgs like @VT_FEED @vtfarm2school @ShelburneFarms &amp; @HungerFreeVT."][".@SenThadCochran &amp; I reintroduced the #FarmtoSchool Act today. We’re proudly working together to bring healthy, local meals to kids."]["Leahy And @SenThadCochran Re-Introduce Bill To Renew And Expand Farm To School Program: https://t.co/CAU1gKA7fX https://t.co/PFeo2UdnDw"]["Good to see @PPFA recognized for the essential health care they provide for women in this country. https://t.co/Z1E5wE9SUE"]["READ: @SherylSandberg reminds us why we must work to ensure #paidleave. That's why I cosponsor the #FAMILYAct. https://t.co/NNdOOsjWnG"]["It is time for Senate Republicans to show the courage &amp; leadership the President lacks, to work with us to protect DREAMers."]["I stand ready with all Democrats to #DefendDACA and fix our broken immigration system."]["The President has revealed that he is as heartless as he is uninformed. DREAMers are our friends and neighbors. #DefendDACA"]["The #DACA decision is petty and malicious, and it is harmful in so many ways. #DefendDACA"]["Senator Patrick Leahy REAX To Trump Plan To End #DACA, Threatening Hundreds Of Thousands Of #DREAMers: https://t.co/yhA9FlstaO https://t.co/OEoseOHGn9"]["(Approps Vice Ch. Leahy, 2 of 2, on Harvey/debt ceiling) \" ...do their work we can vote on each by Saturday. That's the responsible way.\""]["#DREAMers are first-responders, soldiers, teachers, and neighbors.    We must defend them and #defendDACA . @amprog @CATO"]["We will not turn our backs on #DREAMers who trusted gov’t to protect them and registered in pursuit of the American Dream. #DefendDACA"]["#DREAMers are soldiers, teachers, first-responders, and neighbors. We must #DefendDACA"]["and systematically killing accountability protections for students misled by for-profit schools, and for taxpayers who stoke their profits https://t.co/HErWWPwf0L"]["The #AntiScience Know-Nothingism Of The Trump Agenda Continues Its Oozing Spread, Risking Americans' Health &amp; U.S. Greatness\n\n#WarOnScience https://t.co/eFUtT0vtB8"]["Not to mention the slashing Trump cuts to #NOAA National Weather Service #NWS #CDC #EPA #NIH; the list of Trump #anti-science cuts is long https://t.co/dtAAkVVRve"]["And Vermont, which has set a leading example for other states to follow...my bill would encourage wider use of this needed reform. https://t.co/GOvKkdeUPn"]