[".@OWHnews Editorial: Fischer's appointment to Ag Committee key for state. Read here: https://t.co/QhBqzqAffW"]["Human trafficking is an unconscionable practice. We must deploy every tool we have to stop it. I’m a partner of @AGDougPeterson #DemandAnEnd &amp; a cosponsor of legislation to hold perpetrators &amp; facilitators of these heinous crimes accountable #SESTA  #HumanTraffickingAwarenessDay https://t.co/SsYwgtd6J5"][".@NEFarmBureau is a leader on all things #NEag. I appreciate your support and am ready to work alongside you to secure wins for NE producers. #NEag #FarmBill #FeedTheWorld https://t.co/RHQ7cdJHaO"]["Looking forward to working with @NeCGA. Thanks for your support and all you do for #NEag! #FarmBill #FeedTheWorld https://t.co/kmJFqsvDyr"]["I appreciate the kind words from the folks at @NEporkproducers. Looking forward to your hearing your suggestions as we craft the next #FarmBill. #NEag #FeedTheWorld https://t.co/qOFJP8rFh4"]["Thanks for your support @NeCattlemen! Looking forward to working with you on the next #FarmBill. #NEag #FeedTheWorld https://t.co/5Tcy3pZSxy"]["Looking forward to working with @NEFarmersUnion. Thank you for your support. #NEag #FarmBill #FeedTheWorld https://t.co/0BhVxEe9XX"]["Proud to have support from across the state of Nebraska. Looking forward to working hard on the @SenateAgGOP committee for our state’s farmers and producers. #NEag"]["Just in: @Walmart is raising starting wages, providing bonuses, and expanding #PaidFamilyLeave benefits to employees due to #TaxReform. Another sign that the ##TaxCutsandJobsAct is working for Americans &amp; growing our economy! More here: https://t.co/GuKPG8gqdB"][".@1011_News covers how NE’s @Nelnet is paying it forward to employees because of #TaxReform. Proud to have worked on this bill that puts more money back in the pockets of Nebraskans. More here: https://t.co/KHo1tWT4uX"]["SOON: I’ll be participating in an @EPWGOP hearing on America’s water #infrastructure needs and challenges. Watch live: https://t.co/hJEuNpGctM"]["In my new role on @SenateAgGOP, I look forward to working together with Nebraskans, Chairman @SenPatRoberts, and my colleagues on the Ag committee to advance the smart policies #farmers and #ranchers need to do their job of feeding our hungry world https://t.co/L1GzLHM9x8 https://t.co/gDapD4uyVN"]["Great news! “Fischer gains seat on Senate Agriculture Committee”…read the full story by @LJSdon in @JournalStarNews: https://t.co/FI4E8TR3wM"]["Every day, brave men and women put their lives on the line to protect our communities. To all of our law enforcement officers, thank you for your service.  #NationalLawEnforcementAppreciationDay https://t.co/D2ZPclQtVI"]["My full statement in reaction to @POTUS’s speech at the @FarmBureau’s convention today. #AFBF18 https://t.co/dCVciHjhSW"]["According to @UNICEF food waste and supply chain losses comprise approximately 30% of worldwide food production #IoT"]["Combined yield enhancement and resource savings from new technologies can increase American farmers’ profits by an average of $40 per acre #IoT"]["A recent 6-month pilot study found IoT-enabled precision agriculture improved overall crop productivity by 15%"]["With the world’s population expected to exceed 9 billion people by 2050, there are estimates that ag production must at least double to feed our global communities #FeedTheWorld"]["More than one third of Nebraska’s GDP comes from rural, primarily agricultural, areas #NEag"]["Nebraska’s farms and ranches utilize 45.2 million acres – or 91% of the state’s total land area."]["#Agriculture is the third fastest growing sector of #IoT"]["One in four jobs in Nebraska is #agriculture related #NEag"]["Check out these quick facts about #agriculture &amp; #technology:"]["Good to hear @POTUS will discuss advancing prosperity in rural America today w a specific focus on supporting broadband access for #agriculture. I'm proud to be a leader on #IoT &amp; technology in the Senate. These innovations will improve the lives of America’s farmers &amp; ranchers"]["I support the Iranian people’s right to free expression. That’s why I helped introduce a bipartisan resolution condemning the government of Iran for its repression and demonstrating that the U.S. stands with the Iranian people in their call for reform. #IranProtests"]["After being unjustly detained in the Republic of Congo since 2016, Marcel Pika has safely returned to U.S. soil. I join all Nebraskans in welcoming Marcel and his wife, Josephine, home and wishing them well as they reunite with their family. More: https://t.co/cIfWdIOQPw"]["It’s my privilege to announce the outstanding Nebraskans I'm nominating this year to attend our nation’s #MilitaryServiceAcademies. These students have demonstrated an incredible work ethic, impressive leadership skills, and great integrity #ProudNebraskan https://t.co/XEGLerTIjZ https://t.co/Zyc19EcRYn"][".@SenOrrinHatch is a true statesmen and leader who has spent a life dedicated to serving the people of Utah and our country. His graciousness, kindness &amp; hard work as a legislator will be sorely missed. I look forward to another productive year working alongside him in the Senate"]["#HappyNewYear https://t.co/gGIe30GzNc"]["The Iranian people are exercising their right to peaceful assembly. I stand with them and support their desire for a more transparent and accountable government. #IranProtests"]["TUNE IN: I’ll be live with Mike Burge on @KSVHradio at 9AM CT to give a #Senate update. Listen here: https://t.co/rh85vtorbu"][".@OWHNews: “After tax overhaul, American Dream home may be more attainable in places like Omaha area” #TaxReform Read the full story: https://t.co/bS1bjPaJSt"]["Fred Fischer and I wish you and your family a very #MerryChristmas! A special thank you to our men and women in uniform who are serving far from home this holiday season. #ThankYouForYourService #FredFischer 🎅🎄 https://t.co/NMf2Q5gNsa"]["JUST IN: Senate passed #Resolution congratulating @Huskervball for winning the @NCAA #VolleyballNationalChampionship. I’m so proud of these amazing women. Their dedication, hard work, and team spirit inspire us all! #GBR"]["NOW: @SenSasse and I are on the #SenteFloor to call up &amp; pass a #SenateResolution congratulating @Huskervball for winning the 2017 #NCAA #VolleyballChampionship. Watch live: https://t.co/I0ldXcscAF"]["Many of our men and women in uniform aren’t with their friends and families this holiday season. Instead, they are in harm’s way, standing vigil, and working to protect our great nation. More in my column in the @sbstarherald: https://t.co/wbVrkDmDTD #ThankYouToOurTroops"]["A look back at 2017 reveals a productive year. Check out my yearly booklet #WorkingForYou for updates on my work in 2017, including confirming Justice Gorsuch to #SCOTUS, passing the first #TaxReform bill in 31 years, and working to rebuild our military. https://t.co/otuNCyHtFv https://t.co/ghjTovhR9m"]["Letter to the editor by Brandi Preston of Omaha in @OWHNews discusses my historic paid family leave policy that passed Congress &amp; how it will make a difference for #working moms &amp; families. #Passed #StrongFamiliesAct https://t.co/GNgWkLM4yo"]["#TaxReform bill creates the FIRST EVER nationwide paid family leave policy in U.S. history with my #StrongFamiliesAct! I've worked with families &amp; stakeholders over the last 4 years on this historic provision that will make a huge difference for women &amp; families."]["Congress is following through on a once-in-a-generation opportunity: delivering #TaxRelief to families in Nebraska and across the country. Because of #TaxReform, many Americans will have bigger paychecks."]["#POTUS’ announcement of his new #NationalSecurity Strategy signals the return of #AmericanLeadership on the global stage. As a senior member of @SASCmajority, I look forward to working w/ the admin. to ensure our military can execute its goals. More: https://t.co/ENcu2450rt"]["Congrats to the @HuskerVball team for winning the National Championship! #GirlPower #WithEachOtherForEachOther #NationalChamps #ProudNebraskan"]["Good luck to @Huskervball tonight as they play in the @NCAA Women's #Volleyball Championship against the @FloridaGators #GBR https://t.co/DgXuLFVkgz"]["BREAKING: My #PaidFamilyLeave plan was included in the final #TaxReform conference report. This is truly a historic measure. \nMy full statement: https://t.co/riOhQItwP9"]["Congrats to the Nebraska Air National Guard 155th Air Refueling Wing, the “Hustling Huskers”, on winning the @USAirForce Outstanding Unit Award! #ProudNebraskan Great story by @nebraskanews on this top honor: https://t.co/yxeQ30OuzR"]["Congrats to @HuskerVball for their win! Next stop: championship! #WithEachOtherForEachOther #GirlPower"]["Today I hosted a roundtable discussion to explore the relationship between #IoT and agriculture. I heard testimony from #NEstakeholders, government officials, and industry experts about the policies government can pursue to advance tech that helps #NEag #FeedTheWorld. https://t.co/ihw1a0pPzq"]["Today, I met with UK Ambassador Sir @KimDarroch to discuss the recently passed #FY18NDAA and #NATO. No country has a longer history of partnership with the USA than the UK. I look forward to more productive conversations in the future. https://t.co/2vXWhoohXE"]["Proud to cosponsor legislation to reauthorize the National Integrated Drought Information System. This bill will help NE producers address the effects of drought &amp; enable the continued partnership between NIDIS &amp; @UNLincoln. More: https://t.co/l5O5k4TQqV"]["Chief Warrant Officer Chris Allgaier was awarded the Bronze Star and Purple Heart, posthumously. I join Nebraskans and Americans across in country in saluting his willingness, and his family’s sacrifice, to keep us free. #ProudNebraskan #NEheroes"]["On the night of May 30, 2007, Chris flew a night operation transporting approximately 30 service members. Shortly after dropping the soldiers off for their important mission, insurgents shot down his CH-47 Chinook, killing Chris and four other service members. #NEheroes"]["In 2007, Chris’s unit deployed to Afghanistan. He flew CH-47 Chinook helicopters in transport missions. The Upper Sangin Valley in the Helmand Province was the center of fighting in Afghanistan in 2007.  A British newspaper called it “the deadliest area in Afghanistan.”"]["Chief Warrant Officer Allgaier deployed to South Korea for over a year prior to going to Afghanistan in 2003 and Iraq in 2005."]["Due to his strong academic record and interest in aeronautics, Chris was persuaded to apply for Warrant Officer Candidate School. He graduated at the top of his class and became a helicopter pilot."]["Shortly after receiving his bachelor’s degree, Chris enlisted in the @USArmy. He graduated from Basic Combat Training in Fort Jackson before attending his Advanced Individual Training in aviation mechanics. #Service"]["During Chris’s senior year at Creighton Prep, he became interested in fixed wing aircraft and flying. After high school graduation, Chris continued his studies at St. Louis University, where he studied aeronautical administration."]["Growing up, Chris lived a pretty typical life for a Nebraska boy. He ate at his favorite pizza place with his family, cheered on the #Huskers, and attended St. Robert Bellarmine Catholic Church in Omaha with his parents, sister, Sharon, and brother, Rob."]["SOON: I’m speaking on the #SenateFloor to continue my tribute to Nebraska’s #heroes who lost their lives defending our freedom in Iraq and Afghanistan. Today, I will honor the life and service of Chief Warrant Officer Christopher Allgaier of Omaha. Tune in https://t.co/X5deD4xa7A"]["SANTA ALERT: Thanks to the men and women of #NORAD for their work to track #Santa! #NORADTracksSanta 🎅🎄@NORADSanta #MerryChristmas https://t.co/gqqjYmmfyS"]["Soon I’ll head to this AM’s @EPWGOP hearing on oversight of the nuclear regulatory commission. TUNE IN: https://t.co/qXgb3Phfas"]["JUST IN: The #Senate confirmed Steve Grasz to serve on the U.S. Court of Appeals for the Eighth Circuit. Today I spoke on the #SenateFloor to highlight his keen intellect, even judicial temperament, and steadfast commitment to the rule of law. Watch: https://t.co/76p2oG1oxG"]["Speaking on the #Senate floor in support of Steve Grasz from Nebraska, nominee for the 8th Circuit. Watch: https://t.co/8trteX0CcB"]["#HappyHanukkah https://t.co/CQStF4XNbs"]["Happy to see #FY18NDAA signed into law today. This bill has key provisions to restore military readiness, give our men and women the biggest pay raise in 8 years &amp; strengthen U.S. missile defense. I was proud to work on this legislation every step of the way. https://t.co/bAabGAFdF6"]["Rural America puts food on tables all over the world and serves as the foundation for a healthy, growing economy. Read more about my work to support #RuralNE in my weekly column: https://t.co/spfViv3ruh #NEag"]["Great tour of Lexington Regional Health Center today. #LoveNE https://t.co/n9eM0hZCUy"]["On the #Senate floor discussing #taxreform &amp; my #paidfamilyleave proposal in the Senate bill. Watch: https://t.co/L9oOFkmu0N"]["My full statement on @senjudiciary passage of Steve Grasz’s nomination to serve on the U.S. Court of Appeals for the Eighth Circuit. https://t.co/IQC1wbL9aR"]["TUNE IN: @SASCmajority will hear testimony on @DeptofDefense acquisition reform efforts this morning. https://t.co/JXDtV4Ao65"]["SOON: @BoysTown’s Father Boes will lead the opening prayer in U.S. #Senate today. Tune in here: https://t.co/LAZhxz5YTa"]["“But always will our whole nation remember the character of the onslaught against us.” –President Franklin Roosevelt #PearlHarborRemembranceDay https://t.co/zEA8rkFzFy"]["Thanks to @BoysTown for the special award. I look forward to working with you on behalf of children in Nebraska and across the country. https://t.co/em5OcZo0zw"]["I support POTUS announcement recognizing Jerusalem as the capital of Israel. It demonstrates a strong commitment to our ally &amp; is consistent with a bill passed by Congress &amp; enacted into law under President Clinton in 1995."]["Congress has a chance to make #history by enacting the first US nationwide #PaidFamilyLeave policy. Read more about my proposal in my @PostOpinion op-ed: https://t.co/uudRvdqdSn"]["Joined some of my @SenateCommerce colleagues for a meeting with @SecretaryRoss on #NAFTA this morning. NAFTA is a critical market for Nebraska’s ag exports &amp; more than 90,000 NE jobs are supported by this trade agreement. #NEag #FeedtheWorld https://t.co/WPaRYp9lvz"][".@WashingtonPost debunks Dem lies on Senate #taxreform bill. Read: https://t.co/3JYT5p79V9"]["I spoke with President Trump today about the importance of trade to Nebraska. We also discussed the significance of #NAFTA to agricultural exports &amp; manufacturing related jobs. I look forward to continuing these discussions w #POTUS. https://t.co/AmaeVld6C5"][".@WashingtonPost's @EricaWerner covers my #PaidFamilyLeave proposal included in the Senate #TaxReform bill. Congress can make a meaningful impact on the lives of American workers caring for their families. This plan should succeed in conference. Read more: https://t.co/n1xFCnXjvq"][".@WashingtonPost@EricaWerner covers my #PaidFamilyLeave proposal included in the Senate #TaxReform bill. Congress can make a meaningful impact on the lives of American workers caring for their families. This plan should succeed in conference. Read more: https://t.co/n1xFCnXjvq"]["Welcome home @coach_frost! #GBR #TheGoodLife @Huskers 🏈"]["BREAKING: Senate passes #TaxReform bill. Read my full statement and more about the bill here: https://t.co/j4FmmABbsD https://t.co/CLO3zh8Ifs"]["Today I wrote cards to our troops serving overseas, who are far from home this holiday season. #ThankYouForYourService #WeLoveOurTroops https://t.co/kcsbD1jCDc"]["This #WorldAIDSDay, we remember those lost too soon to HIV/AIDS and recommit to working towards an AIDS-free future. https://t.co/m6yZpJCtSZ"]["My statement on Chief Judge Laurie Smith Camp’s announcement that she will take senior status on the NE federal bench: https://t.co/Bp46ve3bCB"]["JUST IN: @EPA announced the finalized 2018 RVOs under the #RFS. The volumes released provide greater clarity for #NEag producers &amp; biofuel innovators. Thank you @EPAScottPruitt for your continued commitment to rural America. https://t.co/B4VnVmoUj6"]["Last night I spoke on the #SenateFloor to highlight my priorities during the tax reform process. These priorities include delivering relief to the middle class, unleashing small business growth &amp; making our country competitive globally. Watch: https://t.co/7OWqkfLuLm"]["My full statement on North Korea’s ballistic missile launch today: https://t.co/dbr0Br5f6f"]["Joined my colleagues &amp; representatives from @NFIB, @NRFnews, @SBECouncil, @NASEtweets, &amp; @AHLA to talk about how #TaxReform will help small businesses prosper. Simplifying the tax code will free up #biz owners’ most valuable asset: time. https://t.co/pJT28F4z8a"]["I send my sincere condolences to Nebraska State Senator Mark Kolterman and his family as they mourn the loss of his dear wife Suzanne."]["In the wake of #SmallBusinessSaturday, my weekly column discusses how #taxreform can reduce burdens on America’s small businesses. #NEbiz Read: https://t.co/d5nPctIj8T"]["The Senate #TaxReform bill includes several family-focused provisions like my #PaidFamilyLeave proposal, the #StrongFamiliesAct. Read about my plan &amp; more in my @JournalStarNews op-ed: https://t.co/LXIKeE6xJ2"][".@JournalStarNews Ed board: “Fischer has crafted a worthwhile endeavor on paid family leave that aims to address an age-old shortcoming for American workers.” Read more on my #PaidFamilyLeave plan here: https://t.co/sOeym5WYJQ"]["#SmallBusinessSaturday is about more than shopping. It’s about supporting your local community. #ShopSmall https://t.co/0kZwHA8Vy7"]["It was an honor to spend #Thanksgiving day with members of the @NENationalGuard currently stationed at Guantanamo Bay. https://t.co/NWyhftWGhD"]["My full statement on @EPA's point of obligation announcement: https://t.co/PwP0w0OxtC"]["This afternoon, my staff and I partnered with the @SalvationArmyUS in #LNK to help distribute #Thanksgiving meals. I’m truly inspired by such generous and caring Nebraskans. #Community #HelpingNeighbors #LoveNebraska https://t.co/g5cXHsbh8W"]["Wonderful time in Beatrice today at @HomesteadNM celebrating “America’s most famous tractor”. Thanks to Superintendent Mark Engler, Dr. C.T. Frerichs &amp; Diane Vicars for their efforts to preserve our past for future generations. https://t.co/O4p5v9nbl7"]["I hope everyone has a wonderful #Thanksgiving with their friends and families, and that you will join me in keeping our service men and women in mind as we celebrate. #SupportOurTroops More in this week’s column: https://t.co/Ag1korlTCO"]["His decades of experience, steady leadership, and top-notch legal skills will make him an incredibly effective U.S. Attorney for the District of Nebraska."]["Joe Kelly is a highly-respected prosecutor who will put the safety of Nebraska’s families and communities first. It was my honor to recommend Joe to serve the people of our state in this capacity."]["Breaking: @POTUS has \nnominated Lancaster County Attorney Joe Kelly for U.S. Attorney for the District of Nebraska."]["I’m happy to have support from Nebraskans for my #PaidFamilyLeave plan. This would be the #FirstEver nationwide US #paidleave policy. Carrie Lukas VP of Independent Women's Voice on my proposal: https://t.co/6naOu3etQv"][".@pewresearch found that most Americans support a #PaidFamilyLeave policy similar to my proposal. Excited to see it now included in the @SenOrrinHatch’s mark.  #TaxReform @GOPSenateFinance https://t.co/4TEVIx3Akc"]["Today, the #Senate passed the #FY18NDAA with key provisions to restore military readiness, give our troops a pay raise &amp; strengthen missile defense. I worked on this legislation every step of the way. Details: https://t.co/2EGxl5Lo6I"]["#FY18NDAA is headed to POTUS’s desk. This bill will ensure our men and women in uniform have the resources they need to keep us safe. My Senate floor speech: https://t.co/xvHz2mea0l"]["Joined @SandraSmithFox on @FoxNews to talk about my #Historic #PaidFamilyLeave proposal included in #Senate #TaxReform mark. Full interview: https://t.co/iX5ojXSvV2"]["I’ll be joining @SandraSmithFox on @dailybriefing at 2:45 ET to talk about #TaxReform and my #PaidFamilyLeave plan included in the @GOPSenFinance mark. Would be our #FirstEver national #PaidFamilyLeave policy. Tune in: https://t.co/aDhm9Q3Nzq"]["I’m happy to have support from Nebraskans for my #PaidFamilyLeave plan. This would be the #FirstEver nationwide U.S. #paidleave policy. Alison Ritter from Lincoln, NE on my proposal: https://t.co/t6WXGaWWxD"]["My #PaidFamilyLeave policy, included in @GOPSenFinance version of #TaxReform, would be the FIRST EVER national #PaidFamilyLeave policy in U.S. history! #Historic https://t.co/tH98nWjh9x"][".@OWHnews’ @MortonOWH covers my #PaidFamilyLeave plan adopted in current Senate #TaxReform mark. Big step forward for #StrongFamilies! Read here: https://t.co/wcIKBpZWU0"][".@KFXLFoxNebraska on my #PaidFamilyLeave plan, which was included in @SenGOPFinance’s #TaxReform mark. #Historic #StrongFamilies Read: https://t.co/AG1nG4SUKD"]["BREAKING: Thrilled to see Chairman @SenOrrinHatch include my #PaidFamilyLeave plan in the @GOPSenFinance #TaxReform mark. This is a big step towards the first nationwide #PaidFamilyLeave policy! #StrongFamilies https://t.co/cpKwKQnIjL"]["During today’s @SenateCommerce subcommittee hearing on #technology in #agriculture, I asked questions about how #DataDriven farming can help producers increase yields and #FeedTheWorld. WATCH: https://t.co/pvFV9jW4H7"]["Happy to see Vietnam #veteran Bert Crum of Norfolk get the recognition he deserves for serving our country. If you or anyone you know needs help acquiring medals or ribbons, please contact my office. More on Mr. Crum’s story in today's @NorfolkNews: https://t.co/hYyHCF3KEZ"]["The prevalence of diabetes is increasing in Nebraska. Thanks to @GovRicketts for declaring November #DiabetesAwarenessMonth to raise awareness about this life-threatening disease.  #NDAM #StopDiabetes @AmDiabetesAssn @JDRF https://t.co/BUzS5ppnLj"]["TUNE IN: I’m joining @GarySadlemyer live on @KFABnews at approx. 8AM CT this morning. Listen: https://t.co/M5xy1u7eGO"]["Here we go Huskers! #GBR https://t.co/rHhpJ7eYGC"]["Check out my new video honoring #NEVets #ThankaVet #VeteransDay2017 https://t.co/PLWpODjkRU"]["It was good to be in downtown Norfolk today and visit several local businesses, including Tienda Leon, Norfolk Natural Market, Midwest Music, and Roxi’s Bridal. #NEsmallbiz https://t.co/EComZxb7WD"]["Happy 242nd Birthday to the @USMC! Thank you for your #service &amp; #commitment to keeping our country safe. #HappyBirthdayMarines https://t.co/nWJcpXLftN"]["This bill is six years in the making and is the product of more than 70 committee hearings. My priority throughout this process will remain fighting for middle-class families. #TaxReform"]["The release of the Senate tax reform proposal is a key step toward achieving our goals of providing relief for middle-class families, reducing burdens on small businesses, and making America more competitive."]["Headed to the #SenateFloor to challenge the #ABA’s biased rating of Steve Grasz. He is an outstanding Nebraskan and a talented legal mind. Tune in: https://t.co/j3OEIoU1wM"]["I was honored to welcome members of the @NENationalGuard to the Capitol today. Watch my remarks honoring these #NEHeroes on the #SenateFloor: https://t.co/dMMeaVZAyx"][".@LJSdon in @JournalStarNews: \"Fischer says #NorthKorea threat requires nuclear arms modernization\" Full story: https://t.co/WbxvXXNSbl"]["Encouraged to see bipartisan #SESTA legislation unanimously pass @SenateCommerce this AM. This bill would hold websites that facilitate sex trafficking liable and give victims of these horrible crimes the justice they deserve. More: https://t.co/Uji1HJKrTT https://t.co/rV6XECtWOF"]["The @NENationalGuard has seen a lot of change in its history, but one thing remains the same: they stand ready to serve. #ProudNebraskan"]["I’m so proud to have @NENationalGuard visiting our nation’s capital today - I thank them, their families and loved ones who support them, and all of our Nebraska Guard soldiers and airmen for their service. #ThankYouForYourService"]["The men and women of the @NENationalGuard are our neighbors, friends, spouses, sons and daughters – ordinary Nebraskans from every background who decided to put on the uniform and make a difference. #ProudNebraskan"]["When hurricanes tragically struck our neighbors in TX, FL, the Virgin Islands, &amp; Puerto Rico, the @NENationalGuard was there to help. In Texas, the #NEGuard rescued 461 people, delivered 142,000 lbs of cargo, 6,000 lbs of bottled water, &amp; 1,000 lbs of medical supplies."]["At this very moment, you can find #Nebraska’s soldiers &amp; airmen deployed all across the globe protecting the #USA. #ProudNebraskan"]["Saying “no” is not part of the culture of the @NENationalGuard. When the nation calls, there is no hesitation. They go where the mission requires."]["For more than 150 years, the @NENationalGuard has been protecting our state and keeping our nation safe. #Service"]["NOW: I’m speaking on the #SenateFloor to recognize the men and women of the @NENationalGuard. Tune in: https://t.co/6ubYG9Fvc1"]["#NorthKorea is continuing to pursue nuclear warheads and missiles. In our dangerous world, America’s nuclear deterrent must be brought up to date. Read my joint op-ed with @SenDonnelly in @defense_news: https://t.co/rtRibrhtiG"][".@NTVnews covers my #GoldStarFamilies ⭐️bill I introduced as a companion to @RepDonBacon’s legislation. This bill would ensure these families have access to services/benefits as they grieve and honor America’s fallen heroes. https://t.co/UumgSFjPd4"]["Wonderful morning welcoming the men and women of the @NENationalGuard to the U.S. Capitol and thanking them for their service. #ProudNebraskan https://t.co/RyB44CMZHF"]["I cosponsored the bipartisan #DIGITACT w @CoryBooker, which passed the Senate, to spur innovation. Check out these stats about #IoT: https://t.co/JwX7OUDyGB"]["SOON Timothy Hassinger CEO of Lindsay Corp in Omaha is testifying at @SenateCommerce on #IoT in rural America. Watch https://t.co/c9mQg4Bmoj https://t.co/pp8no05q6s"]["I look forward to hearing from Lindsay Corp CEO Timothy Hassinger of Omaha about #IoT in rural America at tomorrow’s @SenateCommerce hearing https://t.co/1Fhu49wYKM"]["Our hearts go out to the Sutherland Springs, #Texas community in the wake of the awful tragedy today."]["Rooting for our @Huskers at the home game today! #NoPlaceLikeNE #GBR https://t.co/6VwsDYtxjK"]["Congrats to two outstanding Nebraskans Karl Elmshaeuser &amp; Nancy Johner on being named NE Dir. for @USDA state agencies. #ProudNebraskan"]["SOON: Looking forward to joining @CobyMach on Drive Time Lincoln https://t.co/DJlUzcU6bb"]["…you can do this too. We love you. We support you. Be confident when you want to step forward to serve your community &amp; your country"]["I want to send a message to every girl wondering about politics and every young woman facing the challenges of starting out in their career…"]["We empower those who have empowered themselves, regardless of their gender."]["These three successful women should serve as role models to girls and boys across our nation."]["The 3 female judges confirmed by #Senate this week, Amy Barrett, Joan Larsen, and Allison Eid, are three more cracks in the #GlassCeiling."]["Nearly 1/2 law school grads are women, but only about 1/3 of federal judges are female. This week the #Senate added three more."]["Speaking on the #SenateFloor about the 3 excellent women confirmed as circuit court judges by the Senate. Watch: https://t.co/QzLs7A5gWR"]["NE producers have a great advocate at USDA in Greg Ibach. More on this in my column in the @NPTelegraph: https://t.co/9q1TQ77qba #NEAg"]["Our police put themselves in harm’s way every day to keep us safe. Thanks ‘Donut Boy’ for spreading kindness in NE🍩 https://t.co/dzujEBKJsT"]["Wishing all Nebraskans a #HappyHalloween 👻🍂 https://t.co/65vlINUFlv"]["Nebraskans are #agriculture leaders. My column discusses what Greg Ibach’s confirmation to @USDA means for US #Ag: https://t.co/oSSx9MSyjM https://t.co/sxX7YQyDvE"]["TOMORROW: My staff will be in Hayes, Hitchcock, &amp; Dundy counties. Stop by with your casework Qs. Details: https://t.co/k0jzIUUm0q"]["Excited to cheer on the #Huskers tonight! #GBR #NE❤️sOurHuskers https://t.co/Dd9Rnw3Kcq"]["@RepAdrianSmith Congratulations to @RepAdrianSmith &amp; Andrea on the birth of their beautiful baby boy, Ezekiel Stephen Smith. So happy for you! #NewNebraskan"]["JUST IN: @NEDeptAg Director Greg Ibach was confirmed as @USDA Under Secretary for Marketing &amp; Reg Programs. My full statement: https://t.co/BFGw9bXZna"]["Neighbors &amp; friends helped a grieving farm family harvest 600 acres – this is what NE communities are about #❤NE. https://t.co/tIsoNeNw5J"]["Read @EPAScottPruitt letter stating he's committed to standing up for rural America when implementing the RFS: https://t.co/XkiWcJKP5J"]["My statement on Senate passage of FY 2018 budget: https://t.co/qX868yLNo6"]["General John Kelly's leadership is a blessing to this great nation. He is a true patriot and a faithful public servant."]["Greg Ibach has made so many contributions to #NEag. I'm happy to see his @USDA nom pass @SenateAgGOP &amp; hope it quickly advances to the floor https://t.co/eMtF8Jz9MY"]["WATCH: @SASCmajority will hear testimony from cyber experts on responsibilities for defending US from cyber-attacks. https://t.co/X0mDNpCOk3"]["Good convo w/ @SenateCommerce members &amp; @WhiteHouse officials today on #infrastructure. #BuildNebraska #BuildUSA"][".@sbstarherald's @IreneNorth reports on an effort I led to protect EAS programs in Scottsbluff, Kearney. Read here: https://t.co/hs4o1lrmnm"]["Productive mtg w EPA Adm Pruitt today. Will continue talks to ensure support for an all of the above US energy policy, including biofuels. https://t.co/m4wXyCyVny"]["Led letter to @SecElaineChao w @SenSasse @RepAdrianSmith voicing concerns about DOT's plan to terminate Essential Air Service 1/2"]["Today &amp; every day we celebrate the Nebraska farmers &amp; ranchers who work hard to #FeedTheWorld. #WorldFoodDay https://t.co/FgwDNHXcE3"]["There’s nothing like #GameDay in Nebraska. Let’s go #Huskers! #GBR https://t.co/jOMD4pd4ua"]["Happy birthday to the @USNavy. Thank you for 242 years of excellent service to our country #242NavyBday ⚓🇺🇸 https://t.co/soRsKCWqbL"]["Happy #NationalFarmersDay! Fun #NEFact: 1 out of every 4 jobs in Nebraska is related to production agriculture. #NEAg https://t.co/Ce7IItyD8H"]["#BeatWisconsin https://t.co/oP2IQFxcm1"]["It’s a privilege to nominate the Phillips family for this year’s #AngelsInAdoption. My full statement: https://t.co/iYfzFuY6ow"]["My bipartisan leg would increase flexibility when complying w #CleanWaterAct reqs for water infrastructure updates https://t.co/w3EZfQw0QG"]["Senate just passed my #WaterInfrastructureFlexibilityAct to provide communities w more control as they work to keep families healthy/safe https://t.co/mNUGZbwipB"]["There’s still more work to accomplish. I'll continue to work w/ Nebraskans to provide the results they deserve: https://t.co/2087yg9Zhq 2/2"]["Honored to be named the 13th most effective senator last Congress by the #CenterforEffectiveLawmaking. 1/2 https://t.co/8w4DOcbS04"]["My full testimony at @SenateAgGOP on behalf of my good friend and fellow Nebraskan, Greg Ibach: https://t.co/dMYXZFwGOZ"]["SOON: I’m introducing @USDA Under Secretary for Marketing &amp; Reg Programs nominee Greg Ibach at @SenateAgGOP. Watch: https://t.co/MAnoV6nkaU"]["Enjoyed our last #NEbreakfast of the year this AM. As @RepAdrianSmith said, every week it’s “history in the making.” #74YearsStrong https://t.co/wmBItzMwQU"]["TUNE IN: We’ll be hearing from Sec Mattis &amp; Gen Dunford about the situation in Afghanistan in @SASCmajority: https://t.co/7lfpVkYXLL"]["Speaking on the #SenateFloor to honor the service of Nebraska Judges Strom &amp; Riley. Tune in here: https://t.co/bBcVJCOOeA #ProudNebraskan"]["Congress has a historic opportunity to revamp our outdated tax code. Read more in my #TaxReform column: https://t.co/RRSCk4H5OL"]["Mourning the loss of those killed in this horrible Las Vegas shooting and praying for the injured."]["#BreastCancerAwarenessMonth reminds us of those fighting this terrible disease, their families &amp; the strong survivors who give us all #hope https://t.co/qQVgDMfqEs"]["It was an honor to welcome the Dawson County #HeroFlight to the #UScapitol yesterday. Read more from @KRVN https://t.co/VREYJRY4zF"]["Having a cup of joe with my mom to celebrate #InternationalCoffeeDay ☕🍩 https://t.co/zv56Y0rhXg"]["Let’s go @Huskers beat the Fighting Illini! #GBR #FridayNightLights https://t.co/YETt9lrulM"]["May you have a peaceful day of atonement and reflection #YomKippur https://t.co/KopiQKs9l3"]["Greg Ibach's @USDA nomination hearing will take place on 10/5 @ 9:30 am ET. More details from the Senate Ag Cmte: \nhttps://t.co/F3bfRJkcio"]["Honored to join @RepAdrianSmith in welcoming the Dawson County #HeroFlight to U.S. Capitol today &amp; thank them for their service. https://t.co/9JVJL6dWrf"]["TOMORROW: Stop by my staff’s local office hours with any questions regarding casework or navigating the fed gov’t. Details below: https://t.co/KBCMzhs3H5"]["The #NEbreakfast always makes US #Senate feel a little more like home. #LoveNE #Tradition https://t.co/umlN3CqFAN"]["Good discussion with #SouthKorea’s Trade Minister Kim Hyun-chong today. #NEAg More: https://t.co/16okEuKKsl https://t.co/EzIZwPt7ci"]["Congratulations to Milford Jr/Sr High School principal Brandon Mowinkel on receiving Nebraska’s #PrincipalOfTheYear award! #ProudNebraskan https://t.co/kBkwEchMJl"]["Happy birthday to my friend Jack Hoffman! You &amp; @TeamJack are an inspiration to all. #BeatCancer #ProudNebraskan https://t.co/A1L5VCouAw"]["#SuicidePreventionDay is in Sept. My column on Congress' actions to address #mentalhealth &amp; #SuicidePrevention: https://t.co/hJ5euDwwfm"]["A few numbers from #TeamFischer’s constituent services so far in 2017! Learn more about our services for Nebraskans: https://t.co/gGxRF6O3ux https://t.co/q0Z8C0WQfC"]["Having issues navigating the federal gov’t? Stop by my staff’s local office hours tomorrow in Saline and Lancaster counties. Details: https://t.co/HGoxaf5WFE"]["Always rooting for our #Huskers! #GBR #NoPlaceLikeNE #GameDay https://t.co/EhGktUYYjO"]["Every effort must be made to isolate #NorthKorea. Read my full statement on new #NoKo sanctions: https://t.co/JsOHvtshQf"]["Our hearts are with Puerto Rico in the aftermath of #HurricaneMaria #PuertoRicoStrong https://t.co/wT5QYY7DM6"]["L’Shanah Tovah! Wishing all who celebrate #RoshHashanah a sweet and good year. https://t.co/viN7xby7FA"]["Nebraska sends our prayers &amp; condolences to #Mexico after this tragic earthquake. #PrayforMexico https://t.co/dpmAbdCHTg"]["This morning I joined @FoxNews’ @ShannonBream to discuss a number of topics including #NDAA &amp; #NationalSecurity. Watch here: https://t.co/Fb4wpmFhTb"]["Ready to talk #nationalsecurity LIVE with @ShannonBream on @FoxNews. https://t.co/URj6HJwtcQ"]["SOON: I’ll be on @FoxNews with @ShannonBream to discuss #FY18NDAA &amp; #nationalsecurity. Tune in @ 9:40AM CT"]["Thx to Elwood, NE native Gary Bodenheimer and other Kidney Community Advocacy Day participants for stopping by my Senate office today. #KCAD https://t.co/vxKjkxzjrM"]["Happy to see #EGOact head to @POTUS's desk to be signed into law. Bill would save taxpayer $ by cutting spending on fancy gov’t portraits. https://t.co/ZDGvf4XCNV"]["Whether on a NE farm road or the NJ turnpike, the bright yellow school bus symbolizes an opportunity for the future. #SchoolBusSafetyMonth"]["The Senate has passed my resolution w/ Sen. @CoryBooker designating September as #SchoolBusSafetyMonth https://t.co/0LULyUXdt2"]["My column on the #FY18NDAA &amp; provisions I worked on to strengthen our military, #missiledefense &amp; cybersecurity: https://t.co/MBdMtaQEHB"]["#NorthKorea is actively pursuing long-range ballistic missiles- #NDAA focuses on modernizing America’s #NuclearForces to keep Americans safe https://t.co/T8NRgmNcBh"]["#FY18NDAA will address unfunded needs of space operations, critical investments to ensure US forces stay ahead of tomorrow’s threats https://t.co/HBu6B5gWYL"]["As chair of @SASCmajority #StrategicForces Sbcmte, I was proud to work on #FY18NDAA provisions to strengthen #MissileDefense https://t.co/KoeFLfu5DE"]["#Bipartisan #NDAA passed by the #Senate prioritizes #cybersecurity, adding more than $700 million for cyber-related requirements https://t.co/H25gkJWxQ3"]["Senate passed #NDAA to ensure our military has the resources it needs to take on missions of today. Details here: https://t.co/xQgazEnae6"]["Today we celebrate 70 years of the greatest #AirForce in the world. #HappyBirthday @USAirForce! https://t.co/7JtflOsmzJ"]["Our future is bright because of our nation’s strong foundation. #ConstitutionDay https://t.co/3f8bJi6Vb8"]["It’s game day! #GBR #HUSKERS @HuskerFBNation https://t.co/6hDxqyEhzf"]["Proud to cosponsor #PCHETA – bill to help NE patients struggling w/ serious illnesses like #Alzheimers &amp; #Cancer https://t.co/AOkLXKOkcm"]["I’m glad to see the Trump admin take action to speed up environmental reviews for #infrastructure projects. More: https://t.co/buUkJN2S5v"]["On #POWMIARecognitionDay we honor the sacrifice of our POW/MIA heroes &amp; their families. Those who never returned home are #NotForgotten https://t.co/QSk5xbXIHj"]["This is a strong bill that will strengthen our military. It will help ensure the military can protect our nation in a world of challenges"]["This bill upholds the bipartisan tradition that has characterized the #NDAA, which has enabled it to pass 55 years in a row."][".@SASCmajority also added over $700 million for cyber-related requirements like first-ever Cyber Posture Review"]["I’m proud of the strong provisions the Strategic Forces subcommittee contributed to the bill before us today."]["Jurisdiction of the #StrategicForces also includes outer space. We added over $700 million to address unfunded needs for space operations"]["In #StrategicForces SubCom, which I chair, we authorized an additional $200 million to improve the GMD system. #MissileDefense"]["#NDAA authorizes the resources our men &amp; women in uniform need to respond to these crises and do the job the nation asks of them."]["But, the #NDAA is more than just answering these threats. It’s about helping us here at home, too."]["The global turmoil of today highlights why the #NDAA bill before us is so important."]["We remain a nation at war, with thousands of men and women in uniform still deployed to the Middle East and Afghanistan."]["#NorthKorea is relentlessly pursuing long-range ballistic missiles capable of carrying nuclear warheads to our shores."]["The number and complexity of threats we face today is unprecedented."]["It was approved unanimously by the @SASCmajority committee: all 27 of our members voted for it."]["WATCH: I’m speaking on the #SenateFloor regarding #NDAA &amp; #STRATFOR provisions. Tune in: https://t.co/BXSw6gTjZ6"]["My statement on Sec. Mattis’ visit to STRATCOM today: https://t.co/3jD6446mtN https://t.co/68XL3jbsyE"]["Enjoyed meeting w/ @NEporkproducers today. We are excited about the recent trade deal with Argentina expanding market access opportunities! https://t.co/xFH3Fb27ei"]["Gave an update on the #Senate to a full house at the #NebraskaBreakfast this morning. #LoveNE #Tradition https://t.co/sJcKxf6KK7"]["Important read in @OWHOpinion today on nuclear modernization and its critical role in keeping Americans safe: https://t.co/h7WfhN3C9i"]["Though threats to our way of life have &amp; will continue to evolve, our enduring commitment to defending freedom will never waver #NeverForget"]["NE is honored to host the @US_Stratcom, &amp; we are proud of the excellent work they did during the attacks of 9/11 to protect our country."]["At 1:50PM #AirForce1 landed at @Offutt_AFB with President George W Bush. For 2 hours @US_Stratcom was the center of U.S. nat’l defense"]["As the day unfolded, @US_Stratcom received notice that the “secure location” the president would be using was @Offutt_AFB"][".@US_Stratcom worked to identify which planes had been hijacked &amp; monitored the landings of thousands of civilian aircraft."]["When the 2nd plane hit on 9/11, @US_Stratcom understood this was not a fictional threat: America was under attack"]["The main purpose of the exercise was to test the military's command and control procedures in the event of nuclear warfare."]["On #September11th 2001, at @Offutt_AFB, @US_Stratcom staff woke up expecting to continue a training exercise"]["Sixteen years after the terrorist attacks our nation unites once again to honor the Americans killed on that horrific day."]["SOON: I'll speak on #SenateFloor about #September11th &amp; the significant work of @US_Stratcom during the attack: https://t.co/LjzBQmenLH"]["Agriculture production is the economic engine of #Nebraska. Read more in my column on #NEag here: https://t.co/WGtLL2lsG4"]["It’s #GameDay in Nebraska! #GBR #NoPlaceLikeNE @HuskerFBNation https://t.co/GjRAziVoPX"]["Terrific meeting with folks from the @NEFarmBureau Leadership Academy today. These young men &amp; women are the future of #NEag. #FutureLeaders https://t.co/Pldm2YbLJG"]["Great to see the Fast family (with a few more additions) again at the #NebraskaBreakfast this morning! https://t.co/4I4tofuIvc"]["Today I asked POTUS to uphold #KORUS \n\nRead my letter here: https://t.co/MIbRkJcnQp #NEAg"]["Had a fantastic August meeting with Nebraskans from all around our state. More in my column: https://t.co/gzpq4u6Xpd #HearingFromYou"]["Introduced the Fast family from Omaha to #FredFischer before their Capitol tour today. #FastFriendsWithFred https://t.co/M84RI1PTwo"]["This #LaborDay we celebrate American workers, their incredible work ethic &amp; their countless contributions to the strength of our nation. https://t.co/FVerGljFYG"]["...to possess a viable nuclear weapon, which is why I remain committed to strengthening our missile defense to defend against this threat"]["Without significant international action, it’s only a matter of time before #NorthKorea overcomes the technical challenges remaining..."]["...it is a significantly more powerful nuclear device than those used in Pyongyang's previous tests."]["We are awaiting further technical details, but early reports indicate..."]["The nuclear test conducted by North Korea today is very troubling."]["\"Strong and dependable crop insurance remains one of the best tools to help our ag producers plan for the future.”\nhttps://t.co/nRgVzyyh9k"]["Excited for the first #Huskers game of the season. #GBR https://t.co/aVlyNOtJJM"]["Congrats to NE Director of Ag Greg Ibach on his nomination to undersecretary of @USDA. Great choice!  #ProudNebraskan"]["Proud of the Nebraskans rescuing folks from a nursing home flooded by #HurricaneHarvey. @journalstarnews: https://t.co/cCddiJUGqr"]["Hope that everyone is enjoying the #NebraskaStateFair - one of my favorite #NETraditions. https://t.co/OwYLTPGfRV"]["This week, I will continue my Listening Session tour with a stop in Lincoln. Details: https://t.co/qYWTl8CYUs"]["Today I checked in with folks in Nebraska City during a roundtable discussion about #EconomicDevelopment #HearingFromYou https://t.co/WaQjcOs2E0"]["Roads are more than lines on a map. They are a vision for the future. Read more in my column: https://t.co/p9K389CjwV"]["Check out @SecElaineChao's blog on her visit to Nebraska last week: https://t.co/ZAURiJHabg #Infrastructure"]["#Infrastructure is the backbone of America. It's what keeps us moving every day while supporting our #economy &amp; #nationalsecurity"][".@SecElaineChao and I recently discussed #infrastructure w/ NE transportation experts in Omaha"]["Grateful for our first responders and community volunteers' heroic efforts in rescuing and assisting those in need."]["Praying for all those facing destruction from #HurricaneHarvey"]["I hope to build on our productive discussion as I continue to bring #Nebraska ideas to the #Senate https://t.co/kVSgIL7pHo (2/2) https://t.co/txLd4oIlfz"]["I was pleased to welcome @SecElaineChao to #NE to discuss our state's unique successes and challenges (1/2) https://t.co/Gu44YssYKG"]["Check out my joint Op-Ed with @SecElaineChao in today’s @OWHnews: https://t.co/7g6l7PxF0F"]["My statement on President Trump's #AfghanStrategy: https://t.co/r4cOiMpdEz https://t.co/7tYEWPHkl0"]["Today we saw a breathtaking moment in the NE skies. Read more about #SolarEclipse2017 in my weekly column: https://t.co/slRaNCFqAa"]["Welcome to all those visiting NE for the #SolarEclipse2017. Be sure to enjoy safely! https://t.co/5HQ2gSsnJt"]["Keeping the American sailors serving on the USS John S McCain in our prayers. Thanks to all those working hard on the rescue mission efforts"]["This expressway will provide a new pathway for our state’s producers to bring their world-class products to market and feed the world. 2/2"]["Proud to attend the Heartland Expressway dedication today in Alliance. 1/2 https://t.co/Reuughqh9z"]["Early start this AM in Scottsbluff! Met with folks from @LeadershipNE, then stopped by to chat w/ Kevin Mooney at @KNEB radio #NEPanhandle https://t.co/nLmvr25FZ9"]["Last night I had a great #EconomicDevelopment roundtable with biz &amp; community leaders in Scottsbluff. #HearingFromYou https://t.co/SiDRQaUM9I"]["TUNE IN: I'll be joining @KNEB radio this morning around 7:30am MT to give a Senate update. https://t.co/5TMpXYuFh0"]["I applaud the administration for negotiating a deal w Argentina to expand market access for NE’s pork producers. https://t.co/tJR2we0zdS"]["Kicking off my next Listening Session in Sidney. It’s a great day to visit with folks in the NE Panhandle. #HearingFromYou #WesternNebraska"]["Heartbroken to hear there was yet another terrorist attack today. My condolences to the victims &amp; the people of #Barcelona."]["En route to Kimball for a Listening Session where I will hear from Nebraskans &amp; give a Senate update #OnTheRoadInNE #WesternNE"]["Thank you to my summer interns for their service to Nebraska! More in my weekly column: https://t.co/VWz8YPmJrc https://t.co/StH3zLbG6d"]["The hatred, violence &amp; racism displayed in Charlottesville, VA have no place in our society. We must show civility &amp; respect to one another."]["Spent this afternoon in Holdrege at the Feed My Starving Children MobilePack. #GreatCause #OnTheRoadInNE @fmsc_org https://t.co/gLLCGrMQgR"]["About to begin a roundtable discussion focused on agriculture in Minden, NE. #NEag #FeedTheWorld #HearingFromYou"]["Getting ready to hear from Nebraskans during an economic roundtable in Red Cloud. #HearingFromYou #NEbiz"]["Ready to start a #ListeningSession in Hebron &amp; hear what's on the minds of Nebraskans in this community."]["Bruce and I are sorry to learn of Rose Ann Sadlemyer's passing. Our prayers are with @GarySadlemyer &amp; his family during this difficult time"]["Happy to be in Geneva for a #ListeningSession this afternoon. I always enjoy these productive discussions w Nebraskans! #OnTheRoadInNE"]["Thanks to Pizza Kitchen in Milford for hosting today's Chamber Luncheon! #LoveNE #NEBiz #Yum https://t.co/6oCk6EqzCy"]["Good to visit w folks from the Milford Chamber of Commerce &amp; discuss my work in the Senate. #HearingFromYou #OnTheRoadInNE https://t.co/GEjamK5FlX"]["It was an honor to pay tribute to Army Cpl. Matthew Alexander of Gretna, NE. He is a hero. More from @GretnaBreeze: https://t.co/dEiPWaFnMB"]["Enjoyed giving a U.S. Senate update this morning at the @NebraskaChamber Federal Legislative Summit. #OnTheRoadInNE #LoveNebraska https://t.co/a49vVvmYiK"]["If this is true, #NorthKorea is a step closer to being able to carry out an attack on the U.S. https://t.co/2mjDddAZIp"]["Soon I’ll start my next Listening Session in Bassett. It’s a great day to visit with Nebraskans in Rock County.  #LoveNebraska"]["On the way to Ainsworth for my Listening Session with Brown County residents this AM. Looking forward to #HearingFromYou #OnTheRoadInNE"]["My statement on PenAir: https://t.co/yz0ji8GtHx https://t.co/IaZ9ZCN235"]["@1011_News Don’t miss these words of advice on life together at age 100 from Nebraskans Maurice &amp; Jean. #TheGoodLife #ProudNebraskan"]["My column on 3 Senate-passed #bipartisan bills I championed to keep Nebraskans safe &amp; update our telecomm. laws: https://t.co/yHSuqxslll"]["On #PurpleHeartDay we honor those who have been wounded or killed in the line of duty. #Bravery #Honor https://t.co/smlBPX0aCE"]["Wonderful time visiting w folks at Cotner Center in #LNK today. One of the residents, Lillian, is 105 this year! #GreatestGeneration https://t.co/Sbb8oyliSM"][".@JournalStarNews: “Steve Grasz nominated as U.S. Circuit Court judge” Read more: https://t.co/BySY37Nppz"]["In Omaha this morning speaking at the @UnionPacific NE Express 150th Birthday Breakfast. #OnTheRoadInNE https://t.co/8AeWK91NdW"][".@OWHnews on Senate passage of my #DIGITact, #KarisLaw &amp; Spoofing Prevention Act #BipartisanSolutions: https://t.co/o1d6ObNTkG"]["Joining @GarySadlemyer live at ~7:35 am CT to talk #NorthKorea &amp; missile defense. Tune in to @kfabnews! https://t.co/nrrKd30a4S"][".@POTUS has nominated Steve Grasz, an outstanding Nebraskan, to serve on US Court of Appeals for the 8th Circuit \nhttps://t.co/VKYvCbDu07"]["Through the #SpoofingPreventionAct, Congress can protect the most vulnerable in our society from fraudulent scams. 4/4 https://t.co/VYGS3uSeLf"]["Being able to quickly reach 911 in an emergency can save lives; #KarisLaw would ensure families can call for the help they need. 3/4 https://t.co/hpJGGz0IaE"]["The #DIGITact would open up lines of communication between the private and public sector to spur innovation. 2/4 https://t.co/Qh1aNUIs8f"]["GOOD NEWS: DIGIT Act, Kari’s Law, &amp; Spoofing Prevention Act all just passed the #Senate. https://t.co/i5ks5laUIY 1/4"]["We must change our strategy to protect Americans. Secondary sanctions and enhanced #MissileDefense should form the basis of our approach."]["“no good options” is frequently repeated when confronting the NK threat. This may be true, but the gravity of the situation demands action."]["I plan to hold hearings in @SASCmajority #STRATFOR subcmte to examine #administrations #MissileDefense review proposed way forward."]["The #administration is conducting the first review of ballistic missile threats &amp; our missile defense posture since 2010 #MissileDefense"]["Deploying more interceptors would add capacity and enable our defenses to better handle ICBM threats #NorthKorea"]["Rate of NK’s technical progress demands response eg additional ground-based radars &amp; space-based sensors to impve ability to track threats"]["As chairman of @SASCmajority #STRATFOR subcmte I work w #MissileDefenseAgency directors &amp; STRATCOM commanders to impve our #MissileDefense"]["We cannot rely on deterrence alone. We must ensure that our missile defense efforts stay ahead of #NorthKorea's accelerating developments."]["The Chinese view #NorthKorea through a narrow lens of immediate strategic interest. That is how we must target our actions."]["One thing is certain: the principle economic enablers of #NorthKorea are China and Russia."]["NK ICBM developments reveal sophisticated program that is pursuing weapons designed for no other purpose than to threaten the U.S. &amp; allies"]["Last month NK conducted 2 ICBM tests. A number of reports say the 2nd test demonstrated sufficient range to reach much of the United States."]["TUNE IN: I will speak on the floor regarding the #NorthKorea threat &amp; U.S. missile defense. https://t.co/bYKRseNmCL"]["In today’s @OWHopinion I share my thoughts on the #NorthKorea threat &amp; our nation’s missile defense. Read more here: https://t.co/av9cAxlmmf"]["Our #bipartisan #bicameral bill will positively impact people’s lives and help make #paidleave available to more Americans https://t.co/wQPSkafqjm"]["Intro'd new version of #paidleave bill I’ve worked on for years w @SenAngusKing  @RepTerriSewell @MikeKellyPA https://t.co/VFOmWhAQbO"]["Corporal Matthew Alexander is truly a hero. He served with compassion &amp; respect. It is an honor to tell his story. #NEheroes"]["As Matthew’s father Mel put it, “Matthew had two passions, music and the military.”"]["To honor Matthew, his family established Matt’s Music Memorial. The charity helps children who love music but can’t afford an instrument"]["Corporal Alexander was laid to rest on May 18, 2007 in Nebraska. Over 1500 people attended to say their final goodbyes."]["When Mathew returned to Baqubah, Iraq his unit encountered fierce fighting likened to the close-quarters combat of #Vietnam."]["He returned home from combat and in February of 2007 married his childhood sweetheart, Kara, on Valentine’s Day."]["Matthew’s unit deployed to Mosul, Iraq where they assisted with the training of the Iraqi militia #OperationIraqiFreedom"]["Matthew enlisted in the Army shortly before graduating from Gretna High School in May of 2004 and shipped off to Basic Training that summer"]["Matthew always wanted to be a soldier, but the 9/11 terrorist attacks further solidified his desire to defend our country. #USA"]["Today I rise to honor the life &amp; service of Army Corporal Matthew Alexander, a native of Gretna, Nebraska. #NEheroes"]["SOON: Continuing my tribute to #NEheroes on the #SenateFloor. Watch live: https://t.co/RJtEiaOVPO"][".@POTUS just issued a Major Disaster Declaration for NE to help our communities recover from June’s storms https://t.co/q61fdFDuoB"]["#Eclipse2017 is coming &amp; it might be one of the biggest events in NE history. @OWHnews w eclipse tips: https://t.co/CjnkLKBNuX"]["Led #NEdelegation in letter to @POTUS requesting a disaster declaration following last month’s storms: https://t.co/toZDlCl5tS #Rebuilding"]["My statement on today’s North Korea missile test-launch: https://t.co/KItaSH8Xvx https://t.co/INgAgCgNWw"]["My statement on the Senate's Obamacare vote: https://t.co/xeBj7JYKax https://t.co/2E2MdYkPNc"]["Members of Congress shouldn’t get a special deal. I’m a cosponsor of @SenRonJohnson amdt to eliminate exchange benefits for reps. &amp; senators"]["Nebraskans have until August 28, 2017 to send in comments on the @EPA’s new proposed rule. Submit your comment here: https://t.co/pmOBBmHzwj"]["Good news: @EPA formally proposed withdrawal of #WOTUS rule. This misguided policy would have hurt all Nebraskans https://t.co/ekjuQeD4eO"]["Met w a great group of young Nebraskans visiting the Senate w @ALBoysNation &amp; #GirlsNation to see firsthand how gov works. #ProudNebraskan https://t.co/LHPISbkSnc"]["Wonderful discussion w @JDRF #T1D advocates Jackson, Sadie, Maddie &amp; Sawyer during their Children’s Congress trip. #JDRFCC17 #FutureLeaders https://t.co/2Zq6ZGsh2Z"]["Took time to thank our summer interns at the #NEbreakfast. Thanks to Amanda, Justus, Molly &amp; all NE delegation interns for your hard work! https://t.co/nN3wOsZWfd"]["In this week’s column, I discuss my efforts to preserve the legacy of #NEvets with the #VeteransHistoryProject  https://t.co/WFpIYBYoKd"]["Enjoyed touring @TandTNews facility today. They're doing great work to help Nebraskans navigate global travel in a changing world. #IoT https://t.co/5nZHG5i95T"]["Wonderful visit to the Intercultural Senior Center in South Omaha today. I enjoyed learning about the center's variety of programs/services. https://t.co/bxu2yc9UyF"][".@SenJohnMcCain is a national treasure in every sense of the word. Bruce &amp; I have no doubt he'll take this on with strength &amp; resilience."]["Delivered stories of 20 #NEvets to the Veterans History Project today. Thanks @LibraryCongress for preserving these pieces of history https://t.co/MfpfY13SG9"]["I agree https://t.co/esLkTMzUpn"]["Good to meet today with Lt. Gen. Sam Greaves in his new role as Director of the Missile Defense Agency. More: https://t.co/9kUd7dJLwt https://t.co/GftLO9nTp9"]["Asking Qs now at @SenateCommerce hearing on the nomination of @AjitPaiFCC, @JRosenworcel, &amp; @BrendanCarrFCC WATCH: https://t.co/421T7kKFbT"]["The #NebraskaBreakfast is a great way to get updates from your NE delegation. More info on future breakfasts here: https://t.co/A9iD6aFo9W https://t.co/RVc9rdMS0b"]["Happy 60th b-day to @ValentinosPizza the best pizza around! Wonderful to see this fabulous #LNK business thriving https://t.co/IEqPpU258C🍕"]["Taking a quick #selfie with @BoyScouts from the Omaha area who are part of Mid-America Council Troop 2331. #Scouting https://t.co/HeiKHx16uR"]["Was happy to welcome my friend Jim Mullen and his family to the U.S. Capitol today. https://t.co/ilveKivgCS"]["A productive meeting w @NEFarmBureau young farmers and ranchers this afternoon. These folks are the future of #NEag https://t.co/IJyZjANEMX"]["In this week’s column, I discuss my efforts to cut gov’t #redtape so more Nebraska families can thrive. Read: https://t.co/4tjMOkuSVW"]["Wishing my friend @SenJohnMcCain a swift recovery."]["Good read in @OWHopinion today on the growing #NorthKorea threat &amp; my work on @SASCMajority to address it: https://t.co/XEhjjTpSro"]["Tomorrow my staff will host office hours in Cedar and Pierce counties. Stop by for answers to your Qs. More: https://t.co/Ijp9hI81Gt"]["I’ll be asking Qs at @SenateAging hearing on proper nutrition for older Americans. Watch: https://t.co/wouRKS0lVD"]["Another successful Nebraska Breakfast! One of NE’s greatest traditions since 1943. #LoveNE https://t.co/ozmFN3DZTH"]["My statement on August in the Senate: https://t.co/Uc6EGhqQrb"]["THAAD plays a key role in our layered missile defense system against evolving threats like #NorthKorea."]["Congratulations to our military on another successful THAAD intercept test. https://t.co/asG8ZzyMgK"]["#Senate just confirmed Neomi Rao as #OIRA Administrator. I’m continuing my efforts to #CutRedTape. More: https://t.co/WzsoNauQgt https://t.co/ZLBOQC8HlP"]["Thanks to our interns Seth, Molly, and Justus for all their hard work! More info on #TeamFischer internships: https://t.co/tJBaBkEf3L https://t.co/J7npLBVwcy"]["Read my weekly column about #NorthKorea &amp; the growing threat of its rogue regime: https://t.co/VwITBKt3fo"]["TOMORROW: Need help navigating the fed gov’t? My staff will host local office hours in Furnas/Harlan counties tomorrow. More: https://t.co/ekxJeRzq6G"]["Proud to be at ribbon cutting for Hwy 133 in Blair made possible by the Build Nebraska Act. #LoveMyRoads #LB84 #BuildNE https://t.co/8sE7uGnXBS"]["Enjoyed talking with folks about local economic development during my roundtable in Tekamah this afternoon. #LocalBiz #LoveNE https://t.co/b8KcgkfjFi"]["Lovely trip to the Blair Library. Wonderful part of a great Nebraska Community. #SummerReading https://t.co/2OcHH0Pz1E"]["Proud to at ribbon cutting for Hwy 133 in Blair made possible by the Build Nebraska Act. #LoveMyRoads #LB84 #BuildNE https://t.co/ynXBBLYxG6"]["Informative convo w community members &amp; business owners at roundtable in Columbus, NE this afternoon. #LoveNE #EconomicDevelopment https://t.co/bTn4q6SyOw"]["Great visit in Ashland, NE! Started the day w an economic roundtable at Ashland Pharmacy &amp; toured Cheri O’s. #SmallBiz #LoveNE https://t.co/NA78tmWJbP"]["Happy #FourthofJuly! Today we celebrate our great nation &amp; the values we all share. #IndependenceDay https://t.co/ChcUzMp8As"]["In this week’s column, I celebrate NE’s history, our shared American values, and #IndependenceDay: https://t.co/xmknDOzFtO https://t.co/q0ms34FpXU"]["It was a pleasure to greet @NationalFFA students from Sargent, Ord, and Gothenburg today. #FutureLeaders #LoveTheJackets https://t.co/Ht6wq5nlOC"]["TUNE IN: I’ll be on @kfabnews @ 7:35 a.m. CT. Listen live here: https://t.co/CxCB95BDrK"]["My statement on @SASCMajority passage of this year’s NDAA. More: https://t.co/2tIb40pRFB https://t.co/K6e6jSlFr6"]["Joined letter urging @USTradeRep to strengthen ag trade in upcoming NAFTA negotiations. More: https://t.co/LsClUJ7T5s #NEag #FeedtheWorld"]["Spent the morning with a great group of Nebraskans at the #NebraskaBreakfast. #LoveNE #Tradition https://t.co/uGSmVr1QA1"][".@TheIndependent: “Smith, Fischer applaud plan to repeal #WOTUS” Read more: https://t.co/ywZA3Gp2uD"][".@EPA took important step twrd a full removal of harmful #WOTUS rule. All in NE would be affected by misguided rule https://t.co/nMVoUhBM7S"]["Not all combat wounds are visible. The #PAWSact would help provide #vets suffering from #PTSD with service dogs. #PTSDAwarenessDay https://t.co/er11mWIt7w"]["Bruce &amp; I send our condolences to @JeffFlake on the loss of his dad. I pray cherished memories bring you comfort during this difficult time. https://t.co/mJqeBEI4mr"]["In this week’s column, I discuss my work to protect access to air travel for NE &amp; ensure EAS remains in place. Read: https://t.co/0yC91OEDrl"]["Read about my work to protect #EssentialAirService, a critical program for NE, in today's @TheIndependent editorial https://t.co/Ok69N0fKYS"]["It was wonderful to welcome my old friend Don Olson and his family to the Senate this afternoon. #LoveNE https://t.co/UjfBOesnH0"]["Had a great time speaking with Kearney @CloseUpDC students and introducing them to Fred #NEstudents #FunWithFred https://t.co/cfryTSheNl"]["I always look forward to the #NebraskaBreakfast. #LoveNE https://t.co/RGgpY3MLpm"]["Great mtg w/ @IvankaTrump today on the challenges working families face. Look fwd to continuing to work together https://t.co/6swrgTW13R"]["Congrats to NE’s @usedgov 2017 Presidential Scholars. I’m always impressed w #NEstudents &amp; their passion for learning. #Leaders https://t.co/R5SHQktZk7"]["Today I led a bipartisan letter to @SecElaineChao abt concerns for cuts to the EAS program. #RuralCommunities More: https://t.co/3sHQ0x0J85"]["My E15 bill would increase economic opportunity &amp; expand consumer choice at the pump. More in my weekly column: https://t.co/ycNrRTBDrv"]["There is no place for this kind of hate in our communities: https://t.co/h0oifTLQDp"]["REMINDER: Stop by my staff office hours in Dawes and Sioux counties tomorrow for answers to your casework questions. https://t.co/Tz5bgWVOAy"]["It's wonderful to see communities coming together to help friends &amp; neighbors clean up. #Recovery #ProudNebraskan"]["Thank you to all the first responders and those who are working hard to get power restored and address the damage."]["My heart goes out to the Nebraskans whose lives have been disrupted by Friday night's storms."]["My Dad supported, loved, and inspired me every day. #HappyFathersDay to all the great Dads in Nebraska! https://t.co/mqqMS4lz6k"]["It’s that time of year again! Ready for another great @NCAACWS #collegeworldseries #RoadToOmaha https://t.co/SBRipjc7pW"]["In Omaha this morning holding a Listening Session at Metropolitan Community College. #HearingFromYou https://t.co/O6pz48JWOE"]["I’m a cosponsor of @SenatorTimScotts’s #LEAPACT- would match workers w/ jobs by offering tax credits to biz who hire &amp; train apprentices 3/3"]["Look forward to working w/ @POTUS &amp; my colleagues in Congress to strengthen our workforce. 2/3"]["I welcome exec. order @POTUS will announce today to expand apprenticeships. Our country has a skills gap problem. 1/3"]["Tomorrow my staff will host office hours in Nuckolls and Webster counties. Stop by with your questions. https://t.co/1GrA1l8zAC"]["Celebrating 242 years of the @USArmy’s dedicated service today. Thankful for the sacrifices made by our soldiers &amp; their families. #ArmyBDay https://t.co/nCs1c8cUtC"]["Video of my full testimony on my renewable fuel bill at today’s @EPWGOP hearing: https://t.co/P7Kdv05GjH"]["In @EPWGOP today, we discussed my E15 bill, which would create economic opportunities &amp; expand consumer choice @ the pump. #RenewableEnergy https://t.co/fwLspVxdbn"]["Today and every day the stars and stripes unite us #FlagDay https://t.co/v5NwPf5lyE"]["Watch @EPWGOP hearing on my renewable fuels bill to increase economic opportunity &amp; expand choice for consumers: https://t.co/7RYtmAIjYU"]["Also saying prayers for the two @CapitolPolice officers who were wounded during this terrible incident."]["Praying for @SteveScalise and the others injured at baseball practice in Alexandria, Virginia this morning."]["I’ll be hosting a #ListeningSession this Friday in Omaha. More details here: https://t.co/5vstbmy6Qh"]["New @USTreasury report confirms structural adjustments in my @CFPB reform bill would restore needed accountability https://t.co/Xrtrl3RD3E"]["REMINDER: Tomorrow my staff will be in Gage County to answer your casework Qs. More info: https://t.co/djf4p3Sluv"]["Asking questions at @SASCMajority hearing with Sec. Mattis &amp; Gen. Dunford. Watch: https://t.co/HrkICprDIb"]["In @SASCmajority today we’ll hear testimony from Sec. Mattis &amp; Gen. Dunford on #DoD budget for FY18. Tune in: https://t.co/1HEKgJktZg"]["Today’s agreement with China expands opportunities for NE beef producers &amp; helps them #FeedTheWorld. More: https://t.co/Q8JMjBzULi"]["Last week, the Senate passed a VA Accountability bill to help ensure #vets get care they deserve. More in my column: https://t.co/zPi9RMuceb"]["Wishing a happy 93rd birthday to President @GeorgeHWBush today! His dedication to our country is inspiring. #HBD41 https://t.co/NrchT640Q6"]["Today I intro’d #RECOUP act with @Sen_JoeManchin. Bill would give @USTreasury authority to recover unclaimed assets. https://t.co/XNxkxMU5MV https://t.co/n2DH5TW4dZ"]["Watch my exchange w @SecElaineChao at @SenateCommerce. We discussed importance of Essential Air Service for rural NE https://t.co/1r0NhJomzn"]["Chairing @SASCMajority Strategic Forces Subcmte hearing on DoD nuclear acquisition programs &amp; the nuclear doctrine https://t.co/y8yBmlcKjK"]["Today marks the 50th anniversary of the reunification of Jerusalem. The Senate unanimously passed a res commemorating this special occasion. https://t.co/UNU6ZJPQM8"]["NOW: Asking Q’s at @SenateCommerce hearing on @FAAnews reauthorization with @SecElaineChao. Watch: https://t.co/onbt7Cy62Q"]["Had a great time welcoming my NE neighbors &amp; @4H members at this morning’s #NEbreakfast #FutureLeaders https://t.co/1y46lzmpFW"]["#VAaccountability Act has passed the Senate. Bill addresses management failures @ VA &amp; helps vets get better care https://t.co/E2Prwe3Rke https://t.co/gUXp2eDCwV"]["Glad to see the conversation on #paidleave continuing. Let's keep exploring solutions that will make life easier for American families 2/2"]["Thx to @AEI &amp; @Brookings for hosting an event on #PaidLeave today &amp; including my #StrongFamiliesAct in the discussion of policy options. 1/2"]["Remembering the bravery &amp; sacrifice of the Allied troops who fought to liberate a continent 73 years ago #DDay #GreatestGeneration https://t.co/rg2Fcw6A9r"]["Looking fwd to hearing from @SecAFOfficial &amp; @USAirForce CoS Gen. David Goldfein in @SASCMajority today. Watch: https://t.co/yxKR4BkhtC"]["In this week’s column, I discuss steps I’ve taken to provide relief to Nebraska families who #FeedtheWorld https://t.co/EgS5woMmGr #FUELSAct"]["My statement on today’s successful U.S. defense missile test: https://t.co/N6xOjt52jX https://t.co/XE9sMa6OPL"]["Stopped by the Blair Rotary Club to give an update on my work in the Senate &amp; hear what’s on their minds. #OnTheRoadInNE #LoveNebraska https://t.co/znDSZK32oz"]["I was honored to join Nebraskans in Columbus today at a Memorial  Day ceremony organized by the American Legion. #MemorialDay17  #GodBless https://t.co/9GuE3XhRqe"]["Our freedom was earned through the courage, patriotism, and extraordinary sacrifice of our fallen heroes. #MemorialDay #USA https://t.co/LcKWp4Kpoz"][".@NEFarmBureau agrees my #FUELSact will alleviate harmful regulations for NE farmers/ranchers. Hear more: https://t.co/vObq38plWp"]["Always a highlight meeting with #NEstudents! Today I talked w students from Fremont HS, Crofton Community School &amp; York HS. #FutureLeaders https://t.co/2ynutHciZu"]["Chairing @SASCmajority #StrategicForces subcommittee hearing on @ENERGY atomic energy defense activities &amp; programs https://t.co/NdyZJSMau2"]["Read more on my bill to address regs for on-farm fuel storage in the North Platte Bulletin: https://t.co/nFnmyujGSu  #FUELSAct #agriculture"][".@KTIC Radio: \"Fischer Reintroduces Bill to Lift EPA On-Farm Fuel Storage Burden\" Read more: https://t.co/20eYRKkmK2 #FUELSAct #NEAg"]["Today I delivered remarks on the #SenateFloor focused on the importance of strengthening #USinfrastructure. Watch: https://t.co/lIbstvyt1W"]["TUNE IN: Headed to the Senate floor to speak about #infrastructure and NE #transportation priorities. Watch: https://t.co/ijGSgoLro6"]["The #NEBreakfast gives us a taste of #TheGoodLife on Wednesday mornings. Thank you to all the Nebraskans who stopped by today. #LoveNebraska https://t.co/HFMMBWQbPH"]["Discussing worldwide threats w DNI Dan Coats &amp; DIA Director Lt Gen Vincent Stewart in today's @SASCmajority hearing. https://t.co/35dS0j8zAu"][".@SbStarHerald covers my NE ranchers roundtable with @SecretarySonny, where we talked #NEag priorities. Read: https://t.co/prhByfWasR"]["Sending my heartfelt condolences to the innocent victims of the #Manchester attack and their loved ones. We stand w our friends in the U.K."]["My column on Saturday’s rancher roundtable in Cherry County w/ @SecretarySonny &amp; my friends/neighbors: https://t.co/Rf2qLwmGjY #LoveNE https://t.co/2rRgBF3WfY"]["Tomorrow my staff will host local office hours in Chase and Red Willow counties to answer your casework Qs. Time and location details: https://t.co/f2utBwLKgy"][".@dcexaminer on how the #WaterInfrastructureFlexibilityAct would help keep families healthy &amp; safe: https://t.co/Hoz5z97vu8"]["So proud to have @SecretarySonny at the Fischer Ranch today to meet our friends &amp; neighbors #LoveNebraska https://t.co/gqML7zx5tN https://t.co/RZSLSPs0LS"]["Bruce and I are excited to welcome @SecretarySonny to Cherry County today. Read more in my op-ed in @NorfolkNews: https://t.co/FudrzNSMhZ"]["Thank you to all those who have served to protect our freedom #ArmedForcesDay #USA https://t.co/8VvzYT05De"]["Giving the keynote address at the Women's Energy Resource Council Leadership Forum. #WomenLeaders #USEnergy https://t.co/ou0Q7WA3ds"][".@UNL students were chosen to participate in #MicrogNExT program &amp; test their simulated microgravity project. More: https://t.co/2zZKV60brt"]["Joined @SteveDaines @amyklobuchar &amp; @SenBillNelson to intro leg to protect families from online booking scams. More: https://t.co/cuyuT6B1Z8"]["Weather Watch: Tornado watch has been issued for parts of eastern Nebraska. Tune in to local news for updates and stay safe. #NEweather"]["A step fwd in cutting wasteful gov’t spending: #HSGAC approved my #StopImproperFederalBonusesAct w @clairemn &amp; @SenDeanHeller"]["NOW: discussing Nebraska #transportation priorities at @EPWGOP hearing w/ @SecElaineChao https://t.co/QcNfjXnm9j #infrastructureweek"]["Looking forward to talking w @SecElaineChao about NE #transportation priorities in today’s @EPWGOP hearing. Watch: https://t.co/QcNfjXnm9j"]["Enjoyed talking with Nebraskans visiting the U.S. Capitol this morning at our weekly Nebraska Breakfast. #Tradition https://t.co/p8dyazjCGB"]["Praying for my friend @SenThomTillis."]["Discussing how we can tackle challenges women face in the workplace at @IWF #WomenLead Summit. #EqualPay #paidleave https://t.co/1c2ANysmqT"][".@JeffFlake &amp; I led 16 other senators in a letter to @USTradeRep Lighthizer stressing economic benefits of #NAFTA : https://t.co/O6axNkJman"]["REMINDER: Tomorrow my staff will hold local office hours in Arthur &amp; Perkins counties. More info here: https://t.co/BDi0O8yQZj"]["During #PoliceWeek2017 we honor those who risk their own safety every day to keep our families and communities safe. #SupportBlue https://t.co/sGHJJNibDw"]["In my column, I address graduates across our state. You’re the pride of NE &amp; I wish you all the best! #ClassOf2017 https://t.co/JyvwvUOcyu"]["One of the greatest gifts in life is being a mom. To mothers in Nebraska and across the country: Happy #MothersDay! https://t.co/LP6hre3j8n"]["Bill would improve collection/accuracy of wireless coverage data so more NE families can access the broadband service they need. (2/2)"]["Joined @Sen_JoeManchin @SenatorWicker @SenBrianSchatz to reintro #RuralWirelessAccessAct (1/2) https://t.co/Mw73IfpUDE"]["Joined @SenDuckworth @Clairemc to intro #FAMact, which would make life easier for new mothers traveling in airports: https://t.co/vWJYP93qON"]["Questioning Gen Clapper, Gen Hayden &amp; Admiral Stavridis on #Cyber policy in SASC. This critical nat’l security issue is a priority for me https://t.co/nGcBo2G49T"]["NOW: Asking questions on #cyber strategy at @SASCMajority hearing. WATCH: https://t.co/mz1zEYJD3Q"]["On my way to this AM’s @SASCmajority hearing where we will hear testimony on how we can improve U.S. cyber strategy https://t.co/mz1zEYJD3Q"]["Also underscores importance of Congress continuing work so Americans can access compassionate &amp; affordable health care they deserve 3/3"]["It’s further proof that Obamacare is simply unsustainable. (2/3)"]["Today’s news on Aetna means fewer choices and likely higher costs for families across Nebraska. (1/3) https://t.co/32syxsKpZ2"]["REMINDER: My staff will be hosting several local office hours across NE tomorrow. Check out times/locations here: https://t.co/e9LEpYUAyG"]["Congrats to @KLINradio for winning 11 awards (five in 1st place) in the ’16 Great Plains AP Broadcast Contest. #NEradio #ProudNebraskan"]["Watch: At 2:30PM I’ll chair @SenateCommerce Surface Transportation subcommittee hearing on Maritime Transportation. https://t.co/zbBaiaArfo"]["NOW: Watch my exchange with Adm. Rogers at today’s @SASCMajority hearing on U.S. #Cyber Command: https://t.co/yED1MivWyf"]["Congrats to Mary Degraff of Plattsmouth and Ella Alberts of Omaha for being named @PruSpirit top youth volunteers for 2017. #ProudNebraskan https://t.co/AfKH8I8Xh6"]["STARTING SOON: @SASCMajority hearing on U.S. Cyber Command with Adm Mike Rogers. WATCH: https://t.co/yED1MivWyf"]["May is #MilitaryAppreciationMonth. Show gratitude to those who have sacrificed for our freedom #Service #GodBlessAmerica https://t.co/xMUbvLVT94"]["I recently joined more than 650 NE vets on the largest #HonorFlight for #VietnamVets to date. Read more in my column https://t.co/C2DcFIQbC0"]["More about the #PAWSAct &amp; how it would provide relief for #vets with PTSD in this @EnterprisePub editorial: https://t.co/TF90ns4lhq"]["Great exchange of ideas at my small business roundtable hosted by Nebraska Enterprise Fund in North Omaha today. #NEBiz https://t.co/Letd3Eyufy"]["May is Beef Month in Nebraska. #NEBeef #ItsWhatsForDinner #Delicious https://t.co/7Re22C8SvH"]["My statement on today’s government spending bill vote: https://t.co/iLSPtyxk7q"]["Headed to @SASCMajority hearing on U.S. Special Operations Command. Tune in live: https://t.co/EYdvoYIzXe"][".@mortonOWH in today's @OWHnews: \"Fischer renews effort to provide service dogs for #veterans with PTSD\"\nhttps://t.co/zRUsIWWZNO #PAWSAct"]["#PAWSAct is a bicameral, bipartisan bill that would help provide #vets w/ support, peace &amp; joy as they confront the invisible scars of war."]["Today @CoryBooker &amp; I reintroduced #PAWSAct, which would increase access to service dogs for vets with PTSD. More: https://t.co/792S84yMJq https://t.co/3IzHy5TRdu"]["I was honored to speak about reintroducing bipartisan #PAWSAct today alongside @lyle_cole @k9sforwarriors &amp; House sponsor @RepDeSantis https://t.co/XW9F67RN1W"]["Speaking at press conference on #PAWSAct. Proud to reintroduce this good bill to provide relief to our #vets with PTSD https://t.co/x6wX6CZavV"]["Enjoyed talking to students from @OmaStreetSchool about their trip and my work on the #PAWSAct. It was another successful #NebraskaBreakfast https://t.co/seWqyZp4Ck"]["Asking questions now at @SenateCommerce #broadband hearing. https://t.co/xMs6hKKG9J"]["TOMORROW @ 3:00 pm ET: Joining @RepDeSantis @lyle_cole &amp; others for press conference on the #PAWSAct More info: https://t.co/h4LGdA4F80"]["REMINDER: My staff will hold local office hours in Dawson/Lincoln counties tomorrow. Stop by for answers to your casework Q’s. https://t.co/eoHHtBVckL"]["Check out some photos of the flight from NE to DC &amp; the visit to the Vietnam Wall. #HonorFlight #NEVets https://t.co/TByMCMmglh https://t.co/cSpIzSuEUs"]["It was my honor to fly from NE to DC w/ over 650 NE Vietnam vets this AM. This is the largest #HonorFlight for Vietnam vets to date #Service"]["In La Vista speaking to 652 Nebraska Vietnam vets &amp; their families @ a dinner before tomorrow's #HonorFlight #godbless 🇺🇸🇺🇸🇺🇸 https://t.co/crwNZlh0Se"]["Happy Arbor Day! Nebraska is the proud home of this great American tradition. #ArborDay #LoveNebraska https://t.co/Vi63nWPxOu"]["I was honored to welcome Dawson County honor flight veterans to the U.S. Capitol today. #ThankAVet #HonorFlight https://t.co/fQpgM57ad0"]["Tomorrow my staff will hold local office hours in Keith County. Stop by for guidance on your casework Qs #HearingFromYou https://t.co/DhpK0gOCFT"]["Are you a high school student interested in attending a service academy? Join my staff on Sat. @BellevueU. Info: https://t.co/HItxRDvRZ3"]["#HBD to my friend @CoryBooker! Thanks for always laughing at my jokes on the dais. #BipartisanBuddies https://t.co/zQbW07KJDl"]["Asking questions now at today's @SASCMajority hearing on @PacificCommand &amp; US Forces in #Korea. Livestream: https://t.co/DNlnKGwIVp"]["Honored to receive @USChamber Spirit of Enterprise Award from members of the @NebraskaChamber. #NEentrepreneurs #NEbiz https://t.co/8euBA06DYQ"]["Good read in @theindependent on how #NEvets will benefit from the #ChipInForVets Act with new Omaha VA clinic. https://t.co/DrjlnSJ70y"]["So proud to congratulate @GeringBulldogs students for being one of three national winners in the #SamsungSolve contest! #ProudNebraskan https://t.co/Dh676rJz49"]["Had a wonderful time greeting some @gpbcrescentmoon sisters. I have many great memories from my time in #GammaPhiBeta at @UNLincoln. https://t.co/2nXeIMbseD"]["At today’s @EPWGOP hearing, witnesses cast doubt on the legality of #WOTUS. Watch: https://t.co/KpSNK0W9dy"]["With rock-star Bailee of Lincoln, a @PoetryOutLoud national finalist who was chosen out of 310K competitors. #ProudNebraskan #LNK https://t.co/MQsNclPhYV"]["Wednesday mornings at the #NEBreakfast are the best. If you’re visiting Capitol Hill, stop by &amp; say hello. https://t.co/4HcnNixT1a"]["Tomorrow my staff will hold office hours in Cheyenne and Deuel counties. Please stop by if you have any Q’s regarding casework. https://t.co/C4fe6ZNnak"]["Bill Bailey is a true Nebraska hero. I am honored to tell his story. #NEHeroes #ProudNebraskan"]["Bill was a wonderful husband, brother, son, father. He dedicated quite a bit of his life to helping other people. #NEHeroes"]["Specialist Bailey earned several military awards including the Purple Heart, Bronze Star, Iraqi Campaign Medal &amp; Combat Action Badge. #Honor"]["More than one thousand people gathered in Bellevue to remember Bill. #NEHeroes"]["On May 25, 2007, during a security escort mission, Bill’s vehicle struck an improvised explosive device. Bill Bailey was killed. #NEHeroes"]["By 2007, the insurgency in Iraq had erupted to new levels of violence. Increased American forces sought to destroy the al Qaeda network."]["In 2006, his unit was deployed and assigned to provide security escorts for truck convoys operating out of Balad Air Base in #Iraq."]["That deep desire to serve the country continued to tug at him. In 2005, Bill re-enlisted in the @NENationalGuard #Courage"]["Bill’s protective nature made him a great father. It also made him a great firefighter. #NeHeroes"]["After 9/11, Bill felt the call to serve his country again. But, first things first. Bill and Dee married in 2004."]["In December 2000, Bill met Dee. She was a bank teller at Wells Fargo; he drove an armored truck. They met through a service window."]["Bill attended Bellevue East where the call to protect his country prompted him to enlist in the @NENationalGuard in 1995."]["NOW: Headed to the #SenateFloor to honor the life of Specialist Bill Bailey of Bellevue. #NEHeroes Watch: https://t.co/xXeEzY478o"]["I’m continuing to pay tribute on the #Senate floor to #NEHeroes who gave their lives in Afghanistan &amp; Iraq #Service"]["Congratulations, Secretary Perdue. #AGsec https://t.co/6k5XJ6SgEy"]["Good meeting w/ @americanmothers &amp; their little mascot today. We talked about their work to combat human trafficking. https://t.co/Op9ZgRylkp"]["Want to know what I’ve been up to? Read my new column about my time #OnTheRoad in #NE: https://t.co/YpEhBhayF9"]["\"What is done cannot be undone, but at least you can stop it from happening again.\" - Anne Frank #NeverAgain #HolocaustRemembranceDay https://t.co/SlLK0RoMVQ"]["#StrongFamiliesAct is a #PaidLeave bill that can pass &amp; provide relief to families juggling daily responsibilities https://t.co/rKLUXfFcn0"][".@pewresearch found 87% of Americans want a #paidleave solution like my #StrongFamiliesAct https://t.co/81N56PI6ZI https://t.co/JgFPcesec0"]["Analysis of @pewresearch study notes most Americans are “extremely supportive” of my #StrongFamiliesAct with @SenAngusKing #paidleave https://t.co/3tw59TPerH"]["Excited to share this positive feedback about my #PaidLeave #StrongFamiliesAct from @pewresearch study analysis https://t.co/8dJXvlUD2J"][".@DanielPMalloy with @ozy covers my efforts to make life easier for families: https://t.co/5PvwPA0jUW #EqualPay #PaidLeave"]["Honored to speak at the inaugural ceremony for the Lancaster County Veterans Court this afternoon in Lincoln. #NEvets https://t.co/2qvjjwSUof"]["Thanks to the folks at the Sarpy County Chamber for letting me attend today's lunch and give an update on my work in the Senate. https://t.co/ROpRnVxVzd"]["Speaking today with members of the @SarpyCounty Chamber. I gave an update on legislative business in the U.S. Senate. https://t.co/e1jl13934I"]["#HappyEaster https://t.co/ijke5Vm2om"]["Proud to take part in a welcome home ceremony for members of the G-Company in #LNK today. #ProudNebraskan https://t.co/QFCio2G27h"]["#GBR https://t.co/OTEMsjgyya"]["Terrible news of Nebraskans being struck by a truck outside of LNK Planned Parenthood. My prayers are w all those impacted."]["I was honored to speak at today's @NENationalGuard departure ceremony for the 641st in LNK. #ProudNebraskan https://t.co/Jx9HcThrnW"]["Privileged to join the 52nd Annual Greater Omaha Leadership Prayer Breakfast to share a scripture passage this morning. #GoodFriday https://t.co/sY9TFu9sEk"]["More on my work w/ @AmyKlobuchar &amp; 54 other sens. in @theHill: “Senators press FCC on rural broadband affordability” https://t.co/64K4wA4q8K"]["In Beatrice, leading economic development roundtable. Productive conversation on ways to build stronger &amp; more prosperous NE communities. https://t.co/F4EWCAvqd9"]["Happy #NationalPetDay from Fred Fischer. #FunWithFred https://t.co/tILySNYghH"]["Led bipartisan letter w @amyklobuchar &amp; 54 senators urging @FCC to continue advancing broadband in rural areas More: https://t.co/0EmMsfXa6Q"]["Loved stopping by @Runza in Beatrice for lunch and visiting with their wonderful team! #Delicious #NEtradition https://t.co/byTj0wEny7"]["Kicking off a great day in NE with an Economic Development Roundtable in Plattsmouth. #Jobs #OnTheRoadinNE https://t.co/WEvFOU1Y78"]["Wishing my friends and neighbors across Nebraska a joyous Passover celebration."]["I was proud to support Justice Gorsuch and I think he will do an exceptional job for the American people. My column: https://t.co/Dj81zuP4qr"]["Congratulations, Justice Neil Gorsuch #SCOTUS https://t.co/po4InTkBlq"]["Congrats to Robert Carper of Blue Hill, NE on his gold/silver medals in cross-country skiing at the @SpecialOlympics https://t.co/6icU9lSRqX"]["The Senate just confirmed Judge Neil Gorsuch to #SCOTUS. My full statement: https://t.co/XHCFi3SHXP"]["My full statement on U.S. air strikes in Syria: https://t.co/5GR2zBshke"]["NOW: Asking questions at @SenateCommerce subcommittee hearing on rural air service. Watch: \nhttps://t.co/ujrSdomODj"]["Joining @GarySadlemyer LIVE on @kfabnews at 7:35 am CT to talk news of the day. Listen in: https://t.co/8TGo072xqR"]["Great meeting with the Nebraska Association of Nurse Anesthetists today in my Senate office. https://t.co/v56W6ZFmQa"]["My floor speech today on why the Senate should #ConfirmGorsuch https://t.co/BAFG4oMfWv"]["NOW: Speaking on #SenateFloor on Judge Gorsuch's nomination to serve as our next #SCOTUS justice. Tune in: https://t.co/cDo393UspQ"]["Enjoyed speaking to @AEDSocial &amp; the Equipment Dealers Association this afternoon at their public policy event. https://t.co/CJtYAk2djd"]["This month, wear blue in support of the autism community. #AutismAwarenessMonth https://t.co/KPjhfPNPoI"]["Enjoyed seeing friendly faces at today’s #NEbreakfast, including students from Clearwater-Orchard Schools and NE Regional Programs. https://t.co/yuE8PAWrhA"]["Thanks @One_Werner’s Derek Leathers @UnionPacific’s Lance Fritz @FedEx‘s Michael Ducker &amp; @PNCT241’s James Pelliccio for your great input2/2"]["Fantastic @SenateCommerce surface transportation subcommittee hearing on freight policy &amp; #infrastructure today https://t.co/8pZoZyeTS4 1/2"]["In @SASCmajority today, Gen Hyten gave an update on challenges facing our nation’s strategic forces. Our exchange: https://t.co/GRgBh2ZLHc"]["Chairing @SenateCommerce Surface Transportation Subcommittee hearing on freight policy. #Infrastructure TUNE IN: https://t.co/AGVeKLBGCB"]["My #WorkplaceAdvancementAct would provide women with the confidence they need to negotiate the wages they deserve. #EqualPayDay https://t.co/YYPPq3fQw2"]["#EqualPayDay is a meaningful reminder of the need for progress so every woman, just like every man, can support herself &amp; her family. https://t.co/rrBfg5Hlp7"]["Great news for #NE: “@facebook to build massive data center south of Papillion” @OWHNews w/ more: https://t.co/af06Cf6WW7 #SiliconPrairie"]["NOW: watch my exchange with Gen. Hyten at @SASCMajority hearing on @US_Stratcom https://t.co/zMXYTAfhvp"]["Headed to a @SASCmajority hearing, where we’ll hear from Gen. Hyten, the Commander of @US_Stratcom. Watch: https://t.co/zMXYTAfhvp"]["Women make the world work. Read my @CNN op-ed on #EqualPayDay. #WorkplaceAdvancementAct https://t.co/mo9xYzl5bg"]["Let’s come together so we can look families in the eye and say: we heard you and we are taking action. #EqualPay #Bipartisan #Empowered"]["Let’s take advantage of this moment when we have common ground on a commonsense and straightforward legislation for #EqualPay #Bipartisan"]["Most importantly this bill is possible: 53 Republican and 5 Dem Senators supported a version of the #WorkplaceAdvancementAct last Congress."]["Many congressional Democrats requested and even praised an Obama executive order with similar language to my proposal #EqualPay"]["With this flexibility, women can better negotiate arrangements that make sense for them. #Flexibility"]["When employees, especially women, have more information, they can confidently pursue favorable work and wage arrangements #KnowledgeIsPower"]["A culture of silence and fear of retaliation can keep people in the dark about how their wages compare to others’ #KnowledgeIsPower"]["The #WorkplaceAdvancementAct would empower women with info about wages so they can be informed advocates for themselves."]["I’ve reintro’d the #WorkplaceAdvancementAct based on a simple idea: equal pay through empowerment #KnowledgeIsPower https://t.co/4ifgWsmas9"]["Headed to the #SenateFloor to deliver remarks in advance of #EqualPayDay tomorrow. Watch: https://t.co/MrRFtu4WtO"]["I will vote in support of Judge Neil Gorsuch. More in my @JournalStarNews op-ed.  #ConfirmGorsuch #SCOTUS https://t.co/dNyoonD3h7"]["My oped in @thehill discusses using some revenue from tax reform for #infrastructure investments in America’s future https://t.co/fQVgzyS5Qc"]["Honored to received 2017 Distinguished Community Health Advocate Award from @HCANebraska- they provide care to low-income NE families. https://t.co/ACzJi0vore"]["The most important parts of the #IoT aren’t things, but people. This growing network has the potential to do great things for NE families. https://t.co/5tDSoTl4Uw"]["The US could realize 1/3 of the total global economic benefit of the #IoT and raise our GDP by 2% to 5%. Astounding!"]["50 billion devices will be connected to #IoT by 2020 @McKinsey estimates #IoT could add $2.7-$6.2 T to the world economy each year by 2025"]["The #DIGITAct is a bipartisan bill. Both parties understand the need to position the US as a #IoT world leader."]["The #DIGITAct will bring together a working group of federal agencies &amp; private sector stakeholders to develop #IoT"]["Cooperation between the private and public sectors is essential to develop the #IoT."]["Can Congress stay out of the way of #IoT progress? I think ‘yes.’ Our #DIGITAct passed @SenateCommerce in January https://t.co/kYMWDkSp95"]["The private sector innovates, the public sector regulates. I’m working to nurture innovators and prevent regulatory silos #IoT"]["Nebraskans support these innovators by rewarding their ingenuity, buying their products, and keeping alive a spirit of innovative discovery"]["The people who will make us a #IoT leader work in the Haymarket District of #LNK &amp; Omaha’s Old Market. #SiliconPrairie"]["The most Congress can do is clear obstacles for people in the private sector who will make us that world leader in #IoT."]["Members of Congress, the men &amp; women in the relevant federal agencies, cannot make America the world’s leader in #Iot by themselves"]["Important question: Is gov’t taking the right steps to make America a world leader in the Internet of Things?"]["Joining my colleague, @CoryBooker, for #bipartisan discussion w/ @AEI on the “Internet of Things” #IoT"]["Productive meeting w @USTradeRep Nom Robert Lighthizer. We discussed how important trade is for #NE ag &amp; our economy https://t.co/NxlSDEqRsb https://t.co/kbI10WuJHK"]["#TBT to a fun trip visiting NYC and my dear friend from high school, Terry Baughan. #OldFriends #Throwback https://t.co/WeGNV0uVeY"]["#Bipartisan #WaterInfrastructureFlexibilityAct would provide communities with flexibility as they work to keep families healthy &amp; safe. https://t.co/0LNeWuJFbd"]["Q &amp; A with students from @BC_Cardinals &amp; @DiscovererWay. They are participating in @CloseUp_DC. #NEstudents https://t.co/gQsE2iM4zD"]["Asked Deputy @USDOT Sec nom Jeffrey Rosen about his ideas for improving our nation’s infrastructure during today’s @SenateCommerce hearing. https://t.co/Xpvla1eTOq"]["Asking questions of Deputy Transportation Sec. nominee Jeffrey Rosen in @SenateCommerce. Watch our exchange: https://t.co/oLvrRFbQAI"]["Nebraskans rely on this program for critical phone &amp; broadband service. https://t.co/ve9wBrJ1Qw (2/2)"]["Glad to see efforts from @AjitPaiFCC and @FCC to return #Lifeline program decisions to states. (1/2)"]["Productive conversation today with @alzassociation members about finding a cure for this heartbreaking disease #ENDALZ #alzforum https://t.co/kPAm1LXDYA"]["Another great Wednesday morning at the #NEbreakfast. I was delighted to welcome @4H students visiting from Lexington. https://t.co/dZ5VGkNIfr"]["My statement on the White House’s potential legislative strategy to tackle tax reform and infrastructure concurrently: https://t.co/I08fkVZ9ZX"]["I enjoyed meeting w Deputy @USDOT Sec nom Jeffrey Rosen today. Great conversation about improving our nation’s roads &amp; infrastructure. https://t.co/DHJYYwFfLA"]["Skyping into the @HumanitiesNe #NECapitolForum from Capitol Hill  w/ @RepAdrianSmith &amp; @RepDonBacon. Good questions from these #NEstudents! https://t.co/dkSJnJQNTp"]["Today in @OWHopinion: \"Senate should vote to confirm\" Judge Neil #Gorsuch. #SCOTUS https://t.co/lTSw6DaOYq"][".@KearneyHub editorial on our bipartisan bill to end bonuses for federal employees w/ conduct violations: https://t.co/5tjBlmkFUn"]["The menu for today’s Senate lunch #TheGoodLife #Delicious https://t.co/cWFnITh78A"]["Bruce &amp; I love hosting friends for dinner after a day of hard work on the ranch. Today, I brought this #Nebraska tradition to the Senate https://t.co/cy3A0BBu6n"]["Fred sits in on a staff meeting. Happy #NationalPuppyDay #FunWithFred https://t.co/9zKBmTyFff"]["Asking Qs now at @SASCMajority hearing on United States European Command. Watch Live: https://t.co/4yPZUz8irV"]["Today I met with the Nebraska Soybean Association. Great conversation about trade, crop insurance, reducing regs &amp; other #NEAg issues. https://t.co/5wDnLiVVSJ"]["Continuing push to end wasteful federal bonuses w @clairecmc &amp; @SenDeanHeller. We must ensure tax $ are used wisely https://t.co/ppCpXMWVrR"]["This bill would give local communities more control &amp; flexibility as they manage water infrastructure updates (2/2) https://t.co/enNFiWvYob"]["Joined @SenSherrodBrown @SenatorCardin @JohnBoozman @SenRobPortman @CoryBooker @RoyBlunt to intro Water Infrastructure Flexibility Act (1/2)"]["I had a great time speaking with Nebraska @CloseUp_DC students from @DOHS_Griffins @wahoopublic @NeumannCavs &amp; High Plains High School. https://t.co/gLrGn0qFGl"]["Pleased to see Nuclear Energy Innovation &amp; Modernization Act, a bill I cosponsored, pass @EPWGOP today. It will now head to the Senate floor"]["Asking Q’s now at @SenateCommerce hearing on #cybersecurity. Watch live: https://t.co/ZgGhLZYdbB"]["Full house this morning at the #NebraskaBreakfast. I enjoyed introducing my family members, Bruce and Fred. #FunWithFred https://t.co/U4iOUujkya"]["Wonderful to meet with these young Nebraska women representing @NationalFFA  &amp; @4H at @AgFutureAmerica. #FeedtheWorld #AgDay https://t.co/U8swidvux0"]["This week, we recognize NE’s economic engine &amp; thank the families who work hard, every single day, to #FeedTheWorld. #NEag #NationalAgWeek https://t.co/GhbF4RnTjm"]["Happy #FirstDayOfSpring! Hope you are enjoying the beautiful weather across Nebraska today. https://t.co/Tfe7M5FwPO"]["REMINDER: My staff will be holding local office hours in Jefferson/Thayer counties tomorrow. More details here: https://t.co/ZVvgnXGsXQ"]["#StPatricksDay https://t.co/KK5xTvHMxU"]["Getting started with Q&amp;A at today's Holdrege #ListeningSession. #HearingFromYou https://t.co/NwSF93qfUm"]["Welcoming constituents as they arrive at my Holdrege #ListeningSession. Looking forward to answering their questions. #HearingFromYou https://t.co/ynIs8FVkFb"]["Starting off my Kearney #ListeningSession with an update on my committee work &amp; business in the Senate. https://t.co/Tl9HBjdx9s"]["Greeting Nebraskans at my Kearney #ListeningSession. Looking forward to #HearingFromYou https://t.co/v0hVE93Bhn"]["Loved speaking to students from Kearney Catholic, Logan Views HS &amp; @OmahaPubSchool about my work in the U.S. Senate this morning #NEstudents https://t.co/xBmxyagPn4"]["REMINDER: My staff will be in Boone/Platte counties tomorrow. They can answer your questions &amp; assist w/ casework. #HearingFromYou https://t.co/oSVX45ECRq"]["At 2:30 pm ET: Chairing @SenateCommerce Surface Transportation hearing on improving #TruckSafety. Watch live: https://t.co/1HeIltI2ql"]["My full statement responding to #SenateDems presser on #PaidLeave: https://t.co/FBkjUMDG2t"]["My Bipartisan #StrongFamiliesAct is a paid leave solution that can pass through congress and provide relief to American families."]["Asking Q's now at @SASCmajority on the Marines United website. Watch: https://t.co/4u4ydBRdKy"]["Tomorrow my staff will host local office hours in Thomas, Hooker &amp; Grant counties to answer your Q's about the federal gov't #HearingFromYou https://t.co/r8CX7IVZQd"]["Attended unveiling of @usmint’s @BoysTown coin. Proud of my legislation to make this happen/honor this fantastic NE organization. https://t.co/GWBTUv73tW"]["Today I joined folks from @NHF_Hemophilia in recognizing national Bleeding Disorders Awareness Month #RedTieChallenge https://t.co/mhJS6zFZKm"]["#TBT to winter days spent skiing with Bruce. #TheGoodLife https://t.co/FRbLORf4mb"]["Headed over to @SASCMajority hearing on U.S. Central and Africa Command. Watch here: https://t.co/Z5tRvdoMjW"]["Read more on these outstanding Nebraskans here: https://t.co/XNlL7lADax"]["Proud to welcome Jacob of Omaha &amp; Matthew of Alda to the Senate today &amp; congratulate them on being NE’s delegates to @SenateYouth program https://t.co/0WyvPqTbZo"]["Chairing @SASCMajority strategic forces subcommittee hearing on the global nuclear weapons environment. Watch live: https://t.co/HlZtI6pZo0"]["Reintro'd bill w @SenCoryGardner that would provide Americans w ability to see how taxpayer $ are being spent. More: https://t.co/JIpuL3Ut7l"]["Today we celebrate the positive story of women around the world &amp; recommit to empowering them to live their dreams. #InternationalWomensDay https://t.co/Ud1pKEq9LH"]["Always great to spend Wednesday mornings updating Nebraskans on my work in the Senate. #NebraskaBreakfast https://t.co/a4hwZLEbQm"]["Special visit today w/ NE firefighters/members of #IAFF. Thanks for all you do to keep our families &amp; communities safe. #ProudNebraskan https://t.co/BmhZYxnpN7"]["Thanks to the folks from @VoicesNE for a good discussion on child nutrition and wellness. #EndHungerNow https://t.co/sqoGgnV6N8"]["Joined my colleagues in letter urging admin to address threats to #JCCs &amp; other religious institutions. Full letter: https://t.co/MVArrYVPqm"]["NE WEATHER: Reports show much of southeast NE is currently under thunderstorm watch until 4:45PM. Keep an eye on local weather &amp; stay safe."]["This morning, I joined @MaggieLake on @CNNMoney to talk about my #PaidLeave bill. #StrongFamilies Full Video: https://t.co/G9XxGySZdr"]["In this week’s column, I talk about rolling back regulations so NE families and businesses can prosper https://t.co/ZXf9WnBCwO"]["TUNE IN: I’ll be joining @MaggieLake on @CNN to talk about my work on #EqualPay and #PaidLeave. #KnowledgeIsPower"]["Honored to read letter from @POTUS &amp; Senate-passed resolution commemorating NE's 150th bday @ tonight's Statehood Dinner. #NE150 @NE150 https://t.co/tBO0sBJz6h"]["Toured one of the lifesaving @AirMethodsCorp Comms helicopters with their impressive team today. https://t.co/pK4HwiJP5r"]["In Omaha at @AirMethodsCorp. Fascinating to learn about the amazing work they do to save lives. #LoveNE https://t.co/YojnXxXHp7"]["Joined @SenDonnelly @ChuckGrassley on bipartisan leg to allow retailers to sell higher ethanol blends yr round. More https://t.co/SlFJdeeD2C"]["Good to meet with the folks from @AAR_FreightRail for #RailDay2017 today.  #USAInfrastucture https://t.co/VXDKzpIHEN"]["Delivering the keynote address at today’s @AASHTOspeaks luncheon. #Transportation #StrongInfrastructure https://t.co/PmKvP6iskT"]["Looking forward to delivering the keynote address today at @aashtospeaks luncheon. #Transportation #StrongInfrastructure"]["Happy birthday to @Action3News anchor @CraigNigrelli, who also shares a bday with our great state. Thx for all you do to keep NE informed!"]["Congrats to the people of NE as we celebrate our rich history, exciting present &amp; bright future. My #NE150 speech: https://t.co/zVNJoW1sBB"]["Calling up &amp; asking the #Senate to unanimously pass my resolution w/ @SenSasse in recognition of NE’s 150th Bday #HBDNebraska"]["Headed to the #SenateFloor to celebrate Nebraska’s 150th birthday &amp; honor this historic milestone. @NE150 Watch: https://t.co/fMNVQg8zTo"]["Asking questions now at @SenateCommerce hearing on improving access to infrastructure. #StrongCommunities Watch: https://t.co/Yw8hVgChBc"]["Happy Birthday, @SenatorStrange! #HBDtoUs #BirthdayTwins https://t.co/3GbeM4x4fk"]["Looking forward to this morning’s @SenateCommerce hearing on infrastructure #BuildUSAInfrastructure. Watch: https://t.co/3NnY7FRTJI"]["Good read on need to stop #WOTUS in @WSJopinion today: Trump orders the EPA to review Obama’s illegal waterways reg.https://t.co/81jwdGZXRQ"]["#TheGoodLife Is… Tradition, Beautiful, Innovative, and Historic. #HBDNebraska @NE150 https://t.co/qlh4kRp5QU"]["My statement on @POTUS' #JointAddress: https://t.co/J0y1MnQWhh"]["Pleased to stand behind @POTUS today as he signed an executive order that will roll back #WOTUS. My statement: https://t.co/Fc3b3Iy9BK https://t.co/kfgbGlPLTb"]["Enjoyed meeting w/ #PDAdvocates for @MichaelJFoxOrg to speak about research for a #Parkinsons cure. https://t.co/dXZ85HPKz6"]["Had a great meeting this afternoon with @AANP_NEWS. We discussed their hard work to provide quality care to Nebraskans. https://t.co/9kuxF33g95"]["Grateful for the opportunity to meet with Jim Shuey from Nebraska @DAVHQ this morning and discuss chalenges #NEVets are facing https://t.co/ACL38YXVON"]["Tomorrow my staff will be on hand to answer your questions in Dodge, Stanton, and Colfax counties. #LocalOfficeHours #HearingFromYou https://t.co/CoQN7y5kTi"]["Deeply concerned by bomb threats against Jewish community centers, day schools &amp; cemeteries.These horrible acts have no place in our country"]["…and help create an environment where more Americans can provide for their families, grow their businesses, and build strong communities."]["As he takes the helm of the Commerce Department, I am committed to working closely with him to make it more efficient…"]["I’m confident that his business background will serve him well in this position."]["March 1st is Nebraska’s 150th birthday. In this week’s column I talk about this momentous milestone https://t.co/eUAOXUztR6 #ILoveNebraska"]["Yesterday I toured the new @UNMC Cancer Center w @HankBounds &amp; Chancellor Gold and got an update on exciting things to come. #NEinnovation https://t.co/oXnsMSJ1hO"]["Wishing a very Happy Birthday to my friend &amp; cornhusker colleague, @SenSasse. #TheGoodLife"]["The #DeathTax hits NE’s small family businesses hard. I’m backing legislation to repeal it. More in my column: https://t.co/1D5kidWXip"][".@Kyle_Feldscher covers my #BuildUSAInfrastructure Act in today’s @DCexaminer. Read here: https://t.co/niej4UI469"]["Productive meeting today with members of the @LincolnChamber board. I gave an update on legislative business in the US Senate. https://t.co/7dZHwh7Phe"]["In #LNK visiting w/ folks at @AARPNE. We had a productive discussion about a variety of health care issues https://t.co/XojGYxFtMI"]["#Senate just voted to confirm Scott Pruitt as EPA administrator. My full statement: https://t.co/KpSfSTi5JN"][".@SenatorTomUdall &amp; I just introduced legislation to reform the #FCC Lifeline program. Read more: https://t.co/sMnZgC3Aa2"]["#TBT to outdoor adventures with my husband Bruce #MyValentinefromValentine https://t.co/q02YAWPWkC"]["I had a great conversation with Secretary of the Air Force nominee Heather Wilson during our meeting this morning. https://t.co/Sd02ZTnO2K"]["On the way to @SASCMajority hearing on reshaping the US Military. Watch live: https://t.co/AK8sngesJ3"]["Great first hearing of the @SenateCommerce Surface Transportation Subcommittee. Watch my opening statement: https://t.co/m0LVozbIpB"]["Our bill would ensure transparency/oversight of Judgment Fund &amp; prohibit taxpayer-funded payments to state sponsors of terrorism."]["Intro’d Judgment Fund Transparency &amp; Terrorism Financing Prevention Act w @SenatorLankford @SenTedCruz @jiminhofe https://t.co/cWt9RINsHG"]["Here are some snapshots from gavel-in at the first @SenateCommerce Surface Transpo Subcmte hearing of the 115th Congress. #Infrastructure https://t.co/jfdxRmcdhF"]["SOON: Chairing @SenateCommerce Surface Transpo Subcmte hearing on increasing transportation safety &amp; efficiency https://t.co/QsvpkO1RnO"]["Look forward to working w/ women in tech &amp; public policy to tackle economic/security issues &lt;link&gt; (2/2)"]["Excited to join @AmyKlobuchar as #WHTC Honorary Senate Co-chair. #WomeninTech (1/2)"]["Welcomed Kimberly Grosse, a grad of @BoysTown, to the #NebraskaBreakfast. Kimberly is in DC to testify at a congressional hearing this AM https://t.co/yEfQRlAfao"]["Wonderful to meet w/ @SONebraska reps &amp; hear from John Sherbert of Minden, NE, a #SpecialOlympics athlete w/ an inspiring story. #SOHillDay https://t.co/SgfSNZuw1e"]["Always love updating visiting Nebraskans on what’s happening in the Senate. #NebraskaBreakfast https://t.co/8H7gIXMNRC"]["My statement on Russia deploying illegal cruise missile system: https://t.co/W4O74nhjXo"]["Happy to visit with my friend Dawn Caldwell from @AuroraAgNetwork today and talk #NEag. #AgRetailers https://t.co/FaZva3L3T0"]["My Q&amp;A with @cosmopolitan about my proposals for women in the workplace: https://t.co/jUdzruqpi3 #equalpay #paidleave"]["Fred is wishing all Nebraskans calling my office a Happy #ValentinesDay #FunWithFred https://t.co/kdqeSsHChB"]["As a proud #NebraskaLEAD alum, it was great talking with members of #LEAD36 today during their trip to the Senate. #NEag https://t.co/ynQDGABvS9"]["Video chatting with students from Stuart High School during their civics class today. #NEStudents https://t.co/OpXeBsCclb"]["Thanks to @GovRicketts &amp; Lt Gov Foley who are launching a new initiative to prevent opioid abuse in NE #StrongCommunities #StrongFamilies"]["Glad @POTUS &amp; @JustinTrudeau will host roundtable on women in the workforce. Let's focus on solutions to make life easier for #families."]["Proud to call Valentine, NE home &amp; see this wonderful tradition continue. #CupidsMailBox #ValentinesDay https://t.co/1IyrkrD0jJ https://t.co/WtjskymDPX"]["#FBF to last spring when I led a congressional delegation to #Japan and met with PM @AbeShinzo (3/3) https://t.co/C9RP48IWls"]["We also talked #trade. Japan is the largest importer of #NEbeef. #NEag #FeedTheWorld (2/3)"]["Enjoyed mtg with PM @AbeShinzo today. I thanked him for our joint commitment on the missile inceptor &amp; the successful test last week. (1/3)"]["This afternoon, I spoke w @FOXnews host @HeatherNauert about my efforts to make life easier for families. #PaidLeave #EqualPay https://t.co/hiGSTTGPJf"]["With my #equalpay bill, more women could lead the lives they choose, support their families &amp; reach their goals. #WorkplaceAdvancementAct https://t.co/xJ6EajR8qQ"][".@SenSasse &amp; I announced the application process for filling a US Court of Appeals for the 8th Circuit vacancy INFO:https://t.co/YgjlgVK2Ac"]["Introduced Fred to Judge Neil Gorsuch today. #SCOTUS #FunwithFred https://t.co/pbJANobJxn"]["I will continue to work to deliver the open and respectful confirmation process Judge Gorsuch deserves. https://t.co/mKHmsSLz4A (3/3) https://t.co/lbbVBMUgh2"]["He is bright, honest, impartial, and a follower of the Constitution. (2/3)"]["In my meeting with Judge Gorsuch, it was clear that he has the even-handed judicial temperament I’d hope to see in a #SCOTUS  justice. (1/3)"]["I joined colleagues in @SASCmajority today to hear from Gen. Nicholson about the US military’s mission in Afghanistan. #Defense https://t.co/7N1ntwFiDT"]["My #StrongFamilies Act w/ @SenatorAngusKing would provide flexibility for families juggling responsibilities at home &amp; at work. #PaidLeave https://t.co/DqMkTySz7B"]["My #WorkplaceAdvancement Act would empower women to effectively negotiate their wages. #EqualPay https://t.co/gzf0DxEbln"]["Proud to continue my work on #EqualPay &amp; #PaidLeave in the Senate. Read about the proposals I reintro’d: https://t.co/E8OiDALEfJ"]["My #EqualPay &amp; #PaidLeave proposals seek to make life easier for families. Read more in @TheHill: https://t.co/qC7qHO3eT4"][".@POLITICO's @seungminkim covers reintro of my #StrongFamilies &amp; #WorkPlaceAdvancement Acts. #EqualPay #PaidLeave https://t.co/dg3uu8YnbQ"]["TUNE IN: Joining this morning’s @SASCmajority hearing to hear from Gen. Nicholson about our mission in Afghanistan https://t.co/shJnO3MVp3"]["In today’s @EPWmaj hearing, I highlighted my #BuildUSAInfrastructure Act to fund/build new transpo projects. More: https://t.co/dq0GsYdl6D"]["Pleasure to sit down with members of the Nebraska Rural Water Association and hear about their work in rural NE. https://t.co/5HpI3yndbQ"]["HAPPENING NOW: I’m asking Qs &amp; highlighting my #BuildUSAInfrastructure Act at @EPWmaj hearing. Watch live: https://t.co/0Vfev9b7yq"]["Always a pleasure to meet with the great folks from the Nebraska Corn Growers Association. #FeedtheWorld #NEag https://t.co/AlycBKLXDi"]["Headed to @EPWmaj hearing focused on oversight for modernizing our #infrastructure. Watch: https://t.co/0Vfev9b7yq"]["WATCH: I’ll be joining @KatyTurNBC this afternoon at 2:15PM ET on @MSNBC. Tune in: https://t.co/FvylwwhGig"]["In this week’s column, I discuss what I look for in a Supreme Court Justice: https://t.co/FvXUdEQvsM #SCOTUS"]["I’ll be on @KFABnews at 8:36am CT with @GarySadlemyer. Tune in and listen live: https://t.co/Q94nMgV2ym"]["Check out my new op-ed about #SCOTUS nom Judge Neil Gorsuch in @DailyCaller https://t.co/S2naY5SjGl"]["The admin's new #Iran sanctions are an important step in holding the number one state sponsor of terror accountable."]["Joined my colleagues in raising awareness of @NIH_NHLBI #WearRedDay. February is #HeartMonth #GoWearRed https://t.co/6R3xs9Ls5I"]["This afternoon, I spoke on the Senate floor about Judge Neil Gorsuch, @POTUS’s #SCOTUS Nominee. View my speech here https://t.co/pcR8553QUc"]["My statement on Betsy DeVos: https://t.co/LopDmk48Lo"]["In a few minutes, I’ll be speaking on the Senate floor about #SCOTUS nominee Judge Neil Gorsuch. Watch live: https://t.co/O9AnBKmUBh"]["It's all hands on deck in my offices answering phones. If you are a Nebraskan who can't get through, try my website: https://t.co/IvObTo0Vtb"]["\"Fischer introduces bill to fund infrastructure projects...\" #BuildUSAInfrastructure Read @MortonOWH's full story: https://t.co/IAhTaHnXzD"][".@LJSdon of @JournalStarNews on my new transportation bill, the Build USA Infrastructure Act. Read more: https://t.co/sCrBcPahm5"]["Just intro’d new bill offering solutions to pay for &amp; build new transportation projects. #BuildUSAInfrastructure https://t.co/GOxOgQyzYf https://t.co/35XLPxAKmo"]["#SigningDay #GBR https://t.co/E9GZsjGSiy"]["In the coming days, @SenSasse &amp; I will announce the process for Nebraskans interested in filling Chief Judge Riley’s position. 2/2"]["Best wishes to Chief Judge Riley as he moves to the next chapter of a remarkable legal career 1/2 https://t.co/tTc80jscPQ"]["Proud to receive the Friend of Farm Bureau award this AM. Thanks to the folks at @NRFarmBureau your commitment to #NEag. #Feedtheworld https://t.co/29dESUsGXg"]["It’s back! Great first #NebraskaBreakfast this morning. Also glad to welcome @RepDonBacon to the table. #ProudNebraskan https://t.co/TZNsDOilWp"]["The people spoke in the last election. The #Senate now has the responsibility to act on their wishes w/ a thorough confirmation process"]["I’m encouraged to see @POTUS select #SCOTUS nom w/ a sharp intellect, steady judicial temperament&amp; long history of upholding the rule of law"]["Excited for the first Nebraska breakfast of 2017 tomorrow. I encourage all visiting Nebraskans to stop by. More here https://t.co/Zki9gN3vXy"]["My full statement on my meeting with Gov. Sonny Perdue, the nominee to lead @USDA https://t.co/nak32JrYNC"]["Discussed Nebraska agriculture priorities during my meeting with Gov. Sonny Perdue today. #NEAg #FeedtheWorld https://t.co/HwHR8pQXMi"]["I want to hear from all Nebraskans. If you're having trouble reaching my office by phone, please try my website: https://t.co/IvObTo0Vtb"]["Congrats to Elaine Chao on her confirmation as Sec. of Transportation. Looking forward to working w her to strengthen #infrastructure"]["Divesting authority from 1 director to a 5 member board will help ensure American families have access to economic opportunity. (2/2)"]["Reintro’d bill to reform flawed structure @CFPB (1/2) https://t.co/pZtrY3Q4M3"]["This troubling news is only further proof that the #IranDeal has not deterred Iran’s bad behavior. https://t.co/kxryU1NQHV"]["My @SASCMajority subcmte assignments: Strategic Forces (Chairman), Cybersecurity &amp; Emerging Threats and Capabilities https://t.co/SUkSANoel3"]["The horror of the Holocaust will never be forgotten. #HolocaustRemembranceDay https://t.co/E63ebw4P6X"]["In Lincoln speaking at the Liberty Ladies luncheon. Updating them on my @SASCMajority work in the Senate. https://t.co/AaEmkqlFfM"]["All life, at every stage, is sacred. #MarchForLife #ProLifeProWoman https://t.co/56LxYAaBI0"][".@March_for_Life is an important, peaceful rally that draws needed attention to pro-women, pro-life policies."]["Enjoyed greeting Nebraskans visiting our nation’s capital to participate in the annual #MarchForLife tomorrow. #ProudNebraskan https://t.co/VJsE86GR3J"]["It’s pretty simple: if you want a portrait, pay for it yourself #EgoAct https://t.co/j64f90VcFo"]["Reintro'd #EgoAct with @BillCassidy @SenRonJohnson @McCaskillOffice to save taxpayer $, cut wasteful spending on portraits of govt officials https://t.co/awZwIHw4wT"]["We must make every effort to have a comprehensive entry-exit system for those coming in/out of our country 2/2 https://t.co/aWmIsJarSA"]["Congratulating Rodney Howe on his award from @KABtweet. Thanks Rodney, for all your work to protect our environment!  #ProudNebraskan https://t.co/KFSha46atC"]["Welcoming the NE Dry Bean Commission to the Senate today. #ProudNebraskan #FeedtheWorld https://t.co/WTMPepVlEy"]["After passing @SenateCommerce today, the #DIGITAct is one step closer to being law. #IoT can change our lives &amp; change the world. https://t.co/20DA1wVB4q"]["Happy to see the #DIGITAct, bill I intro’d with @CoryBooker @SenCoryGardner @SenJoniErnst, approved by @SenateCommerce today #IoT"]["With these commonsense, bipartisan solutions, we can protect families, prevent fraud, &amp; spur innovation. (2/2) https://t.co/xiJBYgB8LT"]["Today three of my bills passed @SenateCommerce: #KarisLaw, the Spoofing Prevention Act, &amp; DIGIT Act. (1/2)"][".@SenateCommerce markup happening now on 3 bills that I have led: Kari’s Law, DIGIT Act, &amp; Spoofing Prevention Act"]["Happy to see the House passed 2 bills that I have led in the Senate: Kari's Law &amp; Spoofing Prevention Act. @SenateCommerce to markup 2morrow"]["Glad to hear @POTUS has named @AjitPaiFCC as FCC Chair. Look fwd to working together to promote innovation &amp; keep rural America connected."]["America’s peaceful transition of power is extraordinary. Read more about #Inauguration2017 in my weekly column: https://t.co/k3iG2cqEcR"]["I look forward to working with General Mattis to provide our military with the resources they need to keep American families safe."]["Experienced &amp; honest, Gen. Mattis is exactly the type of leader our nation needs right now, given the many dangers we face around the world."]["I send my sincere congratulations to General Mattis on his confirmation for the position of Secretary of Defense."]["My full statement on #Inauguration2017 https://t.co/A67UrLQCJJ"]["“Let us strive on to finish the work we are in, to bind up the nation's wounds, to care for him who shall have borne the battle...” #Lincoln https://t.co/UzDUWTYXv9"]["“Let us, then, fellow citizens, unite with one heart and one mind” #TJsWords #InaugurationQuotes https://t.co/875h8mNKXp"]["“… and will to the best of my ability, preserve, protect and defend the Constitution of the United States.” #PresidentTrump #Inauguration17"]["The swearing in of a new president is one of the defining features of our republic #Inauguration2017  #PeacefulTransferofPower"]["Ronald Reagan was the first president to be sworn in on the Western side of the Capitol because he wanted to face CA #Tradition"]["Check out my Instagram for pictures from the #Inauguration2017 ceremonies https://t.co/UzeEgN61Oa"]["\"This great nation will endure as it has endured, will revive and will prosper” #FDR #PresidentTrump #InaugurationQuotes https://t.co/09hq8mFaeC"]["Today I’m proud &amp; humbled to witness history #inauguration #PresidentTrump #PeacefulTransitionOfPower https://t.co/aTsR6UxNXq"]["Great view from the platform this morning. Looking forward to today’s ceremony #Inauguration2017 https://t.co/q4wCNSqgIo"]["Powerful moment: Walking through the halls of the Capitol with my fellow senators on the way to #Inauguration2017"]["Great to have so many Nebraskans here for this historic event #inauguration2017"]["“Intelligence, patriotism, Christianity and a firm reliance on Him who has never yet forsaken this favored land” #Lincoln #InaugurationQuote https://t.co/TV87jSv9He"]["What does inauguration look like from a Senator’s POV? Follow me on Instagram https://t.co/UzeEgN61Oa"]["Inauguration day is here! Thankful to represent the great people of Nebraska. #Inauguration2017 https://t.co/s1uQWE1zeB"]["Happy National Popcorn Day! Fun Fact: Nebraska is the largest producer of popcorn in the U.S. #ProudNebraskan https://t.co/5vQjgu5enU"]["Great exchange w Sec. of Commerce nom Wilbur Ross at today’s @SenateCommerce hearing. We covered trade, NE ag &amp; IoT. https://t.co/6u8l3hQTXA https://t.co/phwO6U1Bg1"]["#StratFor Subcommittee has direct oversight of U.S. Strategic Command, which is located at Offutt Air Force Base in Bellevue, NE (3/3)"]["In this role, I will work to ensure America has a nuclear deterrent that is modern &amp; effective https://t.co/O6pmOBEuSH (2/3)"]["Honored to serve as chairman of the @SASCMajority Subcommittee on Strategic Forces for the 115th Congress (1/3)"]["In @SASCMajority, we just approved the nomination of General Mattis to be the next Secretary of Defense. #KeepingAmericaSafe"]["In Scott Pruitt's @EPWmaj confirmation hearing, I highlighted the harmful EPA regulations Nebraskans have faced over the past 8 years. Watch https://t.co/5z48Gc2C7s"]["With this seat @ the table, I can continue ensuring NE’s voice is heard in the Senate’s highest levels. https://t.co/pTO7ESgbtD (2/2)"]["Grateful @SenateMajLdr has again asked me to serve on his leadership team. (1/2)"]["TUNE IN NOW: questioning Secretary of Commerce nom. Wilbur Ross at @SenateCommerce: https://t.co/36QWEBx4nD"]