["I joined @SenWarren to introduce the Protecting Veterans from Predatory Lending Act of 2018, bipartisan legislation that would protect #veterans from targeted predatory home loan practices. \n\nhttps://t.co/cK0z8OkINt"]["Congratulations to Joyce Woodhouse, who retires today after 39 years as the Executive Director of the North Carolina Corn Growers Association. Thank you for your dedicated years of service and advocacy for NC farmers and growers. #ncag"]["I had the chance to speak with DACA recipients, including one from Goldsboro, NC, outside my office today. Congress is working hard to reach a bipartisan agreement for DACA youth and securing our borders. https://t.co/rJ5SZEN3YE"]["Great to see #TaxReform benefiting hard-working Americans. https://t.co/SY7PblQ9re"]["Joining @Varneyco on @FoxBusiness to discuss #immigration. Tune in!"]["Earlier today I appeared on @MSNBC with @HallieJackson to talk about reaching a deal to secure our borders and provide a solution for the #DACA population. https://t.co/JUq1nFieHy"]["More than a million Americans are getting a bonus because of #TaxReform. Charlotte Pipe and Foundry is one of the latest companies to announce they are giving their employees a raise. https://t.co/Qy8nODEeWw"]["Great to see @RaleighGov and @CityofHickory on this list! https://t.co/ADDnB3xcpY"]["Congratulations to @POTUS on a successful first year. I look forward to building on that success in 2018. \n✅ Tax Reform\n✅ Repealing harmful regulations \n✅ Confirming #SCOTUS Justice Neil Gorsuch\n✅ Helping #veterans get access to more timely healthcare"]["Legislation I introduced with Senator @JohnCornyn and @SenWarren to help #veterans applying for commercial driver’s licenses was signed into law. \n\nhttps://t.co/Q6UNnSTpZK"]["Today’s meeting at the White House was an important step toward reaching a bipartisan deal on DACA and securing the border. Thanks to @POTUS for inviting us to discuss. We need to get it done."]["Our law enforcement officers risk their lives every day to protect ours. Thank you to all of the men and women in uniform serving our communities. #LawEnforcementAppreciationDay https://t.co/m70a2dohCU"]["@SenatorLankford lays out some key facts about “The Wall” in this thread. Border security (infrastructure, technology, personnel) is a national imperative that should unite both parties. https://t.co/h7klyWZzUb"]["I applaud @POTUS for his speech to @FarmBureau today showing his commitment to the agricultural industry and building on the work his administration has done over the last 12 months to uphold his promise to farmers across the country. #AFBF18 #ncag\n\nhttps://t.co/oj9d6GX1Wb"]["Discussing #ImmigrationReform and #BorderSecurity on the Senate floor. Tune in: https://t.co/ACw4P8c41W #DACA"]["Not the outcome fans hoped for but still a great season. Thanks, @Panthers! #KeepPounding https://t.co/HElraUhsXf"]["“We’ve made a lot of progress on the DACA component of the bill but what has been missing are the border security and enforcement measures and I think we’ve come up with a great framework that we’ll invite the [Democrats] who want to work with us to put together,” Tillis said."]["Immigration Framework Coming Next Week, Senators Say | @rollcall #ImmigrationReform\n\nhttps://t.co/Ar1lyQXmZl"]["Thank you to @POTUS for his leadership on securing our borders and providing long-term certainty for the DACA population. I will continue to work with my colleagues in the Senate to find a bipartisan solution our country needs and many families deserve. https://t.co/lHPPSdkFnJ"]["North Carolinians, please be safe as winter weather hits. Be prepared &amp; stay informed: https://t.co/UlGb81hBVf #ncwx https://t.co/FfTzWkTNqx"]["It's been an honor to work with you, especially on the SUCCEED Act. Thank you for your service to our nation! https://t.co/XPHgR5p2db"]["Susan and I wish you a #HappyNewYear! https://t.co/xw0aNvwtX2"]["As co-chairs of the Human Rights Caucus, Senator @ChrisCoons and I issued the following joint statement on the continued #IranProtests. https://t.co/zHKCKSfEai"]["We’ve got to be willing to turn to the people in both conferences who hold extreme views and say you’re clearly not here to produce an outcome, you’re here to make a point. I’m here to make a difference and I’m looking for other people who want to make a difference. #2017inReview https://t.co/MliB4boEnv"]["“We get our staff members to think about how they want to grow in terms of knowledge and skills. We have certain expectations about developing new skills, networking and seeking out professional development opportunities.” https://t.co/pIFrRJq9gv #leadership\n\nVia @washingtonpost"]["During my first three years as a member of the Senate Veterans’ Affairs Committee, I have worked across the aisle to expand education and job opportunities for #veterans and have worked to reform the VA to assure they're getting the healthcare they need and deserve. #2017inReview https://t.co/PiexyKVsvW"]["Salisbury Post: Sen. Thom Tillis celebrates 2017 successes for #servicemembers and #veterans https://t.co/EZM9oZamXf\n\n#2017inReview"]["In 2017, as chairman of the Senate Armed Services Subcommittee on Personnel, I worked on a bipartisan basis to oversee @DeptofDefense personnel policies, including compensation, benefits, education and healthcare for servicemembers, their families, and DOD civilian employees. https://t.co/qebt8DE9pK"]["With all due respect to the @washingtonpost, their food tasters need to get their tastebuds checked out. @Bojangles1977 makes the best “fast food” biscuits, period. https://t.co/vUGHNprmyx"]["Susan and I want to wish you and your family a #MerryChristmas and #HappyHolidays. While you enjoy the holidays with your loved ones, remember the men &amp; women of our nation’s military and first responders for their service &amp; sacrifice to keep us safe. Merry Christmas &amp; God bless. https://t.co/Y5umzziNn6"]["North Carolina is proof that successfully enacting tax reform reaps tremendous rewards: more growth, more jobs, more businesses and more revenue. #ncpol #TaxReform https://t.co/k8hQttV8hm"]["Thank you to Secretary of Defense Mattis for visiting @FtBraggNC and the @82ndABNDiv today. https://t.co/rc9uwvLLM2"]["Kevin and Avonte’s Law can truly make a difference in preventing tragedies and give families across America a greater peace of mind. https://t.co/nlOAtc26i3"]["Kevin and Avonte’s Law has a deep personal meaning for me, as I was a caregiver for my grandmother during her battle with Alzheimer’s disease. We should be moving heaven and earth to help families and caregivers reunite with loved ones who wander and disappear."]["Glad to see the Senate unanimously pass Kevin and Avonte’s Law, bipartisan legislation which will support training for caregivers to prevent and respond to missing individuals with Alzheimer’s disease, autism, and related conditions.\n\nhttps://t.co/nlOAtc26i3"]["👀👀\n\n\"...He also said that about 145,000 employees will receive the bonus.\" https://t.co/X4MGNSHHpj"]["Today, POTUS signed #TaxReform into law, fulfilling a long-standing promise to deliver tax relief that benefits hard-working Americans. North Carolina families will soon notice bigger paychecks as the federal govt withholds less of their hard-earned money."]["1,400 new jobs announced in the last 7 days alone. #TaxReform continues to work in North Carolina and will work once the #TaxCutsandJobsAct is signed into law. https://t.co/doUn0Dk15g"]["Over the last 24 hours, companies have announced that over 313,500 U.S. employees will receive $1,000 bonuses and will spend $700M on job training, investment and charitable donations. \n\nThis is Armageddon, @NancyPelosi?🤔 #TaxReform"]["Today is a big win for American families and the American economy. This #TaxReform package fulfills a long-standing promise to deliver tax relief that benefits hard-working Americans across our nation. https://t.co/6eZYYUWvws"]["Proud to see Andrew Murray sworn in as U.S. Attorney for the Western District of North Carolina. His decorated career in public service will serve North Carolinians well. #ncpol https://t.co/nen2WkCR9N"]["It's always an honor to greet our nation's #servicemembers during @USOofNC's #OperationExodus. Each year, thousands of soldiers from Fort Jackson travel home for the holidays through the @CLTAirport. Safe travels and #HappyHolidays! https://t.co/O2K95z8fOW"]["Amy Wright, owner of @bittyandbeaus coffee was named @CNNHeroes 2017 Hero of the Year for her work on behalf of individuals with disabilities. The Wright family and the entire team at Bitty &amp; Beau's are an inspiration to so many. Congrats on a well-deserved honor. #CNNHeroes https://t.co/Zgpv38Ermf"]["A well-deserved award for Amy Wright, owner of @bittyandbeaus in Wilmington! I had the privilege of visiting this coffee shop and seeing the positive impact she’s making in the lives of individuals with disabilities. Truly inspiring. Congrats! #CNNHeroes https://t.co/3ZRHLNe7Or"]["A lot of people say #bipartisanship doesn't happen anymore. I wanted to share this interaction I recently had with @SenWarren, who serves on the #SASC Personnel Subcommittee with me. We won't agree on everything, but we can find common ground to move our nation forward. https://t.co/tQnMIKUiZq"]["The @USArmy decision to place the second Security Force Assistance Brigade @FtBraggNC is a testament of its role in protecting our nation and its allies, and I’m proud that 800 senior officers will join the ranks of the brave men and women already stationed there."]["#FortBragg is the tip of the spear for the U.S. military and continues to be one of the most important military installations in the world. https://t.co/UM3NetRXfD"]["👀🐶 https://t.co/MJwTmWd6xb"]["This week, we held a Senate bipartisan #SecretSanta gift exchange. Love the Abe bobblehead, Senator @timkaine. Merry Christmas &amp; Happy Holidays! https://t.co/E4z3PR7dKk"]["Since 2000, @DeptofDefense diagnosed 370,000 servicemembers with traumatic brain injury, most diagnosed in non-deployment settings. \n\n#SASC Subcommittee on Personnel heard testimony with updates on research, diagnosis &amp; treatment for TBI/concussion in servicemembers. https://t.co/k6l8UvRjh6"]["Yesterday, I had the opportunity to talk with local farmers and hear about issues that directly impact them and their livelihoods. I will continue to work on behalf of all North Carolina farmers to find solutions on issues facing the agricultural community. https://t.co/NwDzRMuKps"]["Today we honor those who lost their lives 76 years ago at Pearl Harbor. Their sacrifice will never be forgotten. #PearlHarbor76 https://t.co/254Hr9ATXF"][".@SenatorStrange has represented the people of Alabama with honor and integrity. He will be missed in the United States Senate. https://t.co/fkAGD4B3LA"][".@NancyPelosi's pandering to the far-left by threatening a gov't shutdown is the single biggest obstacle to getting a DACA deal done. Fortunately, there are adults in the Senate who are committed to casting partisan politics aside to reach a fair, reasonable deal. https://t.co/1vEaUThaV3"]["I'm talking #DACA &amp; #immigrationreform\nwith @BuzzFeedBen shortly on @BuzzFeedNews #AM2DM. Watch live right here on Twitter: https://t.co/AZsuM5971c"][".@RepDavidRLewis\nsets the record straight on Democrats' misleading attacks on NC's successful #taxreform. Reform has helped produce more revenue, more growth, more jobs.  https://t.co/7696gKvHoa #ncpol"]["\"Election\" needs to be in quotation marks. https://t.co/2UhOdXHRU2"]["I applaud @POTUS for reaffirming our commitment to our greatest ally in the Middle East by recognizing Jerusalem as the capital of Israel, following through on many years of bipartisan advocacy."]["Congratulations to Kirstjen Nielsen on becoming the new Secretary of @DHSgov. She is extremely qualified to lead the agency tasked with keeping our homeland secure, and I look forward to working with her on issues from protecting our nation to reforming our immigration system."]["The @washingtonpost story on NC #taxreform completely misses the mark. #ncpol\n\n4 yrs since tax reform:\nJobs: ⬆️360,000+\nRevenue: ⬆️Billions\nUnemployment: 8.1% ➡️ 4.1%\nRainy Day: $0 ➡️ $1B+\nBudget: -$2.5B ('11 deficit) ➡️ $550M surplus\nUI Fund: -$2.8B (debt) ➡️ $2.1B https://t.co/nZCRSSluVn"]["In the coming days, differences between the House and Senate versions of the Tax Cuts and Jobs Act will be resolved and improvements will be made, and I’m confident the end result will deliver on our promise to provide much-needed tax relief for the American people. #TaxReform"]["The Senate passed the Tax Cuts and Jobs Act, taking us one step closer to historic tax reform that will lead to bigger paychecks for hardworking Americans, and will make our nation more competitive at the global level. #TaxReform"]["Looking forward to voting for historic tax cuts that haven’t occurred for over 30 years. The Tax Cuts and Jobs Act is going to get America’s economy back on track &amp; help working families. #TaxReform https://t.co/PrpHS29qZj"]["I co-sponsored bipartisan legislation (Fix NICS Act) with Senators @JohnCornyn, @ChrisMurphyCT, @SenatorTimScott and @SenBlumenthal to enhance compliance and ensure the accuracy of the existing background check system for firearms purchases. https://t.co/Nm4fReqFVs"]["Agreed, @SpeakerRyan. #SenateJudiciary \n\n@SenatorLeahy \n@ChrisCoons \n@amyklobuchar \n@SenWhitehouse \n@SenFranken \n@SenBlumenthal \n@maziehirono https://t.co/G6xm9gmRkm"]["TODAY at 10:15am: #TaxReform event highlighting the positive impact of changing the tax code.\n\nWho: @sendavidperdue @SenDeanHeller @Marcshort45 @AFPhq @imjamesdavis @FreedomPartners @carriesheffield @GenOpp @danielggarza @LIBREinitiative\n\nWatch Live: https://t.co/AdruoaP2Vo"]["I applaud @BudgetGOP for passing the Tax Cuts &amp; Jobs Act out of committee. We are now one step closer to bigger paychecks for middle-class workers and families, more American jobs and a stronger U.S. economy. #TaxReform"]["#TaxReform in North Carolina worked. We're now the #1 state in the country for business. #ncpol #ncga https://t.co/kJ8ew9dRgT"]["@amyanntalley @JeffersonElemWS I enjoyed our conversation and appreciated the tough questions. You have a bright group of students in your class!"]["The Tax Cuts &amp; Jobs Act will provide historic tax relief to hardworking Americans, grow our economy, raise wages, and create jobs. #TaxReform https://t.co/mpCTL4P96e"]["Over 29 million #smallbusinesses in the US support our local economies every day. Let's support them today and #shopsmall. #smallbizsat https://t.co/SXG54G9TGf"]["Susan and I wish you a #HappyThanksgiving from our family to yours! We have a lot to be thankful for this year, including our new granddaughter Sawyer. We are also forever grateful to the men and women in uniform serving our country. https://t.co/e25jP0BCZL"]["Our #veterans learn a vast array of skills while bravely serving our country, and we should make opportunities to use those skills in the private sector as accessible as possible. https://t.co/jvpy3HU7b3"]["I applaud the President for quickly signing this commonsense legislation into law to reduce burdensome requirements on businesses so apprenticeship programs become more available to veterans moving forward."]["The Veteran Apprenticeship and Labor Opportunity Reform (VALOR) Act will increase access by streamlining the certification process for non-federal apprenticeship programs based in more than one state. https://t.co/jvpy3HU7b3"]["Great news — @POTUS signed the VALOR Act into law today. This law will increase access to apprenticeship-training programs for #veterans. https://t.co/KKFNjGYOiq"]["On this day in 1789, #NorthCarolina ratified the U.S. Constitution to become the 12th state in the Union. Happy 228th Birthday, NC! https://t.co/PqjtsITuxz"]["Fayetteville native Robert Wilkie confirmed by unanimous consent by U.S. Senate https://t.co/oFQzkw4Ocg\n\nvia @fayobserver @DrewBrooks"]["Proud the #Senate unanimously confirmed my Senior Advisor Robert Wilkie as Under Secretary of Defense for Personnel and Readiness. #defense https://t.co/RXHvDGtg84"]["@camp_lejeune I want to thank my colleagues on the #SASC for this bipartisan effort that will positively affect our North Carolina installations, servicemembers, and military families. #NDAA https://t.co/uGRCq8AcXD"]["I’m pleased that my provisions to upgrade @camp_lejeune and Cherry Point, improve military family readiness, and direct the DoD &amp; VA to collaborate closely on establishing interoperability with the new Electronic Health Record are included."]["The Senate passage of the #NDAA reaffirms our nation’s commitment to supporting the brave men and women in uniform and reestablishes America’s commitment to a strong national defense and protecting its interest abroad. https://t.co/uGRCq8AcXD"]["Pancreatic cancer is the #3 cause of cancer-related death in the U.S., and there is no effective early detection screening tool, 71% of patients die within one year of diagnosis. Today, I'm wearing purple for World Pancreatic Cancer Day. #PANCaware #WPCD https://t.co/gFt7NRWXwT"]["@SenJoniErnst Thank you!"]["@SenatorRounds Thank you, @SenatorRounds!"]["Susan and I recently welcomed our first grandchild, Sawyer Marie, into the world. We love her so much! https://t.co/LZh8YAWSfh"]["Chairing a @HelsinkiComm hearing on Turkey’s detention of U.S. citizens, including North Carolina native Andrew Brunson. Watch the hearing live: https://t.co/VNV4uDnyr7"]["As a caregiver for my grandmother, I know firsthand the important role of caregivers in the lives of those battling Alzheimer's disease. #HonorACaregiver #NationalFamilyCaregiversMonth https://t.co/F0sSUWEtD2"]["The allegations leveled at Roy Moore are disturbing. I have serious concerns about his prior conduct and fitness for office. He should immediately withdraw from the race."]["#NorthCarolina under the Senate’s Tax Cuts and Jobs Act:\n\nEstimated Jobs Added: 27,763\n\nEstimated Gain in After-Tax Income for Middle-Income Family: $2,366\n\n#TaxReform https://t.co/zciBCEs7YL"]["My op-ed via @fayobserver: A helping hand for veterans https://t.co/kcw8vBCSAe #VeteransDay"]["This #VeteransDay, make an extra effort to #ThankAVeteran and their family for their service to this great nation. We'll never be able to fully repay the debt that we owe them, but we can make a lot of installments as individual citizens to show our gratitude. https://t.co/YyUI7ElNJL"]["Honored to receive the @USChamber Spirit of Enterprise Award at today's @USChamberCCMC @cltchamber event. #FinancingGrowth https://t.co/BfS4JaT124"]["This will have an immediate impact on the national economy and growth. If we fail to produce a #TaxReform outcome, it will have an immediate and proportionately negative impact on the economy. #FinancingGrowth #RestoreMainStreetLending"]["LIVE with @USChamberCCMC @QuaadmanT @cltchamber: https://t.co/UaJhuSAmwS \n\n#TaxReform\n\"The House created a good baseline for tax reform. We need to produce a result. Period. End of story. We need to do it long before Christmas.\" #FinancingGrowth #RestoreMainStreetLending"]["LIVE w/ @USChamberCCMC @QuaadmanT: https://t.co/UaJhuSAmwS\n\n\"The way that we’re going to get to a sustained year over year GDP growth that will let us retire the debt, improve standard of living, get wages where they need to be, we have to have productive jobs.\" #FinancingGrowth"]["Tune in at 12:30: I'll join @USChamberCCMC @QuaadmanT @cltchamber to discuss proposals to #RestoreMainStreetLending #FinancingGrowth https://t.co/WoZvp3sYpD"]["“Some people spend an entire lifetime wondering if they made a difference in the world. But, the #Marines don't have that problem.”―President Ronald Reagan\n\nHappy 242nd Birthday, @USMC! NC is the proud home of @camp_lejeune, MCAS Cherry Point &amp; MCAS New River. #USMC https://t.co/PltF2ECxYD"]["My statement on the Senate’s Tax Cuts and Jobs Act https://t.co/3hhbc8UuFU #TaxReform https://t.co/eNL6YlFAyd"]["As co-chair of the Senate Human Rights Caucus, I urged POTUS to address human rights concerns during his trip to Asia. We must continue to stand up for those oppressed across the world &amp; raise concern with those violating human rights &amp; democratic values. https://t.co/EyR6n1Y0M5 https://t.co/zT5drjqI6O"]["My op-ed via @thehill: Congress needs to protect veterans from bad actors in VA home loan refinancing \n\nAs we celebrate #VeteransDay, we should work to make sure this benefit is truly beneficial for #veterans and their families.\n\nhttps://t.co/oSV5oZWlio"]["@SenatorBurr Loved their costumes at the #bipawtisan Halloween party. Well done, #TeamBurr! https://t.co/A5yguQESR8"]["Congratulations to @947_QDR from #Raleigh: Large Market Station of the Year at the #CMAawards https://t.co/G7knGvF7sI"]["NC is home to over 790,000 veterans. On #VeteransDay, take the time to thank a veteran and their families for their service and sacrifice. https://t.co/FresBPhZJA"]["Proud to intro legislation w/ @amyklobuchar &amp; @ChuckGrassley to aid in locating missing Autism, Alzheimer’s patients https://t.co/nood0LOMPj https://t.co/sgLOLvpuTV"]["Wishing a very happy 99th birthday to @BillyGraham! https://t.co/vqaVwd1JpO"]["My prayers are with the First Baptist Church and the community of Sutherland Springs, TX. What a horrific tragedy."]["I applaud @POTUS for selecting Jerome Powell as the next Federal Reserve Chair &amp; look forward to considering his nomination."]["My full statement on the Tax Cuts and Jobs Act: https://t.co/SvosZffa9t #TaxReform https://t.co/a7v4AmW7Is"]["Corporal Chesty XIV, official @USMC mascot, visited my office this week. The #Marines will celebrate their 242nd birthday on Nov 10. #USMC https://t.co/kln8G6T2YY"]["Proud to intro Robert Wilkie for his nomination as Under Sec of Defense for Personnel &amp; Readiness. Live @ 10: https://t.co/XdRX2TA5L1 #SASC"]["Susan &amp; I send our condolences to the Cecil family. William's contribution to the @BiltmoreEstate &amp; Asheville community won't be forgotten. https://t.co/ho1tZheExJ"]["The results are in, and the winner of the #bipawtisan Senate Halloween Costume Celebration was @SenatorFischer's dog Fred (beanie baby)! https://t.co/pixldmRx3Y"]["@AbbyFayeCamp Thanks for attending!"]["@foltzjoe Definitely one of my favorites from the #bipawtisan costume party!"]["Thanks to everyone who attended the #bipawtisan Halloween dog costume celebration! https://t.co/j9oXXhFKTT"]["Praying for #NYC. A terrible, senseless act that appears to be terrorism. Thank you to NYC first responders. #NYCBravest #NYCFinest https://t.co/YHd3X8tyXp"]["Agreed. What say you, @jaketapper? https://t.co/xcwaWYANIZ"]["Susan and I are praying for your husband and family, @clairecmc. https://t.co/36GJefNRcP"]["Joined @MetLife earlier today for the Global Technology Campus groundbreaking in Cary. #jobs #ncpol https://t.co/MAGiILwWmk"]["Rumors circulating that I’m hosting a bipartisan Senate Halloween dog costume celebration. Not rumors. It’s happening. #bipawtisanship"]["@POTUS We'll look to health care providers, law enforcement, and local communities in helping provide an effective response to the #opioidepidemic."]["I applaud @POTUS' declaration of the #opioidepidemic as a public health emergency that requires an all-hands-on-deck approach."]["Congrats, Regan, a finalist for the nation’s most prestigious science competition for middle school students: Broadcom MASTERS. #brcmmasters https://t.co/4ep8CZAiKq"]["Congress needs to recognize that we have a historic opportunity to pass #TaxReform and turn this economy around. https://t.co/Xu53pkL2lQ"]["Ready for lunch with POTUS and @SenateGOP.🍿 https://t.co/gtrZqgDD9e"]["Joining @TeamCavuto live on @FoxBusiness at 12:15pm ET to talk #TaxReform, tune in!"]["With the passage of the budget, we can now get to work on #TaxReform that will have a meaningful and lasting impact on the American people. https://t.co/XK58Z0HSWS"]["I am committed to passing the budget so we can deliver #TaxReform for the American people. https://t.co/x1seZTRBbl"]["👀 https://t.co/VTWaxYCA75"]["General Kelly is a true patriot. We can never forget the servicemembers who make the ultimate sacrifice &amp; we must support Gold Star families"]["Yesterday, in @senjudiciary hearing, I questioned Attorney General Sessions about ending Operation Chokepoint and the phase-out of DACA. https://t.co/FyIX3Z2LID"]["This law will prevent elder abuse and strengthen penalties against those who try to take advantage of our senior citizens."]["I hope all members accept that perfect legislation doesn’t happen but good legislation that moves our country forward can happen. #TaxReform https://t.co/PIqQ2Ddkb5"]["I look forward to meeting her and discussing her priorities for @DHSgov and keeping our nation secure."][".@realDonaldTrump's nomination of Kirstjen Nielsen demonstrates admin's commitment to cybersecurity. Proven experience &amp; widely respected."]["Friday, October 13: Don't miss the deadline for a Spring internship in my DC or NC offices: https://t.co/CiKNRlKrxj https://t.co/SPBtPhWk9X"]["@TripleCommunity This is a tragic reminder of the dangers first responders face each day. We are praying for the Hensley family during this difficult time."]["Susan and I send our deepest condolences to Firefighter Hensley's family and the @TripleCommunity Fire Department. https://t.co/zkCXVzUcMa"]["@FtBraggNC Staff Sgt. Black, Staff Sgt. Johnson, and Staff Sgt. Wright's sacrifices will not be forgotten."]["@FtBraggNC This is a tragic reminder of the dangers facing our brave servicemembers as they combat terrorism across the globe to keep our country safe."]["My thoughts and prayers are with the @FtBraggNC community and the families of Staff Sgt. Black, Staff Sgt. Johnson, and Staff Sgt. Wright. https://t.co/VeMGmEVCO3"]["Proud to honor Bradley Gordon &amp; Ashley Morrison of Mebane, NC @CCAInstitute #adoptionangels ceremony. https://t.co/2J0BEoStR6 https://t.co/qoAFKnOoEc"]["@NatImmForum Watch my keynote at the @NatImmForum live: https://t.co/WWhUyux9bD #LeadingtheWay17 #SUCCEEDAct"]["Looking forward to speaking about the #SUCCEEDAct @NatImmForum's \"Leading the Way: A New Approach to American Immigration\" #LeadingtheWay17 https://t.co/y6zmllHQ8N"]["Happy Birthday, Mom! I love you. https://t.co/UgSyS5ayhW"]["FEMA releases Hurricane Matthew recovery money https://t.co/FaknqQPOdA"]["Live: Senate Banking Committee with @WellsFargo CEO Tim Sloan. https://t.co/awf648OOqU"]["Editorial from @nypost on the #SUCCEEDAct. https://t.co/33xlP9rk7W"]["My op-ed with @SenatorLankford via @WashTimes: A conservative approach to #DACA https://t.co/wCzG8lfrP1"]["Susan and I send our deepest condolences and prayers to the families of the victims of this horrific and senseless tragedy in Las Vegas."]["I joined @SenatorLankford to discuss the #SUCCEEDAct on @FoxNews, a merit-based solution to address uncertainty facing undocumented children https://t.co/CipsKuiKGZ"]["Welcome back to Capitol Hill, @SteveScalise! https://t.co/CH7JL5RxR5"]["Editorial via @washingtonpost on the #SUCCEEDAct I introduced with @SenatorLankford and @senorrinhatch.\nhttps://t.co/JrgjsJqWhv"]["Joining @DanaPerino on @FoxNews @ 10:30 with @SenatorLankford to discuss the #SUCCEEDAct. Learn more about our bill: https://t.co/KXtPOZwwLH https://t.co/lAPn0lLGHC"]["GOP senators unveil new ‘Dreamers’ bill https://t.co/eO5wPOxBH7 #SUCCEEDAct \n\nvia @politico @seungminkim"]["Talking to @Morning_Joe about the #SUCCEED Act, tune in!"]["@SenatorDurbin Expedited removal only applies to those convicted of a felony/significant misdemeanor."][".@SenatorDurbin's staff let him down by not giving him the right facts. Undocumented children cannot be arbitrarily deported. https://t.co/2auWPzJzVl"]["@SenatorLankford @senorrinhatch Watch live: Introducing the #SUCCEEDAct with @SenatorLankford and @senorrinhatch. https://t.co/6PkEJ44uLr https://t.co/1KR8fd7u3X"]["@SenatorLankford @senorrinhatch .@senorrinhatch: \"We have love for these children and we're going to help them. It's just that simple.\" #SUCCEEDAct"]["@SenatorLankford @senorrinhatch .@senorrinhatch: \"We need to develop a solution that will recognize the positive contributions that Dreamers can make to our society.\""]["@SenatorLankford @senorrinhatch .@SenatorLankford \"We need to resolve the issues of #immigration. This is the moment to resolve things like #bordersecurity.\" #SUCCEEDAct"]["@SenatorLankford @senorrinhatch The #SUCCEEDAct is based on four core principles:\nCompassion.\nMerit.\nPrevention.\nFairness. https://t.co/MFajCbLZeT"]["@SenatorLankford @senorrinhatch Pursue one or a combo of three merit-based pathways to earn conditional status. #SUCCEEDAct https://t.co/W6WIEtQbzM"]["@SenatorLankford @senorrinhatch Introducing the #SUCCEEDAct w/ @SenatorLankford @senorrinhatch, a merit-based solution to address uncertainty facing undocumented children."]["LIVE: Press conference with @SenatorLankford &amp; @senorrinhatch to address the legal status of undocumented children https://t.co/6PkEJ44uLr"]["Thank you to all of the attendees who showed up for our Service Academy Day info session @NCState! https://t.co/KEP55FuuAg https://t.co/qniQ4h4V56"]["ICYMI: My Op-ed via @WSJopinion on #TaxReform\n\nTax Reform Transformed North Carolina. Congress, Take Note\nhttps://t.co/OaCyJAkAGg https://t.co/rlp7rvc2jw"]["Thank you to the brave men and women in the @82ndABNDiv who are fighting to keep our country safe. https://t.co/dlOQLvh1Nl"]["My Op-ed in @WSJ: Tax Reform Transformed North Carolina. Congress, Take Note https://t.co/qn6ApdkaHz #TaxReform"]["A great thing?? In addition to breaking the law, 10K have died crossing border over the last 20 yrs, including kids. #StopPlayingPolitics https://t.co/QkoQV4fUWS"]["It's great to see @ConcordNCgov, @KdaleNC, and @Morrisville_NC on the list! #BestPlacesToLive https://t.co/mmFINSfguV"]["Watch live: @senjudiciary noms hearing to consider Thomas Farr for U.S. District Judge for Eastern District of NC. https://t.co/u4bxAaNy1n"]["Susan &amp; I are praying for everyone impacted by the earthquake in #MexicoCity. The U.S. stands with Mexico during this awful disaster. https://t.co/k2cqrYOyH8"]["Proud this legislation I introduced with @amyklobuchar was included in the final version of #NDAA's Senate passage. https://t.co/vzN0BM4U31 https://t.co/ybocHXI3lj"]["Also, provide an across the board pay raise for #servicemembers &amp; implement important reforms to make life easier for #military families."]["Key provisions I introduced for the FY2018 NDAA will make critical improvements to #CampLejeune and MCAS #CherryPoint."]["The Senate passage of the #NDAA reaffirms our nation’s commitment to supporting the brave men and women in uniform. https://t.co/9KwxPxdKAN https://t.co/fpo5EvHvZn"]["Happy 70th Birthday, @usairforce! #AFBday https://t.co/aRLO2EM9Yq"]["🇺🇲 Service Academy Day Info Session\n📆 9/23/2017\n⏰ 10:00a.m. - 1:00 p.m.\n📍 @NCState, 2810 Cates Avenue, Raleigh, NC\n💻 https://t.co/v0damuRE0E https://t.co/F2dTvTtzG5"]["Susan and I send our deepest condolences to the family of Staff Sgt. Alexander Dalida &amp; the @FtBraggNC community. https://t.co/BJV8Zhoqg4"]["I had the honor of presenting the Silver Star Medal to Dr. Robert McKethan from North Carolina on behalf of his father, Kenneth. https://t.co/Z8dk6cNlcw"]["Please join Susan and I in praying for the families and soldiers injured today @FtBraggNC. https://t.co/sGYfHQRyrR"]["Grateful for @realDonaldTrump's leadership addressing undocumented children &amp; border security. We can reach a fair &amp; bipartisan solution."]["Joining @Sen_JoeManchin @sendavidperdue @MarkWarner @BPCAction to release bipartisan recommendations for economic growth in Appalachia. https://t.co/4Y766s0wdM"]["It's #NationalPeanutDay! In 2016, North Carolina harvested 99,000 acres of peanuts. 🥜 #ncag https://t.co/d99iYHqmkD"]["@SenDonnelly This is an important step in ensuring the SEC’s work is disclosed to the public, while still promoting growth and prosperity."]["The Senate passed S.416 I introduced w/ @SenDonnelly requiring SEC to publicly release findings from its annual government-business forum."]["A permanent solution to DACA can be achieved by creating a fair and rigorous pathway to conditional legal status. https://t.co/YdVBx7kZSj https://t.co/ZidMtIUiBd"]["If anyone experiences a power outage, please call @DukeEnergy at 1-800-769-3766. #IrmaNC https://t.co/snpYOkx1sv"]["Cheering on the @Panthers today! #KeepPounding https://t.co/ccF8a7PcEz"]["Incredibly saddened to hear about the @DukeHealth helicopter crash today. My condolences go out to the families &amp; co-workers of the victims. https://t.co/syuqtRi5XN"]["Happy Birthday @DeptofDefense Secretary Mattis! #SecDef https://t.co/WhNhV6poSH"][".@marcorubio is a great senator AND a great American. https://t.co/bgtIm4fdzf"]["Nice haircut, Curly. I'll bring a comb for you on Monday @burgessev. https://t.co/BDIJrC4del"]["Proud to co-sponsor this resolution honoring military and contract working dogs. https://t.co/jLTSpOrwZl"]["Thanks @SecretaryZinke @Interior for your leadership to ensure Swain Co receives long-overdue payment that is owed to them by the fed govt. https://t.co/GafymoLHp6"]["We need to work together to come up with a conservative &amp; commonsense path forward for undocumented children. https://t.co/YII9UdP45M https://t.co/BYUHyyljUa"]["I plan to introduce legislation addressing the legal status of undocumented children: https://t.co/YII9UdP45M https://t.co/AVuPaU0WRH"][".@TryonResort in NC will open the facility for equine evacuees in the wake of \nHurricane #Irma. Visit https://t.co/P2ZO9h1KLC for more info. https://t.co/DTtpPi6z0p"]["It’s up to my Dem colleagues to decide on a permanent solution or make it a political wedge issue. I hope they choose bipartisanship. (9/9)"]["This commonsense legislative fix can &amp; should unite members of Congress. I’ll work closely with my colleagues on the path forward. (8/9)"]["The path to earn legal status would require them to be employed, pursue higher education or serve in our military. (7/9)"]["My legislation will provide a fair and rigorous path for undocumented children to earn legal status. (6/9)"]["Undocumented children were brought to America through no fault of their own. (5/9)"]["POTUS is giving Congress time to fulfill its responsibility &amp; take long-term action on the uncertainty for undocumented children. (4/9)"]["I intend to introduce legislation addressing the legal status of undocumented children. (3/9)"]["Immigration policy must be set through legislation, not executive orders. (2/9)"]["Today, the administration announced it will phase out the Deferred Action for Childhood Arrivals (DACA). (1/9)"]["Rick Scott is a conservative problem solver. Glad to see him supportive of the RAC Act, a commonsense, conservative solution. @FLGovScott https://t.co/BQP4kYLh6C"]["The RAC Act requires young undocumented adults who came to US as minors to be employed, pursue higher ed, or serve in the military. (4/4)"]["In the coming weeks, I'll be introducing the RAC Act, a conservative solution that provides a fair but rigorous path to legal status. (3/4)"]["It’s the responsibility of Congress to address the long-term uncertainty facing undocumented minors. (2/4)"]["Immigration policy should be set through legislation, not executive orders. (1/4)"]["@Faqu59 Phil, please give my office a call: (704) 509-9087"]["I applaud @POTUS for laying out principles for tax reform that include simplifying the tax code, cutting rates, &amp; producing economic growth."]["My statement on @POTUS's speech regarding tax reform: https://t.co/XMZAhX8DG1"]["@CarltonHuffman Thank you!"]["@cgbullard Thank you!"]["@RepSinema Thank you!"]["@MikeCrapo Thank you!"]["@GarrettVentry Thank you!"]["@sendavidperdue Thank you!"]["North Carolina stands together with Texas in this time of need. Thank you to the 18th Airborne Corps for assisting the relief efforts. https://t.co/KS6QB8qz2J"]["Heartbreaking news. Thank you to all the first responders &amp; volunteers risking their lives to assist those in need. #HarveyFlood https://t.co/fJU2KZRuUU"]["I had the privilege of visiting @Rriveterbags this year to see the opportunities they are creating for military spouses. Congratulations! https://t.co/IAIf2QnCLv"]["Susan &amp; I are praying for all those affected by #HurricaneHarvey and the #houstonflood. NC will stand with you on your road to recovery. https://t.co/n93tbqOMiF"]["North Carolina is the proud home of the @82ndABNDiv. Thank you for 100 years of service! Here's to 100 more. #AllTheWay https://t.co/jmF2TVexG6"]["🇺🇸 Service Academy Day Info Session\n📆 9/23/2017\n⏰ 10:00a.m. - 1:00 p.m.\n📍 @NCState, 2810 Cates Avenue, Raleigh, NC\n💻 https://t.co/v0damv9fpe https://t.co/GFFUMpLGeE"]["All the best to N. Carolinian Kellen participating in the #FireballRun to raise awareness for missing &amp; exploited children. #ChildRescueNtwk https://t.co/ouS1yg88Ww"]["Happy Anniversary! https://t.co/VZQgn3yPfu"]["@POTUS The objectives laid out by @POTUS will help promote peace and stability in the region and ultimately make us safer here at home. (3/3)"]["@POTUS Very pleased to hear him discuss the need for America to strengthen partnership w/ India and hold Pakistan accountable. (2/3)"]["Tonight @POTUS clearly defined America’s objectives in Afghanistan and South Asia. (1/3)"]["Praying for all aboard the USS John S. McCain and hoping the search and rescue crews can find the 10 missing crew-members. https://t.co/4t1YrmyHl5"]["Awesome start to the #LLWS2017! #GoGreenville https://t.co/il336UTi7m"]["My thoughts and prayers are with the families of the officers who were shot/killed in the line of duty last night. https://t.co/GS8AsllrOR"]["@TheJusticeDept @MikeCrapo Businesses should never be targeted strictly for operating in an industry the gov't disfavors. Glad Operation Choke Point is ending. (2/2)"]["This week, @TheJusticeDept responded to concerns raised by @MikeCrapo and me by informing us they will end Operation Choke Point. (1/2) https://t.co/wj7RX6TJx8"]["Praying for the victims of the senseless terror attack in #Barcelona. We stand in solidarity with Spain in the fight against terrorism."]["The #ForeverGIBill is now law! This ensures our nation’s #veterans have the opportunity to further their education. https://t.co/KO7y4IKw0O https://t.co/jwvyKesCJx"]["Great news, Senator @JohnBoozman! Wishing you a speedy recovery. https://t.co/8y0DcMiu1k"]["@SenatorBurr @NCMBC A summit focused on current and future defense, commercial and general aviation business opportunities. #SEASAM"]["Proud to join @SenatorBurr &amp; @NCMBC to host the SE Region Aerospace Supplier &amp; Advanced Manufacturing Summit in Winston-Salem. #SEASAM https://t.co/AgVgdjFJsE"]["Susan &amp; I send our deepest condolences to the @82ndABNDiv @FtBraggNC &amp; the families of Sgt. Allen L. Stigler and Sgt. Roshain E. Brooks. https://t.co/KkpnbIQ0P6"]["The hate, bigotry and violence on display in #Charlottesville is despicable and represents the complete opposite of what America stands for."]["Congratulations and best of luck to the newest apprentices @SiemensUSA in Charlotte! https://t.co/h7wCOJsF8Y"]["Wishing my friend Senator @JohnBoozman a fast and speedy recovery. We'll see you back in the Senate in September! https://t.co/WBIhX47Shm"]["Now more than ever, all GOP officials must work together so we can advance our shared agenda to create opportunity for all Americans. (4/4)"]["@SenateMajLdr will continue to lead our caucus &amp; bring us closer together to keep the promises we made to the American people. (3/4)"]["@SenateMajLdr is the single biggest reason why Neil Gorsuch is now a SCOTUS justice. (2/4)"]["As a former Speaker in NC, I know how difficult it is to manage a diverse caucus with different viewpoints and push major legislation. (1/4)"]["Glad to see a #veteran open my #minibottlemessage @CokeCCBCC's event @FtBraggNC // via @WNCN https://t.co/qDZFcU0BHW"]["My op-ed: Washington Is Finally On Track To Provide Meaningful Regulatory Reform via @ForbesOpinion https://t.co/4Lae181a9u"]["Proud to join @CokeCCBCC to thank our troops. A special shoutout to the @82ndABNDiv @FtBraggNC! #minibottlemessage https://t.co/0qVhGqtLvF"]["Hey @IngrahamAngle, for Civics 101, @UNC (an outstanding school) offers some intro to American gov’t classes: https://t.co/vlOauIZMvH #ncpol https://t.co/AlTXdX54nT"]["Facts @IngrahamAngle: 1) I'm not-pro amnesty 2) I've been on receiving end of many negative NYT stories for leading bold conservative agenda https://t.co/SUevvsbgYX"]["@JohnCornyn @SenJohnBarrasso @SenRonJohnson This legislation increases resources at our borders, boosts trade through ports of entry, and strengthens enforcement of existing laws. https://t.co/ksON8CxWiN"]["I co-introduced the Building America’s Trust Act with @JohnCornyn @SenJohnBarrasso &amp; @SenRonJohnson. https://t.co/G9i54sU6UU https://t.co/tQ31Ab1JFw"]["If you ever need help from my office on any matter regarding a federal issue, please don't hesitate to contact us at https://t.co/v0damuRE0E"]["Joined @CNN to discuss the Special Counsel Integrity Act I introduced with Senator @ChrisCoons. https://t.co/vN9CIzsA3X"]["Praying for the families of the 2 soldiers killed in Afghanistan. Please keep the @FtBraggNC community in your thoughts and prayers as well. https://t.co/FWgycIg4ap"]["This legislation creates a judicial review process to prevent the removal of special counsels without good cause. https://t.co/fTBJONYgX7 https://t.co/6zY8FSBg3A"]["Joining @CNN to discuss the Special Counsel Integrity Act I introduced with Senator @ChrisCoons. Tune in!"]["Today @ChrisCoons and I will introduce a bill to ensure the integrity &amp; independence of special counsels. https://t.co/e8cRa41Jyo"]["Hey @TuckerCarlson check your facts. The hold on Cissna released weeks ago and DHS &amp; Trump admin agreed more visas needed to help small biz."]["Mr. Medvedev, the US has three co-equal branches of gov't, a concept you're clearly not familiar with under the Putin dictatorship. https://t.co/HwcYfuoaET"]["My statement on the confirmation of Christopher Wray to be Director of the @FBI. https://t.co/aEgdQb411k https://t.co/wuCMjAFNay"]["I am pleased @POTUS signed this bipartisan bill that imposes new sanctions on Russia, Iran and North Korea for their transgressions. https://t.co/Z7KgkSuXkT"]["Join me at 5:30pm as I hold a live Facebook Q&amp;A. Submit your questions here: https://t.co/Gc5c5zIxQq https://t.co/6O2q9tCHrl"]["Agreed. https://t.co/s46XBzjRYj"]["Congress has an obligation to keep pursuing solutions to fix our nation’s broken health care system. (4/4)"]["We promised to replace Obamacare with solutions to provide more choices and flexibility for families and individuals. (2/4)"]["We made a promise to the American people to repeal &amp; replace Obamacare with solutions that will help control the cost of premiums. (1/4)"]["I encourage the President to quickly sign this much-needed bipartisan legislation into law. (3/3)"]["These sanctions send a clear and unified message that America will hold them accountable for their transgressions. (2/3)"]["Today, I voted in favor of bipartisan legislation that imposes new sanctions on Russia, Iran and North Korea. (1/3)"]["Happy #NationalInternDay to our awesome interns! If you're interested in an internship with my office, apply at https://t.co/v0damv9fpe. https://t.co/OqOfgUTOdZ"]["I welcomed young leaders from @ALBoysNation &amp; @ALAGirlsNation to my office. Great work on representing NC! #2017BoysNation #ALAGirlsNation17 https://t.co/4IfsOxUGCy"]["My statement calling for @USDOL to simplify retirement with the implementation of 401(k) auto portability. https://t.co/tLYSFvFRaM"]["Happy to see the House overwhelmingly pass a bill to impose new sanctions on Russia, Iran and North Korea."]["My statement on the procedural vote to begin the debate on #healthcare reform legislation: https://t.co/Ep3cof2YfK https://t.co/2poRee3JfP"]["My statement on Attorney General Jeff Sessions: https://t.co/Vvpb1Z6jR1 https://t.co/rsqMmacREh"]["Looking forward to having you back, @SenJohnMcCain! https://t.co/g2etRqGlVc"]["I co-introduced legislation enhancing the post-9/11 G.I. Bill to improve #veterans' access to further education. https://t.co/KO7y4IKw0O https://t.co/Ospr8XDCe1"]["Show your support for Tilly for Cutest Dogs on the Hill! https://t.co/jqIPSN215O #Tilly2017 https://t.co/2ffyKyFzlc"]["Happy Birthday to the love of my life and my best friend, Susan! I love you. https://t.co/sywWkngjya"]["Proud of my Senior Advisor Robert Wilkie on being nominated as Under Secretary of Defense for Personnel &amp; Readiness https://t.co/FYkEjqJStl https://t.co/MfD989pLpH"]["Amen. https://t.co/Kq37ajVAyN"]["(3/3) Susan and I join all North Carolinians in praying for Senator McCain’s recovery and return to the United States Senate."]["(2/3) Courage and fearlessness have always defined his distinguished career of public service."]["(1/3) @SenJohnMcCain is an American hero and a fighter through and through."]["SOPRA takes steps to hold unelected bureaucrats &amp; regulators accountable by restoring proper separation of powers. https://t.co/Kes4Ug1anU https://t.co/UJ5a9uLdhX"]["Tilly belongs to one of my staffers! I hope you'll support her in @TheIJR's Cutest Dogs on the Hill: https://t.co/XrzfUhzMaT #Tilly2017 https://t.co/8Ge2mBO8Y9"]["#Tilly2017 https://t.co/jqIPSN215O https://t.co/MeRu0oIBh5"]["@ParkerONeal5 I would be happy to! Please email me your information here: https://t.co/SQo0YXrRLO"]["Please continue to keep Senator @kayhagan and her family in your thoughts and prayers. https://t.co/QSymzopRl6"]["My statement on @DHSgov's intention to provide up to 15,000 additional H-2B visas, helping American small businesses https://t.co/BCZxvsmsAw https://t.co/UR8UDZvceD"]["#Cancer therapy tested at #UNC gets closer to approval via @WRAL https://t.co/MFxzXfn1kQ https://t.co/fJhu8SBNyP"]["Introduced bipartisan legislation with Senator @timkaine to improve veterans’ experience when using GI Bill benefits https://t.co/QOTdnBBWMI https://t.co/yDTILx2hmW"]["My statement on the updated version of the Senate’s Better Care Act: https://t.co/gRodl3CPvN https://t.co/168oUyHOwk"]["Continuing to pray for all involved in this tragic plane crash. Please keep the Camp Lejeune community in your thoughts and prayers as well. https://t.co/78z4L8gmPv"]["A tragic reminder of the dangers our servicemembers face daily, including training missions needed to keep our nation safe at home &amp; abroad."]["Marine Corps Air Station Cherry Point and the Havelock community are in our thoughts and prayers."]["Susan and I send our deepest condolences to the families of the Marines who lost their lives in service to our nation. https://t.co/9R8qOaROef"]["Honored to spend time with @charlottefire at Station 10. Thank you to all #firefighters for your service. https://t.co/xnrCIBRIoT"]["Thanks @AlexGangitano @rollcall for including Team Tillis' office dogs, Tilly and Charlie! 🐾 https://t.co/dBXyWLR3LR"]["@Panthers Well played. https://t.co/7IjIYGZFqD"]["Great to see @MeckSheriff Carmichael &amp; the Mecklenburg Co. Sheriff's Office. Thank you for serving North Carolinians. #MCSO #MeckSheriff https://t.co/IfGr4Zb4qL"]["Happy Birthday, President George W. Bush! Thank you for your ongoing commitment to honoring and empowering our nation's veterans. #43turns71 https://t.co/wqXXiMW1sG"]["Wishing you all the best and praying for your quick recovery, Rep. @SteveScalise. https://t.co/mvOzWw5u26"]["Law Enforcement faces many dangers, like being targeted because they wear a badge. This is a tragedy &amp; I send my condolences to her family. https://t.co/FFqkory3YN"]["Grateful this #IndependenceDay to the men and women of our Armed Forces and the thousands of veterans across NC. Happy Birthday, America! https://t.co/1u53A04DJd"]["100 sit-ups: no problem \n17 pull ups: maybe \n22:40 three-miler: makes me light headed https://t.co/PVaewprse3"]["Called on @SenateMajLdr to cancel the August work period if progress isn't made on funding the government &amp; dealing with the debt ceiling. https://t.co/PkePjdLYZs"]["@DrewBrooks @fayobserver @FtBraggNC @camp_lejeune The NDAA includes $10M for schools that serve military children w/ severe disabilities https://t.co/EA1OfaUKEy via @DrewBrooks @fayobserver"]["@DrewBrooks @fayobserver @FtBraggNC @camp_lejeune The NDAA sets aside $25 million in supplemental impact aid for schools that serve military children."]["@DrewBrooks @fayobserver @FtBraggNC @camp_lejeune Cherry Point will receive more than $15M in construction &amp; Seymour Johnson AFB will receive more than $26M. https://t.co/EA1OfaUKEy"]["@DrewBrooks @fayobserver In the NDAA, @FtBraggNC will see more than $57 million in construction on four projects for the special operations community."]["The Senate version of the NDAA sets aside nearly $358M for construction at NC military installations https://t.co/EA1OfaUKEy via @DrewBrooks https://t.co/eKijnsfLnX"]["I secured key provisions in the NDAA to help improve quality of life for #servicemembers and military families. https://t.co/MVMvSgRU7J https://t.co/aR5wFgCl1m"]["@NateWeixel I finally have a reason to use this photo. Thanks, @SenPatRoberts! https://t.co/mhtIaJouHE"]["Happy 30th Anniversary, Susan! You are the love of my life and my enduring source of strength and inspiration. 🥂 to another 30 years! https://t.co/lmuGz4vlLp"]["Happy to have two NC educators in our nation's capital for the #LCTeachInst @TeachingLC program bringing @LibraryCongress to our schools!"]["I co-signed a letter to @DeptVetAffairs @SecShulkin demanding answers for Veteran’s Choice Program funding shortfall https://t.co/nI3tgp0yUi"]["Congratulations to Dr. Akinleye on being selected as the next Chancellor at @NCCU! https://t.co/GHZfgGst9r"]["My statement on the Senate #healthcare draft. https://t.co/4yGW8CUV4x https://t.co/Er1sXazdTL"]["(2 of 2) Congratulations to the Congressional Award Gold Medalist from North Carolina! #EarnedIt #Gold2017 https://t.co/JnUak2k5N0"]["(1 of 2) Congratulations to the Congressional Award Gold Medalist from North Carolina! #EarnedIt #Gold2017 https://t.co/Lclm9pmxc2"]["Honored to serve North Carolinians in the U.S. Senate with @SenatorBurr! #NationalSelfieDay #ncpol https://t.co/AU3Z3grshy"]["As a caregiver to a loved one who battled Alzheimer's Disease, I will continue to fight to #ENDALZ. #TheLongestDay https://t.co/O7DatX4vEl"]["Thank you for the Champions of the Merit Shop Award, @ABCofCarolinas! #abcmeritshopproud https://t.co/TWDSHe5iab"]["Providing top notch constituent services has always been my top priority. We're ready to lend a helping hand: https://t.co/tmOCY5Amme https://t.co/grM92P8Pvf"]["Proud to join @BPC_Bipartisan this morning to talk about how we can improve #ruralhealth. https://t.co/PAMijk6lSk"]["Deeply saddened by the passing of Otto Warmbier. His tragic death is a direct result of the N. Korea regime's brutal disdain for humanity. https://t.co/yo1CeWdW4l"]["My op-ed: Honoring the sacrifices made by #lawenforcement | @salisburypost https://t.co/7pYvr3PQja"]["Being a father is the greatest blessing of my life. Wishing all dads a Happy #FathersDay! https://t.co/Q3pMgQgOJK"]["My prayers are with the families of the seven @USNavy sailors. #USSFitzgerald https://t.co/kandy5yv2n"]["Military #caregivers need to be empowered, appreciated and recognized for their service. #HiddenHeroesHearing @DoleFoundation https://t.co/LzjBbFTkPY"]["New sanctions will hold Russian and Iranian regimes accountable https://t.co/jhAE79J5bY https://t.co/LH7vxfnHsz"]["I don't think I've ever agreed with @ValerieJarrett, but I do on this one. We should let Robert Mueller do his job. https://t.co/w7OrwPiWRA"]["Read my op-ed honoring the #lawenforcement officials who protect us every day via @JournalNow. https://t.co/IDlAwS7gky https://t.co/0OJZIMcU52"]["Thankful to Capitol Police for putting themselves in harm's way yesterday and undoubtedly preventing further injury and maybe loss of life. https://t.co/eM2O8DQ1l1"]["Ruth was a wonderful wife and mother who was dedicated to making our world better, and she is greatly missed. #ncga"]["Grateful #ncga passed a resolution commending my dear friend and former Rep Ruth Samuelson for her service to NC. https://t.co/l27q5w5bxR https://t.co/6EMZUGFZAF"]["Grateful to Mary &amp; Tom Ward for traveling from Wilmington to advocate on behalf of caregivers. #HiddenHeroesHearing #Marine #Veteran https://t.co/8pI3gLYW39"]["Today I voted in favor of an amendment to place new sanctions on Russia as punishment for meddling in our election."]["Happy Birthday, @USArmy! Thank you for 242 years of service and sacrifice protecting our great nation. #ArmyBDay #FlagDay https://t.co/xNov2CWj5w"]["This is terrible. Praying for @SteveScalise and all others who were injured. https://t.co/QyxgO4l8WT"]["The sanctions are well-deserved for a govt that displayed aggressive eagerness to meddle in our elections &amp; attack its neighbors unprovoked."]["Glad the Senate reached a bipartisan agreement to strengthen &amp; expand sanctions in response to oppressive actions of Putin &amp; his cronies."]["A new trauma center at #CampLejeune will help save lives. Read my op-ed in @JDNews: https://t.co/aT3YCPx9ZQ"]["Proud to welcome Ted Lehman as my new Chief of Staff. Grateful to @senjudiciary leaders @ChuckGrassley &amp; @SenFeinstein for their kind words. https://t.co/66YJlPsTVA"]["Happy 93rd Birthday, @GeorgeHWBush! https://t.co/hqEaTc8IUg"]["Susan and I send our deepest condolences to the family of Corporal Dillon Baldridge. We are forever grateful for his service &amp; sacrifice. https://t.co/H0JCRv0RSy"]["Good luck today, @WakeBaseball! #GoDeacs #RoadToOmaha https://t.co/18c9Y31VuK"]["@springsjulie81 @dcbaseball_ Don't worry, I didn't forget them! ⚾️"]["Best of luck to @WakeBaseball in the Super Regional against the Florida Gators! #GoDeacs ⚾️ https://t.co/I1ZiCvTdl0"]["Cheering on @dcbaseball_ in the Super Regionals against Texas A&amp;M! #CatsAreWild #RoadToOmaha ⚾️"]["I co-sponsored bipartisan legislation giving @deptvetaffairs authority to dismiss bad employees &amp; better serve vets. https://t.co/EqDzf93dvU https://t.co/Vv0mQzP4Js"]["Leading the Comey hearing, @SenatorBurr is demonstrating why North Carolinians have repeatedly entrusted him to represent them. #ncpol"]["Join me this Thursday for a Facebook Q&amp;A. I'll be answering your questions live at 6:00 p.m. https://t.co/pbOGiNAeXI https://t.co/y6XdtAwQvO"]["Proud to announce Ted Lehman as my Chief of Staff. https://t.co/5YOU2N2aqi https://t.co/01NO3EXQtc"]["Never forget the sacrifice and bravery of the Allied forces who stormed the beaches of Normandy, France 73 years ago. #DDay #DDay73 https://t.co/ZdKt7IJo2C"]["I applaud @DeptVetAffairs on the decision to address longstanding electronic records issues that plague the #VA. https://t.co/V8O2m1XlEj https://t.co/sCwFC8h4jd"]["My heart goes out to the people of #London after yet another cowardly, senseless terror attack. America will always stand with the UK."]["My op-ed with @RepDavidEPrice | We’ll keep fighting for Hurricane Matthew aid | https://t.co/VZ8J0s7kCf https://t.co/66vVB3wG8f"]["June 2 is the deadline to apply for an #internship in one of my offices. Apply online: https://t.co/v0damv9fpe https://t.co/W3vnZjXHSd"]["@camp_lejeune The joint military-civilian trauma system will be the first pilot program of its kind in the nation. https://t.co/ggvvR7fEPu"]["I hosted a #military roundtable to announce an integrated military-civilian trauma system @camp_lejeune. https://t.co/ggvvR7fEPu https://t.co/aiKxVVJdup"]["Sen @amyklobuchar &amp; I led a group of senators in calling for Pentagon funding &amp; research of burn bit exposure. https://t.co/tDAI4A65IN https://t.co/khilgH87Af"]["Take a moment today to remember and honor the men and women who paid the ultimate sacrifice in defense of our freedoms. #MemorialDay https://t.co/y37h0DSeQA"]["Happy 💯years of service fighting for our great nation, @82ndABNDiv @FtBraggNC! #AAW100 https://t.co/2psROg51Po"]["News that the BCBS of NC #ACA rates may increase by an average of 22.9% in 2018 is more proof we need reform that works for NC families."]["95% of counties in North Carolina have only one insurer with an average monthly premium increase of 176% since 2013. #Obamacare https://t.co/F9ugvfEhGo"]["This evening, @SenatorBurr will join me to host a telephone town hall. Listen live and submit questions at 5:30 pm: https://t.co/OFiNYpeOiK https://t.co/IWejWAMyrr"]["Horrible images out of #Manchester. My thoughts and prayers are with everyone affected."]["Video: 'Amnesty doesn't work' Tillis says at #immigration meeting via @newsobserver https://t.co/P7I0W4vfJe #ncpol"]["Participating in an #Immigration Roundtable @raleighchamber. #ncpol https://t.co/4NuFUxTS5o"]["Today, we honor the men and women of our Armed Forces and thank them for their service to our country. #ArmedForcesDay https://t.co/lnG0xKLwUn"]["Congratulations @DrinkCheerwine  on 100 great years! https://t.co/1rVfDCx8xm"]["We love our office pups! https://t.co/u7DQQp1KbV"]["The deadline to apply for a fall #internship in one of my offices is approaching. Apply online: https://t.co/eN9QQj3Obc https://t.co/bCxqpCqeE5"]["My statement on the selection of Robert Mueller as special counsel: https://t.co/pIhCaP3YEu https://t.co/UOgP221pjP"]["Chris Cornell's cover of Michael Jackson's \"Billie Jean\" is one of the best of all time. Sad to hear this news. https://t.co/bxxNEMR9KV https://t.co/DhC18aRAIm"]["I’ll join @BoThompsonWBT at 8:05am on @wbtradio’s Morning News."]["Wonderful news this afternoon. Susan and I are going to be the proud grandparents of a baby girl this Fall! https://t.co/V60SUKOl6g"]["Great to see the #ncga House pass #RaiseTheAgeNC bill. Much needed reform to state's juvenile justice system. Thank you @ChuckMcGrady #ncpol https://t.co/BuweQCWRKz"]["I'm happy to be back to work on Capitol Hill after receiving a clean bill of health. Thank you for all the prayers and well wishes. https://t.co/qBeETOs5Hg"]["I'm doing well. Looking forward to getting back to work. Thanks for all of your prayers and well wishes. #CapChallenge https://t.co/uQGQp85qzR"]["Assad is one of the most heinous, murderous despots of our time. The leaders of Russia &amp; Iran have blood on their hands for propping him up."]["Assad’s regime is attempting to hide its heinous atrocities against the Syrian people from the rest of the world."]["#NationalPoliceWeek A time to reflect on the officers who made the ultimate sacrifice &amp; thank those who continue to protect our communities. https://t.co/aDyC6py4z1"]["Happy #MothersDay to these three amazing mothers and one soon-to-be! Our family is thankful for their unconditional love and support. https://t.co/OfPiRv1b0y"]["This Saturday, I'm joining @UFCW and @NALC_National to #StampOutHunger! https://t.co/eix4OD0cpZ"]["He served the Hickory community for nearly two decades. Our thoughts and prayers are with Donna and his family."]["Saddened to hear of the passing of my friend Rudy Wright. Mayor Wright was a fierce advocate for the city and people of Hickory. https://t.co/TtkRKc4Niv"]["Join me this evening at 5:15 pm for a Facebook Q&amp;A. https://t.co/pbOGiNAeXI https://t.co/W5gvdNfKyD"]["May is #ALSAwarenessMonth. Veterans are 2x as likely to get ALS &amp; there is no cure. We must work to find an effective treatment. #ALSAware https://t.co/CIgXtTvUkN"]["My statement on the dismissal of @FBI Director James Comey: https://t.co/Ag9XpRladP https://t.co/4mIjhT4mZP"]["@jllevasseur Jess, You can read my statement on my website: https://t.co/BcAQ0SApKN"]["Join me this Thursday for a Facebook Q&amp;A. I'll be answering your questions live at 5:15 pm. https://t.co/upubnpr3hD https://t.co/k9091vHI2K"]["Congratulations to Victoria &amp; Caleb, 2017 NC @PruSpirit Award Honorees, for their remarkable service to North Carolinians. #PruSpirit2017 https://t.co/pcyUJLev44"]["@kbuck4o Important Facts About The H-2B Visa Program: https://t.co/wbxuuVW3EZ https://t.co/U1IBTOC3Ji"]["@LDEckert According to a study conducted by @AEI, on average, every H-2B worker creates or sustains 4.64 American jobs. https://t.co/wbxuuVW3EZ"]["@LDEckert H-2B visas fill needs for American small businesses when there aren't enough able &amp; willing American workers to fill the positions."]["We are at a time when we need strong leadership in the @usairforce, and I have confidence Dr. Wilson is up for the task. #AirForce https://t.co/LcEzRRIHHg"]["Thank you to all North Carolina teachers! #NationalTeachersDay https://t.co/KXnSFd1Nzs"]["Joined a bipartisan group of senators urging @POTUS to prioritize advocacy for democracy &amp; respect for human rights. https://t.co/ii1rGL0mdd"]["NC Military Fact: @FtBraggNC is the largest military installation in the U.S. with 65k soldiers &amp; 38 Generals. #MilitaryAppreciationMonth https://t.co/CTnpRsPzP5"]["Sending my thanks to nurses, including my daughter Lindsay, for their dedication to the vital work they do. #NursesWeek #NationalNursesDay https://t.co/1rgk08VPyb"]["Joined @SenGaryPeters to call for robust funding for State Veterans Homes that provide long-term care for #veterans. https://t.co/y2jbzr9lCd"]["Now that the House has passed the AHCA, the Senate will get to work to make major changes and improve the legislation. https://t.co/JUzr7OkLBF"]["The FY17 Omnibus will bolster our national security, increase defense spending and provide more funds to help secure our border. https://t.co/YlQL5OxQfX"]["Join me in celebrating all teachers for Teacher Appreciation Week. Thank you for inspiring and educating students. #ThankATeacher https://t.co/8Nz9BZ5Zi8"]["An awesome story about NW Cabarrus High School in Concord, NC. Enjoy watching the @Yankees, Christian! @CabCoSchools @Dream_On_3 @k4coleman https://t.co/tYXg9L2GKn"]["We should leave the Senate's legislative filibuster intact. 60 votes = #bipartisanship required. That's a good thing. https://t.co/lcMsT4VQal"]["I welcomed Zoe &amp; Madeline, twins from NC, to my office during their visit with @ZEROTOTHREE for #StrollingThunder. #ThinkBabies https://t.co/4U6AfLx10w"]["My office is ready to help if you're experiencing difficulty with a federal agency. https://t.co/CmjmObGxuQ via @The_Robesonian https://t.co/ofKVaWR5dr"]["My heart goes out to the family and friends of First Lt. Weston C. Lee. His leadership, commitment, and sacrifice will not be forgotten. https://t.co/IKbHc5z5zV"]["Shocked to hear about the passing of @binker, a great journalist and an even better human being. My prayers are with his family. #ncpol"]["TODAY is @DEAHQ's National Prescription Drug Take-Back Day. Visit https://t.co/jhuZKgxqBo to find a drop-off location. https://t.co/GRIJd8fTpN"][".@SteveKingIA We need to secure our border. That requires proposing realistic solutions that can win support in both chambers &amp; get to @POTUS' desk. (3/3)"][".@SteveKingIA There’s a lot of campaign-style rhetoric in Congress about border security and immigration but nothing to show for it. (2/3)"][".@SteveKingIA these are thousand ft. cliffs on the US-Mexico border I mentioned. A 30-ft. wall won't do anything to secure this area. (1/3) https://t.co/YcE2KxgCYz"]["Saturday is @DEAHQ’s Prescription Drug Take-Back Day. Find a location to drop-off unused prescription drugs: https://t.co/ZERxC9z6au https://t.co/PiWpSS1RtZ"]["I believe deep cuts in this area would be shortsighted and dangerous while we face multiple national security challenges around the world. https://t.co/gYvZyXtebJ"]["Susan and I send our deepest condolences to Sgt. Megan Lee Callahan's family following this horrible tragedy. https://t.co/OTl1T6BhJr"]["Last night, I joined @TuckerCarlson on @FoxNews, where I discussed the most effective ways to secure the United States’ Southern border. https://t.co/XLeCw8Zvqg"]["Joining @TuckerCarlson live on @FoxNews at 8:30pm to discuss border security."]["A reminder to join my telephone town hall tonight at 5:30pm. Listen online: https://t.co/QP1ygRi7hB https://t.co/WwvUUWXoqK"]["Congrats to @SecretarySonny, our next Secretary of Agriculture. I am confident he will be a perfect fit for @USDA. https://t.co/WCOwbT89Bo https://t.co/xHgOZsKihN"]["@dawnsky57_1980 The telephone town hall is on Tuesday, April 25 at 5:30pm."]["On Tuesday at 5:30pm, I'll be hosting a live telephone town hall. Listen live: https://t.co/QP1ygRi7hB https://t.co/nDHXXPgMQF"]["Proud to join the @HelsinkiComm and promote human rights, military security, and economic cooperation in the 57 countries involved. https://t.co/UQnDanuU4G"]["Happy 109th Birthday, @USArmyReserve! https://t.co/61zUTTSHWt"]["Heartbreaking news, my thoughts and prayers go out to his family. https://t.co/zboUxkC3AL"]["@SenJohnThune Congratulations!"]["I enjoyed meeting @waketechcc students &amp; leaders to discuss the #cybersecurity training and #veterans programs. https://t.co/8izji2Lc8X https://t.co/EEJ8ReoXZJ"]["Inspiring story from the #BostonMarathon. Way to go, Staff Sgt. Jose Luis Sanchez! #Marine #Veteran https://t.co/zYS2M0iS11"]["A great day in NC visiting #veteran owned @SoPinesBrewing, a business run by military spouses @Rriveterbags &amp; finishing the day @FtBraggNC! https://t.co/JlaIamiZa0"]["(2/2) The leader of #Chechnya is a Putin loyalist, and no surprise Putin is denying these shameful #HumanRights violations are taking place."]["(1/2) #Chechnya officials are kidnapping and torturing gay men. I condemn this gross violation of #HumanRights. https://t.co/6dAddJwh2J"]["#HappyEaster from my family to yours! https://t.co/OePQ1XwrR2"]["Earlier this week, I visited the @NCNationalGuard Armory in Kinston. #NCNG https://t.co/PxrCU6BCXw"]["Today in Raleigh: Discussed #SmallBiz with @nfib_nc, cybersecurity &amp; veterans programs @waketechcc &amp; chatted with The 4th Down Foundation. https://t.co/wr5vdZcKH6"]["Today, I joined the @nfib_nc in #Raleigh for #SmallBiz day! https://t.co/BckMglAFZu"]["Happy #NationalPetDay to Ike &amp; Libby Tillis, and my office mascot, Tilly! https://t.co/RM9GaCkENY"]["Happy #NationalSiblingsDay to this bunch. A special shoutout to our Mother (front and center) for her love and support. #family #siblings https://t.co/vgBBzfmLxB"]["Please keep Maj. Gen. Espaillat and his family in your thoughts and prayers. I'm grateful for his service in the @USArmyReserve. https://t.co/kvSTPPUkxG"]["Congratulations to Judge Neil #Gorsuch, our next #SupremeCourt Justice. #SCOTUS https://t.co/0wtJnJY5wD"]["Great to see 5 NC #HBCUs will be @hcasc nat'l tournament on Saturday.\nGood luck @ecsu, @uncfsu, @NCCU @NccuHCASC, @ncatsuaggies &amp; @WSSURAMS! https://t.co/eEy70KnYmw"]["@Proicou Contact my office at https://t.co/nUheCz5t14."]["My statement following the U.S. military’s airstrikes in Syria. https://t.co/hG560Tue1t"]["This week, the Morar's from Greensboro visited my office to drop of a @UNC_Basketball shirt. #NationalChampions #GetIntoIt #GoHeels https://t.co/CNk9YE9yfU"]["Saddened by legendary comic Don Rickles passing. He built a legacy as a roaster extraordinaire, dedicating his life to making people laugh. https://t.co/1i3PJdEK7q"]["Senate Democrats in 2016:\n#WeNeedNine\n\nSenate Democrats in 2017: \n¯\\_(ツ)_/¯ https://t.co/Z4itY2yTVs"][".@nikkihaley (7/7) Freedom and value of human life are foreign concepts to despots like Vladimir Putin."][".@nikkihaley (6/7) Russia meddles in elections of the U.S. and other Western democracies."][".@nikkihaley (5/7) Putin’s political opponents are arrested or assassinated, and the media is controlled by the government."][".@nikkihaley (4/7) The sad truth is Putin doesn’t care and never will. He’s former KGB. Look at how he runs his own nation as a dictator."]["(3/7) As UN Ambassador @nikkihaley asked today: “How many more children have to die before Russia cares?”"]["(2/7) Assad has committed countless atrocities against his own people, and Russia has given his regime cover every step of the way."]["Watch Now: Joining @MelissaAFrancis on @FoxNews to discuss Judge Neil Gorsuch's confirmation. #SCOTUS #ConfirmGorsuch"]["Happening Now: Taking your questions live on Facebook. Tune in! https://t.co/7wAviHPoQb"]["Judge Gorsuch is a supremely qualified and mainstream nominee and I urge Senate Democrats to allow an up-or-down vote on his confirmation. https://t.co/SKJWaVt6GC"]["Please join me on Wednesday for a Facebook Q&amp;A. I'll be taking your questions live at 12pm ET. https://t.co/upubnpr3hD https://t.co/bf0OeMAk7J"]["Congratulations @UNC_Basketball! #nationalchampions #goheels https://t.co/y05sJrCj1q"]["Good luck to @UNC_Basketball tonight! #NationalChampionship #GoHeels https://t.co/WMvMHUZOBK"]["I'm joining @autismspeaks to #LightItUpBlue for #WorldAutismAwarenessDay! https://t.co/uiO9NrVvTD"]["Hoping for an all Carolina championship! #GetIntoIt #ForeverToThee #FinalFour"]["I'm fighting to ensure #veterans affected by toxins at #CampLejeune get the care they need and deserve. https://t.co/hoWfJwVuO6 https://t.co/8UKN62nWQG"]["This bill will help citizens in the Charlotte metro area &amp; across the country who live w/o quality radar coverage. https://t.co/TLCHgbJnXZ https://t.co/mHUikbl9AS"]["I have been an advocate for investing in Alzheimer’s research &amp; supporting caregivers and will continue to support efforts to #EndALZ. https://t.co/lq7BbxMtCb"]["Judge Gorsuch interprets the law faithfully, thoughtfully &amp; consistently. I look forward to confirming him soon. #ConfirmGorsuch #SCOTUS https://t.co/NX98qERpOd"]["Today is the final day to apply for an internship with my D.C. or state offices. Apply online: https://t.co/FKpVgi3Kha https://t.co/7ZbORMJfAB"]["Earlier this week, I welcomed members of the @ncsymphony to my D.C. office. They had the opportunity to perform @kencen. #SHIFTmusic https://t.co/EG2EdWdIkx"]["A bright young group of @NorthCarolina4H delegates visited my office this week. https://t.co/JUXlBvgUll"]["My statement on the North Carolina General Assembly's vote to repeal House Bill 2. #NCGA #ncpol #HB2 https://t.co/dR6yp0es3b"]["Last week, members of my staff and I enjoyed competing in the Southeast Raleigh Million Step Challenge, averaging over 14,700 steps/day. https://t.co/QdEbx6yOk4"]["My staff attended a ribbon cutting for @biomerieux_inc new production line in Durham. Its growth will increase innovation &amp; help save lives. https://t.co/v9qlCI4qB6"]["Tillis moves to cut costs for @NationalGuard, reservists traveling to drills https://t.co/b3M3p5UvzN via @nsjnews https://t.co/nPGzCB10lN"]["Pray for the safety of the @82ndABNDiv and all of our #troops deployed. https://t.co/g5qYphWgHb"]["Congratulations to @UNC_Basketball on advancing to the #elite8! https://t.co/Z6sRNHcRAo"]["The deadline to apply for an internship in my office is approaching. Apply online: https://t.co/xvsp8Wnp52 https://t.co/QEayYnhSNe"]["On the one-year anniversary of the Brussels terror attacks, my thoughts and prayers go out to the  people of London. #PrayForLondon"]["Gorsuch sailing through Supreme Court confirmation hearing, helped by Sen. Tillis https://t.co/iznOHHFAvs via @MichaelDoyle10 #SCOTUS"]["Happy #NationalAgDay! Thank you to farmers in North Carolina and across our country for your hard work on behalf of NC and the world. https://t.co/jP5oP3tygH"]["Congratulations to @cmlibrary for being a @US_IMLS #NationalMedal finalist! Keep up the great work enriching the Mecklenburg community! https://t.co/ClX2vTrfoi"]["I was honored to receive the Order of the Long Leaf Pine from former Governor Pat McCrory. #ncpol https://t.co/eZ0BD2kwYy"]["Joining @Varneyco on @FoxBusiness at 9am ET to discuss #SCOTUS nominee Neil Gorsuch."]["My opening statement @SenateJudiciary hearing on the nomination of Judge Neil Gorsuch to the Supreme Court. #SCOTUS https://t.co/BJEhXGAS2b"]["Congrats @UNC_Basketball on advancing to the #Sweet16! #MarchMadness https://t.co/ORLgJ84eSN"]["Please keep Officer Freeman's family in your thoughts and prayers. https://t.co/OgkWC5pj5m"]["Joining @MariaBartiromo on @SundayFutures @FoxNews at 10:30am to discuss the Neil Gorsuch confirmation. #SCOTUS #ConfirmGorsuch"]["Grateful to all of the first responders for working tirelessly to contain the #RaleighFire! Thankful there were no serious injuries. https://t.co/73e3cxFNnL"]["@CharlotteLatin"]["I had the opportunity to meet #RegeneronSTS finalist Michael Yang from Matthews, NC. I congratulate and applaud him for his hard work! https://t.co/CPxt6MaTB8"]["Happy #StPatricksDay! https://t.co/jLOWxhrVVK"]["I joined a bipartisan group of senators working to protect whistleblowers who shine light on waste, fraud &amp; abuse. https://t.co/IFXSxmyrd8 https://t.co/Ed732Ha6dA"]["Overdue justice is coming to those #veterans who were affected by tainted water while serving @camp_lejeune. https://t.co/RGT2dwWqEl https://t.co/ZTgg26QNKG"]["My pick to win it all: @UNC_Basketball! #MarchMadness #UNCBBall #GetIntoIt https://t.co/GQUAkrRKcJ"][".@SenatorBurr and I called on @SecShulkin to act in response to the report about wait times at NC medical centers. https://t.co/6ujzfblru1 https://t.co/vFXuqQhiz5"]["Proud to intro bipartisan legislation that grants additional visas to Afghans aiding the U.S. mission in Afghanistan https://t.co/pQyItKS58C https://t.co/ARkOQjn0oF"]["Perpetrators of the “Marines United” scandal must be punished. I'm confident @USMC will take swift action to seek justice for the victims. https://t.co/EjiMPOddTe"]["Via @GregBarnesABC11: Senators Urge #VA Hospital Action After Troubling Report https://t.co/hdfDbWoNlx"]["Congratulations to all the North Carolina teams who are going to the NCAA Tournament! #selectionsunday https://t.co/gdgdlirjVF"]["I enjoyed meeting @CapeFearBSA Eagle Scout Ronald Timothy King. He delivered the Report to the Nation to my office. #BSA2016RTN #BSAImpact https://t.co/spwaJvKnBR"]["I discussed my #immigrationreform framework during a roundtable hosted by @BPC_Bipartisan. https://t.co/c3Dm2a9yvG"]["Thank you for your leadership, @GenRobertNeller. Those involved in victimizing and degrading their fellow Marines must be held accountable. https://t.co/rqyEXcK4nU"]["My statement on Congress’ efforts to repeal #Obamacare and reform the nation’s broken #healthcare system. https://t.co/jPtyfjjTpp"]["Happy to see NC continuing to lead the way on juvenile justice reforms w/ @ChuckMcGrady's Juvenile Justice Reinvestment Act. #RaiseTheAgeNC"]["@MariposaFlorida @JPemberton15 There should be a play button to the left of \"Event Live Now.\""]["@JPemberton15 Thanks for your participation, you may submit a question here: https://t.co/SQo0YXrRLO."]["Tonight, I'm hosting a live telephone town hall to have a conversation with North Carolinians. Listen here: https://t.co/soCacetsi2 https://t.co/itudDx9ETj"]["@NCHumanities Thank you for visiting my DC office! Keep up the great work on behalf of all North Carolinians."]["My offices are accepting applications for summer #internships until March 31. Apply online: https://t.co/CiKNRlKrxj https://t.co/294PItwodU"]["This morning, I had the privilege of welcoming Chaplain Sharad Creasman, from Brevard, NC to open the #Senate in prayer. https://t.co/u14nq7ns5x"]["Congratulations @RealBenCarson on being confirmed as the @HUDgov Secretary."]["It was great to meet leaders from North Carolina HBCUs for the #HBCUFlyIn. Thanks @RepMarkWalker &amp; @SenatorTimScott for hosting this event! https://t.co/H4opcCQqUY"]["Proud to be a part of this discussion, tune in now! https://t.co/9ScWd6iXeB"]["I'm focused on making #healthcare more available to #veterans. We want to empower the @DeptVetAffairs, not privatize it. https://t.co/kiWsSirOUH"]["Happy Birthday @SenatorFischer and @SenatorStrange! https://t.co/YiudNta477"]["Discussed my views on #immigration and #healthcare reform, and the need for #bipartisan action with @varneyco this morning. https://t.co/yqLAk9hpxc"]["@tuxedocatgirls I'm grateful to him for his service. Have him contact my office if he's having issues with the VA: https://t.co/v0damv9fpe"]["This week, I had the honor of meeting with North Carolina #veterans from the @AmericanLegion. https://t.co/nRFg4KZYMK"]["Capt Glisson is currently deployed from Marine Corps Air Station Cherry Point. Thank you for your service! #USMC https://t.co/9LeeaEBxVG"]["I'm filling in for the @VAChair at the joint Senate &amp; House VA Committees hearing w/ @AmericanLegion. Tune in: https://t.co/6KrDjcqNxJ"]["Looking forward to joining @Varneyco on Fox Business at 9:15 to talk about my trip to the border &amp; the speech by @POTUS last night. Tune in!"]["My statement following @POTUS' address to a joint session of Congress. #JointAddress https://t.co/MTwsZhEkPb"]["A powerful moment in @POTUS' #JointAddress. God bless the Owens family. https://t.co/xfjm0x1cPa"]["I'm looking forward to @POTUS' #JointAddress tonight. https://t.co/1Uk5FWJ8zS"]["As my Chief of Staff, Ray displayed  leadership &amp; passion for working on behalf of North Carolinians. I wish him &amp; his family all the best."]["Congratulations to @NCAgLawyer on his new position as Special Assistant to @POTUS for Ag, Trade, &amp; Food Assistance! https://t.co/2bWB4pH1ef https://t.co/vLgKeDopzW"]["I'm looking forward to welcoming him to the Senate, @BrevardCollege! https://t.co/hPEqcEUULI"]["We will always be a nation that proudly cherishes the freedom of religion."]["I hope federal law enforcement quickly bring the perpetrators to justice. Anti-Semitism has no place in our society."]["The multiple bomb threats against Jewish Community Centers in Charlotte, Asheville and across the nation are profoundly disturbing. https://t.co/SeZBYMufkd"]["Proud of the grads celebrating their victory over substance abuse &amp; addiction. Thanks, @trosaweb, for helping these individuals recover. https://t.co/hMzvHldVLG"]["I visited Texas with a congressional delegation to gain firsthand knowledge of challenges facing our country &amp; those protecting our border. https://t.co/H7OwyjSM1G"]["Proud to join @SenBobCorker in his efforts to eliminate slavery worldwide. #EndSlaveryAct #EndItMovement https://t.co/x2ucs1Z2hi"]["Introduced bipartisan legislation that will protect probation officers and enhance their ability to do their job https://t.co/Vuk1cnXxZP https://t.co/jDz9B1xQpL"]["Great to see North Carolinian Nancy White on this list! Thanks for caring for wounded warriors &amp; their caregivers. #HiddenHeroes https://t.co/PKiDwVuL4R"]["Thank you @CustomsBorder for allowing us to visit the border in Texas and discuss our nation's border security. https://t.co/I5X2OjaTDq"]["Happy 76th Birthday, @USCGReserve! #USCGR75"]["Welcome to Twitter, @SecShulkin! I look forward to working with you to deliver timely and quality #healthcare to our nation's #veterans. https://t.co/ahiRIjsbPN"]["I enjoyed meeting with Kristine Hughes and @SONC_BeAFan yesterday! #SOHillDay @SpecialOlympics https://t.co/SY0AGUUDwz"]["There needs to be a culture where it’s OK to say the military shouldn’t be imposing these hardships. https://t.co/WfEEBifb4b"]["I joined @SenatorBaldwin to introduce the BRAVE Act, a major win for both #veterans and employers who hire them. https://t.co/ymexnCVpkL"]["A great story about the @GarnerPolice making Khamari Campbell an honorary officer! #northcarolina https://t.co/X4ZveMGHGv"]["My 30th #Valentines Day with my sweet wife Susan. She is the love of my life and the loving mother of our beautiful children. I love you! https://t.co/xO15nkClks"]["Proud to support Dr. Shulkin's confirmation as @DeptVetAffairs Secretary. I look forward to working with him in my role on the VA committee. https://t.co/WjW5muePPc"]["Over the weekend, I discussed my #bipartisan #immigration reform framework with @FoxNews. https://t.co/0OLTwAcyfF"]["Welcome home, @82ndCAB @82ndABNDiv! https://t.co/AQsnMIPgt9"]["I had a productive meeting with Judge Gorsuch, who is going to make a great #SCOTUS justice. We look forward to having him confirmed soon. https://t.co/DVhre7cUad"]["Attorney General Sessions will follow the rule of law, be accessible &amp; address the organizational &amp; accountability issues plaguing the DOJ."]["I introduced bipartisan legislation with Sen Klobuchar to help #veterans who have been exposed to toxic burn pits. https://t.co/A1OnB1lPLJ https://t.co/yDKeJWc3L7"]["Joined a bipartisan group of senators to send a letter to @POTUS calling for greater investment in Alzheimer’s research. #EndALZ https://t.co/PsbwuNfMAZ"]["10 Places to Explore African-American History in North Carolina via @VisitNC https://t.co/21NooL9INq #BlackHistoryMonth"]["ICYMI: My #immigration reform framework https://t.co/MKX4QgoeRt https://t.co/c4CI862137"]["Happy Birthday, Senator @JohnCornyn! https://t.co/Ulkhswbz5e"]["Congress needs #bipartisanship to produce results: https://t.co/t2hujywKy0 https://t.co/RGGcIuMk2x"]["I join my fellow North Carolinians to reflect on the African-American history and heritage in our state and country. #BlackHistoryMonth https://t.co/E35NcbdOI9"]["Perfect description of Neil Gorsuch, @SenSchumer. It’s why you voted for him before. He’ll be a great SCOTUS justice. https://t.co/Z0uHf1JK6p"]["Judge Neil Gorsuch is an incredibly qualified and mainstream choice to serve on the #SCOTUS. https://t.co/O3rGzDQhqJ"]["My North Carolina offices are accepting applications for spring internships which start immediately. Apply online: https://t.co/v0damv9fpe https://t.co/eJvu8f7oxF"]["@Susulee63 Susan, Please have him or his family contact my office at https://t.co/v0damv9fpe or (704) 509-9087."]["I joined Senators Shaheen​ &amp; McCaskill to send a letter to SecDef Mattis following POTUS' immigration exec order. https://t.co/lIzWgw1e0e https://t.co/R6kbsjcwUR"]["North Carolinians: if you or anyone you know has a green card and is stranded at an airport, reach out to my constituent services team. https://t.co/Mwtbk0CWJE"]["It's clear implementation of the executive order has caused mass confusion &amp; unintended consequences, particularly for green card holders."]["Strengthening our vetting process for people coming into this country is a matter of national security."]["The @NewsandRecord highlighted my framework for a broad #immigration overhaul in its latest editorial. https://t.co/fmduuYVebQ"]["My statement on the immigration executive order. #ncpol https://t.co/qbjAvu9qme"]["It is a sad day as we say goodbye to fmr Rep. Ruth Samuelson. Please continue to lift her family up in prayer. Photo: NCGA Brims &amp; Bows 2013 https://t.co/yhVEcdyzy2"]["Today, North Carolina received more than $198M in federal assistance from @HUDgov for Hurricane Matthew recovery. https://t.co/R1HhLGBoH1 https://t.co/lg24ZYmtLU"]["Susan and I are praying for former Senator @kayhagan as she continues her recovery. https://t.co/XWdMiDcTwi"]["@PeterHamby In my defense, I might be the biggest @Panthers fan in Congress &amp; this was taken during the Super Bowl run last year. #noregrets"]["Good luck to @WSSURams &amp; @NCATSUAggies this weekend at the Honda Battle of the Bands! #HBOB #WSSU #NCAT"]["#SchoolChoice is allowing families across the nation to make decisions that work best for their children to receive a quality education. https://t.co/u6nvZT8zit"]["Read more about my bipartisan #Immigration reform framework https://t.co/NHoHloyKjX https://t.co/V5hANHeywv"]["Proud to vote to confirm @nikkihaley as our new @UN Ambassador."]["Today has truly been a great day. This morning I met our newest office puppy, and this afternoon I met our newest office baby. #TeamTillis https://t.co/LL8SJCXnO1"]["#KeystoneXL pipeline would support thousands of good-paying jobs across a range of industries &amp; be done in environmentally conscious manner."]["Tilly belongs to a member of my staff. Considering her for our office mascot, @seungminkim! https://t.co/7qjxG5vIXU"]["Heartbroken to learn of the passing of my dear friend Ruth Samuelson. Ruth was a wonderful wife, mother &amp; leader. We will miss her so much."]["The deadline to apply with @fema is Monday, January 23. Visit https://t.co/tJdVbKr4z2 https://t.co/MNit4tRel5"]["Shameful that rioters are destroying fellow citizens' property &amp; displaying open contempt for our tradition of a peaceful transfer of power."]["Congratulations to @realDonaldTrump on becoming the 45th President of the United States of America. #Inauguration #Inauguration2017 https://t.co/A6kNcyCGPK"]["Susan &amp; I have enjoyed welcoming North Carolinians to my office in #DC for #inauguration. #ncpol https://t.co/aLpUz5vH2v"]["Honored to welcome Josh and Michael to my D.C. office. Grateful to them for their service to our country. 🇺🇲 https://t.co/1wtADOXAC7"][".@POTUS' commutation of Manning sentence is the ultimate act of disrespect to our intelligence community &amp; our allies. #ManningIsATraitor"]["Great work, @OrlandoPolice. RIP Lt Clayton, your service and sacrifice will never be forgotten. https://t.co/JNBa8ioYDb"]["I will be hosting a Facebook Live Townhall TOMORROW at 2:30pm. Please submit your questions on my Facebook page. https://t.co/q8LXkfWOEZ https://t.co/HSrj61UQP0"]["@rosesareblue  I ask for your patience as we conduct tele-townhalls in every part of the state. https://t.co/7V0MSOSFPN"]["@TheNewChrissy  I ask for your patience as we conduct tele-townhalls in every part of the state. https://t.co/ssr6K3ONyd"]["@mtada71 I ask for your patience as we conduct tele-townhalls in every part of the state. https://t.co/wtmvptlaey"]["@Aljones6510 I ask for your patience as we conduct tele-townhalls in every part of the state. https://t.co/JFSNR1siZ3"]["@DonnaLanclos I ask for your patience as we conduct tele-townhalls in every part of the state. https://t.co/RYah74s7kO"]["@coreybwilliams I ask for your patience as we conduct tele-townhalls in every part of the state. https://t.co/uVNMQLQkyR"]["@JessCulpepper I ask for your patience as we conduct tele-townhalls in every part of the state. https://t.co/6SEo2Vt5pP"]["@carlhurdmba I ask for your patience as we conduct tele-townhalls in every part of the state. https://t.co/0kkGacJmgo"]["@BeAgrestic I ask for your patience as we conduct tele-townhalls in every part of the state. https://t.co/OMzEy7HSaX"]["@ClaveJamie I ask for your patience as we conduct tele-townhalls in every part of the state. https://t.co/KyZPCiWci8"]["@TWW_NC I ask for your patience as we conduct tele-townhalls in every part of the state. https://t.co/oCCYoTT7VO"]["@ezeela I ask for your patience as we conduct tele-townhalls in every part of the state. https://t.co/YWA13DirMC"]["Read my op-ed in @theobserver: Voters didn’t give Republicans a mandate https://t.co/QKHa1abMdX https://t.co/EkWLC98q5Z"]["Grateful to spend #MLKDay doing a service project @HighPointU with @UAHPU packing blessing bags for homeless veterans. https://t.co/fMb9VJsORR"]["On #MLKDay, we celebrate the life &amp; legacy of a man who changed history by leading the fight for freedom &amp; opportunity for all Americans. https://t.co/lzbrRciVB7"]["Justice for eugenics victims wouldn't be possible w/o Rep Womble's activism. Susan presented him a copy of my bill that was signed into law. https://t.co/VGLu6Z1Zau"]["My office is accepting applications for legislative, communications and judicial internships. Apply online: https://t.co/mN7WzWQnmc https://t.co/Ci8XLbaPen"]["Thanks for your tireless efforts to bring justice to these veterans, and to @DeptVetAffairs for granting disability benefits to the victims. https://t.co/yWiZKyrcIk"]["Check out some of my favorite photos from the 114th Congress in my latest e-newsletter: https://t.co/4BqJoVMvz4 https://t.co/D4MPlOwvYz"]["@fitz4boys Thanks for passing this message along, Amanda! I'm glad Nick was able to help you."]["Thank you, @VP Biden, for your dedicated service to our nation and leadership of the Cancer Moonshot initiative. I wish you all the best!"]["@Sile765 I am committed to repealing AND replacing #Obamacare. Thanks for contacting my office!"]["@Shannon1031 Sorry, our phones have been ringing off the hook in DC. I'm glad you reached my Raleigh office! https://t.co/kq0ACuOqKW"]["Republicans are committed to fulfilling the promise of affordable health care for every American by repealing and replacing #Obamacare. https://t.co/cz14j6L3yz"]["This morning, the Senate passed the #Obamacare repeal resolution that allows the Senate to begin the repeal and replace process."]