["@PattyMurray @SecretaryZinke New York deserves the same level of protection as @SecretaryZinke is giving our fellow Americans in Florida."]["@PattyMurray @SecretaryZinke .@PattyMurray is right. The Trump admin’s proposal to open up vast swaths of the coast – including off Long Island &amp; NYC – for reckless oil drilling can be summed up as: spill, baby, spill. Any accident off this coast would be devastating to our beaches, fishing industry &amp; more. https://t.co/rgnXgkGLiD"]["There's one word for this kind of behavior: shameful. https://t.co/q1PKK2niN3"]["We must settle the fate of #Dreamers &amp; as the meeting at the White House showed, passing DACA protections into law is within reach. But if @SpeakerRyan &amp; the hard right in the House coalesce behind @RepGoodlatte’s proposal on #DACA, then we’ll have no deal."][".@SenateDems are leading the fight against the opioid epidemic. We will not turn our backs on our constituents who'll benefit most from funding lifesaving treatment &amp; prevention programs. https://t.co/yPaOsWg21b"]["Bipartisan passage of the INTERDICT Act was a major step in fighting the opioid crisis. Now we need the President's signature on that bill, &amp; an agreement on the budget. https://t.co/Pfbk3iAQ75"]["Federal funding, made possible by the 21st Century Cures Act, helps communities combat the opioid crisis by supporting lifesaving prevention, treatment &amp; recovery programs. Congress MUST double down on this effort as part of the budget deal."]["In the Capital Region, in 2016, there were 111 opioid-related deaths, up 5% from 2015 and in the North Country, in both 2016 &amp; 2015, there were 59 opioid-related deaths."]["In 2016, there were 340 opioid-related deaths in the Hudson Valley  -up 15% from 2015- and 343 opioid-related deaths in Western New York -up 11%."]["In the Southern Tier in 2016, there were 125 opioid-related deaths, an increase of 39% from 2015"]["In the Rochester &amp; Finger Lakes region, in 2016, there were 172 opioid-related deaths, a 45% increase from 2015."]["In Central New York, in 2016, there were 242 opioid-related deaths, an increase of 53% from just one year before."][".@SecretaryZinke's political flip flop on Florida has only deepened our resolve to defend our precious waters &amp; coastal communities. If it's wrong for Florida, it's wrong for other states too. https://t.co/dYFTCichi2"]["Everybody agrees that Russia interfered in our election in 2016, but what this report so clearly shows is that Russia has been interfering across the globe for years and will absolutely not stop without a unified counter. Read more from @SenatorCardin: https://t.co/sVJOX6IvRl"]["I applaud @SenFeinstein for her commitment to sharing the truth with the American people. We must avoid partisan distractions &amp; diversions from the Russia investigation."]["@SenatorTester @SenSherrodBrown @SenatorDurbin @SenStabenow @SenatorHassan @SenateDems We must provide aid to disaster-stricken areas of our country still recovering &amp; rebuilding from storms, hurricanes &amp; wildfires: Texas, Florida, Louisiana, California &amp; the western states, Puerto Rico &amp; the USVI. American citizens need our help &amp; we must reach an agreement. https://t.co/pHnBRJICzT"]["The only way to guarantee peace of mind &amp; legal status for the #Dreamers is to pass DACA protections into law. A resolution to the #DACA issue must be part of a global deal on the budget."]["Let me be VERY clear: this ruling last night in no way diminishes the urgency of resolving the DACA issue. On this, we agree with @WhiteHouse, who says the ruling doesn’t do anything to reduce Congress’ obligation to address this problem now. https://t.co/lsUPHeETLI"]["Standing w/ @SenJackReed, @SenSherrodBrown, @SenatorShaheen to talk about Democrats’ domestic funding priorities in the ongoing spending bill negotiations. LIVE: https://t.co/pZ4M8rNoTo https://t.co/Uud4Eywbnn"]["Did you know @realDonaldTrump’s administration would rather spend $18B on a wall than:\n-upgrade border surveillance aircraft, \n-hire new CBP officers,\n-fund video surveillance with infrared cameras?\nRemember when he said Mexico would pay for the wall? https://t.co/ktJfTLg7as"]["Exactly @SarahHuckabee https://t.co/6nInqFu9kV https://t.co/mvNqD2Dlxq"]["Re-upping. https://t.co/7qlhY9AMMl"]["When we force a vote on the #NetNeutrality CRA, the American people will see whose side Republicans are on."]["You better believe Democrats will make #NetNeutrality a major issue in 2018."]["Eliminating #NetNeutrality &amp; a fair &amp; #openinternet undermines entrepreneurs &amp; crowds out creativity. That's why we're gonna force a vote. https://t.co/9vhaJcoxEg"]["@realDonaldTrump Meanwhile Trump Administration wants to cut back smart border security measures to pay for their wall. READ:\nhttps://t.co/XQ6OS1yg2k"]["@SenateDems More LIVE from the floor: https://t.co/eAufClMRbx"]["More on our negotiations &amp; @SenateDems fight for the programs families need more soon on the Senate Floor: https://t.co/Q5Tl0fInfl"]["Why can't the GOP come to a budget agreement? Surely my Republican friends can’t be concerned about the deficit, not after adding over $1.5 trillion in red ink to give a tax break to the richest Americans &amp; the biggest corporations."]["Republicans will rue the day they passed this “America-last tax policy” #GOPTaxScam\nhttps://t.co/Z23InqoM1f"]["The Trump Administration’s decision will separate families, hurt communities &amp; local economies, &amp; betray our values as a country of refuge for those in need. I stand with all marching &amp; gathering against it. #SaveTPS"]["The administration’s decisions to end TPS for 200k + Salvadorans is heartless &amp; reckless. Some of these people have lived in the U.S. for close to 2 decades, they have deep ties to their community, jobs, &amp; children who were born in this country. We must #SaveTPS"]["Moms like Stephanie shouldn't have to bury their sons. They also shouldn't have to demand their gov't fund the programs that could save others' lives. #opioids #MondayMotivation https://t.co/3yieAgFgEb"]["Back in Washington ready to get to work. Our MUST DO this week: make sure we support the men &amp; women in uniform AND fund the programs American families rely on. https://t.co/fMXbHEcn8V"]["Which @NewEraCap to wear today? Definitely this one. #GoBills #LetsGoBuffalo @buffalobills #BillsMafia https://t.co/anvP1IpR86"]["@POTUS @CustomsBorder As a major port of entry, JFK International Airport should be amongst the first locations to receive @CustomsBorder’s new high-tech drug scanners once this bill is signed into law."]["Illicit fentanyl shipped to the U.S. from abroad through mail &amp; express consignment carriers is fueling the opioid epidemic. @POTUS must sign INTERDICT Act &amp; help @CustomsBorder fight back."]["The Attorney General’s decision to rescind the Cole memo was a very bad one &amp; I oppose it."]["Americans are depending on the upcoming budget deal to beat back the opioid scourge &amp; bring better access to outpatient treatment services &amp; recovery &amp; other support programs. @SenateDems believe anyone battling drug addiction should have the resources they need to recover. https://t.co/gL4iFQBCem"]["Just a few weeks ago the @CDCgov released a report that says life expectancy in the U.S. has fallen for the second year in a row. And one of the big reasons? Drug overdose deaths. https://t.co/NA6bdGDo93"]["This CRA will restore #NetNeutrality &amp; undo the evil repeal of it by the @FCC. Everyone, everyone, everyone deserves the same access, &amp; should get behind our CRA &amp; push to restore #NetNeutrality! https://t.co/eFkctgQwcb"]["Another one of the many, many, many reasons Congress must pass a disaster aid package that treats all states &amp; territories -like #PuertoRico- fairly, giving the people necessary relief. https://t.co/GelWwwH0d3"]["ICYMI: Alabama's newest Senator was sworn in this week - make sure you're following @SenDougJones! #SenateDems #FF https://t.co/Hr4GrQMmLS"]["No community, city or state is immune to the opioid epidemic. It takes parents, children, teachers, first responders, heroes &amp; friends. More on why the gov't MUST help fund the fight from Westchester starting soon."]["This regulation is simply a roundabout attempt to allow for the sale of junk insurance, which would actually up out-of-pocket costs for many, particularly leaving older Americans &amp; those with pre-existing conditions with utterly unaffordable health care costs &amp; fewer choices. https://t.co/44XUAwa5OV"]["Another clear example that @POTUS &amp; his admin will stop at nothing to sell out our oceans &amp; lands to highest bidder:  https://t.co/xU2keoHKzy"]["Speaking LIVE on the Senate Floor - tune in: https://t.co/Oy1mmcmalK https://t.co/9mexqrpdXx"]["This shows that ill-founded proposals that just appeal to a narrow group of people won’t work, and we hope they’ll learn this lesson elsewhere."]["We had a positive &amp; productive meeting &amp; all parties have agreed to continue discussing a path forward to quickly resolve all of the issues ahead of us."]["And my GOP colleagues should no longer be given a pass if they fail to speak out – or take action – against this behavior. Their silence is complicity in the degradation of the Presidency."]["President Trump can no longer be given the benefit of the doubt that comes with learning one of the toughest jobs in the world."]["President Trump’s foreign-policy-by-tweet is doing serious damage to the country. My Republican friends, the time is now to stand up &amp; say to President Trump: stop tweeting &amp; start leading."]["Congrats to our newest Senators @SenTinaSmith and Senator Doug Jones! https://t.co/7SNLPzQqFN"]["We have two weeks to negotiate a budget deal that must also address a host of other items, #ExtendCHIP, community health centers, disaster aid, and of course, the #Dreamers. Heading to the floor soon to discuss in depth. Watch LIVE: https://t.co/Q5Tl0fInfl"]["The opioid crisis is stealing our youth. Rick shared his son Jamie's story with us just a few weeks ago, and we're back today fighting for families like his. https://t.co/kquFtO0JC8"][".@SenateDems are back in Washington, laser-focused on what’s important to the middle class: fighting the opioid crisis, supporting America’s veterans, &amp; protecting the pensions American workers have earned."]["The Iranian people should have the right to protest without fear of intimidation &amp; violence from their own government. #IranProtest"][".@buffalobills fans are proving once again why they live in the City of Good Neighbors. What an outstanding way to show their gratitude to @andydalton14. #GoBills https://t.co/HtC9A5gJwF"]["Starting 2018 off right with some great food &amp; great conversation with Long Islanders at the Park City Diner! #happynewyear https://t.co/cQiuyxZAmt"]["The last time the @buffalobills were in the playoffs, I was a freshman senator at the end of my first year in office. I may have lost some hair, but the fans in WNY have never lost faith. #GoBills"]["To @Giants owners John Mara and Steve Tisch: Because of talent and loyalty, PLEASE keep Eli and draft a new offensive line. Line, not Eli, is the problem. #GiantsPride #WASvsNYG"]["I hope some of my Republican colleagues will read this excellent oped by conservative columnist Bret Stephens: https://t.co/bVoOOOmu5z"]["Praying for those NYers we lost in the tragic fire in the Bronx tonight, those fighting for their lives &amp; the @FDNY &amp; 1st responders there at the scene who saved so many."]["Look at all the companies that are already using their #TrumpTax break for stock buybacks that do nothing to help average Americans: https://t.co/OBdT6dtVrM"]["From ‘08-‘15, @ATT paid an avg tax rate of 8% but the company now has tens of thousands fewer employees. Tax breaks don’t lead to job creation, they lead to big CEO salaries &amp; money for the very, very wealthy. https://t.co/SMChXlULEm"][".@ATT celebrated the #GOPTaxScam’s tax windfall for corporations, saying it will boost the economy &amp; create jobs, then turned around &amp; laid off over 1,000 workers. Proof positive this #TrumpTax helps big corps &amp; the wealthy &amp; leaves the middle class behind. https://t.co/SMChXlULEm"]["Saddened to hear of the passing of news icon Irv Weinstein. He was a Buffalo news legend, and he will be missed. #Buffalove @WKBW"][".@realDonaldTrump’s Christmas Eve pronouncement from Mar-a-Lago: Santa to the Rich, Scrooge to the poor:  https://t.co/jcyF3ulsws"]["Today, the President gave himself an early Christmas present - an estimated $11 million tax cut. Who paid for it? My middle class constituents in New York. https://t.co/FoMAXyWXY7"]["What’s the #GOPTaxBill worth? To @realDonaldTrump, $11 Million. https://t.co/pX6hV5rX2s"]["It’s not just @POTUS who’ll gain millions from the #GOPTaxScam. His #SwampCabinet will benefit too: https://t.co/8FKFgaVjKi"]["The GOP rushed their tax bill through from the start, ignoring the concerns of the American public. My office has heard from over 65,000 NYers on the tax bill in the past 2 months, here’s where they stand:\n\n94.1% 👎\n5.8% 👍"]["There are only two places where America is popping champagne over the #GOPTaxScam: The @WhiteHouse &amp; the corporate boardrooms, including Trump Tower."]["The #GOPTaxScam does not sit well with the American people right now, &amp; it won't sit well with them next year either. https://t.co/PSWyzOLTdW"]["Today it's clear as day: Republicans stand with the wealthiest few - not with the middle class. #GOPTaxScam"]["My deepest condolences to the Jahnes family and also to the Nyack Fire Department and the Rockland community for their terrible loss. https://t.co/gEOHe3wy7u"]["I believe the entire Republican Party, will come to rue the day they voted for the #GOPTaxScam."]["Yet again, Republicans showed their only priority is to give the richest few a bigger piece of the pie."]["I plead w/ my GOP colleagues: Vote no &amp; prevent taxes from going up on mils of middle-class families. Vote no &amp; stop 13M Americans from going w/out health insurance. Vote no so we don’t add $1.5 trillion to the deficit. Vote no &amp; have bipartisan debate befitting the US Senate."][".@SenateGOP: in poll after poll after poll, the American people overwhelmingly oppose this tax bill. https://t.co/zDZS2hrK7E"]["The AARP believes the #GOPTaxBill is such a menace that they were compelled to oppose it publicly. https://t.co/SBeyxrw8H2"]["What a disgrace. That's what this bill is. It's an absolute disgrace. There is no reason for a single middle-class family to pay more while every single corporation pays less."]["What are Mr. Mueller’s discreditors so afraid of? It’s obvious, when you are afraid of the result, you attack the process."]["Mr. Mueller is one of the most trusted &amp; respected public servants. He’s as straight a shooter as they come. Impugning his motives &amp; calling his investigation a “witch hunt” or a “coup” is frankly hysterical."]["Over the past several months, the investigation &amp; the FBI have been the target of a smear campaign by Republicans in the media &amp; by several Republicans in Congress to discredit the investigator &amp; the investigation itself, by falsely painting it as biased or partisan."]["Special Counsel’s investigation is an impt one for our democracy. We have to get to the bottom of what happened &amp; find out how Russia was able to wage a successful info campaign to influence our election &amp; to what extent it was in coordination w/ anyone from the Trump campaign."]["The @WhiteHouse should now withdraw Mr. Garrett’s nomination &amp; quickly nominate a chair that will fulfill the mission of the Ex-Im bank, &amp; in the meantime, @SenateMajLdr should quickly to confirm the 5 pending Ex-Im noms &amp; restore a quorum so that the bank can fully operate."]["Tomorrow, Republicans will have a chance to vote down the #GOPTaxBill, which is one of the least popular pieces of legislation in the last 30 years. If they do, they’ll find a Democratic party that’s willing to work with them on real, bipartisan tax reform."]["The GOP's tax bill is a cynical one-two gut punch to the middle class – raise their taxes to pay for corporate tax cuts &amp; then decimate their earned benefits as a kicker."]["Know this: the #GOPTaxScam will explode the deficit, starving our investments in ed, infrastructure &amp; research. After all that, it will endanger #SocialSecurity, Medicare &amp; Medicaid, when, a few yrs down the line, the GOP slashes those prgms to pay for the deficit they created."]["At a time when our economy is stacked against the middle class &amp; in favor of the wealthy, #GOPTaxScam will skew the playing field even more &amp; will explode inequality in a country where the top 1% already capture &gt;20% of the national income, while the bottom 50% take in only 13%."]["It appears the #GOPTaxScam will be before us for a final vote early this week. It will be the culmination of the sloppiest legislative process I’ve witnessed in my time as a Senator. Fittingly, the result will be a mess as well."]["My heart breaks for all affected by the derailment in DuPont, WA. While we’re learning more about the crash, we are deeply grateful to all the first responders who rushed to the scene in DuPont to help those on the Amtrak &amp; on I-5."]["There have been very few men who have done as much for Buffalo as Bob Wilmers has done. He was a brilliant banker &amp; a thoroughly decent, caring man. My wife &amp; I have spent many happy hours together with Bob &amp; his wife. The loss is the Wilmers family’s, Buffalo’s &amp; America’s."]["#AmericanDreamer &amp; Brooklynite Augustin is currently studying criminal justice, but his DACA expires in January. He needs the #DreamActNow so that he can continue studying."]["As of today 12,398 DACA recipients have lost their status. We must pass the #DreamActNow &amp; protect #AmericanDreamers https://t.co/jr0A62nFMb"]["The #GOPTaxBill is great for corporations &amp; the wealthy, but hikes taxes on the middle class, especially in the suburbs. #GOPTaxScam https://t.co/48h8RnzXxe"]["Tax hikes for millions of middle class families ➕ huge tax breaks for wealthy &amp; corporations = Even better odds the House &amp; Senate become Democratic in 2018"]["@FCC Congress must act. That's why I am throwing my full support behind a resolution to restore the 2015 Open Internet Order &amp; put our much-needed #netneutrality rules back in place."]["Repealing #NetNeutrality rules was like a last minute Christmas gift from the @FCC to the biggest players in the internet market. Yesterday, the FCC tied the bow with their disastrous vote."]["Looks like you missed one… https://t.co/JoSRpNxr88 https://t.co/zac7Iwnee8"]["Nancy, 52"]["Dawn, 47"]["Rachel, 29"]["Anne Marie, 52"]["Mary, 56"]["Vicki, 27"]["Lauren, 30"]["Benjamin, 6"]["Allie, 6"]["Catherine, 6"]["Grace, 7"]["Avielle, 6"]["Jessica, 6"]["Emilie, 6"]["Jesse, 6"]["Chase, 7"]["Ana, 6"]["Josephine, 7"]["Daniel, 7"]["James, 6"]["Caroline, 6"]["Dylan, 6"]["Jack, 6"]["Charlotte, 6"]["Madeleine, 6"]["Just like in the #GOPTaxScam &amp; now on #NetNeutrality the Trump administration is picking CEOs over citizens, thwarting the desires of millions of Americans who sent comments to the @FCC asking that they #SaveNetNeutrality."]["If #NetNeutrality is eliminated, the Internet may start to resemble a toll road, with the highest bidders cruising along private “fast lanes” while the rest of us inch along a single, traffic-choked public lane."]["President Trump’s appointed chairman of the @FCC, @AjitPaiFCC, is on the verge of eliminating #NetNeutrality – bringing to an end the free &amp; open internet that has enabled so many successful companies &amp; created so many jobs."]["We depend on a free &amp; #openinternet to spur innovation &amp; job creation. Our economy works best when innovators, entrepreneurs &amp; business of all sizes compete on a level playing field. #NetNeutrality, very simply, says that everyone deserves the same, fair access to the internet."]["Well, my #SecretSanta really did his homework. Thanks for the cereal @SenJohnBarrasso! https://t.co/L0VmgDOwQq"]["Brittany is a nurturing caregiver of two 14-month old twins and a #Dreamer whose #DACA &amp; work authorization expired on December 7th. Brittany is 1 of 122 Dreamers who lose DACA status per day. Read her story here: https://t.co/J43GkedcJU"]["122 DACA recipients lose their status every day. That’s what happened to Brittany. She is a nurturing caregiver of two 14-month old twins and lost her status on December 7th. #DreamActNow https://t.co/45X4cQrtXB"]["Thrilled to join @SenateDems in congratulating Alabama’s next Senator @GDouglasJones! https://t.co/zijpFc9KDq"]["In 2010, Leader McConnell said that it would be “gamesmanship” to pursue big-ticket legislation before Scott Brown was seated. We hope he will do as Senator Reid did &amp; honor the wishes of the people of Alabama this year. https://t.co/JNCDwdm8yC"]["Today, @SenateDems are calling on Leader McConnell to hit pause on his tax bill, &amp; not hold a final vote on it until Doug Jones is sworn into the Senate.\n\nThat’s exactly what Republicans argued when Scott Brown was elected in 2010. https://t.co/UebmqMVwxm"]["Joining workers &amp; @HouseDemocrats &amp; @SenateDems today to fight for pensions &amp; demand Congress meets its obligation to American workers. Watch LIVE: https://t.co/FLD60mZoGv https://t.co/VljPOvnhsH"]["After NJ, VA, &amp; now Alabama, it’s clear how America feels about the GOP rushing thru the #GOPTaxScam. The GOP should listen, slow down &amp; help the American ppl."]["RT if you think Alabama’s new Senator should get a vote on the #GOPTaxScam"]["Roy Moore was an awful candidate &amp; should never have gotten to the Senate. But make no mistake, just like in VA, Dems are energized, focused more on the middle class &amp; those struggling to get there, &amp; things are looking better &amp; better for 2018."]["Tonight from my office in Washington, wishing everyone a very #HappyHanukkah https://t.co/y3zo2LwTtN"]["The President's tweet today was nasty &amp; unbecoming of a president. @SenGillibrand is an outstanding member of the Senate, &amp; @realDonaldTrump needs to cut it out with the tweeting, period. He should stop tweeting &amp; start leading."]["Under the @FCC proposal, your access to the internet could be blocked, slowed down, or manipulated.  That’s not a free &amp; #openinternet. #SaveNetNeutrality"]["Today I joined @SenBillNelson &amp; @SenateDems in writing @FCC Chairman @AjitPaiFCC, urging him to abandon his reckless plan to radically alter the free &amp; open internet as we know it. #SaveNetNeutrality"]["👍 https://t.co/4fI4xsKzMh"]["The nomination of Leonard Grasz is indicative of the new Republican playbook: if you don’t like the message, shoot the messenger. If you don’t like what the @ABAesq is saying about your judicial candidates, call it partisan – even if you praised its judgment just months ago."][".@SenateMajLdr once likened a well-qualified rating from @ABAesq to “getting straight A+’s on your report card.” Now the GOP is singing a much different tune as two of President Trump’s judicial nominations have received unanimously not-qualified ratings."]["Leonard Grasz is just the third judicial nominee since 1989 to be unanimously deemed “not qualified” by the @ABAesq. A panel of nonpartisan, legal experts unanimously concluded that this man is not fit to be a judge. What else do my colleagues need to know?"]["This evening, the Senate will vote on whether or not we should consider the nomination of Leonard Grasz to be a judge on the Eighth Circuit Court of Appeals."]["Just one snapshot of what the #GOPTaxScam would do to New Yorkers. \n\n RT &amp; tell the GOP to slow down, protect American jobs &amp; get this right. https://t.co/9fxmRuKEHD"][".@USTreasury's #GOPTaxScam“analysis” is nothing more than a page of fake math. It’s clear @WhiteHouse &amp; GOP are grasping at straws to prove the unprovable &amp; garner votes for a bill that will blow up the deficit &amp; generate almost no additional economic activity to make up for it."]["Thankful for the quick response of @NYPDnews, @PANYNJ PD, @FDNY &amp; Bomb Squad at the Port Authority this am. As we learn more about what happened, it is a startling reminder why the “see something, say something” campaign is so important to keeping our city safe."]["Congrats to the @HaiderAlAbadi, the Iraqi military &amp; @CJTFOIR for their committed &amp; steadfast work.  Many innocent lives have been lost &amp; more work is required to eliminate terrorists in the region, but today is an important day in the fight against an evil &amp; twisted enemy. https://t.co/cBMvCAdjRl"][".@USDOT’s out-of-thin-air decision to scrap consumer protection proposals on bag fees, missing wheelchairs &amp; more is nothing more than a Christmas gift to the airlines who will now rake in even more profit.  https://t.co/NogAo6lQkr"]["It’s #SundayMorning, do you have some time to #GetCovered? Visit https://t.co/n6WmsIabKw before time runs out! https://t.co/JPnUEL3zwP"]["Got weekend plans? Better #GetCovered - it’s the last weekend to sign up for 2018 health coverage before the 12/15 deadline. Visit https://t.co/n6WmsIabKw now! https://t.co/nkwpqLuHNr"]["An absolutely terrific morning in Hudson Falls. Can't wait to see &amp; hear all that happens in the New Year! https://t.co/NxCByKEfMi"]["I've always said that Senators who stay in Washington &amp; never return home are simply not doing their job. That’s why I go to the street fairs, parades, grads &amp; all kinds of public events &amp; why I'm proud to have completed my 19th \"62 County Tour\" today."]["Democrats cont. to press for action on the urgent, bipartisan priorities: strengthening our natl defense w/ parity for our domestic budget, funding veterans, the opioid epidemic, CHIP &amp; Community Health Centers, saving Americans’ endangered pensions, &amp; passing the DREAM Act.”"]["We had a productive conversation on a wide variety of issues at the @WhiteHouse today. Nothing specific has been agreed to on the end-of-year bill to fund the government, but discussions continue."]["The #GOPTaxScam was muscled through Congress with such reckless haste; we're still finding errors &amp; unintended consequences. Even GOP tax officials say so: https://t.co/XRGz7FRAPs"]["First the #GOPTaxScam, then cuts to Medicare. What won't the GOP do to make it even harder in America to access affordable healthcare and retire with dignity? https://t.co/X7pg4mtYIu"]["On the #DreamAct, as @SenatorDurbin said yday, we are making progress in talks with the GOP &amp; I hope we can reach an agreement soon. Democrats support real border security &amp; will happily join with Republicans to pass legislation to secure our border in exchange for the Dream Act."]["Our veterans deserve better. People seeking recovery from opioid addiction deserve better. Hard-working pensioners deserve better. We must do both of these things - support the military and programs that create jobs and economic growth here at home - in equal measure."]["Nobody wants to see a shutdown. But without an agreement that covers defense AND economic development, programs to combat the opioid crisis, shore up pension plans, support veteran's health care, relieve student loan debt, and build rural infrastructure could see a cut."]["Update: Congressional negotiators are making good headway on a budget deal that would meet our commitments to our military &amp; urgent priorities here at home.  I hope this progress continues but it's in stark contrast to @POTUS who again said yesterday: \"a shutdown could happen.\""]["¿Eres un mesero? Una nueva propuesta de Trump permitiría que tus empleadores compartan tus propinas, lo cual abriría la puerta a que tus jefes se queden con tu dinero. #TipTheft https://t.co/r9FPMUQOf7"]["Are you a server? A new Trump proposal would allow employers to require you to share tips &amp; opens the door for employers to keep tips for themselves. #TipTheft https://t.co/2n3dy8QqUr"]["Today we remember the heroes of #PearlHarbor &amp; hold those we lost &amp; their families in our hearts. Thank you for your service &amp; sacrifice. #PearlHarborDay https://t.co/F3Cqjd3umk"]["Huge congrats to #SiemensComp winners &amp; Long Islanders from @OfficialHHHCSD Aroobah, Jiachen &amp; Jillian. These 16yr olds are changing the world. #STEM @sfoundation https://t.co/YIcNOJYgle"]["We can't let our national monuments be altered like this. They are #MonumentsForAll. Join the fight to #KeepItPublic &amp; make your voices heard. https://t.co/QZe2NDgCdg"]["Big corporations can smell the huge tax cut they have coming, and rather than raising workers’ pay or hiring new workers, they’re buying back stock and prepping huge dividend payments."][".@BankofAmerica’s decision to increase the size of their stock buyback by $5 billion is yet another signal that the #GOPTaxScam is going to line the pockets of wealthy investors, rather than raising wages for workers."]["Hooray for the 2018 Olympic Committee. Putin is a bully &amp; the only way to stop him is to stand up to him. https://t.co/158Q7cLOcQ"]["In the rush to get a crumb for small business owners, the Republicans are giving a whole big nice chocolate layer cake to the wealthy. It's wrong. #GOPTaxScam"]["What were Republicans working on in the waning hours last week? Not trying to figure out how to help families, not reducing the impact it would have on our deficit – they were busy making tax cuts for the wealthy more generous."]["The #GOPTaxScam is toxic &amp; unpopular. More on what it means for the middle class LIVE: https://t.co/3iOTAXalfx"]["My offices across NY &amp; in DC just closed for the night, but we got nearly 400 calls today from NYers opposing the #GOPTaxBill. There's still time for the GOP to admit how much better a bill we could produce through a bipartisan, transparent process &amp; start over with us."]["New analysis on #GOPTaxScam - now that everyone has had time to read it - turns out their bill RAISES taxes on 62% of middle income taxpayers within 10 years. https://t.co/YN3jhNlhmh"]["To diminish our commitment to protecting the natural landscapes and historic places of this country from ruin by exploitation or pollution would constitute a breach of our responsibility both to those who founded this nation and those who will inherit it."]["Deeply troubled by today’s #BearsEars announcement, which would undermine the preservation of national monuments &amp; remove protections for more than 2 Mil acres of public lands – the largest such elimination in our nation’s history. https://t.co/LrbVxeuTIg"]["Problems began when @Giants failed to draft good offensive line last year. McAdoo and Reese should pay the price, but not Eli. https://t.co/jSBMRL6ggO"]["We're accepting the President's invitation to the White House on Thursday. Hope he'll go into the meeting with an open mind &amp; a willingness to reach an agreement that meets the needs of the American ppl &amp; keeps the gov't open. https://t.co/YjTRpslPOJ"]["Grinch bots cannot be allowed to steal Christmas, or dollars, from the wallets of New Yorkers. #BlocktheBots https://t.co/D3On5byxEK"][".@ConsumerReports says bots are being used to buy popular holiday gifts like toys, gaming equipment &amp; high-end sneakers &amp; sell them at inflated prices. #BlocktheBots https://t.co/omHP8c9nUH"]["Middle class folks save up—a little here, a little there—working to afford the hottest gifts of the season like @Barbie @NintendoAmerica &amp; others to surprise their kids or help Santa with his list, but now cyber bots are changing the rules. It’s time to #BlocktheBots"]["Music &amp; Broadway lovers know cyber bots have been scooping up tickets to shows &amp; concerts— well now the same kinds of bots have migrated &amp; are now targeting hot holiday toys. #BlocktheBots"]["This is why Democrats are proposing significant border security resources, like new fentanyl detectors, in exchange for the DREAM Act. I hope Republicans will join us. https://t.co/6wTdNKzLsb"]["Sandy and I first met in 1982, and throughout his career he used an uncanny and creative intelligence and dogged persistence to help the working men and women of America. He will be sorely missed. https://t.co/I8YrYffOsC"]["Leader McConnell’s quote shows he is already defensive about the tax bill. When HE compares it to Obamacare, it’s hardly high praise. Remember 2010? Wait til 2018! https://t.co/ggTXJyVelW"]["Tonight, I feel mostly regret at what could have been. \n\nTax reform is an issue that is ripe for bipartisan compromise. There is a sincere desire on this side of the aisle to work with the GOP, particularly on tax reform, but we have been rebuffed, time &amp; time again"]["In my long career in politics, I have not seen a more regressive piece of legislation, so devoid of a rationale, so ill-suited for the condition of the country, so removed from the reality of what the American people need."]["Was THIS what @POTUS meant by #DrainTheSwamp? https://t.co/d0HQGH3iPh"]["Why on earth wouldn’t you want to spend more time looking at a bill of this magnitude? #GOPTaxScam https://t.co/vIKAFdzj78"]["Disappointing but maybe not surprising that @realDonaldTrump said a government shutdown could be good for him politically. As President, the welfare of the American people should always come before politics. Always.\nhttps://t.co/PqnTimzE1U"]["Make sure you know how your Senators are going to vote tomorrow on this bill. I will let NYers &amp; everyone know what comes in the GOP’s next secret draft, but it’s your calls, emails, faxes, et al that make the difference, so please make your voices heard on this #GOPTaxScam"]["And it’s not being rushed thru to help workers. In fact, @SenateGOP refused to accept a @SenSherrodBrown #ABetterDeal amendment to help companies keep &amp; grow jobs in the USA - so much for #AmericaFirst"]["And -in case you missed it- the #GOPTaxScam will increase the deficit by roughly $1 TRILLION. That’s not tax relief, that’s a burden for many generations."]["Even with a proposed “fix” the #GOPTaxScam’s repeal of the ACA’s individual mandate is opposed by 12 major, national, patient advocacy groups because it puts affordable care in jeopardy: https://t.co/JoubviD2xC"]["The #GOPTaxBill could RAISE taxes on millions of Americans ages 65 &amp; older. cc:@AARPadvocates https://t.co/Wl7aWCsEwx"]["It benefits the highest earners, and will end up saddling many middle class families with a tax hike."]["The #GOPTaxBill opens up the Arctic National Wildlife Refuge -America’s most pristine wilderness- to drilling, a move opposed by most Americans and by tribal leaders. https://t.co/RDoGcaOHDS"]["@SenateGOP In my home state of New York and across the US, Americans will feel the repeal of the state and local deduction (SALT) which currently prevents double taxation. https://t.co/qHQYCaWL0x"]["Until we see what the @SenateGOP’s midnight rewrite looks like, let’s go over what we know the #GOPTaxScam does so far: [thread]"]["We will fight another day on the Senate GOP’s tax bill. Your voices have been incredibly powerful, first on health care &amp; now on tax reform. Don’t give up now!"]["To be clear: the #GOPTaxBill will increase the deficit which will cannibalize support from everything we know is essential to economic growth &amp; a strong middle class, including support for our men and women in uniform."]["The #GOPTaxBill will balloon the deficit by at least $1.5 TRILLION: adding to the debt burden borne by the next generation and diminishing our ability to support the military and invest in our schools, our roads, and in scientific research."]["The American ppl are clamoring for us to work together. They believe our politics is broken. They think our politics is starved of common sense &amp; compromise, and it is. The way the #GOPTaxBill is being rammed thru is exactly why the American ppl think our politics is so broken."]["From the one-sidedness with which it was drafted to the reckless haste with which it was considered – the #GOPTaxBill has failed to go through anything resembling the normal legislative process."]["@POTUS And that’s just the Senate bill – the House already passed their #GOPTaxScam with your wealthy friends in mind. You can pass this on to them: 6/6 https://t.co/x3SI4Q888K"]["@POTUS Oh &amp; the #GOPTaxBill also plans to repeal the estate tax. That helps the top .2% 5/6 https://t.co/98OcJoCfGx"]["@POTUS #GOPTaxPlan repeals the Alternative Minimum Tax, which will save the wealthiest Americans millions. 4/6"]["@POTUS Perhaps they missed this in our hometown paper: https://t.co/NGAhI2Qvp7"]["Honestly, if @POTUS' friends’ lawyers haven’t figured out how the #GOPTaxPlan benefits the wealthy above everyone else, let me help: 1/6"]["Mr. President, if your wealthy friends don’t know about all the breaks &amp; loopholes in the #GOPTaxBill that will benefit them, they should hire a better lawyer."]["Bipartisanship &amp; compromise are possible on tax reform. We can do a better job than this &amp; not saddle the next generation of Americans with even larger deficits, even larger debt."]["The #GOPTaxBill would even open up drilling in the Arctic National Wildlife Refuge because this tax bill wouldn’t be complete unless it helped big oil companies too. #ProtecttheArctic"]["Under the #GOPTaxBill, estates worth over $11 million get a tax break. Corporations get a permanent reduction in their tax rates while individual tax breaks expire after a few years. Why is that?"]["The GOP isn't proud of their bill. Every ind. analysis has shown it will end up raising taxes. @TaxPolicyCenter estimates 60% of middle-class families will see a tax INCREASE by the time the bill is fully implemented, while folks making &gt;$1M will get an average tax CUT of &gt;$40K."]["Esperamos poder seguir trabajando de buena fe, como lo hemos hecho durante este último mes, con nuestros colegas republicanos en el Congreso para hacer exactamente eso."]["Si el Presidente, quien ya dijo este año que ‘nuestro país necesita un buen cierre de gobierno,’ no está interesado en trabajar en la difícil agenda de fin de año, trabajaremos con aquellos republicanos que si están interesados, de la misma manera que lo hicimos en abril."]["No tenemos tiempo que perder para lidiar con los problemas que confrontan a nuestro país, así que vamos a continuar negociando con los líderes republicanos que estén interesados en llegar a un acuerdo bipartidista."]["En lugar de ir a la Casa Blanca para un espectáculo que no resultará en un acuerdo, le hemos pedido a los líderes McConnell y Ryan que se reúnan con nosotros esta tarde."]["Dado que el Presidente no ve un acuerdo entre los demócratas y la casa blanca, creemos que el mejor plan es seguir negociando con nuestros colegas republicanos en el Congreso."]["If @POTUS, who already said earlier this year that \"our country needs a good shutdown,\" isn’t interested in addressing the difficult year end agenda, we’ll work w/ those who are. Looking fwd to continuing to work in good faith w/ our GOP colleagues in Congress to do just that."]["@POTUS @SenateMajLdr @SpeakerRyan We don’t have any time to waste in addressing the issues that confront us, so we’re going to continue to negotiate with Republican leaders who may be interested in reaching a bipartisan agreement."]["The #GOPTaxScam is terrible for New York &amp; the country. It is a massive transfer of wealth to the already-wealthy. It would exacerbate inequality and set the middle class back at the worst possible time. https://t.co/S2eFtGWCCk"]["Across the country Americans signing up to #GetCovered on https://t.co/QG6fMKKwqb only have until December 15th to lock in coverage for 2018. Spread the word - there's a plan for everyone. https://t.co/QVIo55SV4k"]["Take the lead New York &amp; #GetCovered before our state marketplace closes on Jan 31st. Visit https://t.co/n43qVBIPLm or follow @NYStateofHealth to spread the word."]["This #GOPTaxPlan has real implications for our veterans &amp; military families. Hear more from @votevets’ @will_c_fischer LIVE: https://t.co/94ACP2RqKO https://t.co/aDLUJCY78I"]["This #GOPTaxPlan is a 5 alarm fire! Tonight @SenateDems are LIVE sharing our concerns &amp; urging you to take action. TUNE IN: https://t.co/94ACP2RqKO https://t.co/jTgNwqnWWe"]["Americans deserve a full-time @CFPB director with a proven track record of fighting for them. Period. #DefendCFPB"]["READ:\n“Senate Republicans insist that the overhaul will pay for itself by goosing growth. That is, how shall we put it, a lie.”\n#GOPTaxPlan https://t.co/t6LLQOS8H0"]["One of the hottest holiday gifts this season is a DNA testing kit — but what are companies doing with your most personal data? https://t.co/mtpgmTXQbb"]["There is no point to learning about your family tree if your privacy gets chopped down at the same time. https://t.co/IUZsipE7mO"]["The @CFPB should be led by someone who is committed to working around the clock on behalf of consumers, not by a part time director who clearly disdains the agency."]["The process for succession laid out in Dodd Frank is clear: Leandra English, not Mick Mulvaney, is the acting dir of @CFPB. By attempting to install Mr. Mulvaney as director, the Trump admin is ignoring the established, legal order of succession that we purposefully put in place."]["#SmallBizSat is here! #ShopSmall &amp; support the 2.1 million small businesses in New York State &amp; millions more across the country today! https://t.co/xUJV7pmqNR"]["“This is another Republican tax plan that helps the rich, hurts the poor, increases inequality and blows a hole in the debt.”\n\nWorth a read:\nhttps://t.co/X9SNVAU3s7"]["Something to be thankful for - my parents, at age 94 and 89, joined us for Thanksgiving. https://t.co/bk7nrDnwl5"]["I agree with @CWAUnion - big corporations should pledge $4,000 wage increase for workers in writing before Congress acts on this #GOPTaxBill. https://t.co/hUIx3Ab5bW"]["#FridayRead Incisive outline on why we should be optimistic about 2018. Take a minute today to read &amp; RT: https://t.co/LazhpSqeE5"]["Wishing you and your family a very Happy Thanksgiving! https://t.co/InhLpzbQlc"]["He cut a unique figure throughout the Hudson Valley &amp; the Southern Tier &amp; was passionately committed to the environment &amp; to preserving that region's priceless open &amp; wild spaces. He will be sorely missed.  My sincerest condolences to his family. 2/2"]["TODAY in Syracuse - joining NY workers who suffered pension benefits cuts &amp; are at significant risk of losing even more to call for swift passage of #ABetterDeal bill that would get benefits on solid footing."]["A bill in Congress that helps American workers AND American taxpayers? @SenSherrodBrown &amp; @SenateDems have one. It's all part of #ABetterDeal. Learn more: https://t.co/ed0nZ1K8aq"]["In the midst of massive #TaxReform that delivers a tax giveaway for the mega-rich, we should be able to help hard-working Americans get the pension benefits they earned. #ABetterDeal. Read more: https://t.co/ed0nZ1K8aq"]["Great day to be in Rochester, celebrating the next steps in the #InnerLoop project, creating the new face of Rochester that will drive development here to new heights for decades to come. #ROC https://t.co/klwVCDDE1z"]["It’s time to talk #NetNeutrality at the dinner table. Tell your family to speak up – it’s  the only thing that can keep the internet free &amp; fair for all. Take action: https://t.co/xDbFCIeMXR"]["RT &amp; tell @FCC this decision will hold America back.  \nConsumers, small business owners, hospitals &amp; schools across the country will be at the mercy of internet service providers who'll be free to charge for fast lane service &amp; pick winners &amp; losers. #SaveNetNeutrality"]["It’s official. @FCC’s wrongheaded decision flies in the face of the millions of public comments you left urging the FCC to leave internet protections in place. We won’t stand for this. We will protect #NetNeutrality https://t.co/dG5LJnWmyh"]["Just as our free highway system helped build jobs in American in the 20th century, #NetNeutrality will help build jobs in the 21st century. To take a step back hurts our economy, our job growth &amp; middle-class &amp; working people. It is a disaster."]["Ending #TPS for Haiti shows an utter lack of compassion &amp; common sense from the Trump administration.  #SaveTPS"]["@DHSgov The deportations that come from this decision will leave US children without parents &amp; damage local economies. #SaveTPS"]["Despite two hurricanes in the last 6 months alone, @DHSgov decided to terminate #TPS for &gt;50k Haitians.  A simple extension would have made the most sense.  #SaveTPS"]["Another heartless decision by the Trump Administration, this time ending temporary protected status for Haitians in the US. #SaveTPS"]["@CenterOnBudget Oh, don’t forget to show your Uncle this as well! https://t.co/YHRGTvvwAo"]["Bring this chart to Thanksgiving dinner. It’ll come in handy when that family member who always talks politics tells you the Republican tax bill helps the middle class. https://t.co/2EpZ5PxcDY"]["Permanent corporate tax cuts on the backs of the middle class is a game Americans can’t afford to play. https://t.co/TXClZmVmsR"]["Is that a promise? https://t.co/Be7rMvYUAZ"]["China wants to export car to U.S.? Not unless they remove tariff on U.S. imports."]["A live look at where your money goes under the #GOPtaxplan. https://t.co/IjiRLpMW7M"]["The lights still aren’t back on in Puerto Rico or USVI. To add insult to injury, the Administration failed to request adequate aid for the islands. Congress must fix. https://t.co/Z0y9xg9va7"]["The Trump administration’s supplemental request shortchanges particularly Puerto Rico &amp; the USVI &amp; comes up woefully short of providing all Americans who have been hit by hurricanes &amp; wildfires with the resources they need to rebuild. We are better than this."]["Is nothing safe from this administration? 🐘 #FridayFeeling #SaveTheElephants https://t.co/7VLlzrbcts"]["Want to know why so many Republicans voted for such a bad bill that raises taxes on millions? \n\nHere’s why: https://t.co/WiTp7aHPVi https://t.co/3PmRErTOqi"]["Sexual harassment is never acceptable and must not be tolerated.\n\nI hope and expect that the Ethics Committee will fully investigate this troubling incident, as they should with any credible allegation of sexual harassment."]["Democrats are offering hard-working Americans #ABetterDeal to protect pensions, because the families of our ironworkers, truck drivers, steelworkers &amp; more deserve a secure &amp; bright future. Watch LIVE: https://t.co/NpGp46TAv0"]["It’s 5pm! Welcome back to @NewsChannel9’s Rod Wood!"]["#GOPTaxBill raises premiums on average Americans healthcare by 10% so they can give the wealthy a tax cut.\n\nSound familiar? \n\nRemember #Trumpcare?"]["The #GOPTaxBill kicks 13 million people off health care to pay for tax cuts for the wealthy. 13 MILLION."]["Cmon. The #GOPTaxPlan is the wrong kind of approach for our economy; it betrays the American workers &amp; the American families who deserve tax relief by helping those at the very top."][".@SenateGOP, there's way out of this mess – work w/ @SenateDems on real, bipartisan reform. You won’t have to choose btwn blowing up the deficit &amp; hurting the middle class. Working together we could actually improve the condition of working Americans."]["Last night, @SenateGOP decided to throw the mother-of-all monkey wrenches into their bill: repealing the individual mandate. Impt to remember @USCBO already said that would cause 13M fewer Americans to have health insurance &amp; would raise premiums by 10%."]["Either tens of millions of taxpayers will pay significantly more in the long run, or a future Congress will extend the tax breaks, making the deficit hole they create massively deeper.\n \nOur Republican colleagues, particularly the deficit hawks, can't have it both ways."]["With the new Senate #GOPTaxBill, Republicans have put themselves between a rock &amp; a hard place: dramatic tax increases on the middle class or a huge hole in the deficit."]["This has now happened 2x in one day. So much for the “whole trickle-down through the economy” idea. https://t.co/taoHSUoC4Z"]["IF Gary Cohn had been paying attention to CEOs for the last yr, he’d know they’ve said publicly &amp; repeatedly that they’d use the windfall from corporate tax cuts to buy back stock &amp; pay dividends to their shareholders. https://t.co/amg8unoj0K"]["Instead of learning from their failure to repeal health care, GOP is doubling down on the same partisan strategy that would throw our health care system into chaos. If the American ppl weren’t already outraged by #GOPTaxScam, injecting health care into it will do the trick."]["The #GOPTaxScam is a backdoor attempt to get #Trumpcare passed. That’s not what the American people want."]["GOP is tying themselves in a knot. They’re cutting taxes on the wealthy &amp; taking health care away from millions &amp; raising the premiums of millions others all to help reduce taxes on the rich. Does that sound familiar? https://t.co/q1JYTEm4GB"]["Glad FEMA has heeded my call to approve disaster aid for flood ravaged Lake Ontario communities in Niagara, Orleans, Wayne, Oswego, Jefferson &amp; St. Lawrence counties.  I’ll keep pushing to get the same designation &amp; support for Monroe &amp; Cayuga counties: https://t.co/VCDSxpclVA"]["We shouldnt be rushing through such an ill-conceived, backwards bill. Remember it is being called the #GOPTaxScam and \"HR1%\" \n\nIf the GOP turn their backs on this deeply flawed approach, we can work tghr on bipartisan tax reform that delivers real relief to middle-class families."]["But why rush? @SenateDems, the American ppl &amp; even the rest of the GOP need to know what's actually in the #GOPTaxBill. Are they trying to hide that it helps the wealthy &amp; big corps while raising taxes on millions of middle-class families?"]["It's clear: the real #GOPTaxPlan isn't ready because every few days Pres Trump tweets asking the Republicans to change their bill, repeal the individual mandate and drop the top rate, as he did yesterday. And the GOP considers it to placate a restless &amp; uninformed President."][".@POTUS's absurd idea to repeal the individual mandate as a part of the #GOPTaxPlan would boot 13M ppl from the health insurance rolls and cause premiums to skyrocket - all to pay for an even bigger tax cut for the very rich, those who pay the top rate. What a toxic idea!"]["Every American should wonder why President Trump goes to such great lengths to avoid criticizing President Putin."]["Why does President Trump continue to give President Putin the benefit of the doubt while discrediting and demeaning American intelligence officers?"]["Sooner or later, President Trump’s core supporters will realize he’s selling them out to take away their health care to lower rates on the wealthy. Shame. https://t.co/5EFUNwh8QV"]["It’s time to turn over a new leaf at HHS. The next Secretary must demonstrate a commitment to lowering premiums,  and not sabotaging the Affordable Care Act &amp; our health care system with reckless actions that hurt families. I look forward to reviewing Mr. Azar's nomination. https://t.co/nyPKQvZwyE"]["The House's so-called 'compromise' would be saying to the middle class we'll only chop off four of your fingers instead of all five.\n\nRepublicans should go back to the drawing board and fully restore the State &amp; Local tax deduction. https://t.co/mJy0LzTibt"]["Trump Asia trip a flop: POTUS acts like a lap dog to Xi and China, but talks tough to our friends in Southeast Asia. Presidency by misadventure."]["Yes, @SenToomey, there is a good reason - don’t raise taxes on 29% of taxpayers in your state.  Hardworking Pennsylvanians &amp; Americans shouldnt be taxed because they live in the suburbs &amp; middle-class communities. https://t.co/kt6LVmt73o"]["It has been an honor to work with &amp; on behalf of so many veterans &amp; military families this year. Learning Staff Sgt. Bernard J. McNamara’s story from WWII &amp; meeting his family was just one of them. https://t.co/bb36axBg18"]["Thankful for America’s veterans and military families who sacrifice so much to protect the freedoms we hold so dear. Thinking of them this #VeteransDay. https://t.co/9dZz8LdmWC"]["@SenateMajLdr Rather than distorting the facts about their plan, Republicans should turn back &amp; work with Democrats on a bipartisan tax plan."]["Happy Birthday to the United States Marine Corps.  I join all Americans in honoring your service &amp; sacrifice for our great nation.”  #SemperFi #HappyBirthdayMarines @USMC"]["I blame China &amp; so do millions of Americans who voted for you.\n \nWhat happened to your campaign promises to be tough on China? https://t.co/G70WLWdbVn"]["One thing is clear from the Senate GOP tax bill: the House compromise on the state &amp; local tax deduction was written in disappearing ink."]["Still reading the details but based on what we’ve seen so far of the Senate GOP tax bill, it’s clear that this is another tax giveaway to the rich &amp; big corps &amp; its coming squarely on the backs of those in the middle class."]["Senate GOP has just released THEIR version of a tax bill - joining Senator @RonWyden to walk through just some of what's in it LIVE: https://t.co/zwAvQbUOVb"]["Haven’t these men &amp; women earned the right to call themselves American citizens? It’s time for Congress to pass the #DreamActNow https://t.co/NLyZMXxbwl"]["Latino &amp; African American students are more likely to receive Pell Grants &amp; many take student loans. The GOP tax bill cuts these prgms that low- &amp; middle-income students depend on to attend college. Instead, we need tax reform that helps the next generation follow their dreams. https://t.co/4FevWnbIke"][".@CenterOnBudget says in a typical month, SNAP provides basic food aid to about 10M Latino &amp; 13M African American individuals. But it can't if the GOP Tax bill passes. https://t.co/U1fNNHRQQE"]["¿Cómo afectaría la reforma fiscal republicana a los latinos y afroamericanos? Es malo. Muy malo. https://t.co/4UW76lhR50"]["Today’s @TaxPolicyCenter analysis of #GOPTaxBill leaves families wondering “how much more will we pay?” Read more: https://t.co/2m64a2vv9C https://t.co/8t4ALdw66E"]["Sneaking #TrumpCare into a tax bill that would already be bad for middle-class families would be adding insult to injury. See @USCBO's analysis: https://t.co/2ZshaeJrM2"]["Always a pleasure - passing the #DreamAct is a priority for me &amp; we will get this done together. https://t.co/0VpfBqcyaE"]["They can try to promise you can file your taxes on a postcard, but they can’t keep saying you’ll pay less in taxes. https://t.co/xutE882qL1"]["It’s becoming crystal clear: Republicans are on a fast track to fully eliminate the state &amp; local tax deduction. The compromise was never adequate, but any Republican clinging to it as an excuse to vote for the tax bill should abandon ship before it’s too late. https://t.co/1OGM6FCxn4"]["Congratulations to my friend @lhandsyr on 45 years of award winning reporting for @CNYcentral!"]["Still time to vote! Don't for a second think yours won't count. Find your polling place &amp; get there. #ElectionDay https://t.co/OlQWm8HYrv"]["What starts as a modest tax cut for the average family of four making $59,000/yr becomes a tax increase after only six years under GOP plan. https://t.co/R40P1gkKpk"]["The Child Tax Credits, unlike the personal exemptions they replace, lose value over time because they do NOT increase with inflation."]["@nyulaw @davidckamin After 5 yrs, the $300/person family credit is GONE!"]["As @nyulaw tax prof @davidckamin pointed out, while some see initial tax cut, that disappears after a few yrs &amp; taxes will start going up! https://t.co/qUWyStAg98"]["By 2026, nearly half of all middle class families would pay more in taxes, NEARLY HALF!!! https://t.co/UxYUuWRBW9"]["Greeted @nycmarathon runners in Brooklyn this morning! Irish Haven Bar was a refuge for marathon viewers as we cheered on New York! https://t.co/Oq6UVqsJwc"]["Congrats #TCSNYCMarathon runners! Hope you had as much fun running as we did cheering in Brooklyn w/ guitarist, #NYPD Ret. John Rafferty! https://t.co/sc13ka5d6S"]["If you’re a young family renting an apt, saving to finally buy a home, Guess what? Under the #GOPtaxplan, it just got harder. https://t.co/jcBfYz6XM7"]["Again, that’s 13 MILLION tax filers in this country who earn $100,000 a year or less who could see a tax hike under the #GOPtaxplan. https://t.co/v33HO44ZQO"]["Proud to announce Harris radio is adding 30-40 new jobs in Rochester to equip our new Army brigades! #ROC"]["While the stock market continues to boom, the October jobs report shows that middle class Americans aren’t seeing the benefit."]["Republicans should have never let community health centers expire.  Dems are fighting hard to restore funding ASAP. https://t.co/HT8pNYlvIo"]["House GOP's so-called Tax Cuts and Jobs Act tells the middle class to \"take a hike!\" https://t.co/DODYNMJuuy"]["We are going to do everything we can to get it done, no matter what the President says on one given day or another."]["I am confident that there is strong bipartisan support in Congress to get the #DreamAct passed before the end of the year."]["GOP argues their plan gives the  middle class a tax break. What they wont tell you is many middle class families will see their taxes go up."]["House GOP tax plan puts a burden that ought to be on the backs of the wealthy &amp; big corps &amp; drops it square on the back of the middle class."]["Es hora de renovar, cambiar o actualizar nuestros planes médicos para el 2018. No espere, comience su solicitud hoy: https://t.co/B5TWwCGJCQ https://t.co/kWCEnRgjMW"]["When terrorism has struck us in the past, presidents have brought us together. It’s a shame this president can’t. https://t.co/d0olC9RK7T"]["GOP also seemed poised to end the deductibility of state income &amp; sales taxes, raising taxes on middle-class Americans from coast to coast."]["If true, GOP will hike taxes on middle-class Americans’ retirement savings all so they can line the pockets of the wealthy &amp; biggest corps."]["Every American who is struggling to save for retirement should shudder at the latest reports on the GOP tax plan. https://t.co/mGqUTNC3C7"]["Again, I’m calling on President Trump to rescind his proposed cuts to the vital anti-terrorism funding immediately."]["The NYPD, who bravely &amp; quickly brought the mayhem to an end yday, depends on anti-terrorism funding to keep our city safe day-in &amp; day-out."]["Calling on Pres Trump to rescind his proposed cuts to anti-terrorism funding immediately - our city relies on it to snuff out attacks."]["President Trump should be focusing on the real solution – anti-terrorism funding – which he proposed to cut in his most recent budget."]["Pres Trump, instead of politicizing &amp; dividing America which he always seems to do at times of national tragedy, should bring us together."]["President Trump, where is your leadership? The contrast btwn Pres Bush’s actions after 9-11 &amp; Pres Trump’s this am couldn't be starker."]["President Bush, in a moment of national tragedy, understood the meaning of his high office &amp; sought to bring our country together."]["And true to form -- something that made my heart swell with pride -- the New York City Halloween parade marched on last night."]["NYers are resilient. We will bounce back. We won’t let terrorists get their way or affect our way of life—we will never let terror prevail."]["These attacks are meant to confuse and terrorize. But as the world learned after 9-11, and will learn again: New York doesn’t scare easy."]["I rode on that path just this past wkend. My daughter went to the school near the scene &amp; used the bike path. It's our territory. Our home."]["We are also grateful – deeply grateful – to the NYPD &amp; 1st responders, especially Officer Ryan Nash, who was the first on the scene."]["Our hearts go out to the victims and their families and we wish all the injured a full and speedy recovery."]["Yday, a man deliberately drove a truck into groups of pedestrians &amp; cyclists, killing 8 &amp; injuring over a dozen. Some were schoolchildren."]["I rise this morning with a heavy heart. A city no stranger to terrorism was once again its victim last night – my home city of New York."]["I’m calling on the President to immediately rescind his proposed cuts to this vital anti-terrorism funding. 3/3"]["which he always seems to do at times of natl tragedy, should focus on anti-terrorism funding which he proposed cutting in his budget. 2/3"]["Always believed &amp; cont. to believe that immigration is good for America. Pres Trump, instead of politicizing &amp; dividing America, 1/3"]["I guess it's not too soon to politicize a tragedy."]["My full statement in response to President Trump’s proposed funding cuts to anti-terrorism efforts: https://t.co/L0S6K1WkLX"]["Thanks NYPD for rapidly responding to tragic situation downtown. Worried &amp; saddened to hear about injuries &amp; loss of life."]["If Americans needed more proof #TrumpTax plan would be a boon for the wealthy at the expense of the middle class, look no further than this: https://t.co/RVlR2MdFFy"]["So this investigation MUST continue &amp; our independent judicial system -built on the rule of law- cannot be degraded by partisan politics."]["These revelations should concern everyone. There arent two sides. There is only one side – the side of the rule of law &amp; American democracy."]["The facts are the facts. Special Counsel Mueller's investigation has revealed there was a connection btwn the Trump campaign &amp; Russia."]["@SenateDems Democrats want to make it easier to save for retirement. Republicans want to make it harder by increasing taxes on middle class Americans."]["We don’t yet know what the GOP will do exactly to 401ks, but @SenateDems will oppose any tax hikes on middle class retirement accounts."]["1st time I can remember the Senate is asked to process 4 influential circuit court judges in a single week. Why is @SenateMajLdr doing this?"]["@realDonaldTrump If he does so, Congress must respond swiftly, unequivocally, and in a bipartisan way to ensure that the investigation continues."][".@realDonaldTrump must not, under any circumstances, interfere with the special counsel’s work in any way."]["The special counsel’s probe is ongoing in a serious way. The rule of law is paramount in America &amp; the investigation must proceed unimpeded."]["#Sandy5 should remind the GOP that every penny for disaster relief changes lives. Remember that for TX, FL, AND #PuertoRico #USVI"]["NY had to fight for every dollar to rebuild, repair &amp; become more resilient. We still arent back 100%, but we're stronger than ever. #Sandy5"]["Forever grateful to firefighters, police, 1st responders &amp; volunteers from across the US who saved lives &amp; helped when we needed it most."]["Hard to believe it has already been 5 yrs since Hurricane Sandy crippled the East Coast &amp; hurt NY families, homes, &amp; businesses. #Sandy5 https://t.co/FmRt4VBoND"][".@POTUS repeatedly promised to champion fair trade policies &amp; crack down on China - another #BrokenPromise https://t.co/H1UexP0eqw"]["The Trump tax plan is a far cry from the Reagan tax plan. Read my @USATODAY oped https://t.co/KPRF1HVFqP"]["It is shocking that CBP would pursue &amp; detain a 10 yr old girl w CP after a surgery. She should be released to her parents asap. https://t.co/jxjjYLwb7y"]["#WeAreAllDreamers - I stand with Dreamers from NY &amp; across America. It's time to pass the #DreamAct. RT if you agree. https://t.co/2upRXjHyUx"][".@SenateGOP: jump on it! https://t.co/kXWdXoYkAI"]["If SALT “compromise” passes today the value of your home could drop by TEN PERCENT. Tell Republicans to drop this bill, not your net worth."]["New SALT “compromise” will still hurt firefighters, police officers, &amp; teachers. Republicans should vote NO &amp; stand w/ them, not big corps."]["Don’t be fooled - the Republican SALT “compromise” will still take $1 trillion from the middle class to fund a huge corporate tax cut."]["It's a mark of an exceptional nation to look back &amp; say we made a grievous error, but we did &amp; we pledge to never let it happen again. https://t.co/JfUpE5tZQi"]["Honored to be here as Congress righted a decades-old wrong &amp; bestowed the highest civilian honor on the Filipino veterans of WWII. https://t.co/Z7ZvQdtL3w"]["My deepest condolences &amp; prayers are w/ Off Lehner's family, the BPD, &amp; all who today mourn the loss of a great public servant. #BuffaLove"]["Cant even be surprised by GOP anymore, but tonight's CFPB rule vote was disappointing. When will they break the mold &amp; stand up for avg ppl? https://t.co/U5GlrLJPxu"]["Senate came tgtr to pass emergency funding, but must do more to help victims of western wildfires &amp; hurricanes in TX, FL, Puerto Rico, USVI."]["Some NY GOP say theyll fight for the middle class in #taxreform. When push comes to shove I hope theyll hold strong. https://t.co/gTVP92XXxb"][".@JeffFlake is one of the finest human beings I've met in politics. He is moral, upright, strong &amp; will be missed in the Senate."]["I hope these Republicans stand firm and protect Americans from double taxation. https://t.co/HlOiOQSA7Z"]["🔊 to hear where the 💰to pay for the GOP's tax cuts for the wealthy is really coming from. https://t.co/Ai8FnRFb6s"]["Let me repeat that. We need @realDonaldTrump to roll up his sleeves &amp; get to work, to stop tweeting &amp; start leading."][".@realDonaldTrump, we need our president to roll up his sleeves &amp; get to work, to stop tweeting &amp; start leading."][".@POTUS promised to crackdown on China - so far it's been a lot of talk. @SenateDems say enough. Let's put US steel &amp; aluminium jobs first. https://t.co/4uvey9gCbp"]["More on why all NY electeds should oppose this plan &amp; fight for the NYers they represent instead of the #TrumpTax: https://t.co/XuSEQOnk22 https://t.co/vLzV3TPjjg"]["This Trump admin report overlooks the facts &amp; undercuts @CFPB’s attempt to stop big biz from bullying consumers. https://t.co/tfE5TJIUDs"]["@NYGovCuomo NY's electeds in Congress need to stand together, do the right thing here &amp; block this gut-punch to New York’s middle-class."]["@NYGovCuomo Deductions like these should not be eliminated just so people making millions of dollars a year can catch a tax break of their own."]["Today @NYGovCuomo &amp; I were in the Capital Region where &gt;29% of locals use the state &amp; local tax deduction, w/ an avg deduction of $12,916."]["GOP is moving ahead w/ #TrumpTax plan that puts NY homeowners &amp; the middle class at risk of their taxes going UP - not down."]["If NY GOP delegation incl. @RepStefanik @RepJohnFaso @RepLeeZeldin @RepTenney opposes bill gutting state &amp; local deductions, it won't pass. https://t.co/gn48lbZbfQ"]["And would oversee disaster assistance distribution &amp; federal contractual arrangements to ensure that there is no waste, fraud, or abuse."]["Would facilitate timely &amp; accurate damage assessments to ensure PR receives all resources it needs in upcoming emergency funding bills;"]["Would oversee electric grid restoration, repair &amp; rebuilding;"]["A CEO of Response &amp; Recovery to assist Puerto Rico would help coordinate emergency response activities among the various federal agencies;"]["The response on Puerto Rico is unconscionable &amp; demands new action. We're calling for a clear point person, a CEO of Response &amp; Recovery. https://t.co/QPXuNOZ4x5"]["Take note: @SenateDems are voting now to protect this important deduction from Republican attacks. https://t.co/VxkWeBFSin"]["@POTUS You cannot govern a country if you do not know what a bill does and keep a consistent policy about it."]["@POTUS Yesterday, @POTUS called the Alexander-Murray compromise “a very good solution.” Now, this morning he can’t support it."]["The President ought to know what's in the bill before he tweets about it. https://t.co/IQNlIb7CPP"]["New York has a lot to celebrate tonight: another win in the Bronx &amp; a second chance in Brooklyn. \n\nStill can't believe I missed this. https://t.co/ZlHOviIlMk"]["@POTUS We remain committed to fighting back against travel bans &amp; Muslim bans. Thank you to everyone joining us in this fight. #NoBanNoWall"][".@POTUS’ travel bans discriminate against families of Americans &amp; those trying to make a better life for themselves."]["@SenAlexander @PattyMurray @SenateDems Urge @SenateMajLdr @Speaker @POTUS to move this plan. It'll protect ppl from premium increases, assure the marketplaces &amp; prevent sabotage."]["I salute @SenAlexander &amp; @PattyMurray for working hard on a bipartisan healthcare solution. It got broad support from @SenateDems today."]["As the search continues for Off. Lehner, my thoughts &amp; prayers are w/ his family, the @BPDAlerts, &amp;all searching tirelessly on the Niagara. https://t.co/Sfi5WD7Ytd"]["The Queen City wont buy this brand of fake math. Your cuts help the wealthiest Americans &amp; are paid for by raising taxes on the middle-class https://t.co/vdyr516yjz"]["Why won’t the GOP listen to farmers like Mike from Kansas? WATCH👇🏽 https://t.co/drbrB6WuqT"]["@VP So when @VP arrives in Buffalo tomorrow, I hope he’s prepared to explain why he wants to hike taxes on thousands of middle-class families."]["@VP And in the NY-22, which cuts right thru the middle of NY, 23% of residents take the state &amp; local deduction w/ an avg deduction of $10,766."]["@VP Might also mention in the NY-24, near #Syracuse, 29% of NYers take the state &amp; local deduction w/ an avg deduction of $12,140."]["@VP And in the NY-23 district, which is just south of Buffalo, 22% of residents claim state &amp; local deduction with an avg deduction of $11,716."]["@VP In the NY-26 district in the heart of Buffalo, 27% of residents claim state &amp; local deduction with an avg deduction of $12,083."]["@VP In the NY-27 district, from East Buffalo towards Rochester, 29% of NYers claim the state &amp; local deduction with an avg deduction of $12,125."]["@SenateDems @POTUS If @POTUS now supports agreement that stabilizes &amp; improves the existing system under the #ACA, we certainly welcome his change of heart."]["@SenateDems I'm hopeful we're nearing an agreement that makes clear we wont support @POTUS' efforts at sabotage. 2/"]["For months, @SenateDems have pushed to stabilize markets &amp; worked twd a bipart agreement to keep premiums down for millions of Americans. 1/"]["Need a peaceful res that doesn’t jeopardize ongoing fight v. ISIS, put gains at risk &amp; finds way to accommodate Kurds' legit aspirations."]["Urging the Trump administration to immediately initiate a dialogue between the Iraqi gov't &amp; Iraqi Kurds."]["Every ounce of energy &amp; resources the Iraqi govt &amp; the Kurdish Peshmerga spend fighting each other should instead be spent fighting ISIS."]["@POTUS @POTUS44 Rather than helping biggest corps avoid paying their fair share, #taxreform should reward those cos that create jobs &amp; raise US wages. 6/6"]["@POTUS @POTUS44 That's proof positive that companies already have a cash windfall, but they're not using it to boost wages. 5/6"]["@POTUS @POTUS44 As @POTUS points out, the stock market is at record highs &amp; cos are raking in unprecedented profits, yet wages remain relatively flat. 4/6"]["@POTUS @POTUS44 History shows tax cuts like these benefit the wealthy and the powerful to the exclusion of the middle class.\n3/6"]["@POTUS This deliberate manipulation of #s &amp; facts could lead to messing up the good economy inherited from @POTUS44 &amp; hurting the middle class. 2/6"][".@POTUS complains about fake news - this tax plan's fake math is as bad as any of the so-called fake news he has complained about. 1/6"][".@POTUS’ M.O.: failure to lead. Throws destructive bones to his base, then tells Congress to fix it: Iran, Health care, Puerto Rico"]["The @SenateDems agree with #SecDef Mattis and General Dunford. We won't allow the Iran deal to be undone."]["The Senate has already passed bill to help fight algal blooms &amp; protect lakes, ponds &amp; drinking water. The House must act now!"]["Was in Fulton Co at Nathan Littauer Hospital today calling for immediate action to help NY’s &amp; America’s rural hospitals."]["Congressional inaction on the Low-Volume Hospital (LVH) &amp; Medicare-Dependent Hospital (MDH) Programs puts Upstate hospitals on life support."]["@POTUS Make no mistake about it, @POTUS will try to blame the Affordable Care Act, but this will fall on his back and he will pay the price for it."]["@POTUS It is a spiteful act of vast, pointless sabotage leveled at working families and the middle class in every corner of America."]["Sadly, instead of working to lower health costs for Americans, it seems @POTUS will singlehandedly hike Americans’ health premiums."]["Congrats to @CDTA - 2017 Mid Sized Transit System of the Year! They're doing great things in the Capital District &amp; it's only the beginning."]["Climate Change is one of the biggest threats facing our 🌎 \n\nRallying on @EPA action just in a few minutes. Join me on @senatedems @Snapchat https://t.co/X0V834Ev5z"]["@POTUS And it will add further chaos to the markets.  If the system deteriorates, make no mistake about it, the blame will fall squarely on @POTUS."][".@POTUS' exec order couldn't be further from his \"great health care\" promise. It will up costs for seniors &amp; ppl w/ preexisting conditions."]["@POTUS This executive order is just the latest in a series of steps he has taken to sabotage health care at the expense of millions of Americans."]["Having failed to repeal the #ACA in Congress, @POTUS is using a wrecking ball to singlehandedly rip apart &amp; sabotage our healthcare system."]["There is still devastation, Americans are still dying. FEMA needs to stay until the job is done. https://t.co/muzu7e81Hu"]["@realDonaldTrump Why do you continue to treat Puerto Ricans differently than other Americans when it comes to natural disasters?"]["@realDonaldTrump FEMA needs to stay until the job is done and right now, it's not even close to done."]["US workers deserve an open, transparent NAFTA negotiation, not a backroom deal.  RT if you want USTR to hold NAFTA town halls. #ABetterDeal"][".@SenateDems have proposed #ABetterDeal on Trade &amp; Jobs calling for TEN NAFTA town halls across America. https://t.co/bN6Oxss64H"]["When it comes to NAFTA, Trump Admin should carefully listen to the public &amp; stakeholders to negotiate the best outcome for American workers."]["What Mr. Weinstein did was awful. Sending his donations to NY orgs doing crucial work for survivors &amp; fams, @SafeHorizon @sffny &amp; @cvtcnyc."]["What would a former Treasury Secretary have done in Sec. Mnuchin's position if faced w/ the #TrumpTax plan? WATCH: https://t.co/Sd3tTftQtA"]["Economists, think tanks, even his former employer @GoldmanSachs dispute Sec Steve Mnuchin's #TrumpTax plan claims. https://t.co/yQxEgM4esk"]["Sec. Mnuchin &amp; Adviser Cohn know from their work at @GoldmanSachs, their tax plan won’t pay for itself: https://t.co/mD2GsWd4Ss"]["Unlike the Trump Administration, Sec. Mnuchin &amp; Gary Cohn’s former employer @GoldmanSachs says the #TrumpTax plan would cost &gt;$2.5 Trillion."]["Los estados, las empresas, y expertos en salud apoyan El Plan de Energía Limpia  para reducir emisiones de GEI y proteger la salud pública."]["States, biz, electric utilities &amp; health professionals support #CleanPowerPlan cause they support protecting our kids' health. #ProtectCPP https://t.co/cWP6OqUJWF"]["As much as he'll deny it, @EPAScottPruitt wants to pick winners &amp; losers. We all lose unless we #ProtectCPP. https://t.co/cpbxVAJQFI"]["Frankly, rigging the system for polluters won't help kids w/ asthma, farms or recreation biz, or Americans looking for jobs in this economy."]["At a time when our weather is so volatile, we must do more to fight climate change &amp; protect our communities, not less. #ProtectCPP"]["Alejarnos de El Plan de Energía Limpia tendría consecuencias reales - para nuestro ambiente, nuestra salud, y nuestra economía."]["Walking away from the #CleanPowerPlan would have real costs – to our environment, our health &amp; our economy."]["W/ America seeing more extreme &amp; dangerous weather than ever before, last thing we should do is roll back actions to combat #ClimateChange."]["Thanks to the first responders, fire fighters &amp; law enforcement working around the clock to save lives &amp; get more people out of danger."]["The @EPA must live up to its mission and continue cleaning up radioactive waste in Niagara County. The residents deserve better. https://t.co/CK7sNjB8Ld"]["If the President was serious about protecting the #Dreamers, his staff has not made a good faith effort to do so."][".@NancyPelosi &amp; I told @POTUS we were open to reasonable border security alongside #DreamAct -his list goes so far beyond whats reasonable."]["The Admin can't be serious about compromise w/ a list anathema to #Dreamers, to the immigrant community &amp; to the vast majority of Americans."]["This decision is just the latest in a series of moves the Trump Admin has made to sabotage our health care system. It can't continue. https://t.co/siBHZW5gXw"]["Weve long turned the page on days when a boss could stand btwn a woman &amp; her healthcare decisions – @POTUS' decision drags the US backwards."]["This outrageous decision rips a fundamental right away from millions of hard working women. https://t.co/ZEi8aB8GUW"]["The GOP's partisan plan to repeal this deduction must be scrapped. They should start over w #TaxReform that truly benefits the middle class."]["It's crystal clear, the benefits of this deduction touch every state, every big city, every small town &amp; municipality across the country."]["and in 2015, 17% of South Dakotans took the State and Local Tax Deduction, and the average deduction was $6,098 #TrumpTax"]["In 2015, 17% of West Virginians took the State and Local Tax Deduction, and the average deduction was $9,462 #TrumpTax"]["In 2015, 18% of North Dakotans took the State and Local Tax Deduction, and the average deduction was $6,864 #TrumpTax"]["In 2015, 19% of Tennesseans took the State and Local Tax Deduction, and the average deduction was $5,611 #TrumpTax"]["In 2015, 21% of Alaskans took the State and Local Tax Deduction, and the average deduction was $4,931 #TrumpTax"]["In 2015, 22% of Wyomingites took the State and Local Tax Deduction, and the average deduction was $6,306 #TrumpTax"]["In 2015, 22% of Arkansans took the State and Local Tax Deduction, and the average deduction was $9,116 #TrumpTax"]["In 2015, 22% of New Mexicans took the State and Local Tax Deduction, and the average deduction was $7,091 #TrumpTax"]["In 2015, 23% of Hoosiers took the State and Local Tax Deduction, and the average deduction was $8,756 #TrumpTax"]["In 2015, 23% of Texans took the State and Local Tax Deduction, and the average deduction was $7,823 #TrumpTax"]["In 2015, 23% of Louisianians took the State and Local Tax Deduction, and the average deduction was $6,742 #TrumpTax"]["In 2015, 23% of Mississippians took the State and Local Tax Deduction, and the average deduction was $6,302 #TrumpTax"]["In 2015, 24% of Oklahomans took the State and Local Tax Deduction, and the average deduction was $8,201 #TrumpTax"]["In 2015, 25% of Nevadans took the State and Local Tax Deduction, and the average deduction was $5,989 #TrumpTax"]["In 2015, 25% of Kansans took the State and Local Tax Deduction, and the average deduction was $9,425 #TrumpTax"]["In 2015, 26% of Alabamians took the State and Local Tax Deduction, and the average deduction was $5,918 #TrumpTax"]["In 2015, 26% of Kentuckians took the State and Local Tax Deduction, and the average deduction was $9,955 #TrumpTax"]["In 2015, 26% of Ohioans took the State and Local Tax Deduction, and the average deduction was $10,444 #TrumpTax"]["In 2015, 26% of Missourians took the State and Local Tax Deduction, and the average deduction was $9,886 #TrumpTax"]["In 2015, 27% of Michiganders took the State and Local Tax Deduction, and the average deduction was $9,648 #TrumpTax"]["In 2015, 27% of Vermonters took the State and Local Tax Deduction, and the average deduction was $12,407 #TrumpTax"]["In 2015, 27% of South Carolinians took the State and Local Tax Deduction, and the average deduction was $8,765 #TrumpTax"]["In 2015, 28% of Nebraskans took the State and Local Tax Deduction, and the average deduction was $11,088 #TrumpTax"]["In 2015, 28% of Mainers took the State and Local Tax Deduction, and the average deduction was $11,431 #TrumpTax"]["In 2015, 28% of Idahoans took the State and Local Tax Deduction, and the average deduction was $8.862 #TrumpTax"]["In 2015, 28% of Montanans took the State and Local Tax Deduction, and the average deduction was $9,357 #TrumpTax"]["In 2015, 28% of Arizonans took the State and Local Tax Deduction, and the average deduction was $7,403 #TrumpTax"]["In 2015, 29% of North Carolinians took the State and Local Tax Deduction, and the average deduction was $9,587 #TrumpTax"]["In 2015, 29% of Hawaiians took the State and Local Tax Deduction, and the average deduction was $9,905 #TrumpTax"]["In 2015, 29% of Iowans took the State and Local Tax Deduction, and the average deduction was $10,163 #TrumpTax"]["In 2015, 30% of Washingtonians took the State and Local Tax Deduction, and the average deduction was $7,402 #TrumpTax"]["In 2015, 31% of Granite Staters took the State and Local Tax Deduction, and the average deduction was $10,121 #TrumpTax"]["In 2015, 31% of Wisconsinites took the State and Local Tax Deduction, and the average deduction was $11,653 #TrumpTax"]["In 2015, 31% of Illinoisans took the State and Local Tax Deduction, and the average deduction was $12,523 #TrumpTax"]["In 2015, 32% of Delawareans took the State and Local Tax Deduction, and the average deduction was $9,194 #TrumpTax"]["In 2015, 32% of Coloradans took the State and Local Tax Deduction, and the average deduction was $9,017 #TrumpTax"]["In 2015, 33% of Rhode Islanders took the State and Local Tax Deduction, and the average deduction was $12,434 #TrumpTax"]["In 2015, 33% of Georgians took the State and Local Tax Deduction, and the average deduction was $9,158 #TrumpTax"]["In 2015, 34% of Californians took the State and Local Tax Deduction, and the average deduction was $18,437 #TrumpTax"]["In 2015, 35% of Minnesotans took the State and Local Tax Deduction, and the average deduction was $12,954 #TrumpTax"]["In 2015, 35% of Utahans took the State and Local Tax Deduction, and the average deduction was $8,291 #TrumpTax"]["In 2015, 36% of Oregonians took the State and Local Tax Deduction, and the average deduction was $12,616 #TrumpTax"]["In 2015, 37% of Bay Staters took the State and Local Tax Deduction, and the average deduction was $15,571 #TrumpTax"]["In 2015, 37% of Virginians took the State and Local Tax Deduction, and the average deduction was $11,288 #TrumpTax"]["In 2015, 41% of New Jerseyans took the State and Local Tax Deduction, and the average deduction was $17,850 #TrumpTax"]["In 2015, 41% of Nutmeggers took the State and Local Tax Deduction, and the average deduction was $19,664 #TrumpTax"]["In 2015, 35% of New Yorkers took the State &amp; Local Tax Deduction, and the average deduction was $22,169 #TrumpTax"]["Don’t believe me? Just look at these numbers &amp; think about what a #TrumpTax would mean:"]["44 million Americans all across the country take the state &amp; local tax deduction (~1/3 of all taxpayers) &amp; they get $1Ks off their taxes."]["GOP tax plan actually raises taxes on millions of middle-class families by repealing the state and local tax deduction, a real Trump Tax."]["These #Dreamers love this country just like I do. And you know what's truly American? Helping them. Let's pass the #DreamActNow! https://t.co/BDmNWo8u7W"]["#Dreamers, we'll keep fighting until the #DreamAct becomes law. This is your home and you are #HereToStay."]["Rs &amp; Ds called on the Administration to delay the #DACA renewal deadline, but roughly 48k haven't submitted their #DACA applications."]["I say to @POTUS come out &amp; support a law to ban bump stocks, the modification used by the Las Vegas gunman to make his weapons automatic."]["It’s imperative that Congress quickly pass additional aid to help Puerto Rico, USVI &amp; other states hit by storms and wildfires."]["This is a good start, but those affected by Maria, Harvey, Irma &amp; wildfires still have a long &amp; difficult road ahead. https://t.co/YHjOOSzjqb"][".@SenateFinance has now agreed to #ExtendCHIP - @SenateMajLdr should immediately put it to a vote &amp; include bipart health provisions. https://t.co/WtgvrwmKpV"]["ICYMI @washingtonpost doled out 4 pinnochios for some pretty extraordinary claims about the GOP Tax plan: https://t.co/I8J9A3VdAR https://t.co/hPxuRxQT20"]["Starting soon: @SenateDems highlight how the GOP plan favors the rich, and sticks it to the middle class. https://t.co/LKV0pp7Lav"]["It can be a little hard to find, but it's right there in the GOP budget: $473 billion from #Medicare, over a trillion from #Medicaid. https://t.co/EKy4Kiavs9"]["The #Yankees Win!"]["Met w/ Puerto Rican &amp; USVI ldrs today on hurricane relief efforts underway &amp; what's still to be done. Congress must act to provide relief. https://t.co/Og9zpytXXs"]["@POTUS To have the gall to complain about PR while proposing tax cuts for millionaires that will cost trillions is the height of hypocrisy."]["@POTUS Yes we’re spending money in Puerto Rico. To turn the power back on. To give ppl drinking water. And to keep life support machines working."]["I don’t remember @POTUS telling Texas that they’d thrown our budget out of whack after Harvey. Or Florida after Irma."]["Look, I'm glad @POTUS is going to Las Vegas tomorrow, that's a good idea. But he's got more to do. https://t.co/jnSegJRxlk"]["Meet Denisse, DACA recipient &amp; NY med student testifying today @ Judiciary Cmmte Hearing. This is her home #DreamAct https://t.co/GOoROEsBTw"]["@POTUS @realDonaldTrump .@realDonaldTrump it's time to stand up to the @NRA &amp; stand up for the over 30,000 Americans who are victims of #gunviolence each YEAR. 4/4"]["@POTUS .@realDonaldTrump come out against the GOP's absurd silencers law. Say youll veto it. Bring Congress tgtr &amp; address #gunviolence head-on. 3/"]["@POTUS After #LasVegas, @POTUS should remember he ran as an outsider who wasn't beholden to special interests. It's time to buck the NRA. 2/"]["We cannot banish evil or madness frm the earth. But Congress &amp; @POTUS must do all in our power to make our country a safer place to live. 1/"]["The first duty of good government: to keep one’s people safe. I'll speak more on that LIVE in a few minutes. Watch: https://t.co/p34iJZuuN6"]["Tune in NOW for an important hearing on the #DREAMAct &amp; what the future holds for #DACA recipients: https://t.co/rVIB0FhT3b"]["Still time to make your voices heard. Senate vote on #NetNeutrality opponent @AjitPai’s nomination to the @FCC hasn't started yet."]["Very soon the Senate is scheduled to vote on @FCC Chair Ajit Pai’s nom for another 5yr term. Tune in if you're worried about #netneutrality"]["What Congress can &amp; must do is pass laws that keep our citizens safe, starting w/ laws to help prevent guns frm falling into the wrong hands"]["We will take care of the injured. We will mourn those lost with all our collective love &amp; support. We will bind up this new national wound."]["We will have to reckon with the fact that this man was able to assemble an arsenal of military-grade weapons."]["Some of the questions we have today won’t have clear answers; others are perhaps beyond our fathoming. But some will have answers."]["What led a man to commit such violence upon his fellow human beings, complete strangers? What twisted reasoning? What madness?"]["What was this person’s perverted motive? Was there any history of mental health issues?"]["How did this monster acquire the arsenal he used to rain down death on a crowd of innocents?  Were those guns purchased &amp; compiled legally?"]["Today, we are filled with shock and horror, sadness and rage. And we are left with more questions than answers."]["ICYMI - I spoke this afternoon about the Las Vegas shooting, now the deadliest mass shooting in US history. https://t.co/VlaOzpU54g"]["I commend the Las Vegas 1st responders, the SWAT team &amp; the regular ppl who acted quickly &amp; saved lives. Thank you."]["Deeply saddened for the people of Las Vegas and the country. We will keep the victims &amp; their families in our hearts."]["GOP #TaxReform plan &amp; what @SpeakerRyan says about it are 2 diff things. Says plan is for middle class but 80% is for wealthy-Get real Paul."][".@TaxPolicyCenter says under GOP #TaxReform \"&gt;1/4 middle-income families would pay more in taxes.\" https://t.co/3txcBYRrsn"]["My friend @NancyPelosi and I are ready to fight harder than ever to pass the #DreamAct. https://t.co/99Q3jPykbS"]["America must be a leader for freedom and democracy, and safety for refugees is part of that. https://t.co/l2gmtFysUp"]["@HHSGov We must get patients out of #PuertoRico and to the care they need. @HHSGov can and must do more."]["@HHSGov People are dying and some patients need to be evacuated. #PuertoRico"]["@HHSGov Dialysis centers are relying on generators. Those centers need clean water &amp; diesel. #PuertoRico"][".@HHSGov the situation is not under control. People are not receiving care they need. They need resources #PuertoRico."]["My office has been talking to Dialysis companies, American Kidney Fund &amp; HHS about emergency situation in #PuertoRico with Dialysis patients"]["As we were saying...\nhttps://t.co/cgavaCSO6X"]["So proud of the NYers rallying to help #PuertoRico. Learn more about how to get involved w/ orgs like @HispanicFed https://t.co/l47cD9sU08"]["The fed gov must do more to help those whose lives were upended by #Maria. If youre looking for ways to do the same: https://t.co/KVg7VgNHES"]["@usairforce Our military is upping resources to PR, but we need more personnel, trucks, helicopters to direct &amp; transport supplies, et al on the ground."]["Yesterday I met with @usairforce General Lori Robinson, who is in charge of the military’s role in the relief efforts for #PuertoRico. https://t.co/iYPW6iAju5"]["We cannot forget the utter devastation facing 3.5 million American citizens in Puerto Rico and the US Virgin Islands."][".@POTUS said his tax plan would create a middle class miracle. I think it would be a miracle if it helped the middle class."]["And what kind of #TaxReform plan removes the State &amp; Local deduction when that's what keeps middle class families from being taxed twice?"]["How does GOP #TaxReform \"help farmers\" by repealing the #EstateTax, when only 50 small farms or biz would pay that this year?"]["When you cut taxes on the top 1% &amp; raise them for the lowest income Americans, that's NOT pro-American. #wealthfare"]["The GOP #TaxReform plan is even worse than their healthcare plan. Instead of #wealthcare, it's #wealthfare. https://t.co/Z15ZnCuswU"]["@FCC We can’t entrust them with the Internet – they’re already working on gutting #NetNeutrality"]["We need an @FCC chair who believes in free &amp; #OpenInternet &amp; knows it is a tool for science, art, entrepreneurs -not just corporate profits."]["@SenateMajLdr @FCC Chairman Pai has bucked the calls of everyday Americans for #NetNeutrality, prioritizing the demands of big cable &amp; ISPs."]["Tomorrow, @SenateMajLdr will have the Senate vote for another 5 yr term for @FCC Chair Ajit Pai. I will vote w/ a resounding NO."]["The state deduction helps the middle class avoid double taxation - something I thought the GOP opposed. https://t.co/IMGO6uZIKa"]["We urge the GOP to pursue mainstream #taxreform that has fiscally responsible tax cuts for Americans who need it, not donors who demand it."]["Rs &amp; Ds used to agree on the Baker Rule: #taxreform must be revenue neutral, judged on its own merits. No dynamic scoring. No Fake Math."]["If they don’t pay for it, they’ll balloon the deficit and debt and then try to slash #Medicare and other important programs instead."]["On top of that, this would cost anywhere from 5 to 7 TRILLION dollars and they have no credible plan to pay for it."]["So if you are a giant corporation or in the top 1% - the GOP has a #TaxReform plan for you. \n\nIf you aren’t?  ¯\\_(ツ)_/¯"]["Plain &amp; simple: GOP #TaxReform ⬇️ the tax rate on the wealthiest from 39.6% to 35%. But ⬆️ for those working to make it to the middle class."]["In #TaxReform, @POTUS asks Rs, Ds &amp; Is to come together for a pro-America tax code. One problem. Their plan is pro-the top 1% of-Americans"]["Here’s the GOP #TaxReform plan. Their cover page could be the nicest part: https://t.co/2Lf3Z1XxpS"]["Sitting here still trying to figure out how this #TaxReform plan helps the middle class like teachers, policemen, nurses, &amp; more. https://t.co/IywJNmBrQs"]["A lot to unpack with the GOP's #TaxReform plan. Joining Sen @RonWyden LIVE now: https://t.co/lNIFegk21u"][".@SenBobCorker is a friend, fine, conscientious &amp;hard-working. His thoughtfulness &amp; dedication make him a model Sen. We regret him leaving."]["Laid these steps out over a wk ago. Equifax should provide consumers w/every opportunity to try &amp; protect themselves. They've fallen short. https://t.co/j9GCu7seon"]["A change in leadership is exactly what we called for. But much, much more needs to be done at @Equifax. https://t.co/h5PqmNkmx9"]["Las palabras se las lleva el viento. Los ciudadanos estadounidenses en Puerto Rico y las Islas Vírgenes necesitan acción y resultados. https://t.co/BYIQRfh8MD"]["Instead of trying to take health care away from millions, the Trump Admin &amp; GOP should put an emergency aid bill on the floor this week."]["Heading to the floor to urge my colleagues to work together to help Puerto Rico rebuild &amp; recover just as we would anywhere else in America."]["@YonkersPD Thinking of her family &amp; the whole dept at this time."]["Praying for a full recovery for the @YonkersPD officer who was shot in the line of duty last night &amp; is in the hospital."]["Speaking LIVE about the latest on Graham-Cassidy, the #Trumpcare bill: https://t.co/sbOHkUVEYS"]["#GrahamCassidy penalizes states that put coverage for their citizens first &amp; already expanded #Medicaid. It does not #ProtectOurCare. https://t.co/Horukhp3hb"]["Tune in LIVE to the single, solitary hearing on #Trumpcare happening NOW in @SenateFinance - we're all watching. https://t.co/y7dSOdUI0X https://t.co/P22V9Cq9Mo"]["@SenateFinance Tune in https://t.co/RqGqjZBpI3 at 2pm for the first &amp; only hearing the GOP has agreed to on their latest #Trumpcare bill. #ProtectOurCare"]["There is a @SenateFinance hearing TODAY at 2pm on latest #Trumpcare bill. But what about the debate? The markup? Amendments? Regular order?"]["\"...no room for delay or debate about rushing federal help to the citizens &amp; govt of Puerto Rico &amp; the stricken communities of the USVI.\" https://t.co/s97CTORZpr"]["Rs must join Ds &amp; work in a bipartisan way to provide relief for Puerto Rico &amp; the USVI as they find a new normal after Irma &amp; Maria."]["Fighting to repeal health care while millions of Americans in #PuertoRico are struggling to find shelter is unconscionable."]["It could take 6 months to restore power to 3.5 million Americans who live in Puerto Rico. #Trumpcare is not more pressing."]["The skies may be clearer over Puerto Rico but there are still dark days ahead for Americans struggling to connect w/ family &amp; move forward."]["Still no #CBOscore, but nonpartisan @BrookingsInst says these terrible numbers are a best-case scenario under #Trumpcare. https://t.co/kbfnUsRUnq"]["CHIP expires on Sept 30th. Why wont Republicans bring it to the floor? More than 8 million children should not be hostage to #Trumpcare. 2/2"]["Instead of attempting to jam through #Trumpcare next week, the Senate should be re-authorizing the Children's Health Insurance Program. 1/2"][".@BPC_Bipartisan says it's time for bipartisanship on health care. Let's drop #GrahamCasiddy &amp; work tgtr to ensure quality, affordable care. https://t.co/ferOuvZR3L"]["Happy #RoshHashanah to all! https://t.co/VYPnBfefSK"]["Nuestros pensamientos están con las familias estadounidenses en Puerto Rico y el USVI resistiendo al Huracán María y recuperándose de Irma. https://t.co/eWgVSsonP3"]["Our thoughts &amp; prayers are with the American families of Puerto Rico &amp; the USVI weathering Hurricane Maria &amp; still recovering from Irma. https://t.co/ON8gDZ21IG"]["Thank you @jimmykimmel. https://t.co/DE42lqlB90"]["Heartbroken for our neighbors in Mexico after 2nd earthquake in weeks. Praying for families &amp; friends still waiting to hear from loved ones."]["Es importante que los Dreamers cuiden su salud mental. Estas herramientas @UnitedWeDream pueden ayudar: https://t.co/9TXOnG1GS9"]["DACA recipients may be feeling anxious &amp; afraid. This mental health care toolkit can help them practice self-care. https://t.co/9TXOnG1GS9"]["Graham-Cassidy reduciría el \"acceso y la cobertura para más de 30 millones de niños\". @hospitales4kids no lo apoyan y nosotros tampoco. https://t.co/vbyKPyPurt"]["@jimmykimmel If you stand w/ @hospitals4kids @AARPadvocates @LittleLobbyists @AmerMedicalAssn &amp; others fighting to #ProtectOurCare, you know what to do."]["If you think #Trumpcare should pass the @jimmykimmel test, make your voices heard. https://t.co/POLPLwGqAD"]["If you think more American children, veterans, seniors and families should be covered - not less - make your voices heard."]["If you think Americans should keep guaranteed coverage for maternity care, substance abuse &amp; prescription drugs, make your voice heard."]["If you think Americans w/ pre-existing conditions should focus on getting healthy instead of fighting discrimination, make your voice heard."]["I don't understand why some of my colleagues support the Cassisdy-Graham bill, but I do know they need to hear from you. #ProtectOurCare"]["New #Trumpcare would cause millions to lose coverage, eliminates protections for ppl w/ pre-existing conditions &amp; ups out-of-pocket costs."]["¡Esto es sumamente importante! Tal vez no tengamos otra oportunidad de derrotar #Trumpcare. https://t.co/5EFCyjUuZ9"]["Just talked w/ @CoryBooker to share why we're fighting latest #Trumpcare bill. @ChrisMurphyCT joins him w/ more: https://t.co/IIacDp6iFA"]["#Trumpcare lives again under the name Graham-Cassidy. It's another bill that drastically cuts health funding for Americans who need it most. https://t.co/tp1zHMpm5V"]["We know this new #Trumpcare bill guts Medicaid. For our country's youngest most fragile patients &amp; many others that doesn't #ProtectOurCare. https://t.co/HaXI7gmmbr"]["We also know the new #Trumpcare bill defunds @PPFA, stripping millions of women of their right to access affordable health care - Join us: https://t.co/z4JbVaQxDJ"]["Here’s what we know about what the new #Trumpcare would do: https://t.co/FwddtFnMLw"]["ICYMI: Just left the Senate floor, talking about the latest with #Trumpcare &amp; what it means across the country: https://t.co/etTbkyTsn1"]["Make your voices heard New York. This latest #Trumpcare bill is meaner than ever. https://t.co/O1BlLOQbUR"]["Under the latest GOP #Trumpcare bill, Cassidy-Graham, Iowa would lose $525 Million in federal funding. #ProtectOurCare"]["Under the latest GOP #Trumpcare bill, Cassidy-Graham, Arkansas would lose $1.1Billion in federal funding."]["Under the latest GOP #Trumpcare bill, Cassidy-Graham, Colorado would lose $823 Million in federal funding. #ProtectOurCare"]["Under the latest GOP #Trumpcare bill, Cassidy-Graham, West Virginia would lose $554 Million in federal funding. #ProtectOurCare"]["Under the latest GOP #Trumpcare bill, Cassidy-Graham, Maine would lose $115 Million in federal funding."]["Under the latest GOP #Trumpcare bill, Cassidy-Graham, Arizona would lose $1.6 Billion in federal funding."]["Under the latest GOP #Trumpcare bill, Cassidy-Graham, Alaska would lose $255 Million in federal funding. #ProtectOurCare"]["This is not a drill. The GOP is back w/ another version of #Trumpcare &amp; it's no better than their last plan. It's worse."]