["NOW: #SFRC hearing to examine U.S. policy in Syria after ISIS. Watch at https://t.co/GCygbuLYiZ."]["I congratulate Tommy Parker on his confirmation as U.S. District Court Judge for the Western District and know he will faithfully uphold the law and serve West Tennessee well. My statement: https://t.co/7SiydIKPGS. https://t.co/oJfdYtmLCy"]["@PeaceCorps I look forward to advancing this bill in our committee very soon and hope to receive strong bipartisan support for our efforts to strengthen the Peace Corps."]["@PeaceCorps The legislation is named in honor of Nick Castle, of Brentwood, Calif., who lost his life at age 23 due to inadequate health care while serving in China in 2013."]["Today, on what would have been his 28th birthday, we introduced the Nick Castle @PeaceCorps Reform Act of 2018 to improve the care our volunteers receive while abroad and when they return home. Read more: https://t.co/JFJWTyvXqn."]["I was honored to recommend Chip Campbell to serve as U.S. District Court Judge, and I am glad his confirmation will help alleviate the high caseload in the Middle District. My statement: https://t.co/gCfqfqiLXb. https://t.co/8loN3ezxN7"]["While #Pakistan is an important country in the region, they have been very duplicitous in their dealings with us. My full statement applauding the Trump administration’s decision to suspend security assistance: https://t.co/clIo1dcCi8"]["Today, I introduced a resolution on the #IranProtests with @SenatorCardin. We support the right of Iranians to have their voices heard and condemn the regime for its long history of human rights abuses. Read more: https://t.co/vonwt4Rm10"]["Throughout his long life, Lewie continually advocated for things that made our state and country stronger, and he leaves behind a great legacy. My full statement on his passing: https://t.co/akmzsRXT0P. https://t.co/RMbSs2cDXI"]["Elizabeth and I love being outdoors in Chattanooga and participating in the healthy lifestyle there. Glad to join Governor @BillHaslam to launch #ImHealthierTN and encourage all Tennesseans to find ways – big or small – to live healthier lives in 2018."]["Congratulations on an outstanding tenure in the Senate, @senorrinhatch. The state of Utah and our country are better off because of your distinguished service, and I look forward to continuing to work with you over the next year."]["I applaud the administration, especially @IvankaTrump, for a continued focus on combatting modern slavery and human trafficking. My statement on @realDonaldTrump proclaiming January 2018 National Slavery and Human Trafficking Prevention Month: https://t.co/3wAidNiAfl"]["Like so many he knew, Fletcher had a big impact on me as a young man, and throughout life. We will all miss him and hope to carry some of him with us to share with others. My statement on his passing: https://t.co/ofUXmXDY4z. https://t.co/tRJz4x4jkW"]["I have a strong sense of urgency and obviously want to finish on a very strong note. Read more about our agenda for my final year in the Senate: https://t.co/arIOydLD0Y"]["Elizabeth and I wish you and your family a very merry Christmas and a happy new year. https://t.co/5xdVRRzBk8"]["Pleased the Senate has acted swiftly to confirm the four TVA Board nominees, including Jeff Smith of Tennessee. My statement: https://t.co/aMQBPM7G1S."]["Thank you, @IvankaTrump, for your kinds words and the big role you have played in making #TaxReform happen. You deserve a lot of credit. https://t.co/Q0J4DfLHAo"]["When I make a decision on these big, big votes, I have to decide if our country is better off with or without the policy in place, and I think America is better off with the #TaxCutsAndJobsAct than without it. #TaxReform https://t.co/DWn0zzgqqv"]["“The real lesson of the kick at Bob Corker is how terrified the left is of a bill that could be a popular tax cut that helps the economy and lifts incomes.” https://t.co/AIKwGTwSA3"]["Earlier today, Chairman Hatch responded to my letter about reporting over the weekend about my involvement in the tax reform legislation, calling the accusations “categorically false.” “I am disgusted by [the] press reports,” he wrote. https://t.co/IfAr9sBmNQ"]["See my statement on my support for tax reform legislation: https://t.co/DoeoHLrXWn"]["Very sad to learn of the passing of Bill Giannini, who made countless contributions to the Memphis community and our state. Thinking of his family and friends at this difficult time."]["It was my pleasure to introduce Eli Richardson at a Senate Judiciary Committee hearing on his nomination to serve as U.S. District Court Judge for the Middle District of Tennessee. My comments earlier today: https://t.co/JlQHxVW7aA"]["At 9:30 a.m. ET, Stephen Hadley, Christine Wormuth and John Bellinger will testify at a #SFRC hearing on the strategic, political and legal considerations for the use of military force. Watch: https://t.co/7SeJDtjEWV"]["Keaton, I know Tennesseans and people across our country join me in saying thank you for your courage. Bullying isn’t acceptable, especially in our schools. We’re all with you! #StandWithKeaton"]["I very much appreciate the work Dina Powell has done on the National Security Council. We will miss working with her on these important issues and wish her the best in the future."]["My full statement on the president’s decision to recognize Jerusalem as the capital of Israel and begin the process of moving the U.S. embassy from Tel Aviv to Jerusalem: https://t.co/2E7IKqCa4N"]["Since Dodd-Frank was signed into law, community banks have faced an overwhelming and disproportionate regulatory burden. The bill the banking committee passed yesterday is an important step in the right direction. More: https://t.co/ETeTfESYjP."]["Yesterday, the #SFRC unanimously approved bills to support a comprehensive U.S. approach for dealing with the threat from #NorthKorea. This action shows that Congress and the administration stand united against the rogue North Korean regime. Learn more: https://t.co/pDir64r9iP"]["Enjoyed welcoming students from West High School to Capitol Hill this week. @KnoxSchools https://t.co/5QG9EIQgkw"]["My statement on the tax reform legislation: https://t.co/LdTQRezdlO"]["Recent reports of slave auctions in Libya are deeply concerning. Read my letter with @SenatorCardin urging President Trump to make ending slavery a priority in his discussions today with Prime Minister Fayez al-Sarraj: https://t.co/MGsopS1YC3."]["I was proud to introduce Jeff Smith yesterday at a hearing on his nomination to serve on the TVA board. I hope my colleagues will swiftly confirm him and all nominees for current board vacancies. https://t.co/hsQYvkCXut"]["Yesterday, I voted to advance the #TaxReform legislation to the Senate floor for consideration. My full statement: https://t.co/kdLgb26OJn"]["I have been working feverishly with my colleagues and the White House to improve the #TaxReform legislation and ensure fiscal responsibility should economic growth estimates not be realized. My interview earlier on @foxandfriends: https://t.co/1ddnvZF8t7."]["We’re $20 trillion in debt and it’s party like there’s no tomorrow time in Washington. https://t.co/EDIPU9Kz5T"]["Today, the #SFRC passed my bill with @ChrisCoons to ensure the U.S. role in international organizations benefits taxpayers. ➡️ Learn more: https://t.co/oGCwnz2cDJ"]["My statement on the agriculture committee advancing the Tennessee Wilderness Act, which will help preserve the Cherokee National Forest for future generations: https://t.co/EwaqmkRZRQ."]["Proud to support a proposal to help our community banks better serve hardworking Americans and ensure small businesses have access to the credit they need. Learn more: https://t.co/fNP36Hys9G."]["Look, I'm sorry, but even before these reports surfaced, Roy Moore's nomination was a bridge too far."]["Our veterans represent the very best of our nation, and I know all Tennesseans join me today in thanking these brave men and women for their service and sacrifices. My statement honoring #VeteransDay: https://t.co/MhCg8JKxEf. https://t.co/mhftVDSmVr"]["Devastating reports of a church shooting in Sutherland Springs, Texas. As we await more details, I am praying for all those affected."]["Like me, most Americans hope that our justice system is independent and free of political interference. My full statement: https://t.co/R4WrhSPQz3"]["I'm excited about the possibility of the biggest tax rewrite since 1986, but it must be done right. My statement on the House legislation: https://t.co/XhJtEZ6PP8"]["Honored to introduce @senatornorris yesterday at a hearing on his nomination to be a U.S. District Court Judge: https://t.co/MtyBDFTzWs."]["We are praying for the victims of the tragic terror attack in New York City and thank law enforcement officials for their swift response."]["Testimony from Secretary Tillerson and Secretary Mattis continues. Watch the remainder of our #SFRC hearing at https://t.co/S6dvnLHAP7."]["Watch my opening statement at today’s #SFRC hearing on authorizations for the use of military force: https://t.co/F6yjJfcsX8"]["We appreciate Secretary Tillerson and Secretary Mattis for appearing before the #SFRC today at 5:00 p.m. ET. WATCH: https://t.co/7SeJDtjEWV https://t.co/UlfGJh4Onq"]["Tune in this morning for my interview with @jdickerson on @FaceTheNation. https://t.co/BF8BTrbzUH"]["I'll join @jdickerson on @FaceTheNation this Sunday. Check local listings for the air time in your area. https://t.co/S0pSSW4bFK"]["Great to be in Gatlinburg today with @BillHaslam and @SenAlexander at this year's @TNECD luncheon. #GovCon2017 https://t.co/0MSfYFIAIA"]["I'm all in for #TaxReform if it’s done right. We need to be tough and close loopholes. My interview on @SquawkCNBC: https://t.co/8z2va3Y6DH."]["My statement regarding implementation of sanctions legislation recently passed by Congress: https://t.co/Dsm9yj9kYL"][".@JeffFlake is a true conservative, an outstanding senator and a cherished friend. My statement on his announcement today: https://t.co/SIgVzieEXL"]["An estimated 40,000 children die annually who would otherwise be saved if we reformed #foodaid practices. Read more: https://t.co/qVVdzHzgs2"]["My remarks at Thursday’s hearing on modernizing #foodaid to feed 9.5 million more people a year with existing funds: https://t.co/RNTSuu14vK"]["Thank you @AEI for a great event yesterday on the need to modernize #foodaid to help millions more people in need. https://t.co/Xq8jyFRZAb https://t.co/ChigMfwitD"]["Tonight we began the tax reform debate. Here's more on the kind of bill I hope the tax-writing committee produces: https://t.co/d1qWINVWra."]["WATCH: #SFRC hearing this morning at 10:30 a.m. ET on modernizing the Food for Peace program. https://t.co/P3290pHrIO"]["Proud to cosponsor bipartisan legislation authored by @SenAlexander to stabilize the individual health insurance market. My statement: https://t.co/5r3HXI1Bme"]["It's a shame the White House has become an adult day care center. Someone obviously missed their shift this morning."]["Read more about my bill with @ChrisCoons to ensure the U.S. role in international organizations benefits taxpayers: https://t.co/wuOWviFJjl."]["Enjoyed starting my morning by welcoming Tennesseans to Capitol Hill at our weekly constituent breakfast. #TennesseeTuesday https://t.co/31fCTIbw1Q"]["WATCH: #SFRC hearing today at 10:00 a.m. ET to consider the nomination of Ken Juster to be U.S. ambassador to India. https://t.co/tAsWSQJBlN"]["Very sad to learn of the passing of Henry County native Sonny Melton. Please keep his wife, Heather, in your thoughts and prayers. https://t.co/GQa9apDNc5"]["Praying for all those affected by the senseless tragedy in Las Vegas, including a number of artists who call Nashville home."]["Enjoyed my conversation with @chucktodd on @MeetThePress this morning. Watch the full interview here: https://t.co/g6wcBvuAi0"]["TUNE IN: I talk foreign policy, tax reform and my decision not to seek reelection this morning on @MeetThePress. Check your local listings. https://t.co/AAFzMDT3aL"]["Sunday on @MeetThePress, @chucktodd and I talk foreign policy, tax reform and my decision not to seek reelection. Check local listings. #MTP https://t.co/8RLSwmFiY5"]["Serving the people of Tennessee in this capacity has been the greatest privilege of my life. My statement: https://t.co/IqNVlhD7Vv"]["We are closely monitoring reports of a church shooting in Antioch. As we await more details, please join me in praying for the victims."]["Proud @EPB_Chattanooga is playing an important role in the modernization of our country's power grid and was glad to attend today's event. https://t.co/GljHiQ7SDX"]["Students at Pi Beta Phi Elementary School in Gatlinburg asked great questions at our #ConstitutionWeek event on Tuesday. https://t.co/7hYDBX3Lab"]["My staff enjoyed being with teachers and students at White House Heritage Elementary School this week to honor #ConstitutionWeek. https://t.co/rX7O6mKJeF"]["It was inspiring to see the local community help these heroes. We'll hold more #JointOperation events across the state in the future. https://t.co/SZ2jzbudfz"]["Glad more than 300 veterans and their families visited our #JointOperation event in Cleveland yesterday. Thank you to everyone who attended. https://t.co/u5VTBeOeoB"]["Pleased Jeff Smith of Tennessee has been nominated to serve on the TVA board. My statement on @realDonaldTrump's TVA nominations: https://t.co/2pF48bKrRX"]["We have passed a major threshold in the fight against modern slavery. #EndSlaveryAct #enditmovement https://t.co/PAs7Jp8viv"]["I’m committed to pro-growth tax reform and was glad to work with @SenToomey and @SenatorEnzi on the path forward. https://t.co/9XqWmnM7PF"]["This week, my office has the privilege of speaking to students all across Tennessee in honor of #ConstitutionWeek. https://t.co/ShsFpusCoq https://t.co/F3hwuZY3kL"][".@realDonaldTrump's address to the #UNGA sent a very clear signal about what America stands for. My statement: https://t.co/o6rHVP9IQC"]["I thank @theresa_may and her government for their steadfast support of this effort. #enditmovement #EndSlaveryAct❌"]["This announcement is a prime example of what U.S. leadership can do to galvanize tremendous support to eliminate modern slavery."]["The UK’s match of $25 million U.S. award marks the first major victory for the Global Fund to End Modern Slavery. https://t.co/c4IcCqduVQ"]["Yesterday, #SFRC further strengthened U.S. leadership in the global fight to end modern slavery: https://t.co/xA0DU6BlY7. #enditmovement"]["Aung San Suu Kyi has long been dismissive of human rights concerns. My full statement on her speech yesterday: https://t.co/VQfhNSD9gj"]["Our free veterans event is HAPPENING NOW in Cleveland. Stop by any time today between now and 2:00 p.m. ET. #JointOperation https://t.co/5VsT8RiSJp"]["Immediately following the business meeting, #SFRC will hold a hearing to consider the nominations of @JonHuntsman and Wess Mitchell."]["WATCH: #SFRC will hold a business meeting at 10:00 a.m. ET to consider legislation and a number of nominees. https://t.co/8c6FyCiBQk"]["We can't keep doing things the same way and deepen the fiscal crisis jeopardizing our nation. My statement on NDAA: https://t.co/to0XsAJEWd."]["VETERANS: Join us at #JointOperation THIS WEDNESDAY in Cleveland. 45+ organizations under one roof to help you. https://t.co/aTefmaKQ9i https://t.co/rR5e9QsWOh"]["This is the culmination of years of effort by so many committed individuals, faith-based groups, and aid organizations. #EndSlaveryAct ❌ https://t.co/ky5Aty7ULU"]["The $25 million award to the Global Fund to End Modern Slavery made for a truly monumental day in the #enditmovement. #EndSlaveryAct ❌ https://t.co/UsX2OEzkZU"]["It was great to see Colonel Cain, commander of Arnold Air Force Base, earlier this week. Thanks to HonorAir for making this trip possible. https://t.co/KmEKlkLQAy"]["I appreciate Secretary Tillerson, who took ownership of this at our request, and all those at the @StateDept for their continued support. https://t.co/ELTDUjUCRF"]["Thank you, @IvankaTrump, for taking this on as a personal initiative. I look forward to our continued work together on this critical issue. https://t.co/ONSLt0ql3N"]["WATCH our announcement at 12:30 p.m. on $25 million award to the Global Fund to End Modern Slavery: https://t.co/h7vdVm0tg3 #EndSlaveryAct ❌"]["It is always an honor to welcome Tennessee veterans to Washington, and I was humbled to spend time with these American heroes yesterday. https://t.co/3mv4CoAt7r"]["We are so glad Coleen has been found safe after Irma. https://t.co/xOBqG49fCC"]["This scourge on humanity knows no borders or boundaries, and I remain committed to efforts that will help end modern slavery worldwide. ❌"]["Pleased the Senate approved two bills I cosponsored to help in the fight against modern slavery: https://t.co/hqeXCMAsxZ. #enditmovement ❌"]["My office has recruited more than 45 agencies and organizations to answer veterans’ questions. Full list: https://t.co/aTefmaKQ9i"]["Our free event to connect veterans with government resources is coming to Cleveland. Join us at #JointOperation on Sept. 20. https://t.co/jO9KfLoszC"]["Joined @marthamaccallum on @TheStoryFNC yesterday to discuss why the #NationalDebt is our country's greatest threat: https://t.co/4XeKSgJmf9"]["We are now $20 trillion in debt and that number will increase $10 trillion in ten years unless we put a fiscal straitjacket on Congress."]["Great having more than 50 Tennesseans on Capitol Hill this morning for our weekly constituent breakfast. #TennesseeTuesday https://t.co/rJHZVfOo31"]["It is absurd that Washington continues to turn a blind eye to the dangerous crisis staring us in the face. #NationalDebt https://t.co/KY6vYd7E2i"]["Greatest threat to our nation is our inability to get our fiscal house in order. My statement on the national debt: https://t.co/1lfyQ2jH5z. https://t.co/IJB4JE9YGz"]["David Jolley is extremely qualified to serve as U.S. Marshal for the Eastern District of Tennessee. My statement on his nomination: https://t.co/ByPB2EEbBw"]["Today, we remember the innocent lives lost and honor our first responders. My statement on 9/11: https://t.co/7FaX2JxUKy. #NeverForget"]["It was a pleasure to welcome the Campbell and Parker families to the Capitol, including my good friend Beth Campbell, before the hearing. https://t.co/aycTms21hs"]["Chip Campbell and Tommy Parker will serve Tennessee well. My comments on their nomination at yesterday’s hearing: https://t.co/5G33iG2SSl"]["I'll do everything I can to assist our veterans and thank Mr. Pierce for his service. Learn more about his story: https://t.co/Jssx4WT9kh."]["Proud we could help retrieve the Purple Heart and other medals Billie Pierce of Memphis earned serving our country in the Vietnam War. https://t.co/0EVbwpNfsz"]["Thank you to the @UnitedWay for a great conversation yesterday about our efforts to fight modern slavery. #EndSlaveryAct #enditmovement https://t.co/NHKxA5KQJP"]["#SFRC hearing at 10:30 a.m. ET to assess priorities and challenges in the U.S.-Turkey relationship. Watch here: https://t.co/s7KV9xnbzG."]["I am proud to recommend both Chip Campbell and Tommy Parker to my colleagues and hope they will be confirmed soon."]["At 10:00 a.m. ET, I’ll introduce two of @realDonaldTrump's Tenn. judicial nominees at their confirmation hearing: https://t.co/axlgrAOemF."]["My statement on the Trump administration’s plan to end the Deferred Action for Childhood Arrivals (DACA) program: https://t.co/1JwSRcevgX"]["We are LIVE NOW at @UnitedWay’s annual forum to combat human trafficking. Join us: https://t.co/L3M8Gsx5us. #EndSlaveryAct #enditmovement"]["@Tennessean @realDonaldTrump That will be my focus during this debate, and I look forward to working with my colleagues and with the @WhiteHouse to accomplish this task."]["@Tennessean @realDonaldTrump But you sent me to Washington to tackle problems, call it how I see it, and work to create a better life for you and your families."]["@Tennessean @realDonaldTrump There is a reason our tax code has not been reformed for more than three decades."]["@Tennessean I know @realDonaldTrump is committed to tax reform. I am committed to tax reform. And it is our responsibility to get it done."]["As we return to D.C. this week, tax reform is one of the most important tasks on our agenda. My @Tennessean op-ed: https://t.co/BKaC1Ckf4u."]["Today at 2:45 p.m. ET, I’ll join @UnitedWay and 100+ business leaders to discuss the fight against modern slavery. https://t.co/L3M8Gsx5us"]["We stand ready to work with the administration to support a comprehensive strategy. My full statement on North Korea's nuclear test: https://t.co/DI3V7MVv4u"]["I spoke with General Kelly this morning as POTUS and his national security team continued their work to assess the situation in North Korea."]["I again thank the first responders for their heroic work saving lives last November and the officials working to help the community rebuild."]["By outlining recommendations to enhance preparedness, the Chimney Tops 2 Fire Review is an important step in the right direction. MORE: https://t.co/WDxW982KzX"]["Great meeting this morning with local business leaders at the @MemphisChamber. They are helping bring jobs and investment to West Tennessee. https://t.co/2QJLH8lwcB"]["Discussed a wide range of topics with the Germantown @Rotary today. It was great to see @RepMarkWhite and Rep. Kevin Vaughan at the event. https://t.co/ogCLqQVuJx"]["Great to speak with members of the Forward Sumner Economic Partnership yesterday. I appreciate all they do to help Sumner County grow. https://t.co/PzWaRv9zj0"]["Enjoyed touring @GliderKit's facility in Sparta. This family business produces more than 3,500 trucks each year in Tennessee. #MadeInAmerica https://t.co/2upB3ZD9PJ"]["My statement on Secretary Tillerson’s letter outlining organizational changes related to special envoys at @StateDept: https://t.co/nWEOsyoqfr"]["I applaud the Trump administration for standing with the Venezuelan people. My full statement on the financial sanctions announcement: https://t.co/3rzwYIzi4k"]["Thank you, Lamar! It’s an honor to serve Tennesseans with you in the Senate. https://t.co/hqMawLx0NX"][".@LGUS’s new factory in Clarksville is expected to bring at least 600 full-time jobs to Tennessee. Great news for our state. #Jobs4TN https://t.co/2JK77YSXPB"]["It was great to be in Clarksville today with @SecretaryRoss, @MarshaBlackburn, @CommishTNECD and many others to welcome @LGUS to Tennessee. https://t.co/EGsjfhx0zk"][".@MarsGlobal Petcare headquartered in Franklin employs 1,000 Tennesseans. Thank you and the @TNChamber for hosting us this week. https://t.co/0A5ctTQOh8"]["Enjoyed being with the Rotary and Kiwanis Clubs of Columbia last week for their joint luncheon. Thank you for having me. https://t.co/73nFxkBRCI"]["It was great to be in my hometown of Chattanooga on Thursday to speak with and answer questions from members of @ChattRotary2014. https://t.co/qSyOKUUcBg"]["I support the direction @realDonaldTrump laid out tonight for the U.S. role in #Afghanistan. My full statement: https://t.co/fd82wnO2Dd"][".@OSDTN provides a strong support system for our veterans and their families. Honored to speak at their annual breakfast this morning. https://t.co/82V30CzCu3"]["We’re horrified by the terror attack in #Barcelona and join the Spanish people in praying for the victims and all those affected."]["Great being with folks at the @K_Chamber luncheon today and seeing @JasonZacharyTN. Thank you for having me. https://t.co/92KWREP107"]["Enjoyed speaking to the Sevier County Chamber this morning. It was great to see @mayorwaters and hear what Tennesseans care about most. https://t.co/tzVL9tVlk2"]["Had a great time today with @clevelandrotary and my good friend @RepKBrooks. Enjoyed taking your questions and hearing what's on your minds. https://t.co/Hy60bcQJiG"]["We stand united against the violence and hatred in #Charlottesville and pray for the victims of the attacks."]["From health care to tax reform to infrastructure, tough issues to tackle this fall and none better than @SenateMajLdr to get a good outcome."]["Great news for Tennessee and the countless companies, individuals, and talented artists in our state. My statement: https://t.co/jKBmcfWozp https://t.co/3lKWEeL9F2"]["The people who are leaking information are disloyal to our government. They should be fired, and I hope that's what is going to happen. https://t.co/6Tb8XpfYAf"]["After passing the #TaylorForceAct, #SFRC urged @nikkihaley to lead @UN campaign against Palestinian terror payments https://t.co/SvmMjXKk1S"]["@LindseyGrahamSC I urge my colleagues to support this legislation and look forward to the #TaylorForceAct becoming law."]["@LindseyGrahamSC #TaylorForceAct will force the Palestinian Authority to make a choice: face the consequences or end this detestable practice immediately."]["@LindseyGrahamSC We absolutely cannot accept a policy that rewards acts of terrorism like the one that tragically took the life of Taylor Force."]["@LindseyGrahamSC The #TaylorForceAct would demand the Palestinian Authority stop paying terrorists. Learn more: https://t.co/oB4mLUS9Mw."]["Holding a news conference at noon ET with @LindseyGrahamSC on committee passage of the #TaylorForceAct. Watch live: https://t.co/VURWiCBJzu."]["Appreciate your leadership on this important issue, @LindseyGrahamSC. https://t.co/qhdJIecl3T"]["The Stop Enabling Sex Traffickers Act will ensure victims can seek justice against sites like Backpage that facilitate this horrific crime. https://t.co/mkeGzqDLIX"]["@TheJusticeDept I'm hopeful the efforts can bring to justice the pill mills that are profiting off the hardships of Tennesseans affected by opioid abuse."]["Glad to see the Eastern District selected for @TheJusticeDept's Opioid Fraud and Abuse Detection Unit. Learn more: https://t.co/MAO1S7jOcp."][".@LindseyGrahamSC and I introduced the #TaylorForceAct to demand the Palestinian Authority stop paying terrorists. https://t.co/oB4mLUS9Mw"]["Good discussion this morning on infrastructure, health care and tax reform with @usmayors, including my friend Clarksville @MayorMcMillan. https://t.co/TZX99O6swG"]["Honored to administer the oath today as former intern Joe Riley of Athens was promoted to captain in the @USArmy. Grateful for his service. https://t.co/hNZlRioNC6"]["Christopher Wray has the integrity and independence needed to head the @FBI. My statement on his confirmation: https://t.co/wEL8XIZVzB. https://t.co/Ip849za4AZ"]["Proud to join my colleagues in introducing the Stop Enabling Sex Traffickers Act. Learn more: https://t.co/VODjCCmk6I. #enditmovement ❌"]["I will miss Jimmy Duncan's leadership and voice as a member of our delegation. My statement on his retirement: https://t.co/SCEWgUpGuH."]["We must pursue a comprehensive approach to the threat from #NorthKorea. My statement on their latest ballistic missile launch: https://t.co/VIWydvJLmc"]["Thank you to the Burns family of Greeneville for stopping by the Capitol yesterday afternoon during their family trip to D.C. https://t.co/3cPoRlz77L"]["This week, I met with Tennesseans Claire, Jackson and Duncan about the work of @JDRF and its impact on their daily lives. https://t.co/bN85B0hXlZ"]["My statement on this morning's vote: https://t.co/UtwJuboZVb"]["Congratulations to my friend and fellow Tennessean Bill Hagerty on being sworn in today as U.S. ambassador to Japan. https://t.co/IS1i4W0cMp"]["Our sanctions legislation, passed by a vote of 98 to 2, sends a strong signal to Iran, Russia and North Korea. https://t.co/BtNSo6qsuK"]["For the third year in a row, the #SFRC passed an authorization for the @StateDept. My full statement: https://t.co/51uifk39pY."]["Today, I will vote for an amendment to repeal the core elements of Obamacare. My statement: https://t.co/OA3SIfRRYf"]["I'll be discussing a wide range of foreign policy issues with @IgnatiusPost at 8:30 a.m. WATCH: https://t.co/t6468KbIju. #SecuringTomorrow"]["My statement on the vote to begin the floor debate to repeal and replace Obamacare: https://t.co/tM3ImN6EhR"]["Praying for my friend @DrPhilRoe and wishing him a speedy recovery. He's an outstanding representative for the people of the 1st district. https://t.co/agEm0YY6r0"][".@SenAlexander and I enjoyed welcoming 140+ Tennesseans to Capitol Hill this morning at our weekly constituent breakfast. #TennesseeTuesday https://t.co/fmq7XrI21X"]["Doug Overbey is an outstanding choice to serve Tennesseans as U.S. Attorney for the Eastern District. My statement: https://t.co/AbLa2BHNRa."]["Thank you to everyone who attended #JointOperation this week. I look forward to holding more of these events across the state in the future. https://t.co/N4B85KJNIM"]["The #KRG is a crucial ally in restoring peace to the Middle East. Enjoyed meeting with @FalahMustafa this afternoon. https://t.co/eqsrGpVrMb"]["Enjoyed chatting with members of @tnffa during their visit to Capitol Hill this morning. https://t.co/sTVYY58Uut"]["Great to see my former colleague, Senator @kaybaileyhutch, yesterday and discuss her nomination to be the next U.S. ambassador to @NATO. https://t.co/Q8jVoHwVM6"]["I’ll be hosting additional Joint Operation events across the state in the future. More about yesterday’s event: https://t.co/nHS18QgD7H."]["Our Joint Operation event in Knoxville yesterday was a huge success. 600+ veterans attended this one-stop shop to access local resources. https://t.co/cI23AG3d4y"]["My statement regarding the Senate health care debate: https://t.co/5KOmTWT9Hc"][".@SenJohnMcCain is a friend, a fighter, and a great American. My prayers will be with him, his family, and his staff in the days ahead."]["The Trump administration is not playing around and is focused on completely annihilating ISIS. My statement on today's briefing: https://t.co/TCza4e2vo7"]["The ever-advancing work of @ORNL continues to keep Tennessee on the forefront of science. Great to meet with Director Thomas Zacharia. https://t.co/PK8TwROTkV"]["Outstanding turnout at Joint Operation in Knoxville this morning. Our team will be there until 2:00 p.m. ET today to help answer questions. https://t.co/ZFlUQIZkqO"]["HAPPENING NOW in Knoxville: \"Joint Operation\", a one-stop shop for veterans to access the resources they need. https://t.co/88NHgp2i60 https://t.co/TIUFWVFxI5"]["Enjoyed meeting with @CUFI yesterday to discuss a number of issues important to the 60,000 Tennesseans their organization represents. https://t.co/67dvZabhNK"]["Had a great discussion with @jdgreenblatt45 today. Appreciate the important work he is doing on behalf of our country. https://t.co/nsztVIzD7V"]["Great to have 100+ Tennesseans at our weekly constituent breakfast this morning on Capitol Hill. Learn more at https://t.co/KNtBh0uEie. https://t.co/Q7WZv9EZc9"]["It is clear that @realDonaldTrump is fully committed to confront the threat from Iran in a strategic and effective way. My full statement: https://t.co/IzZCPD6nf6"]["WATCH: At 5:00 p.m. ET, the #SFRC will hold a hearing on the fiscal year 2018 @StateDept authorization bill. https://t.co/bjt4W95Nu8"]["Appreciate @realDonaldTrump moving quickly to fill the critical judicial vacancies in Middle Tennessee. Read more: https://t.co/lJK2s3zDRD"]["VETERANS: Join us at “Joint Operation” THIS Wednesday in Knoxville. 70+ organizations and agencies will be on hand. https://t.co/88NHgp2i60 https://t.co/jj3I5Zow36"]["I welcome @realDonaldTrump's decision to nominate @senatornorris and Tommy Parker to serve West Tennessee as federal district court judges: https://t.co/bmqTLFEkDV"]["Glad to meet with Samir, of Murfreesboro, who was in town as part of the Capitol Leadership Academy for student leaders. https://t.co/XqiERGOKzh"]["Hoping for a speedy recovery for my friend @SenJohnMcCain. He's tough, and I'm sure he'll be back very soon. https://t.co/UnledxJNoW"]["Two years after the horrific attack, please join me in remembering the Chattanooga #FallenFive and their families. https://t.co/Kr8J4RTYma"]["There is no one more well-suited than Bill Hagerty to serve as U.S. ambassador to Japan. I’m glad he has been confirmed by the Senate. https://t.co/vAfcxqKlYh"]["My full statement on the revised Senate health care legislation is below. Learn more and provide input here: https://t.co/Xq6EnoUrIi. https://t.co/lpA58CSTIm"]["The work done at @StJude is a source of great pride in Tennessee. 5-year-old cancer survivor Lela is one of the thousands of reasons why. https://t.co/DXfDMsOLL0"]["Saddened by the death of #LiuXiaobo. His courage and determination in the face of injustice will be remembered for generations to come."]["At 9:30 a.m. ET, #SFRC will hold a hearing on the 2017 @StateDept #TIPReport. WATCH: https://t.co/7SeJDtjEWV. #EndSlaveryAct #enditmovement"]["Great to meet with Tennessee #BofAStudentLeaders and thank them for their focus on civic engagement and strengthening their communities. https://t.co/QMVbl2hfIK"][".@SenAlexander and I enjoyed welcoming 130+ Tennesseans to Capitol Hill yesterday at our weekly constituent breakfast. https://t.co/s4ZfLXiI9P"]["#SFRC approved @AmbassadorGreen to head @USAID. He brings significant expertise to this role and will be confirmed overwhelmingly."]["TUNE IN: #SFRC hearing at 10:00 a.m. ET on the consideration of the Taylor Force Act. Watch here: https://t.co/FIjmLuLgbp."]["We should stay in Washington as long as it takes to complete our work on behalf of the American people. My statement on the recess delay: https://t.co/F6Q5OBqIip"]["Join us in Knoxville next week for Joint Operation. 70+ agencies and organizations will be in attendance to answer veterans’ questions. https://t.co/vLEWau9tQu"]["More than 70 agencies and organizations will be at Joint Operation to answer your questions. Full list: https://t.co/c45Q82hA05."]["Proud to launch “Joint Operation,” a free event to connect veterans with government resources. Join my staff in Knoxville on July 19: https://t.co/TVNmR2Zg5R"]["Moved by the stories of Tennesseans who have lived through addiction and inspired to hear how our state is working to combat this epidemic. https://t.co/M7jEWmQew6"]["Modern day slavery represents a threat to every community. @dreasoning is helping solve the problem. #enditmovement #EndSlaveryAct ❌ https://t.co/Og2V8xmyk7"]["The greatest threat to our nation is our inability to get our fiscal house in order. My comments on @SquawkCNBC: https://t.co/907gmOS92s"]["Wishing you a happy and safe  #FourthOfJuly! My statement in honor of Independence Day: https://t.co/1zcVm2rQ5a"]["Had a good conversation with @realDonaldTrump today and stand with him in his efforts to rally the world to stop this historic crisis. https://t.co/sfwwrnQE6D"][".@realDonaldTrump has made another excellent decision in selecting Don Cochran to serve as U.S. Attorney: https://t.co/O8P83SBAvs"]["We should use every tool at our disposal to pressure all GCC countries to root out terrorism in all its forms."]["The ongoing crisis is an opportunity for us to get far more serious about pressuring the GCC to stop these activities."]["The truth is that all GCC countries have failed to adequately address terror financing within their borders."]["Enjoyed meeting with @TNFarmers yesterday and discussing the important role they play in our local communities. https://t.co/7eeWPcaN7A"]["Good to meet with Bill May, president of the Memphis-based American Cotton Shippers Association, about domestic and international trade. https://t.co/IfN9Ys2Q5h"]["Thankful for the #TIPReport Heroes honored today by the @JTIP_State for their efforts to fight modern slavery. #enditmovement #endslaveryact https://t.co/wy9uRdxxGo"]["My full statement on the 2017 #TIPReport, a critical tool in our efforts to end modern slavery: https://t.co/jZyr4sN1s2. #enditmovement"]["It was great to welcome 90+ Tennesseans to Capitol Hill this morning at our weekly constituent breakfast. #TennesseeTuesday https://t.co/5jB0Bf7etp"]["Glad to be at the @StateDept with Secretary Tillerson and @IvankaTrump for the release of the TIP report. #EndSlaveryAct #enditmovement"]["I will withhold consent on future arms sales to GCC until a path to resolve the dispute is established. My letter: https://t.co/PTOlC5Wcmk."]["Thank you, @realDonaldTrump, for approving federal assistance to help 12 Tennessee counties recover from Memorial Day storms and flooding. https://t.co/6A3a9IQtaN"]["Honored to receive the National Eagle Award from @WTCABC yesterday. Proud to support the local construction industry. https://t.co/QkMvW2fXE8"][".@realDonaldTrump is keeping his word to veterans. My statement on the VA accountability legislation becoming law: https://t.co/SjwFN9ZYmq."]["I appreciate the incredible work @u2’s Bono and the @onecampaign do to help end extreme poverty and disease around the world. https://t.co/6iXmbMaGqe"]["Tennesseans who wish to read the discussion draft and provide input to my office can do so here: https://t.co/oY53ajuEIB."]["My statement on the discussion draft of the Senate health care legislation: https://t.co/DhTnBmyiwa"][".@TheJusticeDept's public safety partnership with Jackson will be an added resource for local law enforcement. More: https://t.co/1sxSHB21xX"]["Glad to see Memphis and @TheJusticeDept working together to combat violent crime. My statement on this partnership: https://t.co/1sxSHB21xX. https://t.co/nvUlCmo2y8"][".@SenAlexander and I enjoyed speaking with more than 80 Tennesseans yesterday at our weekly constituent breakfast. #TennesseeTuesday https://t.co/AEcflFFFHo"]["TUNE IN: #SFRC hearing at 10:00 a.m. ET on congressional authorizations for the use of military force. Watch at https://t.co/S6dvnLHAP7."]["My statement on @realDonaldTrump’s announcement today on #Cuba: https://t.co/pB0w6L37tC"]["It was great to chat with @simon_youth Nashville students this week during their visit to Capitol Hill. https://t.co/d9VDXj9lYz"]["I hope this legislation will serve as an example of what we can accomplish when we all work together on behalf of the American people."]["It sends a clear signal to both Iran and Russia that our country will stand firm in the face of destabilizing behavior."]["It marks a significant shift of power back to the people’s representatives, a priority of mine since becoming the lead Republican on #SFRC."]["By a vote of 98 to 2, the Senate passed my legislation today to strengthen and expand sanctions on Iran and Russia: https://t.co/5SVoDZhg0b"][".@SenAlexander and I enjoyed meeting @TNHistoryDay parents and students visiting D.C. for the National History Day Contest this week. https://t.co/LgxHcwWQ95"]["We were honored to have @SpeakerRyan before #SFRC today and thank him for his leadership and unifying comments after yesterday’s shooting. https://t.co/H94o857Aoz"]["TUNE IN: #SFRC hearing today at 10:15 a.m. ET on the nomination of Mark Green to be @USAID administrator. https://t.co/55ijotgLoE"]["Yesterday, we requested federal disaster assistance for Tenn. counties impacted by last month's storms and flooding: https://t.co/MmS27Yqle0"]["We will not continue to tolerate such actions, and I am glad we are one step closer to passage of our legislation to hold Iran accountable."]["Russia continues to violate the sovereignty of Ukraine, aggravate the crisis in Syria, and destabilize democracies around the world."]["This amendment sends a strong signal to President Putin while ensuring the Trump administration has the flexibility it needs."]["Today, we overwhelmingly (97 to 2) passed an amendment to strengthen and expand current U.S. sanctions on Russia. https://t.co/ETnQm8c4Z4"]["Great meeting with @Titans President Steve Underwood, Counsel Burke Nihill and @NFL Sr. VP of Labor Policy and League Affairs Adolpho Birch. https://t.co/iAASgFX7L3"]["Watch my floor remarks from earlier today urging swift passage of our bill to hold Iran accountable: https://t.co/iPO3uhfgtt"]["My prayers are with all those affected by this morning's shooting. I am extremely grateful for our brave Capitol Police officers."]["Glad the House passed Senate legislation to increase accountability at the @DeptVetAffairs. My earlier statement: https://t.co/oPyYonHw5Z"][".@SenAlexander and I enjoyed having 100+ Tennesseans on Capitol Hill this morning at our weekly constituent breakfast. #TennesseeTuesday https://t.co/1mOQ5XeMXr"]["I appreciate Secretary Tillerson taking time following our hearing today to meet and recognize the great work of our summer interns. https://t.co/GRoQryIizF"]["At 10:00 a.m. ET, #SFRC will hear from Secretary Tillerson on the FY 2018 @StateDept budget request. WATCH: https://t.co/JtV8ENuVlg."]["Pleased @realDonaldTrump has nominated Mike Dunavant to serve Tennesseans as U.S. Attorney for the Western District: https://t.co/LA3tTI3eYT"]["Honored to be in Atlanta yesterday for #Rotary17 with @aplusk and @garyhaugen to discuss progress in the fight to end modern slavery. https://t.co/R9jVbx0qA4"][".@StanleyBlkDeckr expanding its Jackson operation and creating 255 jobs is great news for Madison County. #Jobs4TN https://t.co/vqXDb1qnJu"]["Glad to be at the @WhiteHouse with @realDonaldTrump this week to work through some important foreign policy matters. https://t.co/Oo4OIvJlIw"]["Looking forward to watching Game 5 tonight. Best of luck, @PredsNHL! #Smashville and the entire state of Tennessee stand with you. #NSHvsPIT"]["Congratulations to @SenScottBrown on his confirmation as U.S. ambassador to New Zealand and Samoa. Our nation will benefit from his service."]["Proud to cosponsor two bipartisan bills to help in the fight against modern slavery. Learn more: https://t.co/Yn6FOXyGn8. #enditmovement ❌"]["WATCH: #SFRC hearing today at 10:00 a.m. ET on the global threat from ISIS. https://t.co/2ztgFCbmQI"]["#SFRC approved Bill Hagerty’s nomination to serve as ambassador to #Japan. There is no one more well-suited to fill this important role."]["#SFRC was glad to host @NATO Secretary General @jensstoltenberg today for a productive discussion about our important alliance. https://t.co/18tjIMrv9Z"]["Honored to be at the @WhiteHouse today as @realDonaldTrump signed into law a bill honoring the life of my dear friend Fred Thompson. https://t.co/tm9rG8igpT"]["Today, we passed a bill to help address problems that have plagued the @DeptVetAffairs for too long. My statement: https://t.co/oPyYonZ7uz"]["Thankful for the incredible service and sacrifice of the 160,000 Allied troops that landed on the beaches of Normandy 73 years ago. #DDay"]["Enjoyed meeting with Mark Green, @realDonaldTrump's nominee to lead @USAID. It is a critical position, and I look forward to his hearing. https://t.co/KXnyDvGwng"]["Glad to see #Montenegro make it official and look forward to tomorrow's #SFRC meeting with @NATO’s @jensstoltenberg. https://t.co/hQ80T0xrTs"]["Peyton's philanthropic contributions have made my hometown of Chattanooga, the state of Tennessee and our country better. @fordstheatre"]["It was an honor to present the Lincoln Award to my longtime friend Peyton Manning at last night's @fordstheatre gala. https://t.co/I9yFgb8CbY"]["I was honored to help congratulate a number of very impressive high school seniors. I know they make Greene County proud. https://t.co/BpX7odbshG"]["It was great to be in Greeneville yesterday and hear from folks at the Kiwanis Club luncheon. https://t.co/ZPuo4KoJp1"]["Since it will be four years before the U.S. is officially out, @POTUS could work toward an agreement that could be ratified by the Senate."]["If the Paris agreement were so important to the future of the world, why was President Obama so unwilling to have it ratified as a treaty?"]["No one should be surprised that one man deciding the fate of our country with the Paris climate agreement can easily be undone by one man."]["Unlike France and Germany, President Obama purposely chose not to have the Paris agreement ratified by the Senate."]["The left's anger about the Paris climate agreement should be directed at President Obama."]["221 years ago today Tennessee became the 16th state to join the union. It’s a privilege to serve you in the Senate. #HappyBirthdayTennessee"]["My statement on the Trump administration’s decision to withdraw from the Paris climate agreement: https://t.co/7KTplxaaMI"]["Spoke with Amb. Llorens today about the Kabul terror attack. U.S. foreign service officers are standing strong with our Afghan partners. https://t.co/2uOG0MnVIs"]["@USEmbassyKabul Spoke with Amb. Llorens today about the Kabul terror attack. U.S. foreign service officers are standing strong with our Afghan partners."]["Honored to help welcome @EastmanChemCo to the Junior Achievement Business Hall of Fame. The company plays a vital role in the region. https://t.co/s1cXDIyZ6y"]["Remembering the men and women who made the ultimate sacrifice. We are forever grateful for their service to our country. #MemorialDay"]["Joining @chucktodd on @MeetthePress this morning to discuss @POTUS’ international trip. Check your local listings: https://t.co/IIhBasMqSG."]["The @NLRB decision to allow \"micro-unions\" is a perfect example of federal overreach. Proud to join an effort to reverse this. My statement: https://t.co/IwBaWVXDE3"]["Glad the bill I cosponsored with @marcorubio &amp; @SenatorCardin to seek justice for war crimes in Syria passed #SFRC. https://t.co/FD2MDZRqzn"]["Great to chat with 8th graders and parents from Norris Middle School on Capitol Hill this afternoon. https://t.co/msVmds7TwS"]["I am proud of the strong bipartisan momentum behind this effort and will push for timely consideration on the Senate floor."]["Our bill also sends an important signal that the U.S. will no longer look the other way in the face of continued Iranian aggression."]["We can no longer allow the nuclear agreement with Iran to dictate U.S. policy throughout the Middle East."]["Today, the #SFRC passed (18 to 3) our bill to hold Iran accountable for their non-nuclear destabilizing activities. https://t.co/kWfIWSip2G"]["Proud to join in unanimous #SFRC support for @SenScottBrown to serve as U.S. ambassador to New Zealand and Samoa."]["Pleased that legislation naming the Nashville federal courthouse in honor of Fred Thompson heads to @POTUS' desk: https://t.co/oWIb8rfRsj"]["Great to have so many Tennesseans on Capitol Hill this morning at our weekly constituent breakfast. Learn more at https://t.co/KNtBh0uEie. https://t.co/BJlZ5iBPqr"]["My proposal fully implemented the entry/exit system and mandated the initiation of removal proceedings for at least 90% of visa overstays."]["Border security is critical. But we also need strong interior enforcement, which was a big part of my 2013 proposal. https://t.co/YpfvSm04tn"]["Huge win in #Smashville over the @AnaheimDucks! @PredsNHL advance and are one step closer to the #StanleyCup. #StandWithUs #ANAvsNSH"]["We are horrified by the reports and images out of #Manchester and will continue to monitor the situation. Praying for all those affected."]["Congratulations to @TerryBranstad on being confirmed as ambassador to China. I was proud to join my colleagues in voting for him today."]["Last year, Tennessee lost six officers in the line of duty. Proud to honor their lives and other officers who made the ultimate sacrifice."]["#GSEreform should be done through bipartisan congressional action. Watch my exchange yesterday with @stevenmnuchin1: https://t.co/jS89gxnw3J"]["Started off my day yesterday by welcoming 8th graders and parents from Rockwood Middle School to Capitol Hill. https://t.co/mNkHwHwaYY"]["Enjoyed meeting with Memphis-based @IntlPaperCo, which employs nearly 2,800 across the region. Appreciate their investment in our state. https://t.co/xfz6RUgVFS"]["My friend and fellow Tennessean Bill Hagerty will represent the very best of our country as ambassador to Japan. https://t.co/InWNrvduNf"]["Great to talk with @ChancellorDav, @UTKnoxville’s new chancellor, while she was in D.C. this week. https://t.co/tUPiWjKQPn"]["Discussed a number of important issues with @TNAOR earlier this week. It was great to hear what’s on their minds. https://t.co/D85HfTMJcF"]["Glad to welcome the Hagerty family to Capitol Hill ahead of this morning’s #SFRC hearing. Bill will serve our country well in Japan. https://t.co/mu2YtXDjCs"]["WATCH: #SFRC hearing at 9:30 a.m. ET on the nomination of Bill Hagerty to be the next U.S. ambassador to Japan. https://t.co/gECP2fNqFO"]["I look forward to hearing from Deputy AG Rosenstein about his decision to appoint a special counsel when he briefs the Senate tomorrow."]["Great to meet with Nashville-based @hthhglobal and @JenniferNettles to learn more about their humanitarian work and global health advocacy. https://t.co/3XKHFO10tB"]["Had a great meeting at the @WhiteHouse today and appreciate @IvankaTrump’s focus on addressing modern slavery. #enditmovement #EndSlaveryAct"]["Great to speak with students and teachers from Elizabethton’s T.A. Dugger Junior High School with @senalexander this morning. https://t.co/urhwCZr2Kr"][".@senalexander and I enjoyed meeting with members of the @TNChamber during their visit to Capitol Hill yesterday. https://t.co/fpp9fZStfv"]["Wishing you all the best in your fight and will be praying for you, @maziehirono. https://t.co/dIygwzSezL"]["Thinking about my good friend @SenThomTillis this morning and praying for a quick recovery. https://t.co/kZKCMVVPLh"]["Honored to meet the family of @TBInvestigation Special Agent Frazier. His life and service are being honored as part of #NationalPoliceWeek. https://t.co/kJRjwDoKUa"]["This morning, @senalexander and I enjoyed welcoming more than 90 Tennesseans to Capitol Hill at our weekly constituent breakfast. https://t.co/ABScwGsoVI"][".@FHFA shouldn't take actions that hinder congressional #GSEreform efforts. My comments at today's banking hearing: https://t.co/Y4V1r9b1Qh"]["Enjoyed meeting with students and parents of Our Lady of Perpetual Help Catholic School in Germantown during their visit to the Capitol. https://t.co/DS93T4rR9q"]["#FoodAid reforms will allow us to feed more people and save more lives without asking more of the American people. https://t.co/12a3hHYvfc"]["My op-ed with @ChrisCoons on our trip to the world’s largest refugee camp and the need for #FoodAid reform: https://t.co/12a3hHYvfc"]["The current atmosphere in D.C. is preventing us from addressing our country's fiscal mess. My comments at today's budget committee hearing: https://t.co/Zmr5guU952"]["My statement on FBI Director James Comey: https://t.co/OTDZBy6VeR"]["John Sullivan is equipped to be an exceptional deputy secretary of state, and I look forward to very strongly supporting his nomination. https://t.co/uaPHR9xvW4"][".@SenAlexander and I had a great time welcoming more than 80 Tennesseans to Capitol Hill this morning at our weekly constituent breakfast. https://t.co/860J37ueSK"]["Good discussion yesterday with the Tennessee Hospital Association about the need for health care policy that works for the American people. https://t.co/WxkGFEz1ZN"]["#SFRC unanimously approved @TerryBranstad's nomination to be U.S. ambassador to China. I look forward to his confirmation by full Senate."][".@TerryBranstad Immediately following the votes, #SFRC will hold a hearing on the nomination of the John Sullivan to be next deputy secretary of state."]["10:00 a.m. ET: #SFRC will vote on a number of nominations, including @TerryBranstad to be U.S. ambassador to China https://t.co/dEsGE4Lc6x"]["Thankful more than 80 girls kidnapped by Boko Haram have found freedom. #enditmovement ❌ https://t.co/wPiAfzla42"]["Community banks play a critical role in our state. I enjoyed meeting with 90+ @TNBankers this week about issues important to their work. https://t.co/QqtJkxJN5S"]["Today, I voted against the trillion dollar omnibus spending bill for fiscal year 2017. My full statement: https://t.co/M6dNHwSqQd"]["WATCH: #SFRC hearing today at 10:00 a.m. ET on the private sector’s role in international development. https://t.co/0JWznv6RJQ"]["Americans are not being served well by the broken federal budget process. https://t.co/XWmSMuBA8k"]["Great to meet with my friend and fellow Tennessean, Bill Hagerty, yesterday on his nomination to serve as the next U.S. ambassador to Japan. https://t.co/erWsoJ7JWj"]["It was great to see @louiegiglio and @Ben_Stuart_ yesterday. I very much appreciate their support of the #EndSlaveryAct. #enditmovement ❌ https://t.co/cD66WI2FxV"]["Great meeting with J.R. Hand and Jay Smith of @HandFamilyCo. The Clarksville-based company employs thousands across TN, KY, and IL. https://t.co/uoW0ojcNeI"]["Great to welcome so many Tennesseans to Capitol Hill today at our weekly constituent breakfast. Learn more at https://t.co/KNtBh0uEie. https://t.co/leWpDKnaST"]["My opening statement at the nomination hearing for @TerryBranstad to be U.S. ambassador to China: https://t.co/0FTSxPe5la."]["Enjoyed meeting with @Nissan’s new CEO Hiroto Saikawa yesterday and discussing the company’s valued investment in our state. https://t.co/BvIR9cD9fL"]["WATCH: #SFRC hearing at 10:00 a.m. ET on the nomination of Terry Branstad to be the next U.S. ambassador to China. https://t.co/chhjUEGYJN"]["Glad to join the @IntlCodeCouncil to recognize the importance of building safety and their essential service to our local communities. https://t.co/adZomVX9wx"]["Interested in receiving updates from our office each week? Sign up for our weekly newsletter here: https://t.co/kONQ78IMDS."]["Proud to reintroduce the Tennessee Wilderness Act with @SenAlexander and @DrPhilRoe. Learn more about our efforts: https://t.co/Rr0Snmoz7e."]["Enjoyed running into Tennesseans with @SHAPE_America and learning about the programs they’re promoting in schools to keep our kids active. https://t.co/ZwagnnyBk8"]["Enjoyed meeting with Emma Selner of @RhodesCollege and discussing her work with @CURinAction and #2017POTH. Proud of your accomplishments. https://t.co/w1jnpsDOE5"]["I had a great time meeting students from @FCScommanders during their visit to the Capitol yesterday. https://t.co/dRp9t5YYeI"]["Congratulations to Marquavious Moore of @HardingLions on being a finalist in the 2017 @PoetryOutLoud competition. Best of luck! https://t.co/ktfmtytpds"]["Proud to see @FarragutMS and Oak Ridge High School in the National Science Bowl finals. They'll represent Tennessee well at the @DOE_SC_NSB."]["Enjoyed meeting with @UneedPSI and learning about the work they do to impact the lives of patients like six-year-old Nashvillian Elise. https://t.co/DZL54U9uJG"]["Thanks @Rotary for your efforts to #endpolio worldwide. Great to be with you last night and am excited about the future of our partnership. https://t.co/i4w6i0pI4h"]["If we use the 1% we spend on foreign aid wisely, we can help keep our men and women in uniform out of harm’s way. https://t.co/bzkeyPxTLm"]["Had a great time with @TNELECTRIC this afternoon and very much appreciated gaining insights from @MidTnElectric director Dan Smith. https://t.co/Q9VIWJTkQV"]["I always enjoy starting off my Tuesday by welcoming Tennesseans to Capitol Hill. Learn more at https://t.co/KNtBh0uEie. https://t.co/EGSnTFvzz9"]["Today, @ChrisCoons and I joined @Morning_Joe to explain how #FoodAid reform could feed 5-8 million more people a year with the same dollars. https://t.co/SllbciEtf8"]["Sonny Perdue understands the challenges facing American farmers. Proud to support his nomination. Full statement: https://t.co/ryNnuxT9dW"]["This morning at 8:30 a.m. ET, I'll join @ChrisCoons on @Morning_Joe to discuss our recent trip to Uganda and #FoodAid reform. https://t.co/Fasq2ohv8k"]["Congratulations to the @PredsNHL on their impressive win last night to sweep the Blackhawks. Good luck in the next round. #PredsPride"]["Glad Aya, Mohamed and four others are now safely home in the U.S. Thank you for your leadership, @realDonaldTrump. https://t.co/aXuIugjTan"]["We had a great time in Crossville this afternoon. Thanks for having us for lunch and a lively discussion about a wide range of issues. https://t.co/MBi8eM9bZx"]["Congrats to @MayorStanJoyner and @MEM_Library director Keenon McCloy on being this year’s recipients of the Dunavant Public Servant Awards. https://t.co/emxeaEKH0t"]["Had the privilege of meeting with our men and women of @TennesseeGuard’s @118thWing this morning. Thank you for your service. https://t.co/LmmrwoyFug"]["Ruth Holmberg was one of the kindest and most generous champions for Chattanooga. She will be greatly missed. My statement on her passing: https://t.co/EMbqgWtDcx"]["Proud to support @GoParks and TN’s own @greatsmokynps in celebrating National Park Week. Learn more: https://t.co/v33PC4006a. #FindYourPark"]["It's good to be in Brentwood this morning to answer questions and hear from Tennesseans. https://t.co/17yP0g0S4w"]["Enjoyed this morning's town hall organized by the Arlington Chamber. Appreciated the great questions and opportunity to address concerns. https://t.co/az7BNdpNwz"]["We had a wonderful time with our grandson at the @WhiteHouse #EasterEggRoll this morning. Thanks for the warm welcome, @POTUS and @FLOTUS. https://t.co/sC6yuD9PI5"][".@ChrisCoons We will continue to press for using existing U.S. food aid resources more efficiently to reach millions more people each year. https://t.co/WYsUdHk5J1"]["Last week, @ChrisCoons and I witnessed firsthand the immense suffering caused by the man-made global food crisis. https://t.co/aV4X2M9mku https://t.co/GizCEhCC3m"]["Check out this powerful display at the @etsu art show by Laura Rogers, who focused her design on the #enditmovement. Love the passion! https://t.co/bDqERWY1rP"]["Congrats, Melissa! It was an honor to recommend you. We are grateful for your willingness to serve our country. https://t.co/vtSJF0V12D"]["Congrats to Judge Gorsuch as he takes his seat on the #SCOTUS today. I have full confidence in him and was proud to support his nomination. https://t.co/6CjRfyxkpc"]["Prayers for those impacted by the terrible attacks in Egypt, where ISIS targeted two Coptic churches during Palm Sunday celebrations."][".@DrMarkGreen4TN is well-suited to serve our nation as Secretary of the Army. My full statement on his nomination: https://t.co/QeMnJ248vr"]["I was proud to cast a vote today to #ConfirmGorsuch. Here's my full statement: https://t.co/8Vq8NmUK35."]["I am proud of the president and of our nation for the strikes in Syria that sent the right message to Assad about using chemical weapons. https://t.co/ixLyEXmq7E"]["Assad is a brutal dictator who belongs behind bars. Our bill supports a legitimate process to hold him accountable. https://t.co/IujuUZEz0b"]["My statement in response to U.S. missile strikes in #Syria: https://t.co/8oL0QlpIeS"]["Good to sit down with Mexico's Foreign Secretary @LVidegaray and discuss the important relationship we share with our neighbor to the south. https://t.co/FzFRE7H4Sz"]["Had the incredible privilege of meeting with Nashville singer-songwriter Rory Feek as part of #GRAMMYsOnTheHill advocacy day. https://t.co/5T3p6pyXGX"]["Joined @3onyourside yesterday to discuss how our bill would rescue Americans left with zero options on the ACA exchanges next year. https://t.co/6M9RV6o3zq"]["Assad should be behind bars. Hopefully this latest chemical weapons attack is enough evidence to get the world community behind that effort. https://t.co/IyrV66UNWr"]["Putin is not worthy of a place on the world stage if his support for the monstrous dictator Assad continues. https://t.co/P1CxsZAS3f"]["I was glad to meet the Renfro family of Chattanooga earlier today during their trip to Washington, D.C. https://t.co/odDVR0nrqU"]["Assad is a war criminal who must answer for his heinous crimes against humanity. Read our Senate resolution: https://t.co/BJVJrPbNx4"]["Appreciated the opportunity to meet with students, teachers and parents from @usjbruins during their spring break trip. https://t.co/4XXgKoFWqg"]["Had a great meeting with the @CarpetRugInstit yesterday to discuss their impact on the industry and consumers across Tennessee. https://t.co/qCLYiegLjb"]["The #SFRC enjoyed welcoming Egyptian president @AlsisiOfficial to Capitol Hill yesterday to discuss the U.S. and Egyptian partnership. https://t.co/NwS2D4irvN"]["Enjoyed the opportunity to sit down with Governor @TerryBranstad and discuss his nomination to be the next U.S. ambassador to China. https://t.co/DoEe5ItFsW"][".@SenAlexander and I had a great time meeting more than 100 Tennesseans yesterday at our weekly constituent breakfast on Capitol Hill. https://t.co/fUBBG6yEhN"]["My comments on reports of a chemical attack in #Syria and the regrettable failure to hold Assad accountable in 2013. https://t.co/smoLHhMd1x"]["TUNE IN: #SFRC hearing at 10:15 a.m. ET on U.S. partnership with the European Union to deter Russian aggression. https://t.co/BpCWNRKGQ0"]["It was great to talk with students from the Chattanooga School for the Arts and Sciences Orchestra last week during their visit to D.C. https://t.co/SDfNqXZXOm"]["Learn more about the bill we introduced to rescue Americans with zero options for insurance on the ACA exchanges: https://t.co/NJclNIuKmF"]["It was great to talk with students from Goodpasture Christian School in Nashville during their spring break trip this week. https://t.co/0QhzK1AHsN"]["Enjoyed meeting this week with students from Hope Inc. of Kingsport, which empowers teens through education and life skills development. https://t.co/8kAWKbnuTh"]["The Venezuelan Supreme Court’s attempt to usurp legislature authority is outrageous. My full statement: https://t.co/eIXqS49XZf"]["Appreciative of the opportunity to sit down with Prime Minister @larsloekke of Denmark to discuss the current state of global affairs. https://t.co/bUTnyw5PrE"]["My full statement on the @USCBO’s 2017 Long-Term Budget Outlook: https://t.co/uF5fnu3ts7 https://t.co/vP4UhDF4KZ"][".@USCBO report underscores the need for Congress and the administration to address our dire fiscal imbalance. https://t.co/TNk7ZCwwNC"]["Enjoyed meeting with the Clarksville and @MCGTN leadership yesterday to discuss the importance of @FortCampbell and @101stAASLTDIV. https://t.co/Wwhpdxh1yd"]["I enjoyed meeting with @PMaurerICRC yesterday and appreciate @ICRC’s humanitarian work in Nigeria, South Sudan, Somalia and Yemen. https://t.co/tuU2TtHK8n"]["NOW: Stephen Hadley and @madeleine testifying in SFRC on U.S. interests and values from a global perspective. Watch: https://t.co/NSnmWk0QqD"]["We have come a long way in our country when the speaker of one party urges a president NOT to work with the other party to solve a problem."]["Had a great discussion with General Max Haston of the @TennesseeGuard this morning. I very much appreciate his leadership. https://t.co/7dxYv35DDS"]["Thanks to my colleagues for joining me in an overwhelming 97 to 2 vote in favor of @MeGovernment joining @NATO. https://t.co/5eBNfQR3wQ"]["Enjoyed speaking with @AIPAC members from Tennessee this afternoon about the importance of the U.S.-Israel relationship. #AIPAC2017 https://t.co/Z9PX6vDfP1"][".@SenAlexander and I enjoyed greeting more than 200 Tennesseans this morning at our weekly constituent breakfast on Capitol Hill. https://t.co/kTIIfW6zL1"]["TUNE IN: #SFRC hearing today at 10:30 a.m. ET on U.S. policy toward #Iran. Watch here: https://t.co/S8YmJsVeov."]["Part of what makes @NATO great is its open door. Today I urged my colleagues to support @MeGovernment’s bid. https://t.co/yF3F49hWog"]["Great discussion today at #AIPAC2017 with @SenatorCardin about efforts in Congress to support Israel and deter the threat from Iran. https://t.co/tzYSm131ZB"]["Don't buy the fake news. I announced my support for Judge Gorsuch last month and am not in \"secret\" talks with Schumer re: his confirmation."]["I had a nice talk tonight with @realDonaldTrump about health care. Here's my full statement on the House bill: https://t.co/qbFtAjzp7Z."]["There is strong bipartisan support for my legislation with @SenatorMenendez to hold Iran accountable. Learn more: https://t.co/euaTTlhyQl."]["Judge Gorsuch handled himself with great integrity during his hearings this week. Proud to support his nomination. #ConfirmGorsuch https://t.co/DyjdHR1DED"]["Bill Hagerty will serve America’s interests and our relationship with the Japanese people well. My full statement: https://t.co/zjMmpWhz0g."]["These steps will allow us to regain the initiative on #Iran and pushback forcefully against this threat to our security. https://t.co/tT5arXVnFl"]["This legislation demonstrates the strong bipartisan support in Congress for targeting all aspects of Iran’s destabilizing actions. https://t.co/5S6aqwhYUG"]["Thank you to my colleagues who joined me in introducing a comprehensive approach for holding #Iran accountable. https://t.co/2k4ZBq0IFH"]["Great to meet with members of the @MemphisChamber yesterday and hear their thoughts on a number of issues impacting West Tennessee. https://t.co/o9PAAYEqDq"]["Enjoyed having @ItalyMFA Angelino Alfano on Capitol Hill. Appreciative of his country’s commitment in the fight against modern slavery. https://t.co/owjBncGO0b"]["I will continue my efforts to save lives and feed more people with the same level of funding through necessary #FoodAid reforms."]["We also discussed ways to address countries who block humanitarian access to people in need."][".@nikkihaley and I just spoke about the importance of all donor countries meeting financial commitments."]["Tens of millions of people are starving worldwide. The U.S. is showing strong leadership in addressing the crisis, but we can't do it alone."]["Yesterday the #SFRC welcomed Iraqi Prime Minister @HaiderAlAbadi to Capitol Hill. Our alliance is crucial in the fight against ISIS. https://t.co/JdMb8Ubt8R"]["I hope we will overcome the special interests to reform #FoodAid delivery. More from today’s #SFRC hearing: https://t.co/VJrpfW9eAx."]["I enjoyed meeting with @JuanOrlandoH this week and discussing his efforts to boost economic growth to benefit the Honduran people. https://t.co/zMxQVwEYUM"]["ICYMI, here’s my opening statement at today’s #SFRC hearing on the state of the global humanitarian crisis: https://t.co/OpV0nEAqyR"]["Our prayers are with the British people following today’s tragic events in London. The U.S. stands with you in the face of this evil."]["Enjoyed speaking to @LifeSciTN at their congressional breakfast this morning in the Capitol. https://t.co/DPcXDmK973"]["TUNE IN: #SFRC hearing today at 10:00 a.m. ET on the state of global humanitarian affairs. Watch here: https://t.co/YeRcpwch6c."]["Great discussion yesterday with Dr. Jeff Balser about the importance of research and the care @VUMChealth provides Tennesseans. https://t.co/YWCkNP3Bgw"]["I appreciate the administration’s focus on the security of the American people. https://t.co/k2Fd33Onb2"][".@SenAlexander and I began our Tuesday morning by welcoming more than 200 Tennesseans to Capitol Hill. Learn more: https://t.co/ObJPynpnux. https://t.co/HcfdkPObxk"]["Enjoyed meeting with the Metropolitan Nashville Airport Authority to discuss their plans for expansion and growth in the Nashville area. https://t.co/cqu53wRNvP"]["Thank you to the @RFInstitute for your work in making international religious liberty a top priority and key global issue. https://t.co/KzVjIC2t3N"]["Today at 2:30 pm ET, the #SFRC and @HouseForeign join the @HolocaustMuseum to honor victims of Syrian war. Watch: https://t.co/RvEplR9jE6."]["Great meeting with Swedish Foreign Minister, @margotwallstrom, yesterday about trade, European security, North Korea and the #enditmovement. https://t.co/hhNSBVwx5e"]["I had fun welcoming JoJo and his family, of Franklin, to D.C. yesterday and was glad to play a small role in his adoption from the DRC. https://t.co/CQjrdbfwE7"]["Enjoyed having breakfast with Cody in the Capitol this morning and being a part of his @MakeAWish journey to D.C. https://t.co/JECbJZNtb8 https://t.co/AoAwlDWmUI"]["Great to talk with the Memphis-Shelby County Airport Authority yesterday about economic growth in the Memphis area. https://t.co/ZW8BRENCMA"]["Joined a number of colleagues in urging U.S. support for @HaiderAlAbadi's efforts to unify and stabilize #Iraq: https://t.co/fi2XN4XJEG"][".@TBInvestigation needs your help to bring Elizabeth home. Please RT to spread the word. #TNAMBERAlert https://t.co/tnNMKg0Ild"]["Discussed the House health care bill with @POTUS yesterday, and I hope these issues will be addressed as the legislation progresses: https://t.co/G4OdH323g6"]["My statement on the Trump administration’s budget blueprint: https://t.co/B8olpOfWAP"]["Thank you, @nikkihaley, for your commitment to implementing the #EndSlaveryAct as we fight to end modern slavery. https://t.co/9AvBdmofvp"]["Secretary Tillerson is right. Our North Korea policy has failed for decades. A different approach is long overdue. https://t.co/4R5O3mC2eC"][".@SenDanCoats has the leadership and judgement needed to serve as the director of national intelligence. My statement on his confirmation: https://t.co/UmTcMNcpGA"]["We just landed in Detroit, where @realDonaldTrump will be discussing regulatory relief and the importance of U.S. auto manufacturing. https://t.co/2vmO05E5nv"]["We had some special guests at Tennessee Tuesday this morning. Happy 105th birthday, @girlscouts! https://t.co/D25RhYsS8D"][".@SenAlexander and I welcomed more than 100 Tennesseans to a snowy Capitol Hill this morning at our weekly constituent breakfast. https://t.co/Dg9uONeuFv"]["Great discussion with this year's @LeadershipTN class tonight in Chattanooga. Appreciate the work these committed leaders do for our state. https://t.co/XgQxUHCV7S"]["Proud to support the music industry and local creators who showcase the incredible talent of Tennesseans worldwide. Thanks, @RecordingAcad! https://t.co/9R8oKhrkwY"]["Great to talk with U.S. ambassador to Ukraine, Marie Yovanovitch, this week about our support for Ukraine in the face of Russian aggression. https://t.co/E0nHEmKNc1"]["Today the #SFRC favorably reported David Friedman's nomination to serve as U.S. ambassador to Israel. My statement: https://t.co/RhFUZNyzc9"]["I will continue to work closely with @realDonaldTrump and my colleagues in Congress on these important issues."]["Had a very good discussion at the @WhiteHouse this afternoon about the budget, health care and national security."]["Enjoyed meeting these impressive young Tennesseans at last night’s @SenateYouth reception. Congratulations on your accomplishments. #USSYP https://t.co/Hu3ySmgJHF"]["Looking forward to a productive meeting with @realDonaldTrump at the @WhiteHouse this afternoon. We’ll be discussing the federal budget."]["Immediately following the vote, the #SFRC will hold a hearing on the conflict in Yemen. Watch here: https://t.co/6aCw5El2aD"]["#SFRC business meeting at 10:30 a.m. ET to consider the nomination of David Friedman as U.S. ambassador to Israel. https://t.co/6aCw5El2aD"]["Nashville-based @dreasoning is doing critical work to detect human trafficking online. Great discussion today. #EndSlaveryAct #enditmovement https://t.co/yJaGEqnz7U"]["Enjoyed meeting with Clay Richards, president of NaviHealth in Brentwood, and his team on post-acute care management &amp; Medicare innovation. https://t.co/R7yi6oJpWT"]["Appreciate @TVICtweets’s efforts to maintain competitive electric rates in our state. Great meeting with them in D.C. today. https://t.co/vzzO6ZPyim"]["Had a great discussion yesterday with @ChattStateCC’s Building Outstanding Service Scholars program. I appreciate their civic engagement. https://t.co/j7OBhpbFJd"]["The Senate unanimously passed our resolution to raise awareness about modern slavery. #EndSlaveryAct #enditmovement https://t.co/OHRj8R755g"]["It is clear that the Affordable Care Act is not working. My statement on introduction of the American Health Care Act: https://t.co/b8u7h0ut7Y"]["Great to meet with members of @dstinc1913 earlier today to discuss a number of issues important to them and their organization. https://t.co/gDU9oxtDem"]["Enjoyed speaking with more than 250 Tennesseans from across the state at our constituent breakfast this morning on Capitol Hill. https://t.co/jTxkYVrwQa"]["Decades of failed U.S. policy demand a new approach to North Korea. The Trump administration’s full-scale review is urgent and overdue. https://t.co/QdCGnQ2TtH"]["Enjoyed meeting members of the @LeeUSymBand during their visit to Capitol Hill this afternoon. https://t.co/NOG9IZrw2C"]["Iran’s dangerous actions demand a coordinated, multi-faceted U.S. response. My statement on their missile tests: https://t.co/7zi4S2uIA7"]["My statement on the Trump administration's revised executive order on immigration: https://t.co/luRyOTGOO8"]["Doug Henry was a true gentleman and a true Tennessee statesman. I will miss his friendship. My full statement: https://t.co/zrcNxvM7xl. https://t.co/QuaYRfRFc1"][".@EndTraffick’s CEO Dave McCleary is a leader in the fight against modern slavery. Thanks for supporting the #EndSlaveryAct. #enditmovement https://t.co/dcrwIRsbD1"][".@Nissan employs thousands across the Volunteer State. Great to meet with CEO Carlos Ghosn earlier this week. https://t.co/sZrkC16c8L"]["ICYMI last week, @IJM President @garyhaugen detailed how the #EndSlaveryAct creates a global effort to fight modern slavery. #enditmovement https://t.co/ynBrUtawPf"]["The situation in #Venezuela is bleak. My opening statement at yesterday’s #SFRC hearing to examine U.S. options: https://t.co/GnecNdgtjb"]["It was great to meet with representatives from @vandystudentgov on Wednesday. Excellent group of young people. https://t.co/3BcpfzSkSb"]["Had a great meeting with @IvankaTrump today to discuss our shared commitment to fighting modern slavery. #EndSlaveryAct #enditmovement"]["Congratulations to @RealBenCarson on being confirmed as @HUDgov Secretary. I look forward to working with him on important housing issues."]["TUNE IN: #SFRC hearing today at 10:30 a.m. ET on U.S. policy options for the crisis in Venezuela. https://t.co/R6kSK2ionb"]["Honored to have Jeff Aiken, President of @TNFarmBureau, as my guest last night at @realDonaldTrump’s #JointSession to Congress. https://t.co/E1uEwcALDC"]["It was great to see members of @realDonaldTrump’s impressive Cabinet last night. Honored to have a front row seat for the #JointSession. https://t.co/OexXN6x7Wb"]["Started the morning chatting with students from Chattanooga’s @BoydBuchanan. Enjoyed having them on Capitol Hill! https://t.co/w4FPUNVvfs"]["Appreciate Richard Gere and @SaveTibetOrg stopping by the office today to discuss their work on behalf of the Tibetan people. https://t.co/NfBGWkAJ6U"]["Great to speak with the @TNCULeague about the regulatory burdens facing our local credit unions. https://t.co/OaPy0ZevBq"][".@realDonaldTrump delivered a very solid speech tonight. Look forward to working with him to move our country forward. #JointSession"]["Tennessee Municipal Electric Power Association members serve more than 70% of electric consumers in our state. Glad to meet with them today. https://t.co/H6J22clHqm"]["Outstanding news for the people of Montgomery County and the surrounding communities. My statement: https://t.co/GjY0cCKJDW. #Jobs4TN https://t.co/y7he5YlK3Z"]["Great to have so many impressive young people on the Hill today. @SenAlexander and I met earlier with @lipscomb and @UTKnoxville students. https://t.co/ATNyuVrjQ3"]["Enjoyed meeting with @UTKSGA this afternoon to discuss important higher education issues. Proud of their leadership. https://t.co/aTZDRkumOs"]["I am looking forward to tonight’s #JointSession. Here are three things I hope @realDonaldTrump will address: https://t.co/3fjCycvaxu"]["#SFRC hearing at 10:00 a.m. ET on the plan to defeat ISIS, focusing on Iraq after the operation to liberate Mosul. https://t.co/YixW1kei3B"]["Thank you for raising your voices. We have a lot of hard work ahead, but together, we can end it. #EndSlaveryAct #enditmovement ❌"]["As @garyhaugen has said, “Nothing will happen just because we’re aware of modern day slavery. But nothing will ever happen until we are.” ❌"]["Overwhelmed by the number of people around the world who joined the #enditmovement yesterday to shine a light on modern slavery. ❌"]["Congratulations to @DaytonCity 3rd grader Sophia Hicks on being this year’s Tennessee Doodle for Google winner. https://t.co/pVrVUfNDHt"]["Tennessee is leading the way in the fight against modern slavery. Working together, we can end it. #enditmovement https://t.co/ox6EeOvRPj"]["Appreciate your support, Diane! #EndSlaveryAct #enditmovement https://t.co/WvBGZXtijk"]["Thank you, @ETSUPrez! #EndSlaveryAct #enditmovement https://t.co/OHnMR8UlV7"]["Thank you, @nikkihaley! Appreciate your support. https://t.co/AX1bexJDEf"][".@theresa_may is a leader in the fight against modern slavery and we appreciate her support of the #EndSlaveryAct. #enditmovement ❌ https://t.co/btspwameyN"]["Appreciate your support, @repdavidkustoff! #EndSlaveryAct #enditmovement https://t.co/5u04P8Cf4U"]["Thank you, @RepMarthaRoby! #EndSlaveryAct #enditmovement https://t.co/3jywYgc5UY"]["@RepKBrooks Thank you, Kevin! Appreciate your support."]["The #EndSlaveryAct would not be law without @SenatorMenendez, who I introduced the bill with in 2015. Appreciate your efforts, Bob! https://t.co/FRl87sBI9H"]["Bishop Sanchez helps lead @Pontifex's effort to end modern slavery. We had a great meeting earlier today at the Vatican. #enditmovement https://t.co/6npRACwnNI"]["My friend @louiegiglio often says, \"If not you, who?\" If not us – if we don’t engage in this fight – who will? #EndSlaveryAct #enditmovement https://t.co/VgFd2DT4Vu"]["The best way to end modern slavery and human trafficking is with a bold vision and U.S. leadership. #EndSlaveryAct #enditmovement ❌ https://t.co/o4MeeJ4EE5"]["Glad to have my good friend Peyton Manning standing with us in the fight against modern slavery. #EndSlaveryAct #enditmovement https://t.co/hp87yRwiYc"]["Thank you for your leadership, @theresa_may. Your commitment to this issue is critically important. #enditmovement #EndSlaveryAct https://t.co/pVTB1HS9IH"]["Thank you, Bill and Crissy! Appreciate your support and friendship. Proud that Tennessee is leading the way in fighting this horrific crime. https://t.co/G7lbGeKujU"]["We were able to pass the #EndSlaveryAct, in part, because of the work by @enditmovement, @IJM, @thorn, and countless others. #enditmovement https://t.co/7vZwwAWLuH"]["Thank you for your support, Thom! #EndSlaveryAct #enditmovement https://t.co/1Klnb50TI8"]["Appreciate your support, @UTPresidentJoe! #EndSlaveryAct #enditmovement https://t.co/ln0j3RrmaX"]["Passing the #EndSlaveryAct was an important step in the fight against modern slavery and human trafficking. #enditmovement ❌ https://t.co/ZsHxHD5AiH"]["At the Vatican today to discuss the #EndSlaveryAct and other important issues with Cardinal Parolin. Together, we can end it. #enditmovement https://t.co/o11jOkiMvJ"]["Joined my SFRC colleagues in a letter to Secretary Tillerson seeking accountability for Assad’s war crimes in Syria: https://t.co/A1pzK6VZCm"]["It was great to have @louiegiglio with us at our hearing last week. Join us tomorrow as we shine a light on slavery. #enditmovement https://t.co/JNThPCi5pK"]["Thank you, @GlblCtzn! https://t.co/xSkp6aLgLv"][".@UTKnoxville: Join fellow Vols tomorrow on Pedestrian Walkway to take a stand against modern slavery. Look for the ❌s. #enditmovement"][".@UTKnoxville students are preparing to raise their voices on shine a light on slavery day. I hope you'll join them tomorrow! #enditmovement https://t.co/XnnLw8TiVi"]["Honored to meet Lt. Col. Phil Messer, a @tennesseetech grad from Ashland City. He's chief of the Office of Defense Cooperation in Beirut. https://t.co/pTlfZrIDhB"]["Earlier in Beirut, we visited this memorial to pay our respects to the brave Americans who have lost their lives while serving in Lebanon. https://t.co/HU2GnqK9Dy"]["Met this morning with the commander of the Lebanese Armed Forces to discuss our joint efforts to combat terrorism in the region. https://t.co/HKhcHpufaK"]["Discussed our partnership in the fight against ISIS and the future of Lebanon earlier today with Lebanese Prime Minister @saadhariri. https://t.co/k3fAVX53k1"]["Full statement on my visit to @CCCLebanon, which has treated more than 1,330 children over the past 15 years: https://t.co/myoqqjXNxk."]["Inspired to see the work @CCCLebanon is doing to treat children with cancer, work that would not be possible without Memphis-based @StJude. https://t.co/6dONh7dAII"]["Gatlinburg is open for business and the best way you can help the community is by visiting! #TheMountainsAreCalling https://t.co/SJCMv2yNuF"]["Great news out of West Tennessee. Thank you for your continued commitment to our state, @Sedgwick. #Jobs4TN https://t.co/34GGrSJQVR"]["It was an honor to meet these Tennessee soldiers in Iraq today. They are doing important work, and I am very thankful for their service. https://t.co/mhjrzKEeuo"]["Iraqi Kurds are doing an amazing job hosting these displaced children while Iraqi Security Forces fight to liberate their homes in Mosul. https://t.co/E7tuSJZfd4"]["In Erbil earlier today, I visited an internally displaced person (IDP) camp to meet with Iraqis who have fled their homes to escape ISIS. https://t.co/4bxh6RO4eS"]["Meeting with Iraqi PM @HaiderAlAbadi while the fight against ISIS continues. Our strong partnership will last far beyond the defeat of ISIS. https://t.co/wpvqu4AZN6"]["Shine a light on slavery day is right around the corner. Join us this Thursday to raise awareness! #enditmovement #EndSlaveryAct ❌"]["I urge Turkey to release captive U.S. pastor Andrew Brunson. My letter with 78 members of Congress to @RT_Erdogan: https://t.co/gRRGvfqyC4"]["Great to talk with Bryan Jordan, CEO of @First_Horizon, yesterday. The Memphis-based company employs more than 4,000 in the Volunteer State. https://t.co/lV6Kjhr9so"]["Glad @RepMickMulvaney will be serving our country as director of the Office of Management and Budget. My statement: https://t.co/D4tP1stjz4"]["Enjoyed meeting with Tennessee State Treasurer Lillard earlier this week to discuss our state’s financial status and future. @TNTreasuryDept https://t.co/HZe00V9Li4"]["Had a great conversation with the Tennessee Hospital Association this morning about a number issues impacting hospitals across the state. https://t.co/TKUtP4i5Px"]["Venezuela should immediately release @liliantintori's husband, Leopoldo Lopez, and all political prisoners. https://t.co/oMCawjjBLw"]["Due to Senate votes, today’s #SFRC hearing on the nomination of David Friedman will begin at 10:05 a.m. ET. Watch: https://t.co/NSnmWjJfz5"]["I respect @AndyPuzder's decision and know he will continue to be an important voice on issues that impact American workers. My statement: https://t.co/tPEqnvirQw"]["I appreciate the innovation @thorn brings to the #enditmovement and their support of the #EndSlaveryAct. Read more: https://t.co/RHwT9PXM7C"]["We are at a turning point in the #enditmovement. My opening remarks at today’s hearing with @thorn's Ashton Kutcher: https://t.co/cCHahDv8E6"]["Glad to have @jenni_brown, @louiegiglio and @shelleygiglio at our hearing today. They’re doing incredible work with the #enditmovement. https://t.co/NOKVZCTfJV"]["Thankful for Ashton Kutcher and the work @thorn is doing to rescue trafficking victims. It was great to have him on the Hill today. https://t.co/M5FR4m5HNa"]["27 million people are enslaved globally. Before today’s #SFRC hearing, I discussed the #EndSlaveryAct and #enditmovement on @Morning_Joe: https://t.co/9xbKOLcxDW"]["#SFRC hearing today at 10:00 a.m. ET featuring @thorn co-founder Ashton Kutcher. #enditmovement #EndSlaveryAct https://t.co/yRFWgX0E5R"][".@SenAlexander and I enjoyed welcoming 30+ Tennesseans to Capitol Hill yesterday at our weekly constituent breakfast. https://t.co/8kaX6DI6Jz"]["Our nation's current fiscal trajectory is totally unsustainable. I discussed it with Federal Reserve Chair Janet Yellen earlier today: https://t.co/uvj1MS1bqD"]["Today on @TheLeadCNN, I discussed tomorrow’s #SFRC hearing with @thorn co-founder Ashton Kutcher re: ending modern slavery. #enditmovement https://t.co/xNHQy4jhhB"]["Federal Reserve Chair Janet Yellen will testify at this morning’s banking committee hearing. Live at 10:00 a.m. ET: https://t.co/1qwugr5HHH."]["Army MSG Edmonds saved the lives of approximately 200 Jewish-American soldiers during WWII. Proud to honor his life: https://t.co/ebfRSG1U0L"]["As we approach #ENDIT week, the U.S. is preparing to embark on an unprecedented global effort to end this scourge on humanity. ❌"]["We are at a turning point in the global fight to end modern slavery thanks to the incredible efforts of so many people throughout the world."]["There is tremendous opportunity to expand our relationship with #Japan. My statement on @realDonaldTrump meeting with @AbeShinzo: https://t.co/RQZJgG34zb"]["Honored to meet with @CNORichardson, our nation’s highest ranking naval officer, yesterday to discuss a number of important global issues. https://t.co/cbTYd7gjok"][".@RepTomPrice will serve our country well as @HHSgov secretary and play a very important role in replacing the ACA. My statement: https://t.co/MQ9Fj8MLGd"]["The hospitalization of Vladimir Kara-Murza is a stark reminder of the risks borne by Russians when they speak out against autocratic rule."]["We must restore a credible U.S. deterrent so #Russia no longer exploits what it perceives as American weakness."]["My opening statement at today’s hearing on broad challenges facing U.S. policy toward #Russia: https://t.co/5sVcivy3FK"]["Great to have General Breedlove on Capitol Hill today. He’ll testify before the #SFRC at 10:00 a.m. ET. Watch here: https://t.co/QJHsgkJHTo. https://t.co/ZDbtmsQ5ib"]["TUNE IN: #SFRC hearing today at 10:00 a.m. ET on the broad challenges ahead for U.S. policy toward Russia. https://t.co/Icch2qnkEL"]["Earlier today we met with Meri Armour, CEO of @LeBonheurChild, and Don Mueller, CEO of @ChildrensatEHS. Thankful for their work in TN. https://t.co/4HpkB5H1jx"]["Proud to support @SenatorSessions and look forward to the work he will do on behalf of our country as AG. https://t.co/Y0CXz1WNsr"]["I enjoyed meeting with Canadian Foreign Minister @cafreeland this afternoon. Canada is not only our neighbor but a close friend and ally. https://t.co/Tb6LYeocNm"]["It was great to meet with the TN Association of Utility Districts today to discuss the important services they provide across our state. https://t.co/v3q972v7cG"][".@EastmanChemCo, based in Kingsport, employs 15,000 people worldwide. Enjoyed discussing its impact on Tennessee with CEO Mark Costa today."]["It’s always great to chat with Tennesseans who are visiting D.C. at our weekly constituent breakfast. Learn more: https://t.co/1kWDbitqnh. https://t.co/LXoXNC6arK"]["TUNE IN: #SFRC hearing today at 10:00 a.m. ET on the plan to defeat ISIS. Livestream: https://t.co/DA8FEf3swp."]["Our panel is up next at the @McCainInstitute Symposium. Tune in: https://t.co/DVfwnEcrwd"]["Thankful for Ms. Fedrick and the work of @AirlineAmbIntl to train flight attendants to fight modern slavery. #enditmovement ❌ https://t.co/yJ4Qq49D5P"]["Excited to join @McCainInstitute at 2:45 pm ET to discuss the fight to end modern slavery. Watch: https://t.co/6uYne09GKz. #EndSlaveryAct ❌"][".@realDonaldTrump put Iran on notice, bringing a new day in U.S.-Iran relations. Now it’s time to bring @HelpBobLevinson home. #WhatAboutBob"]["There is bipartisan support to provide relief to smaller institutions across our country who have been hurt by overregulation. https://t.co/VWLD5p8pxK"]["Dodd-Frank relief will be great for middle America. https://t.co/Ut4C45ZxfR"]["We finally are pushing back on #Iran in the way that we should. https://t.co/k0b8I7SbIM"]["I am confident @BetsyDeVos will serve our parents, our teachers, and most importantly, our students well. More: https://t.co/gfLqAsSXId."]["This further solidifies Tennessee as the best place in America to manufacture automobiles. My full statement: https://t.co/nLxCA5QeHL. https://t.co/Gf78CsqnFC"]["Today's sanctions make clear that it is a new day in U.S.-Iran relations and that we will no longer tolerate Iran’s destabilizing behavior. https://t.co/9AF23aKXZE"]["My letter with @SenatorCardin and 20 of our colleagues supporting efforts by @POTUS to hold #Iran accountable: https://t.co/R2SdZOzOni."]["Just got off the phone with Ambassador @JoeHockey. We discussed the important and long-lasting alliance between our two countries."]["I very much value our country’s longstanding friendship with Israel and enjoyed meeting with @YuliEdelstein and @AmbDermer yesterday. https://t.co/hCzVi0xTkC"]["I could not be more impressed with Judge Gorsuch and enthusiastically support his nomination. My full statement: https://t.co/tCqkrf6Oo9. https://t.co/lJKWdswoEi"]["Our committee enjoyed hosting Their Majesties King Abdullah II and Queen Rania Al Abdullah of Jordan earlier today at the Capitol. #SFRC https://t.co/OLjlMOQW4f"]["Great to have @mercyme in the office this morning to discuss their support for @compassion’s humanitarian work in India. https://t.co/ynHrVK3aBl"][".@Polaris_Project data shows how important the human trafficking hotline is in our fight to end slavery. https://t.co/8yulS72d7D #ENDIT ❌"]["I look forward to forging a strong relationship with Secretary Tillerson and the @StateDept as we work together to protect our nation."]["Rex Tillerson has the ability to be the effective leader the @StateDept needs. My statement on his confirmation: https://t.co/BGhpTcKov8"]["Just returned to the Capitol following a great meeting at the @WhiteHouse with National Security Advisor General Mike Flynn. My statement: https://t.co/LSwCio5YxV"]["Judge Gorsuch is a well-respected jurist who understands the importance of upholding the Constitution. My statement on his nomination: https://t.co/IEWf7Gjp83"]["Secretary Elaine Chao brings the experience needed to lead the @USDOT. My full statement on her confirmation: https://t.co/MiSJl9KTZj"]["Excited to welcome some bright, new faces to our office through our internship program this semester. https://t.co/OqwdPDqIfW"][".@SenAlexander and I enjoyed welcoming folks from the Volunteer State to Tennessee Tuesday this morning. Learn more: https://t.co/1kWDbitqnh https://t.co/mR0DjsJNDD"]["TUNE IN: #SFRC hearing today at 10:30 a.m. on the nuclear and ballistic missile threat from North Korea. Livestream: https://t.co/IiMcOcQgSX"]["No longer will #Iran be given a pass for its hostile activities. My release on the latest ballistic missile test: https://t.co/5Kt8kbJ35y"]["I applaud @realDonaldTrump for following through on his promise to rein in federal bureaucrats. My latest statement: https://t.co/bUbwUBc4aO"]["Great work by TBI, @EndSlaveryTN, @RestoreCorps and law enforcement partners. Together, we can end this horrific crime. #enditmovement https://t.co/hO1oeFQois"]["I very much appreciate British Prime Minister @theresa_may’s commitment to the fight against modern slavery. #EndSlaveryAct #enditmovement https://t.co/STQ5cHj9iH"]["Had a great meeting this morning with @CCCUtweets and @TICUA, including the presidents of @KingUnivBristol, @Lipscomb and @MilliganCollege. https://t.co/aZa0viAB8C"]["Great to be at the @StateDept with so many friends this morning to discuss the important next steps now that the #EndSlaveryAct is law. https://t.co/BKb3Hwl4NL"]["Congratulations to @nikkihaley on being confirmed as U.S. ambassador to the @UN. I was proud to support her nomination. My full statement: https://t.co/ddy6rQw9rb"]["Thanks to @realDonaldTrump for ending years of illogical and political delays of #KeystoneXL. My full statement: https://t.co/fQ42nagYFe."]["The #SFRC just approved @nikkihaley to serve as U.S. ambassador to the @UN. My statement in strong support of her nomination: https://t.co/lU5s5vORhF"]["Proud to vote today to favorably report the nomination of @RealBenCarson to be Secretary of @HUDgov to the full Senate."]["Looking forward to Director Mike Pompeo's leadership at the CIA. My full statement on his confirmation: https://t.co/jNF6LIH4dk"]["Rex Tillerson is well-qualified to be Secretary of State, and I am pleased the #SFRC favorably reported his nomination today. https://t.co/24ENVv2f3S"]["TUNE IN: At 4:30 p.m. ET, the #SFRC will consider the nomination of Rex Tillerson to be Secretary of State. https://t.co/HxCszZ01dF"]["We had a great time hosting more than 1,500 Tennesseans at our office following the inauguration on Friday. Photos: https://t.co/nmteqFH06M https://t.co/D8noZs0aec"]["Gen. Kelly will bring a strategic focus and extraordinary leadership skills to the Department of Homeland Security. https://t.co/JizereyvKq"]["Gen. Mattis is the right person at the right time to lead the @DeptofDefense. My full statement on his confirmation: https://t.co/m6uDBoxdRh"]["It was an honor to attend the #Inauguration today. Congratulations to @realDonaldTrump and @mike_pence. Look forward to the work ahead. https://t.co/hFFmVWG6ZN"]["Had a great meeting earlier today with @realDonaldTrump’s incoming national security adviser @GenFlynn. https://t.co/0E07e9Bpuu"][".@nikkihaley is a fierce advocate for U.S. interests and knows the @UN needs tremendous reform and change. https://t.co/luGqaINCIz"]["The gap between what the @UN was meant to be and what it has become has never been wider. https://t.co/sl23NcgD4T"]["TUNE IN: #SFRC hearing at 10:10 a.m. ET to consider the nomination of @nikkihaley to be U.S. ambassador to the @UN. https://t.co/up5iEI8BkK"]["Enjoyed my time on Glass Street in #CHA earlier today. Inspired by the many Tennesseans who are giving back today to honor Dr. King. #MLKDay https://t.co/byKQpfiJBh"]["Today we remember #MLK, who spent his life fighting for freedom for all. May his legacy inspire us not just today, but every day. #MLKDay"]["I look forward to working with @RealBenCarson as he ascends to the important position of Secretary of Housing and Urban Development. https://t.co/oTYQtmYhm1"]["I am pleased Congress has initiated the process to repeal and replace the Affordable Care Act. My full statement: https://t.co/ftrKojr9MC."]["I look forward to supporting Rex Tillerson's nomination to be Secretary of State. My full statement: https://t.co/k2cDsksfV6"]["My sense is Rex Tillerson is going to rise to the occasion and demonstrate he is an inspired choice for Secretary of State. https://t.co/lO3MuuI3OI"]["I believe the world’s at its best when America leads. https://t.co/8bfIujaeeB"]["TUNE IN: #SFRC hearing today at 9:00 a.m. ET to consider the nomination of Rex Tillerson to be Secretary of State. https://t.co/G5u00edBal"]["Was glad to welcome David Friedman, President-elect Trump’s nominee for Ambassador to Israel, to the office yesterday. https://t.co/s694n7lmbf"]["In December, we passed the #EndSlaveryAct. Tomorrow, we continue to shine a light on this horrible practice. ❌ #HumanTraffickingAwarenessDay"]["Enjoyed talking with Tennesseans at our weekly “Tennessee Tuesday” breakfast this morning. Learn more here: https://t.co/1kWDbitqnh. https://t.co/MZMIyA5npd"]["Had a very good meeting today with British Foreign Secretary @BorisJohnson. https://t.co/Azcx6snfea"]["Fred Thompson served with great distinction. Proud to join effort to name new Nashville courthouse in his honor. https://t.co/JDDDBGMZN3"]["And apparently the U.S. position is now to simply accept North Korea as nuclear armed and able to deliver? #MTP"]["Sad to watch Secretary of Defense Ash Carter on @MeetThePress this morning. #MTP"]["Instead of “sending a message” with a toothless resolution, we should inflict real pain on U.N. for anti-Israel bias."]["Fake news from @weeklystandard. Committee has not even met publicly yet and no one has attempted to pass resolution on Senate floor."]["I look forward to working on the issues that matter most to Tennesseans. My committee assignments in new Congress: https://t.co/0qne2NsLUx"]["Enjoyed a wide-ranging discussion with Rex Tillerson this afternoon and am looking forward to chairing his confirmation hearing next week. https://t.co/MU0rXAY5SY"]["Congratulations to the @UTKnoxville Pride of the Southland Band for being selected to participate in the upcoming inaugural parade."]["Elizabeth and I wish you and your family a very Merry Christmas, and I look forward to serving you in 2017. https://t.co/Qmz2vLO5ym"]["BREAKING: The #EndSlaveryAct is now law. Thank you for your support. Now the real work begins. Together, we can end it. #enditmovement ❌"]["The U.S. should absolutely veto the @UN Security Council resolution re: Israel. Anti-Israel bias only undermines peace efforts."]["Our committee will carry out exactly the same procedures for Mr. Tillerson’s nomination that have been carried out for more than 10 years."]["That has always been the plan, it is already in progress, and I am deeply disappointed my colleagues continue to imply otherwise."]["Mr. Tillerson will submit an extensive financial disclosure and will go through same ethics and FBI checks as previous nominees."]["By all accounts, Mr. Tillerson is currently ahead of schedule in providing information to the committee."]["As is long-standing precedent for nominees, #SFRC has not asked Mr. Tillerson to provide copies of his tax returns. https://t.co/4FsOTQtdRa"]["The #EndSlaveryAct awaits the president’s signature. Read about the broad support for this important initiative: https://t.co/WaH5cCYCoT"]["It was an honor to be at @UnionUniversity this weekend for the winter commencement ceremony. Congratulations, graduates! https://t.co/8IaSDVoTW8"]["President Obama not enforcing his own red line in #Syria is the lowest point I’ve seen in U.S. foreign policy. https://t.co/5U46dRy9WM"][".@realDonaldTrump has done a superb job forming his team. That’s why there’s so much excitement at present. https://t.co/5U46dRy9WM"]["As I told @hughhewitt this morning, @realDonaldTrump wants to see us move ahead quickly. He wants to see results. https://t.co/5U46dRy9WM"]["In 2014, I pledged to restore the @StateDept authorization process. @POTUS has now signed the first authorization bill into law since 2002. https://t.co/kUA7iMh2gI"]["Also appreciated a call I received from President George W. Bush, who spoke highly of Mr. Tillerson and offered support for his nomination."]["Had a very good conversation with Secretary of State nominee Rex Tillerson yesterday and am looking forward to meeting with him in January."]["Some in D.C. are trying to use rumor and innuendo to influence the decision re: Deputy Sec. of State. My statement: https://t.co/sZEOi4hf1T"]["The recently passed water infrastructure bill will better protect Nashville and Davidson County from future flooding. https://t.co/y3FjyFqOeD"]["More than 27 million people are in slavery today. The #EndSlaveryAct has an ambitious goal to address this problem. https://t.co/rNVDgyrFZz"]["Proud to hear that Nashville is #7 on @MilkenInstitute’s Top 25 Best-Performing Cities list for 2016. #BPCfor2016 https://t.co/V4N5uYL3iV"]["The #EndSlaveryAct is focusing the world's attention on helping end modern slavery around the globe. Learn more: https://t.co/dYX5gRQpR1"]["There's been decision memo, after decision memo, after decision memo on POTUS's desk re: the crisis in #Syria, and no action has been taken. https://t.co/J1j2mIR1mX"]["$150 million @wackerchemie investment will create 50 new jobs and is outstanding news for Bradley County. #Jobs4TN https://t.co/B1xSu8AQeS"]["UPDATE: The International #ReligiousFreedom Act is on its way to the president's desk to be signed into law. More: https://t.co/IkmOiz6Tc6 https://t.co/eacpBqpfJJ"]["It has been an honor to be considered for Sec. of State. I thoroughly enjoyed spending time with @realDonaldTrump throughout this process."]["I congratulate Mr. Tillerson on his nomination and look forward to meeting with him and chairing his confirmation hearing."]["Mr. Tillerson is a very impressive individual and has an extraordinary working knowledge of the world. https://t.co/rTu7waMIKz"]["My full statement regarding @realDonaldTrump’s intention to nominate Rex Tillerson for Secretary of State: https://t.co/rTu7waMIKz"]["Enjoyed touring @GlassHouseLIVE today and learning about their work to make Chattanooga an even more beautiful city. https://t.co/tOgaTT9YOR"]["If it is Rex Tillerson, he is a very impressive individual."]["Passage of the water infrastructure bill will ensure our waterways remain major economic drivers. My statement: https://t.co/Ytd7AzpFxm"]["Why I voted last night against the short-term spending bill known as a continuing resolution: https://t.co/Lj2ccJSY4G"]["I am hopeful we can build even further on this important progress to ensure @StateDept funding is used responsibly to advance U.S. interests"]["This bill will enhance embassy security, improve the functioning of the @StateDept, and demand accountability for #SEA in @UNPeacekeeping."]["I thank @SenatorCardin and appreciate the bipartisan contributions of my committee colleagues and our counterparts in @HouseForeign."]["Restoring Congress’ rightful role in the conduct of U.S. engagement overseas has been a top priority of mine as #SFRC chairman."]["Today, Congress ends a 14-year drought by finally sending a @StateDept authorization to the president. https://t.co/SKDDltt1nw"]["The #ArmsTradeTreaty will remain dead in the water. I will continue to work with my colleagues to protect the rights of Americans."]["Nothing has changed over the last four years to suggest the #ArmsTradeTreaty is in our national interest."]["Since 2012, many senators, including myself, have expressed opposition to the #ArmsTradeTreaty, citing an array of concerns with #2A rights."]["Today, I reiterated my strong opposition to the @UN #ArmsTradeTreaty after @POTUS submitted it to the Senate. https://t.co/xz6oUSvSqs"]["Enjoyed having Rob Lusk as a Senate Page. We’re thankful for your hard work and wish you luck in school next year. https://t.co/X5OYhek8Eg"]["I look forward to working with all involved as we begin to put this initiative into action. More: https://t.co/cU5t2szeRb. #EndSlaveryAct ❌"]["Today, legislation necessary to launch the End Modern Slavery Initiative heads to the president’s desk to be signed into law. #EndSlaveryAct"]["More than two years ago, we created a bold vision to put in place an effort to end the horrific practice of modern slavery. #EndSlaveryAct ❌ https://t.co/k2EQSOJCxO"]["Welcomed H.E. Masrour Barzani and a delegation from the Kurdistan Regional Government to Capitol Hill yesterday. https://t.co/A7TwBaSCVX"]["Pleased @CMSgov extended Medicare open enrollment for those affected by recent tornadoes and wildfires in Tennessee. https://t.co/Tc9MnSWZSi"]["Had a great meeting with @RealBenCarson this morning. Enjoyed welcoming him to Capitol Hill. https://t.co/W1gr6bP3gr"]["Passage of 21st Century #Cures is a testament to @SenAlexander's leadership and will help countless Tennesseans. https://t.co/LdOrvFEq9F"]["Pleased the International #ReligiousFreedom Act unanimously passed our committee today. Read my statement: https://t.co/oHLJ5ywDvy"]["I always enjoy welcoming Tennesseans to Capitol Hill with @SenAlexander. Learn more about Tennessee Tuesday here: https://t.co/1kWDbitqnh https://t.co/YTPuQ3y4kU"]["LIVE NOW: #SFRC hearing on “Defeating the Iranian Threat Network.” Watch here: https://t.co/ODLqQDh8Ur"]["We are thankful for the @TennesseeGuard and wish the 230th Signal Company well during their deployment in Kuwait. https://t.co/Ifa2dSDzes"]["TUNE IN: #SFRC business meeting today at 2:30 p.m. ET followed by hearing on Iranian threat network. Watch here: https://t.co/ODLqQDh8Ur"]["Many thanks to Mrs. Green’s 2nd grade class at Sevierville Primary School for the handmade ornaments to decorate our office Christmas tree. https://t.co/OiRgE7Prly"]["My heart goes out to the countless Tennesseans who have experienced tragedy in recent days. More photos at https://t.co/tSOeidu5Ki. (2/2) https://t.co/OQy5CMBm3o"]["Toured the damage from wildfires in Sevier Co. and tornadoes in Polk and McMinn counties with @SenAlexander and @billhaslam on Friday. (1/2) https://t.co/E3G3stzJZD"]["People will be back to visit very soon. Just as Sevier County @mayorwaters has requested at each press conference, please continue to pray. https://t.co/DsNYERgu8X"]["Recovery will take time. Gov. @BillHaslam, @SenAlexander, @DrPhilRoe, and I will support requests for assistance for the recovery efforts. https://t.co/aaQ1B432MN"]["Those who know Sevier Co. are not surprised by the community response. Selfless individuals – many who lost everything – are helping others. https://t.co/wOKW6C0fLd"]["It's not the attractions that make Sevier County special. It's the tough, proud people whose roots in the area span generations. https://t.co/ynL5Zy7TP8"]["Today, I was in Sevier County – where my wife was raised – to tour the damage caused by wildfires. Many have suffered tremendous loss. https://t.co/PRUJQkjipA"]["I express my deepest sympathies and offer steadfast support to the countless Tennesseans who have experienced tragedy in the past week. https://t.co/tuV2yF8SVx"]["My heart goes out to those who have had loss in Sevier County. My remarks today in #Gatlinburg: https://t.co/DwUPkYo7LB"]["With @SenAlexander, Gov. @BillHaslam, and local officials in Sevier County. The press conference is live now: https://t.co/2W7h6PrpZv"]["If you've been affected by the wildfires, you can learn about support services the state of Tenn. is offering here: https://t.co/YFzZbLYaA3"]["We must also recognize where radical ideology is taking root and determine ways to best combat it. More here: https://t.co/5kaEW8Hr5T. https://t.co/g0pNmI4HbE"]["The United States must have the tools necessary to counter the evolving nature of terrorist organizations. https://t.co/uRmZdeBkQT"]["My opening statement at today’s #SFRC hearing on the future of U.S. counterterrorism strategy: https://t.co/FiLVwGkNq1"]["We are committed to doing everything we can to help Sevier County rebuild. My earlier remarks on the Senate floor: https://t.co/zvWgnx5qpD"]["I will speak on the Senate floor around 4:40 p.m. ET about the recent tragedies in East Tennessee. Watch here: https://t.co/EvTxniR8XE"]["I look forward to continuing our work to hold #Iran accountable."]["This bill will ensure @realDonaldTrump has the tools necessary to push back against #Iran’s hostile actions."]["Extending the #IranSanctionsAct gives us the ability to reimpose sanctions @POTUS lifted to implement the #IranDeal. https://t.co/vSlBmjs4Rw"]["TUNE IN: #SFRC hearing today at 10:30 a.m. ET to discuss the future of U.S. counterterrorism strategy. Livestream: https://t.co/Ml1R3mninY"]["I'm proud to join @RedCross in thanking our active military and veterans who have sacrificed so much for our freedoms. #HolidaysForHeroes https://t.co/kJj71YlQhc"]["Terrible news out of East Tennessee this morning. Praying for those affected by this dangerous storm. https://t.co/3VvasMGvb7"]["I am heartbroken to see the damage caused by the ongoing fires in Sevier County. My full statement: https://t.co/VM6gUdlkVf."]["We continue to monitor the situation in Gatlinburg and surrounding communities. Prayers for the first responders and all those affected."]["My statement on the death of Fidel Castro: https://t.co/cSBXcQvkv6"]["The ruling blocking the administration's overtime rule is a huge victory for small businesses and Tennesseans. More: https://t.co/0eQNbDnQsI"]["Chattanoogans have a unique ability to give of themselves to help others. We'll do the same following this tragedy.\nhttps://t.co/goQI5NHzc8"]["Grateful for all in our community who have and will continue to assist these children."]["Touched to visit with so many families at @erlangerhealth affected by yesterday's tragic Woodmore school bus crash in Chattanooga. https://t.co/8ewitEjKU7"]["I have spoken with Mayor Coppinger and Superintendent Kelly to extend sympathies and support."]["Heartbreaking school bus crash in Chattanooga. My thoughts and prayers are with the children, families and first responders."]["Jeff Sessions is widely respected in the United States Senate and is a great choice for Attorney General. https://t.co/7aJnmuKp9Z"]["Enjoyed welcoming students from the Chattanooga School for the Arts and Sciences to Capitol Hill yesterday. https://t.co/KC2ykPMWuA"]["Last spoke with @gwenifill on @NewsHour at the convention in Cleveland. Incredibly warm and down-to-earth person. She will be sorely missed. https://t.co/NX2QNlVimM"][".@Reince will be an outstanding chief of staff. Great decision by President-elect @realDonaldTrump."]["Incredibly grateful for the brave men and women who served our country and dedicated their lives to defending our freedoms. #VeteransDay"]["My full statement ahead of Affordable Care Act open enrollment, which begins November 1: https://t.co/HumocrWpyZ"]["Congratulations to students and teachers across Tennessee on this outstanding progress. You make our state proud. https://t.co/wZUdozV5m4"]["Honored to join @jmeacham, professor John Geer and an impressive class of @VanderbiltU students today for a great discussion. https://t.co/qkp5g8qVmO"]["Efforts to #EndPolio have reduced cases by 99.9%, but we must continue the push for worldwide eradication. #WorldPolioDay"]["Glad to hear about E &amp; E Manufacturing's expansion. Tennessee is leading the way in advanced industry job growth.\n#Jobs4TN https://t.co/cNvdgbLpIw"]["Instead of targeting the press, #Pakistan should focus on ending its sanctuary for the #Haqqani network. https://t.co/kfubkFbcer"]["Tennessee is the premiere location in America to build cars. I thank @BillHaslam and his team for bringing more jobs to our state. #Jobs4TN https://t.co/SO1ukbBBXD"]["Family members of the Syrian opposition have been slaughtered as they wait for the Obama administration to deliver on previous commitments. https://t.co/ZhuBmL2UQh"][".@JohnKerry has no chance of diplomatic success until Obama shows he is willing to enforce consequences for violations of agreements. https://t.co/ULTX7SBxVU"]["Unfortunately, Assad, Russia, and Iran know the White House does not have a \"Plan B\" and hostilities continue to escalate. https://t.co/5CLOVkXePk"]["Unsurprisingly, there was no explanation of “Plan B” or how the administration plans to stop Russia and Assad from killing innocent Syrians. https://t.co/1cdQFmqO2q"]["Yesterday, at a #SRFC hearing, I asked @ABlinken to share the Obama administration's \"Plan B\" in #Syria. https://t.co/GZKJX0VYSF"]["Obama's failed presidency as it relates to foreign policy is a result of his unwillingness to roll up sleeves and address the tough issues. https://t.co/PXrUyjgQwr"]["The outburst from the White House over #JASTA is remarkable when they wouldn't even sit down for a meeting. https://t.co/N4WeOrnlb6"]["At 10:00 a.m. ET, @ABlinken will testify in #SFRC hearing on the regional impact of the #Syria crisis. Livestream: https://t.co/cOsn1uwMTE"]["Appreciate the efforts of those, including @RepDianeBlack, who helped make this a reality. Glad our staff was on hand at Dover AFB today."]["Nearly 168 years to the day, the remains of Tennessee volunteers who fought in the Battle of Monterrey are finally back on American soil. https://t.co/rKsHrbTq17"][".@PresidentPeres was a close friend of the US who will be remembered for his many years of loyal service to Israel. https://t.co/nOTWpqxxGW"]["I joined my colleagues today in signing a condolence book to honor the life of Shimon Peres, former prime minister and president of Israel. https://t.co/vAqht3nHgC"]["28 senators signed our letter to #JASTA sponsors expressing support for efforts to mitigate unintended consequences. https://t.co/grheQH39BQ"]["I am determined to work with my colleagues in overcoming any unintended consequences should they occur. https://t.co/XgdeZUrgvN #JASTA"]["I voted to override the president’s veto of #JASTA because the victims of 9/11 deserve a way of seeking justice. https://t.co/XgdeZUrgvN"]["Enjoyed meeting this morning with Major General Terry M. \"Max\" Haston, the Adjutant General of the @TNMilitaryDept. https://t.co/McTgqgC6gU"]["Had a great meeting yesterday to discuss our efforts to end modern slavery worldwide. #EndSlaveryAct #enditmovement https://t.co/WZi7IqzOan"]["The Affordable Care Act is failing Tennesseans. My statement on BlueCross BlueShield of Tennessee’s announcement: https://t.co/Q5ez1QXBev"]["Proud to see @UTKnoxville students teaming up with @IJM to combat human trafficking. #enditmovement #EndSlaveryAct \nhttps://t.co/zBxvBTZHaP"]["Big win by @Vol_Football. Congratulations to @UTCoachJones and my alma mater."]["WATCH: Proud to join @ChrisCoons in support of @GlblCtznImpact. Learn more about our #FoodAid reform efforts: https://t.co/vgbhOhJynF https://t.co/UHaYGXtOZO"]["Students across Tennessee have celebrated #ConstitutionWeek at events sponsored by our office. More photos: https://t.co/rUwg2pbEiP https://t.co/vAh8Sz0myw"]["#Russia has known all along that there was nothing to back up empty words from the United States. https://t.co/jND1WHYouU #SyriaCeasefire"]["Thankful for the work @Polaris_Project is doing to help end human trafficking worldwide. #EndSlaveryAct #enditmovement https://t.co/P6XEZgIjoI"]["We need better oversight of @HUDgov-subsidized facilities. Thanks @marcorubio @SenBillNelson for attention to issue. https://t.co/6UONLFzLPm"]["Proud to join my colleagues in an effort to name the new Nashville federal courthouse in honor of Fred Thompson.\nhttps://t.co/f6bS5MAjW0"]["I’ve got my #VolsGameFace on for the fight against Alzheimer’s. Proud to support @WeBackPat. #DISHCares https://t.co/Cn5bei8gkF"]["These initiatives enable us to serve even more people without increasing spending. #foodaidreform #GCFestival https://t.co/h1OiKwwBMR"]["Ahead of #GCFestival 2016, I joined @MSNBC to highlight progress on #foodaidreform: https://t.co/h1OiKwwBMR"]["TUNE IN: Senate Banking subcommittee hearing today at 10:00 a.m. ET on @HUDgov oversight. Livestream: https://t.co/H6mTPo5Ywd"]["Proud to nominate @katieinuganda for @CCAInstitute Angel in Adoption award for her tireless dedication to adoption. https://t.co/pJYGAFh1Iz https://t.co/FvPTGT3TXB"]["Thankful for the opportunity to welcome #HonorAir of Middle Tennessee veterans to D.C. this morning. https://t.co/kA9C7cHRH5"]["It would be malpractice for #WellsFargo not to claw back pay from executives who were involved. https://t.co/fZO1OmSbur"]["TUNE IN: #SFRC hearing today at 2:45 p.m. ET to discuss the crisis in South Sudan. Livestream: https://t.co/PQRP3bsCNM"]["TUNE IN at 10:00 a.m. ET: Sen. Corker questions #WellsFargo CEO Stumpf at a Senate Banking Committee hearing. Watch: https://t.co/WZltpA4sMo"]["The sad but true story of #Syria from @JacksonDiehl in today’s @washingtonpost: https://t.co/S1WIb3jZF3"]["To celebrate #ConstitutionDay, students across Tennessee are participating in events hosted by our office. https://t.co/T9iyAn0FI7"]["This ruling is a win for struggling Tennessee songwriters. My full statement: https://t.co/OgDKTVYceJ. https://t.co/hpHlWsQHXh"]["My opening statement at today’s #SFRC hearing on challenges to U.S. interests in #Afghanistan: https://t.co/cGyO0e4jbi"]["More than 27 million people are enslaved today. Together, we can end it. #EndSlaveryAct @FOXNashville https://t.co/uUu8bbW2zM"]["Enjoyed meeting with @strongnationUSA’s Tennessee chapter about how we can help young Americans be #citizenready. https://t.co/uPrw5UyWdC"]["Somewhat appalled by Suu Kyi's dismissive reaction to concerns I raised about human trafficking in Burma. More: https://t.co/DyyMtAfcMY"]["Enjoyed meeting with the Tennessee Hospital Association about the major issues facing the healthcare industry. https://t.co/jTjD2CaGQn"]["Honored to participate in @Marine_Week's 9/11 events in Nashville. See more photos here: https://t.co/dClddkeh88. https://t.co/w1jczTXPux"]["Congratulations to John Bartlett from @bhsdawgs in Knoxville on being named Tennessee Principal of the Year. https://t.co/54LLSGlGVo"]["Honored to speak at the Sept. 11 remembrance ceremony in Nashville today. Thank you for a great event, @Marine_Week. https://t.co/IBzpAz0jIG"]["Stopped by to thank some of our firefighters for their service before the @NashStairClimb. @NashvilleFD https://t.co/sZLVM1DhaE"]["My full statement as we remember September 11, 2001: https://t.co/8cLrMXj8hp. #NeverForget"]["The attacks changed our nation, but what I remember most is the way Americans responded. https://t.co/8cLrMXj8hp https://t.co/4Cubo5GTvJ"]["Details of the Syria ceasefire agreement should be made available to the United States Senate. My full statement: https://t.co/JBsRIAcM7P."]["Read my full statement on the North Korea nuclear test, the fifth conducted by the regime in the past decade: https://t.co/E1Menm5DWm."]["Words alone from the Obama administration, China, and the United Nations Security Council will not stop the North Korea nuclear threat."]["Innocent people, who wake up each day with the same hopes and aspirations we have, are being slaughtered in Syria. https://t.co/JyTnphKuFI"]["Glad Robert and Laura Cooper of Chattanooga stopped by our office today during their trip to Washington. https://t.co/NWnlMOKdJg"]["My opening remarks at today’s hearing criticizing #Pakistan for its harboring of the Haqqani network. https://t.co/oPUdTDczdk"]["Proud to support the @chattfoodbank on #HungerActionDay. Appreciate all they do for our community. https://t.co/iHdLX7Zqyt"]["TUNE IN: #SFRC hearing today at 10:00 a.m. ET on U.S. relations with Pakistan. Livestream: https://t.co/NnJ2x8rHyG"]["On @Snapchat? Add “senbobcorker” for a behind-the-scenes look at our work in Tennessee and on Capitol Hill. https://t.co/eCpUoH5eb0"]["TUNE IN: #SFRC hearing today at 10:00 a.m. ET on the administration’s plan for a @UN resolution on the #CTBT. Watch: https://t.co/Fntveqodsk"]["TUNE IN: Today at 8:30 a.m. ET, Senator Corker will be live on @MSNBC’s @Morning_Joe to discuss foreign policy news of the day."]["Suggestions that the Senate should have done “nothing” and kept the American people in the dark defy common sense. https://t.co/eD0xWwmqdP"]["My letter to the editor in today’s @WashTimes on how the #IranReviewAct gave the public a voice on the #IranDeal: https://t.co/eD0xWw4Pmh"]["My statement on reports that North Korea fired three medium-range missiles as the G-20 summit was underway in China: https://t.co/sO0LiAQDkw"]["Countries will continue to take advantage of a nation that behaves like a ship with no rudder. My latest statement: https://t.co/T9Qfq6ONu3"]["My statement after talks between the U.S. and Russia ended without an agreement on ending violence in Syria: https://t.co/xvU2A9XeYQ"]["It's our hope that the @USDOT will work with state officials to ensure Tennessee doesn't lose crucial highway funds: https://t.co/jo67M4Sq66"]["Happy 100th, @NatlParkService. We are fortunate to have 12 national parks in Tennessee, including the most visited: @GreatSmokyNPS. #NPS100"]["It was an honor to introduce my good friend Governor @BillHaslam today at the @CHAchamber Annual Meeting. https://t.co/SnIQfe2NNM"]["Thanks to the local Chamber of Commerce, @Rotary Club and @lionsclubs for hosting us today in Milan. Great turnout! https://t.co/BAn0soeond"]["Kicking off the final week of our 32-county tour this morning in Bolivar. Will be in Milan and Alamo later today. https://t.co/scBDjP8W2x"]["Enjoyed talking with @NashSheriff deputies yesterday at @RoyalRangeUSA in Nashville. https://t.co/JizgGEEsga"]["We had a great turnout and good questions at our event today in Cannon County. Thanks to everyone who joined us. https://t.co/VO2FhvPUQD"]["Enjoyed discussing the issues important to the people of DeKalb County yesterday at the courthouse. https://t.co/Y0tSQ5jG2A"]["Thank you to The Starling Cafe in Pikeville for hosting a great event this afternoon. https://t.co/1OG1vlmaFG"]["Enjoyed our first stop in Dunlap. Great turnout and good questions from the crowd. On the road to Pikeville now. https://t.co/pz5F4OKGLQ"]["Kicking off week three of our 32-county tour across Tennessee. Looking forward to being in Sequatchie, Bledsoe and Morgan counties today."]["Very good @WSJ op-ed by former Senator Jon Kyl and Douglas Feith on President Obama's #CTBT plan at the @UN: https://t.co/dhpBtb0s1z"]["Read my letter strongly opposing President Obama's plan to promote ratification of the #CTBT at the @UN: https://t.co/j24vnVNHE2"]["Excited about the three-mile extension of the Riverwalk in Chattanooga, which officially opened on Friday. https://t.co/2OIRuX9psu"]["70 years later, Mr. Freytag finally received his WWII medals and decorations. We are grateful for his service. https://t.co/TPFnPFucaf"]["Thank you, @TNFarmBureau, for inviting me to speak with some of Tennessee’s most important job creators. \n https://t.co/X0CXHubqhJ"]["Enjoyed being at @TNFarmBureau's #TNFBPres16 yesterday. Proud to support our farmers and rural communities. https://t.co/jBCEstsLk3"]["Congratulations and good luck next week! https://t.co/6Hi3P4SD91"]["Enjoyed talking about the economy, U.S. global leadership, and other issues in Jamestown yesterday. https://t.co/1kR00qTFB5"]["It was great to be back in Clay County. Thank you to the Chamber of Commerce for putting together a great event. https://t.co/5tO7tKT0Se"]["Enjoyed our discussion at Gainesboro City Hall this morning in Jackson County. https://t.co/phG6jtwleF"]["Thanks to those supporting our efforts to #FixFoodAid! I will continue advocating for flexibility to get more food faster to those in need."]["Sad to learn of the tragic death of special agent De’Greaun Frazier. My thoughts are with his loved ones and @TBInvestigation family."]["Enjoyed running into Rick Tillis, my good friend @SenThomTillis's brother, at our event today in Fayetteville. https://t.co/8ah6ouLtnB"]["Stress test shows GSEs could require $125 billion taxpayer-funded bailout. News highlights the need for #GSEreform. https://t.co/6EjfiuEnCS"]["Had a great crowd at stop two today. Thank you to the Lynchburg/Moore County Chamber of Commerce for hosting. https://t.co/KLHTVQ4KgI"]["Looking forward to week two of our 32-county tour across the state. It's great to be in Bedford County this morning. https://t.co/MqeYEgOOsh"]["I was proud to be on hand today to mark the official opening of @Polartec in Bradley County. #Jobs4TN https://t.co/68phnzuPF2"]["Best of luck to all of the athletes with Tennessee ties competing in #Rio2016. #Olympics #TeamUSA #OpeningCeremony https://t.co/IJJK5eo9DA"]["Had a great discussion with folks in Tazewell this afternoon. Thank you for having us, @ClaiborneCounty. https://t.co/g6kzftCaWv"]["Enjoyed learning about the great work being done at Kiefer Manufacturing in Sneedville this morning. https://t.co/B4QG92UN0O"]["Thank you to the Johnson County Chamber of Commerce for hosting us this afternoon. We had a great meeting. https://t.co/5XNojZ1jeV"]["Back on the road for day two of our 31-county tour. Having a great time with folks in Elizabethton this afternoon. https://t.co/becwS2fEHF"]["Thankful for our men and women in blue who work hard every day to protect our local communities. https://t.co/H9LYI3SqCw"]["We've had a great start to our 31-county tour. Wrapping up day one with Unicoi County and Erwin community leaders. https://t.co/uJVmKaYQnd"]["Enjoyed joining the Rotary Club of Rogersville today and proud to show support for JT. @Thefightfor5Com #fightfor5 https://t.co/PVYRFd7bs9"]["Learning about what's on the minds of Tennesseans from a packed house in Newport. Thanks for having us, @ccpchamber. https://t.co/BGTceGZfc8"][".@Tennessean op-ed highlights significance of our #GlobalFoodSecurityAct, which makes progress in #FoodAid reform https://t.co/pbD6XSFytP"]["Stop one: Breakfast with my friends at the Rotary Club of Morristown AM in Hamblen County. https://t.co/sHX84bHilG"]["Excited to kick off a four-week, 31-county tour across Tennessee. I'll be in Hamblen, Cocke, Hawkins and Unicoi counties today."]["Thanks to @theresa_may for her leadership. It's time for the U.S. and UK to join forces to #EndSlavery now. https://t.co/0XXLzTjlm6"]["My statement re: allegations that UN peacekeepers failed to protect the most vulnerable: https://t.co/hqNsfPKygS https://t.co/dZF6uWuhkp"]["Troubled by the news out of #Munich. We continue to monitor the situation and are thinking of those involved. Follow @TravelGov for updates."]["Thanks to everyone who supported passage of Global Food Security Act. Important progress in fixing #FoodAid inefficiencies is now law. #GFSA"]["Had a very good meeting with @Nigel_Farage. We must support our critical ally as they move through #Brexit process. https://t.co/cN6RPYnFel"]["The details in documents revealed by the @AP were among the many reasons I opposed the #IranDeal. My statement: https://t.co/ncYVrPb4lH"]["Watch my video honoring Chattanooga’s #FallenFive and reflecting on the remarkable community response: https://t.co/sI1IYlAmA1"]["We are heartbroken by the senseless terror attack in Nice that took the lives of so many people. #PrayForNice https://t.co/YuSTbKMkIW"]["I enjoyed meeting yesterday with representatives from Chattanooga’s Steward Advanced Materials. https://t.co/ezSqZfyEC4"]["Today I reiterated my opposition to the #IranDeal and introduced sanctions legislation to counter the Iranian threat https://t.co/gGQ609eHeG"]["TUNE IN: #SFRC will assess the #IranDeal one year later in today’s hearing at approx. 10:15 a.m. ET. Livestream: https://t.co/SDpGiNI0Ci"]["The prescription opioid and heroin epidemic is destroying lives and tearing apart families, and I am pleased Congress has acted."]["Tonight, we sent legislation to the President's desk that responsibly helps combat the increasingly devastating drug crisis across the U.S."]["Zaevion Dobson was the definition of courageous. Glad he is being honored with the @ESPYS #ArthurAshe award tonight. https://t.co/IKhl0qWEf6"]["It is past time for Washington to get our fiscal house in order. My statement on @USCBO's long-term budget outlook: https://t.co/9wHJBYL5vy"]["Watch my opening statement at today’s #SFRC hearing to review the 2016 #TIPReport. #EndSlaveryAct #enditmovement https://t.co/HbMgYcvxvr"]["TUNE IN: At 10:00 a.m. ET today, Susan Coppedge will testify at #SFRC hearing to review 2016 #TIPReport. Livestream: https://t.co/SOmuqiERi3"]["Today's ruling rejects China's aggressive attempts to control disputed areas of the #SouthChinaSea. My statement: https://t.co/n77vJqo2PH"]["TUNE IN: Senator Corker will discuss news of the day on @987news with @Hallerin around 5:30 p.m. ET today. Listen: https://t.co/ftNcGcZuxi"]["It’s a breakdown in society when an individual takes the lives of the law enforcement officers who protect us.\nhttps://t.co/bhLCdFtyRi"]["Today on @meetthepress, I expressed support for law enforcement and called for unity. My full interview: https://t.co/O1AgQXWItg"]["TUNE IN: I'll join @chucktodd and Senator @CoryBooker this morning on @meetthepress. Check your local listings. #MTP"]["We mourn the innocent lives lost, pray for the injured, and thank the brave law enforcement officers who risk their lives to keep us safe."]["Our country has been shaken by senseless violence this week, and I am horrified by the tragedy that unfolded overnight in Dallas."]["My opening statement at today’s #SFRC hearing on how to make U.S. economic assistance more effective: https://t.co/pIo3cii9O0"]["TUNE IN: #SFRC hearing today at 2:15 p.m. ET to assess the effectiveness of U.S. international economic assistance. https://t.co/Sh8qVfs4c1"]["My full statement on President Obama’s announcement today about U.S. forces in #Afghanistan. https://t.co/jYHj2Pi92B"]["Happy 4th! My full statement as we celebrate this Independence Day: https://t.co/hkF7khCDUW"]["My thoughts are with the people of Bangladesh. Praying for the families of those lost in this horrific terror attack."]["I am profoundly saddened by the deaths of @IJM associates in Kenya. My statement calling for #JusticeinKenya: https://t.co/ORFIupiWbV"]["My statement on the 2016 #TIPReport and the need for a U.S.-led, global effort to end modern slavery. #enditmovement https://t.co/QB5PqBC6MB"]["I was proud to honor #TIPHeroes today in the fight to end human trafficking. #EndSlaveryAct #enditmovement https://t.co/C0czso8iaf"]["Corruption undermines our most important national interests around the world. More in my remarks at today's hearing: https://t.co/1aU44aXKoZ"]["Yesterday, members of the #SFRC met with @KimDarroch, British Ambassador to the U.S., to discuss #Brexit. https://t.co/pio4a8Ql5y"]["Pat Summitt said if there is a pity party, she's not coming. So today, I celebrated her life on the Senate floor.\nhttps://t.co/4RmRBcdPYT"]["Watch my remarks celebrating the life of Pat Summitt on the Senate floor today: https://t.co/EMxIV3cIZf"]["I enjoyed meeting with the @churchatgp from Cleveland to hear about their past week of community service in D.C. https://t.co/JoeMwOWSq1"]["TUNE IN: Senator Corker to honor Pat Summitt on the Senate floor today at approximately 4:30 p.m. ET. Livestream: https://t.co/16JnEJDTo1"]["Proud to introduce a Senate resolution with @SenAlexander to honor the life of @LadyVol_Hoops coach Pat Summitt. https://t.co/D5M6b9HbTO"]["We continue to monitor reports of the horrific terror attack in Turkey. Our thoughts and prayers are with the victims and all affected."]["I have tremendous respect for @TGowdySC, and I applaud his efforts to put forth an accurate report on #Benghazi.\nhttps://t.co/s8rxL8cJE3"]["It appears the Obama administration’s position on Assad is changing. Today I asked @brett_mcgurk to explain.\nhttps://t.co/Q1Kl6QDbVG"]["The Obama administration's optimistic rhetoric on the fight against #ISIS often does not match the results.\nhttps://t.co/i7L9hxvA5l"]["I fear the administration's response to #ISIS does not adequately reflect the threat. My remarks at today's hearing: https://t.co/D2ObPSObj6"]