["https://t.co/nPF66gTaM0"]["The opioid epidemic must be met with stronger federal investments to local communities. Congress needs to take bipartisan action now to support prevention and addiction recovery efforts. \nhttps://t.co/tgrHJCZfmN"]["We need to get the job done on #BuyAmericanHireAmerican and it must be at the foundation of any infrastructure plan. https://t.co/Xw02bjCNWH"]["@MyTwoElaines Thanks Marty for all your hard work and leadership giving #familycaregivers a voice. #AlzCaregiving"]["I remember how daunting it was to be the primary caregiver for my grandmother. I’m so proud of our bipartisan reform to support family caregivers and help them get the tools they need to better support and care for loved ones. \n https://t.co/UOThPhbgl9"]["There are thousands of Wisconsin workers depending on the pensions they have earned. We must pass the Butch Lewis Act now, and protect the retirement security of hard working Americans. https://t.co/viC2sT5mYz"]["As we say, you betcha! #HaywardWisconsin #BirkieFever https://t.co/r1gCVLDlM8"]["Every day, family caregivers do right by their loved ones, and I am proud to say we are doing right by them by passing the RAISE #FamilyCaregiversAct to formally recognize and support family caregivers across this country. https://t.co/Fxblpv6QF3"]["@aarpwi Thank YOU for your partnership and continued advocacy to do right by caregivers!"]["Dreamers have only known America as their home, but are now facing the fear and uncertainty around whether they can stay. That’s simply not right. We must take bipartisan legislative action to protect #Dreamers. https://t.co/MKJqRuByVi"]["Yesterday marked 100 days since CHIP funding expired. Health care for millions of children hangs in the balance. It is well past time for Congress to work together to #ExtendCHIP\nhttps://t.co/BWWdEnBr65"]["Honoring Har Gobind Khorana today, the late @UWMadison researcher whose work in biomedical research won him the @NobelPrize in Physiology or Medicine in 1968, on what would’ve been his 96th birthday. https://t.co/UCnfFkXaGh"]["The @FCC decision to repeal #NetNeutrality rules could lead to higher prices for consumers, slower internet traffic and even blocked websites. There is growing momentum for ensuring a free and open internet. I support @SenMarkey’s resolution to restore #NetNeutrality."]["Family caregivers need our help and support, so they can support their loved ones. Proud to work with @SenatorCollins to pass the RAISE #FamilyCaregiversAct and get the job done for caregivers. https://t.co/jiQ96Vv9ho"]["@HHSGov The American people must be able to trust that the HHS Secretary works for the people, not powerful Washington interests like #BigPharma. Should he come before the full Senate I will oppose Mr. Azar’s nomination for HHS Secretary. #SayNoToAzar"]["President Trump’s pick for @HHSGov Secretary is not a drain the swamp pick. Mr. Azar went through the revolving door from drug companies to the federal govt. Big Pharma already has too much power in Washington. We need more transparency &amp; accountability to bring down drug prices. https://t.co/2IqTHN4Hzi"]["I’ve joined a bipartisan group in pushing for a #GreatLakes Restoration Initiative in Canada. https://t.co/0S1v8coWf5"]["We need to protect retirement security for thousands of Wisconsinites. We must pass the Butch Lewis Act now, because pension promises must be kept. https://t.co/rbczzhHEqa"]["Big Pharma is sticking it to Americans with skyrocketing prescription drug prices. We need more transparency and accountability for drug corporations who are jacking up costs for families in need of affordable lifesaving treatments. https://t.co/hGp9TcySsq"]["Community Health Centers are a critical part of our health care system, serving millions of patients across the country and 300,000 people in Wisconsin. Congress must take action to fund Community Health Centers. #ValueCHCs https://t.co/O24NUGOPuv"]["9 million children in this country and 170,000 kids in Wisconsin are counting on us to #ExtendCHIP https://t.co/UY8UPeAjXQ"]["Looks like another frigid weekend in Wisconsin. I know Wisconsinites can handle the cold weather better than most, but please drive carefully and bundle up!"]["It’s time for Congress to stop kicking the can down the road and start working together to get the job done for working families across this country. https://t.co/Ds8GndezcU"]["In Milwaukee today to meet with the Wisconsin Committee to Protect Pensions! Thank you for all the work you are doing. Your voice is invaluable in Wisconsin and in Washington in our fight to ensure pension promises are kept. https://t.co/otv8uIMsJN"]["Thousands of Wisconsinites are facing a massive cut to their pensions, through no fault of their own. We must make sure workers and retirees get the pensions they have worked for, planned for and depend on."]["Last year, in Milwaukee County alone, there were 174 opioid overdose deaths involving fentanyl. We can’t wait. Congress passed legislation to help stop fentanyl from coming to the U.S. &amp; the President must sign it immediately. https://t.co/DeHfU4Iy5E"]["Tens of thousands of Wisconsinites could lose access to health care if Congress does not act to fund community health centers. It is past time to work together and #ValueCHCs"]["Stopped by Green Bay’s N.E.W. Community Clinic today! It is a shining example of how important community health centers are to our communities. I will not stop fighting for the critical funding that community health centers need to serve their community. https://t.co/hoxDPOE3aL"]["More than 300,000 Wisconsinites depend on community health centers for their health care. That many people would fill Lambeau Field nearly 4 times. Congress must act to fund community health centers. #ValueCHCs https://t.co/qPAFH3JmzU"]["#Dreamers cannot wait. We must pass the #DreamActNow https://t.co/GEsdsAyIOh"]["As temperatures drop dangerously low throughout WI, I want to thank local officials for taking action and getting the word out on how to keep people safe. It’s crucial all residents become familiar with cold weather safety tips. For more information visit https://t.co/oVkyHjEgrQ."]["RELEASE: U.S. Senator Tammy Baldwin Leads Bipartisan Letter Urging Trump Administration To Prioritize Resources For Upper Mississippi River System Infrastructure Improvements https://t.co/dm1UkSxbCJ"]["We can’t afford to wait. Congress must work together to help communities fight back against the opioid epidemic. https://t.co/eSkpGl158T"]["Over a million workers across the country and tens of thousands in Wisconsin are facing massive cuts to their pensions. We have a responsibility to protect the retirement they earned. We must pass the Butch Lewis Act."]["The wealthiest 1% got their Christmas gift, but workers and retirees are still waiting to get the full pensions they have earned."]["Welcome to the United States Senate, Senator Doug Jones and @SenTinaSmith! Looking forward to working with both of you! https://t.co/OZsIvTac4p"]["We can’t afford to wait. Washington must step up and take bipartisan action to fight the #opioid epidemic.\nhttps://t.co/PJcrIX4p4V"]["As of today, 14,586 DACA recipients have lost their status. #DreamActNow https://t.co/WAZoKgrGlT"]["Funding CHIP and community health centers are not partisan issues. Why won’t the GOP agree to long term funding? #ExtendCHIP #ValueCHCs"]["#CHIP expired last year. We cannot keep waiting to help families secure health care for their children. We must #FundCHIPNow. https://t.co/Id6zII1FYY"]["Washington needs to step up in the fight against the opioid epidemic. We should be doing everything we can to save families and save lives with bipartisan action. \nhttps://t.co/nWx711Ux8s"]["What an inspiring partnership from @NASA and Middleton, Wisconsin’s @American_Girl. Luciana Vega aspires to be the first person on Mars. A bold step forward in encouraging young girls to dream big! #CharacterCounts https://t.co/3T1BGQykg3"]["Back to work this week with a lot on the to do list. 9 million kids need us to #FundCHIPNow. I’m urging my Republican colleagues to work with us and get the job done to #KeepKidsCovered."]["Happy New Year, everyone! 🎉🎉\n\nWe must keep working together to move Wisconsin and America #forward for all –TB"]["What we’re seeing in Iran is powerful — I stand with the peaceful protestors and support their exercise of free speech and assembly. #IranProtests"]["Lots of #OnWisconsin red @OrangeBowl tonight! Let's finish strong @BadgerFootball!! https://t.co/ES88PwlwNB"]["Since the Affordable Care Act passed, millions of women have gained access to birth control coverage. The Trump Administration's efforts move us backward, and are harmful to the health of 60 million women across this country. https://t.co/ojJ6rceUMu"]["Our students need to be prepared with high demand skills so they win the future. I'm proud to lead bipartisan reform to support &amp; improve America's international education programs. https://t.co/etb5fkD49o"]["Washington must be a strong partner in combatting the opioid epidemic. We must ensure our government agencies have the tools they need to save lives. \nhttps://t.co/AkCTvVJjRn"]["Truax Field’s selection is a well-deserved honor to the 115th Fighter Wing, and will help boost our economy.\nhttps://t.co/qBABURP0F3"]["Go @Bucks go tonight against da Bulls! #FeartheDeer"]["I believe the SEC should require companies to disclose to their shareholders how they use corporate resources for political activities. This disclosure would bring much needed accountability to shareholders and transparency to corporate political spending. Let the sun shine in. https://t.co/3FnUCY6HKV"]["Merry Christmas, Wisconsin! The holidays are a wonderful time to spend with family, and look back through cherished memories. Wishing you all a happy and safe holiday season! https://t.co/WfsRdWJTKv"]["I'm constantly reminded of the dedication and commitment of our service men and women in protecting our great nation. Wherever you are serving, I wish you all a happy holiday and a joyous new year. https://t.co/3xiqjY2X4H"]["I want answers and I’m working across party lines to hold them accountable. https://t.co/a8CbfYuU46"]["#BigPharma keeps jacking up life-saving prescription drug costs for families.\nhttps://t.co/fled0rRiz3"]["This tells you all you need to know about the priorities of Congressional Republicans. At a time when they are giving the top 1% and powerful corporations huge tax breaks, it is morally wrong that they are failing to fully fund children’s health care. #ExtendCHIP https://t.co/MDw9l6Ykq0"]["I voted no tonight on kicking the can down the road. We should be getting the job done and doing right by hard working people. https://t.co/zHqi9Z9czO"]["#GOPTaxScam rewards those who do not need a tax break. Millions of middle class families will face tax hikes and future generations will get higher deficits and debt. This was such a missed opportunity to do right by working families in Wisconsin. https://t.co/VsmfuG7kUJ"]["Congratulations to the dedicated men and women of the 115th Fighter Wing! Today’s announcement from @USAirForce is good for our national security and Wisconsin’s economy. https://t.co/XsrNuVEM3m"]["Every single Senate Republican voted against my amendment to close the #CarriedInterestLoophole that allows the wealthy on Wall Street to pay a lower tax rate than many hardworking Wisconsinites. The #GOPTaxScam rewards wealth over work. https://t.co/ImTFdpUuql"]["The carried interest loophole favors the wealthy on Wall St. and lets them pay ⬇️ tax rates than many in Wisconsin. That’s not fair. Republicans could’ve closed that loophole but chose to gift the #GOPTaxScam to powerful special interests in Washington.\nhttps://t.co/Dgjggqh5Ki"]["While Congressional Republicans give a huge gift to the wealthy, powerful corporations and Wall Street, nearly 170,000 kids in Wisconsin are at risk of losing health care if we don’t act to #FundCHIPNow."]["Answer: Every Republican in the Senate who voted against my amendment to close the #carriedinterest loophole for Wall Street. https://t.co/Ros6M8boIO https://t.co/UtiODy72Hu"]["My statement on tonight’s vote: https://t.co/0JcX6G6400"]["The #GOPTaxScam gives powerful corporations permanent tax breaks.  \n\nThe top 1% will see 83% of the benefits. \n\nMillions of middle class families will face tax hikes and future generations will get higher deficits and debt. https://t.co/t11TkjdIfO"]["Patricia, from Beloit, simply wants fairness but the #GOPTaxScam will likely increase taxes for many seniors. https://t.co/O37r6CLlFG"]["Republicans in Washington are not doing right by the people of Wisconsin. \n\nThey have listened to powerful special interests and they are delivering a huge gift for them. #GOPTaxScam https://t.co/GepXuvdbyw"]["Non-partisan, independent analysis of the #GOPTaxScam shows it will not “pay for itself.”\n\nIn fact, it will increase the deficit and debt and Republicans have put your health care on the chopping block to pay for it. https://t.co/09et9YGrRz"]["Big banks on Wall St., DC lobbyists, and powerful corporations have such a grip on Washington. #GOPTaxScam rewards their wealth instead of your hard work. https://t.co/aucnnWEbHQ"]["The #GOPTaxScam gives 83% percent of the tax benefits to the top 1%. \n\n53% of American households would face tax hikes in 2027. https://t.co/OOUo3quvQH"]["My bipartisan Good Neighbor Authority Improvement Act is critical to maintaining forest health for the benefit of the environment, wildlife and our timber economy. https://t.co/52ccUHDP0X"]["The #GOPTaxScam was a huge missed opportunity to do right by working families in Wisconsin. Instead of focusing on tax relief for the middle class, this is a huge giveaway to the wealthy and powerful corporations. That’s not right. https://t.co/uNbqe3nTaT"]["More than 12,000 #AmericanDreamers have lost their protection from deportation. This is wrong. We must work together and pass the #DreamActNow. https://t.co/ahlzjFmGnm"]["We need tax reform that helps hard working families, small businesses and manufacturers. The #GOPTaxPlan is largely a tax giveaway to the top 1% and big corporations. Millions of middle class families will pay more in taxes. https://t.co/Q2Ioo6ckMH"]["I’ve heard from tens of thousands of Wisconsinites who see the #GOPTaxScam for what it is. It’s simply wrong to give huge tax breaks to the top 1% and corporations &amp; put health care for millions on the chopping block to pay for it. Keep speaking out! https://t.co/dVBt1Gpi8V"]["Nearly 170,000 Wisconsin kids depend on the Children’s Health Insurance Program for health care. CHIP has long been a bipartisan program and it is past time for my Republican colleagues to act. We must #FundCHIPNow"]["Excited to see this jersey return to the field, @AaronRodgers12. Let’s bring home a @Packers win against Carolina! #GBvsCAR #GoPackGo https://t.co/v8aUcb8Hu7"]["Keep calling, keep writing, keep emailing – I’m with you. The #GOPTaxScam is a tax giveaway to the wealthy few, and middle class families will end up paying for it. That’s not right and it’s not fair. https://t.co/irhYVFBFGQ"]["The people of Wisconsin are speaking out about the #GOPTaxScam. It now cuts taxes for the wealthiest few even more.\n\nMake sure your voice is heard, call Congress at 202-224-3121. https://t.co/hOVmG8xAAd"]["Community health centers serve more than 300,000 patients in Wisconsin, including tens of thousands of children. We must act now to fund this critical program. https://t.co/xfXIESvJtL"]["I believe we must do everything we can to preserve our #GreatLakes and protect our freshwater economy. We must act quickly to protect the Great Lakes from #AsianCarp \nhttps://t.co/qTje5JPbvr"]["TODAY is the last day to sign up for health insurance for 2018! Make sure you go to https://t.co/t94YxuygV1 to #GetCovered. You may even qualify for financial assistance! https://t.co/mJkoAkYi4l"]["I’m proud to join @SenGillibrand's Congressional Harassment Reform Act. We must make changes here in Congress and reform the current process to work better for victims of sexual harassment or discrimination and provide more transparency to the public https://t.co/jKI3FKIvXc"]["@FCC I’m joining my Senate colleagues to introduce a resolution to overturn this decision because we must protect innovators, entrepreneurs and consumers and keep the internet open for everyone. #SaveNetNeutrality https://t.co/2wAhvqxDgQ"]["@FCC I’ve received tens of thousands of calls &amp; emails from Wisconsinites urging us to protect #NetNeutrality and a free &amp; open internet. I’m with them, not powerful corporations who will benefit from an unfair, two-tiered system. We must #SaveNetNeutrality"]["The @FCC just voted to end #NetNeutrality in a move that allows internet service providers to turn the internet into an uneven playing field, with fast lanes for some and slow lanes for others. That’s not right."]["Timber is a critical part of our #MadeInWI economy. Today I’m announcing new bipartisan legislation to make sure forest restoration projects can continue without delay, and to keep Wisconsin’s strong timber economy moving forward. https://t.co/hiu2cimIyi"]["It was wonderful catching up with Layne Donovan, a 2017 Fall Senate Page, to thank her for her service and wish her the best of luck in the future. She represented Wauwatosa and Wisconsin well! https://t.co/C5OAMCMPOZ"]["Call on the @FCC to save #NetNeutrality. \n\nI won’t stop fighting and neither should you. #SaveNetNeutrality https://t.co/FozpLZL27d"]["122 DACA recipients lose their status every day. \n\nWe can’t wait – Congress must pass the #DreamActNow.\n\nI am proud to stand with #Dreamers. https://t.co/w3RlwhrE4N"]["The #GOPTaxPlan breaks @realDonaldTrump’s promise to close the carried interest tax loophole for the wealthy on Wall Street. \nI offered an amendment to close it and every Republican voted against it. https://t.co/dn3JF6LBxm"]["Pharmaceutical companies are sticking it to Wisconsinites with rising  prescription drug costs. It’s time for #BigPharma to be transparent and held accountable when it comes to the affordability of prescription drugs. https://t.co/bcWmWYQclp"]["Even President Trump’s own Treasury Department agrees - this #GOPTaxPlan does not pay for itself and increases the debt. And guess who’s going to end up footing the bill? Middle class working families. \nhttps://t.co/ziouVjljqq"]["We must face the challenge of global climate change head on, not turn our back on the rest of the world. Withdrawal from the #ParisAgreement is bad for the environment, bad for our economy and fails our promise to future generations. \n\nI’m #StillIn."]["More than 150,000 kids in Wisconsin need Washington to act and #FundCHIPNow. We must #ExtendCHIP and #KeepKidsCovered."]["Today I joined @SenBillNelson &amp; @SenateDems urging @AjitPaiFCC to abandon his reckless plan to radically alter the free and open internet as we know it. Join us to #SaveNetNeutrality"]["@realDonaldTrump .@POTUS should keep his promise and support strong #BuyAmerica reform. https://t.co/kEsywDfoZL"]["@realDonaldTrump Keep your promise to our workers and make public the #BuyAmerican report that you called for eight months ago. It’s time to get to work and improve wages, boost growth, and support American manufacturers with #BuyAmerican.\nhttps://t.co/qyeuhuHgI8"]["Dear @realDonaldTrump: Your Administration missed your own deadline to complete and release the #BuyAmerican report you called for in your April executive order. \nhttps://t.co/D09C2JK3og"]["We cannot allow the internet to become an uneven playing field, with fast lanes for some and slow lanes for others – RT to tell @AjitPaiFCC to #SaveNetNeutrality"]["JUST IN: The U.S. Senate passed our bipartisan JUST Act. Proud to have partnered with Senator Rubio to work toward justice for Holocaust survivors &amp; families of victims. I look forward to seeing this legislation signed into law."]["I was raised by my grandparents, who put everything aside to care for me. And as my grandmother aged I became her primary caregiver. This issue is so personal to me and I’m grateful to @AARP for hosting this important conversation #FutureofCaregiving"]["I’m thrilled to be at @AARP’s Family Caregiving Executive Summit this morning with @SenatorCollins and AARP Executive VP @NancyLeaMond, moderated by @PeterAlexander. Follow along with us! #FutureofCaregiving \nhttps://t.co/kuFe64JDLn https://t.co/ZqYyPSfmJX"][".@USATODAY’s recent VA investigation is concerning. That is why I have joined a bipartisan effort asking questions and calling on the VA to conduct a nationwide review of its providers. https://t.co/bTJtuVRMXf"]["RELEASE: U.S. Senator Tammy Baldwin Supports Legislation to Increase Funding for #BiomedicalResearch https://t.co/RnSC7Fb5wI"]["Now is the time to #GetCovered! Financial assistance is available, so go to https://t.co/t94YxuygV1 by this Friday December 15 to sign up! https://t.co/RafcfUpCk7"]["Thanks to the NYC first responders for their quick response today. I’m grateful for their work keeping people safe and that a suspect is in custody. We must not let fear win."]["Green &amp; Gold, we better win this one! #GBvsCLE #GoPackGo https://t.co/dECNxusjIm"]["I was thrilled to talk to Jean Birkett today, and the many others I met in Richland Center. Thanks for coming out to say hello! https://t.co/nuDggDYuIk"]["Thank you to Mayor Corcoran for meeting with me and showing me a few of the many treasures of Richland Center! I just love this old peanut roaster! https://t.co/Ju1zGHcbEm"]["Thanks Mayor Breunig for the warm welcome and great conversation! \n\nNext stop: Richland Center! https://t.co/m0m7oioFrr"]["Great to be here in Darlington! Thank you to the Darlington Fire Department for letting me stop by your chili luncheon today – it was delicious! https://t.co/ixH1qU0RaO"]["Keep signing up for health care, Wisconsin! Only one week left before the December 15 deadline. #GetCovered https://t.co/cNVAFCiHVk"]["This is not right. \n\nI’ve called on @OSHA_DOL to take action and protect workers injured on the job. \nhttps://t.co/hVd9onZiDx"]["A free and open internet is vital to ensuring a level playing field online. \n\nIf the public comment period has been corrupted by bots and fake comments, FCC must delay the vote. #NetNeutrality is too important.\nhttps://t.co/LKMDKvFBOj"]["Case in point: why we need a strong consumer protection advocate leading the #CFPB. #DefendCFPB \nhttps://t.co/IytlZCnOde"]["#GOPTaxPlan gives #BigPharma a huge tax break, and puts affordable health care for millions of Americans on the chopping block to pay for it. That’s simply not fair. https://t.co/DmkHdS0Ci4"]["On this day, we remember and honor the sacrifice of courageous heroes who lost their lives during the attack on #PearlHarbor. #HonorThem"]["As the granddaughter of an NIH-funded scientist, I have long championed strengthening our research enterprise. And in 2013, I met Ian, a cancer survivor from Fond du Lac who inspired me to write the Next Generation Researchers Act to improve opportunities for young researchers. https://t.co/QDRmZYpnPh"]["I’m very concerned that the SEC has enabled Wall St’s aggressive pursuit of short-term profits at the expense of job creation &amp; long-term growth. SEC needs to tighten its rules governing buybacks. https://t.co/LC9su6ILmo"]["Happy Birthday, @Giannis_An34! Good luck to you and the whole @Bucks team tonight against Detroit! #FearTheDeer #OwnTheFuture"]["“Maintaining these renewable fuel blending levels helps support the biofuel industry, Wisconsin farmers and the rural economy.” \n\nI’m always proud to be a partner to Wisconsin farmers and to work for our #MadeInWI rural economy.\nhttps://t.co/ylDMEYnahE"]["Instead of deep and unnecessary funding cuts that will leave rural Americans behind, we must strengthen investments in rural communities to make them more vibrant and fully able to participate in today’s economy. https://t.co/VyTVFsorTU"]["Yes, I do. \nhttps://t.co/fG4o5uCuim"]["After giving massive tax breaks for the top 1%, big corporations and Wall Street (adding $1 trillion to the debt), Speaker Ryan is now looking at cutting your Medicaid and Medicare to pay for the #GOPTaxPlan.\nhttps://t.co/FkGR2ci1pq"]["I believe it is best for Senator Franken to resign."]["JUST IN: Senate Foreign Relations Committee passes the bipartisan JUST Act. Proud to work with Senator Rubio to ensure justice is finally done for Holocaust survivors &amp; families of victims. I look forward to a vote on the Senate floor. \nhttps://t.co/qGQWhCjk5i"]["Wisconsin workers need a strong consumer protection advocate at @CFPB. That is why I joined 43 Senators in urging President Trump to nominate someone who will put working families ahead of Wall Street. https://t.co/QS4FQRgd7H"]["New report from @TaxPolicyCenter confirms that more than 60% of #GOPTaxPlan benefits will go to the top 1%. \n\nCall 202-224-3121 and let Washington know middle class families should have their hard work rewarded. \nhttps://t.co/gOG2sVgF6n"]["You have until December 15 to sign up for health insurance on https://t.co/t94YxugG3t. Make sure to #GetCovered today! https://t.co/hszxXswkP3"]["We must do better. My bipartisan reform aims to improve access to maternity care for women across the country. Let’s get it done. https://t.co/PRXq9qMvDt"]["RELEASE: U.S. Senator Tammy Baldwin Highlights Efforts to Protect #Biofuel Production and Rural #Wisconsin Jobs \nhttps://t.co/HK83TNKlem"]["Senate GOP passes huge tax breaks for billionaires &amp; powerful corporations, adding over $1 trillion to the debt. But when it comes to #KeepKidsCovered, there’s no $$$? \n\nLet’s do right by kids and #ExtendCHIP instead of giving tax breaks to top 1%.\n\nhttps://t.co/j9bFLrbbEE"]["We cannot allow the internet to become an uneven playing field with fast lanes for those who can afford it and slow lanes for others. Today I joined my colleagues to call on @AjitPaiFCC to protect #NetNeutrality. https://t.co/bpa0kK4hSP"]["Medicare &amp; Medicaid must not be cut to pay for these massive tax breaks for the top 1% and big corporations. The Senate may have passed the #GOPTaxPlan in the dark of night but you need to call in the light of day: (202) 224-3121. #MondayMotivation"]["What a finish for the overtime victory! #GoPackGo #PackerNation"]["Action is needed to hold companies like Equifax and Uber accountable and require them to notify Americans when personal information has been breached. Our legislation ensures we are doing right by U.S. consumers. https://t.co/aFZwz3b7EA"]["It’s time to #GetLoudLambeau! #GoPackGo #TBvsGB https://t.co/XsJyaZCcRP"]["Let’s #GoBucky! The second half is always our half. #OnWisconsin"]["It’s all about @BadgerFootball today! Looking forward to watching my @UWBadgers battle and win the #BigTen championship. Time to claim our spot in the #CFBPlayoff! #OnWisconsin #GoBucky https://t.co/FsszmC3UnY"]["My statement on tonight’s vote: https://t.co/RnmS7dMY8g"]["I'm working to put Wisconsin first and do right by hard working, middle class families. This partisan #GOPTaxPlan fails to do that."]["Our tax code ought to reward hard work more than it rewards wealth. \nIt doesn’t do that today and it won’t do that with the #GOPTaxPlan."]["This is the #GOPTaxPlan to make our tax system simpler and fairer for you. \n\nScrambling and scribbling. \n\nIt will be voted on tonight. https://t.co/3KkdgLAelD"]["We need tax relief for manufacturers and small businesses to drive growth, and help our #MadeInWI workers.  \nThe #GOPTaxPlan favors powerful, Fortune 500 corporations and the top 1%."]["The #GOPTaxPlan will stick 1.2 million taxpayers age 65+ with a tax hike. https://t.co/D1v6KH964C"]["The #GOPTaxPlan allows Wall Street hedge funds to keep their carried interest loophole. Did they now stuff the Cornyn Amendment in their gift basket to the wealthy on Wall Street? https://t.co/7CGAAanBk0"]["Lying to the FBI is a very serious crime and Michael Flynn, the former WH National Security Advisor, has pleaded guilty to that. Independent Prosecutor Mueller must continue doing his job in this investigation, unobstructed, so the truth can be revealed to the American people."]["Let’s be clear about what happened on the #SenateFloor. I'm trying to reward workers, but Senate Republicans voted against closing a tax loophole for hedge funds on Wall Street because they want to reward the wealth of their donors."]["Senate Republicans just voted to let billionaires on Wall St. keep a loophole that allows them to pay a lower tax rate than American workers. Is it because Wall Street lobbyists, big banks, and hedge funds have such a grip on Washington? #GOPTaxPlan"]["Let’s make sure our tax code rewards work as much as it currently rewards wealth. If that isn’t simple and fair, I don’t know what is. #TaxReform"]["I am asking my Republican colleagues to help President Trump keep his promises to the American people, and close this unfair tax loophole for the wealthy on Wall St."]["As a candidate, President Trump included closing the carried interest tax loophole in his tax reform plan. I agree, it is unfair and should be eliminated. But this loophole for Wall Street is still in this bill."]["Today I’m offering an amendment to do what this tax plan fails to do: make good on President Trump’s promise to close the carried interest tax loophole for millionaires and billionaires on Wall Street."]["So the #GOPTaxPlan not only gives tax breaks to the top 1% and raises taxes on millions of middle class families. It also increases the deficit $1 trillion. \n\nGuess who is going to pay for that? https://t.co/qIQYDTgZBV"]["The non-partisan Joint Committee on Taxation, the congressional scorekeeper, confirms that the #GOPTaxPlan does not pay for itself. In fact, it adds $1 trillion, plus interest, to the national debt."]["Wisconsin has a proud history of entrepreneurship and innovation.\nRecent reports show that we need to do more to support our #MadeInWI start-ups. \nBut under the #GOPTaxPlan the top 1% will end up with 62% of the benefits."]["#GOPTaxPlan lets Wall Street keep a tax loophole while most Americans earning less than $75,000 a year would see tax increases. That’s not fair. https://t.co/FYaoPWE9N7"]["We need to make our tax system simpler and fairer for hardworking families, small businesses and manufacturers. That is what I am working for and I have amendments to the #GOPTaxPlan ➡️  https://t.co/Ros6M7TNke"]["Happy Holidays to our brave men and women in the Armed Forces! We honor the sacrifices that you have made and the courage you have displayed. Thank you to @RedCross for giving us a chance to reach out to our nation’s heroes. https://t.co/bTKQjvKiW1"]["The American people must be able to trust that the HHS Secretary is working for them, not powerful Washington interests. The problem is the system is rigged by #BigPharma who jack up prescription drug prices for families struggling to get ahead. \nhttps://t.co/K8JuwbVw9R https://t.co/ucm1zzWQVd"]["#GOPTaxPlan gives tax breaks to top 1% &amp; lets Wall St keep loopholes, but millions of middle class families see a tax hike. That’s not fair. https://t.co/NYel5o1O3e"]["While the SEC has broad authority from Congress to rein in abuses, it has been hesitant to do so. This needs to change and I have questions that demand answers. https://t.co/MnWZK2cQZg https://t.co/dK3PLPfaxu"]["84% of Native American women experience violence in their life &amp; on some reservations, are murdered at 10x the national avg. \n\nNative American women are #NotInvisible. We see you. \n\nJoin me to raise awareness so we can combat these crimes against women. https://t.co/0BPQVzNzop"]["#GOPTaxPlan breaks @RealDonaldTrump’s promise and fails to close the tax loophole for Wall St. hedge funds. Instead it gives tax breaks to the top 1% and increases taxes on millions of middle class families. https://t.co/IUaB94p6CL"]["The evidence is clear: #GOPTaxPlan favors the wealthy and big corporations, not middle class Wisconsin families. \n\nhttps://t.co/YPDaDdGzFX"]["Congress sees the threat to the #GreatLakes that Trump ignores: \"U.S. Sen. Tammy Baldwin, D-Wis., helped lead the bipartisan effort to restore the funding as a member of the Senate Appropriations Committee. Well done.\" https://t.co/O6B67KLQNl"]["#GOPTaxPlan is largely a tax giveaway to the wealthiest few &amp; powerful corporations, while millions of middle class families get a tax hike. https://t.co/cPH12Cfapc"]["We need to take action to stop #AsianCarp. Proud to fight to protect our #GreatLakes! https://t.co/fMp8wvtqJg"]["RT if you agree: our men and women in uniform should wear uniforms made in the U.S.A. #BuyAmerican\n\nhttps://t.co/IFlR70mhNa"]["#GOPTaxPlan is largely a tax giveaway to the wealthiest few &amp; powerful corporations. I have legislation to close the carried interest loophole for the wealthy on Wall Street but this plan lets them keep their loophole. That’s not right and it’s not fair. \nhttps://t.co/dlhc5QfGLq"]["The people of Wisconsin should have a leader at #CFPB who is working for them, not lobbyists &amp; big banks. This watchdog agency must remain independent and committed to taking on powerful special interests and providing American families strong consumer protections. #DefendCFPB https://t.co/BZ6piDAvOK"]["We need to protect our clean water resources, which is critical to our #MadeInWI economy. I’m proud to stand up for Wisconsin’s #GreatLakes\n\nhttps://t.co/HzoA4ipv43"]["The Senate returns this week and Republicans are trying to force through their #GOPTaxPlan. It’s a bad deal for Wisconsin. Huge tax breaks for the wealthiest few and powerful corporations. Higher taxes for middle class, working families in our state."]["This may be a case of putting profits over providing an open, honest forum for traveler reviews on TripAdvisor. \n\nI called on the FTC to look into this and they should get to the bottom of it.\n\nhttps://t.co/pPE78iM5Xa"]["Today is #SmallBusinessSaturday! Small businesses are the engine of our #MadeInWI economy. Make sure you #ShopSmall today! https://t.co/YZdJfWHimj"]["It’s rivalry week! Cheering on my #Badgers as they finish out the regular season strong and take on Minnesota. #OnWisconsin #GoBucky! https://t.co/b60AYqTtSx"]["Happy Birthday @lakefront brewery! Thanks for 30 years of great beers!\nhttps://t.co/jlRdt3z1Ec https://t.co/ADVHs1sr04"]["#GOPTaxPlan gives huge tax breaks to the wealthy few and increases taxes on working families. That’s not right and it’s not fair. https://t.co/4kkISP0ye4"]["I’m thankful for the opportunity to work for the people of Wisconsin, and thinking of our men &amp; women currently serving our America overseas. Happy Thanksgiving, Wisconsin! -TB"]["Today I visited the Tomah VA facility with @RepRonKind @jakeleinenkugel and Marv and Linda Simcakoski. Thanks to everyone for working together on solutions to improve care and services for our #veterans https://t.co/j13efMgsjC"]["The big dinner is almost here! From my kitchen to yours, here are two of my favorite #Thanksgiving recipes. Enjoy! –TB https://t.co/nMLOdEvAAd"]["RELEASE: American Manufacturers Applaud U.S. Senator Tammy Baldwin for Getting the Job Done to Improve Buy American Standards in National Defense Legislation https://t.co/ez2Tcv2G2F"]["My statement on the FCC’s plan to repeal #NetNeutrality https://t.co/vyNw0YrqDu"]["I want to know why PNC bank appears to have chosen short-term profit at the expense of Appleton Coated, its workers &amp; their families. https://t.co/tQOzEblQ7J"]["RELEASE: U.S. Senator Tammy Baldwin Secures Funding for Wisconsin’s #GreatLakes https://t.co/nTxmF9wqCS"]["Regardless of where they seek care, our veterans need and deserve access to the best and safest possible health care. Last week I introduced bipartisan legislation to strengthen opioid safety for our veterans  https://t.co/LDP9ypixbB"]["We must show strong leadership on climate change, reaffirm our commitment to future generations and take action to address this challenge. Backing out of the Paris Agreement is bad for our environment &amp; bad for our economy in Wisconsin. \nhttps://t.co/1StBwKmW8U https://t.co/3zIw6j7Y1M"]["I was honored to meet the boy scouts from @GlaciersEdgeBSA! I’m inspired by your commitment to the scouts’ mission and I know all of you have bright futures ahead! https://t.co/7w3lZWHh9s"]["“Households earning between $75,000 and $100,000 will see, on average, no tax cut. And households earning less than $75,000 per year will see, on average, a tax increase.” https://t.co/6xVum5MRzn"]["Love to see my Packers in their throwback uniforms. Get loud, Lambeau! Beat the Ravens! #GoPackGo #GBvsBAL https://t.co/CT6VC42hx5"]["WBAY Green Bay: Baldwin questions bank about Appleton Coated closure https://t.co/XwTydLYQ03"]["Today my undefeated @UWBadgers take on Michigan. I ran into @RepDebDingell this week and bet her all the cheese curds in my office that the #Badgers will stay undefeated! #OnWisconsin #GoBucky https://t.co/cUoEbpaVp7"]["This weekend is the start of deer hunting season! Good luck to all of the deer hunters in Wisconsin for a safe and successful hunt."]["The average deduction in Wisconsin is $11,653 and nearly $10 billion of Wisconsinites paychecks would be subject to a double-tax – all to pay for a plan that favors those at the top. That’s not right and it’s not fair."]["With #GOPTaxPlan, nearly 1-in-3 Wisconsin taxpayers will lose their personal income, sales, and property tax deductions and be subjected to a double tax."]["#GOPTaxPlan gives big corporations permanent tax breaks, while middle class families will see tax hikes. Most Americans earning less than $75,000 a year would see tax increases. Simply not fair. \n\nhttps://t.co/GssKaAgFZA"]["Today is National Pancreatic Cancer Awareness Day. I’ve got my purple on to support @PanCAN   #PancreaticCancerDay https://t.co/sPtWiJeGAj"]["Thank you @SenSherrodBrown for leading this effort. Together we can make sure today’s workers can count on the pensions they have earned."]["I’m committed to fighting to fix failing pensions to give workers and retirees in Wisconsin the peace of mind that comes with knowing the pensions you earned will be there when you need it. https://t.co/eKLPoOt9MY"]["Today I joined the Wisconsin Committee to Protect Pensions to discuss new legislation to put failing pension plans back on solid ground. A secure retirement is a central pillar of economic security for hard working families and I am proud to do right by our workers. https://t.co/4KRhcxQqBp"]["Thank you for the incredible work you are doing and the support you give Wisconsin families every day! https://t.co/W8rCA4dwbq"]["The renegotiation of #NAFTA resumed today and I called on the Trump Administration to include strong protections for American workers.\n\nWe must reverse the race to the bottom that has led to job losses and stagnant wages in the U.S. \nhttps://t.co/MOugxJ2oXU"]["America’s Health Insurers, Doctors &amp; Hospitals oppose the Republican plan to increase the number of uninsured and raise health care premiums. #GOPTaxPlan https://t.co/5y1mItTdRI"]["Leave it to a Wisconsin dairy farmer to say what needs to be said about the #GOPTaxPlan...\n“Getting rid of the estate tax is a gift to the very rich, not to farmers.”\nhttps://t.co/RpB4EtRQFR"]["I've introduced comprehensive consumer privacy legislation to protect Americans’ sensitive personal information against cyberattacks and to ensure timely notification and protection when data is breached. #Equifax https://t.co/zjotdMBXiK"]["Thought the #GOPTaxBill couldn’t get worse? It did.\n\nA huge tax giveaway to the wealthiest few and big corporations + 13 million more uninsured Americans &amp; higher health care premiums = a bad deal for working families in Wisconsin.\nhttps://t.co/NOj6Vjyzlg"]["I am calling on Congressional Republicans to close the carried interest tax loophole for the wealthy on Wall Street. https://t.co/E02wr0F0JS"]["#GOPTaxPlan lets wealthy millionaires and billionaires on Wall Street keep their loopholes. We should eliminate the #CarriedInterest tax loophole. The President promised to close it and I have legislation to do it. https://t.co/FKrpQCxAxE"]["The #CarriedInterest tax loophole lets wealthy hedge fund managers on Wall Street pay half the tax rate of what a Wisconsin worker making the same income would pay. It’s unfair for workers to pay a higher income tax rate than a millionaire on Wall Street."]["Every middle class family should get a tax cut, but #GOPTaxPlan fails to do that. In fact, some working families in Wisconsin will actually see a tax increase. https://t.co/GywORpmzPf"]["The Senate GOP tax bill is largely a tax giveaway to the wealthiest few and big corporations.\n\nThen there's this...\n\nhttps://t.co/1WXVfDAwSi"]["My statement on the nomination of Alex Azar for @HHSGov Secretary: https://t.co/aiePoxsCsB"]["President Trump repeatedly promised end this tax loophole for the wealthy on Wall Street. I have legislation to close the carried interest tax loophole and Congressional Republicans should keep the President’s promise. https://t.co/PnCWgSsUvK"]["RELEASE: Senator Baldwin Announces Transportation Funding for Wisconsin Counties Affected by 2016 Floods https://t.co/fgakusewKE"]["It was great to join the community at the @OshkoshWestHigh #Veterans Honor Wall ceremony today! https://t.co/kCaqAerLC9"]["On #VeteransDay and every day, I’m inspired by the courage of our servicemen and women. Thank you to all of our Veterans and their families, in Wisconsin and across the U.S.A! 🇺🇸 https://t.co/BCDQ2YjJI5"]["This week, I was honored to meet Denise Rohan, the American Legion’s first female National Commander in history, and the second National Commander from the great state of Wisconsin. Denise, you are making Wisconsin proud! https://t.co/qrbosfHtsO"]["Every veteran who wants to pursue higher education should be able to do so, and I’m proud to work with my colleagues to close this loophole and support our veterans’ access to education  https://t.co/0dqGX4T2Wb"]["Dear @Equifax: It’s past time to provide direct notice to each and every American consumer impacted by your company’s failures. https://t.co/9f0KJR0t9a"]["A big thanks to @wistartupweek for bringing #MadeinWI entrepreneurs together to help grow our economy. #Forward"]["Tax reform should provide tax relief to start-ups, so we can free up investments to create jobs. More here: https://t.co/v9OtKoekJm https://t.co/hKUJEEHRBV"]["I fought to include #BuyAmerican in the defense legislation because when American taxpayer money is spent on our military it should be spent buying American products built by our workers. NDAA now includes #BuyAmerican. https://t.co/n2c5NOlJN1"]["About 1 in 3 Wisconsin taxpayers currently claim the state and local tax deduction. The Senate Republican plan calls for the federal government to tax these Wisconsin taxpayers twice while the wealthy, big banks and powerful corporations get massive tax breaks."]["The Senate Republican tax plan lets big corporations deduct their state and local taxes, but for individuals and families in Wisconsin the personal income, sales, and property tax deductions are eliminated. That's not fairness."]["Keep signing up for health insurance, Wisconsin! It’s up to us to get the word out this year, make sure you #GetCoveredNow \nhttps://t.co/yj7K9u5PxI"]["To the hundreds of Dreamers I saw on my way to the Senate floor, I am proud to stand with you! We need a clean #DreamActNow https://t.co/93MTeU9rcH"]["What?!!\nI blame China's cheating for hurting Wisconsin’s manufacturing economy and costing our workers their jobs. We need to crack down on countries like China, not give them praise, when they cheat American workers. https://t.co/dlEYIDubM0"]["Wishing my good friend @repmarkpocan a quick and healthy recovery. He's a tireless champion for Wisconsinites and I hope to see him back at work soon. https://t.co/v83luaUDmE"]["We need to support our #MadeInWI start-ups! I’m working to bring tax cuts to small businesses &amp; start-ups so they can invest in jobs and move our economy forward. Thx @wistartupweek for highlighting Wisconsin innovation!"]["The GOP tax plan should close the carried interest tax loophole for Wall Street hedge funds. \n\n@POTUS promised to close this loophole and I have legislation to do it. \n\nI sent a letter to Chairman Hatch so we can work together to keep President Trump's promise. https://t.co/sU4TdaILJ0"]["Only 30 million ppl, of 145 million total affected, have used #Equifax sub-par website to see if their info was hacked. Equifax must be proactive and make sure every person is notified. The response so far is unacceptable."]["#Equifax could start regaining our confidence by committing to notify every single person affected by this breach. I asked directly today and did not get that commitment from company leadership. Americans need to know so they can protect themselves. https://t.co/c2w8wO20Kj"]["I’m looking forward to today’s @SenateCommerce hearing. #Equifax executives must be more transparent and straightforward about the massive data breach. The American people deserve answers and I’m working to get them."]["Tax reform should make things simpler &amp; fairer for hard-working Wisconsin small businesses, manufacturers. This GOP plan has a huge problem. https://t.co/DWXEVwNyjp"]["Thank you @wifarmersunion South Central Chapter for the Golden Cupcake Award! It’s an honor to work for rural Wisconsin and our farmers. https://t.co/PPpgCkWuP9"]["I agree. We need to get to the bottom of this. \n\nI have called for @SenateCommerce hearing and IG investigation. \nhttps://t.co/hBvCX1fSXb"]["Huge tax breaks for the top 1%, big banks and powerful corporations. Who pays?  https://t.co/KMVmQplWGS"]["Are you ready for some football? #GoPackGo #MNF #GBvsDET https://t.co/xgKFzg5nP9"]["Open Enrollment for Marketplace health plans is happening now! Go to https://t.co/ppjMunaqKA and #GetCovered! https://t.co/WYbQVkgyd3"]["It’s simply not fair to make the middle class pay for tax breaks for those at the top who have $10 million estates. https://t.co/FgMaCHbN3G"]["Tragic gun violence, again. This time in a church...again. How many times will we say again...and accept doing nothing? #SutherlandSprings"]["My heart breaks for the victims and families of #SutherlandSprings"]["Honored to meet with @jakeleinenkugel last week &amp; receive this year's #VeteransDay pin! Thanks, Jake for your work supporting our veterans! https://t.co/ywGeyczj45"]["I always love running into students! So great to see Fond du Lac’s @marian_wi model UN team this week in the Capitol! https://t.co/mtzsWalI0U"]["We believe it's not fair to make Wisconsin middle class pay for huge tax cuts for wealthy by increasing deficit, cutting Medicare &amp; Medicaid https://t.co/rGfWTD7zEi"]["If you have a $10 million estate, you get a tax cut from GOP plan.\n\nIf you have student loans you lose your interest payment deduction."]["I don't think it's right to favor the wealthiest few, big banks, and powerful corporations with massive tax breaks."]["The House Republican plan doesn’t do enough to reward hard work and instead rewards wealth by giving tax breaks to the wealthiest 1%."]["Thank you Elevate for your work. You have a partner in the effort to take on the opioid crisis and save lives."]["I toured an exhibit at Elevate in Jackson, which helps educate families on addiction https://t.co/9oinA4f0dr"]["WI taxpayers are paying $3B to a foreign corporation. I want the deal to work but public must see it before it is approved. No blank checks. https://t.co/nYB03hrAHy"]["In Green Bay today w/ Fire Chief David Litton to discuss how GOP’s tax plan could hurt communities. SALT income &amp; sales tax deduction axed. https://t.co/MxZ3gVhB8q"]["I have legislation to close this loophole for hedge funds on Wall St. GOP House plan breaks President’s promise. \nhttps://t.co/oQIMo4IaVD"]["Patients &amp; families must be able to trust that @DEAHQ and @US_FDA work for them, not powerful Washington interests  https://t.co/mlycvjJgjI"]["It’s clear workplace harassment remains an unacceptable reality. We must do more and take action. https://t.co/tJrmfwvP0C"]["We should be helping people save for retirement, not increasing taxes on their 401(k) to fund tax breaks for top 1%."]["Today is the day! You can visit https://t.co/ppjMumSPm0 to find a plan that works for you and #GetCovered https://t.co/bvgYeLB9Ti"]["My heart is with the victims of the violent act of terror in NYC. Thanks to law enforcement for their rapid response to save lives. https://t.co/zKzpWhAC40"]["Student loan debt continues to climb and families need solutions that provide relief. #HigherEdNotDebt https://t.co/50rDiSVWMr"]["Open Enrollment starts tomorrow. Make sure you go to https://t.co/ppjMumSPm0 to shop for the best plan for you &amp; your family. #GetCovered https://t.co/rk0eXGqHWa"]["I’m urging @CDCgov to do what it takes to better support the 192,000 Wisconsinites struggling w/eating disorders https://t.co/P8Lojif47y https://t.co/tbksBI5HyX"]["I agree. It's wrong to increase taxes on the retirement savings of workers to pay for tax breaks for the top 1%. \nhttps://t.co/KTkBx2Dcnv"]["Serious indictments from independent Special Prosecutor Mueller. Investigation must continue unobstructed and reveal the truth."]["The #Packers have a bye week so how about some @Bucks! #fearthedeer"]["It’s past time for the Trump Administration to start cracking down on unfair prescription drug pricing. https://t.co/K3tbu7LtkA"]["Washington must step up to be a stronger partner for local communities in the fight against the #opioid epidemic. https://t.co/khr2Bl8Qzw"]["I'm working to protect &amp; improve our scenic trails so Wisconsinites can continue to enjoy the great outdoors! https://t.co/8FSFF3ajft https://t.co/UdRIF8MJSW"]["This week I was thrilled to catch up with @BeckyBlank on Capitol Hill. Thank you for all that you do for @UWMadison! #OnWisconsin https://t.co/ScMDKbEwNJ"]["I’m working to give Wisconsinites more choices when it comes to quality, affordable health care. https://t.co/wwiW4Lx72K"]["We need to take action to fight the #opioid epidemic. My statement: https://t.co/OHwdUHSmtV"]["Eliminating state and local tax deductions in order to give massive tax cuts to the wealthy is simply a bad deal. \nhttps://t.co/NXTrwNJoYC"]["As the #FY18NDAA Conference Committee begins today, I'm pushing for strong Buy American requirements.\nhttps://t.co/MUfdyKcUqd"]["Congrats @SDJanesville for launching #IgniteMyFuture! You have a partner supporting #STEMed to prepare our students for the future."]["Last night, a narrow majority voted to repeal the @CFPB #RipoffClause. Washington must work to protect consumers, not big Wall Street banks. https://t.co/T9gJhEG7bK"]["New CBO score shows our bipartisan health care stabilization legislation also decreases the deficit. Senate needs to act on this immediately https://t.co/3x3jyuQ6Ho"]["It’s time for @SecretaryRoss to put our American steel workers first, and crack down on unfair trade practices. https://t.co/u20wLTgis4"]["It’s not right to ask working families to pay for tax cuts for the top 1% https://t.co/iW0CrhY55P"]["If we provide tax relief to #MadeInWI start-ups, we can free up investments to create jobs and grow our economy. https://t.co/rvmDPecyWP"]["Last month at @SentryEquipment in Oconomowoc, I announced my Worker Owned Wealth Act to boost employee ownership. https://t.co/UX6mOyeK5p"]["Let’s make October National #EmployeeOwnership Month! When workers have a seat at the table, it leads to higher wages and job security. https://t.co/ZBRRWbK9Y5"]["I believe Wisconsin families need a tax break and that's what I'm working for.\nhttps://t.co/Ar20xombTG"]["Wisconsinites deserve answers on whether we have all of the tools necessary to fight the opioid epidemic. https://t.co/F1kTFiGkME"]["@gener8tor Great to see some of our many outstanding #MadeInWI start-ups today, including @BrightCellars! https://t.co/wT9sBdoFg8"]["@gener8tor My tax reform will provide relief for our #MadeInWI start-ups so they can invest in jobs. https://t.co/v9OtKoekJm"]["@gener8tor Wisconsin small businesses need a tax break. That’s why I introduced a tax reform to help create jobs &amp; boost start-up growth. https://t.co/c1RcdVm5cQ"]["I visited @gener8tor in Milwaukee today to meet with start-up business leaders about how to support innovation &amp; grow our #MadeInWI economy. https://t.co/SaogabHQ8R"]["I support the bipartisan effort to stabilize health insurance markets and help lower costs for Wisconsin families https://t.co/OoOHUmYHTH"]["It's #SpiritDay! Together, let's stand up to bullying and support #LGBT youth. 💜 https://t.co/Xy1tyi6c73"]["Wisconsin families need a tax break and that's what I'm working for. Read more about my amendment here: https://t.co/nvvdzA8sEx"]["It’s not right to make Wisconsin working families pay for tax breaks for the top 1% with rising deficits and cuts to Medicare and Medicaid."]["This budget fast tracks huge tax breaks for the wealthy, blows a hole in the deficit and puts Medicare and Medicaid on the chopping block."]["Right now, the Senate is voting on my budget amendment that stops the GOP plan from increasing the deficit with tax breaks for the top. https://t.co/kycZPhREjC"]["Higher education should be a path to prosperity, not a path into debt. I’m fighting to protect Wisconsin students from scams. https://t.co/MPQpPJAgRV"]["It's #ForestProductsWeek! Together, let's #CelebrateFP and the important role timber and paper play in our #MadeInWI economy. https://t.co/rUuxcoBItj"]["Today I made it clear to the Canadian Ambassador that NAFTA renegotiation must work for our dairy farmers and #MadeInWI economy. #BuyAmerica https://t.co/8cUPDZoz5D"]["We must protect students from student loan scams. @SenBillNelson and I are calling on @BetsyDeVosED to take action. https://t.co/N8rCdMf6vk"]["My statement on the bipartisan Alexander-Murray health care agreement: https://t.co/xGVrK2WGVA"]["We need to work across party lines and bring down rising drug prices. Follow along with the hearing here: https://t.co/wi56B7gMJd"]["We must do more to take on sky-high drug prices. My bipartisan reform will bring relief to American families. https://t.co/ppNqLASQJC"]["We must take on rising drug prices. My bipartisan #FAIRDrugPricing Act takes action. Looking forward to tomorrow's Health Committee hearing."]["The White House must pull Marino's nomination. We need a drug czar working for families, not big pharma corporations\nhttps://t.co/8ugpgvWpqG"]["I’m calling on @EPA and @OSHA_DOL to expand their investigations to protect communities across America. https://t.co/NIuc2zEbFH"]["It’s gameday. Let’s do this. #GBvsMIN #GoPackGo https://t.co/Jwi5Xvs8uF"]["This is an incredible interview with Oscar, a UW-Whitewater student and Dreamer making his voice heard.\nhttps://t.co/8Ix1PTWMHE"]["1,200 people in Wausau could lose their care unless Congress acts and passes our bipartisan CHIME Act. https://t.co/xuKnKWsXVu"]["A must-read of what Washington inaction will mean for the health care of Wisconsinites in Wausau.\nhttps://t.co/s16NsswN0j"]["People can't afford higher premiums, we need bipartisan action to lower health care costs. Congress must act to fund cost sharing payments."]["Trump's sabotage led to a 35% premium spike. Now he’s ending cost sharing payments that make health care affordable for 110,000 in Wisconsin https://t.co/ghkVCyoHnN"]["Happy #NationalFarmersDay to our hardworking Wisconsinites who are moving our rural communities forward! https://t.co/2DhEkacaiM"]["With this executive order, @realDonaldTrump is yet again acting to sabotage Wisconsin’s health care system at the expense of families. https://t.co/0CCURZAcme"]["Great to announce the #StrongerWayAct with @CoryBooker at @CA_PPI last week! https://t.co/JPG986G9Ov"]["You have to watch Kimberly’s story. This is why the #StrongerWayAct is so important. https://t.co/gKS6IxyMEm"]["We should meet the challenge of taking on climate change with a state-federal partnership to cut carbon pollution, not walk away from it. https://t.co/xjBz53Tk9a"]["Our #StrongerWayAct is tax reform that rewards work. https://t.co/9ehPD9hIPU"]["UW-La Crosse students were depending on Washington to #SavePerkinsNow and they were let down. More in @theracquet:  https://t.co/2mPeDYO3ic"]["I will miss my dear friend Jerry Kleczka. We've lost someone whose public service was always defined by helping Wisconsin working families."]["Sunday is game day! #GoPackGo #GBvsDAL 🧀🏈 https://t.co/SArSBd090M"]["Tax reform needs to reward work, raise incomes &amp; help working families keep more of what they earn. #StrongerWayAct https://t.co/sNNSnUeYxo"]["I am fighting for Dreamers like Yessenia.\nhttps://t.co/PZEdMbnfZL"][".@BadgerFootball has brought home the Freedom Trophy 4 straight times. Tonight will be number 5! 🏆 #OnWisconsin https://t.co/8aCUabL4bC"]["The #StrongerWayAct is tax reform legislation that rewards the hard work of Wisconsinites.\nhttps://t.co/quDmwnzTUD https://t.co/kug4VTXgLY"]["I'm calling on @SEC_Enforcement to investigate this. Wisconsinites deserve answers. https://t.co/shlUPLohex"]["Yesterday @CoryBooker and I introduced new bold tax reform legislation in Milwaukee: The #StrongerWayAct https://t.co/BpyKaI1Q8n https://t.co/ANncg6drGC"]["Thank you to everyone that came out to @Comm_Advocates today to help @CoryBooker and I introduce the #StrongerWayAct! https://t.co/peIvIrAscS"]["I am committed to continuing our fight to do the right thing for Dreamers and pass the Dream Act. https://t.co/FC6W2NyHDT"]["Willie used a transitional job to help him get a job he loves. #StrongerWayAct makes a national commitment to transitional jobs. https://t.co/HRU8TC8XNd"]["Kimberly told her story on how the EITC helped her reach her goal of becoming a nurse. #StrongerWayAct expands EITC to help working families https://t.co/pnDjWHTnka"]["A special thank you to Kimberly and Willie who shared their stories about how #StrongerWayAct would help families &amp; individuals in Wisconsin https://t.co/oHtVD6TwCn"]["The latest health care sabotage from the Trump Admin attacks women’s health, raising costs for birth control they rely on. #HandsOffMyBC https://t.co/R1QiwG0gOv"]["Thank you to @Comm_Advocates for being our partners in the #StrongerWayAct and hosting us today! https://t.co/WAFD973341"]["Too many people are being left behind by Washington when tax reform should help them get ahead. #StrongerWayAct https://t.co/BpyKaI1Q8n"]["Our #StrongerWayAct is bold tax reform that rewards work &amp; raises incomes for working families. https://t.co/P8tsQsNryH"]["Excited to be in Milwaukee today with my friend @CoryBooker to announce our new tax reform legislation, the #StrongerWayAct. https://t.co/2bNIlQYaom"]["A first look at the #StrongerWayAct from @politico's @morningmoneyben\nhttps://t.co/CFNPFUHaPs https://t.co/qUUS7wooGH"]["I'm a gun owner who believes bump stocks shouldn't be on our streets. Enough is enough. I'm joining legislation to help save lives. https://t.co/PaiBGkR7w2"]["Cutting Medicare and Medicaid to pay for tax cuts for those at the top - all at the expense of the middle class - is the wrong way to go."]["This Ryan/McConnell plan also favors those at the top with huge tax breaks for big corporations and the top 1%. https://t.co/TzWZbNHkqx"]["They are moving forward with a budget that cuts your Medicare and Medicaid. https://t.co/51q91HMbYX"]["Looking at the Congressional Republicans’ budget plan and I have major concerns."]["Met with some brave Dreamers from Wisconsin. Thank you for sharing your stories with me. I'll keep fighting for you and the DREAM Act. https://t.co/is9qQX6boX"]["I was at SCOTUS today to see the Gill v Whitford arguments. Hyper-partisan gerrymandering should be ruled unconstitutional. #fairmaps https://t.co/8xUstELu0p"]["The tragic gun violence in Las Vegas is horrific. My heart breaks for the victims, their friends and family."]["Progress in the fight against the opioid epidemic in Kenosha County https://t.co/PwGbSpWPR5"]["The Perkins Loan Program expires today. Once again, Washington is letting our students down. #SavePerkinsNow https://t.co/IBJRHZGhNA"]["After $500,000+ in cuts to limit health care access in Wisconsin, we can't afford another @HHSGov Sec sabotaging markets and raising costs. https://t.co/7A3o2Pmkco"]["\"The clock is ticking, so it's all hands on deck to save our clinics from this impending funding cliff.\"\nhttps://t.co/BEQp6a9Aca"]["Who's with me?? There's nothing better than watching the @packers beat the Bears. #GoPackGo https://t.co/SKmEWH5TGW"]["Ajit Pai is set on dismantling #NetNeutrality. I'm voting no on his nomination to be @FCC Chair and yes to an #OpenInternet."]["I will continue to fight to #SavePerkinsNow. I hope students across America urge their Senators to join this bipartisan effort."]["I’m disappointed that once again, our bipartisan effort has been obstructed. Students are depending on Washington to get the job done."]["I just got off the Senate floor where I called for the immediate passage of my bipartisan legislation to #SavePerkinsNow."]["As someone that served as my grandmother’s primary caregiver, I’m so happy to see our legislation pass the Senate! https://t.co/TwAtZUlsJt"]["Big thanks to my friend @SenatorCollins! Our bipartisan legislation will formally recognize and support family caregivers across America. https://t.co/wTkpjq5zZo"]["Excited to announce the bipartisan RAISE Family Caregivers Act has unanimously passed the Senate! https://t.co/9dtmSs2Gm6 https://t.co/fpIb7r5B25"]["I support the @packers call for unity in support of freedom, equality, tolerance, understanding and justice for all. https://t.co/R9AkajtElS"][".@WaukeshaSTEM is lucky to have a great principal in James Murray! Congrats on being named Wisconsin's #POY17, @edUcation_frwd! 🎉 https://t.co/aWDNiBJjWn"]["Now it's time to get to back to work on bipartisan solutions to stabilize the health care market and lower costs for people."]["Make no mistake, this is because of YOU. By speaking out and sharing your stories, we've stopped the partisan #GrahamCassidy repeal plan. https://t.co/etRRbGVdsH"]["Multiple major hurricanes have disrupted day-to-day life for many Dreamers. The DACA deadline should be extended. https://t.co/CFVbGZ6z18"]["Our fellow Americans in Puerto Rico are in desperate need of help. The Trump Administration and Congress need to step up and provide relief."]["\"Act now before it’s too late.\" #SavePerkinsNow https://t.co/LdlaxRmuV4"]["Equifax CEO Richard Smith has resigned, but there are still many unanswered questions about their actions before - and after - the breach. https://t.co/LSosuNlH4l"]["On @hardball to share some stories of Wisconsinites speaking out against the partisan #GrahamCassidy repeal plan with @HardballChris."]["The reason we're fighting the #GrahamCassidy plan is simple: This partisan repeal takes people’s health care away. https://t.co/11VUP76wyJ"]["Watch Joanne share her story about her daughter with a pre-existing condition - and then call to stop #GrahamCassidy\nhttps://t.co/4Gm9u3E29Y"]["🚨 🚨 The Perkins Loan Program expires in 5⃣ days! Washington must act to #SavePerkinsNow.\nhttps://t.co/uuFTAIG7BT"]["I'm with Bill from Baraboo here. His family's story is why we need to stop the partisan #GrahamCassidy repeal plan.\nhttps://t.co/6L3Vizfmqg"]["Held an emergency press conference to call for action to stop the #GrahamCassidy repeal. \nKeep up the calls! \nhttps://t.co/JQTdOxX4M6"]["My #MondayMotivation for this morning. #GoPackGo https://t.co/BoPmKihvN9"]["Keep up the fight! Let's build on our momentum. Make your voice heard to defeat #GrahamCassidy and protect Wisconsinites' health care. https://t.co/iy3o7v27Vy"]["Sara Finger of @healthywomenWI is urging Wisconsinites to take action now and stop the partisan #GrahamCassidy repeal. https://t.co/JTBKooE5Co"]["Joanne's daughter has a pre-existing condition. She's afraid of what #GrahamCassidy would mean for her family. https://t.co/8xx9L7RGML"]["At @KidsForwardWI with health care advocates today urging Wisconsinites to continue speaking out against the #GrahamCassidy repeal plan."]["Betsy DeVos' rollback of #TitleIX protections hurts the fight to end campus sexual assault and sends the wrong message to survivors. https://t.co/WXNqwiRNA8"]["The #AgeTax is back. New @AARP analysis says #GrahamCassidy could increase costs by $16,000+ for older Wisconsinites https://t.co/lEMZ1AQXJQ"]["I met Steve and his family earlier this summer. Show your support and help stop #GrahamCassidy by speaking out today! https://t.co/vN8FwPQE6F"]["Pre-existing conditions or lifetime caps should never keep kids like Steve from being covered. #GrahamCassidy \nhttps://t.co/UZSeBcLERK"]["Wow! Just looked at the number of calls since this tweet. Keep it going! Your voices can stop #GrahamCassidy! https://t.co/ubQiYy5sVQ"]["This is why we must keep up the fight against #GrahamCassidy. Sandy &amp; her son are counting on you to call Congress!\nhttps://t.co/OSOBYMS5gj"]["Wisconsinites are calling to urge for a bipartisan path forward. Yet, partisan politicians have blocked our efforts. https://t.co/DEzZmhMc9t"]["🚨 Senate Republicans are forcing a vote on the #GrahamCassidy repeal! Hit the phones and make your voice heard! 🚨 https://t.co/syBWWLjpbg"]["Another big source of frustration: The idea that weakening pre-existing condition protections is in any way OK. It’s not. #GrahamCassidy"]["What I’m hearing from Wisconsinites on #GrahamCassidy is pretty clear: We thought we were done with heartless, partisan repeal plans."]["My phone is ringing off the hook with calls about #GrahamCassidy today. Keep it up and make sure you call my colleagues too! 📞: 202-224-3121 https://t.co/cwraw01vsy"]["A must watch. #GrahamCassidy fails the @jimmykimmel test. We all must speak out and stop this partisan repeal plan. https://t.co/NfiUxJWxnC"]["We can’t let this happen. The Senate GOP is trying take people's care away. Don't let them! (202) 224-3121"]["We shouldn’t allow insurance companies to charge higher costs if you have a pre-existing condition."]["#GrahamCassidy dramatically weakens the guaranteed protections for people with pre-existing conditions."]["This is why I need you to join our effort to stop the partisan #GrahamCassidy repeal plan. WATCH: https://t.co/tWStCcYVEe"]["I've called for a Senate hearing on the #Equifax breach and I'm supporting these federal actions because this failure demands answers. https://t.co/SmgYlSGh8L"]["A big shoutout to the kids of Algoma who drive their wellness program. You earned this @RWJF #CultureofHealthPrize! https://t.co/st0Eb0NtSs"]["So proud of these Wisconsinites in Algoma! #CultureofHealthPrize https://t.co/kCqE9fFO7S"]["The #AgeTax.\nPre-existing condition protections. \nThe Jimmy Kimmel test.\nPick your reason for fighting the repeal plan &amp; call Congress!"]["HAPPENING NOW: I'm speaking on the Senate floor about #GrahamCassidy. Let's make things better, not worse. https://t.co/2Cuhvsk1ME"]["Our bipartisan legislation will extend this program so students can continue to pursue #HigherEdNotDebt. https://t.co/Mhv0hhTaAI"]["I'm fighting to protect the critical Perkins Loan Program that has helped so many students build a path to the middle class."]["#GrahamCassidy is just another repeal plan to make things worse with more uninsured Americans and higher health costs."]["Dreamers: If your DACA protection expires before March 5, 2018, you must renew before October 5, 2017. https://t.co/P7drodfzNX"]["Happy 70th Birthday, @usairforce! Thank you to all of our brave airmen who work to keep us safe. #AFBday https://t.co/FKT9Gh4Fjx"]["🏈🧀 The Pack is back in Atlanta for a rematch, @AtlantaFalcons! Let's go @packers!! #GBvsATL #GoPackGo https://t.co/rO5tBYoN1n"]["The Perkins Loan Program is worth fighting for. I urge my Senate colleagues to join us in this bipartisan effort. https://t.co/YHxJjJMDTU"]["The Trump Admin is creating chaos &amp; making it harder for rural Wisconsinites to get health coverage. It's not right. https://t.co/BqCcJoZn40"][".@BadgerFootball is on the road this week taking on @BYUfootball. Good luck Badgers! We'll be cheering for you back home! #OnWisconsin"]["For generations, the Perkins Loans Program has helped students receive #HigherEdNotDebt. I'll fight to protect it. https://t.co/Mhv0hhTaAI"]["#ICYMI, I was on @1a this week talking about the #Equifax breach. Americans deserve answers. Listen here: https://t.co/hNkpndTvF4"]["@karenlynnn @karenlynnn, please have them contact my office in Wisconsin at 608-264-5338."]["Always great to talk with the @WIFarmBureau. I'm proud to represent Wisconsin's hardworking farmers in the U.S. Senate. https://t.co/uUEiZy6qIz"]["Met with 3 courageous Dreamers. Thank you Valeria, Karen &amp; Yesenia for sharing your stories with me. We must act and pass the #DreamAct."]["On #POWMIARecognitionDay, we honor and remember those who have gone missing or captured while serving our great nation. #YouAreNotForgotten https://t.co/isgKjjWxf6"]["As #NDAA moves forward, I'll continue to push for my #BuyAmerica amendment that respects and rewards our workers and military."]["@SenJeffMerkley Now, @realDonaldTrump, let's get this done. Call on the Senate GOP to help us pass the #BuyAmerica #NDAA amendment!"]["Thanks for joining the fight, @SenJeffMerkley! Let's put people to work &amp; provide our military with equipment that is #MadeInAmerica. #NDAA https://t.co/lAg245LBU7"]["It’s past time to close the #CarriedInterest tax loophole and put more money into the pockets of everyday hardworking people! https://t.co/NiWDudZdgL"]["On @1a this week to talk about the massive #Equifax data breach and my call for a Senate hearing. Listen here:\nhttps://t.co/hNkpndTvF4"]["I have legislation to close the #CarriedInterest tax loophole. Let's act on it, @realDonaldTrump. https://t.co/BvkPzdrKru"]["Access to opioid addiction treatment is still a major hurdle for our rural communities. We must keep up the fight! https://t.co/ZEbydjSjwr"]["My message to President Trump on tax reform: Keep your pledge &amp; close the #CarriedInterest tax loophole. https://t.co/9hmuzuOnQV"]["President Trump promised to close the #CarriedInterest tax loophole for hedge fund managers on Wall Street, but has yet to act."]["Tax reform should reduce taxes on small businesses and cut taxes on working class Americans, so people can keep more of what they earn."]["Tax reform cannot leave working families behind – it needs to help them get ahead."]["Thank you @NFUDC &amp; @wifarmersunion for my 9th Golden Triangle Award! It's an honor to represent Wisconsin’s farmers. https://t.co/hyzuBDHRA9"]["Speaking on the Senate floor to urge for bipartisan support and a vote on my #BuyAmerica amendment to #NDAA. WATCH: https://t.co/u8n776e1YI"]["Great to have @wifarmersunion President Darin Von Ruden join me at the #SenateRuralSummit today! https://t.co/yPjyXAOgip"]["Dreamers: If your DACA protection expires before March 5, 2018, you must renew before October 5, 2017. https://t.co/P7drodfzNX"]["Hey @realDonaldTrump, let's get the job done. Urge GOP Senators to support my Buy America NDAA amendment. https://t.co/PFHR9GZF8r"]["President Trump and I agree on Buy America policies that support our #MadeInWI manufacturers and workers."]["On @MSNBC right now to talk about the troubling #Equifax breach. American consumers deserve answers."]["Every American should have affordable care. Let's reach that goal. I'm cosponsoring @SenSanders' Medicare for All. \nhttps://t.co/IWH9jbPlLd"]["I've called for a hearing on the #Equifax breach because I want answers from their execs, especially on this:\nhttps://t.co/7c6Zqk1iRK"]["#ICYMI: I announced new legislation to support our hardworking Wisconsin workers and create shared prosperity. https://t.co/nqtcCJ9GRg"]["@POTUS Communities on the frontlines of the opioid crisis deserve action, resources and support from Washington - not just talk."]["@POTUS Today, I'm calling President Trump to take immediate action on the opioid crisis. https://t.co/sf2pNafmOH"]["The opioid epidemic is devastating families &amp; communities across America. @POTUS said he'd declare a state of emergency, but has yet to act."]["Today we come together to honor those we lost on #September11th and thank our first responders who saved lives that day. #NeverForget https://t.co/tVq0zD5xbV"]["🧀 The Pack is finally back! 🧀 Let’s start of the season with a win! #GoPackGo"]["This is the story of Brokaw, Wisconsin.\nRead it.\nShare it.\nAnd fight to make sure hedge funds can't do this again.\nhttps://t.co/2xuv77YFjd"]["Consumers deserve answers about the actions of #Equifax executives before this breach was made public. https://t.co/KgRe9qhno3"]["Great to dish up some #MealsOnWheels at the mobile Timber Grill on Moose Lake! Some incredible hardworking folks. https://t.co/f5G4XeU70q"]["If company executives acted to profit off this failure, that is simply wrong. #Equifax https://t.co/VCbx8wvNAR"]["Saturday mornings are always better with some @BadgerFootball! On Wisconsin! https://t.co/7uDv57slkl"]["In Oconomowoc yesterday to introduce the Worker Owned Wealth Act at employee-owned @SentryEquipment. #MadeInWI\nhttps://t.co/A7BhCzBztV"]["My Worker Owned Wealth Act encourages more workers to establish and expand the employee-owned stakes in their companies. https://t.co/EO7ivmTpYo"]["Wisconsin has a rich history of employee-owned businesses. At @SentryEquipment, you see exactly why we should promote #EmployeeOwnership. https://t.co/dwdeKEp7Uv"]["Thank you for your insight, @JosephBlasi! The Worker Owned Wealth Act will help workers in Wisconsin and across the country. https://t.co/d9w78ndfpT"]["My Worker Owned Wealth Act would boost employee ownership, giving workers a seat at the table. https://t.co/3pRBas5ZGp"]["In Oconomowoc today to tour @SentryEquipment and announce my new legislation to support Wisconsin workers. https://t.co/rnDsLTbZjJ"]["Americans deserve answers about this breach and the actions of #Equifax execs before this breach was made public. https://t.co/hzjj7xYroK https://t.co/CmFn2NPlWH"]["My bipartisan #BrokawAct will rewrite the rules for Wall Street so our economy starts working for Main Street. \nhttps://t.co/WMSJgmxEph"]["At health care hearing, joining a bipartisan group of governors to discuss stabilizing the market &amp; lowering costs. https://t.co/9sVxEP2Npm"]["Nice to chat with @PresLovell today. Best of luck on the new @MarquetteU school year! #BeTheDifference https://t.co/hWcV2cnXVd"]["Met with the Wisconsin Center for Manufacturing &amp; Productivity today to talk about strengthening our #MadeInWI economy. https://t.co/GOvlXUAH02"]["Met with the @TheWaterCouncil today! Always great to chat with @DeanAmhaus, @rmeeusen, @PresLovell &amp; Ajita Rajendra of @AOSmithHotWater. https://t.co/djKrKiPdcd"]["Our bipartisan hearings will be an opportunity to work across party lines and stop the political games being played by the White House."]["However, the Trump Admin continues to play dangerous political games that create uncertainty, destabilize the market and raise costs."]["I strongly believe that if both parties look past the partisan debate in Washington, we can find common ground."]["The people of Wisconsin have sent a clear message that they want us to work across party lines to make things better, not worse."]["Speaking now at the bipartisan health care hearing on how we can stabilize the market and make care more affordable. https://t.co/jMhE2AGY0u"]["Looking forward these bipartisan hearings to stabilize the health insurance market, reduce costs &amp; increase coverage https://t.co/KNxNMPv6AV"]["Zoe and her mom shared their story earlier this year about why we need to protect pre-existing condition coverage. https://t.co/csbCGBIa6C"]["Happy first day of school to Zoe in Seymour! I'm thinking of her as I join the first bipartisan Senate health care hearing today. https://t.co/tyXBhmWzo7"]["So happy to help Mandy, her family and friends. Very relieved that they’re all home safe in Wisconsin. https://t.co/qD2cWiMHNR"]["I stand with Dreamers. My full statement on President Trump's announcement to end the #DACA program: https://t.co/DeZdElKeg7"]["I support the bipartisan Dream Act to protect Dreamers and provide them a chance to continue helping us build a stronger country."]["This move by the President is wrong. It tears families apart and prevents Dreamers from reaching their full potential. #DefendDACA"]["Wisconsin is known across the world for our work ethic that is second-to-none. Happy Labor Day to every Wisconsin worker! #MadeInWI https://t.co/cFI9G0Lskx"]["The #BrokawAct is about rewriting the rules for Wall Street to even the playing field for Main Street. https://t.co/oz89gf9j3G"]["My new tax reform legislation will encourage manufacturers to invest in R&amp;D and drive economic growth.\nhttps://t.co/0bA97WYxWY"]["Senator Baldwin Reintroduces the #BrokawAct - @WSAW https://t.co/xHc63iuDZO"]["On my tour of FeraDyne, I saw firsthand how my 21st Century Manufacturing Act can help #MadeInWI manufacturers grow. https://t.co/zSXYQTSzsk"]["To @POTUS: We should be working across party lines to stabilize the health insurance market, not sabotaging it. https://t.co/tGJXxuJaUR"]["This week, I was in Brokaw to announce the bipartisan #BrokawAct to strengthen oversight of predatory hedge funds. https://t.co/WL8YxisRNC"]["Today kicks-off the 100th year of football at Camp Randall Stadium! What's your favorite memory? #CampRandall100 #OnWisconsin https://t.co/CMHvd1KHfQ"]["It's game day #Badgers!! Who's excited for another great season?! #OnWisconsin 🏈🏈"]["Please let your voice be heard. We must stand with #DREAMers and #DefendDACA."]["Together, we can rewrite the rules for Wall Street to even the playing field for our #MadeInWI Main Street economy. #BrokawAct https://t.co/l0KEBnYPP7"]["Learn how the bipartisan #BrokawAct increases transparency &amp; strengthens oversight of predatory hedge funds here: https://t.co/wUr7OGFDgc"]["The #BrokawAct is about standing up for these Wisconsinites who will never give up. I'll keep fighting for them. https://t.co/Slz6h1w0aE"]["When I heard about workers in Brokaw who lost their jobs because of a predatory hedge fund, I had to take action.\nhttps://t.co/Y6I5UP5dd1"]["In Brokaw today to announce the introduction of the bipartisan #BrokawAct to help protect Main Street from Wall Street hedge funds. https://t.co/8k68NTF6Sc"]["I’ll keep fighting for rural development funding to help our rural communities and small towns move forward. https://t.co/GQK0Gy8mJT"]["I successfully fought against drastic cuts to the USDA Rural Development program. We can’t leave our rural communities behind. https://t.co/vxEiO34Lan"]["In Spooner today talking rural development with local leaders and representatives from @NWRPCWI and @USDA. https://t.co/A7CmV3NIFE"]["Thank you to everyone at the Timber Grill for letting me help out today. You're doing great work! https://t.co/z62BLIvgeG"]["The Sawyer County Resource Center helps provide assistance to older Wisconsinites, including fresh meals and free health screenings. https://t.co/qGKfPoJqsV"]["I'm fighting to protect federal @_MealsOnWheels investments for Wisconsinites like Waldo and so many others in rural communities. https://t.co/td6kLrhYQc"]["Toured FeraDyne's engineering department and tried out one of their newest crossbows! 🎯 https://t.co/9QglHl2Yw8"]["FeraDyne has invested in R&amp;D to produce new bowfishing gear. This one looks like a perfect match for Asian carp if you ask me. https://t.co/O7JdWBqxuW"]["My 21st Century Manufacturing Act will provide tax relief for innovative #MadeInWI manufacturers like FeraDyne. https://t.co/l7IDwZQvkw"]["At FeraDyne in Superior to see firsthand how #MadeInWI manufacturers are innovating and creating jobs. https://t.co/IjzG725Jbr"]["In Superior today to tour FeraDyne Outdoors, an innovative #MadeInWI manufacturer of archery equipment.\nhttps://t.co/OXPGwvj1Ae"]["Fascinating history lesson digging through the archives at La Pointe Town Hall. Big thanks to Waggie Erickson for showing me around! https://t.co/nmBNYtkMiI"]["Swung by the Madeline Island Farmers Market and came across a couple deer. See if you can spot the second one! 🦌 https://t.co/ADtG72dtMN"]["Took the Bayfield over to my favorite place on earth: Madeline Island. Great to spend time on the Apostle Islands this summer. https://t.co/DTcEySkpWy"]["Must watch: See how Phillips rebounded after a plant closure. Now, we're coming back stronger than ever. 💪 #MadeInWI\nhttps://t.co/YlTvN3h73Z"]["This week, throughout #Milwaukee, we are commemorating the 50 year anniversary of the Open Housing Marches across the city. https://t.co/n7LIaSgfL1"]["If you know anyone in danger or in need of help in Texas, please go to https://t.co/RanoFwaGXt"]["Heartbroken by the tragic loss seen in Texas, but inspired by the countless acts of heroism in response to #HurricaneHarvey. #HoustonStrong"]["#WomensEqualityDay is a celebration of our Wisconsin values. Forever proud to hail from the first state to ratify the #19thAmendment. https://t.co/UJoufU4D3H"]["Banning Americans who want to serve our country is wrong, @realDonaldTrump. \nI stand with our transgender servicemembers who fight for us. https://t.co/EGPiXwZWyq"]["There is still much more work to be done. I know that together, we can continue to make progress and save lives."]["Exactly one year ago, I sat down with local leaders in Ashland to discuss the opioid epidemic. Today, I heard an update at NorthLakes. https://t.co/H0SKUVCazA"]["NorthLakes has already done so much to combat the opioid epidemic. I look forward to seeing what they can accomplish with this expansion!"]["This funding will help expand NorthLakes Community Clinic in Ashland and increase their efforts to combat the opioid epidemic in Wisconsin. https://t.co/ebQxXCWaz8"]["The opioid crisis is a national emergency. One that demands action, not just words.\nhttps://t.co/UxI1Lk9Oa9"]["Together, by supporting workforce development, we can help our manufacturers continue to grow and drive our #MadeInWI economy forward. https://t.co/dFFnRdnzMH"]["In Tomahawk yesterday to visit Samuel Pressure Vessel Group for a tour and discussion on how to strengthen our #MadeInWI manufacturers. https://t.co/w6hwRCOBss"]["This is welcome news for Wisconsin veterans who are waiting too long –sometimes years– to hear back on their appeal. https://t.co/6egK1mJujl"]["Pleased to see our bipartisan Veterans Appeals Improvement &amp; Modernization Act signed into law to help fix VA's broken appeals process. https://t.co/q1d6pcencL"]["As co-chair of the bipartisan Senate #CareerTechEd Caucus, I'm working across party lines to promote workforce development and job training. https://t.co/86gqUVl7Tq"][".@GulfstreamAero's Student Leadership program helps Appleton students learn about the skills needed to drive our #MadeInWI economy forward. https://t.co/TqlJd5O73T"]["Toured @GulfstreamAero in Appleton today to see how #MadeInWI manufacturing is helping Fox Valley continue to grow. https://t.co/3bZSBgcPD2"]["Aboard one of the shipyard's newest projects, a #MadeInWI articulated tug-barge unit (ATB). https://t.co/LBZ0cQALA8"]["Great to tour Fincantieri Bay Shipbuilding in #SturgeonBay again today! Wisconsin's shipbuilders are a pillar of our #MadeInWI economy. https://t.co/fKpk8mPdDp"]["Honored to receive the Great Lakes Maritime Task Force’s Legislator of the Year award! Proud to fight for our #GreatLakes! https://t.co/DRlFELaK7X"][".@POTUS must keep his promise to close the #CarriedInterest tax loophole. I have legislation, so let’s get it done. https://t.co/moaGpHjYiL https://t.co/W9ZKj95YQo"]["My heart goes out to our @USNavy sailors of the #USSJohnSMcCain and their families as search efforts continue."]["Our bipartisan reform to overhaul the VA appeals process has passed Congress and is ready to be signed into law. https://t.co/xPFkkgrCbg"]["Had a great visit to @wrtpbigstep in #Milwaukee this month to see #CDBG job training investments at work. https://t.co/sLy0qn6xiI"]["It's critical that the Trump Administration and @HHSGov protects people from discrimination. I want answers. https://t.co/UyVo3uOQtr"]["Watching the @packers, reminiscing of when @SenatorHeitkamp and I saw a 38-10 #GBvsWAS blowout in person. #GoPackGo https://t.co/k2HuNrlnx2"]["🧀 @Packers kickoff in an hour! Are you ready, Wisconsin? 🧀 #GoPackGo https://t.co/OQsYboQ8ID"]["The terror attacks in Barcelona and Cambrils must be met with all freedom-loving people standing together as one."]["Thank you all for the support. It means so much to me. \nI’ll carry my mother's kind soul forever in my heart.\nhttps://t.co/ZmF5IohViP"]["People are looking for moral clarity and leadership from President Trump. He has clearly failed the moral test of seeing right from wrong."]["@wistatefair For me, it has to be helping make this batch of world famous #WIStateFair cream puffs! Thanks, @ocpbakers! https://t.co/IkE2Igfe8F"]["Another amazing @wistatefair is in the books! What is your top #WIStateFair highlight for this year? https://t.co/OiHJsIgrrq"]["For 82 years, Social Security has helped provide economic security for millions of Americans. This is a promise that must be kept. #SocSec82 https://t.co/eekm4CKb9Y"]["@makerMKE High five to a great new school year! 🍎 https://t.co/2kXfKmFSnP"]["Who needs filters when you have @makerMKE's camera obscura! Cool way to get young Wisconsinites interested in #STEM for the new year. https://t.co/6JJdABpwsg"]["Stopped by the 23rd annual Martin Luther King Jr. Back to School Festival in #Milwaukee this weekend! These kids are my #MondayMotivation! https://t.co/RFtKqbvvVo"]["Racism, hatred, and violence have no place in America. Concerned and disgusted by the events in #Charlottesville. https://t.co/pEJ1FAbbC7"]["Happy 98th birthday, @packers! Good win last night, looking forward to another great season! #GoPackGo https://t.co/XrB5XHvvHK"]["A special thank you to Lu, who started this farm with her husband Phil, and makes some delicious farm fresh cream puffs! https://t.co/OBHNd6i3TS"]["Thank you to everyone who participated in our discussion today and to the Forrest family for showing me around your farm! https://t.co/cxLtwbfr4R"]["We aren’t called America’s Dairyland for nothing! Our dairy farmers are the backbone of our rural communities and our economy. https://t.co/eIkqV9eRc5"]["At Maple Ridge Dairy in Stratford to meet with some hardworking Wisconsin dairy farmers! https://t.co/BT88DfFK5x"]["Thanks @FollowMSTC for a great discussion about how apprenticeships can help grow our #MadeInWI economy! https://t.co/pD4vS21ieG"]["Read more about my legislation to boost apprenticeships here:  https://t.co/WDziwZ92EI"]["Strengthening our local public-private partnerships will help create a #MadeInWI economy built to last."]["That is why I'm announcing the PARTNERS Act today! New legislation to boost workforce readiness by expanding apprenticeship programs."]["Today, I’m at Mid-State Tech in Wisconsin Rapids seeing how students are gaining the skills they need to succeed. https://t.co/O01FBZf4Yx"]["On Monday, I was in Milwaukee to hear from apprentices about the new opportunities ahead for them. https://t.co/BkK7Jnla19"]["Traveling Wisconsin, I've seen firsthand how public-private partnerships for apprenticeships can address our workforce readiness challenges."]["At Mid-State Technical College in Wisconsin Rapids today to highlight their impressive apprenticeship programs! https://t.co/KFfhxGGrJu"]["In Chippewa Falls to celebrate 150 years of a great #MadeInWI beer, @Leinenkugels! https://t.co/puOBnJrtef"]["Where are you celebrating #FarmersMarketWeek, Wisconsin? 🌽🍅🥦🍎 https://t.co/sA4fYupBBW"]["Congratulations Layne! 🎉🎉 Excited to have you in the Senate Page Program this fall! https://t.co/F4hm5hXKC8"]["I'll continue working across party lines, w/ stakeholders &amp; @forestservice to sustainably manage our forest resources &amp; boost timber economy https://t.co/TkYgUNJqcd"]["In Medford today to discuss the challenges facing our Wisconsin timber economy and how they can be addressed. https://t.co/4WKWpUGv8m"]["Delighted to work with Maine and Brokaw on this critical step forward. Together we can build a stronger future. https://t.co/XgUbptnkdz"]["Meeting with experts and leaders in the Village of Maine today to hear how they plan to use the funding to provide clean drinking water. https://t.co/0S6ABpYnNC"]["On Monday, I was proud to announce a much needed water quality investment in Maine and Brokaw. https://t.co/I27BbY7ULy"]["@SenJohnMcCain We can get more done when we work together. Proud to work with @SenJohnMcCain on bipartisan legislation to take on sky high Rx drugs costs."]["To me, @SenJohnMcCain did the right thing &amp; showed courage on the health care vote. I also agree with his call to work in a bipartisan way."]["Stevens Point’s @TYRILights shows exactly why we need to make tax reform work for #MadeInWI manufacturers. https://t.co/2WARJSM8b9"]["Learn more about my plan to provide tax relief for #MadeInWI manufacturers here: https://t.co/l7IDx086J6"]["That's why I'm introducing a new tax reform that encourages manufacturers all across our state to invest in research and development."]["Today I'm announcing my 21st Century Manufacturing Act - tax reform to create #MadeInWI jobs and promote research and development. https://t.co/dFQg4sbJw0"]["In Stevens Point today to announce new tax reform legislation and tour a #MadeInWI manufacturer, @TYRILights! https://t.co/KE4bluDCuc"]["Great to be at @EdgewoodCollege today to chat with students and @sflanaganec about college affordability. Thanks for sharing your stories! https://t.co/wMKEbdNjBa"]["Happy #NationalFrozenCustardDay! Gotta agree with Bob Uecker, #MadeInWI custard is the best in the world!🍦 https://t.co/mRxE0ZAFhL"]["@USDA This investment will help Brokaw continue recovering and rebuilding, while providing the clean water that our rural communities need. https://t.co/O2zjZqqLZX"]["Proud to help secure over $4 million in @USDA Rural Development funding to overhaul Brokaw's water system. https://t.co/I27BbY7ULy"]["I worked across party lines to reverse POTUS' cuts to the #CDBG program, which funds critical programs at @wrtpbigstep https://t.co/BoqKtYYi9U"]["It was great to be in #Milwaukee yesterday to tour @wrtpbigstep and see #CDBG investments in workforce development &amp; job training. https://t.co/SDRJKSNRNX"]["Pleased to announce a much needed investment to improve the drinking water quality in Brokaw and Maine. https://t.co/RvdSAx6XYp"]["This #PurpleHeartDay, and every day, we honor the brave men and women who have sacrificed so much for the country we all love. https://t.co/XLff0EdvAb"]["@USACEHQ The release of the Brandon Road Study is a crucial step towards preventing Asian carp from reaching the #GreatLakes. https://t.co/kP8782ivtI"]["After months of delay by the Trump Administration, @USACEHQ finally released a study to stop the spread of Asian carp. #StopAsianCarpNow"]["I've been sounding the alarm on the threat Asian carp pose to our #GreatLakes, our quality of life in Wisconsin and our freshwater economy."]["Our #MedicareAt55 Act offers a choice for people ages 55-64 to buy more affordable, quality health care coverage. https://t.co/yOfh9wCjwo"]["I worked across party lines to reverse POTUS' elimination of #CDBG funding. We should invest in great community programs like @wrtpbigstep. https://t.co/6sjE7tMjMp"]["What I've seen at @wrtpbigstep shows that #CDBG funding helps train #Milwaukee's workforce. https://t.co/sH0ZKDIuDC"]["POTUS' budget would have completely eliminated the #CDBG program, leaving communities and programs like @wrtpbigstep behind."]["Great to be in Milwaukee today touring @wrtpbigstep to learn more about their #CDBG workforce development initiatives. https://t.co/jMZX2Tm2yc"]["@SenStabenow @SenSherrodBrown Our legislation offers a choice for millions of older Americans to buy more affordable, quality health care coverage. #MedicareAt55"]["It’s time Washington put American manufacturers and workers first, ahead of powerful special interests. https://t.co/pn0f2KbOqB"]["Agreed, @efranzen1. Wisconsinites deserve answers.\nhttps://t.co/8JYg0fjaIw"]["I delivered the Democratic Weekly Address this week to highlight #ABetterDeal on Jobs and Trade, and strong #BuyAmerica reforms. https://t.co/u3mY18nYaS"]["As we look to the future, let's be inspired by the strength we gain every day by standing together. #RememberOakCreek"]["I'm also incredibly proud of our Sikh community. Their grace and hopeful message of peace moved an entire nation. #RememberOakCreek"]["As I reflect upon that day, I’d like to once again thank our local law enforcement. Their actions were truly heroic. #RememberOakCreek"]["Today, we join together as one community on the 5 year anniversary of the horrific attack on the Sikh Temple of Wisconsin. #RememberOakCreek https://t.co/fh4jnesTx6"]["Our #MedicareAt55 legislation offers a choice for millions of Americans to buy more affordable, quality health care coverage."]["Wisconsinites have sent a clear message to Washington that they want us to work to make health care more affordable. #MedicareAt55"]["I’ve introduced legislation to give Wisconsinites the choice to buy into #MedicareAt55 https://t.co/469mvwpdvg https://t.co/lmXx5GdAgV"][".@OSHA_DOL's inaction is extremely troubling. I am demanding answers. https://t.co/6ITEvLiILA"]["#ABetterDeal includes strong #BuyAmerica reforms so we can put people to work rebuilding our infrastructure with the words #MadeInAmerica. https://t.co/AtZdcw8Le9"]["#ICYMI, I chatted with @MSNBC's @AliVelshi on strengthening our health care system. Watch here: https://t.co/yZDz1dhSja"]["Today is opening day of @wistatefair! Who is ready for some cream puffs?! #WIStateFair\n📷: @ocpbakers https://t.co/MgobPovyuj"]["Congratulations to former Wisconsin Congressman, and friend, @AmbassadorGreen on being unanimously confirmed by the Senate to lead @USAID!"]["@realDonaldTrump @WhiteHouse America's workers can't afford to be left behind. It's time for leadership on this #BuyAmerica legislation. It's time to act."]["@realDonaldTrump But yesterday, the @WhiteHouse would not say if President Trump would push for action on my #BuyAmerica reform that he said he supports. https://t.co/3lgjjKLkuk"]["Back in April, @realDonaldTrump said he supported my #BuyAmerica legislation. https://t.co/pN5ZX0o6cv"]["Yesterday, we unveiled #ABetterDeal on Trade and Jobs. A major part of this proposal: Strong #BuyAmerica reforms. https://t.co/oUqOxcSJKj https://t.co/k7d8d7by1R"]["I'm for #ABetterDeal on trade and jobs that includes a strong #BuyAmerica commitment to Wisconsin workers. #MadeInWI https://t.co/oxptoE7OZb https://t.co/MSFMyX3smD"]["President Trump's budget cut funding for rural airports. I worked across party lines to protect them. https://t.co/ctIFy9RjUQ"]["Be sure to catch me this afternoon on @MSNBC talking to @AliVelshi about #ABetterDeal and #BuyAmerica!"]["@SenAlexander @PattyMurray I'm looking forward to working across party lines in the Health Committee on solutions that work for Americans. https://t.co/cmsfGc7abh"]["@SenAlexander @PattyMurray Instead of sabotaging the health care market, let’s stabilize it with cost-sharing reduction payments that lower costs."]["@SenAlexander @PattyMurray The people of Wisconsin have sent a clear message that they want us to work together to make things better, not worse."][".@SenAlexander &amp; @PattyMurray are bringing us together to work on stabilizing the market and lowering health care costs. Count me in."]["Let’s get the job done on strong #BuyAmerica reforms, putting people to work rebuilding our infrastructure with the words #MadeInAmerica. https://t.co/VK7OlbiJPl"]["#ABetterDeal on Trade and Jobs puts American manufacturers and workers first, ahead of powerful special interests."]["LIVE: Watch as we unveil a #ABetterDeal on Trade and Jobs. https://t.co/SmOTGJLzBk"]["#ABetterDeal on trade means a strong #BuyAmerica commitment to Wisconsin workers. #MadeInWI\nhttps://t.co/BR0DJu0ALh"]["Today, we're unveiling #ABetterDeal on Trade and Jobs. Watch LIVE at 10:30 AM CT: https://t.co/krl66rOAM8"][".@wistatefair opens on Thursday! Have you seen this year's new food list? #WIStateFair https://t.co/YcfY99uNKs"]["Washington must respect the hard work of American workers &amp; make sure the #PensionPromises made to them are kept. https://t.co/aIIvyUfzNW"]["President Trump's refusal to make critical cost-sharing payments is sabotaging our health care system, creating chaos &amp; increasing costs. https://t.co/ZSdPA1kmGi"]["It's time to work together on improving our health care system, not sabotage it. Check out my chat with @AriMelber → https://t.co/I4UCHPDhgH"]["I’m proud to work alongside the Wisconsin Committee to Protect Pensions to keep #PensionPromises. https://t.co/aIIvyUfzNW"]["\"Jason's pushing us to keep this going and you know, we'll never forget,\" Jason's father Marv Simcakoski said. https://t.co/98jEcq0Llo"]["See more here: https://t.co/gCXTdn64nQ"]["27% of Wisconsin’s public roads are in poor condition. I'll continue to fight for stronger federal investments in our infrastructure."]["As Wisconsin faces a transportation crisis, I'm working across party lines to protect federal investments in our state's infrastructure."]["The Simcakoski family turned their tragedy into hope. Proud to work with them on reforms to improve care for our veterans. https://t.co/j40XDkAUUQ"]["Now, we’ll continue to push for more progress to make sure our veterans get they quality care they have earned and deserve. https://t.co/Mb9Xr52Akq"]["Since then, our reforms have increased oversight of opioid prescribing practices and pain management at the VA. https://t.co/o4cu80YzeI"]["One year ago, this bipartisan legislation - the Jason Simcakoski Memorial and Promise Act - was signed into law. https://t.co/UBd98sQ7C7"]["This weekend, I joined Marv &amp; Linda Simcakoski for an update on how our reforms named after their son Jason are improving veterans' care. https://t.co/qVk1kAzoJX"]["@SenateMajLdr @SenJohnMcCain Read more about our FAIR Drug Pricing Act here: https://t.co/LMOfKzwrAH"][".@SenateMajLdr said he wanted to hear ideas on improving health care. @SenJohnMcCain &amp; I have legislation to take on rising Rx drug costs."]["Now is the time to work together to stabilize the health insurance market, make health care more affordable &amp; take on rising Rx drug costs."]["The message from Wisconsinites is clear: Work across party lines to make things better, not worse."]["I joined R's and D'S to vote no because the people of Wisconsin did not send me to Washington to take people’s health care away."]["Thank you Wisconsin for speaking out and sharing your stories. YOU are the reason that the #SkinnyRepeal was defeated last night."]["I joined Republicans and Democrats to vote against the health care repeal bill last night. This is why: https://t.co/wgefWO2nXB"]["#SkinnyRepeal is Washington talk for more uninsured, rising premiums, and higher out of pocket costs. I'm voting no for Wisconsin."]["When #AmericaSpeaksOut, we can defeat this repeal effort. Join Anna and make your voice heard today!"]["Today I met Anna, a Wisconsinite who is worried about what will happen to the care she has today if the Senate passes a repeal plan. https://t.co/OkzrvNXjZk"]["Great to meet young Wisconsin leaders from @ALAforVeterans' #ALAGirlsNation17 and @AmericanLegion's #2017BoysNation. https://t.co/txnXexse2f"]["This is wrong. We should be working to make health care better and more affordable, not worse and more expensive."]["No matter what version you look at, Congressional Republicans are proposing higher costs and more uninsured Americans."]["There are only hours left of debate on the Senate floor. We can't let up! Don't leave anything on the table. Make your voice heard!"]["For months, I've heard Wisconsinites speak out and share their health care stories. Today, we need to keep up the fight!"]["It's not just tweets. This Administration is taking a formal, official stance against the rights of LGBT Americans. https://t.co/Qy3Ifalx0F"]["Happening now on the Senate floor:\nI just voted NO on #RepealAndRun. \nI just voted YES to protect Medicaid."]["I've been proud to stand with @AARPwi and older Wisconsinites across the state as we fight against this repeal plan's #AgeTax! https://t.co/yIGLszAf4t"]["Let’s work to stabilize the market, make health care more affordable and take on drug corporations' rising prescription costs."]["We should be working together to make things better, not worse."]["The people of Wisconsin did not send me to Washington to take people's health care away."]["To those transgender Americans currently in the U.S. military, thank you. Your service strengthens our military and our nation."]["I stand with military leaders who support moving in the right direction. We shouldn't discriminate against anyone who wants to serve."]["A ban against any patriotic American who wants to serve our country is wrong."]["On top of that, it'll destabilize the health insurance market and could cause premiums to skyrocket."]["It'll stick people with junk insurance and bare bones coverage that does not include the guaranteed protections people have today."]["The Cruz plan will raise costs even more for people with pre-existing conditions."]["Do you remember the Cruz plan? It will make bad legislation even worse."]["Your stories, your voices drive this fight. Together, we can defeat this effort to take health care away from millions of Americans."]["It’s also personal for every Wisconsinite. I’ve heard from families across the state about why they are fighting against this repeal. https://t.co/NdSmcyfgK5"]["For me, this is personal. When I was little, I had a childhood illness and was branded as a child with a pre-existing condition. https://t.co/F6AjSHb4lS"]["I want you to know I’m fighting. And I hope you'll continue fighting too. #AmericaSpeaksOut"]["LIVE on the steps of the Capitol right now to speak out and share the stories of Wisconsinites. https://t.co/AzMgkhg03X"]["Right now, the Senate is voting to move forward on partisan health care repeal that will make things worse, not better. I'm voting no."]["It’s time that we work together to do the job that the American people sent us here to do."]["It’s time to stop the partisan nonsense. The people of Wisconsin did not send me to Washington to take people’s health care away."]["This fight is about Wisconsin families like Zoe’s and Kyle’s. Let’s #KeepKidsCovered!"]["Zoe's mom said \"to me, it’s like they’re taking the American Dream from her.\"\nThat's not right and I won't stand for it."]["And then there is Zoe in Seymour. She was born with congenital heart defect. Her parents are scared this repeal plan will make things worse. https://t.co/98Z2vwU4L4"]["Thanks to Medicaid, Kyle was able to live at home, have an education, get a driver’s license and now he’s attending college!"]["Mary from Kenosha told me about her son Kyle, who has autism and was never expected to learn to speak."]["Jean from Baraboo told me she’s scared because her Chron’s disease would cost her a fortune if her pre-existing conditions weren't covered."]["Wisconsinites are speaking out because health care is deeply personal."]["Americans want us to work together to lower costs. No one wants a partisan plan that takes people’s health care away."]["They don’t want loved ones who depend on #Medicaid for nursing home care to have their care put at risk with caps &amp; cuts. #DontCapMyCare"]["And they don’t want bare bones insurance that doesn’t cover essential services they need."]["People with pre-existing conditions don’t want to be thrown into a high-risk pool or priced out of the coverage they have today."]["People don't want higher costs for less care."]["Tonight, I rise to share the message Wisconsinites are sending to Washington. Their message is clear:"]["LIVE: On the Senate floor to speak out against the partisan health care repeal effort. Watch here: https://t.co/G50M2IoGrS"]["Today, kicks off @EAA AirVenture in Oshkosh! 🛩  Will you be there? #OSH17"]["Tonight, I'll be speaking on the Senate floor. Wisconsin has sent a clear message to Washington about the GOP's #HealthcareBill. Stay tuned!"]["#ABetterDeal = Better Jobs, Better Wages, Better Future. https://t.co/TpvQtI4WVS"]["The Simcakoski family turned tragedy into hope for veterans and their families. We should all be inspired. https://t.co/Dsx7mQ2hBi"]["Congrats and good luck to the @BGCMilwaukee Davis Dancers! Proud to have you represent #Milwaukee in LA this week! \nhttps://t.co/aDcP5wD7X9"]["One year after VA reforms named in honor of Jason Simcakoksi were signed into law, we're continuing to see progress. https://t.co/Dsx7mQ2hBi"]["Families deserve #ABetterDeal so that Washington works for Wisconsin's working families, not the wealthy and powerful special interests. https://t.co/gIm6ICN22M"]["The @WhiteHouse's #MadeInAmerica Week is over without any action on this strong #BuyAmerica reform. #MadeInWI https://t.co/WhyitVS5ID"]["No matter where children go missing, every tool must be available to help find them and bring them home safely.\nhttps://t.co/zMd3786GXh"]["That's why I've always fought to make sure Wisconsin's aspiring farmers have the support they need to get up and running on their own farms."]["Young farmers like Mary, Dylan and Stacy are going to fuel our Wisconsin economy for years to come."]["Couldn't be prouder of our next generation of Wisconsin farmers! #GrownInWI #WIAg\nhttps://t.co/QOowHQ07ee"]["My favorite vacation spot in the world! Can't wait to visit later this summer. https://t.co/Hf1NJxuIgh"]["Cheers 🍻  to our Wisconsin farmers bringing back a longtime #MadeInWI tradition!\nhttps://t.co/8Y6rtLqGTh"]["This bipartisan reform is what @SenJohnMcCain is all about. Proud to join him in this effort."]["We should expand the national AMBER Alert system to make sure every kid in America is safe.\nhttps://t.co/qo80gWfpG3"]["And when it comes to our rural fire departments - and our hospitals - you bet I fought for these investments."]["In addition to clean water, I fought for these investments to create jobs and grow small businesses in our rural towns."]["This funding has supported more than $428 million worth of rural Wisconsin water and sewer projects!\nhttps://t.co/vTSl2qjoaK"]["This week, I worked across party lines to reverse deep cuts to rural development proposed by President Trump. https://t.co/vjNpG9mzE1 https://t.co/R5oGzOgL1I"]["ICYMI on @NPR's @hereandnow yesterday - a good convo on my #BuyAmerica reform\nhttps://t.co/WhyitW9H7d"]["I worked across party lines to reverse @POTUS' proposed cuts that would've hurt our small towns and rural communities in Wisconsin."]["We should be working to help our rural communities get ahead, not leave them behind. https://t.co/vjNpG9mzE1"]["RELEASE: Senator Baldwin Helps Reverse Deep Budget Cuts to Rural Development https://t.co/vjNpG9mzE1 https://t.co/BUxGdOBDBI"]["Wisconsin needs action from Washington to combat the opioid crisis. The @WhiteHouse's Opioid Commission needs to stop stalling and act now. https://t.co/sIHX0sxrop"]["POTUS is more than half-way through #MadeInAmericaWeek. Calling on him to push for action on my #BuyAmerica reform. https://t.co/mMkZjFFSDn"]["@RepSpeier Proud to help raise awareness for this rare disease and advocate for children like Aiden from Slinger. #TeethAreNotCosmetic #MySmile https://t.co/wk9fmsty2v"]["Excited to be working with @RepSpeier to introduce a bicameral resolution designating this week as National #EctodermalDysplasias Week! https://t.co/czO4cRXzeh"]["We must #ProtectNetNeutrality and keep the internet a place where people can make their voices heard. https://t.co/RRLzlIWlh4"]["Anyone who knows @SenJohnMcCain, knows he is a fighter. My heart and my prayers go out to him and his family."]["A year ago, legislation named in honor of Jason Simcakoski became law. We're continuing to build on our progress. https://t.co/OQrXsQ3WmH"]["The CBO score for repeal-and-delay: Higher costs, less care.\n\nThis will make things worse, not better. I won’t vote for it. https://t.co/8wjP14QPPK"]["I'm working across party lines to protect the passenger train routes that are vital for rural Wisconsin.\nhttps://t.co/rWdPDASilD"]["@NFED_ORG I look forward to continuing working with @NFED_ORG and advocating for children like Aiden. #TeethAreNotCosmetic #MySmile https://t.co/c9SSANZAOD"]["@NFED_ORG I'm introducing a resolution designating this week as National Ectodermal Dysplasias Week to help raise awareness for this rare disease."]["This morning, I met with @NFED_ORG to cheer them on before their first Hill advocacy day to bring awareness to #EctodermalDysplasias. https://t.co/3UmPxy96cY"]["Great to meet with @wicorngrowers today!  Proud to work with you to strengthen our #GrownInWI economy 🌽 https://t.co/dEjaCqIwfz"]["@GirlUp @girlupmhs Thank you for the hard work of our @GirlUp &amp; @girlupmhs for making a difference in the lives of vulnerable women and girls! https://t.co/3MMrNgyIKx"]["@GirlUp @girlupmhs The passion &amp; determination of these students from @GirlUp &amp; @girlupmhs is a true testament to positive change youth can create #GirlsLead17 https://t.co/kIYADWsdjN"]["Today I met with Wisconsin students of the @GirlUp campaign who are advocating for education of refugee girls. #GirlsLead17 CC: @girlupmhs https://t.co/mopGL8OmYp"]["Sen. Baldwin and Rep. Grijalva lead Congress on LGBT Data Inclusion Act - @LGBTWeekly\nhttps://t.co/vKfJqivATG"]["For communities across Wisconsin, the Empire Builder Amtrak line is very much worth fighting for. \nhttps://t.co/rWdPDB9Tdb https://t.co/ZxqBPBWHpL"]["We're making progress on our bipartisan goal for safer and more effective pain management services for our #veterans\nhttps://t.co/OQrXsQ3WmH"]["Rooting for failure isn’t a plan. Wisconsin wants us to work together to make things better, not worse. #ProtectOurCare"]["In Wisconsin, over 118,000 students with special needs rely on Medicaid to be successful. #KeepKidsCovered\nhttps://t.co/KvTgVlIRuU"]["I'll say it again - the people of Wisconsin did not send me to Washington to take kids' health care away. https://t.co/KvTgVlIRuU"]["I’m proud to fight on behalf of our #GreatLakes! Thank you for this award, Lake Michigan Stakeholders. https://t.co/yeM7Yvz8XE"]["Great to meet Wisconsinites from @FACESandVOICES today! Thank you for all your hard work promoting access to treatment &amp; #recovery. https://t.co/h1c4zGABad"]["Pleasure to work with @RepRaulGrijalva in the march towards fairness, freedom &amp; full equality for #LGBT Americans. https://t.co/4Rr6YPvu9Q"]["#LGBT Data Inclusion Act will help ensure policymakers &amp; leaders have the info they need to better serve &amp; advocate for their communities."]["If @POTUS is serious about #MadeInAmericaWeek, he should urge Congressional GOP to act on my #BuyAmerica reform. https://t.co/z6w5vD9AsV"]["Instead of raising costs and making things worse, let’s work together to lower costs and make things better. https://t.co/hr0Bz3fH0i"]["Be sure to tune in to @MSNBC's \"Velshi &amp; Ruhle\" this afternoon to catch me talking to @AliVelshi &amp; @SRuhle about the GOP's #HealthcareBill."]["@oshkoshcorp @UWMadison Wisconsin is the leading paper producer. Our #MadeInWI paper and forest products industries employ more than 64,000 workers. #MadeInAmerica"]["@oshkoshcorp Yesterday, we celebrated #NationalIceCreamDay, but did you know that @UWMadison has their own #MadeInWI ice cream? 🍦 #MadeInAmerica https://t.co/Tx3JqcjsTB"]["@oshkoshcorp We also build ships in WI! Earlier this month, I celebrated our newest #MadeInWI #LittoralCombatShip! #MadeInAmerica https://t.co/4B4Umbj5TO"]["@oshkoshcorp Earlier this year, I visited Neenah to announce my #BuyAmerica legislation. #MadeInWI #MadeInAmerica https://t.co/GvCG1ziJOs"]["@oshkoshcorp Wisconsin is home to the legendary Neenah Foundry, a pillar of our #MadeInWI manufacturing economy. #MadeInAmerica https://t.co/12BxwznZwr"]["@oshkoshcorp Take it from me, America's Dairyland has the hardest working dairy farmers. #MadeInWI #MadeInAmerica 🐄🥛 https://t.co/yqGeDVLDdU"]["Wishing a very happy 100th Anniversary to a proud #MadeInWI company, @oshkoshcorp! #Oshkosh100Strong #MadeInAmerica https://t.co/j0DFaUyIuO"]["Our Wisconsin workers also build engines, motors, ships, and motorcycles. We make things, it’s what we do. #MadeInWI #MadeInAmerica"]["In the Badger State, we have a long tradition of making things – you may have heard of our beer, brats and cheese!  #MadeInWI"]["@POTUS I'm urging @POTUS to call on GOP leaders to move my #BuyAmerica legislation forward. #MadeInAmericaWeek https://t.co/mMkZjFohLP"]["RELEASE: Baldwin calls on @POTUS to Push for Action on #BuyAmerica Legislation During #MadeInAmericaWeek https://t.co/mMkZjFohLP https://t.co/v4ijZnU8qi"]["Working across party lines to support our Wisconsin #veterans.\nhttps://t.co/xaR5nCg3Jq https://t.co/Dd1DbnVKJU"]["Working across party lines to support our Wisconsin #veterans. https://t.co/xaR5nCxF80 https://t.co/VIirIyQy2F"]["Happy #NationalIceCreamDay, Wisconsin! What a great excuse to celebrate #MadeInWI dairy with a sweet treat! 🍦"]["This bipartisan legislation makes important investments to support better care for our Wisconsin #veterans. https://t.co/gxGVvJXIVo"]["Proud to work with Marv and the Simcakoski family on solutions that hold the VA accountable and improve care for our veterans. https://t.co/HkTVlH3Uxg"]["Families like the Warpinski's have sent a clear message and they don’t support making things worse. We have to fight this bill for Steve!"]["Steve and his family have a message: #DontCapMyCare &amp; #KeepKidsCovered!"]["This week, I met Steve and his dad Matt - and his favorite travel buddies, too! https://t.co/nWITm3iRLR"]["ICYMI last night, I was on @wispublictv’s Here &amp; Now to discuss the partisan #HealthcareBill.\nhttps://t.co/e1kVEt9HsG"]["Tune in to @wispublictv at 7:30PM tonight for my interview on Here &amp; Now about the Senate GOP #HealthcareBill. https://t.co/N4fWfRxTED"]["I hope my Republican colleagues are listening to their stories. I am - and I’m fighting for them. #KeepKidsCovered #AmericaSpeaksOut"]["Addie from Whitefish Bay is 1 of over 118,000 students with special needs in Wisconsin schools who rely on Medicaid to be successful. https://t.co/9W1lbqfx7u"]["Adam's mom, Deb, worries the proposed cuts to Medicaid will jeopardize the help her family receives to care for her son. #DontCapMyCare https://t.co/iu3EeKjzJY"]["Steve from Denmark was born with 5 congenital heart defects. His hard working family relied on Medicaid to afford his care. https://t.co/NVGuBqm9Fk"]["I've heard from families who depend on Medicaid for their child's care. This plan cuts and caps Medicaid, putting their care at risk."]["Zoe from Seymour was born with a congenital heart defect. Her family relies on strong, guaranteed pre-existing protections to afford care. https://t.co/2M0fGwUkWI"]["I've heard from families with pre-existing conditions who are scared the protections they have today won't be there tomorrow."]["Folks are speaking out because health care is personal and they want it protected, not taken away. #AmericaSpeaksOut"]["Wisconsin is speaking out. We don't support a plan that makes families pay more for less care and increases the number of people uninsured."]["I'm fighting for kids like Steve. Keep speaking out and sharing your stories! #KeepKidsCovered #ProtectOurCare #AmericaSpeaksOut https://t.co/2hPFKrQNr3"]["Proud to work across party lines to support our family #caregivers. #IHeartCaregivers #CostofCaring https://t.co/FtNy16QpsI"]["@AARPLisa608 Thank YOU for your advocacy on this very important issue!"]["I hope Republicans are hearing these stories and realize that this partisan nonsense over health care needs to stop. https://t.co/9XnREpzFV9"]["The Warpinski family has relied on Medicaid to afford Steve's care -- funding that the GOP wants to cut in their #HealthcareBill."]["Today, I met the Warpinski family from Denmark, WI. Their son Steve was born with 5 congenital heart defects &amp; has had multiple surgeries. https://t.co/7KVGGLkJ78"]["I served as my grandmother's primary caretaker, so I know firsthand the joys &amp; challenges of being a #caregiver. #CostofCaring https://t.co/fTMmUUl3rv"]["Great conversation w/ @SenJoniErnst, @RepDanDonovan &amp; @RepLujanGrisham this AM on the important role #caregivers play &amp; the #CostofCaring. https://t.co/GOj0vAVKIO"]["Great to meet with the passionate Wisconsin students working with @LandOLakesGFC  to #FeedtheWorld. https://t.co/ln2Ep9lbPB"]["Just had a wonderful meeting with this group of @4H Wisconsin students https://t.co/ZSToqkZiZ1"]["Joined @SenatorDurbin in urging the @DEAHQ to lower opioid quotas to combat prescription drug abuse. https://t.co/2vlOziJgRx"]["@FCC The @FCC attack on #NetNeutrality means consumers will lose and big ISPs will win – and could charge more. https://t.co/xdjUkA6Xmo"]["For the #NetNeutrality Day of Action, speak out against the @FCC’s push to put the future of an open internet in the hands of corporations. https://t.co/18cjeem6nP"]["Today, we take a stand for #NetNeutrality. https://t.co/xXGks7kp7c"]["A must read. I'm fighting to protect this family’s care, not repeal it. #ProtectOurCare #KeepKidsCovered https://t.co/9XnREpzFV9"]["Today, my website shows you what the internet could look like without #NetNeutrality. Join the fight! https://t.co/gEzw6NQp9q https://t.co/DWsNJevjNE"]["Whether in Wisconsin or our nation's capital, always great to see the Wisconsin Committee to Protect Pensions! We must keep #PensionPromises https://t.co/RzPmFeRTmy"]["Great to meet with @_ALLRISE_ today! Thank you for all of your hard work helping those struggling with addiction receive treatment. https://t.co/wraJldhQ5n"]["No matter where they go, our #veterans should be able to find the quality health care they need, deserve and earned. https://t.co/dYCpZ50pn3"]["Make no mistake about it. The Cruz plan will make the GOP #HealthcareBill even worse.\nhttps://t.co/zPxIuh47bg https://t.co/A4xCtJ6NSd"]["Keep speaking out. Make your voices heard. Share your stories so we can defeat this repeal plan.\nhttps://t.co/zPxIuh47bg https://t.co/jvC3Z4P68m"]["\"The #HealthcareBill currently in the US Senate is called the Better Care Reconciliation Act, but don't be fooled\" https://t.co/8mZV6D15bb"]["Today I'm saluting Wisconsin dairy farmers who work tirelessly every day to move our #MadeInWI rural economy forward https://t.co/EjhmGVSiCH"]["In America's Dairyland, every day is #CowAppreciationDay! 🐄 ❤️ https://t.co/YMAlc8bLuO"]["My bipartisan Dairy Pride Act is about standing up for Wisconsin's hardworking dairy farmers and #MadeInWI milk. \nhttps://t.co/EjhmGVAHe7"]["Agreed, @ChrisRickertWSJ. Imitation products have gotten away with using Wisconsin dairy’s good name for too long. https://t.co/EjhmGVSiCH"]["It's Wisconsinites like Zoe from Seymour who are fueling my fight against the partisan heath care repeal plan. #ProtectOurCare https://t.co/xZgnfkKlt4"]["When it comes to Wisconsinites' retirement security, you bet I'm outspoken! We must fight to keep #PensionPromises. https://t.co/giNBAHeKv4 https://t.co/uWJhvClF9S"]["Let's rebuild our roads, expand rural broadband and protect access to health care in our rural communities.\nhttps://t.co/qxGMKSfCZR"]["Instead of playing politics with people's care, we should strengthen health care markets &amp; lower costs.\nhttps://t.co/3LPdsmKypX"]["Year after year, Wisconsin has ranked at the bottom in startup activity. This needs to change. #MadeInWI https://t.co/HIz8vQqrb9"]["Heard from entrepreneurs today about how we can help boost our startups and build an innovative #MadeInWI economy. https://t.co/s8jyd3FGJY"]["Great to join the Wisconsin Committee to Protect Pensions today! We must keep the #PensionPromises made to hardworking Wisconsinites. https://t.co/AV8tXwUOp4"]["Heading to Endeavor to join Wisconsin workers and retirees in our fight to make sure #PensionPromises are kept.\nhttps://t.co/giNBAHeKv4"]["These are the Wisconsinites I met today in #Milwaukee. Their stories, their voices muse be heard. #AmericaSpeaksOut #ProtectOurCare https://t.co/8MpgZ1TZLe"]["@LandsEnd .@LandsEnd is a legendary #MadeInWI company. Couldn't be happier they're recommitting to investing in Wisconsin.\nhttps://t.co/v8hmApm9EM"]["Looked through some vintage @LandsEnd catalogues at their headquarters in Dodgeville. https://t.co/EYgonqaHgl"]["Touring a truly innovative #MadeInWI manufacturer today! Great to meet the hardworking Wisconsinites at @PPGOakCreek. https://t.co/Rpe4n8dYCu"]["Thank you @drwisconsin for hosting today as everyone shared their stories on why we must #ProtectOurCare! #AmericaSpeaksOut https://t.co/GbFE0qcN6n"]["I hope Republicans are hearing these stories. I am.\nI'll fight to protect the health care people have today. #AmericaSpeaksOut https://t.co/SdNZLhV8RT"]["The GOP #HealthcareBill would cut and cap Medicaid – putting Wally’s care at risk. We should protect her care, not cut it. #DontCapMyCare https://t.co/j1Km7iDKpr"]["Meet Jesse and his daughter Wally. She has Cerebral Palsy and relies on Medicaid for the care she needs. #KeepKidsCovered https://t.co/hjb93QNoPW"]["Health care is personal for the Wisconsinites I work for, including everyone here today. Washington must #ProtectOurCare - not take it away! https://t.co/iig3yOXqYL"]["In #Milwaukee to listen to Wisconsinites speak out about how the GOP #HealthcareBill will make things worse, not better. #AmericaSpeaksOut https://t.co/K4CQubP3Nr"]["#ICYMI, I was on @allinwithchris last night talking to @chrislhayes about the Republican #HealthcareBill. #inners https://t.co/eKS7ytjUmn"]["I've said it before and I'll say it again: Who would cut health care coverage for children?!?\nhttps://t.co/upxQgGVg6s"]["GOP #HealthcareBill cuts Medicaid &amp; premium assistance. This hurts rural hospitals &amp; undermines private health insurance market in rural WI."]["Rural hospitals are economic engines in smaller communities. When they are at risk, the jobs &amp; economic growth they create are at risk too."]["Rural hospitals play a critical role in ensuring that Wisconsin families have access to needed health care services. https://t.co/y6JhWFlAwY"]["Our rural hospitals are already struggling. The GOP #HealthcareBill could make it even harder for them to maintain day-to-day operations."]["The GOP #HealthcareBill will make things worse in rural Wisconsin.\nhttps://t.co/dXjEuTWPfB"]["If you live in rural Wisconsin, the Senate Republican #HealthcareBill will only make it harder to access affordable, quality health care. https://t.co/QmUIABKt0X"]["In Dodgeville today, hearing how the GOP #HealthcareBill will hurt Wisconsin’s rural communities. https://t.co/vxH0bXGtBx"]["In today’s world, reliable internet access is essential. Washington needs to do more to expand broadband in rural Wisconsin. https://t.co/oGJbbUrxY0"]["In Monticello to host a roundtable discussion with local community leaders and advocates on expanding rural broadband. https://t.co/S7nxsrNktv"]["Great to chat about rebuilding our roads and creating jobs with @gazettextra\nhttps://t.co/MfOp3X3diA https://t.co/m9CqB7EeeF"]["I’ve joined @SenateDems to offer a plan to rebuild America’s infrastructure and create jobs. https://t.co/FjKcHMyOu8"]["I believe Washington needs to do more to support rebuilding our infrastructure in Wisconsin. Let’s put our workers on the job. #MadeInWI https://t.co/S3ejttq5pp"]["In Edgerton today to focus on rebuilding our roads and putting people to work on infrastructure with stronger federal investments. #MadeInWI https://t.co/weoffhEqwF"]["Wisconsin doctors concerned #HealthcareBill will reduce kids care &amp; threaten our rural hospitals. #KeepKidsCovered https://t.co/43K6cskKae"]["@RWJF @urbaninstitute In 2022, report shows there would be 60,000 more uninsured children and 226,000 more uninsured adults in Wisconsin. https://t.co/CPBw4pntaH"]["Uninsured rate in Wisconsin would increase by 73.2% in 2022 with GOP #HealthCareBill, via @RWJF &amp; @urbaninstitute. https://t.co/6JiZOvdpjz"]["#ACA Repeal Would Devastate Already Struggling Rural Communities https://t.co/VZ4wP6TXTY via @HuffPostBlog"]["For Millions, Life Without Medicaid Services Is No Option. #ProtectOurCare https://t.co/mt1R3L3Nyh"]["Happy 4th of July, Wisconsin! Wishing everyone a safe and fun Independence Day! 🇺🇸🎆🎇 https://t.co/i9PYYOpWRI"]["“The economic importance cannot be understated.” https://t.co/c3oz4No1u4"]["\"A tribute to the naval men and women who carry them out to sea with the U.S. flag pursing our freedom\" Baldwin said https://t.co/pNDVVBeg7f"]["USS Billings christened, launched at Marinette Marine this weekend. Proud to join and support our #MadeinWI workers. https://t.co/pNDVVBeg7f"]["“It’s a life and death decision” said Baldwin of the rising prices. “And it matters.” https://t.co/GNDbkTgg8S"]["The legislation would help cut costs for nearly 41 M seniors enrolled in Medicare Part D &amp; boost Medicare savings. https://t.co/GNDbkTgg8S"]["Senators push plan to reduce cost of prescription drugs https://t.co/HJLwrr99JC"]["Great to be in Marinette today for the christening and launch of the newest #MadeInWI #LittoralCombatShip, the USS Billings! https://t.co/u1KkiCUM3m"]["My bipartisan FAIR Drug Pricing Act will hold drug corporations accountable for rising Rx drug prices. https://t.co/MvBSeJgw3V"]["Diane's voice must be heard in Washington. Instead of give drug companies a tax cut, lets lower her Rx drug costs. #ProtectOurCare https://t.co/12PHWvbXbQ"]["I'm fighting for Wisconsinites like Diane. She has MS and drug companies keep putting profits over people like her. https://t.co/9vjNlhLAMJ"]["Proud to join @amyklobuchar today. We are working on bipartisan solutions to lower costs and make things better, not worse. #HealthcareBill"]["One thing is clear: Americans want both parties to work together to protect the health care people have today and make it more affordable. https://t.co/gI0yoaSXRE"]["Today, @amyklobuchar and I are standing together to take on sky high prescription drug prices. https://t.co/G3ZAe0H6LY"]["Proud to work with @SenatorIsakson &amp; @SenBlumenthal on this bipartisan reform to ensure the VA appeals process is working for our #veterans."]["The VA appeals process is broken and needs to be fixed. We must pass this bipartisan reform as soon as possible. https://t.co/ONsaEog8vY"]["RELEASE: Sen. Baldwin Applauds Committee Passage of Bipartisan Measure to Modernize VA Appeals Process https://t.co/ONsaEog8vY"]["Great to meet with FIRST Wisconsin Robotics &amp; @NACTeam93 team members about their passion to expand #STEM programming. #firstnac2017 https://t.co/0e29hfLS1M"]["Met with Dr. Scott Rathgaber from @gundersenhealth, leaders in high quality, low cost health care. Proud to have them in Wisconsin. https://t.co/FUPpyPdJYT"]["Pleasure to meet with Wisconsin @4H members, reaffirming my belief in the power of young people. https://t.co/LxFgK4ROSa"]["LIVE: Tune in to @MSNBC to hear me tell @AliVelshi the story of Zoe from Seymour, WI and why we can't stop fighting to #ProtectOurCare. https://t.co/MI2Jt2a9fF"]["@USTradeRep There's an immediate need to follow through on @POTUS' promises made to Wisconsin dairy farmers facing Canadian trade barriers."]["@USTradeRep If we want to respect and reward #MadeInWI hard work, we must make a strong #BuyAmerica commitment to our workers."]["@USTradeRep Unfair trade deals like #NAFTA have cost Wisconsin's economy manufacturing jobs. It's time to level the playing field for workers. #MadeInWI"]["Just met with @USTradeRep Lighthizer. We discussed how we can work together to strengthen our #MadeInWI manufacturing economy. https://t.co/NUk8qfLKgh"]["50 years of @Summerfest! The world's largest music festival starts today in #Milwaukee! #Summerfest50 🎤🎸 https://t.co/saaJUTIUYK"]["Baldwin: “I won’t stop fighting” GOP health care bill - @washingtonpost https://t.co/25YtdwSAsw"]["You have to watch this. Zoe in Seymour is who I'm fighting for. #AmericaSpeaksOut\nhttps://t.co/odsyF3Iqtb"]["\"I don’t know how a school district makes up a half a million dollars.\" #HealthcareBill https://t.co/SNJRdD3of4"]["As Wisconsin works on passing a state budget, a massive unfunded mandate from Washington is coming if the GOP #HealthcareBill moves forward."]["Medicaid cuts in the GOP #HealthcareBill will also affect students like Addie and their success in the classroom. https://t.co/SNJRdD3of4 https://t.co/klaSgWO2H2"]["Wisconsin didn't send me to Washington to take people’s health care away. I won’t stop fighting to protect the health care people have today"]["I am fighting for Wisconsinites like Zoe &amp; every American who lays awake wondering if the health care they have today will be there tomorrow https://t.co/IDOCNglpEr"]["Zoe's mom, Chelsey wrote to me: https://t.co/NZdaYKgiSL"]["Now, Zoe is guaranteed access to coverage. But Zoe's parents are scared the GOP #HealthcareBill will make things worse. https://t.co/CbLFDyKOIX"]["This is personal for the Schaumberg family in Seymour. Their daughter Zoe was born with a congenital heart defect. https://t.co/HZyvGbnmqq"]["Health care isn't just personal to me, it's personal for the Wisconsin families that I work for. #HealthcareBill #AmericaSpeaksOut"]["I am speaking out about the GOP #HealthcareBill and giving Wisconsinites a voice. #AmericaSpeaksOut Watch: https://t.co/yZjO1Bzm1D"]["#CBOScore: #HealthcareBill Would Raise Premiums, Deductibles, or Both for Most Marketplace Consumers @CenterOnBudget https://t.co/GmHgIYPvuv"]["Today, #AmericaSpeaksOut about the GOP #HealthcareBill. I'm giving Wisconsinites a voice. Watch live 12CT/1ET: https://t.co/oX1scLFlPi"]["ICYMI, I was on #UpFront with @MikeGousha to talk about the Senate GOP #HealthcareBill. https://t.co/U2rEL9uW27"]["For people who depend on Medicaid, proposed federal caps in health care plans instill fear. 📷: @journalsentinel https://t.co/ZNckpbUGKK https://t.co/YKCpXqcnEU"]["Kelli Simpkins is scared Medicaid cuts could threaten services for her son Mickey. https://t.co/iksRblHpKB https://t.co/i3rWKCqB8P"]