["Well over 100 companies have announced intentions to deliver special bonuses, pay increases, or other benefits to employees as a result of the #TaxCutsandJobsAct. It is a shame that none of our Democratic colleagues – in the House or the Senate – voted for #TaxReform.\n\nNot one."]["Pay Raises. Bonuses. Lower utility bills.\n\nNot \"armageddon\" https://t.co/5fuGgB4EoE"]["Using the Congressional Review Act, Congress repealed 15 major federal regulations that were stifling American enterprise. This alone is expected to save employers up to $36B in compliance costs. And this was in addition to the 860 rules @POTUS revisited in 2017."][".@Walmart becomes the latest major American company to announce bonuses, raises and maternity/paternity leave because of #TaxReform\nhttps://t.co/RzIijI6y7l"]["Government does not create prosperity. The American people do. https://t.co/gY7xdj6gTG"]["Pay Raises. Bonuses. Lower utility bills.\n\nNot \"armageddon\" https://t.co/jcWToCprMG"]["Thanks to @POTUS signing the #TaxCutsandJobsAct into law, thousands of @Walmart employees in #Kentucky will now receive bonuses and higher wages. https://t.co/8biW4mYXn8"]["Happy to see #Oklahoma respond to the #TaxCutsandJobsAct by passing the savings on to the people. https://t.co/qev0vgmnXZ"]["Major power companies in #Illinois, #Maryland, and #Massachusetts are already proposing plans to give their customers tens of millions of dollars -- or hundreds of millions of dollars – in relief by lowering the rates they charge for #energy. All thanks to #TaxReform."]["#ICYMI → Because of the #TaxCutsandJobsAct, a #SouthCarolina electric and gas utility is planning to give a cash payment directly to its customers, averaging $1,000 per household. https://t.co/DwYEOwZYN0"]["Over ONE MILLION American workers and counting are receiving bonuses &amp; wage hikes because of the #TaxCutsandJobsAct\n⬇️\nhttps://t.co/V8y2M1kvw2"]["Due to the historic #TaxReform from the #TaxCutsandJobsAct, the many struggling to make ends meet will be getting a break thanks to lower utility prices. https://t.co/4XA4sP3Wov"]["It's been THREE WEEKS since @POTUS signed the #TaxCutsandJobsAct, and the American people are already feeling the positive effects. https://t.co/fGpj4PbL10 https://t.co/3PXbwzFI9e"]["Once-in-a-generation #TaxReform = lower utility bills https://t.co/4XA4sP3Wov"]["It’s been less than a month since Congress passed, and @POTUS signed, the #TaxCutsandJobsAct. But already, Americans are feeling the positive effects. https://t.co/NbbF1psAt3"]["We are less than a month past @POTUS signing into law historic #TaxReform, and those in #Kentucky are already feeling the positive effects, and will soon see lower utility costs. https://t.co/q5IYRejBCr"]["When Washington gets out of the way, cuts back regulations, and modernizes the tax code with the #TaxCutsandJobsAct, American workers reap the benefits. https://t.co/V8y2M1kvw2"]["Americans are already seeing benefits from the #TaxCutsandJobsAct\n👇🏼\nhttps://t.co/V8y2M1kvw2"]["The #TaxCutsandJobsAct sure doesn't look like \"Armageddon\" https://t.co/qZhP5ihDtB"]["Across the country and a variety of different industries, workers, including many in #Kentucky, are receiving significant bonuses, permanent pay raises, more generous retirement contributions, and other benefits thanks to the #TaxCutsandJobsAct. https://t.co/CBVrwzGPDL"]["Americans are most optimistic than ever about finding good quality #jobs. https://t.co/eTvP0Xthf6 https://t.co/uVUxLQHWRS"]["Thanks to @POTUS signing the #TaxCutsandJobsAct, over 1,000,000 Americans are already seeing the benefits, and there's more to come... https://t.co/KE0QrqZ33u"]["Lower tax rates will mean less money withheld for the IRS and more take-home pay for hardworking Americans."]["In the next week and a half, let’s put aside partisan rhetoric and start heeding the warnings of our nonpartisan military leaders. Let’s give those who keep us safe the resources they need to do it."]["Since fiscal year 2013, discretionary defense spending has been cut by $85 billion more than discretionary non-defense spending. This might sound like an abstract distinction. But it has very real, tangible consequences for our national security."]["According to the Farm Bureau Federation, 93% of U.S. farms file taxes through the individual code. Thanks to the #TaxCutAndJobsAct, it will be easier for farm families in #Kentucky and around the country to invest in new capital equipment and recover their costs."]["Thanks to the #TaxCutAndJobsAct, businesses throughout America are taking advantage of more competitive tax rates and passing the savings along to their workers. https://t.co/v7rTVj1Jyp"]["Make sure to read my new @NRO op-ed with @ChuckGrassley on how 2017 was a historic year for the federal judiciary.\n\nhttps://t.co/oxGXJKv5bV"]["For many Americans, life is nowhere near back to normal. It’s time to complete our work on the supplemental disaster relief legislation to help those hurt by the crippling hurricanes and wildfires."]["I know that colleagues on both sides of the aisle are eager to find a long-term solution for the Children’s Health Insurance Program. Five years, full reauthorization. Let’s get this done for working families."]["Our men and women in uniform are doing their job. Our job is to give them the resources they require. https://t.co/q467GUc8Ot"]["Bonuses, raises, increased 401(K) contributions &amp; improved benefits. This is what happens when Congress passes #TaxReform. https://t.co/bFzDeZ6OCZ"]["Nothing about defense spending needs to be partisan. During the Obama Administration, Defense Secretaries Panetta, Hagel, and Carter all similarly warned that sequestration cuts would handicap our men and women in uniform."]["We must set aside the misguided notion that defense spending needs to be matched $-for-$ by new non-defense spending.\nhttps://t.co/q467GUc8Ot"][".@AmericanAir &amp; @SouthwestAir have both given employees bonuses thanks to the #TaxCutsandJobsAct. https://t.co/bFzDeZ6OCZ"]["I’m optimistic that we can begin 2018 with a bipartisan, 2 year funding agreement that meets several critically-important objectives. To begin with, any agreement must provide our armed forces with the resources they need to fulfill their missions."]["Millions of dollars in bonuses for more than 500,000 American workers have already been announced in response to the #TaxCutAndJobsAct.\nhttps://t.co/bFzDeZ6OCZ"]["The coming days will be noteworthy as we wait to see if hardliners in #Iran use the #IranProtests as an excuse to promote even more aggressive policies toward the West and tighten their grip further on the country and its economy."]["It's not time to say goodbye just yet to @senorrinhatch, the #Senate and the American people will benefit greatly from his wisdom and famous work ethic for one more year before his retirement. https://t.co/jM8PVcAQsu"]["I would like to offer a warm welcome to Doug Jones of Alabama and Tina Smith of Minnesota to the #Senate. I look forward to working with them in the months ahead to make bipartisan progress and find common ground on behalf of the American people."][".@senorrinhatch's long list of accomplishments means he will depart as one of the most productive members ever to serve in the #Senate. We’ll remember the unfailing energy, kindness, and straightforward honesty that he brought to work every day. https://t.co/KNMAZx7ySQ"]["May you have a happy, safe, and hopefully football filled New Year. https://t.co/m8cxCHPQFD"]["Here's to a safe and happy New Year! https://t.co/ezOGbcYz1B"]["I hope everyone has a safe and Merry Christmas. https://t.co/CU4JIwfoc5"]["Merry Christmas, everyone.🎅🏼🎄⛄️ https://t.co/nSQ48chbcU"]["Real reform for American #Veterans \nSignificant bipartisan victories this year on behalf of our nation’s Veterans\nhttps://t.co/jRnheWZ5eK"]["“this has been a year of extraordinary accomplishment for @realDonaldTrump. We've cemented #SCOTUS right of center for a generation. @POTUS, thanks to your nominees, we put 12 circuit court judges in place, the most since [it] was established in 1891.” https://t.co/y33c72Iqy7"]["Thank you @marthamaccallum for having me on @FoxNews tonight to discuss the #Senate Democrats attack on @bereacollege, a #Kentucky school that provides free college tuition for low-income students. https://t.co/HYz3uEJOol"]["- TONIGHT 7:00 Eastern -\nI will be joining @marthamaccallum on @FoxNews to discuss the once-in-a-generation #TaxReform bill &amp; how #Senate Democrats are penalizing low income students."]["Make sure to read my #TaxReform op-ed in @FoxNews from this morning. Americans, we heard you loud and clear.\nhttps://t.co/3tDIDAp1Ok"]["#ICYMI - companies gave ‘bonuses to hundreds of thousands of workers after tax bill’. #TaxReform is already benefiting Americans. https://t.co/vC5i1fw3c4"]["#Senate Democrats are penalizing poor students and making it harder for them to earn a college degree. https://t.co/seSsaSjvX4"]["'Most people are going to pay less’ in federal income taxes due to #TaxReform. https://t.co/ht9GKHnT8L"]["#Senate Dems purposefully penalized schools that give scholarships to low-income students, like @bereacollege in #Kentucky. Their students’ average household income is less than $30k/year. Every single student receives a scholarship, which covers the cost of their tuition. https://t.co/zm0wVaOpJ1"]["#TaxReform is soon to be a reality for the American people. Thank you @SpeakerRyan for your leadership in passing this legislation through the House. \n\nNext step, becoming law with @POTUS' signature. https://t.co/kkiHJYguid"]["I hope that #Senate Democrats will work with us to provide the necessary funds to our military so that the men and women of our all-volunteer force can continue to keep our country safe."][".@POTUS ran on giving tax cuts to middle class Americans. Congress delivered on that promise. #TaxReform is on its way. https://t.co/d88XNWKN9h"]["This week in the #Senate:\n✔passed once-in-a-generation #TaxReform \n✔strengthened our #energy and national security\n✔repealed Obamacare's individual mandate tax"]["Thank you @mikeallen and @axios for inviting me to speak this morning. #TaxReform is a major accomplishment for Congress, @POTUS, but more importantly for the American people. https://t.co/2M8xgjaCSm"]["Tomorrow morning I will be joining @mikeallen for @axios News Shapers. I will be discussing #TaxReform and how the #Senate has confirmed the most circuit court judges ever in a @POTUS' first year."]["Thank you @POTUS for all you’re doing on behalf of the American people. 2017 has been a year of extraordinary accomplishments for the Trump White House. https://t.co/BE7RteqEXQ"]["Thank you to all those who helped give middle class Americans #TaxReform they deserve. The members of @GOPSenFinance, @BudgetGOP, @EnergyGOP, @SpeakerRyan &amp; @RepKevinBrady, and of course @POTUS and @VP. We could not have done it without each and every one of you."]["Thank you @EnergyGOP Chair @lisamurkowski &amp; @SenDanSullivan for helping lead the way to responsibly developing more of Alaska’s oil and gas potential, strengthening both our #economy and our national security in the process."]["Repealing Obamacare’s harmful individual mandate tax in #TaxReform is \"a tax cut for low-income Americans\" https://t.co/aWcaExbH2B"]["For all that you have done to help make #TaxReform a reality, thank you @GOPSenFinance Chairman @senorrinhatch. https://t.co/uW9tQSWji2"]["@realDonaldTrump I'm glad we could pass #TaxReform for the American people https://t.co/3S1bsC2dTV"]["Not only did the #Senate pass once-in-a-generation #TaxReform last night, we voted to repeal #Obamacare’s individual mandate tax, so that low and middle income families are not forced to purchase something they either don’t want or can’t afford."]["After years of work, dozens of hearings, and an open process, we passed an historic overhaul of our nation’s tax code. It will deliver #TaxReform to families and small businesses across the nation. https://t.co/L7lfltKx5e"]["BREAKING\n↓\nThe #Senate has passed the #TaxCutsandJobsAct to give hard working Americans the #TaxReform they deserve. https://t.co/dndSY7vUfL"]["Democrats have long called for #TaxReform, but have suddenly changed their mind. Does a new @POTUS mean they are ok with slow growth and an underperforming #economy? \n\n@BretBaier @SpecialReport @FoxNews https://t.co/3Pv28SJ1Wh"]["Delivering #TaxReform to the middle class is what this bill is all about. It’s time Americans keep more of their hard-earned money.\n\n@BretBaier @SpecialReport @FoxNews https://t.co/89eprUHrJU"]["This year is different\n↓\nhttps://t.co/7sEmzxWH6d"]["TONIGHT → I will be joining @BretBaier on @SpecialReport to discuss the importance of #TaxReform for the American people and how the #Senate has confirmed more circuit court judges in @POTUS' first year than any President in history.\n6:00 PM Eastern"]["The #TaxCutsandJobsAct:\n✔️doubles standard deduction AND child tax credit\n✔️lowers corporate tax rate\n✔️erases the individual mandate\n✔️strengthens national security by investing in our own #energy\n✔️puts our country on a trajectory towards better-paying #jobs."]["Now that the House has passed the #TaxCutsandJobsAct, the #Senate will have up to 10 hours of debate before passing this once-in-a-generation #TaxReform bill for the American people."]["We are now one step closer to passing #TaxReform for the American people. I urge all members of the #Senate to join me in voting to approve the conference report and complete this victory for the American people. https://t.co/sQEmkFaYSV"]["The #TaxCutsandJobsAct is a bill that does exactly what we set out to do https://t.co/3OdYqadhoY"]["A special thank you to @GOPSenFinance Chairman @senorrinhatch, @EnergyGOP Chair @lisamurkowski, and @BudgetGOP Chairman @SenatorEnzi for their work to help finalize the #TaxReform conference report."]["The #TaxCutsandJobsAct not only modernizes our burdensome tax code, it also strengthens our national security by using more of our own #energy in Alaska and repeals the harmful individual mandate that forces Americans to buy #Healthcare plans they can't afford."]["In addition to CHIP and #Veterans Choice, we must approve supplemental disaster funding for states and territories that are still struggling to rebuild after a year of devastating natural disasters."]["Congress needs to work together to renew the #Veterans Choice program, which aims to cut wait times for @DeptVetAffairs #healthcare and give our veterans flexibility to access care outside the system."]["Congress must renew funding for the Children’s Health Insurance Program so the parents of the nine million children who are covered by CHIP can know their children’s health care is secure."]["Congress is close to passing real #TaxReform for the American people. @POTUS will have it on his desk very soon. https://t.co/1k7mCYJyn7"]["Before the end of this week, Congress must ensure our men and women in uniform have the resources they need to protect Americans and face the challenges of a dangerous world."]["The #Senate's thoughts this afternoon are with the victims of this morning’s tragic train derailment in Washington state, and with their families. And our gratitude is with the first responders who answered the call and rushed to the scene."]["The #Senate has confirmed an historic 12 Circuit Court Judges this year. That's the most in a President’s 1st year in office since the creation of circuit courts in 1891. https://t.co/NLHrm3b5RD"]["Last week, the #Senate finished another historic week by confirming 3 more of @POTUS' impressive judicial nominees to the Circuit Courts, for a total of 12 this year.\n\nCONFIRMED:\n✔Thapar\n✔Bush\n✔Newsom\n✔Erickson\n✔Barrett\n✔Larsen\n✔Eid\n✔Bibas\n✔Katsas\n✔Grasz\n✔Willett\n✔Ho"]["My statement on the #TaxCutsandJobsAct conference report that was released today. It's time to bring real #TaxReform to the middle class by taking money out of Washington’s pocket and putting it into theirs. https://t.co/RWwE7Y5aiJ"]["BREAKING ➡ the #Senate has confirmed the 12th @POTUS Circuit Court nominee this year. https://t.co/UIEpdPvS8f"]["When the #Senate confirms Mr. Ho, we'll be adding another fair &amp; impartial judge to the federal bench. @POTUS has nominated individuals with strong fidelity to the law and the Constitution."]["Under Chairman @ChuckGrassley’s leadership, the @senjudiciary Committee has done outstanding work to move @POTUS’ judicial nominees to the #Senate floor. I urge all of my colleagues to join me in voting to confirm Mr. Ho."]["Jim Ho, who will be the 12th @POTUS Circuit Court nominee considered by the #Senate in 2017, ‘has a fidelity to the rule of law that we should all want in a federal judge’ https://t.co/KvU0XIVDSo"]["\"We are very, very close to a historic legislative victory\" on #TaxReform - @POTUS \n⬇️\nhttps://t.co/22TCkDE6DS"]["The #Senate is ‘on the cusp of a historic moment’ with #TaxReform\n⬇️\nhttps://t.co/22TCkDE6DS"]["Happy birthday and thank you for all of the volunteers who help keep our country safe. @kentuckyguard https://t.co/smr8kwtkA9"]["Once the #Senate confirms Justice Willett this afternoon, we will advance the nomination of James Ho to be a judge on the Fifth Circuit Court. He will be @POTUS' 12th nomination confirmed to the Circuit Court."]["Not only will #TaxReform bring relief to middle class Americans, it will also repeal Obamacare’s individual mandate tax and provide for our nation’s #energy future by further developing Alaska’s oil and gas potential."]["The bottom line on #TaxReform: We want to take more money out of Washington’s pocket and put more money into the pockets of the middle class. I’m confident the conference committee will finalize a bill that does just that."]["Passing pro-growth #TaxReform is the single most important action we can take right now to grow our #economy and help the middle class get ahead. @POTUS &amp; this Republican-led Congress are working to deliver relief to the American people. https://t.co/kUgPTrjHHF"]["Later today, the #TaxReform conference committee will host an open meeting to discuss the House and #Senate versions of the bill."]["Texas Supreme Court Justice Don Willett will be the 11th @POTUS nominee to the circuit courts confirmed by the #Senate this year. https://t.co/B1ZMx7jGdf"]["Texas Supreme Court Justice Don Willett is a man of “deep intellect and principle” https://t.co/B1ZMx7jGdf"]["To those celebrating the festival of lights, #HappyHanukkah https://t.co/SXKP9dn9TI"]["After the #Senate confirms our 10th @POTUS nominee for the Circuit Courts, Steven Grasz, we will move to our 11th, Texas Supreme Court Justice Don Willett to serve on the 5th Circuit Court."]["Today @POTUS signed #NDAA into law to give our servicemen and women the resources they need to keep our country safe. Big thanks to @SenJohnMcCain for his leadership in getting this bill done."]["Today, the #Senate will confirm Steven Grasz to be a judge on the 8th Circuit Court of Appeals, our 10th circuit court confirmation this year. https://t.co/giOwG2RoMv"]["Steve Grasz, the 10th nominee to the circuit courts to be considered by the #Senate this year, is a man of ‘integrity, humility and decency.’ \nhttps://t.co/fFiIAZMbnS"]["I would like to once again commend Chairman @ChuckGrassley for his leadership of the @senjudiciary Committee. His excellent work has allowed us to bring @POTUS' circuit court nominees to the #Senate floor."]["This week, the #Senate will consider 3 more of @POTUS' outstanding individuals nominated to serve on our nation’s federal circuit courts, in addition to the 9 we have already confirmed this year."]["As we continue to learn more details about the attempted #PortAuthority terror attack this morning, I would like to commend the law enforcement and intelligence community who quickly reacted to the attack."]["Steve Grasz, the 10th nominee to the circuit courts to be considered by the #Senate this year, is a man of ‘integrity, humility and decency.’ https://t.co/giOwG2RoMv"]["The #Senate just passed a 2-week funding bill that will maintain our military &amp; provide states with the certainty to continue children’s health insurance program (CHIP) while a longer bipartisan agreement is finalized."]["This afternoon I’ll meet with @POTUS &amp; Congressional Leadership to continue working together in a serious, bipartisan way to address a number of priorities for our nation in the coming weeks."]["Thank you @SenatorStrange for your extraordinary commitment to the people of Alabama."]["#ICYMI - Yesterday, the #Senate voted to join the House to consider our #TaxReform bills in a conference committee. It’s another important step toward delivering much-needed relief to the men, women, and families we represent. https://t.co/EvdPSkTRwI"]["The #Senate will vote to confirm the nomination of Joseph Balash to serve as the Assistant Secretary of the @Interior for Land and Minerals Management. He’s shown his talent and passion for affordable sources of #energy and environmental protection."][".@SenatorRounds \"The #TaxReform bill…takes meaningful steps to reform our tax code in a manner that will allow businesses to flourish again &amp; families to keep more of their hard-earned dollars\" https://t.co/vLtykOzrNb"]["A vote for this short-term CR will help maintain our military &amp; continue the important work of federal agencies. And it will provide states with the certainty to continue to CHIP until a bipartisan reauthorization agreement is finalized."]["The @washingtonpost fact checks another claim by Democrats on the GOP #TaxReform bill, and their findings shouldn't surprise you https://t.co/60zaZpOURe https://t.co/Qg0DFKuO4e"]["With the cooperation of our Democrat colleagues, Congress will pass a short-term CR before the end of this week."]["Last night, our colleagues in the House voted to send #TaxReform legislation to a conference committee, adding progress in our years-long effort to deliver real relief to the American people. I look forward to the #Senate voting to join the conference this week."]["Tomorrow morning, I will be joining @hughhewitt at 8:05 Eastern / 7:05 Central to discuss the importance of #TaxReform."]["The #Senate has confirmed the nomination of Kirstjen Nielsen to be the Secretary of @DHSgov. Our nation faces myriad threats, and I look forward to working with Ms. Nielsen to address each of them."]["The CR is a clean bill with no controversial policy-riders. It also includes a provision to assure states of the future of CHIP while a bipartisan reauthorization agreement is completed."]["By approving a short-term CR, we can continue the crucial functions of the federal government while we work with our colleagues in the House and @POTUS to finalize a long-term plan."]["#ICYMI ➡️ the #Senate passed a critical #TaxReform bill to jumpstart the American #economy by putting more money into the pockets of hardworking families &amp; creating more #jobs. https://t.co/Xtv3shKPKA"]["The #Senate will take a serious step today to strengthen our nation’s security by confirming Kirstjen Nielsen to lead @DHSgov. With her understanding of the challenges facing our nation and her experience in prevention and preparedness, she will excel as the next Secretary."]["I would again like to thank the Chairman of @GOPSenFinance, @senorrinhatch, for his leadership through years of work, dozens of hearings, and a full markup of the #Senate #TaxReform bill. https://t.co/Xtv3shKPKA"]["#TaxReform, along with @POTUS' regulatory relief, is why the #economy is beginning to look up. @FaceTheNation https://t.co/RX7qCX3XrK"]["Soon, the House and the #Senate will meet in a conference to produce a final #TaxReform bill so we can send it to @POTUS' desk."]["Thank you to @POTUS and @VP, who fought for the promise they made to the American people to cut their taxes. Their tenacity, commitment to the effort and engagement with the #Senate were invaluable. #TaxReform"]["The House has released its legislative text, one without any controversial policy riders, to fund the government through December 22. The #Senate will pass it before the end of this week."]["Today, the #Senate will vote to advance @POTUS' nominee to lead @DHSgov, Kirstjen Nielsen."]["The #Senate #TaxReform bill will help boost the #economy and keep #jobs here in America. @ThisWeekABC https://t.co/KSBBUHVDbY"]["#ICYMI - The #Senate passed our once-in-a-generation #TaxReform bill. See what's in it for you. via @WSJopinion\nhttps://t.co/Xtv3shKPKA"]["#Senate Republicans believe that #TaxReform will jump start the #economy and help the middle class, while Democrats seems to be quite content with slow growth and little opportunity. @FaceTheNation https://t.co/9ckLS68ZAK"]["Well over 100 companies have announced intentions to deliver special bonuses, pay increases, or other benefits to employees as a result of the #TaxCutsandJobsAct. It is a shame that none of our Democratic colleagues – in the House or the Senate – voted for #TaxReform.\n\nNot one."]["Pay Raises. Bonuses. Lower utility bills.\n\nNot \"armageddon\" https://t.co/5fuGgB4EoE"]["Using the Congressional Review Act, Congress repealed 15 major federal regulations that were stifling American enterprise. This alone is expected to save employers up to $36B in compliance costs. And this was in addition to the 860 rules @POTUS revisited in 2017."][".@Walmart becomes the latest major American company to announce bonuses, raises and maternity/paternity leave because of #TaxReform\nhttps://t.co/RzIijI6y7l"]["Government does not create prosperity. The American people do. https://t.co/gY7xdj6gTG"]["Pay Raises. Bonuses. Lower utility bills.\n\nNot \"armageddon\" https://t.co/jcWToCprMG"]["Thanks to @POTUS signing the #TaxCutsandJobsAct into law, thousands of @Walmart employees in #Kentucky will now receive bonuses and higher wages. https://t.co/8biW4mYXn8"]["Happy to see #Oklahoma respond to the #TaxCutsandJobsAct by passing the savings on to the people. https://t.co/qev0vgmnXZ"]["Major power companies in #Illinois, #Maryland, and #Massachusetts are already proposing plans to give their customers tens of millions of dollars -- or hundreds of millions of dollars – in relief by lowering the rates they charge for #energy. All thanks to #TaxReform."]["#ICYMI → Because of the #TaxCutsandJobsAct, a #SouthCarolina electric and gas utility is planning to give a cash payment directly to its customers, averaging $1,000 per household. https://t.co/DwYEOwZYN0"]["Over ONE MILLION American workers and counting are receiving bonuses &amp; wage hikes because of the #TaxCutsandJobsAct\n⬇️\nhttps://t.co/V8y2M1kvw2"]["Due to the historic #TaxReform from the #TaxCutsandJobsAct, the many struggling to make ends meet will be getting a break thanks to lower utility prices. https://t.co/4XA4sP3Wov"]["It's been THREE WEEKS since @POTUS signed the #TaxCutsandJobsAct, and the American people are already feeling the positive effects. https://t.co/fGpj4PbL10 https://t.co/3PXbwzFI9e"]["Once-in-a-generation #TaxReform = lower utility bills https://t.co/4XA4sP3Wov"]["It’s been less than a month since Congress passed, and @POTUS signed, the #TaxCutsandJobsAct. But already, Americans are feeling the positive effects. https://t.co/NbbF1psAt3"]["We are less than a month past @POTUS signing into law historic #TaxReform, and those in #Kentucky are already feeling the positive effects, and will soon see lower utility costs. https://t.co/q5IYRejBCr"]["When Washington gets out of the way, cuts back regulations, and modernizes the tax code with the #TaxCutsandJobsAct, American workers reap the benefits. https://t.co/V8y2M1kvw2"]["Americans are already seeing benefits from the #TaxCutsandJobsAct\n👇🏼\nhttps://t.co/V8y2M1kvw2"]["The #TaxCutsandJobsAct sure doesn't look like \"Armageddon\" https://t.co/qZhP5ihDtB"]["Across the country and a variety of different industries, workers, including many in #Kentucky, are receiving significant bonuses, permanent pay raises, more generous retirement contributions, and other benefits thanks to the #TaxCutsandJobsAct. https://t.co/CBVrwzGPDL"]["Americans are most optimistic than ever about finding good quality #jobs. https://t.co/eTvP0Xthf6 https://t.co/uVUxLQHWRS"]["Thanks to @POTUS signing the #TaxCutsandJobsAct, over 1,000,000 Americans are already seeing the benefits, and there's more to come... https://t.co/KE0QrqZ33u"]["Lower tax rates will mean less money withheld for the IRS and more take-home pay for hardworking Americans."]["In the next week and a half, let’s put aside partisan rhetoric and start heeding the warnings of our nonpartisan military leaders. Let’s give those who keep us safe the resources they need to do it."]["Since fiscal year 2013, discretionary defense spending has been cut by $85 billion more than discretionary non-defense spending. This might sound like an abstract distinction. But it has very real, tangible consequences for our national security."]["According to the Farm Bureau Federation, 93% of U.S. farms file taxes through the individual code. Thanks to the #TaxCutAndJobsAct, it will be easier for farm families in #Kentucky and around the country to invest in new capital equipment and recover their costs."]["Thanks to the #TaxCutAndJobsAct, businesses throughout America are taking advantage of more competitive tax rates and passing the savings along to their workers. https://t.co/v7rTVj1Jyp"]["Make sure to read my new @NRO op-ed with @ChuckGrassley on how 2017 was a historic year for the federal judiciary.\n\nhttps://t.co/oxGXJKv5bV"]["For many Americans, life is nowhere near back to normal. It’s time to complete our work on the supplemental disaster relief legislation to help those hurt by the crippling hurricanes and wildfires."]["I know that colleagues on both sides of the aisle are eager to find a long-term solution for the Children’s Health Insurance Program. Five years, full reauthorization. Let’s get this done for working families."]["Our men and women in uniform are doing their job. Our job is to give them the resources they require. https://t.co/q467GUc8Ot"]["Bonuses, raises, increased 401(K) contributions &amp; improved benefits. This is what happens when Congress passes #TaxReform. https://t.co/bFzDeZ6OCZ"]["Nothing about defense spending needs to be partisan. During the Obama Administration, Defense Secretaries Panetta, Hagel, and Carter all similarly warned that sequestration cuts would handicap our men and women in uniform."]["We must set aside the misguided notion that defense spending needs to be matched $-for-$ by new non-defense spending.\nhttps://t.co/q467GUc8Ot"][".@AmericanAir &amp; @SouthwestAir have both given employees bonuses thanks to the #TaxCutsandJobsAct. https://t.co/bFzDeZ6OCZ"]["I’m optimistic that we can begin 2018 with a bipartisan, 2 year funding agreement that meets several critically-important objectives. To begin with, any agreement must provide our armed forces with the resources they need to fulfill their missions."]["Millions of dollars in bonuses for more than 500,000 American workers have already been announced in response to the #TaxCutAndJobsAct.\nhttps://t.co/bFzDeZ6OCZ"]["The coming days will be noteworthy as we wait to see if hardliners in #Iran use the #IranProtests as an excuse to promote even more aggressive policies toward the West and tighten their grip further on the country and its economy."]["It's not time to say goodbye just yet to @senorrinhatch, the #Senate and the American people will benefit greatly from his wisdom and famous work ethic for one more year before his retirement. https://t.co/jM8PVcAQsu"]["I would like to offer a warm welcome to Doug Jones of Alabama and Tina Smith of Minnesota to the #Senate. I look forward to working with them in the months ahead to make bipartisan progress and find common ground on behalf of the American people."][".@senorrinhatch's long list of accomplishments means he will depart as one of the most productive members ever to serve in the #Senate. We’ll remember the unfailing energy, kindness, and straightforward honesty that he brought to work every day. https://t.co/KNMAZx7ySQ"]["May you have a happy, safe, and hopefully football filled New Year. https://t.co/m8cxCHPQFD"]["Here's to a safe and happy New Year! https://t.co/ezOGbcYz1B"]["I hope everyone has a safe and Merry Christmas. https://t.co/CU4JIwfoc5"]["Merry Christmas, everyone.🎅🏼🎄⛄️ https://t.co/nSQ48chbcU"]["Real reform for American #Veterans \nSignificant bipartisan victories this year on behalf of our nation’s Veterans\nhttps://t.co/jRnheWZ5eK"]["“this has been a year of extraordinary accomplishment for @realDonaldTrump. We've cemented #SCOTUS right of center for a generation. @POTUS, thanks to your nominees, we put 12 circuit court judges in place, the most since [it] was established in 1891.” https://t.co/y33c72Iqy7"]["Thank you @marthamaccallum for having me on @FoxNews tonight to discuss the #Senate Democrats attack on @bereacollege, a #Kentucky school that provides free college tuition for low-income students. https://t.co/HYz3uEJOol"]["- TONIGHT 7:00 Eastern -\nI will be joining @marthamaccallum on @FoxNews to discuss the once-in-a-generation #TaxReform bill &amp; how #Senate Democrats are penalizing low income students."]["Make sure to read my #TaxReform op-ed in @FoxNews from this morning. Americans, we heard you loud and clear.\nhttps://t.co/3tDIDAp1Ok"]["#ICYMI - companies gave ‘bonuses to hundreds of thousands of workers after tax bill’. #TaxReform is already benefiting Americans. https://t.co/vC5i1fw3c4"]["#Senate Democrats are penalizing poor students and making it harder for them to earn a college degree. https://t.co/seSsaSjvX4"]["'Most people are going to pay less’ in federal income taxes due to #TaxReform. https://t.co/ht9GKHnT8L"]["#Senate Dems purposefully penalized schools that give scholarships to low-income students, like @bereacollege in #Kentucky. Their students’ average household income is less than $30k/year. Every single student receives a scholarship, which covers the cost of their tuition. https://t.co/zm0wVaOpJ1"]["#TaxReform is soon to be a reality for the American people. Thank you @SpeakerRyan for your leadership in passing this legislation through the House. \n\nNext step, becoming law with @POTUS' signature. https://t.co/kkiHJYguid"]["I hope that #Senate Democrats will work with us to provide the necessary funds to our military so that the men and women of our all-volunteer force can continue to keep our country safe."][".@POTUS ran on giving tax cuts to middle class Americans. Congress delivered on that promise. #TaxReform is on its way. https://t.co/d88XNWKN9h"]["This week in the #Senate:\n✔passed once-in-a-generation #TaxReform \n✔strengthened our #energy and national security\n✔repealed Obamacare's individual mandate tax"]["Thank you @mikeallen and @axios for inviting me to speak this morning. #TaxReform is a major accomplishment for Congress, @POTUS, but more importantly for the American people. https://t.co/2M8xgjaCSm"]["Tomorrow morning I will be joining @mikeallen for @axios News Shapers. I will be discussing #TaxReform and how the #Senate has confirmed the most circuit court judges ever in a @POTUS' first year."]["Thank you @POTUS for all you’re doing on behalf of the American people. 2017 has been a year of extraordinary accomplishments for the Trump White House. https://t.co/BE7RteqEXQ"]["Thank you to all those who helped give middle class Americans #TaxReform they deserve. The members of @GOPSenFinance, @BudgetGOP, @EnergyGOP, @SpeakerRyan &amp; @RepKevinBrady, and of course @POTUS and @VP. We could not have done it without each and every one of you."]["Thank you @EnergyGOP Chair @lisamurkowski &amp; @SenDanSullivan for helping lead the way to responsibly developing more of Alaska’s oil and gas potential, strengthening both our #economy and our national security in the process."]["Repealing Obamacare’s harmful individual mandate tax in #TaxReform is \"a tax cut for low-income Americans\" https://t.co/aWcaExbH2B"]["For all that you have done to help make #TaxReform a reality, thank you @GOPSenFinance Chairman @senorrinhatch. https://t.co/uW9tQSWji2"]["@realDonaldTrump I'm glad we could pass #TaxReform for the American people https://t.co/3S1bsC2dTV"]["Not only did the #Senate pass once-in-a-generation #TaxReform last night, we voted to repeal #Obamacare’s individual mandate tax, so that low and middle income families are not forced to purchase something they either don’t want or can’t afford."]["After years of work, dozens of hearings, and an open process, we passed an historic overhaul of our nation’s tax code. It will deliver #TaxReform to families and small businesses across the nation. https://t.co/L7lfltKx5e"]["BREAKING\n↓\nThe #Senate has passed the #TaxCutsandJobsAct to give hard working Americans the #TaxReform they deserve. https://t.co/dndSY7vUfL"]["Democrats have long called for #TaxReform, but have suddenly changed their mind. Does a new @POTUS mean they are ok with slow growth and an underperforming #economy? \n\n@BretBaier @SpecialReport @FoxNews https://t.co/3Pv28SJ1Wh"]["Delivering #TaxReform to the middle class is what this bill is all about. It’s time Americans keep more of their hard-earned money.\n\n@BretBaier @SpecialReport @FoxNews https://t.co/89eprUHrJU"]["This year is different\n↓\nhttps://t.co/7sEmzxWH6d"]["TONIGHT → I will be joining @BretBaier on @SpecialReport to discuss the importance of #TaxReform for the American people and how the #Senate has confirmed more circuit court judges in @POTUS' first year than any President in history.\n6:00 PM Eastern"]["The #TaxCutsandJobsAct:\n✔️doubles standard deduction AND child tax credit\n✔️lowers corporate tax rate\n✔️erases the individual mandate\n✔️strengthens national security by investing in our own #energy\n✔️puts our country on a trajectory towards better-paying #jobs."]["Now that the House has passed the #TaxCutsandJobsAct, the #Senate will have up to 10 hours of debate before passing this once-in-a-generation #TaxReform bill for the American people."]["We are now one step closer to passing #TaxReform for the American people. I urge all members of the #Senate to join me in voting to approve the conference report and complete this victory for the American people. https://t.co/sQEmkFaYSV"]["The #TaxCutsandJobsAct is a bill that does exactly what we set out to do https://t.co/3OdYqadhoY"]["A special thank you to @GOPSenFinance Chairman @senorrinhatch, @EnergyGOP Chair @lisamurkowski, and @BudgetGOP Chairman @SenatorEnzi for their work to help finalize the #TaxReform conference report."]["The #TaxCutsandJobsAct not only modernizes our burdensome tax code, it also strengthens our national security by using more of our own #energy in Alaska and repeals the harmful individual mandate that forces Americans to buy #Healthcare plans they can't afford."]["In addition to CHIP and #Veterans Choice, we must approve supplemental disaster funding for states and territories that are still struggling to rebuild after a year of devastating natural disasters."]["Congress needs to work together to renew the #Veterans Choice program, which aims to cut wait times for @DeptVetAffairs #healthcare and give our veterans flexibility to access care outside the system."]["Congress must renew funding for the Children’s Health Insurance Program so the parents of the nine million children who are covered by CHIP can know their children’s health care is secure."]["Congress is close to passing real #TaxReform for the American people. @POTUS will have it on his desk very soon. https://t.co/1k7mCYJyn7"]["Before the end of this week, Congress must ensure our men and women in uniform have the resources they need to protect Americans and face the challenges of a dangerous world."]["The #Senate's thoughts this afternoon are with the victims of this morning’s tragic train derailment in Washington state, and with their families. And our gratitude is with the first responders who answered the call and rushed to the scene."]["The #Senate has confirmed an historic 12 Circuit Court Judges this year. That's the most in a President’s 1st year in office since the creation of circuit courts in 1891. https://t.co/NLHrm3b5RD"]["Last week, the #Senate finished another historic week by confirming 3 more of @POTUS' impressive judicial nominees to the Circuit Courts, for a total of 12 this year.\n\nCONFIRMED:\n✔Thapar\n✔Bush\n✔Newsom\n✔Erickson\n✔Barrett\n✔Larsen\n✔Eid\n✔Bibas\n✔Katsas\n✔Grasz\n✔Willett\n✔Ho"]["My statement on the #TaxCutsandJobsAct conference report that was released today. It's time to bring real #TaxReform to the middle class by taking money out of Washington’s pocket and putting it into theirs. https://t.co/RWwE7Y5aiJ"]["BREAKING ➡ the #Senate has confirmed the 12th @POTUS Circuit Court nominee this year. https://t.co/UIEpdPvS8f"]["When the #Senate confirms Mr. Ho, we'll be adding another fair &amp; impartial judge to the federal bench. @POTUS has nominated individuals with strong fidelity to the law and the Constitution."]["Under Chairman @ChuckGrassley’s leadership, the @senjudiciary Committee has done outstanding work to move @POTUS’ judicial nominees to the #Senate floor. I urge all of my colleagues to join me in voting to confirm Mr. Ho."]["Jim Ho, who will be the 12th @POTUS Circuit Court nominee considered by the #Senate in 2017, ‘has a fidelity to the rule of law that we should all want in a federal judge’ https://t.co/KvU0XIVDSo"]["\"We are very, very close to a historic legislative victory\" on #TaxReform - @POTUS \n⬇️\nhttps://t.co/22TCkDE6DS"]["The #Senate is ‘on the cusp of a historic moment’ with #TaxReform\n⬇️\nhttps://t.co/22TCkDE6DS"]["Happy birthday and thank you for all of the volunteers who help keep our country safe. @kentuckyguard https://t.co/smr8kwtkA9"]["Once the #Senate confirms Justice Willett this afternoon, we will advance the nomination of James Ho to be a judge on the Fifth Circuit Court. He will be @POTUS' 12th nomination confirmed to the Circuit Court."]["Not only will #TaxReform bring relief to middle class Americans, it will also repeal Obamacare’s individual mandate tax and provide for our nation’s #energy future by further developing Alaska’s oil and gas potential."]["The bottom line on #TaxReform: We want to take more money out of Washington’s pocket and put more money into the pockets of the middle class. I’m confident the conference committee will finalize a bill that does just that."]["Passing pro-growth #TaxReform is the single most important action we can take right now to grow our #economy and help the middle class get ahead. @POTUS &amp; this Republican-led Congress are working to deliver relief to the American people. https://t.co/kUgPTrjHHF"]["Later today, the #TaxReform conference committee will host an open meeting to discuss the House and #Senate versions of the bill."]["Texas Supreme Court Justice Don Willett will be the 11th @POTUS nominee to the circuit courts confirmed by the #Senate this year. https://t.co/B1ZMx7jGdf"]["Texas Supreme Court Justice Don Willett is a man of “deep intellect and principle” https://t.co/B1ZMx7jGdf"]["To those celebrating the festival of lights, #HappyHanukkah https://t.co/SXKP9dn9TI"]["After the #Senate confirms our 10th @POTUS nominee for the Circuit Courts, Steven Grasz, we will move to our 11th, Texas Supreme Court Justice Don Willett to serve on the 5th Circuit Court."]["Today @POTUS signed #NDAA into law to give our servicemen and women the resources they need to keep our country safe. Big thanks to @SenJohnMcCain for his leadership in getting this bill done."]["Today, the #Senate will confirm Steven Grasz to be a judge on the 8th Circuit Court of Appeals, our 10th circuit court confirmation this year. https://t.co/giOwG2RoMv"]["Steve Grasz, the 10th nominee to the circuit courts to be considered by the #Senate this year, is a man of ‘integrity, humility and decency.’ \nhttps://t.co/fFiIAZMbnS"]["I would like to once again commend Chairman @ChuckGrassley for his leadership of the @senjudiciary Committee. His excellent work has allowed us to bring @POTUS' circuit court nominees to the #Senate floor."]["This week, the #Senate will consider 3 more of @POTUS' outstanding individuals nominated to serve on our nation’s federal circuit courts, in addition to the 9 we have already confirmed this year."]["As we continue to learn more details about the attempted #PortAuthority terror attack this morning, I would like to commend the law enforcement and intelligence community who quickly reacted to the attack."]["Steve Grasz, the 10th nominee to the circuit courts to be considered by the #Senate this year, is a man of ‘integrity, humility and decency.’ https://t.co/giOwG2RoMv"]["The #Senate just passed a 2-week funding bill that will maintain our military &amp; provide states with the certainty to continue children’s health insurance program (CHIP) while a longer bipartisan agreement is finalized."]["This afternoon I’ll meet with @POTUS &amp; Congressional Leadership to continue working together in a serious, bipartisan way to address a number of priorities for our nation in the coming weeks."]["Thank you @SenatorStrange for your extraordinary commitment to the people of Alabama."]["#ICYMI - Yesterday, the #Senate voted to join the House to consider our #TaxReform bills in a conference committee. It’s another important step toward delivering much-needed relief to the men, women, and families we represent. https://t.co/EvdPSkTRwI"]["The #Senate will vote to confirm the nomination of Joseph Balash to serve as the Assistant Secretary of the @Interior for Land and Minerals Management. He’s shown his talent and passion for affordable sources of #energy and environmental protection."][".@SenatorRounds \"The #TaxReform bill…takes meaningful steps to reform our tax code in a manner that will allow businesses to flourish again &amp; families to keep more of their hard-earned dollars\" https://t.co/vLtykOzrNb"]["A vote for this short-term CR will help maintain our military &amp; continue the important work of federal agencies. And it will provide states with the certainty to continue to CHIP until a bipartisan reauthorization agreement is finalized."]["The @washingtonpost fact checks another claim by Democrats on the GOP #TaxReform bill, and their findings shouldn't surprise you https://t.co/60zaZpOURe https://t.co/Qg0DFKuO4e"]["With the cooperation of our Democrat colleagues, Congress will pass a short-term CR before the end of this week."]["Last night, our colleagues in the House voted to send #TaxReform legislation to a conference committee, adding progress in our years-long effort to deliver real relief to the American people. I look forward to the #Senate voting to join the conference this week."]["Tomorrow morning, I will be joining @hughhewitt at 8:05 Eastern / 7:05 Central to discuss the importance of #TaxReform."]["The #Senate has confirmed the nomination of Kirstjen Nielsen to be the Secretary of @DHSgov. Our nation faces myriad threats, and I look forward to working with Ms. Nielsen to address each of them."]["The CR is a clean bill with no controversial policy-riders. It also includes a provision to assure states of the future of CHIP while a bipartisan reauthorization agreement is completed."]["By approving a short-term CR, we can continue the crucial functions of the federal government while we work with our colleagues in the House and @POTUS to finalize a long-term plan."]["#ICYMI ➡️ the #Senate passed a critical #TaxReform bill to jumpstart the American #economy by putting more money into the pockets of hardworking families &amp; creating more #jobs. https://t.co/Xtv3shKPKA"]["The #Senate will take a serious step today to strengthen our nation’s security by confirming Kirstjen Nielsen to lead @DHSgov. With her understanding of the challenges facing our nation and her experience in prevention and preparedness, she will excel as the next Secretary."]["I would again like to thank the Chairman of @GOPSenFinance, @senorrinhatch, for his leadership through years of work, dozens of hearings, and a full markup of the #Senate #TaxReform bill. https://t.co/Xtv3shKPKA"]["#TaxReform, along with @POTUS' regulatory relief, is why the #economy is beginning to look up. @FaceTheNation https://t.co/RX7qCX3XrK"]["Soon, the House and the #Senate will meet in a conference to produce a final #TaxReform bill so we can send it to @POTUS' desk."]["Thank you to @POTUS and @VP, who fought for the promise they made to the American people to cut their taxes. Their tenacity, commitment to the effort and engagement with the #Senate were invaluable. #TaxReform"]["The House has released its legislative text, one without any controversial policy riders, to fund the government through December 22. The #Senate will pass it before the end of this week."]["Today, the #Senate will vote to advance @POTUS' nominee to lead @DHSgov, Kirstjen Nielsen."]["The #Senate #TaxReform bill will help boost the #economy and keep #jobs here in America. @ThisWeekABC https://t.co/KSBBUHVDbY"]["#ICYMI - The #Senate passed our once-in-a-generation #TaxReform bill. See what's in it for you. via @WSJopinion\nhttps://t.co/Xtv3shKPKA"]["#Senate Republicans believe that #TaxReform will jump start the #economy and help the middle class, while Democrats seems to be quite content with slow growth and little opportunity. @FaceTheNation https://t.co/9ckLS68ZAK"]["#ICYMI - I joined @ThisWeekABC to discuss the importance of the #Senate #TaxReform bill and how it will benefit the middle class. https://t.co/rHlCA7lWkx"]["My @WSJ op-ed lays out how the #Senate’s #TaxReform bill will help working families and #SmallBusiness while promoting #energy independence. \nvia @WSJopinion \nhttps://t.co/Xtv3shKPKA"]["The #Senate has passed #TaxReform to boost our #economy, help grow #SmallBusiness, and give our nation more #energy independence. https://t.co/MTWn1AAEXi"]["This morning I will joining both @ThisWeekABC and @FaceTheNation to discuss #Senate passage of our once-in-a-generation #TaxReform bill."]["BREAKING → The #Senate has passed this once-in-a-generation #TaxReform bill. https://t.co/VAF7BtiMlN"]["Let’s finish the work we started years ago. We can’t let this moment slip by. Let’s seize this opportunity to deliver real #TaxReform to our constituents. https://t.co/1q1QVscRiE"]["The #Senate #TaxReform bill ‘would boost the #economy’ and lead to ‘Higher wages and …an additional 925,000 full-time equivalent #jobs’ https://t.co/r2xe0lIWTq"]["#Smallbusiness and job creators need a tax system that makes it easier to grow, to invest, and to hire. We need to deliver #TaxReform to the American people. https://t.co/14dz8FiAYD"]["What do 100+ economists say we can do to accelerate growth in the #economy and lead to more American #jobs?\nPass #TaxReform.\nhttps://t.co/KBymemE7Hh"]["Our #TaxReform plan has earned the support of the @NFIB because it will help #smallbusiness grow, invest, and it will also make it easier for businesses to bring #jobs and investments home. https://t.co/G0RETyHoMF"]["By passing #TaxReform we are able to discourage corporations from moving jobs and investments overseas. Which will be a welcomed relief for America’s working families who endured a decade of lost jobs and opportunities."]["Thanks to the leadership of @senjudiciary Chairman @ChuckGrassley, the #Senate has confirmed 3X the amount of Circuit Judges for @POTUS in his first year than President Obama. https://t.co/OVYyJ4Bbnk"]["This is our once-in-a-generation opportunity to take more money out of Washington’s pocket and put more money into the pockets of hardworking families. #TaxReform\nhttps://t.co/b0y2nOjre5"]["I’m joining #smallbusiness owners from #Kentucky, @SenateGOP, &amp; Small Biz Administrator @SBALinda McMahon to discuss the urgent need for #TaxReform. Watch live here https://t.co/OZtQtwEETl"]["The #Senate has taken another important step tonight towards giving Americans the #TaxReform they deserve."]["The #Senate will soon take the important next step toward fixing the #tax code and helping middle class families keep more of their hard-earned money. We'll vote to begin debate on this once-in-a-generation opportunity for #TaxReform."]["#Senate #TaxReform bill is ‘Exactly what #SmallBusiness owners &amp; entrepreneurs need right now in order to grow’ https://t.co/G0RETyHoMF"]["The #Senate #TaxReform bill \"would boost the #economy’ and lead to ‘Higher wages and…an additional 925,000 full-time equivalent #jobs’\nhttps://t.co/r2xe0lIWTq"][".@GOPSenFinance's #taxreform bill is the result of years of work, dozens of hearings, &amp; a full committee markup. Thank you, @senorrinhatch. https://t.co/EHeZBt8DrG"]["Kentuckians could see, “the boost to after-tax incomes for middle-income families,” of nearly $2,000. #TaxReform https://t.co/lulMLTFKKK"]["Passing #TaxReform is the single most important thing we can do right now to shift the #economy into high gear and deliver much-needed relief to American families. https://t.co/G0RETyHoMF"]["For years, #Senate Democrats have called for #TaxReform. What happened? https://t.co/uJKugOYaNG"]["The #Senate has confirmed another of @POTUS' \"Extraordinary Circuit Court Judge[s]\"= 3X Circuit Court Judges President Obama appointed in his 1st year\n⬇️\nhttps://t.co/OVYyJ4Bbnk"]["“Lowering individual tax rates also offers generally positive economic effects.” Leading Economists on the GOP #TaxReform plan https://t.co/b0y2nOjre5"]["Economists agree that the House and #Senate GOP #TaxReform plans will grow the #economy and increase American families’ income. https://t.co/b0y2nOjre5"]["\"[This is] an excellent, excellent tax bill for #SmallBusiness.\" - @NFIB on GOP #TaxReform\nhttps://t.co/G0RETyHoMF"]["We are united on our goals for #TaxReform, and all of us – the House, the #Senate, @POTUS, and his team – are all working together to help hardworking American families. https://t.co/8889tDX49V"]["First and foremost, our #TaxReform proposal is good for families. https://t.co/4epWNQlB8G"]["I look forward to discussing with @POTUS this afternoon our shared goals as we continue collaborating to pass legislation, including #TaxReform, and send it to his desk for signature."]["This morning I will be joining the Chairman of the #SmallBusiness Cmte, @SenatorRisch, and Administrator of the @SBAgov, @SBALinda, to discuss the need for #taxreform. Watch live here ⬇️ https://t.co/Y6JH97o3Qg"]["Here's what leading Economists have to say about the GOP #TaxReform bill\n⬇️\n“Reducing corporate tax rates, as proposed, will increase economic activity.” https://t.co/b0y2nOjre5"]["Here's the bottom line: we want to take more money out of Washington &amp; put more money into the pockets of the middle class. #TaxReform https://t.co/1vIpXE3euk"]["Today, the #Senate will consider 2 more @POTUS noms to the federal judiciary.\n1st, we'll vote to confirm Dabney Friedrich to serve as a district court judge for DC. Then, advance the nomination of Gregory Katsas to serve on the U.S. Court of Appeals for the DC Circuit."]["This week, the #Senate will continue our years-long efforts toward #taxreform. Under the leadership of Chairman @senorrinhatch, the Senate @GOPSenFinance Committee reported out legislation to replace our complex and outdated tax code."]["#TaxReform represents the single most important thing we can do right now to grow our #economy, help support good #jobs, and boost the middle class. This is our once-in-a-generation opportunity, and we should meet the challenge. https://t.co/xyFbOvKFbU"]["Wishing all a happy, healthy, and safe #Thanksgiving. https://t.co/GJo0VacRB9"]["Wishing all a happy, healthy, and safe #Thanksgiving. https://t.co/xzOl7pmA4Z"]["Thank you Chairman @lisamurkowski &amp; @EnergyGOP for reporting legislation to secure our nation’s #energy future. This can generate new wealth, support high-paying #jobs, and strengthen our national security."]["Kentuckians could see, “the boost to after-tax incomes for middle-income families,” of nearly $2,000. #TaxReform https://t.co/KNeFIHKOAI"]["Repealing an unpopular tax from an unworkable law to give middle class families more #TaxRelief just makes sense. Especially since the individual mandate tax hits so many low and middle income Americans."]["There’s another important provision of the @GOPSenFinance #TaxReform. It repeals #Obamacare’s individual mandate tax in order to deliver even more relief to the middle class"]["The #Senate has passed the #NDAA, and it's on its way for @POTUS' signature. Thank you @SenJohnMcCain for your hard work in making sure that our men and women in uniform receive what's necessary for their missions, including a pay raise."]["With House passage of the Tax Cuts and Jobs Act, we are one big step closer to putting more money in the pockets of millions of struggling American families so they can pay their bills, save for their future and invest for their children.\nhttps://t.co/VlFVZOXvI0"]["Today the #Senate will continue to fulfill its important responsibility of providing advice and consent on @POTUS' nominations. This week, we have confirmed talented individuals in @USDOT, @USDOL, and @DeptofDefense."][".@GOPSenFinance Committee Chairman @senorrinhatch has laid down a #TaxReform proposal that is premised on a simple idea: that we should take more money out of Washington’s pocket, and put more money in the pockets of the middle-class."]["Our tax code is broken.\n\n1: rates are too high &amp; Americans are sending too much of their hard-earned money to Uncle Sam\n\n2: its structure is too complicated &amp; it’s too easy for well-connected to exploit\n\n3: it encourages Americans jobs &amp; companies to move overseas\n\n#TaxReform"]["Does anyone know what caused Democrats to suddenly change their mind on #TaxReform? https://t.co/uJKugOYaNG"]["Passing #TaxReform is the single most important thing we can do right now to support those left behind by the Obama #economy. https://t.co/S2DKvu4L4i"]["Thank you to the Speaker of the Iraqi parliament, Dr. Saleem Al-Jubouri, for stopping by today. https://t.co/OY3X7DXl3P"]["The #Senate #TaxReform bill \"would boost the #economy’ and lead to ‘Higher wages and…an additional 925,000 full-time equivalent #jobs’ https://t.co/r2xe0lIWTq"]["Since Chairman @senorrinhatch has been the top Republican on the @GOPSenFinance Committee, it has hosted 70 hearings in the last 6 years. https://t.co/TXvEJCIqYs"]["Alex Azar &amp; I had a productive meeting and discussed his outlook and vision for @HHSGov. I also asked him to make combating the #OpioidEpidemic, a crisis that has devastated families across #Kentucky and the nation, a top priority. https://t.co/U9OoERhW1w"]["In addition to the #TaxReform markup in @GOPSenFinance, @EnergyGOP will begin its consideration of an important proposal to support good #jobs, our #energy future, and our national security."]["The #Senate is still working hard to confirm more of @POTUS' excellent nominees. Today, we will confirm David Zatezalo as the Assistant Secretary of @MSHA_DOL and Mark Esper to be Secretary of the @USArmy."]["I hope Democrats will continue to stand by their strong statements in support of #TaxReform today, because while the occupant of the Oval Office may have changed the need certainly hasn’t.\n https://t.co/uJKugOGzp6"]["We have a lot of work ahead of us but we are committed to getting #TaxReform done for the American people. I hope that #Senate Dems join us. Neither the ideas nor the need has changed. The only change has been the occupant of the White House. https://t.co/uJKugOYaNG"]["Kentuckians could see, “the boost to after-tax incomes for middle-income families,” of nearly $2,000. #TaxReform https://t.co/YUcXz8QsxD"]["Soon the @EnergyGOP Committee under the leadership of Chairman @lisamurkowski will begin to markup legislation supporting our nation’s #energy security. Further developing #Alaska’s oil and gas potential in an environmentally responsible way."]["#ICYMI → \"Middle class biggest winners in #Senate tax plan, study says\" via @politico #TaxReform"]["The @GOPSenFinance #TaxReform bill would boost our #economy and bring more #jobs to hard-working Americans https://t.co/ecZ1LMoQuA"]["The #Senate #TaxReform bill \"would boost the #economy’ and lead to ‘Higher wages and …an additional 925,000 full-time equivalent #jobs’ https://t.co/r2xe0lIWTq"]["Today, the #Senate will advance the nomination of David Zatezalo to serve as the Assistant Secretary of Labor for @MSHA_DOL. A position of importance in my home state of #Kentucky where mining supports thousands of good jobs. I strongly support his nomination."]["“Moderate-income people would consistently see the largest percentage declines in their tax bills...\" via @politico #TaxReform https://t.co/ev4oWGvmko"]["This week, the #Senate will start by considering two of @POTUS' nominees for @USDOT."]["The #Senate #TaxReform bill \"would boost the #economy’ and lead to ‘higher wages and…an additional 925,000 full-time equivalent #jobs’\nhttps://t.co/r2xe0lIWTq"]["#ICYMI → 'Middle class biggest winners in #Senate tax plan' \nvia @politico\n#TaxReform\nhttps://t.co/m5x26ufdNK"]["The @GOPSenFinance Committee has been laser-focused on reducing taxes and providing #TaxReform for the middle class https://t.co/5SQfqyQJKx"]["Under the leadership of Chairman @senorrinhatch, the @GOPSenFinance Committee will consider a #TaxReform plan that has been years and dozens of hearing in the making."]["I've never forgotten my father's service &amp; will remember it for the rest of my life. Thank you to all those who have served. #VeteransDay https://t.co/LnytT7Z1Bu"]["The Greatest Generation fought a war that had to be fought. Thank you to all those who have served our great nation. #VeteransDay. https://t.co/NwBpaWmCeJ"]["The most important Veteran in my life was my father. He sacrificed to keep our nation safe. Thank you to those who've served. #VeteransDay https://t.co/J2dzxOl6GB"]["To all those that have served, we simply say thank you. #VeteransDay. https://t.co/awPfJgUwp9"]["@amyklobuchar I’m glad the #Senate could get this passed tonight. Sexual harassment is completely unacceptable—in the workplace or anywhere else."]["The @GOPSenFinance, under the leadership of Chairman @senorrinhatch, has put forward much needed #TaxReform that will give hard-working, middle-class families more money in their pockets, more economic opportunity and security, and more jobs here at home. https://t.co/GP9qAYB1zL"]["#ICYMI → #Senate Democrats claim your tax cut is a tax hike. That claim is immediately debunked→ https://t.co/5Kr4TYApoQ https://t.co/udz1woKfJc"][".@EnergyGOP has unveiled legislation to generate a billion dollars of new revenue by further developing the oil and gas potential in #Alaska in an environmentally responsible way. https://t.co/hZYrpVkULc"]["Chairman @senorrinhatch &amp; @GOPSenFinance will lay out the legislative proposal for #TaxReform. It’s the product of a lot of hard work, and I look forward to its release later today. https://t.co/e1dQqTMbjR"]["Confirming @POTUS' talented nominees to the federal government will continue to be a priority of this #Senate, and I look forward to working with my colleagues to get this done."]["#Obama's Office of Air and Radiation in the @EPA was responsible for 95% of the annual regulatory burdens that the EPA forced onto our #economy, according to one report, costing the economy at least $41 billion."][".@POTUS' nominees, like Mr. Wehrum, will continue the work of this @EPA to undo the damage of the #Obama Administration’s overreach."]["I hope that #Senate Democrats will put partisanship aside and help us deliver real relief to families. I hope they will help us close loopholes that only benefit the elite. #TaxReform https://t.co/EA6lEKmzNd"]["As we continue on #TaxReform, I urge Dems to join us. Many prominent Senate Ds have expressed support for tax reform and for many of our ideas. Our priorities haven’t changed. The American people haven’t stopped hurting either. What changed for Dems? https://t.co/uJKugOYaNG"]["By lowering taxes across the board, we can help middle-class families keep more money in their pockets. By making the tax code fairer, we can support the millions of Americans who felt forgotten by the #economy over the past decade. #TaxReform"]["#TaxReform is our once-in-a-generation opportunity to help create #jobs, boost the #economy, and close special-interest loopholes."]["I had a great meeting with @POTUS' selection to lead the @federalreserve, Jay Powell, &amp; I look forward to supporting his nomination. https://t.co/nS3cIINQHv"]["The House and the #Senate are continuing to move forward to deliver #TaxReform through both @WaysandMeansGOP and @GOPSenFinance"]["#TaxReform represents the single most important action we can take today to support #SmallBusiness and the middle class."]["Our complex tax code is in desperate need of reform, &amp; we now have a once-in-a-generation opportunity to overhaul it with #TaxReform."]["Confirming @POTUS' nominees is an important part of the #Senate’s business, &amp; I urge my colleagues to work together so we can get this done."]["Last week, the #Senate  was able to confirm 4 of @POTUS' judicial noms for lifetime positions on circuit courts https://t.co/XINygIRIKY"]["Under @RepKevinBrady's leadership, the House @WaysandMeansGOP began marking up the #TaxReform legislation they unveiled last week."]["Exactly one week ago, I said the #Senate would confirm 4 excellent judicial nominees by the end of the week. That's exactly what happened."]["Families lost so much yesterday in #SutherlandSprings. Our hearts go to them in this time of untold grief."]["We are all thinking about my fellow Kentuckian @RandPaul, hoping he’ll recover quickly &amp; return to the #Senate very soon."]["Elaine &amp; I join w fellow Senators in sending condolences to the Sutherland Springs community, our prayers are w the victims &amp; their families"]["The #OpioidEpidemic is a serious issue that needs our full attention. Thank you @POTUS for calling it what it is, a public health emergency https://t.co/p98YRfRMZG"]["My interview with @hughhewitt will air 8:00 AM Eastern tomorrow morning on @MSNBC. We talk about #TaxReform &amp; @POTUS circuit court noms."]["Democrats new position on #TaxReform:\n‘We have to make sure this doesn’t happen’\nhttps://t.co/Q8JlDRE3ws"]["My statement on @POTUS' choice of Jerome Powell to lead the @federalreserve https://t.co/NvPNVu4qOD"]["#TaxReform is the single most important thing we can do today to get the economy reaching for its true potential again. https://t.co/rs2BFntmmn"]["#ICYMI → #Senate Democrats claim your tax cut is a tax hike. That claim is immediately debunked.\n↓\nhttps://t.co/5Kr4TYS0Nq https://t.co/4W2bMNfUsU"]["The House took a big step forward in our effort to help Americans w an #economy that reaches for its full potential https://t.co/iF496zzcFS"]["@hughhewitt @MSNBC @GOP It’s always a pleasure talking with you @hughhewitt https://t.co/sT0H4Zk7TQ"]["Together w @POTUS &amp; @ChuckGrassley, we'll continue to put judges on the courts who will uphold the law as it’s written, not as they wish it."]["When confirmed today, Justice Allison Eid will be the 1st female Coloradan to serve on the Tenth Circuit. https://t.co/WyYBmF75oO"]["The #Senate has confirmed 2 smart, strong, and talented women to serve on our nation’s circuit courts this week, &amp; today we'll confirm a 3rd"][".@POTUS has signed another CRA to overturn a reg that threatened to drive up costs for Americans with credit cards. https://t.co/xHZEKL61LV"][".@SenToddYoung is right → ‘We do not have religious tests for office…period’ https://t.co/BaDQhIctE8"]["Thank you @POTUS for continuing to nominate smart, well-qualified, and impartial individuals to our nation’s federal courts."]["I look forward to voting to confirm Justice Larsen today, and I urge all of my colleagues to join me."]["Today the #Senate will confirm Joan Larsen to the 6th Circuit, the 2nd of 4 @POTUS circuit court nominees to be confirmed this week."]["We stand with the people of #NYC in the wake of this act of terror. We mourn those killed &amp; injured, and are grateful to the 1st responders."]["There are no religious tests for public office in this country. Period.  https://t.co/ofc61wCNV7"]["“The case against Prof. Barrett is so flimsy, that you have to wonder whether there isn't some other, unspoken, cause for their objection.”"]["“Mr. Trump has nominated first-rate judges\" - @wsj https://t.co/EdhhCMzVZ1"]["See what the President of @NotreDame had to say about Professor Barrett, @POTUS' selection for the 7th Circuit. https://t.co/HGFPWiMN7r"]["@USGAO I’d like to thank @POTUS for his commitment to confronting the #OpioidEpidemic and for declaring it a public health emergency."]["I requested a @USGAO study to ensure that our money is targeted to most effectively fight the #OpioidEpidemic. https://t.co/c21tmUCPua"]["The 1st of 4 circuit court noms the Senate will confirm this week is Professor Amy Barrett, @POTUS' selection for the 7th Circuit."]["I filed cloture last week on 4 well-qualified circuit court nominees. We’ll confirm all of them this week."]["Today the #Senate will vote to confirm Trevor McFadden, who was unanimously approved by the Judiciary Cmte, as a district court judge for DC"]["For those in #Kentucky, you can find the closest drop off location by clicking the link below. https://t.co/xM4d27xTdN"]["One bill or program is never going to solve the #opioidepidemic. Only a sustained effort can. We must work at all levels of government."][".@POTUS will help our country take another step forward in combating the #opioidepidemic by recognizing it as the emergency it is."]["Despite Democrats making the #Senate waste time on procedural cloture votes for @POTUS' judicial nominees, we will confirm them."]["Congress scraps yet another bureaucratic rule, continuing the \"most ambitious regulatory rollback since Reagan\" https://t.co/EwSSBl9zh5"]["I applaud @POTUS for his pick to lead @OSMRE. Steven Gardner of #Kentucky will be a strong leader. Looking forward to #Senate consideration."]["Democrats wasting time ➡ Dems force 7 needless cloture votes on @POTUS' 2017 judicial noms vs. 1 under Obama in 2009 https://t.co/Y4OVLDytJp"]["Today we celebrated the Filipino people &amp; their unparalleled bravery and sacrifice in WWII by presenting them the Congressional Gold Medal. https://t.co/2FtSH2xT68"]["Reversing a regulation that ‘would hurt consumers and the #economy’\nhttps://t.co/laukBwbec8"]["Yesterday's productive lunch with @POTUS focused on how to bring tax relief, economic growth, &amp; jobs to the middle class through #TaxReform."]["#Senate Dems are intentionally wasting everyone's time but slowing down the judicial nomination process, even w/ non-controversial nominees"]["ICYMI: The #Senate has passed additional disaster relief to aide those effected by the hurricanes &amp; wildfires https://t.co/JSjZ4NgfFN"]["Thank you @POTUS for joining the @SenateGOP &amp; @SenJohnBarrasso for lunch this afternoon. We are all united to help Americans with #TaxReform https://t.co/Pm1z4UHaMH"]["Senator @JeffFlake has been a great team player always trying to get a constructive outcome no matter what the issue before us. https://t.co/HVVc1wD7Yy"]["Soon, the hurricane and wildfire emergency funding legislation will be on the way to the @WhiteHouse for @POTUS' signature."]["We want to make taxes lower, simpler, &amp; fairer. We want to make it easier to create new jobs in America &amp; keep them here. #TaxReform https://t.co/0vCibMJ552"]["Today, the #Senate will take a vote to advance the most recent supplemental funding request to support the ongoing hurricane relief efforts"]["The #Senate's agenda is the same as @POTUS. Working together to form an agenda to help the American people. https://t.co/Xp5JT83JL0"]["#TaxReform is all about helping the middle class succeed. It’s about making it easier to create jobs in America and keep them here. https://t.co/DdXkZqCp4o"]["Reminder, the US #economy did not have a single year of 3% growth under President Obama. It's time to change that. It's time for #TaxReform. https://t.co/ljtPeL1Egz"]["The #budget we passed last wk isn’t just about getting our fiscal house in order, it’s also about getting our #economy going &amp; growing again"]["The #Senate, along w @POTUS, will deliver on #TaxReform by the end of the year. Let's give the American people the tax relief they deserve. https://t.co/lHtO54RLRd"]["We all know the positive growth that came out of Reagan's #TaxReform 31 years ago. The American people deserve the same type of growth. https://t.co/opEVUg64eK"]["Make sure to watch @CNNSotu &amp; @FoxNewsSunday this morning where I’ll be discussing our once in a generation opportunity to pass #TaxReform"]["This Sunday I will be joining @DanaBashCNN on @CNNSotu &amp; @DanaPerino on @FoxNewsSunday to talk about the importance of #TaxReform."]["The #Senate is ready to provide tax relief and help bring jobs back to America. It’s time to pass #taxreform. https://t.co/p7TG8491C0"]["Now that we have passed the 2018 #budget, it's time to take advantage of this once-in-a-generation opportunity &amp; pass #TaxReform. https://t.co/tlgajKK4Wx"]["The #Senate has passed the 2018 #Budget. Thank you @SenatorEnzi &amp; @BudgetGOP for all of your hard work. Now it's time for #TaxReform. https://t.co/JCi6zb4J5d"]["#TaxReform represents the most important thing we can do today to get our #economy reaching for its true potential."]["Governor @ricardorossello, the #Senate stands with the people of #PuertoRico and will continue to help. https://t.co/Iuq7QtnLF1"]["\"If you oppose losing farmland to strip malls…you should stand w me &amp; work to repeal the Estate Tax\" - #Senate Dem https://t.co/VvzzX2LdSB"]["\"we have a prime opportunity to...provide relief...a fairer, simpler tax code.\" @SenDeanHeller on #TaxReform\nhttps://t.co/XThNDYFEmH"]["Passing this #budget is critical to passing #TaxReform, so we can strengthen our #economy after years of stagnation under President Obama."]["Does anyone know what caused Democrats to suddenly change their mind on #TaxReform? https://t.co/uJKugOYaNG"]["“We need to provide true [#TaxReform] to our small businesses, the job creators in our economy\" @SenatorCollins https://t.co/IZrsUS62HJ"]["Our #budget puts our country on the road to better &amp; more sustained economic growth by providing legislative tools to advance #TaxReform"]["The #budget @SenatorEnzi &amp; @BudgetGOP produced is important to our fiscal and economic future, and we will continue working on it today."]["Our #budget delivers fiscal responsibility\n✔️ reins in gov spending\n✔️ protects Social Security\n✔️ complies fully with spending caps"]["Sen. @TedCruz, an advocate of tax relief &amp; job growth for the middle class, makes the case for #TaxReform vs. tax hikes on @CNN tonight."]["Taxes should be lower, simpler and fairer for middle class workers. #TaxReform\nhttps://t.co/XThNDYFEmH"]["I had a productive discussion with Kirstjen Nielsen this afternoon and I'm confident she will be a great leader for @DHSgov. https://t.co/zzCxwp9Vbx"]["Our archaic tax code is standing in the way of America's economic future. Simply put, we need #TaxReform. https://t.co/AzZECP2Fks"]["In today’s #economy, we can't afford a tax code that forces Americans to compete w a hand tied behind their back. We need to act. #TaxReform https://t.co/8p6AYdRSgd"]["There’s no need for Ds to continue inventing reasons to oppose #TaxReform, they supported until @POTUS came along. https://t.co/uJKugOYaNG"]["I agree with @SenJohnThune, #taxreform is what this country needs to succeed https://t.co/FRw9fYaRKj"]["Our tax code is holding back families &amp; small biz jobs, &amp; incentivizes companies to send jobs and investments overseas. We need #TaxReform https://t.co/5GQBfwbQkU"]["Our #budget will help put us on a more responsible fiscal path &amp; on course for a more fulsome #economy that lifts up the middle class"]["Congress &amp; the Trump Admin will work together to pass a #budget and to deliver #TaxReform that American workers and families deserve."]["What's caused Democrats to change on #TaxReform? https://t.co/uJKugOYaNG"]["The reason for #TaxReform is plain and simple https://t.co/TYh0EAIU51"]["Turning the page on President #Obama’s lost decade. https://t.co/wUYt2AkcgF"]["#TaxReform will give relief to our small biz &amp; make it easier to keep jobs at home. We're working to put Americans on a level playing field https://t.co/vRgWjvmyhv"]["#Medicare Reality Check: an 82% increase is not a \"cut\" \n#TaxReform\nvia @BudgetGOP https://t.co/AOBeZuEDI8"]["For families and individuals in Kentucky and across the nation, we think taxes should be lower, simpler, and fairer. #TaxReform https://t.co/AGSxEA71qS"]["This week, the #Senate will advance work on the #budget, to help rein in federal spending, help us achieve balance &amp; help our #economy grow"]["Completing work on the #budget &amp; advancing #TaxReform are critical to helping our #economy finally realize its true potential"]["Productive discussion over lunch with @POTUS &amp; @VP on moving the President’s agenda through Congress this Fall."]["I commend @EPAScottPruitt for ending @EPA Sue&amp;Settle where special interests groups use lawsuits to evade will of Congress &amp; American public https://t.co/Y3miacfr5k"]["The #Senate will continue to assist communities affected by the recent hurricanes &amp; we'll process @POTUS' supplemental funding request"]["I'm committed to working w/ @POTUS to constrain #Iran’s support for terrorism &amp; deny their path to a nuclear weapon https://t.co/hkxsLwK0Qo"][".@SenatorCollins' decision to remain in the #Senate is important not only for the people of Maine, but for the nation as a whole."]["\"This country must not miss this opportunity\" for #taxreform\nhttps://t.co/mTwrYwmdPY"]["As #obamacare continues to fail Americans, I’m pleased @POTUS is promoting affordable policies to better meet the needs of families."]["My statement regarding @POTUS’ intention to nominate Kirstjen Nielsen for @DHSgov Secretary https://t.co/2gGdFq5MiN"]["We want to lower taxes &amp; simplify rates. We want to take more money out of Washington’s pocket &amp; put more in yours. https://t.co/PJ2jQeenWf"]["#TaxReform should be simple &amp; clear → Take more money out of Washington’s pocket &amp; put more in yours. @NBCNewsTHINK\nhttps://t.co/lVXXkJWtYX"]["Thank you @POTUS and @EPAScottPruitt for repealing Obama-era harmful anti-coal job regulations https://t.co/XWBwIc2pLv"]["Our plan for #TaxReform is simple: Take more money out of Washington’s pocket and put more in yours.\n@NBCNewsTHINK\nhttps://t.co/PJ2jQeenWf"]["A fundamental overhaul of our tax code is a daunting task. Americans deserve real #taxreform ⏩ https://t.co/xh2XtxcWKt"]["Our future \"depends on enacting bold #TaxReform\" #MFGDay17\nhttps://t.co/6LiO4gP6if"]["When it comes to #TaxReform, we want to take more money out of Washington’s pockets and put more in yours. https://t.co/hAeM1bjdlK"]["A fundamental overhaul of our tax code is a daunting task. Americans deserve real #taxreform → https://t.co/xh2XtxcWKt"]["#Senate Dems used to loudly advocate for #TaxReform, but now that the President has changed, their desire to work with us has too."]["There’s no reason for #Senate Dems to launch attacks on the #TaxReform framework based on made-up details that aren’t actually in it."]["In short, our overall goal for #TaxReform is unleashing the full potential of the American #economy. https://t.co/xh2XtxcWKt"]["House passage of their #budget today is another critical step forward to achieve #taxreform."]["#TaxReform is the single most important thing we can do today to get our #economy back on the right track. https://t.co/MgMh6sYuO7"]["Under our #TaxReform plan, our first goal is to help families &amp; individuals succeed. Followed by biz, to create &amp; keep more jobs in the US. https://t.co/NmoHBMETCX"]["The people of this nation deserve better. They deserve larger paychecks, more jobs, and better opportunities to get ahead. #TaxReform"]["Under Obama, many hardworking middle class Americans felt forgotten. Paychecks didn’t grow. Opportunities for work seemed bleak."]["This funding request will ensure those providing critical support will have the resources to continue their work https://t.co/CONtIKKByc"]["It’s pretty simple when it comes to #taxreform https://t.co/CXfEPYjQi5"]["#TaxReform represents the single most important thing we can do today to get our economy back on track and give American workers a leg up. https://t.co/YlVmoy5awh"]["The Republican #TaxReform plan will turbo-charge the #economy\n⬇️\nhttps://t.co/o4uieNROYf"]["#TaxReform is welcome and long overdue ➡️ https://t.co/uSo95ZmHsi"]["Senator @JimInhofe is right. It's time for #TaxReform.\nvia @TheOklahoman\n@InhofePress\nhttps://t.co/EUtGumt2Ca"]["#TaxReform represents the single most important thing we can do today to get our economy back on track and give American workers a leg up. https://t.co/mK7jSuRXAp"]["Americans have suffered through stagnant paychecks, lack of steady work &amp; retirement that seems to slip further away. #taxreform https://t.co/VLYEFAnsFJ"]["The GOP's plan with #taxreform is simple https://t.co/Stiwuwqhj8"]["#Israel has been &amp; will continue to be our greatest ally in the Middle East. Thank you for all of your hard work on their behalf, @AmbDermer https://t.co/7fg4m9CLMN"]["The Left has made \"premature guesses based on partisan assumptions\" on #TaxReform\nhttps://t.co/jyGljENHQi"]["This #budget will help put us on a better track w reduced spending, it will also give Congress the legislative means to enact #taxreform."]["Our #budget gives a path to balance by slowing Washington’s spending, reducing taxes &amp; putting us on a trajectory for better economic growth"]["Along w/ those in the #Senate, I'm committed to continuing to do our part to support relief along with @FEMA, @DeptofDefense, and the Admin"]["We'll soon receive a supplemental funding request &amp; I expect Congress to act to ensure #PuertoRico &amp; #VirginIslands have resources they need"]["The #Senate just confirmed @AjitPaiFCC to continue his role as Chairman of the @FCC."]["What happened in #LasVegas is shocking, tragic, and for the families, it's devastating.\nhttps://t.co/dt0acsLMlA"]["Keeping #LasVegas in our thoughts this morning after the horrific news. If you're trying to locate missing loved ones, call 1-866-535-5654"]["The GOP's plan for #TaxReform will get America going and and growing again. https://t.co/bY2frPRBsR"]["The FAA reauthorization, #Texas, #Florida, #PuertoRico &amp; #VirginIslands aid legislation is now on its way to @POTUS. https://t.co/aaRBwdezod"]["I agree with @POTUS. It's time to take money out of Washington's pockets &amp; put it in the pockets of Americans. #TaxReform #TrumpAtNAM"]["This #budget is the first step to #TaxReform https://t.co/p2OoMlVXw3"]["A fundamental overhaul of our tax code is a daunting task. Americans deserve real #taxreform\nhttps://t.co/xh2XtxcWKt"]["Helping Americans keep more of their hard earned money in their pockets is the goal of #taxreform. https://t.co/kxdPTLtjSq"]["The #Senate stands ready to help the people of #PuertoRico &amp; the #VirginIslands, working with both @fema &amp; @DeptofDefense."]["The #Senate is considering Ajit Pai to lead the @FCC &amp; District Judge Ralph Erickson to become a District Judge on the Eighth Circuit."][".@POTUS @FLOTUS continued focus on #opioidepidemic is raising national awareness &amp; important for states like #Kentucky suffering from crisis"]["It's wonderful seeing @SteveScalise back at work in the Capitol. Welcome back, Steve."]["More Jobs✔️\nFairer Taxes✔️\nBigger Paychecks✔️\nThat's the unified GOP #TaxReform plan\n@GOPSenFinance\nhttps://t.co/ckcv31Z82B"]["As Chairman of @GOPSenFinance, @senorrinhatch knows about #taxreform. Read his op-ed here ↴\nhttps://t.co/Y0y26DkpzX"]["I agree with @POTUS. It’s time to give Americans the relief they’ve earned. #TaxReform https://t.co/EQDbOLvpdK"]["Earlier today I joined @SpeakerRyan @GOPSenFinance @WaysandMeansGOP &amp; others in unveiling a unified framework for fixing our broken tax code https://t.co/DjUZXKC30Q"]["🚨 Watch live the unveiling of the unified GOP #TaxReform framework 🚨\n@SpeakerRyan @GOPSenFinance @WaysandMeansGOP https://t.co/gHHjQM1JES"]["Americans deserve to keep more of their hard earned money. It's time for #taxreform. \nhttps://t.co/yrGVmbet9Q"]["Our unified GOP #TaxReform framework is focused on supporting American jobs, on making taxes fairer, &amp; on growing families’ paychecks."]["My statement on @SenBobCorker https://t.co/8WTa7Dtqj3"]["We want those in #PuertoRico &amp; #VirginIslands to know that we'll continue to work w @FEMA @DeptofDefense &amp; the Admin to help in the recovery"]["After years of Ocare failures it seems the best Dems can come up w/ is quadrupling down on a old idea that has already failed, single payer."]["If Obamacare’s failure has shown us anything, it’s that we need new ideas &amp; a better approach. That’s what #GrahamCassidy are pursuing now."]["Senate Ds have 2 thoughts on how to fix #Obamacare\n1. Do nothing\n2. A fully gov-run system that would take away even more of their decisions"]["The @NLRB is supposed to be a neutral umpire in labor disputes. It’s time it got back to that. Confirming Mr. Emanuel today will help do so."]["#TaxReform will be a boost to both small business and job creation.\nhttps://t.co/r3hBSumXPn"][".@LindseyGrahamSC ➡️ ‘Take the money &amp; power in Washington and send it back closer to the patient’ https://t.co/TnmL5iKkis"]["Giving the power back to the states is smart. Governors know their people far better than the federal government does. https://t.co/CXqA9uUEa0"][".@SenThomTillis \"NC is proof positive that successfully enacting #taxreform reaps tremendous rewards...\" via @WSJ https://t.co/RBjZLdqBPo"]["#TaxReform will help end America's competitive disadvantage \n⬇️ ⬇️ ⬇️ ⬇️\nhttps://t.co/25zie1x8Dn"][".@BillCassidy has spent his life caring for patients. He knows why this legislation is so important. https://t.co/zTIslMe5WB"]["L’Shanah Tovah to all those celebrating #RoshHashanah. Happy New Year."][".@LindseyGrahamSC is absolutely right. #Obamacare is failing because it was a bad idea from the start. https://t.co/rmrUBzvfES"][".@LindseyGrahamSC &amp; @BillCassidy's plan allows Governors to do what they think is best for their individual state."][".@LindseyGrahamSC &amp; @BillCassidy want states to implement better #healthcare ideas by taking more decision-making power out of Washington"]["The American people have suffered a lot under #Obamacare. Skyrocketing costs. Plummeting choices. Collapsing markets. This must change. https://t.co/zb0O3fF5cL"][".@POTUS &amp; many in Congress agree that passing #taxreform is the most important thing we can do to energize the #economy &amp; help middle class"]["The #Senate just passed a critical defense bill to keep our military ready for the threats our nation faces. #NDAA https://t.co/3Vqme3nDoT"]["Thank you @SenJohnMcCain for your leadership in helping to strengthen our militarily. Now let's pass the defense bill. #NDAA https://t.co/6RBpiqkq7O"]["Along with @RepHalRogers, I'm looking to refocus the Appalachian Regional Commission to better serve those it was designed to help."]["70 years strong. Happy birthday @usairforce. #AFbday https://t.co/u8YIXsVldN"]["Today we're reminded of those who have been through unbelievable hardships &amp; those taken captive by our enemies. #POWMIARecognitionDay https://t.co/8PfsqTDSyF"]["Today we're reminded of those who have been through unbelievable hardships &amp; those taken by our captive by our enemies #POWMIARecognitionDay https://t.co/nKH14YRA2y"]["ASSK is working to promote peace &amp; reconciliation, but #Burma’s path to a more democratic gov is not yet complete &amp; will not occur overnight"]["During our call, Aung San Suu Kyi agreed w/ need for immediate access of humanitarian assistance to the region &amp; is working toward it https://t.co/IueZ2I6pHn"]["I am deeply troubled by the humanitarian situation along the Burmese-Bangladeshi border and the violence in Rakhine state must stop."]["We should remember that we have an all-volunteer force. We must support them w/ the pay &amp; benefits they and their families are counting on. https://t.co/YesV14GAeS"]["My statement on border security &amp; #DACA https://t.co/1xF2SrtFOJ"]["It’s essential that we meet our commitment to those in uniform by providing the equipment &amp; training they need to get the job done. #NDAA"]["This afternoon I met with Tom Marino, @POTUS' @ONDCP nominee who’s focused on fighting the #opioidepidemic in #Kentucky &amp; across America https://t.co/sV4YG59QVG"]["This defense bill will allow @DeptofDefense to begin to rebuild our military &amp; give a well-deserved pay raise to our men &amp; women in uniform. https://t.co/zHMSE4wL1U"]["The Left is demanding an “actual government takeover of #healthcare”. https://t.co/zb3rkhFxKx"]["The Senate is saddened today w the news of the passing of our friend Senator Pete Domenici. We offer our deepest condolences to his family."]["This defense bill authorizes resources, capabilities, and the pay &amp; benefits that our men &amp; women in uniform need to perform their missions."]["The defense bill has already earned the bipartisan support of every member of the Armed Services Cmte. Every single member. Ds &amp; Rs. #NDAA"]["Now is the time to correct Pres Obama's failed foreign policy and harmful draw-down of our nation's defenses. We must pass the #NDAA."]["The defense bill \"..streamlines the process of getting our warfighters the equipment, training, &amp; resources they need…”@SenJohnMcCain #ndaa"]["#NDAA is always important, but it’s especially important in light of the security threats we face around the globe. #NorthKorea #Russia"]["This week, the #Senate will work towards passing one of the most important bills we consider each yr, the National Defense Authorization Act https://t.co/1SQkbywh8r"]["To help rebuild our military, the #Senate must pass the #NDAA.\nhttps://t.co/Wfl2nKFi8O"][".@SenJohnMcCain's commitment to our nation’s heroes is unfailing, which is why he has returned to the #Senate to manage #NDAA."]["We'll never forget the innocent lives taken from us 16 yrs ago. Nor will we forget those who have stood guard to protect us every day since. https://t.co/LiaJ0uFaZ4"]["For more than 50 yrs, Congress has acted every year to pass a defense bill. We will have our opportunity to do so again this week. #NDAA https://t.co/poiRKyGM6b"]["Our thoughts are with those whose lives have been impacted by #HurricaneIrma. The #Senate is again ready to help."]["Today, the #Senate opens with a moment of silence in remembrance of all those we lost 16 years ago. #September11th"]["As one nation, we reaffirm our promise: we will #NeverForget. #September11 https://t.co/oxlYt8mPQ1"]["For those in the path of #HurricaneIrma, please listen to your state and federal emergency officials, and stay safe."]["I'm happy to see the #Senate come together and pass emergency relief funding for #HurricaneHarvey &amp; #HurricaineIrma."]["The recovery effort for Harvey has strained resources to the limit already. Let’s work together to act on emergency funding quickly."]["As we work on immediate priorities, work will continue on items like #taxreform, national security, &amp; filling vacancies across the fed gov"]["This morning I'm going to the White House to speak w @POTUS, along w @SpeakerRyan, @GOPLeader, &amp; Dem leadership about 3 critical issues https://t.co/vQuGZieEVK"]["I agree, @POTUS. The American people deserve a tax system that works for them instead of against them. #TaxReform https://t.co/PE20WoFwsw"]["We must act quickly when it comes to the #DebtLimit given the new uncertainty from the large costs of storm recovery."][".@POTUS and I share the same 3 immediate priorities: Pass #HurricaneHarvey relief. Prevent a default. Fund the government. https://t.co/za2ouiBDtN"]["The #Senate begins this work period by again extending our heartfelt sympathies to those effected by #HurricaneHarvey."]["My statement on #DACA https://t.co/uGYZpAfg16"]["The #Senate stands ready to act quickly to provide this much-needed assistance to those impacted communities, first responders &amp; volunteers https://t.co/SjMxuiShE2"]["#taxreform needs to keep American families at the heart of our plan ⬇️\nhttps://t.co/WuW8fznRJa"]["Americans deserve #TaxReform that cuts taxes for families,small biz. Congress, Admin continuing work to help economy https://t.co/IDFkBkcwFZ"]["Our overseas presence should not be guided by arbitrary withdrawal deadlines. https://t.co/TkJbsID1CH"]["To that end, maintaining forces in Iraq and Afghanistan protects America's national security interests. https://t.co/TkJbsID1CH"]["The US cannot permit terrorist organizations to train, recruit and plot from ungoverned sanctuaries. https://t.co/TkJbsID1CH"]["I commend @POTUS &amp; his national security team for a thoughtful review of our engagement in South Asia. https://t.co/TkJbsID1CH"]["U.S. Senate community expresses condolences to the victims of the #Barcelona terrorist attack. America stands united w/ the people of Spain."]["Statement on hate groups and reports of a rally in Lexington: https://t.co/Ywf4u3mfYf"]["The hate and bigotry witnessed in #Charlottesville does not reflect American values. I wholeheartedly oppose their actions."]["Congratulations to Neil Chatterjee on being #Senate confirmed to serve at @FERC"]["I want to thank @POTUS and his Administration for working with Congress to improve #healthcare for our nation’s #Veterans."]["Our #Veterans deserve better. The #Senate took action this week to do just that.\n⬇️⬇️⬇️⬇️\nhttps://t.co/45lbfccJsI"]["The #Senate has now passed a critical and necessary @US_FDA bill to help speed up the drug approval process for patients in need."]["This week in the #Senate\n✔️ Confirming a new @FBI Director\n✔️ #Veterans Choice bill\n✔️ 11th Circuit Court of Appeals Judge\n✔️ @NLRB nominee"]["My expectation for #taxreform = move through the cmtes this fall, under regular order, then both House &amp; #Senate floor consideration"]["Comprehensive #taxreform is the most important action we can take to grow the #economy &amp; help families get ahead\n⬇️\nhttps://t.co/e4BozrgvDG"]["We want American biz to have the best chance to compete &amp; succeed globally, &amp; a system that encourages biz to bring jobs back. #taxreform"]["It’s been over three decades since #taxreform last happened. Now is our once-in-a-generation opportunity to fundamentally rethink it."]["I hope to build on the 8 @DeptofDefense nominees the #Senate confirmed last night by confirming even more of @POTUS’ appointees"]["The #Senate confirmed more @POTUS nominees: Christopher Wray to lead the @FBI &amp; a highly qualified Judge for 11th Circuit Court of Appeals"]["The #Senate will take a procedural vote on a @NLRB nominee later this morning, hoping to advance another of @POTUS' appointees."]["#ICYMI: Last night the #Senate passed #Veterans Choice bill, allowing vets to skip long wait times at @DeptVetAffairs"]["My statement on #Senate confirmation of Christopher Wray to lead the @FBI https://t.co/m1dBp29Xhj"]["Thanks to #Senate Democrats, the pace we are going would take 12 years to confirm all of @POTUS' appointments"]["#Senate Democrats continue to block @POTUS' nominees at an unprecedented rate\n⬇️\nhttps://t.co/WYkjKaRUGB"]["The #Senate needs to review &amp; reauthorize the approval process at the @US_FDA to give people these life-saving treatments they need."]["We must take care of our nation's Veterans, they deserve the best care possible. We need to pass the #Veterans Choice bill this work period."]["I hope #Senate Democrats will work with us in confirming yet another noncontroversial nominee, Christopher Wray, to lead the @FBI."]["This week, the #Senate will confirm the nomination of Kevin Newsom of Alabama to serve as judge on the 11th Circuit Court of Appeals"]["Passing the #Healthcare Freedom Act will let us work with the House on leg. that can go to @POTUS, repeal #Obamacare &amp; undo its damage"]["The #Healthcare Freedom Act repeals core pillars of #Obamacare and provides significant new flexibility to both states &amp; consumers"]["The #Senate just overwhelmingly passed sanctions holding #Iran, #NorthKorea, &amp; #Russia accountable for their actions."]["Joint Statement: #Taxreform is the single most important action we can take to grow our economy ⬇️ https://t.co/v6TIl3WMmH"]["I encourage Senators with #healthcare ideas, whether Republicans, Democrats, or Independents, to bring their amendments to the #Senate floor"]["Americans deserve better than #Obamacare's skyrocketing costs &amp; plummeting choices. We're working hard to give them better #healthcare."]["Wonderful news, @SteveScalise. We can’t wait to have you back. https://t.co/DA0kOqWxJ8"]["Yesterday, the #Senate took a critical step to finally leave the failed experiment of #Obamacare in the past."]["The American people deserve better than the pain #Obamacare has brought them. They deserve a new direction on #healthcare."]["Welcome back, @SenJohnMcCain. I know you're eager to get back to work, and we’re all very pleased to have you back with us now."]["If Senators agree, and vote ‘yes’ on the motion to proceed, we can move 1 step closer to sending legislation to @POTUS for his signature"]["For those in #Kentucky &amp; countless others across our nation, I will vote to allow the #Senate to finally move beyond #Obamacare’s failures."]["It’s time to do away with the continued failures of #Obamacare. It’s time to vote. https://t.co/zmyNHbKSn5"]["We can do better than #Obamacare, &amp; we have a responsibility to try. Today’s vote to begin debate is the first step. We should take it."]["A quick look back at why Senators should vote yes on the motion to proceed to address the failures of #Obamacare https://t.co/WuktPcCevs"]["The #Obamacare failures will continue to grow more severe, unless we act. That starts today with voting yes on the motion to proceed."]["Costs have been going ⬆️ &amp; choice has been going ⬇️ for years, thanks to #Obamacare. These trends aren't new. Americans deserve better. https://t.co/yhIxzffm49"]["Tomorrow, I will keep my commitment to vote to move beyond the failures of #Obamacare. I will vote yes on the motion to proceed."]["Tomorrow, the #Senate will vote to start robust debate on how to fix America's #healthcare problem, and move away from #Obamacare's failures"]["Costs have been going ⬆️ &amp; choice has been going ⬇️ for years, thanks to #Obamacare. These trends aren't new. Americans deserve better. https://t.co/eYvDvsmMz3"][".@SenJohnMcCain you've never shied away from a fight before. You'll confront this with the same courage that has characterized your life. https://t.co/6SOc2FjtSV"]["John Bush is a man of integrity and considerable ability. He will be an outstanding judge for the Sixth Circuit Court of Appeals."][".@SenJohnMcCain is a hero to our Conference and a hero to our country. https://t.co/Ld2lQH1mMn"]["More than 100 attorneys &amp; law professors have written in support of John Bush's nomination. Nearly 1/3 of these supporters are Democrats"]["Today the #Senate will vote to move forward on nomination of John Bush of #Kentucky to serve as a judge on the 6th Circuit Court of Appeals"]["The #Senate will vote on a repeal of #Obamacare combined w a stable, 2 year transition period as we work toward patient-centered #healthcare"]["My statement on an upcoming vote to repeal #Obamacare https://t.co/RdyDiUJfMD"]["Secretary Mattis still has not received his #2 at @DeptofDefense, thanks to #Senate Democrats' obstruction ➡️ https://t.co/r5Wcqm96Vf"]["Ambassadors to both China &amp; Japan received &gt; 80 votes for confirmation, yet #Senate Democrats delayed simply for delay’s sake"]["#Senate Democrats are obstructing @POTUS from forming his government, including key national security nominees. https://t.co/Q4un94eouE"][".@POTUS' nom for Deputy Sec of @DeptofDefense is \"an extremely well qualified candidate\" yet Ds continue to obstruct\nhttps://t.co/r5Wcqm96Vf"]["Senate Democrats are continuing to filibuster the nominee for Deputy Secretary of @DeptofDefense"]["I know we'll continue to offer @SenJohnMcCain best wishes for a speedy recovery &amp; continue to keep his family, his staff, in our thoughts."]["My statement on @SenJohnMcCain https://t.co/WSqc9axgzm"][".@POTUS is correct. Our #BetterCare bill will help stop the failures of #Obamacare. https://t.co/TpwsF61Or7"]["Remember this? https://t.co/FGWg16Knhp"]["With #BetterCare, I hope #Senate Dems take this opportunity to engage in a serious way to help fix our #healthcare system from #Obamacare"]["In 2018, nearly 40% fewer insurers have filed to participate in the #Obamacare exchanges, leaving thousands w/ the possibility of no options"]["#ICYMI - #Obamacare has been a disaster from day 1. It's time that Americans get #BetterCare. https://t.co/45KNEdrwAE"]["Costs have been going ⬆️ &amp; choice has been going ⬇️ for years, thanks to #Obamacare. These trends aren't new. It's time for #BetterCare. https://t.co/HY85wzGZFg"]["#BetterCare will give Americans more tools for managing their own #healthcare, not giving more power to the federal government."]["The primary aim of #BetterCare is to first stabilize &amp; reform collapsing insurance markets that have left millions of Americans w no options"]["It's clear that Americans are continuing to be hurt by #Obamacare's failures. It's time for #BetterCare. https://t.co/YM3EAV9RrI"]["ICYMI\n#Senate Democrats are now going to historic lengths in order to delay @POTUS' well qualified judicial nominees\nhttps://t.co/NZQVhpRBdW"]["32 trillion $1 bills would go farther than the distance from the Earth to Neptune. https://t.co/xGvujE5l5E"]["Americans are relying on us to bring them real relief. Let’s keep working hard to deliver #bettercare."]["#ICYMI - #Senate Democrats are now going to historic lengths in order to delay @POTUS' well qualified judicial noms https://t.co/NZQVhpRBdW"]["If we sit on our hands, Americans will continue to suffer the consequences of #Obamacare's failure. It's time that we have #bettercare."]["Flashback → #Senate Democrats thought a newly elected president should be able to choose their own nominees. https://t.co/NZQVhpRBdW"]["Senate Republicans support #bettercare: strengthen the collapsing insurance markets, put downward pressure on premiums &amp; lift up choice."]["32 trillion $1 bills would go farther than the distance from the Earth to Neptune. \n↓\n↓\nhttps://t.co/xGvujE5l5E"]["The #Senate sends its deepest condolences to the 16 members of the @USMC who lost their lives in yesterday’s plane crash. https://t.co/qiwdHF1vdT"]["The cost of Democrats’ #healthcare proposal would equal = 9 Of The Top 10 world economies...combined\nhttps://t.co/xGvujE5l5E"]["Democrats call for a $32 Trillion government #healthcare takeover \n↓\nhttps://t.co/xGvujE5l5E"]["We believe Americans they deserve better than #Obamacare and its years of failures. It's time for #bettercare. https://t.co/sRwP1k0g6n"]["This year, families in 70% of counties had just ONE or TWO insurance options on #Obamacare. https://t.co/qEOzn989Dy"]["Unless we act, #Obamacare choices will continue to decline on the exchanges just as they have over the past several years. https://t.co/bLOPmy7DLf"]["Happy Birthday, Mr. President. @TheBushCenter https://t.co/Y83d0nMAY8"]["Wishing everyone a happy and safe #FourthOfJuly 🇺🇸 https://t.co/roRQc57Pks"]["#Obamacare’s status quo is unsustainable and unacceptable. It demands action. The American people deserve #BetterCare."]["Under #Obamacare, choices have become fewer &amp; fewer, to the point of being nonexistent in some places https://t.co/MdtWupUThL"]["Productive discussion w South Korean President, Moon Jae-in this morning. Our nations have strong ties that we must continue to build upon. https://t.co/X7Etq4lB4r"]["Senators &amp; the @WhiteHouse are continuing discussions on our path to #BetterCare &amp; bringing relief from #Obamacare &amp; its collapsing markets"]["As the #Obamacare insurance death spiral intensifies, the #Senate must act https://t.co/rngJt1g9Jz"]["#Obamacare is a direct assault on the middle class &amp; it’s getting worse. It's time to move beyond its failures. https://t.co/M4WdVp7gIe"]["Thank you @POTUS for hosting a productive meeting on #healthcare as we continue to work on #BetterCare for all Americans."]["What's #Obamacare's legacy? 5 years of skyrocketing premiums w/ averages 105% higher in 2017 than 2013\nhttps://t.co/WNqWnAtRT2"]["#BetterCare reduces premiums, deficit, &amp; middle class taxes https://t.co/EVMTklV024"]["The American people deserve #BetterCare, which is exactly what we’re working to bring them."]["Free Speech does not exist to protect what’s popular, it exists precisely to protect what isn’t\n🔽\nvia @Medium\n🔽\nhttps://t.co/qIm9N4Zgc9"]["#BetterCare \"Will Repeal The Individual Mandate\"\n↓\nhttps://t.co/1V1tl3nC3m"]["#BetterCare will \"Free the states &amp;...the marketplace to discover ever-better ways to deliver services\" \n#healthcare\nhttps://t.co/KKDwZraHpv"]["Free Speech is a topic that I have fought for my entire career. Read more in my @Medium post → #SpeakUp4FreeSpeech\nhttps://t.co/qIm9N4Zgc9"]["Congratulations to both @SenatorIsakson and @marcorubio for all of their hard work in making sure our #Veterans get the care they've earned."]["Today @POTUS is signing an important bill into law to further protect our nation's #Veterans &amp; usher real reform to the @DeptVetAffairs"]["Americans have been through enough with the failing status quo of #Obamacare. It's time families get #BetterCare.\nhttps://t.co/1Jrgg0iwPi"]["We will expand tax-free health savings accounts and deploy targeted tax credits, so we can help defray out-of-pocket costs. #BetterCare"]["We agree on strengthening #Medicaid, preserving access to care w preex conditions, &amp; letting kids stay on parents’ health insurance until 26"]["With our new #healthcare solutions, we'll stabilize insurance markets that are collapsing under #Obamacare too. It's time for #BetterCare"]["With #BetterCare, we'll repeal the employer mandate, so Americans no longer see their hours &amp; take-home pay cut by employers b/c of it"]["With our new health care solutions, we will improve the affordability of health insurance. #BetterCare"]["We will repeal the individual mandate, so Americans are no longer forced to buy insurance they don’t need or can’t afford. #BetterCare"]["#Obamacare is not working. It's time we change that. https://t.co/rZ69Smulfu"]["More soaring #Obamacare premiums for next year:\n#Iowa 43%\n#Maryland 59%\n#NewMexico 80%"]["#Obamacare has failed the American people. It's time for #BetterCare. Watch here → https://t.co/yZPe3lxroQ"]["#Obamacare has been a disaster from day one. It's time that Americans received #BetterCare. https://t.co/M1mEJGTZW6"]["After this series of votes, I will be speaking on a topic important to us all, freedom of speech. Watch live here ↓\nhttps://t.co/mpBGT7AkBE"]["#Obamacare is on the edge of total collapse, we can allow it to continue hurting Americans, or we can take action to finally move forward"]["#Kentucky was held up as an #Obamacare success story. But Obamacare made a mess of #healthcare markets in KY, just like across the nation."]["#ICYMI double-digit premium increases next year: \n30% in #Washington\n40% in #Maine \n32% in #NorthCarolina"]["ICYMI: #Obamacare has been a failure from day one. https://t.co/hdoNmTeVyz"]["Americans in nearly 1 out of every 2 counties could find themselves left with just one option under #Obamacare next year"]["It's clear that #Obamacare just isn't working. https://t.co/ORdOyi2Bw6"]["Year after year, #Obamacare drives ⬆️ costs, drives ⬇️ choice, and continues to unravel before our very eyes"]["I'd like to offer the Senate's condolences to our friends &amp; allies impacted by the attacks in Europe."]["Good look back at how Democrats passed #Obamacare \nvia @WSJopinion\nhttps://t.co/h9CBcRBn4R"]["Does the Democrats' \"all out war\" to protect #Obamacare sound bipartisan to you? https://t.co/vfUt3kFclQ"]["I’ll be joining @SenSchumer for an interview with @andersoncooper on @CNN at the #CongressionalBaseballGame."]["I look forward to attending tonight’s bipartisan charity #CongressionalBaseballGame. https://t.co/pArgokTupy"]["The #Senate has passed a bipartisan bill to strengthen sanctions against #Iran &amp; #Russia"]["Soon, the #Senate will take a final vote on the bipartisan first step to hold #Iran and #Russia accountable."]["After 8 yrs of failed #Obama foreign policy, we must take a stronger stand in deterring #Iran &amp; #Russia’s years-long pattern of provocations"]["Yesterday’s events were devastating; we know it will take time to heal. But tonight’s @thehillbaseball game will go on."]["Let's continue to keep Whip @SteveScalise, Matt Mika, Zach Barth, and Capitol Police officers Crystal Griner &amp; David Bailey in our thoughts."]["My statement on the shooting this morning in #Alexandria https://t.co/5eWMSZxXtR"]["We're concerned for all those injured in #Alexandria. We'll keep them in our prayers &amp; continue to send them every wish for quick a recovery https://t.co/9lWTIedFvR"]["My prayers are with those wounded this morning &amp; their families. Continued appreciation to Capitol Police &amp; first responders."]["Last week, the #Senate passed a critical @DeptVetAffairs whistleblower protection bill, &amp; later today the House will vote to send to @POTUS"]["Senators will continue working together so that we can hold #Iran and #Russia accountable for their actions."]["Premiums have on average doubled, &amp; in some cases, tripled, in the vast majority of states on the federal #Obamacare exchange"]["The top reason hundreds of thousands of Americans cancelled their #Obamacare plan next year? The price tag is too high. According to @CMSGov"]["Due to #Obamacare ‘Big Insurance Rate Hikes Coming’ in 2018 https://t.co/5VtCsWKB4C"]["#ICYMI 18 #Ohio counties &amp; 2 #Washington counties learned that they could have ZERO #Obamacare insurance options in 2018"]["Today, the #Senate will vote to proceed to the #Iran sanctions bill. https://t.co/RYwsUGheIy"]["#Iran’s ongoing provocations: Missile tests, exchanges with #NorthKorea, and proxy wars https://t.co/RYwsUGheIy"]["Happy 93rd birthday to a great President and even better man, @GeorgeHWBush https://t.co/yzMKWETYYp"]["This morning I spoke at the #faithandfreedomcoalition about the importance of Free Speech. https://t.co/iVbtge6gmG"]["What happens when we can no longer talk to those w/ whom we disagree? How can we hope to move forward on anything? #faithandfreedomcoalition"]["Americans shouldn't have to live in fear bc they supported the \"wrong\" candidate or donated to the \"wrong\" cause. #faithandfreedomcoalition"]["Let’s not believe that the assault on free speech is simply isolated to college campuses, nor that this is a new threat."]["The First Amendment is absolutely critical to the functioning of our democracy. #faithandfreedomcoalition"]["I’m pleased to speak to the @FaithandFreedom Coalition again today."]["The so-called Affordable Care Act has really been anything but affordable for too many small business owners and their employees. #Obamacare"]["Since 2013, #Obamacare premiums have increased by an average of 105 percent and millions of Americans have lost their plans."]["#ICYMI the #Senate voted 91-8 to advance legislation giving the @WhiteHouse more tools to hold #Iran accountable for its actions."]["It's past time to put our #Veterans first. The @DeptVetAffairs needs accountability. https://t.co/Eljphm52I3"]["I look forward to working w @POTUS to improve the our roads, bridges, airports, &amp; waterways that service people and jobs across the country"]["#Senate Dems must choose: continue to defend the failures of #Obamacare or work w us to move beyond it towards smarter #healthcare solutions"]["As insurers continue to flee the marketplace, more Americans will lose their options &amp; get caught in the downward spiral of #Obamacare."]["#ICYMI nearly 70,000 people in parts of Missouri &amp; Kansas will lose their last insurance provider on the #Obamacare exchanges in 2018"]["States are \"running out of individual health plans\" thanks to the continued failures of #Obamacare https://t.co/nXBr5bJBqC"]["#DDay73 is a time to remember the Allied forces who stormed the beaches of Normandy and forever changed history. #DDay https://t.co/WgYPeDjRaP"]["Since 2013, #healthcare premiums on the #Kentucky #Obamacare exchange have skyrocketed by 75% https://t.co/3RlMp8AceG"]["This week marks the 50th anniversary of the beginning of the Six-Day War, resulting in the reunification of Jerusalem. https://t.co/D2rIrLZUZ8"]["Jim Bunning was a man of principle from start to finish, who stayed true to himself &amp; dedicated his life to serving the people of #Kentucky https://t.co/6mBog2FxaE"]["We once again express our gratitude to the first responders &amp; medical professionals who bravely stepped in to help. #LondonAttacks https://t.co/xplGQFHx0d"][".@POTUS is putting Americans 1st. Former President #Obama’s @UN ‘Treaty unfairly jeopardized the American #Economy’ https://t.co/3Rgbru3Iny"][".@POTUS is committed to protecting middle class families by dealing another significant blow to #Obama's #waroncoal. #ParisAgreement https://t.co/KArn6qJH2y"]["Today, our nation remembers those who have fallen in the line of duty defending our great nation. #MemorialDay https://t.co/cwmtmC465O"]["We are forever indebted to our nation's heroes for their service and their sacrifice to our great nation. #MemorialDay https://t.co/ZACD1vCE2E"]["#Senate Democrats have already effectively conceded that #Obamacare has failed, now will they work with us to actually fix this mess?"]["#Senate Republicans are working together to move past the problems of #Obamacare and to help those who have been hurt by it."]["Later this afternoon, the #Senate will vote to confirm Judge Amul Thapar of #Kentucky to the U.S. Appeals Court for the Sixth Circuit."]["This year, there are 26 states with at least one county where residents have just 1️⃣ insurance option under #Obamacare. https://t.co/j7NvPzVAXk"]["Rather than work with Republicans to fix #healthcare, Dems chose to pretend everything was fine and do nothing as more Americans were hurt."]["Since 2013, #Obamacare premiums have doubled in majority of states, and even tripled in a handful of others."]["What's happened in the years since Dems forced #Obamacare on our country? Health choices plummeted &amp; costs skyrocketed year after year"]["67,000 Americans in 32 #Missouri &amp; #Kansas counties lost their last insurer on the #Obamacare exchange https://t.co/G1kk8lwLg1"]["New @HHSGov report on more #Obamacare failures: ‘Average premiums were 105% higher in 2017 than in 2013’\n🔽\nhttps://t.co/rn731fZBcj"]["Today, the Senate will advance the nomination of Judge Thapar.  He is an excellent jurist who will make a great addition to the 6th Circuit."]["How much more will it take for Democrats to realize we have to move beyond the failures of #Obamacare?"]["In Iowa, over 70,000 people may be left with absolutely no options on the #Obamacare individual market next year."]["Families across the country could experience “an all-time low” when it comes to their choices for #Obamacare plans next year."]["More Americans are finding themselves with even fewer #Obamacare insurance options to choose from. https://t.co/elYYptp8rq"][".@HHSGov just revealed startling new numbers showing how substantial premium increases have been under #Obamacare. https://t.co/kJgDVxqjZA"]["Tomorrow morning, I will be joining @Reuters to discuss the continued failures of #Obamacare &amp; the need for #taxreform"]["#Obamacare continues to fail the American people. Are Democrats ok with dwindling choices? https://t.co/5Z4BzlFdwO"]["Republicans are committed to enacting #taxreform to help encourage American investment, boost job creation, &amp; promote wage growth"]["Comprehensive #taxreform is an area where GOP and #Senate Dems have come together in the past, let's hope we can come together again now."]["It’s been over three decades since we passed comprehensive #taxreform, and it’s past time that we do something about it."]["‘Rural shoppers face slim choices, steep premiums’ when it comes to #Obamacare ➡️ https://t.co/Brg3ASnRSn https://t.co/Y5t4bJmovj"]["Once Gov @TerryBranstad is confirmed as Ambassador to China, the #Senate will advance John Sullivan as Deputy Secretary of @StateDept"]["Today, the #Senate will confirm Iowa Governor @TerryBranstad to be America’s Ambassador to China."]["#Democrats are slow walking non-controversial nominees https://t.co/zrIwhB5FSe"]["Today, our nation celebrates #ArmedForcesDay and the men &amp; women who volunteer to keep America safe. https://t.co/IO7ZytkTJT"]["I commend @AjitPaiFCC for taking this step to address the #netneutrality issue, and to keeping the Internet open for consumers — permanently"]["Are our #Senate Democratic friends really ok with #Obamacare’s continuing attacks on the Middle Class?"]["Families have been left to shoulder the burden of #Obamacare, while things have only gotten worse over time."]["It’s simple, the consequences of #Obamacare are awful \n🔽\nhttps://t.co/lAS4MZacQe"]["I had a great discussion with President @JuanManSantos of #Colombia today in the @uscapitol. #VisitaAWashington https://t.co/sQq8lVp9Sf"]["26 states have at least one county where residents have only a single insurance option under #Obamacare."]["This week people on #Obamacare exchanges in #VT, #VA, &amp; #OR, learned they could face double-digit premium increases as high as 20% next year"]["Half of the counties in #Kentucky only have ONE #Obamacare insurer this year. One choice is not really a choice at all. https://t.co/PLdFOZeYjK"]["My statement on DAG Rosenstein's decisions to appoint a special counsel https://t.co/s7i5LjPcg1"]["The American people deserve a #tax system that allows them to keep more of their hard-earned money &amp; empowers them to invest in their future"]["I hope that after years of telling us #taxreform was necessary, #Senate Ds won’t suddenly change their minds on the need for it now."]["After the slowest recovery since WWII we should take advantage of the once in a generation opportunity of #taxreform https://t.co/tQVvUZSMfT"]["This Republican Congress has made #taxreform a priority from the start, and we are working together to find solutions"]["8 years of the #Obama Administration were a virtual clinic in how not to get an #economy moving again."]["#ICYMI: #Obamacare premium increases in #Pennsylvania are more than 50% https://t.co/xofrYZMpXB"]["The status quo under #Obamacare is simply unsustainable &amp; unacceptable. Are #Senate Dems really ok w/ the continuing failures of Obamacare?"]["Senators: We simply cannot afford another warning sign on the failures of #Obamacare ↓ https://t.co/r7WDkrvAr6"]["#Tennessee has seen their #healthcare system wrecked by the failures of #Obamacare https://t.co/kAj9jx1tnI"]["#ICYMI: #Obamacare premium increases in #Arizona have reached startling new highs https://t.co/lxvmvazZJU"]["Unless we act, #Obamacare premiums will keep skyrocketing, pushing the financial burden onto the backs of more hardworking Americans."]["Are our Democratic friends, who promised to lower costs of #healthcare, okay with more massive #Obamacare premium increases this year?"]["Nearly 50% of #Kentucky counties have only 1 #Obamacare insurer. Are Democrats ok with this failed law hurting Americans everyday? https://t.co/evEm2bO8py"]["I'll be joining Bloomberg @business this morning. You can watch my interview live here around 9:00 AM ➡️ https://t.co/39Icy66NEx"]["Thank you US Capitol Police who guard the heart of our democracy. We're grateful for your diligence &amp; service. #NationalPoliceWeek https://t.co/EbLytHhmPE"]["Today, the #Senate will vote to advance the nomination of Jeffrey Rosen to be the Deputy Secretary for the @USDOT."]["Thank you to the men &amp; women across our nation who put themselves in harm's way to protect us all. #NationalPoliceWeek https://t.co/jMA08l30M6"]["Insurers across the country saying ‘Goodbye To #Obamacare’ https://t.co/3GgTBQXd14"]["After 8 years of #Obama punishing #coal @MineWorkers &amp; families, we are finally working with a @POTUS who wants to help mining families"]["In just a few short months, we’ve turned a significant corner from how things operated under the #Obama Administration. https://t.co/nUlO9lxCyy"]["Today the #Senate confirmed the U.S. Trade Representative nominee, Robert Lighthizer."]["Instead of going around #Congress to push through regulations, our new @POTUS is working with us to ease the burden on the American people"]["If #Senate Democrats want to join us in replacing #Obamacare with commonsense reforms, I welcome their input."]["I’m glad to hear that after many years, #Senate Democrats are finally willing to concede that the status quo of #Obamacare is unsustainable."]["Yesterday, #Senate Democrats finally acknowledged the need to “improve and reform the #healthcare system.” #Obamacare"][".@US_FDA will play a critical role in the helping tackle our national #opioidepidemic &amp; Dr. Gottlieb is the right person to lead this charge"]["As a practicing physician with significant policy experience, Dr. Gottlieb has all of the necessary qualifications to lead the @US_FDA."]["#Obamacare failures causing \"massive, double digit premium increases\" in #MD, #CT, #VA ⬇️ https://t.co/4QMVBxQGdi"]["Congress passed 2 bills, now law, #CARA &amp; 21st Century Cures to promote research and treatment development for our national #opioidepidemic"]["Sadly the stories of these families are not unique #opioidepidemic ➡️ A Generation of Heroin Orphans via @CNN https://t.co/avZSZ2kl8F"]["It's simple, #Obamacare is collapsing https://t.co/lRSpQJ1GcN"]["The #Senate will confirm Dr. Gottlieb today to lead the @US_FDA, playing a critical role in helping tackle our national #opioidepidemic"]["Today, the #Senate can advance the incredibly qualified Scott Gottlieb to head the @US_FDA"]["For years, Democrats have pressured the SEC rulemaking process to curb political speech despite agreements to prevent just that."]["Now is the time for the #Senate to do its work to repeal #Obamacare and bring relief to the many Americans hurt by this failed law."]["To those who’ve suffered  from the failures of #Obamacare: We hear you. Congress is acting."]["I'd like to commend the House for voting last week to move beyond the pain caused by the failure that is #Obamacare"]["Today, the #Senate will confirm Heather Wilson as Secretary of the @usairforce"]["The status quo is unacceptable. The pain caused by #Obamacare is real for millions of Americans. We must repeal and replace this failed law. https://t.co/nTGeSH0ekm"]["The funding bill has passed the #Senate. It's now off to the @WhiteHouse for @POTUS' signature."]["My statement on the House passing an #Obamacare repeal and replacement bill. https://t.co/IuVg0UyuNJ"]["This funding bill strengthens our defense &amp; border, combats the\n#opioidcrisis, and allows for more #SchoolChoice ⬇️\nhttps://t.co/TUnYOxSgMS"]["Giving a raise to the men and women who protect this nation is never a bad idea. https://t.co/gzGtEUnHP1"]["This funding bill supports the implementation of Every Student Succeeds Act, giving families more #SchoolChoice https://t.co/g2wfWhX2T5"]["Retired #coal @MineWorkers &amp; their families will now have permanent #healthcare benefits thanks to this funding bill https://t.co/N5ZPdNK4xz"]["I want to congratulate my colleague, @SenToddYoung, for his truly inspirational maiden speech in the #Senate."]["Providing more resources to fight the heroin &amp; #opioidcrisis is a key provision in this funding bill https://t.co/WWTUsJEKDH"]["This funding bill updates physical border infrastructure, enhances surveillance technology, &amp; increases support for border personnel."]["The GOP #Senate has already eliminated 13 harmful 11th hour #Obama regulations, and we will get rid of another one today."]["This bill is a win for the American people. Here are 10 reasons why: https://t.co/LayEvTLApn"]["Rebuilding our military also means a pay raise for our troops. https://t.co/tA9rpNgHps"]["Congress is continuing the fight against the national heroin &amp; #opioidcrisis w $1.1 Billion in additional resources https://t.co/dqY3z9yDhC"]["This funding bill marks a significant departure from Pres #Obama and rebuilds our depleted military. https://t.co/cTTDzs3jgB"]["The implementation of Every Student Succeeds Act is tied w this funding bill, gives significant power back to the parents https://t.co/zQDCT1sXvY"]["#Coal @MineWorkers retirees &amp; their families will no longer have to worry about #healthcare benefits, this bill makes them permanent https://t.co/5bUcP0qQ7T"]["We’ve provided a big boost in resources to combat the heroin &amp; #opioidepidemic plaguing our nation in this funding bill. https://t.co/KDABYGviYB"][".@POTUS and the GOP Congress have made securing the border a priority, and this funding bill acts on it. https://t.co/VLJZSU8gHz"]["I look forward to confirming Jay Clayton to lead Securities &amp; Exchange Commission, where he will support American biz &amp; boost job creation."]["10 reasons why the funding bill is a win for the American people https://t.co/LayEvTLApn"]["After fighting a long time to protect #coal @MineWorkers &amp; their families' #healthcare benefits, they now become permanent in FY17."]["In addition to funding CARA and 21st Century Cures, FY17 provides additional funds to combat our national #opioid epidemic."]["Despite Ds blocking regular order last year, I'm glad to see agreement to solutions that advance priorities of Americans, Congress, &amp; @POTUS"]["FY17 has help for #coal @mineworkers communities/dislocated workers &amp; an “all-of-the-above” energy policy for coal, natural gas, nuclear"]["I'm proud to announce the FY17 bill will protect #healthcare benefits for thousands of retired #coal @mineworkers by making them permanent"]["FY17 bill will allow advances to rebuild our military, strengthen our border &amp; provide relief to those who have struggled w opioid addiction"]["Protecting #coal miners from losing #healthcare benefits is a top priority of mine &amp; I will continue to fight on their behalf going forward."]["Today's 1 week funding extension ensures retired #coal miners will not lose their #healthcare benefits, while working toward a permanent fix"]["W/ cooperation from #Senate Dems, we can pass a short-term CR today to keep the government funded while working to a longer-term solution"]["The #Senate has confirmed Alex Acosta to lead the Department of Labor. Another step forward to bringing relief to our middle class. @USDOL"]["Alex Acosta will lead the @USDOL on issues that can support America’s employers and employees, as well as our overall #economy. #jobs"]["It was a pleasure meeting the President of #Argentina this afternoon, @mauriciomacri. 🇦🇷🇺🇸\nhttps://t.co/OwJd1EXuTl"]["This week the #Senate has confirmed Sec of @USDA, Deputy Attorney General, and will confirm a 3rd today, Secretary @USDOL Alex Acosta"]["By lowering taxes for American business, we can foster job creation here &amp; make our country more competitive in the international #economy."]["By bringing down #tax rates for individuals, we can help ease the burden on middle class families. #taxreform"]["I will continue to fight for #coal @MineWorkers #healthcare benefits on a permanent basis."]["This extension will also protect retired #coal miners &amp; families from losing #healthcare benefits I’ve fought for throughout this process."]["We expect to pass a short-term funding bill before Fri’s deadline so a final draft can be shared w members prior to consideration next week"]["Yesterday the @WhiteHouse introduced a plan to simplify America’s tax code. It's long overdue, &amp; a priority of the GOP House &amp; #Senate"]["My statement on the @FCC's rollback of harmful #netneutrality regulation. cc: @AjitPaiFCC https://t.co/3clHkQc5o9"]["Alexander #Acosta ‘An Exceptional Choice’ for #Labor Secretary. #jobs #economy https://t.co/ca1tYIjmBY"]["The #Senate should confirm Acosta to lead @USDOL ASAP. The sooner we do, the sooner he can advance labor policies that puts our economy 1st."][".@POTUS has made clear that a nuclear armed #NorthKorea is unacceptable and threatens our vital national security interest."]["Thanks @MineWorkers for visiting my office. I'm in favor of permanent fix on miner's healthcare &amp; working to include in final spending bill."]["After confirmation of the Rosenstein nomination, the #Senate will advance the Labor Secretary nominee, Alexander Acosta. @USDOL"]["Today’s Days of Remembrance ceremony serves as another reminder of the suffering inflicted upon millions of people during the Holocaust. https://t.co/RMhh3TUMQp"]["The #Senate is on track to confirm Rod Rosenstein to be Deputy Attorney General."]["The Senate and @USCapitol family sends its condolences to the McClanahan  family.  https://t.co/3Ttb3hLslR"]["Kate O’Beirne was long a leading voice for conservative principles &amp; served as a mentor to so many. She’ll be missed https://t.co/drHxoK6jcw"]["Having been around agriculture his whole life, Gov. Perdue is well–qualified to head @USDA and enjoys bipartisan support."]["Today the Senate will vote to confirm former Gov. Sonny Perdue to be Secretary of @USDA."]["My statement on the tragic passing of one of our dedicated @uscapitol employees today: https://t.co/3Ttb3hLslR https://t.co/3vHWd7raFa"]["Justice Gorsuch https://t.co/btPJdpVp0d"]["WATCH LIVE ⬇️ Justice #Gorsuch getting sworn in at the @WhiteHouse. #SCOTUS\nhttps://t.co/cGsnvKMg7o"]["READ ➡️ my op-ed in @washingtonpost - #Democrats reap what they have sown. #SCOTUS @GorsuchFacts https://t.co/i2rJ4rcDPp"]["The Senate has confirmed Neil Gorsuch to #SCOTUS. I'd like to thank @POTUS for his leadership and for sending such an excellent nominee."]["Judge Neil #Gorsuch has been confirmed by the #Senate to the Supreme Court. https://t.co/RXuW6zzI1y"]["I will be holding a press conference at 11:00 AM to discuss the #Senate confirming Judge #Gorsuch &amp; the actions taken by @POTUS in #Syria."]["From the beginning, @GorsuchFacts has shown that he will make the American people proud. #SCOTUS https://t.co/Yi5VZFV4F7"]["Today, the #Senate will confirm Judge #Gorsuch to #SCOTUS."]["I am committed to working with @POTUS to continue developing a counter-#ISIS strategy &amp; dealing with the Assad regime in #Syria."]["I support both the action and objective of @POTUS' strike against #Syria to deter the Assad regime from using chemical weapons again."]["I'll be joining @hughhewitt tomorrow morning to discuss Judge #Gorsuch's nomination to #SCOTUS."]["There will now be up to 30 hours of debate prior to the vote to confirm @GorsuchFacts. He will be our 9th #SCOTUS Justice by tomorrow night."]["We are now re-voting the cloture vote to end the unprecedented filibuster by #Senate Democrats on @POTUS' #SCOTUS nom, Judge #Gorsuch."]["The #Senate is now voting on cloture for @GorsuchFacts. #SCOTUS"]["#Senate Democrats are simply doing something that has never been done. #SCOTUS https://t.co/tVf2xTxZRA"]["A brief history of the ‘Scorched-Earth Ideological Wars’ over Judicial Nominations by #Senate #Democrats. #SCOTUS https://t.co/ZPi6tZSPBI"]["What Democrats are doing will be the first, and last, successful partisan filibuster of a #SCOTUS nomination in the history of the #Senate."]["#Senate Democrats decided to “change the ground rules” for handling judicial nominations, then deployed the Nuclear Option in 2013."]["This #SCOTUS nomination is the latest escalation in the Left’s never-ending judicial war, the most audacious yet, and it cannot stand."]["#Senate Dems pioneered the practice of filibustering lower court judicial nominees &amp; the first partisan filibuster of a #SCOTUS nominee."]["Despite a bipartisan majority, Dems appear poised to block this nominee w the 1st successful partisan filibuster in American history #SCOTUS"]["When Justice Scalia passed, the #Senate followed the standard first set forth by then-Sen #Biden &amp; then expanded upon by Sen Schumer himself"]["When Pres #Obama nominated Sotomayor &amp; Kagan, we treated each nominee fairly &amp; secured an ⬆️or⬇️ vote for both, not filibustering. #SCOTUS"][".@washingtonpost observed in '13 the Dem Nuclear Option was not in response to rampant obstruction but was, quite simply, a “power play.”"]["Despite Dems attempted filibuster of Alito, no member of the Republican Conference has ever voted to filibuster a #SCOTUS nominee. Ever."]["What Dems are doing w/ @GorsuchFacts is radical, something completely unprecedented in the history of the United States #Senate. #SCOTUS"]["As a longtime #Democrat and board member of the left-leaning American Constitution Society put it https://t.co/nU95s6rZ4C"]["Fact Checkers: The #Senate does not have a 60-vote \"standard\" when it comes to #SCOTUS nominees https://t.co/8rUt0XHbB7"]["Despite a bipartisan majority, Dem leadership is now determined to lead the 1st successful partisan filibuster of a #SCOTUS nom in history"]["Just so everyone is clear, Judge #Gorsuch enjoys the support of a bipartisan majority of the #Senate. #SCOTUS"][".@GorsuchFacts participated there in more than 2,700 cases, writing in the majority 99% of the time &amp; had unanimous support 97% of the time."][".@GorsuchFacts unanimously received the highest rating from the @ABAesq, the group #Senate Democrats call the \"gold standard\". #SCOTUS"]["Judge #Gorsuch was unanimously confirmed to his current position. Not a single Dem \"no\" vote from Senators #Obama, Biden, Leahy, Schumer."]["It's the right thing to do. #SCOTUS https://t.co/aEs5fjVF4I"]["If a widely-praised nominee like Judge #Gorsuch can’t get past a Democratic filibuster, then none of @POTUS' #SCOTUS picks can."]["Due to an unprecedented filibuster threat, I just filed cloture on the Judge #Gorsuch nomination. #SCOTUS"]["Will a partisan minority of the #Senate really try to prevent the Senate's pro-#Gorsuch, bipartisan majority from confirming him to #SCOTUS?"]["When Pres #Obama nominated Sotomayor &amp; Kagan, I worked to ensure they received ⬆️or 🔽 vote, not a filibuster. It's the right thing to do."]["No member of the #Senate Republican Conference has ever voted to filibuster a #SCOTUS nominee. Ever. cc @GorsuchFacts"]["The #Senate will #ConfirmGorsuch this week. #SCOTUS https://t.co/JqV3aTLZsO"]["Fact Checkers: The #Senate does not have a 60-vote \"standard\" when it comes to #SCOTUS nominees https://t.co/8rUt0XHbB7"]["Remember the last #SCOTUS nom a Republican @POTUS selected? Samuel Alito in 2006, #Senate Dems also tried (but failed) to filibuster him"]["Today, bc of Dems threatened partisan filibuster, which is unprecedented in the history of the #Senate, I’ll file cloture on @GorsuchFacts."]["I look forward to joining with my #Senate colleagues in bipartisan support of Judge #Gorsuch’s nomination to #SCOTUS this week."]["If Dems hold up @GorsuchFacts, then they’re acknowledging that they’ll go to any length to block any #SCOTUS nom from a Republican @POTUS"]["#Colorado Gov. Bill Ritter (Democrat) &amp; former CO Attorney General John Suthers (Republican) agree that Judge #Gorsuch should be confirmed"]["Reminder: Not a single #Democrat opposed @GorsuchFacts in 2006, including Senators #Obama, Clinton, Biden, Leahy, and Schumer. #SCOTUS"]["We’re planning to dedicate this week’s #Senate floor time almost entirely to continued robust debate of the #SCOTUS nom, @GorsuchFacts"]["Democrats are threatening the first ever successful partisan filibuster of a #SCOTUS nominee in the history of the United States #Senate."]["Chairman @ChuckGrassley makes a great point on #SCOTUS in his new @FoxNewsOpinion oped https://t.co/vFF9vQighJ https://t.co/TlmnIy55js"]["My new op-ed on @POTUS' #energy executive order &amp; how it will restore sanity after #Obama's failed climate policies. https://t.co/ntdCEg8Tqk"]["Let’s be clear, the support for @GorsuchFacts is anything but one-sided. #Democrats and Republicans both want him confirmed to #SCOTUS."]["Another day, another #Senate Democrat #SCOTUS Fact Check. https://t.co/HLzfWQZIfc"]["#Senate Democrats just can't help themselves when it comes to creating a 60-vote “standard” for #SCOTUS noms https://t.co/Yjh2IM5wFa https://t.co/cf9lLfBB1X"]["#TBT to my floor speech on January 31, 2017. I warned what #Senate Democrats would do w/ @POTUS' #SCOTUS nominee, and now here we are. https://t.co/odj3UOp8yV"]["The #Senate will vote to stop #Obama-era restriction on state's #health-prevention funds"]["Just so everyone knows...there has NEVER been a successful partisan filibuster of a #SCOTUS nominee in the history of the US #Senate"]["Another day, another #Senate Democrat #SCOTUS Fact Check. https://t.co/HLzfWQZIfc"]["Prominent #Democrat supports @GorsuchFacts because \"there is no principled reason to vote no” #SCOTUS https://t.co/Yjh2ILNVNC"][".@GorsuchFacts is a fair and impartial Judge &amp; will make a great #SCOTUS Justice. He deserves a fair up or down vote in the #Senate. https://t.co/sQmbJ8PhBL"]["#Energy Independence Executive Order ‘A Pro-Growth And Pro-Environment Approach’ https://t.co/EJzi5PTtup"]["Despite Democrats claims, there has never been a 60-vote \"standard\" when it comes to #SCOTUS nominees in the #Senate https://t.co/8rUt0XHbB7 https://t.co/jceIF0BLqF"]["The damage of #Obama’s #waroncoal has already negatively impacted middle-Class families across the country &amp; #coal communities in #Kentucky."]["Today’s Exec Order is good news for #coal country, for middle class families, &amp; it’s another step away from #Obama's years of overregulation"]["Fortunately, we now have a @POTUS who will work with us to provide much-needed relief for middle-class #coal families."]["I commend @POTUS for signing the #Energy Independence Executive Order &amp; sending many anti-middle class regulations back to the drawing board"]["I’m proud to report that we will notch an important victory in the #waroncoal today with @POTUS signing the #Energy Independence Exec Order"]["Remember that @GorsuchFacts was so noncontroversial that not one Dem voted against him in '06; not #Obama, Biden, Schumer, Clinton, etc"]["I was happy to speak on the strong relationship that #Israel and the United States share this morning at @AIPAC. #AddYourVoice https://t.co/nknnR6J6s1"]["I've been warning for years about the harmful #Obama #coal regulations &amp; their effects on middle class families https://t.co/QZhPibNxpM"]["I'm looking forward to speaking at @AIPAC tomorrow morning. #Israel &amp; the US have been and will continue to be strong allies. #AddYourVoice https://t.co/AytKbBLKah"][".@GorsuchFacts is so well qualified for #SCOTUS than people from the Left are praising him https://t.co/NLpnOPJZvR"][".@senorrinhatch is right. #SCOTUS 🔽 https://t.co/q41rJr2Gk9"][".@GorsuchFacts is far from extreme. In fact, he has been in the majority of decisions 99% of the time. #SCOTUS https://t.co/JF7n92lUHU"]["#Senate D's have called @ABAesq the \"gold standard.\" They gave @GorsuchFacts their highest rating https://t.co/Z5CM7mjz4g"]["My statement on the #AHCA https://t.co/XhWEOh1cP4"]["Building the #KeystonePipeline pipeline will create thousands of #jobs &amp; pump billions into our nation’s #economy. https://t.co/9A2n3hODV7"][".@GorsuchFacts has sterling credentials &amp; a reputation as a fair and impartial jurist, kind &amp; humble, and independent. #SCOTUS"]["I’d urge my colleagues to show Judge #Gorsuch the fair consideration he deserves &amp; come together in supporting his nomination. #SCOTUS"]["Today, the #Senate will confirm David Friedman as our next Ambassador to #Israel."]["The #Senate's action to overturn #Obama regulations could save Americans nearly $4 Billion &amp; more than 4 Million hours of paperwork."]["Both Liberals and Conservatives agree, we should #ConfirmGorsuch to #SCOTUS. @GorsuchFacts https://t.co/lwyxulVKrr"]["#ICYMI, the #Senate has passed 10 resolutions under CRA to end #Obama Admin regulations that slow economic growth &amp; threaten jobs."]["Ds call @ABAesq the \"gold standard\" when it comes to judicial noms. They unanimously gave Gorsuch the highest rating https://t.co/Z5CM7mjz4g"]["The United States stands with the United Kingdom, as a friend, as a cherished ally, and as a united partner against terror. #londonattack https://t.co/AvDbnbzBed"]["Today, the #Senate has another chance to stop harmful #Obama regulations, this time by focusing on the actual safety of employees."]["‘#Democrats … Are Simply Telling Supporters A Politically Convenient Fairy Tale’ #SCOTUS #ConfirmGorsuch https://t.co/GP7tkfGz39"]["#Obamacare is a direct assault on the middle class, and it will continue to get worse unless we act. #AHCA is the answer."][".@GorsuchFacts is \"somebody who understands the West\" #SCOTUS #ConfirmGorsuch https://t.co/DbPx8eFdZN"]["Liberals should welcome a nom like @GorsuchFacts...honest, principled &amp; committed to safeguarding the rule of law → https://t.co/SalukaaeTV"]["Today, the #Senate will continue with our efforts to stop more unnecessary regulations that hold our country back. #CRA"]["ICYMI → Not a single #Senate Dem voted against @GorsuchFacts in 2006. #SCOTUS #ConfirmGorsuch via @PolitiFact https://t.co/9IxCh3ROUr"]["Last night, I was proud to stand with @POTUS in #Kentucky as he brought his vision for #healthcare directly to the people."]["Day 2 of @GorsuchFacts #SCOTUS hearing before the @senjudiciary is happening now. Watch it here → https://t.co/2WG9bUSndD"]["The Rule of Law is not Liberal or Conservative #SCOTUS #ConfirmGorsuch @GorsuchFacts https://t.co/7m3xVtbhu0"]["Welcome to #Kentucky, @POTUS. https://t.co/QeIv1B0zGT"]["\"#Gorsuch Right for High Court\" - @SenCapito on why @GorsuchFacts is ready for #SCOTUS https://t.co/QNFdgFJPIb"][".@GorsuchFacts is uniquely qualified for our nation's highest court. He will be a fair and just Jurist on the #SCOTUS bench. https://t.co/mWAkczhNNz"]["The #Senate confirmed @GorsuchFacts to his current position without a single vote in opposition. He’s the right jurist for the job. #SCOTUS"][".@senjudiciary Chair @ChuckGrassley writes how @GorsuchFacts would serve nation w honor &amp; distinction on #SCOTUS ➡️ https://t.co/VmSwh7yMiJ"]["Happening now, @GorsuchFacts begins his hearing w/ @senjudiciary. Learn why he is so well qualified for #SCOTUS ➡️ https://t.co/2WG9bUSndD"][".@SenatorStrange on @GorsuchFacts ➡️ #NeilGorsuch is singularly qualified for #SupremeCourt #ConfirmGorsuch #SCOTUS https://t.co/iYdaQNEQa9"]["This coming Monday, @GorsuchFacts will come before the @senjudiciary Committee for the hearing on his nomination to #SCOTUS. https://t.co/rHXJcxREu5"]["Republicans promised the American people relief from #Obamacare, and we’re working hard to keep that promise. #AHCA #RepealAndReplace"]["Republicans are keeping our promise to #RepealAndReplace #Obamacare. The #AHCA will do just that. https://t.co/2Tafc3CkEo https://t.co/6P4Etm796W"]["Dan Coats has served his nation in the @USArmy, the House &amp; #Senate, as ambassador to Germany &amp; now as the Director of National Intelligence"]["“The #Senate should confirm [@GorsuchFacts] because there is no principled reason to vote no.” - longtime Democrat David Frederick #SCOTUS"]["Obama’s Acting Solicitor General, Neal Katyal, says that @GorsuchFacts is “an extraordinary judge and man” #SCOTUS"]["Today the #Senate will be able to support another of @POTUS' exceptional selections, Lt General H.R. McMaster, for National Security Advisor"]["Today, our former #Senate colleague, Dan Coats, will be confirmed as Director of National Intelligence."]["#Obamacare has made a mess across the country. It's time to #RepealAndReplace this failed law. https://t.co/chxxQ3fGFf"]["B/c #Obamacare gave so much authority to HHS Sec &amp; CMS Admin, @SecPriceMD &amp; Seema Verma can make real policy changes to benefit Americans"]["Verma's deep knowledge &amp; experience w #healthcare, especially #Medicaid = ‘The Ideal Candidate’ to oversee reform https://t.co/Okzk2eeesl"]["3 important things to know about the #AHCA, it will:\n1. drive down premiums by 10%\n2. cut taxes by $883B\n3. reduce the deficit by $337B"]["READ ➡️ My statement on how the #AHCA will lower premiums, reduce taxes &amp; cut deficit. https://t.co/mInpMPbuix https://t.co/fQOY9925ik"]["Seema Verma has been confirmed by the #Senate to lead @CMSgov. With @SecPriceMD, she can help #RepealAndReplace the failure of #Obamacare"]["#ICYMI ⏩ The American Bar Assc unanimously gave @GorsuchFacts their highest rating possible \"Well Qualified\" @ABAesq https://t.co/bJ3Bj4AEJN"]["Remember that #Obamacare raided funds from #Medicare &amp; dramatically enlarged #Medicaid beyond its core focus. #RepealAndReplace"]["We have a 3 prong approach to #RepealAndReplace #obamacare: 1) #AHCA 2) Additional legislation 3) Actions taken by @SecPriceMD"]["To help #RepealAndReplace the failure that is #Obamacare, today the #Senate will confirm Seema Verman to lead @CMSGov"]["#Healthcare choice has fallen from coast to coast, with about 1/3 of counties having only a single insurer to choose from on the exchanges."]["The ‘most ambitious regulatory rollback since Reagan’ continues. The #GOP is moving quickly to dismantle #Obama regs https://t.co/pVZaOR8Yz4"]["#Obamacare cannot be fixed and it cannot be saved. It has to be repealed and replaced. https://t.co/o5aZyFraM4"]["It has your name on it for a reason. You're welcome any time, @SenatorDole. https://t.co/nfUWGXVbiQ"]["#ICYMI ➡️ My @politico #PlaybookInterview this morning with @apalmerdc and @JakeSherman https://t.co/PnBOixpPeS"]["Seema Verma has a deep health policy background, a reformer with a proven record of success. https://t.co/ddHHE7u71f"]