["It’s almost a year under @POTUS and I can’t say anything he says stuns me anymore. His comments do not represent America’s values. This is very hurtful. https://t.co/JUV5hgGwO1"]["#HumanTraffickingAwarenessDay is a critical reminder of the responsibility we have to the millions of children, women and men who have been coerced and exploited across the globe. We have a moral duty to be their voice. Silence is not an option. Inaction is not an option."]["Never before in American history has so clear a national security threat been so clearly ignored by a U.S. president. Without a strong U.S. response, elections here and abroad will remain vulnerable to the Kremlin's aggressive and sophisticated influence operations. #RussiaReport https://t.co/hn8kwchYfr"]["Unfortunately, the one person in the U.S. government stopping a truly comprehensive U.S. government response is @POTUS. Never before in our history has so clear a threat to U.S. national security been so clearly ignored by the sitting president. #RussiaReport"]["This threat existed long before Pres. Trump took office, and will exist after him unless he finally says ‘enough is enough’, acknowledges the threat, and leads our country and our allies in defending all that we care about. #RussiaReport"]["This is the 1st U.S. government #RussiaReport to detail exactly how Putin operates, from a toolbox that includes military invasions, cyberattacks, disinformation, supporting fringe political groups, and weaponizing energy, crime &amp; corruption. Summary here: https://t.co/9BKTwDHvUr"]["Russia's attack on the U.S., while still being fully investigated, was not limited to email hacks or one election. The scale and scope of this threat is real, it is growing, and if left unchecked, it will happen again in 2018 and 2020. #RussiaReport https://t.co/MoToBWptFg"]["Today I'm releasing a #RussiaReport documenting Vladimir Putin's 20-year attack on democratic institutions in his own country and Europe. To protect against what the Kremlin did to the U.S. in 2016, we need to first understand Putin's pattern. https://t.co/93mMMbGEgV"]["Important to note: the existing plan already allows for the leasing of more than 45 billion barrels of oil. Opening up more waters to drilling will do nothing more to secure our energy future, but could do tremendous damage to our economy &amp; natural resources. #ProtectOurCoast"]["I've joined dozens of my colleagues in sharply rebuking the Trump Administration for moving to open up a record percentage of federal waters to #OffshoreDrilling. It's both irresponsible and completely unnecessary. #ProtectOurCoast https://t.co/LILh6iU41c"]["The @FCC's decision to roll back #NetNeutrality was a transparent bow to corporate interests and a dangerous step toward suppressing the free flow of information online. This bill would block that ruling &amp; restore the prospect of a free and open internet. I'm proud to support it. https://t.co/MrwcXA9hY0"]["Toria Nuland is a great choice for executing the sort of national security vision and strategic thinking our country needs. Congratulations to @CNASdc on securing such a tremendous asset. https://t.co/zTrfIDmahw"]["Moving. Empowering. Worth watching. If you still haven't seen @Oprah's Golden Globes speech, take a minute. https://t.co/6tNY24EJOj"]["In November I introduced a bill to #SaveTPS and create a pathway to permanent residency for Salvadorans and other legal immigrants. \n\nI call on my colleagues to take up that legislation immediately. It's the right thing to do, and it's time to do it now. https://t.co/GpW7P5VLNC"]["\"Small business are Maryland's growth engines. They are where innovation and creativity thrive. We must help them forge ahead.\" #MainStreet https://t.co/SrqfXiJdw7"]["Listening today to experts who provide life-saving services to victims of human trafficking. Amazing stories of salvation and dedication. https://t.co/PyROw9f20G"]["This is woefully ignorant of both common sense and scientific reality. I urge @POTUS to reverse course and put the will of the American people and health of our natural resources above the desires of the fossil fuel industry – for once. #ProtectOurCoast\n\nhttps://t.co/tjXXHdgTKx"]["Sadly, oil &amp; gas spills are a daily occurrence in this country. Now the Trump Admin is needlessly placing countless East Coast communities, thriving local economies and invaluable natural resources at risk. I'm disgusted, and I'm urging @POTUS to reverse course. #ProtectOurCoasts https://t.co/RNz8SEdCq2"]["This week @POTUS moved to allow offshore drilling along the East Coast. As someone who loves and has spent my career working to protect and improve the Chesapeake Bay, I cannot condemn this maneuver in strong enough terms. #ProtectOurCoast https://t.co/H2O7L2YQ4L"]["@POTUS Still, we must make #healthcare coverage more affordable. Premiums are rising beyond what many middle-income families can handle. 2018 must be the year both parties come together, compromise, and stabilize costs. I’m ready. I’m willing. I’ll fight to make sure that happens. #ACA"]["Despite a shortened enrollment period and complete lack of support from @POTUS, Maryland's health insurance exchange successfully enrolled 153,571 people for 2018 #healthcare plans. \n\nOur uninsured rate is now at 6.1% – a historic low. That's worth celebrating. #ACA #ThanksObama https://t.co/2gRQyAXg91"]["This Administration's actions are as ignorant of common sense and scientific realities as they are of the widespread public opposition to Atlantic #OffShoreDrilling. I urge @POTUS to reverse course. Immediately. https://t.co/Up7PqvcrJd"]["@POTUS This is the type of publicly unsupported action we've seen time and again from this Interior Dept, which clearly places the wishes of oil, gas &amp; coal executives above those of average Americans. I cannot condemn this maneuver to allow #OffshoreDrilling along the East Coast enough"]["I'm disgusted – but not surprised – by this news. This comes only a week after @POTUS repealed safety regulations implemented by the Obama Admin to prevent another Deepwater Horizon disaster &amp; it needlessly places countless coastal communities at extreme risk. #OffshoreDrilling https://t.co/5C5r3KeVTj"]["This so-called \"election integrity\" commission should never have been formed. I'm glad it's being dissolved.  I thank the civil rights groups &amp; state governments who stood up to this Administration's attempt to legalize #VoterSuppression and purge eligible voters from the rolls. https://t.co/SnmeiYjkH2"]["There's an urgent need in this frigid cold in #Baltimore. At the federal level, I urge my Senate colleagues to enact legislation I support, the School Bldg Improvement Act (S.1674) that will provide funding for school repair, renovation, new construction. https://t.co/8DDwwCBV1B"]["Our children should not be forced to make do with public schools without working heating systems. They deserve modern learning environments conducive to a high-quality education. #Baltimore https://t.co/rFQ0pSljXk"]["Heartbroken. Team Cardin lost a valued member at far too early an age. Anne Irby was a kind soul who will be missed greatly by me and all who knew her. https://t.co/aVmtc0f1bD"]["I call on the Govt of Iran to respect the right of its citizens to peacefully protest. I also urge the Trump Administration to explore options for sending signals of support to the Iranian people. #backtowork https://t.co/eyQ1tXubpB"]["Happy new year to all! Looking forward to a year of peace, joy, and good health across the country. There is much work to do in 2018. What’s your priority for the year ahead?"]["@elizabethforma @LCVoters Believing in science is not crazy. Climate change is real and denying its existence does not help our country, our environment or public health."]["Thank you for all of your work and energy https://t.co/98rsfPskbp"]["ICYMI: https://t.co/wOPS2LK502"]["@Trumpilforeskin @baltimoresun @ChrisVanHollen ICYMI: https://t.co/wOPS2LK502"]["We cannot rip families apart. That's not what America stands for. I've met with many #Dreamers in Maryland. Most have known no other country but the US. They should not be living in fear. We should not go home without helping them.  #DreamActNow  https://t.co/oqr9UP8g7s"]["Live on the Senate floor now. #Dreamers are part of this country. They are part of our future. They deserve our help now. We should not be going into recess without dealing with the problems the dreamers are facing. https://t.co/oqr9UP8g7s"]["Along w/@SenJohnMcCain, I pushed for the Global #Magnitsky Human Rights Accountability Act last year b/c the US must lead the world in using the power of our financial &amp; legal institutions to hold human rts abusers &amp; corrupt individuals accountable https://t.co/6Ny2k4aSk4"][".@SenJohnMcCain &amp; I asked @StateDept to investigate abuse of gay men in Chechnya and wider human rights violations in Russian North Caucasus. Pleased they took our advice in today’s #Magnitsky designations.   https://t.co/u6X9ngd5ht"]["Good news for Baltimore. I've been working closely w/@MayorPugh50 as we move federal legislation, incl. the Senate-passed Water Infrastructure Flexibility Act (S. 692) that will minimize the impact of water and sewer bill hikes on low-income families. https://t.co/DxK6dakjPb"]["Noteworthy additions to the Sergei Magnitsky sanctions list out today, especially renowned human rights violator Ramzan Kadyrov.  A true victory for the citizens of Russia. https://t.co/IY5qtRYTsT"]["Tonight's #GOPTaxScam guts state and local income tax deductions, which more than 40 million households rely on to avoid being double-taxed. That's unconscionable. We must correct it. https://t.co/JI4xyLTNPa"]["We haven’t passed this bill yet and Republicans are already talking about how to correct their mistakes. This isn’t how we should legislate. Why are we trying to pass a bill we know is greatly flawed?  https://t.co/oqr9UP8g7s"]["This bill is an assault on Marylanders. The average taxpayer in Maryland is going to pay more taxes with the cap on the deduction for state and local taxes. #doubletaxing is unfair"]["This tax bill is not good for America. This is not a tax cut for middle-income Americans, it’s a bill for mega corporations. Watch more now https://t.co/oqr9UP8g7s"]["If you're still wondering who Republicans' #TaxReform plan is for, remember: it makes tax breaks for corporations permanent but sunsets cuts for middle-income families. In 10 years, working families will see additional hikes while corporations will still be protected. #GOPTaxScam https://t.co/10IMisp6X8"]["This #GOPTaxScam is a highly partisan bill that permanently cuts taxes for corporations at the expense of everyone else. It's designed to fulfill a campaign promise - not to help our economy, or the middle-income families we were sent here to represent. \n\nThis bears repeating: https://t.co/OIk4G6kp1r"]["Many appropriations bills approved this year have included deeply divisive anti-environment riders. These are just a few examples. I'm calling on the end-of-year spending bill to be free of dangerous provisions that threaten to gut our bedrock #environmental laws. #NoPoisonPills https://t.co/85Dl5D4uO5"]["\"GOP colleagues are asking me for help fixing serious flaws they know are in their tax bill once it passes. Isn't that process backwards?\" https://t.co/7H0rxPFrXi"]["\"The GOP tax bill is bad for middle-income workers, federal employees and state &amp; local gov't. And it's horrible for the national debt.\" https://t.co/rhwkmeGl6v"]["Friends, mark your calendars: @NatlParkService has announced 2018's entrance fee-free days, when all natl parks will be free to enter:\n\n&gt; Jan 15: Martin Luther King Jr. Day\n&gt; April 21: 1st Day of Natl Park Week\n&gt; Sept 22: Natl Public Lands Day\n&gt; Nov 11: Veterans Day"]["Maryland: There's still time to change your #healthcare plan, #GetCovered for next year, or see if you qualify for financial assistance. Our new deadline is December 22.\n\nIf you have questions or need help, https://t.co/2MZaVIY7Nd has a call center w/ extended hours this weekend: https://t.co/LrQvVD3eZt"]["\"We urgently need to find a better path on immigration, human rights and diplomacy.\" -- meeting w/ international non-profits in Baltimore https://t.co/KDSHXgdPaA"]["Thanks to a newly extended MD deadline, Marylanders have until next Friday, December 22, to visit https://t.co/2MZaVIY7Nd and #GetCovered for next year.\n\nBut for most Americans, the deadline to sign up for 2018 #healthcare is today. Spread the word: https://t.co/e9HknebsFo https://t.co/eevlUeRTSj"]["Good news, Maryland: the deadline to enroll in a 2018 #healthcare plan, change your current plan, or apply for financial help has been extended to next Friday, December 22. \n\nGo to https://t.co/2MZaVJfIEL to browse plans or call 855-642-8572 if you need help. #GetCoveredNow https://t.co/1HhfJWbqY5"]["Today's @FCC vote rolling back #NetNeutrality represents bowing to corporate interests, which seems to be emblematic of the Trump administration. ISPs want to control who can access what content on the internet when, and at what speeds. Congress must act to reverse this decision. https://t.co/UZCx4eZUnE"]["This is a dangerous step in corporatizing a public utility. Even more important, this is a dangerous step in suppressing the free flow of information that is the lifeblood of our democracy. Congress must reverse this foul decision. #NetNeutrality https://t.co/lY5Kf6x2BD"]["The #OpioidEpidemic is a public health emergency. Too many parents have had to live through the same pain as the Werner family. We must increase funding for opioid addiction prevention, treatment &amp; recovery services in the upcoming spending bill. It's our job to act."]["In a few minutes, Marylander Rick Werner will be sharing his heart-wrenching story about losing his son to an #opioid overdose. It's a story worth hearing and remembering as we fight the national #OpioidEpidemic.\n\nTake a moment to watch him here: https://t.co/eNCgw6BAH8"][".@SenateMajLdr McConnell should delay voting on Republicans' #TaxReform bill until Senator-Elect Doug Jones has been sworn in.\n\nThat's exactly what @SenateGOP argued in 2010 when Scott Brown was elected. We listened to our Republican colleagues then. They should listen to us now. https://t.co/JLn3tpegsI"]["@SenateGOP #CHIP must be fully funded. Now. We should all be working tirelessly to ensure that it is. We should all be able to agree that children – all children – deserve health care."]["#CHIP has long received bipartisan support, because members of both parties know millions of children will suffer without it. But this year, it's been an uphill battle. This year, it's being used as a bargaining tool for the @SenateGOP's agenda. Enough is enough."]["The Children's Health Insurance Program (#CHIP) provides health care for 9 million kids, most of whom would not receive the care they need otherwise. Millions of them battle chronic conditions.\n\nFunding #CHIP should not be controversial or political. It should be a moral duty. https://t.co/42E2LoLZYI"]["Looking forward to welcoming @GDouglasJones to the Senate! The people of Alabama have elected a man they can respect and who will represent them well. #ALSenate https://t.co/nNHmQmaNgb"]["His poetry was just the beginning! My Secret Santa, @CoryBooker, also brought me @BonJovi's greatest hits. A little piece of New Jersey to enjoy during my commute between Baltimore and Washington each day. #HappyHolidays https://t.co/vyaoUnyRVo"]["Thank you, @RepMaxineWaters, for speaking so passionately in defense of the #CardinLugar anti-corruption rule on the House floor.\n\nAnti-corruption is an issue that should transcend politics. House members: vote no on rolling back protections. Vote no on #HR4519."]["@POTUS This is a pattern – a pattern of prioritizing corporations over Americans &amp; the public interest.\n\nAnti-corruption used to be a tenant supported by those of all political affiliations – we must keep it that way. I'm strongly encouraging all House members to vote \"no\" on #HR4519."]["In February, @POTUS gutted the #CardinLugar Rule, which provides safeguards against #corruption in the oil &amp; gas industries. Last month, @POTUS pulled out of intl anti-corruption initiative #EITI. Today, the House is considering #HR4519 which would roll back #CardinLugar entirely"]["As we wait for complete details, one thing is clear: the NYPD moved quickly in apprehending the suspect, and their professionalism may well have saved lives. Extending them my gratitude, and joining everyone praying for the full recovery of those injured. https://t.co/AB1anZDZIJ"]["#StandUp4HumanRights. And let us remember that \"standing up\" is an action – it requires more than words and proclamations. It requires the vigilance and courage to insist on respect &amp; human rights for all people, everywhere, not only on Human Rights Day, but every day."]["Today, on Human Rights Day, I'm proud to join @UN and people around the world to #StandUp4HumanRights – especially for those whose voices are unheard.\n\nToday we recommit to prioritizing the dignity and rights of all, regardless of race, ethnicity, religion, gender or orientation."]["If you don't live in Maryland, go to https://t.co/e9HknebsFo  to browse next year's #healthcare plans and see if you qualify for financial assistance. \n\nDon't wait. The December 15 deadline is less than a week away. #ACA #GetCovered https://t.co/misS1r2UHi"]["Maryland: The December 15 deadline to change your #healthcare plan, #GetCovered for next year, or see if you qualify for financial help is just 6 days away.\n\nIf you have questions or need help, there are in-person enrollment events happening across the state today and tomorrow: https://t.co/uMJb9ufGQ5"]["This, in particular, is important to understand. I'm proud to stand with #Dreamers -- so many of whom know no other country besides the United States; so many of whom are our children's friends, classmates, colleagues. #DreamActNow https://t.co/ODilPStHd6"]["A worthwhile read.\n\n\"Second, there's the issue of what Democrats are actually fighting for. They are not arguing for open borders or an end to immigration enforcement. What they're trying to accomplish[...] is a deal on permanent status for #Dreamers.\"\n\nhttps://t.co/aFm3WY0wmb"]["If the #GOPTaxScam is allowed to pass, our children and grandchildren will foot the bill -- all for something that does nothing to help them, or the middle-income families we're here to represent. \n\nWe can't let that happen. https://t.co/GHoAmkpwsG"]["Friends, I'm about to speak live on how the #GOPTaxScam would wreak havoc on our health care system, threaten #Medicare and #Medicaid, and raise premiums. Join me: \n\nhttps://t.co/G3r3VqQ3Q6"]["Giving corporations big tax cuts won't help the workers and middle-income families we're here to represent. We may want to believe that corporations will use tax cuts to increase wages – but that just isn't what happens. #GOPTaxScam #TaxReform https://t.co/RCkJGGxiEV"]["@SenateGOP But we aren't giving up. The House &amp; Senate must reconcile the differences between their tax bills before these misguided policies can become law. Let's keep fighting. Let's demand regular order. Let's insist we scrap this #GOPTaxScam and prioritize people over corporations."]["This #GOPTaxScam was passed in the dead of night last weekend, just hours after @SenateGOP released it, w/ changes scribbled in the margins &amp; no time for analysis.\n\nResult: a bill that eliminates or undermines key deductions &amp; inflicts a heavier tax burden on middle-income MDers. https://t.co/ebp0aHpy8Z"]["Reputable media outlets targeted by the Kremlin as \"foreign agents\" have long braved the risks to report objective, factual news that the Russian people deserve – not state-driven propaganda. This is just an excuse to further curb free press in #Russia.\n\nhttps://t.co/3cChKq1Enc"]["Maryland: The December 15 deadline to change your #healthcare plan, #GetCovered for next year, or see if you qualify for financial help is just 10 days away. \n\nIf you have questions or need help, there are in-person enrollment events happening across the state this weekend: https://t.co/RhBpnkUEba"]["There are only 10 DAYS left to enroll in a 2018 #healthcare plan, change your plan, or apply for financial assistance. \n\nMaryland: if you have questions, plan to go to one of https://t.co/2MZaVIY7Nd's \"Last Chance\" enrollment events this weekend, where you can get in-person help. https://t.co/0wSai2Guzl"]["#NetNeutrality is the principle that internet providers shouldn't be able to block, throttle or discriminate against websites or content at will. \n\nThe @FCC is set to roll back #NetNeutrality next week - a decision that could be informed by thousands of fraudulent comments. https://t.co/xdMQBnJlNh"]["If you don't live in Maryland, go to https://t.co/e9HknebsFo to browse next year's #healthcare plans and see if you'll qualify for assistance. Don't wait. December 15 is less than two weeks away. #ACA #GetCovered https://t.co/VkDjlmPyNF"]["Friends, there are only 12 days left to enroll in a #healthcare plan for 2018, change your current plan, or apply for financial assistance. \n\nDon't risk missing the December 15 deadline. Shop around and apply now. https://t.co/6cgxxksCsz https://t.co/Apnrd2dHC5"]["Incredible story. These four returning citizens risked their own lives to save those of complete strangers. A true testament to their character, and to what is possible when programs like @LivingClassroom's Project SERVE offer people a second chance. \n\nhttps://t.co/HKwe2FvoWe"]["Absurd barely describes this process. This is simply not right. https://t.co/RbwY0EaDDy"]["I am heartened by reports that GSA, FBI and [the White House] actually are discussing how to deliver a fully consolidated facility for the FBI ... https://t.co/v514HOYJ01"]["Disturbing new report from the @ONECampaign shows the potentially devastating impact of the Administration's proposed cuts to the fight against AIDS. This is worth a read. https://t.co/nVnLa2OEZu  #endAIDS #WorldAIDSDay"]["Republicans and Democrats – knowing that public health shouldn't be a partisan issue – have worked together for years to ensure U.S. leadership in the fight to #endAIDS. This #WorldAIDSDay, I'm committing to keep up that fight, and know many @SenateGOP colleagues will join me. https://t.co/ZCqvSeneCh"]["Today is #WorldAIDSDay &amp; it makes me proud that the U.S. has helped save 11 million lives through PEPFAR. But there are many more desperate for medical care, and if we follow @POTUS' proposal to cut PEPFAR funding, millions will suffer &amp; we will roll back the progress we've made. https://t.co/xxi6dSgluC"]["The nonpartisan @USCBO's analysis of Republicans' #TaxReformScam speaks for itself. https://t.co/Jqph9GpazZ"]["Republicans' #TaxReformScam ends or restricts many tax deductions that working families rely on, all while offering huge breaks to corporations and the very wealthy. How is that looking out for middle-income families, @SenateGOP?\n\nhttps://t.co/DdDMyORnDp"]["11 months in, it's still unfathomable @POTUS repeatedly gives attention &amp; political space to right-wing extremists here at home &amp; abroad. Like most days, his re-tweets today are beneath the dignity of his office &amp; do not represent our country or its values\nhttps://t.co/qQkWx3Vazx"]["Almost 11 months in, it's still unfathomable that @POTUS repeatedly gives attention and political space to right-wing extremists here at home and abroad. His re-tweets today, like most days, are beneath the dignity of his office and do not represent our country or its values. https://t.co/pcsLZvY0TQ"]["I greatly respect the actions &amp; words of PM @JustinTrudeau to disavow Canadian government discrimination of the LGBT community. I'll continue to push my bill, the LOVE Act of 2017, in the U.S. Senate to address our own nation's past and build a better future for all. https://t.co/YHG20eJciy"]["Let's not forget Republicans' #GOPTaxScam includes upending #healthcare by repealing the ACA's mandate. So if this plan passes, Republicans will have succeeded in hiking taxes for millions of middle-income families &amp; raising insurance premiums all in the same bill. https://t.co/VFXvW85AsB"]["If you're still wondering who Republicans' #TaxReform plan is for, remember: it makes tax breaks for corporations permanent, but sunsets cuts for middle-income families. In 10 years, working families will see billions in additional hikes while corporations will still be protected"][".@SenateGOP's tax plan overwhelmingly benefits big corporations and the very wealthy, blowing a $1.5 trillion hole in our debt in the process. And who's going to pay for that? Our children. These children. #GOPTaxScam https://t.co/QiL0BbKyWr"]["Republicans' tax plan would spell a tax increase for nearly 800,000 middle class and working families in Maryland. That isn't right, and now more than ever, we need your help to stop this unfair legislation. #TaxReform"]["I'll be joining my colleagues at 5 PM to discuss @SenateGOP's #TaxReform plan and how, if it passes, low- and middle-income families will be affected. Join us live here: https://t.co/fIq2xnbwMp https://t.co/xD8V5OLoTz"]["#SmallBizSat is an opportunity to support the small, local businesses that are the heart of Maryland's economy. I encourage everyone to #ShopSmall today, and throughout this holiday season. https://t.co/1RZ8NhtD4k"]["Small businesses support nearly half of all jobs in this country. So let's support them. #ShopSmall and #DineSmall today, and help keep the backbone of our economy strong. #SmallBusinessSaturday"]["Have a last-minute question about preparing, roasting or storing your turkey? @USDA is here to help. #HappyThanksgiving https://t.co/405L7dZhZ0"]["A happy #Thanksgiving starts with a safe one. These turkey tips from @USDAFoodSafety have got you covered. https://t.co/E2cZ7UFHTx"]["This year, and every year, I'm thankful for the great honor of representing my home state in the U.S. Senate. Thank you, Maryland. My family and I are wishing you all a happy &amp; fulfilling #Thanksgiving https://t.co/6iBdu5r0Hc"]["This is bowing to corporate interests, once again, which seems to be emblematic of this Trump era. I have long believed that ISPs should not be permitted to charge more or throttle back speeds, or lock-out small content providers. This is a dangerous step."]["The FCC’s idea of Internet Freedom means freedom for providers to decide what the public can see and can do on the internet. This is not freedom for consumers, as #NetNeutraility envisioned. https://t.co/IuRtgSOCOJ"]["Friends, #OpenEnrollment is happening now, and this year you only have until December 15 to compare #healthcare plans for 2018, see what financial help you qualify for, and #GetCovered. Don't wait. https://t.co/mu67Lb78TO https://t.co/kB5NR0bTc4"]["Maryland, take note: our health insurance marketplace is open for enrollment - and changes to plans - right now. There are statewide sign-up events where you can ask questions and get help in person: https://t.co/5dIEGcRNEi https://t.co/yfxsjAsNy7"]["Small businesses support nearly half of all jobs in this country. They are the backbone of our economy. Let's show them our support by planning to #ShopSmall next weekend. #SmallBusinessSaturday"]["#SmallBusinessSaturday is one week from today, so make your plans to #ShopSmall and #DineSmall now. Buying local makes a real difference, both for the families who own independent small businesses and for our state and local economy."]["At BWI to meet the inspirational entrepreneurs of the unique  LaunchPad program, designed to help new microbusinesses take off. #SmallBiz https://t.co/guxhUn3mUo"]["Another thing #Baltimore can be proud of. This is thanks to the tireless work of local, state and federal officials, and to all those who have fought to keep access to safe, #CleanWater a fundamental right – not a partisan issue. \n\nhttps://t.co/WY34bPC6zF"]["Talking tax reform, transportation, health care &amp; more w/ MD Chamber of Commerce. So much great insight from a wide range of businesses. https://t.co/SssrzOAXH8"]["Budgets speak louder than proclamations. #AmericanEducationWeek https://t.co/v4UhURmeU3"]["#AmericanEducationWeek should remind us that budgets reveal priorities. And our priority should always be the success of our children, and the committed educators who teach and nurture them. https://t.co/U0NF1w8cBz"]["Our schools and educators should be celebrated with more than proclamations and praise. They should be supported by actual policy. #AmericanEducationWeek https://t.co/Dk47Zrm3JE"]["More than 90% of students are taught at public schools. They deserve every opportunity to succeed, and their educators deserve every resource to effectively teach and nurture our children. #AmericanEducationWeek"]["As the proud product of the #Baltimore City Public School system, I understand the transformative power of a high-quality public school education. This week we pause to appreciate all the educators who make it possible. #AmericanEducationWeek https://t.co/8bhxZ4Q963"]["They make permanent tax breaks for corporations but sunset cuts for low- and middle-income families and #SmallBiz so that in 10 years, working families will see billions in additional tax hikes while the big corporations are still protected. It isn’t fair. It isn’t right."]["This so-called tax reform is a collection of tax cuts for corporations &amp; higher-income families. It does not target middle-income &amp; working families despite repeated comments from Republican senators saying that it does. It blows a $1.5 trillion dollar hole in our debt..."]["The bill passed by the Senate Finance Committee Republicans is bad policy built for partisan politics only. #TaxReformScam Here is my full statement. https://t.co/qPyIyWS65g"]["I thought Republicans wanted to do everything possible to stem the #opioid crisis. Apparently not. They just voted down a credit for people who receive services or treatments for substance use disorders.This is a #TaxReformScam"]["Baltimore is mourning one of its finest tonight. Detective Suiter bravely served our community for 18 years, making it a better place. For that, we will always be grateful. My prayers are with his family. #BlueAlert https://t.co/hUOixkQt99"]["8 years ago today, Sergei #Magnitsky was killed for exposing corruption in #Russia. \n\nIn his name, I have redoubled my life's work to protect human rights &amp; promote good governance through U.S. law. More countries are now following suit in search of accountability &amp; justice."]["Survival rates for patients with #PancreaticCancer are in the single digits. That's not acceptable. We must demand better, starting with greater awareness and more funding for @NIH research. #WPCD https://t.co/mp8jpTk3GL"]["#PancreaticCancer is the deadliest major cancer. We must demand better funding and more research on behalf of patients everywhere. Join me in raising awareness today. #WorldPancreaticCancerDay #WPCD https://t.co/v1N4lCsY2C"]["If this is allowed to go through, Republicans will have succeeded in one bill to hike taxes for millions of middle-income families, and hike #healthcare premiums for Americans in every state of our union. #TaxReform https://t.co/HlOUOE4Hkm"]["In their attempt to deliver tax cuts for the 1% rather than for middle-income families, @SenateGOP not only seeks to add an incredible $1.5 trillion to our natl debt, but now want to add a partisan provision that would drop the floor out of the health insurance market. #TaxReform https://t.co/7qfzi6rtv1"]["@POTUS Climate change isn't just a global fight. It's our fight. It's impacting our coastlines, our economy, our health and our national security. We are #StillIn because we can do better; we can face this challenge head-on."]["Just came back from #COP23 to tell the world: America is #StillIn. Despite @POTUS, we are still committed to fighting climate change. Today, Americans are delivering that same message to their representatives. I'm proud to stand with them. https://t.co/s3eP8cgKLS"][".@POTUS believes a former KGB agent over 17 U.S. intelligence agencies. That's outrageous. The President's denial of facts is troubling, and I continue to question his willingness to fully implement the Russia sanctions law overwhelmingly passed by Congress. https://t.co/P5ZAPuAij1"]["#OpenEnrollment is happening now, Maryland. Compare #healthcare plans for 2018, see what financial help you qualify for, and #GetCovered. https://t.co/dwb8vCGATK https://t.co/s3pVxefSPi"]["Reminder, friends, that this year health care #OpenEnrollment is cut short. You only have until December 15 to sign up for coverage, change your plan or apply for financial assistance. Don't wait: https://t.co/2mfvqYh491"]["@Poke0904 @jimsciutto @realDonaldTrump @POTUS https://t.co/1eNyXtj3Xl"][".@realDonaldTrump believes an ex-KGB agent over 17 U.S. intel agencies. That’s outrageous..@POTUS ‘s denial of facts is troubling, &amp; I continue to question his willingness to fully implement the Russia sanctions law overwhelmingly passed by Congress."]["This #VeteransDay, let us honor our veterans in ways truly befitting their service: by vowing to protect the benefits they've earned. By considering their sacrifices every day, not only today. And by committing ourselves to the causes for which they served."]["Yes, America is still in and will live up to our commitments despite @POTUS #WeAreStillIn  @SenWhitehouse @SenMarkey @JeffMerkley @SenBrianSchatz https://t.co/OZXac84Avs"]["ICYMI - Proud Senate delegation at #COP23 America will live up to its global commitments for our natl and economic security. @SenWhitehouse @SenMarkey @JeffMerkley @SenBrianSchatz #Americanpledge You can watch our press conference from Bonn here https://t.co/SUmdCvEnRi"]["I represent the great state of Maryland, a state impacted by unchecked #climatechange. This isn't just a global fight, it's an American national security imperative. #COP23 #wearestillin"]["We Senators are here at #COP23 to make it clear that the American people support US leadership in fighting #climatechange. https://t.co/rbhFWMywmv"]["Today I join the country in saluting every man and woman who has put on a uniform in service to our nation. You deserve our gratitude and support every day, not only on #VeteransDay. https://t.co/nvWfLumWqo"]["Republicans' #TaxReform plan eliminates the college tuition deduction, state &amp; local income tax deduction, medical expense deduction &amp; disabled/retired tax credit. It also restricts the mortgage interest tax deduction.\n\n@SenateGOP: How does this help middle income families? https://t.co/wiyhCc9dCO"]["Republicans talk a good game, saying they'll protect middle-class families. But that's not what their #TaxReform plan does. Their plan eliminates or restricts deductions &amp; credits countless middle income families rely on. https://t.co/im6CRF0hID"]["Important to be here at #COP23 with this community, fighting global climate change together. Indeed, #WeAreStillIn https://t.co/rz5UQNvb58"]["The safety of our children and communities should never be put at risk by partisan gridlock. We know that we won’t be able to stop every tragedy, but we absolutely can save lives. #AssaultWeaponsBan https://t.co/XQP7gbusDM"]["Today I joined my Democratic colleagues in introducing the #AssaultWeaponsBan Act of 2017, banning the sale, transfer, manufacture and importation of military-style assault weapons &amp; high-capacity ammunition magazines. This ban never should have been allowed to expire. https://t.co/cN96osDGuU"]["Spot on, as usual, when it comes to protecting our environment. It isn’t just possible, but necessary for our nation. https://t.co/zXyV9QBIDE"]["A worthwhile explanation of how Republicans' #TaxReform proposal ultimately leads to a tax increase on middle income families. #NotOnePenny \n\nhttps://t.co/UBJugYWh7V https://t.co/4dFEsK1Lpq"]["Agree. To affect any positive, long-term change and protect innocent American and Korean lives, tensions must be reduced. #NorthKorea https://t.co/WjJzJTXXre"]["\"If you're middle class, the GOP tax plan might give you a sugar high, but it will not last. And a day of reckoning will follow.\" #TrumpTax https://t.co/zbZduAJTvM"]["With builders, realtors, preservationists, civic leaders to talk tax reform that truly and permanently helps middle class, unlike GOP plan. https://t.co/vXWlydmAjd"]["Speaking on diversity of opportunities in MD at first-ever Blue Collar STEM Conf. Four-year degrees not required for success! @mdstemfest https://t.co/iXqEf2s7G8"]["Thoughts &amp;prayers won’t prevent this but changes in our laws will. Dems have put forward concrete legislation. What are Republicans doing?"]["Heartbreak in #Texas today. Praying for victims &amp;their families. We need a change. We cannot allow this to be the norm. People are dying."]["If you're not from Maryland but still want to #GetCovered, change #healthcare plans, or apply for financial help: https://t.co/efKwkn0Qgs https://t.co/mGFUwuowPu"]["Reminder: Now is the time to see what financial help you qualify for, compare #healthcare plans, and #GetCovered. https://t.co/5dIEGd9p2S https://t.co/pntcT0ZVCU"]["Friends, take note: Maryland's health insurance marketplace is open for enrollment - &amp; changes to plans - right now: https://t.co/5dIEGcRNEi"]["I met Valeria &amp; other UMD #Dreamers. Their stories are why we must pass the #DreamAct this year. They deserve certainty about their futures."]["#Dreamers grew up here. They know no other home but the U.S. And as Valeria would say, \"people are people.\" \n\nhttps://t.co/md6wkBc2FZ"]["Valeria is a @UofMaryland student, and a #Dreamer. At 7 years old, she was brought to the US. She deserves to stay.\n\nhttps://t.co/md6wkAUrOr"]["Hearing from tearful Dreamers about their love for America and amazing efforts to get educated, build businesses, support families. #DACA https://t.co/OEX5a4VOp8"]["Joining Latino community leaders today in Baltimore: \"America's strength is being tested, because its diversity is being challenged.\" https://t.co/MbJGkvJtqB"]["Very pleased to announce the Frederick Douglass Bicentennial Commission Act has been signed into law. His vision and values live on. https://t.co/VPHQhP1sc1"]["@HouseGOP Their plan blows a hole in our budget, adding trillions to the national deficit, w/ little relief for the average American to show for it."]["@HouseGOP Republicans talk a good game, saying they'll protect middle-class families. But that's not what their plan does. #TaxReform #NotOnePenny"]["@HouseGOP Bottom line: this isn't #TaxReform. It's a series of cuts for corporations &amp; the very rich. Vast majority of relief isn't for middle class."]["@HouseGOP That's what @HouseGOP's plan offers working Americans. But for corporations? Tax cut. For the highest, top 1% of earners? Tax cut."]["@HouseGOP Restricts the mortgage interest #tax deduction. Eliminates state &amp; local income tax deduction. Repeals education &amp; medical expense benefits."][".@HouseGOP’s #TaxReform proposal leaves me wondering what happened to all their concern for working families. This plan abandons them. https://t.co/3mR2LXzEuW"]["Disturbing that @Interior is withdrawing from oil/gas transparency initiative #EITI. We should be embracing, not abdicating, transparency. https://t.co/2Db1m97RHG"]["If you're not from Maryland but still want to #GetCovered, change #healthcare plans, or apply for financial help: https://t.co/efKwknirF2 https://t.co/lcCk1YmrNX"]["If you don't have #healthcare coverage, or if you're interested in changing plans: open enrollment starts now.  https://t.co/5dIEGd9p2S https://t.co/8iVj3RQ0C9"]["We know #Russia's playbook, and we're increasingly learning @POTUS' playbook: distract, distract, distract. #MuellerIndictments"]["Today I spoke about the critical importance of #Mueller's investigation &amp; following the evidence wherever it leads. https://t.co/hu4W8mbMjr"]["@POTUS Both the 9/11 and Iraq AUMFs should be repealed &amp; a new, more narrow #AUMF enacted w/ checks on the use of combat troops &amp; greater oversight"]["@POTUS Make no mistake: the military authority Congress granted in 2001 was never meant to apply indefinitely, or as broadly, as it is today. #AUMF"]["Also: what's our mission in #Niger? By what legal authority is @POTUS carrying it out? These are basic questions; they deserve answers."]["This #AUMF hearing is on one of the most important issues we face: under what circumstances &amp; authority should we send men &amp; women into war?"]["Maybe now it's finally okay to talk about #GunSafety. https://t.co/iKEjwfAT7P"]["The time for talk is over. We must take action. It shouldn't matter where you buy a gun; background checks should be required. #GunSafety https://t.co/pwFCVPGA5b"]["#GunSafety should be a priority. Thoughts &amp; prayers aren't enough, and we can't wait for the next tragedy to occur.\n\nhttps://t.co/SrqUmDS8it"]["I'm still standing in solidarity w/ #Dreamers in Maryland &amp; across the country. We must keep fighting for the #DreamAct. #WeAreAllDreamers https://t.co/l7tahnhqLo"]["Bottom line: #TaxReform must not increase taxes on the middle class. And honest reform begins w/ an honest process.\n\nhttps://t.co/leWOB2KgCp"]["Our common goal should be putting more money directly in the pockets of working families. #TaxReform #TrumpTax https://t.co/IpzDH5ELrU"]["Republicans talk a good game, saying they'll cut taxes for middle-class families. But that's not what their plan does. #TrumpTax #TaxReform https://t.co/PvEDudGzWN"]["This week I delivered the Democratic Weekly Address. Let's talk #TaxReform. \n \nhttps://t.co/leWOB2KgCp"]["Marylanders are bearing the burden of @POTUS' sabotage of the individual market. This must end. Now. #healthcare\n\nhttps://t.co/90VyPbenZO"][".@POTUS promised to lower #healthcare costs, but every action he's taken has increased them exponentially. \n\nhttps://t.co/90VyPbenZO"][".@POTUS' decision not to fund #healthcare subsidies are causing big increases in premiums for many in MD. Shameful, &amp; completely preventable https://t.co/JHxnpiIusK"]["@SenateGOP Middle class families pay enough. A proposal like this #TrumpTax plan would make it even harder for them to save. I will never support that."]["@SenateGOP .@SenateGOP is also prepared to devastate retirement plans to finance putting corporations and #BillionairesFirst:\nhttps://t.co/cHt3iwe6NH"]["@SenateGOP The truth: this #TrumpTax proposal is a ruse for upending deductions the middle class relies on to pay for tax cuts for corporations &amp; rich. https://t.co/WL8RsyzfJx"]["Republicans are hoping no one can tell the difference between \"tax cuts for the very wealthy\" &amp; actual #TaxReform\n\n@SenateGOP: We can tell."]["Extremely disappointed my GOP colleagues didn't heed our plea. The fox shouldn't guard the hen house. #Dourson \n\nhttps://t.co/ZfTmSobfX5"]["Also: 60 senators support it. \n\n@SenateMajLdr: schedule it for a vote - now. Millions of families are counting on us. #AlexanderMurray"]["The bipartisan #AlexanderMurray healthcare bill is a compromise that would fund subsidies, stabilize the markets, and lower premiums. https://t.co/rAolggdya2"]["@SenateGOP It offers #TaxCuts, yes - to the rich &amp; to corporations. Then asks middle class families to pay for them. All while exploding the deficit."]["Just held a press conference on @SenateGOP's #TaxReform proposal - a proposal terrible for middle class families. #NotOnePenny https://t.co/r8A9q2hBmR"][".@BillBrowder has been a global advocate for anti-corruption in #Russia. @DHSgov should immediately review the decision to revoke his visa. https://t.co/dwKGh3pm0s"]["I'll be sitting down w/ @GWpublichealth shortly to discuss the most pressing global health challenges. Join me live: https://t.co/jTQgZo3X7e"]["Folks who want to help #PuertoRico can reach out to any Natl Voluntary Agencies Active in Disasters organization: https://t.co/GrWNYfwQNm"]["Reminder: 3 million Americans in #PuertoRico still don't have power. Or water. Or many of the resources they need. Shameful. We must do more"]["No one can afford these hikes. @SenateMajLdr must bring a #healthcare deal to a vote NOW. Lives are at stake. \n\nhttps://t.co/7VwCwvUgPT"][".@POTUS cut #healthcare subsidies last week and Marylanders will pay the price if Congress doesn't act NOW.  https://t.co/7VwCwvCFrj"]["With '18 approaching, we MUST pass legislation stabilizing the #healthcare markets &amp; lowering premiums. Let us vote on a deal, @SenateMajLdr"]["If you're not from Maryland but still want to #GetCovered, change #healthcare plans, or apply for financial help: https://t.co/efKwkn0Qgs"]["If you don't have #healthcare coverage, or if you're interested in changing plans, mark your calendars for Nov. 1: https://t.co/5dIEGcRNEi"]["Friends, take note: Maryland's health insurance marketplace is opening enrollment on November 1: https://t.co/5dIEGd9p2S \n\n#healthcare"]["With African-American leaders in Howard Co. to find new ways to improve civil, women's &amp; veterans' rights, health care, criminal justice. https://t.co/7kA6VAsAye"]["Joined today by courageous #Dreamers at Howard Community College. They show why we need thoughtful, compassionate immigration reform. #DACA https://t.co/0oH6EUYSsd"]["@SenateGOP @POTUS So if you're wondering who this #budget is for: just follow the money."]["@SenateGOP @POTUS And btw, every Republican - the \"fiscal conservatives\" - voted against my amendment to stop these cuts from exploding the deficit. #Budget"]["@SenateGOP @POTUS It also cuts taxes for the top 1% of earners – and pays for it by slashing #Medicare and Medicaid. #Budget18 https://t.co/PiSIPhcWvz"]["@SenateGOP @POTUS The wealthy. This #budget balloons our deficit &amp; takes resources from middle class families to give tax cuts to big corporations &amp; the rich."]["@SenateGOP @POTUS So if this #budget doesn't help infrastructure, Medicare, those struggling to afford health care, or housing, or food - who does it benefit?"]["@SenateGOP @POTUS Our crumbling infrastructure? Again, no. @SenateGOP’s budget cuts transportation spending by $200 billion. #Budget18"]["@SenateGOP @POTUS What about low income Americans? Nope. @SenateGOP's #budget comes with a $37 BILLION cut to affordable housing and $6.5 billion cut to WIC."]["@SenateGOP @POTUS Similarly, this \"budget\" slashes #Medicaid by $1 trillion &amp; cuts ACA tax credits by hundreds of billions - gutting #healthcare for millions."]["@SenateGOP Senior citizens? No. This budget cuts #Medicare by $473 billion, despite @POTUS promising he would protect it: https://t.co/pu4WZUc2ab"]["THREAD: The #budget @SenateGOP is pushing through tonight is an exercise in extremism. Let’s speak frankly about who it benefits."]["I applaud my Canadian counterparts for this effort and look forward to closer cooperation in the fight against corruption. #GlobalMagnitsky https://t.co/TGBQeO782Q"]["Canada's passage of the Justice for Victims of Corrupt Foreign Officials Act sends a powerful message against impunity. #GlobalMagnitsky https://t.co/JzXSAVna6u"]["The #CleanWaterAct turned that around, protecting our water, our communities &amp; the countless livelihoods that depend on the Chesapeake Bay. https://t.co/sDQmeHBQsn"]["Before the #CleanWaterAct, the U.S. was in crisis. Unfettered pollution had rendered a majority of our waters unsafe for swimming &amp; fishing"]["On this 45th anniversary of the #CleanWaterAct, remember that EVERY community, every family, needs clean, safe water. Water is not political https://t.co/QCCxlmYh1v"]["Heartbreaking. Infuriating. \n\nEdgewood residents: stay safe, stay inside, and stay tuned in to local authorities. https://t.co/hRlac6StGD"]["Bipartisan cooperation is critical here. Lives are at stake. Hopeful @SenateMajLdr will bring a deal to a vote. https://t.co/OkaGMb9dv1"]["Bipartisan cooperation is always a step in the right direction. We must work together to stabilize the #healthcare market &amp; lower premiums. https://t.co/OkaGMb9dv1"]["Ms. Trump's involvement with the #WeFi initiative could motivate foreign governments to support the fund in order to curry favor w/ @POTUS https://t.co/LAaSUE9N36"]["It's not appropriate for Ivanka Trump to serve as a public advocate for the #WeFi initiative. My letter to @stevenmnuchin1 explains why: https://t.co/TxbnGoKQD6"]["Congrats @SenJohnMcCain for receiving the #LibertyMedal tonight at the @ConstitutionCtr ...well deserved for a lifetime of public service"]["We have a #publichealth crisis w/gun violence. We need to change the mind set that makes this possible. Silencers, bumpstocks are not needed"]["Thank you to all the @PrinceGeorgesMD leaders and activists gathered to address this important community issue. #gunsafetynow https://t.co/938tcul9dn"]["Marylanders are dealing w/the effects of #gunviolence every day. We need to do better to protect the #publichealth"]["Great Teachers, Great Leaders, Great Schools...make for great students. Proud to announce new federal funds w/@ChrisVanHollen @GreenbeltMD https://t.co/SCaUeCZKH5"]["Exciting morning @Greenbelt Middle School to announce &gt;$25M for @PrinceGeorgesMD schools to foster best practices. Thx to all our educators https://t.co/tCwGY42OCd"]["We must act despite a @POTUS unconcerned about America’s reputation, not committed to relationships &amp; willing to gamble w/US natl security"]["It is now up to Congress to show the world there is bipartisan support for the United States to uphold its commitments, including #JCPOA"]["Not 1yr into his Presidency, this is one of the most dangerous &amp;consequential decisions @POTUS has made imperiling U.S. natl security #JCPOA"]["A serious policy would keep #JCPOA in place, demand rigorous enforcement &amp;push back on Iran’s non-nuclear aggression https://t.co/BQjNHaBVmT"][".@POTUS ’s rhetoric and actions on #Iran directly threaten U.S. natl security and damage our credibility https://t.co/WB8hYGzMaQ"]["@POTUS The President’s continuing efforts to sabotage our American #Healthcare system are dangerous and will put people’s lives at risk"]["@POTUS .@POTUS is creating a situation where the risk pool is destroyed as younger/healthier flee exchanges for lesser coverage #stopthesabotage"]["Supporting, empowering girls to reach their full potential should united the world every day, particularly this #DayOfTheGirl"]["The girls of today will be the leaders of tomorrow. Let’s make sure we do all we can to support them today and everyday #DayOfTheGirl"]["Today on International #DayOfTheGirl the world must recommit to a more equitable, safer, prosperous and health world for women and girls"]["Make no mistake: all of us who care about our shared future on this planet will keep looking for ways to #ActOnClimate.  #CleanPowerPlan https://t.co/GtDKZ2iPk7"]["The #CleanPowerPlan's number speak for themselves. The Trump Administration's rollback of this plan takes us in the wrong direction. https://t.co/Q1S8hsNPkK"]["Rolling back the #CleanPowerPlan undercuts our renewable energy sector, which employs 5x more American workers than the fossil fuel industry"]["With this rollback of the #CleanPowerPlan, @POTUS continues singular focus on derailing any Obama Admin policies at the country's expense. https://t.co/BcNUrByYPf"]["Most #DREAMers know no other home except the U.S. Their lives should not be used as leverage for a foolish border wall, or anything else. https://t.co/zzYgmmanjp"]["Terrible. My prayers are w/ Biloxi and all those affected by #HurricaneNateِ. Surging continues. Stay tuned in to local radio/alert systems. https://t.co/HZUpvKJPom"]["I'm thinking of Louisiana &amp; everyone along the Gulf Coast facing down yet another storm tonight. Please be safe &amp; listen to local officials."]["We've needed this advice far too often lately.\n\nFor anyone in the path of #Nate, please use today to prepare: https://t.co/CTNDMHdJMu"]["@Global_Witness @USTreasury @SenatorLeahy @SenatorDurbin @SenSherrodBrown @RepMaxineWaters @SenBooker @carlyoboth @MddeH @sostfeld America should be leading the world in #transparency not retreating to protect narrow corporate special interests."][".@POTUS: Stop. Just stop. #BirthControl isn't a controversy - it's health care. And this directly impacts the health of 62 million women. https://t.co/IGhZO5mrgh"]["This isn’t about religion – the #ACA already accommodates religious organizations. This is an attack on women's health, plain and simple. https://t.co/EmxhcIwMM9"]["This is a shameful assault on women's health. #BirthControl is NOT controversial. 9 in 10 women use contraception at some point in life. https://t.co/lwOlBSW3As"]["Disgraceful. This will allow any employer – even if they aren't religiously affiliated – to immediately stop covering #birthcontrol. https://t.co/lwOlBSW3As"]["The workers at @NorthropGrumman are the best there is, and they manufacture the best there is. Proud to have you in MD. #MFGDay17 #MadeInMD https://t.co/jYxowfWzlE"]["A real pleasure meeting w/ third shift workers at @NorthropGrumman. Can't thank you all enough for the work you do on behalf of this country https://t.co/i0s33uZ8eh"]["Currently, buyers can walk away w/ a firearm if a background check takes longer than 72 hours to complete. Unacceptable. #NoCheckNoSale https://t.co/PvIDgtJ5Ao"]["I will also be co-sponsoring @SenBlumenthal's Background Check Completion Act to close the so-called \"Charleston loophole.\" #GunSafetyNow"]["We can't wait idly by for the next mass shooting to take more innocent lives. But that's what #BumpStocks do: take lives. No more. #LasVegas https://t.co/htWn1ApEvJ"]["It's not \"too soon\" to try and save lives. I'm co-sponsoring @SenFeinstein's bill to ban #BumpStocks from the U.S. \n\nhttps://t.co/5SBNBllxab"]["Congress must act. States must act. Weapons of war should not reach the hands of civilians. Period. #LasVegas #GunSafetyNow https://t.co/OVWgsec8xF"]["Today, I ask again: how high does the death toll have to get before we enact real #GunSafety reforms to make the American public safer?"]["Commonsense measures with broad support. #GunSafety #NotOneMore \n\nhttps://t.co/URm0Hs1o6n"]["We need to stop the carnage. More talk and prayers will not save lives. Only action and real changes in our laws can. #LasVegas #GunSafety https://t.co/5UiXlVmSFY"]["We must act. Automatic weapons aren't needed to hunt deer or ducks; they're meant to kill people – and they do far too often in this country https://t.co/5OLHEC2tbW"]["Actions speak louder than thoughts and prayers. We must end this toxic cycle of shock &gt; condolences &gt; inaction. #LasVegas #GunControl"]["Heartbroken. I'm grieving with all of Las Vegas - and the country - today. There aren't words for how appalling and senseless this is."]["Totally unacceptable that @POTUS - any POTUS - would demean a #SecState while abroad pursuing diplomacy #NorthKorea https://t.co/bEZs2PBkuD"]["Thanks, @BrianFrosh, for fighting for #CleanAir for Marylanders. Upwind plants contribute much of the smog that harms Maryland’s air https://t.co/Tdzme0Mrtw"]["Agree. #CleanWaterRule protects 117 million Americans' drinking water. Thanks for fighting the good fight, @BrianFrosh - MD is behind you. https://t.co/gelXbkmAbc"][".@BetsyDeVosED: Make it clear survivors' voices will be heard under this administration. Reinstate #TitleIX campus sexual assault guidance."][".@BetsyDeVosED's decision to rescind #TitleIX sexual assault guidance shows a lack of concern for survivors, who asked to keep it in place."]["Today @SenateDems &amp; I sent a letter to @BetsyDeVosED urging her to reverse course on her decision to rescind campus sexual assault guidance https://t.co/iWoJrIJlaL"]["The @WhiteHouse issued a temporary #JonesAct waiver for TX and FL. Glad they've finally gotten around to granting one for #PuertoRico too. https://t.co/cOn4jd6jY9"][".@SenateGOP can't treat #TaxReform reform like they did health care, w/ a few lawmakers in a room drafting a bill without input from others. https://t.co/d8Bai76ni0"][".@POTUS' #TaxReform outline kicks all the hard decisions to congressional committees. Ok. But then we need a transparent, bipartisan process"]["While I'm glad @POTUS' #TaxReform proposal has grown from 1 page to... something slightly longer... it's still lacking fundamental details. https://t.co/knrHATJ6nN"]["Comment period is still open. Tell @EPA Admin Scott Pruitt #water isn't a partisan issue. Don't treat it like one. https://t.co/gcUr3rffM1 https://t.co/PAEUIQ9DUG"]["Today is the last day to comment on repeal of the #CleanWaterRule. You know - the rule that protects 117 million Americans' drinking water. https://t.co/zxOEE2azd1"]["I'm still ready and willing to work w/ GOP to pass improvements to the ACA &amp; stabilize the individual market. @SenateGOP: let's get to work. https://t.co/28OdryabIZ"][".@SenateGOP is no longer pursuing #GrahamCassidy -- because of you. You made sure they didn't have the votes. Thank you. You saved lives."][".@POTUS must send Congress a request for this supplemental aid ASAP. #PuertoRico is facing life-threatening challenges; they cannot wait. https://t.co/hTpS8Q8Ax7"]["We must approve a supplemental aid package for Hurricane Harvey, Irma &amp; Maria relief - and it must include #PuertoRico and US Virgin Islands"]["#PuertoRico's 3.4 million residents are American citizens. They deserve the same commitment &amp; support we would give anywhere else in the US https://t.co/U0DfODOglK"]["Congratulations to MD Principal of the Year @SandragReid2, and thank you for the conversation on how to better serve @PikesvilleHS students https://t.co/T0HR49wlx4"]["Our most basic values &amp; our role as a global leader are under attack by Pres Trump. It's incumbent upon us to safeguard &amp; advance our ideals https://t.co/mM2w53m255"]["Speaking shortly with @Devex about the future of international development &amp; the role of US foreign aid. Watch live: https://t.co/sR30lIuee0"]["We shouldn't be making it easier for despots to slaughter civilians or for our weapons to reach terrorist groups.\n\nhttps://t.co/lKPdhBIYcU"]["Devastating. My thoughts &amp; prayers are w/ #PuertoRico. These are American citizens - we owe them every resource we have to rebuild &amp; recover https://t.co/VZAuPsQEkj"]["We all develop \"preexisting conditions\" at some point. No one should be denied or priced out of coverage b/c of it. Period. #GrahamCasiddy https://t.co/b1L0i5gwlN"][".@SenateGOP: What happened to this? #GrahamCassidy https://t.co/7ofTYzZTkW"]["#GrahamCassidy ends protections for people w/ preexisting conditions &amp; permits caps on coverage.\n\nIt doesn't improve #healthcare, it guts it"]["#GrahamCassidy would end protections for people with preexisting conditions, devastating families like this one: \n\nhttps://t.co/FIRBnWmUru"]["Grateful for everyone speaking out against this dangerous #GrahamCassidy health bill. I hear you. I'm listening. Let's fight this together. https://t.co/Ia8dwoD3lX"]["We all develop \"preexisting conditions\" at some point &amp; regardless of zip code, you shouldn't be denied or priced out of coverage b/c of it."][".@SenateGOP: How does a bill that strips millions of coverage &amp; gut preexisting conditions protections even qualify as a \"health care\" bill?"]["#GrahamCassidy:\n\n-Eliminates protections for preexisting conditions\n\n-Permits annual &amp; lifetime caps on coverage\n\n-Guts Medicaid\n\n#SaveACA"]["Tomorrow, it begins: @SenateGOP's last shot to repeal the #ACA with a new bill that strips protections for people w/ preexisting conditions."]["Democracy. Freedom of speech. Freedom of expression. The power of \"We the People\" wanting to encourage a more perfect union. #Baltimore https://t.co/bIUFsrVTZZ"]["Just heard @Fox5DC is moving to Bethesda. Glad to have you in Montgomery County! Wishing you and your staff a warm welcome to Maryland"]["With more than 1 in 5 women sexually assaulted on campus, @usedgov should be increasing #TitleIX protections https://t.co/khicKeH5nD"]["Today’s action by @BetsyDeVosED to rescind #TitleIX guidance unnecessarily harms, minimizes survivors’ voices  https://t.co/khicKeH5nD"]["Devastated for the people of Mexico City tonight. My prayers are with you all. Know that the US stands w/ you as you work to heal &amp; rebuild."]["Last time, #ACA survived because of you. Your calls, your rallies, your persistence.\n\nWe need you again.\n\n#GrahamCassidy is their last shot."]["The #ACA needs work, no question. I stand ready &amp; willing to pass improvements. But total repeal? Gutting Medicaid? Millions uninsured? No. https://t.co/GWn5NJdnxs"]["A bill that leaves millions uninsured and fails to guarantee coverage for people w/ preexisting conditions is not a #healthcare bill. https://t.co/l1zCCnaZrl"]["Annual caps on coverage. Guts Medicaid. NO guarantees for preexisting conditions. #GrahamCassidy doesn't reform healthcare, it eliminates it"]["#GrahamCassidy is GOP's last shot to repeal the #ACA. We must stop it in its tracks. You made the difference before - we need you to again."]["The #GrahamCassidy bill is #Trumpcare in all but name: guts Medicaid, permits annual &amp; lifetime caps on coverage, leaves countless uninsured https://t.co/ZSXjBlEF79"]["Unbelievable. Just when we thought we were making bipartisan progress on #healthcare, @SenateGOP revives #Trumpcare https://t.co/rjHBtd2zw4"]["If you're in South #Baltimore, please comply and shelter in place now. Listen for &amp; continue to follow directives of local authorities. https://t.co/wrne1vc6z8"]["Info on how to go about taking these steps, and more, can be found here: https://t.co/1LjYW1ay55"]["3) If a credit freeze isn’t an option, plan to monitor your credit reports closely and/or initiate fraud alerts. #Equifax"]["2) Consider placing a temporary freeze on your credit. This will block ID thieves from taking out accounts/loans in your name. #Equifax"]["1) You're entitled to a free copy of your credit report at https://t.co/gJGY2vN3DU – get yours now. Check all info is correct. #Equifax"]["Marylanders worried you're affected by #Equifax's huge data breach (and for safety, you should assume you are): here's steps you should take"]["Agree. #Equifax is proof our data breach laws need reform, and fast, if we’re going to protect consumers.\n\nhttps://t.co/58lj4Q9KTr"]["Let us also remember the victims of the recent earthquake in southern Mexico. I stand in solidarity with them as they rebuild. #VivaMexico https://t.co/omP5bbeqSK"]["On this #MexicanIndependenceDay, we reaffirm our friendship with our southern neighbor and the unbreakable ties between our two countries."]["We stand in solidarity with the people of #London, and pray that all those injured fully and quickly recover."]["Big thanks to @blairprincipal for working so hard to provide an environment that values civic engagement and freedom of thought &amp; discussion https://t.co/31BpKCethZ"]["Thanks for having me today, Montgomery Blair High, and for being so engaged &amp; asking such good questions. A real pleasure meeting you all. https://t.co/HYOISv8p9R"]["Tell @EPA Admin Scott Pruitt #water isn't a partisan issue. We cannot allow it to be treated like one. https://t.co/gcUr3rffM1 https://t.co/JIiuyvacRF"]["The #CleanWaterRule protects our streams &amp; wetlands -- critical for the 117 million Americans whose drinking water comes from those sources."]["Here's the letter we submitted opposing repeal of the #CleanWaterRule. You can submit your own comments now - 9/27: https://t.co/gcUr3rwQDz https://t.co/WvPCtUN0Jy"]["117 million Americans get their drinking water from sources protected by the #CleanWaterRule. Repealing it would put them in jeopardy. https://t.co/xK65Z0MmUP"][".@SenatorCarper and I are pushing back against @EPA Admin Scott Pruitt's attempts to undo the #CleanWaterRule. https://t.co/T2qykOw9An"]["Single-payer or #MedicareForAll is another way to achieve universal coverage. Details and funding must be ironed out, but I’m open to it. https://t.co/BgnyHp90B3"]["That's why earlier this year I intro'd my #healthcare bill S.1511, which includes a public option – something I supported during #ACA debate https://t.co/RTfcJY14hC"]["#Healthcare is a human right. Period. And I've long supported a public option. It would increase competition &amp; help make coverage universal."]["Met w/ El Salvador's FM Martinez &amp; senior legislators. All agreed Congress must pass the #DreamAct ASAP and extend TPS for Salvadorans in US https://t.co/64DrlgyaW5"]["Edith Windsor's fearlessness &amp; resolve in the face of discrimination created a turning point in #LGBT rights. And let that be her legacy."]["Thank you, Edith. You helped change countless lives and create a more perfect union. Your legacy will live on. \n\nhttps://t.co/GOrF4N0KDk"]["We must now focus on ensuring @BaltimorePolice have resources they need to repair trust between officers &amp; people they're sworn to protect. https://t.co/G6c3NmQIJT"]["Disappointed by reports that @TheJusticeDept won't seek justice for #FreddieGray. But not surprised. https://t.co/LfD2PZA6Ay"]["Thanks, @BrianFrosh, for representing Maryland well in the legal fight to protect DREAMers and keep #DACA in place\n\nhttps://t.co/rF17UH5mnE"]["In the midst of political strife, we must remember this: our differences are dwarfed by what binds us together as Americans. #NeverForget"]["The best way to honor those who died on #September11th is to keep that American spirit of courage, compassion and generosity alive. https://t.co/nrNUuNKVNN"]["#September11th didn't just test our character - it revealed it. Americans responded with courage, self-sacrifice, charity and resolve."]["Today, we solemnly recommit ourselves to our promise to #NeverForget as we pause to remember all 2,977 souls taken from us on #September11th"]["Once #HurricaneIrma hits your area, these @FEMA safety tips should be your guide: https://t.co/E5zxUCml1e"]["Everyone in #HurricaneIrma's path: this is what you need to be prepared. Check as many items as you can safely get: https://t.co/HMNVzQ2hWI"]["I'm thinking of Florida tonight. My prayers are with you all &amp; everyone in #HurricaneIrma's path. Please stay safe &amp; listen to alert systems"]["Raised here, DREAMers know no other home but the U.S. They are American in all but immigration status. Congress must protect them. #DreamAct https://t.co/weftdslQDJ"]["Without #DACA, many brought here as children will be forced out of work, into hiding, into poverty.\n\nNone of which will make us stronger. https://t.co/MTEmBOSjus"]["An amazing collection of interfaith leaders joined me today to stand united against hate. Proud to always stand with them. #charlottesville https://t.co/tm002WUGEt"]["Appalling. 1 in 5 women experiences sexual assault in college - this should lead us to increase protections for survivors, not minimize them https://t.co/IaQuyvKYkj"][".@USEdGov adopted landmark protections for campus sexual assault victims in 2011. Appalling that @BetsyDeVosED would now try to dilute them. https://t.co/IaQuyvKYkj"]["Congress must act now. #DreamAct #HereToStay\n\nhttps://t.co/N23O8tfS51"]["DREAMers grew up in this country, they were educated in this country. We've already invested in them &amp; it shows in the numbers. #HereToStay https://t.co/J6zHfhx0jg"]["DREAMers were brought here as children. They know no other country but this one. They are #HereToStay -- and ending #DACA won't change that. https://t.co/AFNAdFZxrz"]["Ending #DACA will break apart families and drive many underground, out of work, and into poverty.\n\nNone of which will make America stronger. https://t.co/tGXiv3nV9i"]["With the Trump Administration reversing #DACA, it's time for Congress to step up and pass the #DreamAct\n\nhttps://t.co/N23O8tfS51"]["Thank you to @PattyMurray &amp; @SenAlexander for bringing together both sides to discuss #healthcare this morning. Let's keep working together."]["We discussed things we can do now, this month, to stabilize #healthcare markets. Constructive dialogue. Hopeful we can move forward together https://t.co/HnWjr9uIyc"]["This morning, I joined 25 senators - both Democrats and Republicans - in a constructive, bipartisan conversation about #healthcare."]["I am determined to see Congress protect DREAMers once and for all -- and we can start by immediately taking up legislation to restore #DACA. https://t.co/Y1BzNpRCo0"]["Bottom line: #DACA recipients are real people - people who were brought here as children. Upending their lives doesn't make America stronger"]["America has already invested in DREAMers by educating them in our schools, integrating them into our communities. Why squander that? #DACA"]["#DACA recipients came here as children, undocumented through no fault of their own. For the most part, this is the only country they know."]["The Trump Administration's order to end #DACA is cruel, counterproductive &amp; was clearly done with little thought of the human consequences."]["W/ @MayorPugh50 &amp; @prezjackyoung at brand new Frederick Elementary, kicking off the school year. Every child deserves a safe, quality school https://t.co/1HzaZR50Sr"]["American workers are the strength &amp; backbone of this nation. All legislation, from #healthcare to #TaxReform, must consider them. #LaborDay"]["#LaborDay should be a reminder of all that we owe this country's working class: fair wages &amp; benefits, healthcare, quality job training..."]["On #LaborDay we honor the women &amp; men across the country who clock in day after day to support their families and our communities. Thank you"]["Wishing everyone a happy and relaxing #LaborDay. A special thank-you to American workers for your unflappable resiliency and strength."]["Worth repeating that most DREAMers have only known USA as home. Without legit reason, real families will be hurt by @POTUS. #DefendDACA"]["Our middle class pays enough. #TaxReform must be designed to help them save - not pay more. #NotOnePenny"][".@POTUS hasn't released details yet. But bottom line: I won't support #TaxReform that burdens middle class families\n\nhttps://t.co/2VhNSaLAxR"]["Putting DeVry officials in charge of policing fraud in #HigherEd is putting the fox in charge of the hen house.\n\nhttps://t.co/IPKWcKXM8P"]["The Obama Admin worked to remove bad actors from #HigherEd &amp; protect students. Now we find them working at @USEdGov\n\nhttps://t.co/IPKWcLfn0n"]["@JohnsHopkins Apologies for the intermittent signal. Trying to stay live as long as possible. Tune in to CSPAN tomorrow for the full townhall"]["Happening now! Live #townhall @JohnsHopkins Rockville campus. We are talking #healthcare and much more.  https://t.co/n2pCfjbf68"]["Excited for another great #townhall with Marylanders. Live in Rockville at @JohnsHopkins https://t.co/GehINHcipj"]["@MontgomeryCoMD There is no simple answer. We need to learn more about each other to understand our differences and our similarities."]["Troubling. We need to empower @StateDept to seek accountability for #NorthKorea’s human rights abuses. Concerned this will impede that goal. https://t.co/UKFDd4v5Ca"]["Incredible range of Q&amp;A w/biz leaders from across @MontgomeryCo . Thank you @MCCCMD for bringing everyone together in support of our region https://t.co/SknoYNiuw3"]["Spending money on a wall between Mexico and the US is not only a waste of money, it is counterproductive. We need to work w/our neighbors"]["Thank you to those who bravely shared their stories and helped put a human face on the need to extend #TPS and #DefendDACA https://t.co/OoPxwByGJ9"]["Threat from #NorthKorea is too grave to abandon diplomacy. Work w/ Congress to develop a plan. Foreign policy can't be conducted via tweet. https://t.co/ea5KyaGprP"]["Clearer heads prevailing. If you are able and willing to serve your country, you should be allowed to do so. https://t.co/ntsdpYPHxr"]["As w/ most of @POTUS' foreign policy, there's no clear #NorthKorea strategy. Just empty statements &amp; wild tweets. We need a plan of action."]["Rising tensions with #NorthKorea are also a clear indication that @POTUS' approach is not working. https://t.co/aYZTONqwNc"]["The latest provocation from Kim Jong-un’s regime violates several UN resolutions and directly threatens our ally Japan. #NorthKorea https://t.co/k1lMmpMP68"]["The lack of affordable, convenient transportation choices has been frustrating for MD commuters. With #PurpleLine, that's starting to change"]["Job creation and economic development rely on infrastructure, particularly public transit. That's why this is such good news. #PurpleLine https://t.co/9YGnKq5Znc"]["Pleased that federal investment in the #PurpleLine was finalized today &amp; now construction can begin. Great news for thousands of Marylanders https://t.co/9YGnKq5Znc"]["A great resource for how to help the victims of #Harvey, for all those interested: https://t.co/HYVsdkMKGV"]["Thank you to all the heroes in TX &amp; LA who worked through the night - and are continuing to work through the day - to save lives. #Harvey"]["Threatening a govt shutdown &amp; jeopardizing Americans' access to public services over this misguided #BorderWall is profoundly irresponsible."][".@POTUS' plan for a #BorderWall is completely divorced from the geographic, human &amp; economic reality of the border.\n\nhttps://t.co/2DtYEY7RlH"]["This isn't the way to govern. @POTUS must learn to work w/ Congress – not threaten shutdowns when he fears he won’t get his way. #BorderWall"]["Let me get this straight: @POTUS is threatening to shut down the govt unless we fund a #BorderWall that he promised Mexico would pay for."]["The #ERA is shorter than 3 tweets, but would codify gender equality in our Constitution. This #WomensEqualityDay, let's recommit to #ERANow https://t.co/L4MOL64wKE"]["Let's make #WomensEqualityDay more than a celebration. Let's use this day to remember #equality is a work in progress. \n\nNext stop: the #ERA https://t.co/iYFvoaPRU9"]["Proud to be celebrating #WomensEqualityDay. Today we commemorate passage of women's right to vote -- and the ongoing fight for equality."]["Unfathomable...under any other president. Outrageous under any circumstances. FYI Sheriff Joe &amp; @POTUS: accepting pardon=admission of guilt https://t.co/tH9yOjSEZ5"]["#CICIG has been crucial to strengthening the rule of law in #Guatemala. As Commissioner, Mr. Velásquez has been integral to those efforts. https://t.co/jdFxozXDhL"]["I'm deeply concerned about reports suggesting there have been efforts to remove Commissioner Velásquez from #CICIG in Guatemala."]["A tremendously troubling development. Azerbaijanis deserve a free and open press.\n\nhttps://t.co/kivzXznO7I"]["These brave men have been defending our nation and I wish only strength &amp;courage to their families who have already sacrificed so much."]["All Marylanders and the nation are anxiously awaiting word on these two native sons and the others who have been missing since Monday."]["My thoughts are w/families of Kevin Sayer Bushell (Gaithersburg) &amp; Timothy Thomas Eckels Jr. (Manchester) who are among #ussmccain missing"]["Very concerned by detention of Mehman Aliyev, head of #Azerbaijan's last ind. media org @TuranAgentliyi. #FreePress https://t.co/kivzXzFoZg"][".@POTUS' #TransMilitaryBan runs counter to our values and our natl security. The US govt should not be codifying discrimination. Period."]["The thousands of #transgender Americans serving in our military are patriots. They deserve better than this from their Commander-in-Chief. https://t.co/a5iNqoeKWv"]["This is wrong. Plain &amp; simple. Serving in our #military should be about protecting our country, not excluding those able &amp; willing to serve. https://t.co/dCwWYgvUje"]["This is deeply disturbing news. Transparency is critical to every democracy, and that's what @NDI has sought to foster worldwide. #Cambodia https://t.co/Ac0I5pAlJl"]["Incredibly proud of @BayTrust and all the kids learning how to #SaveTheBay. Their program proves job training &amp; clean water go hand in hand. https://t.co/ZTHws1jHU9"]["Happy to be in Glen Burnie this morning. I'm here listening to Maryland's women &amp; families and learning what #ABetterDeal means to them. https://t.co/GiuoD2PWG7"]["In Towson @ Bykota Senior Ctr for a town hall. Great chance to hear from Marylanders about issues that matter most to them. #ABetterDeal https://t.co/zqexttynCk"]["In Baltimore's Sandtown-Winchester speaking w/ residents on the need to protect - and improve - senior and community services. #ABetterDeal https://t.co/AzsQtkzKql"]["We must recommit ourselves to the treaties, laws &amp;norms that protect humanitarian actors and facilitate their life-saving work #NotATarget"]["With escalating conflicts around the globe, the need for humanitarian assistance has never been greater &amp; providing it never more dangerous"]["On World Humanitarian Day, we honor the brave humanitarian workers who risk their lives to assist the world’s most vulnerable #NotATarget"]["Who knew?!? https://t.co/SI0cxr3gwE"]["Courage, indeed. Joshua, Nathan, Alex, know that you are not alone  as you defend the rule of law #umbrellamovement https://t.co/dAkdHWbe5X"]["I'm glad Mr. #Bannon no longer has a govt platform from which to peddle bigotry. But this admin's problems are far bigger than one person."]["My heart is with #Barcelona and all of Spain tonight. The US stands with you in condemning the cowards that committed this heinous attack."]["Learning more about #handcraftedgoodness @BurleyOak w/ founder Bryan Brushmiller and brewmaster Adam Davis.  #MadeInMD #SmallBiz #Delicious https://t.co/cufcGecZH1"]["Great to join local leaders at the MACo Summer Conference. My annual town hall is a key way to learn more about issues around MD. #MACoCon https://t.co/OvQYGmO3tF"]["Small biz is the lifeblood of great American towns. In Ocean City hearing from locals about ways we can do more to help. @OCMD #ABetterDeal https://t.co/sQ9g7b07RH"]["In OC w/ local watermen, business owners and US Army Corps this AM to discuss ways to keep harbors open, economy thriving. https://t.co/AvJGDviVSX"]["There's a right side and a wrong side to this issue. There are no \"all sides.\" Period. And we must always speak out &amp; defend the right side. https://t.co/qCnSKP9RBR"]["Rather than use this moment to bring the country together, @POTUS equated white supremacists w/ those defending America against them."][".@POTUS' latest remarks on #Charlottesville obliterated any semblance of moral leadership that we'd typically expect from a president. https://t.co/8dSc6mkSJx"]["@Ramona15768572 Context is important. A lone statue provides few lessons or warnings for the future. Historical sites and museums tell needed stories"]["Agree. We don't need a statue to learn the lessons of Dred Scott. Let’s focus on teaching what, why and #neveragain https://t.co/D8cvfUuMMf"][".@POTUS empathy for white supremacists has obliterated any semblance of moral leadership that Americans expect from their president"]["Rather than bring our country together, @POTUS used his bully pulpit to equate white supremacists w/those defending America against hate"]["White supremacy and racism are repugnant and fundamentally against the values we hold dear as a civilized society"]["DREAMers have gone to school, worked, played &amp; worshiped w/ us since they were young children. They deserve a chance to succeed. #DefendDACA https://t.co/fAVGhCNWPk"]["We shouldn't hold children responsible for the actions of their parents. Period. And we have always been a nation of immigrants. #DefendDACA"]["DACA proves that it is possible to be both fair and compassionate, and that this country is best when we insist on being both. #DefendDACA https://t.co/B895OTgjKb"]["#DefendDACA because immigration enforcement should focus on dangerous individuals, not children who've known no other country besides the US"]["I'm ready to work on #TaxReform. But it must be designed to help - not hurt - middle class families. #NotOnePenny https://t.co/3QIY244WAr"]["Middle class families shouldn't pay #NotOnePenny more. I won't stand for #TaxReform proposals suggesting otherwise.\n\nhttps://t.co/8eBqDkqdm5"]["Let's be clear: there is no \"all sides\" to this issue. One side promoted racism, anti-Semitism &amp; violence -- the other side was fighting it. https://t.co/FiBlze2zpt"]["I'm glad @POTUS called the hatemongers in #Charlottesville what they are: white supremacists and racists. But troubled it took so long."]["@afronews ... I would like to think he also would be impressed by the range of voices standing up to the hate and bigotry - and the media spotlight"]["As we laud 125 yrs of @afronews I believe JohnMurphySr. would recognize the hate trespassing in #Charlottesville ... https://t.co/IJowIOj9Dm"]["Neo-Nazis, KKK, white supremacists &amp; the haters need to stop. You will not tear our country apart. What is good/just in America is stronger https://t.co/9iCl4KmJlS"]["Warm congrats to @AfroNews on their 125th anniversary! Thank you for 125 yrs of good journalism &amp; service to the African American community."][".@POTUS must condemn the hate-filled rhetoric, racist, anti-Semitic, misogynistic, homophobic and xenophobic actions from his supporters"]["The hate on display in #Charlottesville is horrific &amp; un-American. I am united w/all those who unambiguously condemn the bigotry &amp;violence"]["Thank you @FreedomHouseDC, @HumanRights1st and everyone who worked with us on this list of gross #HumanRights violators. Now @POTUS must act https://t.co/OiSSZcMRI6"]["The #GlobalMagnitskyAct gives @POTUS the tools necessary to ensure gross #HumanRights violations don't go unpunished.\n\nLet's use them. https://t.co/QS5hHLXyr6"]["Today @SenJohnMcCain and I wrote to @POTUS requesting that he use the #GlobalMagnitskyAct to hold human rights violators accountable. https://t.co/2BFHsAMADS"]["U.S. national security &amp; how we represent the American people overseas should not be the target of sarcasm or jokes https://t.co/pUttOv94bT"]["It shouldn't have to be said that we should be praising the American diplomats around the globe, not thanking Putin https://t.co/fZvmSimrYd"]["Projects like these are critical to improving public health &amp; access to clean water -- that's why we must continue robust federal funding. https://t.co/wVkEyGuevo"]["The new Back River Wastewater Plant will help rehabilitate #Baltimore's water, improve public health, create a cleaner Bay &amp; a cleaner city. https://t.co/9DlqnA7sYn"]["Celebrating the groundbreaking of the Back River Wastewater Treatment Plant - a huge step forward for cleaner, healthier water in #Baltimore https://t.co/xZkKmMvwpN"]["With Univ of MD Baltimore provost Bruce Jarrell this AM learning more about sleek, ambitious BioPark. @umbiopark @UMBaltimore https://t.co/AvvJZ1X9uM"][".@POTUS' comments re: #NorthKorea aren't helpful. Once again he's shown he lacks the temperament &amp; judgement to deal w/ this serious crisis."]["Grateful for the support of @ACLU, @OpenTheGov &amp; others as I work to increase transparency in #PrivatePrisons. \n\nNo more loopholes. https://t.co/vfsvfnnTFN"]["I've just introduced legislation to hold #PrivatePrisons to the same standards as federal ones. No more hiding behind loopholes in the law. https://t.co/Cakr5K3NRr"]["Here's the letter we sent Attorney General Sessions re: threats to withhold law enforcement funds from #Baltimore. Indefensible behavior. https://t.co/vcWMT8vjM2"]["Unconscionable @TheJusticeDept would threaten #Baltimore &amp; and not bear out every resource to fight violent crime.\n\nhttps://t.co/fsBLg4ZYjw"]["The #VotingRightsAct was a crowning achievement. But racism &amp; voter suppression didn't end with the stroke of a pen. We must keep fighting."]["I've been fighting for years to get Congress to reverse SCOTUS' 2013 decision overturning several key precedents set by the #VotingRightsAct https://t.co/2jl8R9yu4I"]["Today marks 52 years since the landmark #VotingRightsAct. Let today also serve as a reminder that those rights must be protected &amp; restored."]["Did Russia make a difference in the election –we may never know the full extent but we have to make sure it never happens again to us/allies"]["... Donald Trump is now president. Did Russia cast a ballot –no. Did Russia use its malicious intent to influence people who did –yes."]["The facts are that Russia attacked the U.S. with the intent of promoting the candidacy of Donald Trump. https://t.co/j1NPAuCKV7"]["So proud of the incredible, hard work @ChesChurch in Calvert County is doing to end hunger. These Marylanders are changing lives. https://t.co/r9gD6NBSmN"]["At College of Southern Maryland to discuss how we get #ABetterDeal for college students. Step 1: more accessible, affordable job training. https://t.co/FayzEzhc2i"]["Proud to be working w/ @CSMHeadlines to strike #ABetterDeal for college students. Focusing today on affordability &amp; access to trade programs https://t.co/EFA5TmIcDo"]["They weren't criminals. They were law-abiding, college-bound teenagers. How does this make America safer, @POTUS?\n\nhttps://t.co/zREgeGz14u"]["These young brothers came here as children, escaping violence in El Salvador. This is unconscionable. \n\nhttps://t.co/zREgeGhpFU"]["Pleased #RussianSanctionsBill is now law. It will help prevent @POTUS from striking a deal w/ Moscow that's not in the US's best interests. https://t.co/5SBfSECTAG"]["Profoundly frustrated with this process to secure @FBI a new HQ. There's zero reason for the quagmire we're in today https://t.co/fWwsXhWCoK"]["In 2011, @USGSA and @FBI came to Congress asking for help establishing a new FBI HQ. So we helped. What happened? https://t.co/fWwsXhWCoK"]["@gonnasetyoufree https://t.co/KLI3rjBJno"]["https://t.co/KLI3rjBJno"]["Problems w/the Hoover Bldg are well known. But @POTUS put ZERO dollars in his FY18 budget for @FBI HQ. @USGSA needs to restart project now"]["Join me LIVE for a candid discussion of what happened to plans for a new #FBI headquarters &amp; what must happen next: https://t.co/QbZucBWVgb"]["Tremendous frustration w/GSA cancellation of #FBI HQ project. They ignored Congress, wasted taxpayer dollars and threaten nat'l security"]["A quick but important read about the state of the @StateDept. This cannot continue.\n\nhttps://t.co/UVk56s1zEy"]["@AlexCruz365 https://t.co/8xQVe9kNox"]["@AltUSNavy https://t.co/8xQVe9kNox"]["... establishing positive relationships and open communication channels that last year-round and can foster lasting improvements."]["#NationalNightOut2017 brings together community members &amp; local law enforcement, giving them a rare opportunity to connect. Its goal is ..."]["Thank you to all the MDers taking part in #NationalNightOut2017.  You are part of the solution, helping to make our neighborhoods safer"]["This shortsighted plan could have created a monopolistic student loan system. Glad @usedgov is abandoning it.\n\nhttps://t.co/1DWfmQIn7m"]["Good. Now @BetsyDeVosED should start working w/ us to improve #StudentLoan servicing &amp; make repaying loans easier. \n\nhttps://t.co/1DWfmQZYvW"]["Americans need a reformed, modern #tax system. I'm ready to work w/ Republicans to achieve that. But these must be our starting principles: https://t.co/kuwHItONwv"]["Today I and @SenateDems sent a letter to @POTUS and @SenateMajLdr about the need to work together on #TaxReform: https://t.co/Us0pK0ZilR"]["Trading ideas on how to increase investments in transportation, education and opioid addiction treatment with Frederick County leaders. https://t.co/6Km1o12Br3"]["Listening to experts in Frederick this AM to find ways to make health care better and more affordable for Marylanders.  @FredrkMemorial https://t.co/AQOnSYcJui"]["Always been proud of my hometown. #Baltimore is a truly self-made, industrious city. I agree that's pretty cool.\n\nhttps://t.co/zrdINm8h1Q"]["I've introduced a bill to improve the #ACA, make coverage more affordable, lower Rx drug prices. Let's get to work: https://t.co/nVzj42Yu77"]["I am relieved good sense prevailed &amp; #ACARepeal failed. But now we must work together to improve it, to lower costs, to stabilize the market https://t.co/zkx4161O0e"]["Thank you for every phone call, every rally, every letter. The #ACA lives because of you. Families will keep their coverage because of you."]["This latest test also makes clear that @POTUS ’s approach to #NorthKorea is not working https://t.co/CRTpgAeFtM"]["Congress took action to impose additional sanctions on #NorthKorea that I expect @POTUS will now sign without delay https://t.co/CRTpgAeFtM"]["The US stands by our allies in Seoul and Tokyo, and there should be no question of our ironclad Alliance commitments https://t.co/CRTpgAeFtM"]["If we're staying in session, let's keep working. Let's debate new #healthcare solutions - transparently this time.\n\nhttps://t.co/rv2jIWdeA5"]["Now we must forget repeal and work to improve the #ACA. @SenateMajLdr wondered if we have any ideas. I have several: https://t.co/4XKsTakI89"]["Ultimately the #ACA survives because of you. Your calls, your rallies, your persistence. Let tonight be a reminder of what your voice can do https://t.co/h7wqMwHS50"]["For middle class families, Americans with preexisting conditions, Medicaid recipients &amp; more, I am relieved #ACA repeal failed tonight."]["On this, Mr. President, we agree. https://t.co/bvfG4eXgOt"]["To the Republicans saying they don't want the #SkinnyRepeal to actually become law: there's a simple way to ensure it doesn't. Vote no."]["To be clear: CBO says @SenateGOP's #SkinnyBill will cause premiums to rise 20%... every year. Not once - every single year. Through 2026. https://t.co/5ujSymvREy"]["Even the \"skinny bill\" cuts health insurance for 16M. Perhaps Rs are hearing the same thing over and over b/c the bill is still bad #DejaVu"]["Even the \"skinny bill\" cuts health insurance for 16M. Perhaps Rs are hearing the same thing over and over b/c the bills is still bad #DejaVu"][".@SenateGOP: You had years to develop an alternative to the ACA. #SkinnyRepeal is not a serious alternative.\n\nDo better. Lives depend on it. https://t.co/PbVaJEOX5J"]["The nonpartisan @USCBO says #SkinnyRepeal would cause premiums to skyrocket 20%\n\nHow is this more affordable or accessible, @SenateGOP? https://t.co/vdcR8oVE09"]["The operative word in #SkinnyRepeal is \"repeal\" - don't be fooled by the name. It would unravel the #ACA and lead to millions uninsured. https://t.co/te8bzNd1d9"]["Tonight @SenateGOP makes their big push to repeal the Affordable Care Act. Their likely strategy: #SkinnyRepeal\n\nhttps://t.co/JOO8aSwCvP"]["Incredible stories straight from the heart of Baltimore. Incredible filmmaking. Do.Not.Miss.This. #STEP https://t.co/xdHq2FtAg7"]["I'm speaking in the Senate about #healthcare right now - join me via the \"watch live proceedings\" link. #SaveACA \n\nhttps://t.co/mAYAZQlVlW"]["In a year in which it's been tough to get pro-environment bills moving, I'm glad there's strong bipartisan support for MD &amp; #ChesapeakeBay https://t.co/7VUlHva1ou"]["HELP for Wildlife pumps up @EPA's #ChesapeakeBay Program by reauthorizing it @ $90 million/year — more than the program has ever been funded https://t.co/TmfrXRDnao"]["The latest threat to the #ChesapeakeBay isn't from pollution, but @POTUS. The HELP for Wildlife Act fights back:\n\nhttps://t.co/jd6zaTbFn0"]["The thousands of transgender Americans serving in our #military are courage incarnate. They are patriots. And they deserve better than this. https://t.co/Tmr5NMgTZ0"]["@HappyArtsky @SRuhle @MSNBC No worries. We will not be distracted from stopping Republicans in their drive to rip health insurance coverage from millions of Americans"]["Serving in our military should be about the safety of our nation not excluding those who want to serve #transgender  @SRuhle"]["Repealing the ACA puts insurance companies back in charge of what should &amp; shouldn't be covered by #health insurance. Indefensible. #SaveACA https://t.co/20ewpYHFg3"]["Make no mistake: if @SenateGOP succeeds in erasing the ACA, families everywhere will be devastated - both physically &amp; financially. #SaveACA"]["Every Republican who voted to proceed to this phantom #healthcare bill has voted to disregard the health of millions who will lose coverage."]["Republicans who said they cared more about their constituents' health than politics have now voted blindly to rip #healthcare from millions. https://t.co/QYZjRLak5N"][".@SenateGOP's vote to begin the process of dismantling the #ACA - without even knowing what their bill will entail - is unconscionable. https://t.co/wH2L1vSlRc"]["Every single @SenateGOP #healthcare bill - every one - results in tens of millions losing coverage. Some of them nearly overnight. #SaveACA https://t.co/Kf132IM7sQ"][".@SenateGOP's plan, or what'll be in it, remains totally unclear. But they're moving forward anyway. Whatever the case, we know the result: https://t.co/dz1mQKP7Jq"]["In just a couple hours, @SenateGOP will bring forward a #healthcare vote to begin dismantling the #ACA. \n\nThis fight isn't over."]["\"We are fighting for the soul of America. And we must fight together for America's true values.\" @NAACP https://t.co/1Zcf0WpRI8"]["Proud to join @NAACP national convention panel of unwavering civil rights champions w/ @SenSanders @SenDuckworth @KamalaHarris @Bobby Scott https://t.co/o3Dk6vGyQZ"]["We will NOT go back to pre-ACA days of discriminating against people with preexisting conditions. We will not let @SenateGOP #RepealAndRun."]["Every GOP #HealthcareBill would cause premiums to skyrocket, but #RepealAndRun would be worst of all.\n\n@SenateGOP: this is not an option. https://t.co/dtklxFDffv"][".@SenateGOP's new repeal-only plan would leave 32 MILLION Americans without insurance - 17 million losing it almost overnight. #RepealAndRun https://t.co/XZ2k0xwM5V"]["The fight over #healthcare isn't over yet. @SenateGOP's new strategy is to #RepealAndRun - repeal the #ACA with no replacement plan at all."]["The Washington region has lost a good man. Rest In Peace, Jim. You will be missed. https://t.co/LUiYrmwLOp"]["An important read. #Russia #MagnitskyAct #HumanRights\n\nhttps://t.co/1LVynpwMcT"]["@natalie4health @ACLU https://t.co/u6vZXnNJ0r"]["@IndivisibleBalC https://t.co/u6vZXnNJ0r"]["Great day ahead talking #healthcare in @havredegrace, #infrastructure in #perryville, #ChesapeakeBay in #PortDeposit. #MDjobs #MDhealth https://t.co/kKm7CZ0tY2"]["Every GOP #HealthcareBill would cost tens of millions of Americans their insurance. But @SenateGOP's repeal &amp; run plan would be worst of all https://t.co/ev2Enjy1F4"]["The fight against @SenateGOP's #RepealObamacare efforts is not over. Now they're pushing to repeal and run, with no replacement plan at all."]["DACA participants have been here since they were kids &amp; deserve to live &amp; work freely. I won't stand for deportations - period. #DefendDACA"]["#DACA allows young people like Saba Nafees pursue higher education. What is the American dream, if not this? \n\nhttps://t.co/AMDgDQ8tuk"]["#DACA allows undocumented immigrants who came to the US as children to work &amp; attend college. With it under threat, we must be its defenders https://t.co/r9CtL0wvmB"]["Still thinking of my friend and colleague @SenJohnMcCain, wishing him a full and fast recovery. Look forward to having you back, John."]["Talking now w/clergy from across the country about the future of #healthcare in America @PNBCINC @Presbyterian @VPIc https://t.co/C4qDpVIp8G"]["Stop. This is dangerous. Lives are at stake, @SenateGOP. Take that seriously and work with us to improve the #ACA. \n\nhttps://t.co/IlvScZ4HsC"][".@SenateGOP's new strategy is to #RepealObamacare -- without any replacement plan.\n\nNo. Unacceptable. We will not upend Americans' coverage."]["For middle class families, Medicaid recipients, Americans w/ preexisting conditions, and many others - this comes as great news. #Trumpcare https://t.co/mb5ujUk3Vl"]["@Cajsa @RichardRubinDC Take a look for yourself. The core is making it at least as progressive as our current system https://t.co/Y4sdHmqw1b"]["The new version of #Trumpcare would devastate Americans w/ preexisting conditions.\n\nStop, @SenateGOP. Just stop. People's lives are at stake https://t.co/CqgvKUsong"][".@SenateGOP's new version of #Trumpcare still imposes caps on coverage &amp; makes #healthcare far less affordable for all - including seniors. https://t.co/Sa1bObpOao"]["The @SenateGOP's #Trumpcare bill can't be amended enough to reverse the severe damage it would do to the health &amp; wallets of millions. https://t.co/QGFUm2LQMd"][".@SenateGOP's #healthcare vote is delayed a week. @SenateMajLdr, how about using this time to hold public hearings? Since there's been none?"]["$2.8 billion in wages? That's worth protecting. Privatizing public lands would jeopardize natural resources &amp; local jobs #ProtectPublicLands https://t.co/YTuTIZAoIw"]["Public lands are a key contributor to local economies - including ours. They support 3,262 jobs in Maryland alone. #ProtectPublicLands https://t.co/3As1e4bqqg"]["As @Interior considers upending 25 natl monuments, let's remember: national parks aren't just beautiful. They're economic engines. https://t.co/O1eDIjwzJH"]["This is what @SenateGOP's original #HealthcareBill would've done. Amendments won't fix this mess. Start over. I'm ready to get to work. https://t.co/26pzbnEsqT"]["3) Every time I think @SenateGOP is hearing Americans' pleas and working to improve their plan, they release something worse than before."]["2) ...allows lifetime &amp; annual caps on coverage, and decimates #Medicaid - all things that'll make #healthcare more expensive &amp; inaccessible"]["1) This week @SenateGOP revealed a new version of their #Trumpcare plan. Abysmal. It still unravels protections for preexisting conditions"]["I haven't given up on our promise to #ActOnClimate, and neither should @POTUS. We owe future generations better. #ParisClimateAgreement https://t.co/dKxDWLmZwk"]["Urging @POTUS to reconsider withdrawing from #ParisClimateDeal. The world - &amp; 900 US businesses - hopes he listens: https://t.co/fGQeIVz9Rp"]["#Trumpcare can't be \"fixed\" w/ a few amendments. It's fundamentally about removing protections &amp; increasing costs, so it's fundamentally bad"]["There would be a human toll to @SenateGOP's #HealthcareBill. This is a fight for real people - people like this: https://t.co/RGENCJxk2h"]["...all while gutting Medicaid &amp; rolling back protections for women's health\n\nTime to face facts: this #HealthcareBill is fundamentally awful"][".@SenateGOP's \"new\" #HealthCare bill still lets states opt out of essential health benefits, institute annual &amp; lifetime caps on coverage..."]["Today @SenateGOP announced a revised version of their #HealthcareBill. Zero improvement. Still devastates Medicaid &amp; enrollee protections."]["#Water isn't political; it's a right. Water isn't partisan; it's life. We ignore that truth at our own peril.\n\nhttps://t.co/Lj54NHZSbn"]["Speaking live right now at a roundtable on #DrinkingWater &amp; and the critical need for better water infrastructure: https://t.co/Lj54NHZSbn"]["#NetNeutrality is CRITICAL to freedom of expression, equal access to information &amp; ability of small businesses to compete online w/ big ones https://t.co/jhwTgBdW0F"]["If broadband cos. get to control access to websites, they can control access to information, businesses, etc, in their favor. #NetNeutrality https://t.co/iak3h9bT9w"]["#NetNeutrality: the principle that internet content shouldn't be blocked or slowed down based off broadband companies' personal preferences. https://t.co/9b8Qexs4Vo"]["As the @FCC's decision on #NetNeutrality looms nearer, join me in telling them: stand up for a free, open internet - not broadband companies https://t.co/PDoMylhAVM"]["China must release Liu Xiaobo for medical treatment per intl #humanrights norms. No more excuses, no more delays. https://t.co/af4cTXAHUN"]["Instead of welcoming the #Russian government into their campaign, the Trump team should have immediately notified the @FBI. Period. https://t.co/uhNgfekzBc"]["This is extremely serious. Proof that @DonaldJTrumpJr clearly understood the intent of this meeting &amp; sought to work w/ a foreign adversary. https://t.co/uhNgfe2YcC"]["The Hoover Building is crumbling around the @FBI. Halting their new HQ puts our natl security at risk. Unfathomable. https://t.co/TG15HBkMlc"]["This was years in the making - only to be undone now by the @realDonaldTrump administration. Terrible. Wasteful. And unfair to @FBI workers. https://t.co/I12JMFjBFU"]["At the Capitol now talking about #FBI headquarters w/@ChrisVanHollen @RepAnthonyBrown @CountyExecBaker Disappointing https://t.co/7fBwVjOLCv"]["At the Capitol now talking about #FBI headquarters w/@ChrisVanHollen @RepAnthonyBrown @CountyExecBaker Sisappointing https://t.co/tgaoH9EbIo"]["Further, a healthy Bay = a healthy economy for MD. Less pollution means more oysters and crabs, healthier farmland, more tourism, more jobs. https://t.co/iM6dem5T0R"]["Proud the HELP for Wildlife Act has bipartisan support, because water is not political &amp; all Americans have a right to a healthy environment"]["Proud to announce I'm cosponsoring the HELP for Wildlife Act, which would reauthorize key enviro programs like @EPA's #ChesapeakeBay Program https://t.co/YVim50EaXu"]["@POTUS .@potus’s words and potential actions place our country in jeopardy. there is no logical reason he would reward or appease Mr. Putin."]["@POTUS ... and pours cold water on the sanctions package Congress is working to send him."]["Now @potus wants to work with Russia on cyber defense, takes Putin’s lie that he did not interfere in our election at face value ..."]["... They hacked our democratic institutions, spread lies through the media, and financed efforts to support the Trump campaign."]["Russia did not just meddle in our election - it engaged in a sophisticated attack equivalent to a political Pearl Harbor ..."]["https://t.co/UPKGHPl1ZD"]["Republican #healthcare plans discriminate against our seniors. That's wrong and we aren't going to let that happen. https://t.co/kOKcUbq2HF"]["Maryland's seniors agree: we need to work together to lower costs &amp;affirm essential benefits. thank you #AtriumVillage for your hospitality https://t.co/a2YPmozaJU"]["@MelissaJPeltier @POTUS i've been clear that Russia attacked us and that attack should have consequences"]["To be clear: confronting #Russia about their meddling in our election is about looking forward so they don't do it again to us or our allies"]["The only way that Russia is going to change is when we show that there will be consequences for their actions. @SRuhle"]["We know Russia was behind the meddling in our elections. If @POTUS doesn't bring this up w/Putin, it's a signal that Russia can do it again"]["What's more, #Trumpcare would increase MD's uninsured rate by a whopping 128%. Shameful. Does this even qualify as a \"healthcare\" bill? https://t.co/KKKyZl1om4"]["According to the Congressional Budget Office, this is what @SenateGOP's #HealthcareBill would do. Devastating. Families can't afford this. https://t.co/YdGgEclMGN"]["Though Congress is in recess this week, @SenateGOP is still working hard to pass #Trumpcare. A delayed vote does not mean a defeated vote. https://t.co/lue2fhsGOb"]["Happy to be part of #TheWordsThatBuiltAmerica this #IndependenceDay. We'll be reading our nation's most iconic documents tonight @ 7 on @HBO"]["241 years after we declared independence - though we've faced many challenges - America remains a beacon of liberty &amp; hope. Happy #4thofJuly https://t.co/5rF3t0C285"]["https://t.co/swg13UBsoy"]["Rethink repeal of the #CleanWaterRule, @POTUS. It would help no one but polluters. Protect Americans' right to clean drinking water instead."]["The #CleanWaterRule also protects the streams that run into the Chesapeake Bay. Without it, the Bay's health - and our own - will suffer. https://t.co/8VsJXbq6aT"]["1 in 3 Americans get their drinking water from sources that are protected by the #CleanWaterRule. If @POTUS repeals, he could harm millions. https://t.co/OxjpYeYgpL"]["This week @POTUS announced plans to repeal the #CleanWaterRule - helping no one but corporate polluters. This is dangerous and shortsighted. https://t.co/ZkO1XEFx6D"]["Wishing a happy #CanadaDay to our good neighbors up north. Proud to have you as one of our closest friends and allies. #Canada150"]["@ReneePie they should be yes. sometimes some of us need reminders or milestones to get us back on track"]["Independence Day is an opportunity to display pride &amp; treat our fellow Americans as we would like to be treated, w/dignity &amp; liberty for all"]["Thank you. Bipartisan support for greater protection for our fish and birds is a significant victory for the #chesapeakebay. https://t.co/JNd35BmOxs"]["Terrible decision to arrest these activists, especially before Xi's 1st visit to #HongKong. China really earning that TIP Tier 3 downgrade. https://t.co/EWBDTJqJ0l"]["Trump must focus on issues, not insults. Do insults help Americans afford #healthcare? Find jobs? Save for retirement? No. #unpresidential"][".@realDonaldTrump's tweets about Mika Brzezinski are reproachful, sexist &amp; show he doesn't understand what it means to have free, open press"]["The #Chesapeake Gateways &amp; Watertrails program boosts tourism and promotes conservation. That's worth preserving. https://t.co/wVKhnIVOGR"]["The #ChesapeakeBay is the economic &amp; cultural heart of MD. Let's protect it and keep it accessible for everyone: https://t.co/wVKhnIVOGR"]["Live w/#SaveMedicaid from the #uscapitol now ...  https://t.co/3pSFuW1CDJ"]["Trump's plan to repeal the #CleanWaterRule risks making things worse for communities already lacking access to #drinkingwater. So misguided."]["Myth: The #CleanWaterRule protects \"puddles &amp; ditches\"\n\nFact: It protects drinking water sources &amp; 60% of streams:\n\nhttps://t.co/93Prs6GVZq"]["#CleanWaterRule protects drinking water sources of 1 in 3 Americans. What could be more basic than that? How does repeal help anyone @POTUS? https://t.co/qPdyF8ZtZz"]["Today @POTUS announced he intends to gut the Clean Water Act, handing yet another gift to big corporations and polluters. #DefendWater https://t.co/JbxrvwuCtI"]["This is welcome news. But delay doesn't mean defeat. @SenateGOP seems determined to repeal the ACA, so we must stay determined to stop them. https://t.co/17mJOtjPSo"]["This fight to stop #Trumpcare isn't about saving some obscure govt program. It's about saving people. Families. Neighbors. Americans."]["These pictures are of Americans who wouldn't have #healthcare under @SenateGOP's plan. Each one represents millions more. https://t.co/d4ajhgkkys"]["Standing firm with @SenateDems against #Trumpcare. I want @SenateGOP to see the faces of the Americans who would be devastated by their bill https://t.co/nBJGw6krlS"]["Warm congratulations to Patricia Pringle &amp; Eric Rimel, truly inspiring #JeffersonAwards winners. Thank you for your work to better #Maryland https://t.co/EOfHaeXmUe"][".@SenateGOP calls this the \"Better Care\" Act.\n\n\"Better\" doesn't leave 22 million people uninsured. It's not better; it's shameful. #CBOSCORE https://t.co/FDa43Ii7EA"]["In less than a week, I've received 2,034 phone calls opposing the Senate #Trumpcare bill. \n\n@SenateGOP: care to share your call numbers?"]["#Healthcare should not be a privilege for the wealthy few. But #Trumpcare prices out everyone else. It's a shameful excuse of a bill. https://t.co/RRd4PgvEKT"]["Spoiler: with nearly $1 trillion in tax breaks, the exceptionally wealthy win.\n\nEveryone else loses. #Trumpcare \n\nhttps://t.co/QLYHuisPni"]["Before @SenateGOP tries to ram through their #HealthcareBill (with no hearings), make sure you know what's at stake: https://t.co/QLYHuisPni"]["Another talented young Marylander making us proud. Congratulations Josh! #NBADraft https://t.co/VisGzsrcUr"]["@CoachforPOTUS @baltsun Here are some facts/comparison between plans. weaker coverage in exchange for tax cuts for the wealthiest. https://t.co/DWfINs8iIu"]["@ed4256 @baltsun The \"old one\" referenced here is the House bill, not the Affordable Care Act."][".@BaltSun: This new bill is almost exactly the same as the old one... same devastating consequences #HealthcareBill https://t.co/LYYi4FVIr2"]["Let's call it what it is, @SenateGOP: your #HealthcareBill is a tax cut for the wealthiest at the expense working class families. https://t.co/u14YLpcJTo"]["Glad to be at @MedStarFranklin to discuss how @SenateGOP's #HealthcareBill would impact MD. We must all be loud &amp; firm in our opposition. https://t.co/5n9I9flb7j"]["This #PrideMonth, I'm proud to sponsor this bill to recognize - and begin setting right - the wrongs of our past.\n\nhttps://t.co/f31sd2Tmu9"]["There is a lot to grapple with these days. But that doesn't mean we can forget our values, or our friends &amp; fellow Americans. #LavenderScare https://t.co/oqSxMNk08a"]["The Lavender Scare is a painful but little-known chapter in American history. It's past time we make amends. #LGBTQ\n\nhttps://t.co/8ZJFhoZn2y"]["Reality: @SenateGOP's #HealthcareBill is bad. Plain and simple. Bad for seniors, bad for women, bad for the sick, bad for the middle class. https://t.co/d3Fgdfpgtr"]["How can this pass as #healthcare? @SenateGOP: You had 8 years to craft something better than the ACA - is this really the best you could do? https://t.co/oyJHuwJPs2"]["@4thGear1 @Reporterroblang @wbaltv11 Lynn, under the Affordable Care Act, members of Congress and staff are eligible for coverage thru the DC Exchange set up under the ACA"]["Well, @SenateGOP finally showed us their #HealthcareBill. Put bluntly: today marks a shameful day in the US Senate.\nhttps://t.co/ujy5K0Iyll"]["Live now on the Senate floor responding to the so-called discussion draft of the Senate Republicans #HealthcareBill"]["We're suing the President because we have no other choice. If he won't disclose dealings w/ foreign states, courts must hold him accountable https://t.co/7GH1KKwrTc"]["The Founding Fathers wrote the Foreign #Emoluments Clause for a reason: Presidents must serve our interests, not theirs. #NoOneAboveTheLaw https://t.co/RWHObu5Ay1"]["I've pushed legislation to compel @POTUS to abide by the #EmolumentsClause of the Constitution, to no avail. So today, we're taking action. https://t.co/K7zt2DjhwF"]["This #WorldRefugeesDay, let's commit to fighting @POTUS' 44% budget cut for humanitarian aid. Let's commit to fighting baseless fears."]["Refugees are powerful ambassadors of the American Dream. They are mothers &amp; fathers, like us. They are children, like ours. #WorldRefugeeDay"]["FACT: 1 in every 113 people worldwide is a refugee. That's horrifying. That should inspire action - not fear &amp; hate\n\nhttps://t.co/yUAeugIifl"]["Fear helps no one. Facts do. \n\nFACT: Half of all refugees are children. \n\nI stand with them. I stand #WithRefugees \n\nhttps://t.co/yUAeugIifl"]["With over 65 million displaced people worldwide, there are more refugees than there are people in the UK.\n\nWe MUST do more. #WorldRefugeeDay https://t.co/WHTuV0IRv3"]["Release the bill.\nRead the bill.\nDebate the bill.\nVote on the bill.\n\nIt should be that simple.\n\nDo you agree @SenateGOP must #ShowUsTheBill?"]["There is no comparison: look how much time we spent openly, publicly debating the #ACA in 2009 v. what @SenateMajLdr is giving you now: https://t.co/20aBS1uL9I"]["Answer me one question, @SenateGOP: Do Americans have a right to know what their legislators are doing? Yes or no? #Trumpcare #ShowUsTheBill"]["Senate Republicans still won't tell us - or you - what they're planning for #healthcare next week. But it seems it will be devastating. https://t.co/byWblwKC4C"]["Republicans saying a vote on their #healthcare bill could come next Thursday.\n\nWHAT bill? Where is it, @SenateGOP?\n\nhttps://t.co/6VyLOVlRMF"]["Progress must be fuel for more progress. This #Juneteeth, I recommit to tackling criminal justice reform, racial profiling &amp; bigotry head-on"]["Happy #Juneteenth, everyone. 152 years ago today, slavery legally ended in the United States. Yet our duty to equality and justice goes on."]["My deepest condolences to family &amp; friends of MD's own Xavier Alec Martin, and to the families of all these brave sailors. This is tragic. https://t.co/gm5hh8Qkdo"]["Glad to be with Dr. Charlene Dukes and all of @pgccnews to discuss college affordability and the implications of @POTUS' #education policies https://t.co/fwhCSzfHk1"]["Completely unacceptable. This is an unprecedented lack of transparency. We must demand answers. #NoHearingNoVote  https://t.co/F8hwlPZWvs"]["#ShowUsTheBill https://t.co/O4cDEGcaGj"]["I've found there is no greater joy than being a father. To all those lucky enough to be a dad - wishing you a happy &amp; relaxing #FathersDay!"]["Excellent news https://t.co/gQ4C7mkrUL"]["Baltimore Pride 'Unleashed,’ aims to ‘work boldly and live freely.’ No better mantra for civil rights @GLCCBPride https://t.co/DKyt4sUmTW"]["Everyone at Baltimore #Pride: you are a master class in resilience, and today you're a beacon of hope and dignity for so many. Thank you. https://t.co/wcKz589KZA"]["Happy #Pride, Baltimore. Your continued courage is inspiring. So proud to be your senator. I will fight to protect the progress you've made. https://t.co/ZE2dtYfvmJ"]["Nominating bright young people to our nation's #military academies is one of the best parts of this job. A joy meeting with them this week. https://t.co/FuCMLtK7uM"]["A real pleasure meeting with my noms to the Naval, Military, Air Force &amp; Merchant Marine Academies this week. Proud of these future leaders. https://t.co/vfLJglI5u3"][".@DiscoveryComm staff serving up BBQ for service members at USO Warrior &amp; Family Center in Bethesda. Much-deserved - thank you. #OurImpact https://t.co/KYhIMY4vAz"]["Wow. 523 volunteers from Discovery are working at 23 community service sites across #Maryland today. Way to give back, @DiscoveryComm! https://t.co/KMbxSXqzYE"]["Let's improve the system we have - not repeal it. Let's also be transparent, @SenateGOP. Marylanders deserve to know what you're planning."]["In Westminster with local #healthcare leaders, discussing what repealing the Affordable Care Act would mean for Carroll County. #SaveTheACA https://t.co/c2ukIWajWj"]["Once again, our system of checks &amp; balances proves invaluable. This is huge. Congratulations to @StandingRockST. I'll keep standing w/ you. https://t.co/kwJpZOicLL"]["#Students deserve a Secretary of Education who'll fight for their interests - not in support of deceptive &amp; predatory for-profit colleges. https://t.co/tXmc9ECCbB"][".@BetsyDeVosED: #students defrauded by for-profit schools just want a shot to earn a valid degree w/o being shackled by bad debt. Help them. https://t.co/iMpBpQv8Jv"]["No student should be forced to pay back tens of thousands in #StudentLoans for a fraudulent education. This is wrong, @BetsyDeVosED. https://t.co/haUYnFwYiY"]["The way #healthcare policies impact minority communities needs to be part of our conversation. #HealthDisparities are real, &amp; a real problem https://t.co/xjJOgb1vRY"]["Republicans' #AHCA bill would gut #Medicaid by $800 BILLION. 14 million Americans would lose access.\n\nConsider that. Then consider this: https://t.co/DzY6jiST7Z"]["The GOP's #Trumpcare plan is devastating - for everyone. But minority communities would be hit especially hard. #CloseTheGap #SaveTheACA https://t.co/nZhNioZCO1"]["The @SenateGOP is allowing NONE of these things. There's a deliberate lack of transparency - the goal being to blindside us all. #SaveTheACA"]["Lots of criticism on how the #ACA was passed.\n\nBut we held hearings. We showed the public. And the GOP was able to offer 100s of amendments."]["Calling on @SenateGOP to #ShowUsTheBill.\n\nIf you're proud of the work you're doing on #healthcare, why won't you tell us WHAT you're doing?"]["Where is this #healthcare bill, @SenateGOP? This impacts every American and 1/6 of our economy - don't you think we have a right to see it?"]["Speaking now on the Senate floor about #healthcare. Watch here by clicking \"watch live floor proceedings\": https://t.co/mAYAZQlVlW"]["Friends, in a few minutes, I'll be speaking on the floor of the Senate about @SenateGOP's secret #healthcare plans:\n\nhttps://t.co/mAYAZQlVlW"]["Such tragedy today. My prayers are with the victims and their families right now - and with all of San Francisco. This is truly senseless. https://t.co/AFT7v21e2O"]["Looking forward to House passage &amp; @POTUS' signature. We're overdue on this response to the Kremlin's aggression &amp; assault on our democracy. https://t.co/QV5NQ5xUUY"]["#Russia's role in Syria, violence in Ukraine, and attack on U.S. democracy will not go unanswered by Congress."]["Proud to have led this effort &amp; prouder still the vote was bipartisan. This is an important signal to #Moscow that actions have consequences https://t.co/NXfuLYn7ix"]["Very pleased my #Russia sanctions amendment just passed 97-2. Thanks to @MikeCrapo @SenSherrodBrown &amp; @SenBobCorker for working w/ me on it. https://t.co/NXfuLYn7ix"]["#Baltimore lost one of its own this week. Sgt Eric Houck was a loving dad &amp; an exemplary soldier. He made MD proud.\nhttps://t.co/uOawNxoFJm"]["@POTUS Bottom line: by @realDonaldTrump's own admission, he fired #Comey over the #Russia investigation. That demands serious, continued scrutiny."]["@POTUS And why was #JeffSessions so incredibly selective in what info he'd share &amp; questions he'd answer? Without even explaining why? Frustrating."]["@POTUS Frustrating that #JeffSessions refused to answer so many questions though."]["@POTUS But why wasn't that request honored? Why didn't Sessions try to protect the FBI from Trump's inappropriate prying into their investigations?"]["Glad #JeffSessions testified today. Transparency is critical. And he corroborated the story that Comey asked not to be left alone w/ @POTUS."]["Restricting press from asking questions? How else will we learn what's in @SenateGOP’s #healthcare bill? They're certainly not telling us. https://t.co/FmoBgdSP4Z"]["If @SenateGOP restricts free press on the Hill, they'll be admitting they're afraid of Americans learning what's in their #healthcare bill. https://t.co/SfIonmtUz4"]["One year after #PulseNightclub, we remember the 49 angels taken. Hate invaded their sanctuary but it cannot win https://t.co/W5PFBINPHs"]["@Alyssa_Milano @ChrisVanHollen Before the #ACA 10s of millions w/preexisting conditions struggled to get insurance. We cannot go backwards. Too many lives are at risk"]["Back in Ellicott City meeting w/ #smallbusiness owners about their ongoing recovery. So inspiring. I'll keep using every tool to assist them https://t.co/mORygHjOKw"]["#EqualityMarch: I know these are discouraging times. But you, today, give us all hope. I support you, and I'll fight beside you. #PrideMonth https://t.co/9X3Btr1POT"]["The LGBT community's only \"agenda\" is #equality &amp; dignity, for all. If we fail to support them, we fail to support core American values. https://t.co/Xwg1iXyi8U"]["Inspired by all those at the #EqualityMarch today. Such resilience in the face of a difficult &amp; discouraging political environment. #Pride"]["Love is love is love is love. #PrideMonth"]["Wishing @CapitalPrideDC a happy, freeing #PrideParade today. I'm proud of your continued courage &amp; I WILL defend the progress you've made. https://t.co/pR5vfoKems"]["This figure alone should be enough to reject #Trumpcare.\n\n23. Million.\n\nThis is dangerous. This cannot pass as #healthcare in this country. https://t.co/0lJtckXkhV"]["Yes, you're seeing that right: 800%\n\nYes, that figure comes directly from the nonpartisan @USCBO, who scores all legislation. #Trumpcare https://t.co/DAXCLDtId4"]["@SenateMajLdr This tactic by @SenateMajLdr to repeal #ACA &amp; ram through the House's #Trumpcare bill is awful. Designed to offer zero transparency."]["With all that happened this week, we can't forget: @SenateGOP is still working to repeal the #ACA.\n\nTheir replacement \"plan\"? Dangerous. https://t.co/fCmPDMcxdJ"]["Friends, @SenateMajLdr McConnell has invoked rules to bypass hearings &amp; debate on #Trumpcare hoping to blindside the country into a bad bill"]["If you agree seismic probing for #oil off MD's coast is dangerous &amp; unnecessary, tell @NOAA. My site shows you how: https://t.co/1eNyXtj3Xl"]["We're already the #1 oil producer in the world. We don't need probing for more off MD coast; risks far outweigh any small, potential benefit"]["Seismic activity is known to disturb critical wildlife &amp; is the first step toward #offshore drilling in the Atlantic. We MUST speak out."]["Friends, right now, @NOAA is considering permits that would allow oil companies to conduct seismic probing for oil off MD's coast. https://t.co/MSwGcs04IN"]["Full stop. #ComeyHearings https://t.co/8Z7o8LPZ5U"]["I hope my colleagues who've yet to cosponsor my legislation to create an #IndependentCommission were paying attention to the #ComeyHearings: https://t.co/UnoLkBJWah"]["It's time for @SenateGOP to acknowledge publicly how dangerous the president's actions have been to American rule of law. #ComeyHearings https://t.co/t7TLJS3SD1"]["Today, James Comey shared with us disturbing details of his interactions with @realDonaldTrump. \n\nIt's time for an #IndependentCommission. https://t.co/HVPqAU0Jha"]["The injuries and loss of life from the #Tehran terrorist attack today is tragic and horrifying."]["Why #ActOnClimate? Because it's not political. It's science. And because it will act on us, whether we choose to respond or not."]["A report on the dangers #ClimateChange poses to natl security.\n\nThis is our own @DeptofDefense. This is irrefutable. https://t.co/6Ou6pHnPtM"]["We all claim to respect our armed forces &amp; intelligence officers.\n\nMaybe it's time we listen to them. #ActOnClimate\n\nhttps://t.co/smYvC9gqdL"]["#ClimateChange is not up for debate. Whether we will act responsibly is.\n\nKudos to @MayorPugh50 and @kevinkamenetz for setting the example. https://t.co/MhlWb9hGiy"]["These global human rights defenders and anti-corruption crusaders save lives &amp; inspire many more. Honored to be with them at #DemAwards https://t.co/6KnZyRhhA7"]["Building this playlist of #ClimateChangeMusic, I'm more grateful than ever for the new US Climate Alliance. https://t.co/jwc5L7Zs7F https://t.co/Weuj9ydkWs"]["Dry Me a River #ClimateChangeMusic"]["Yesterday (When We Believed Science) #ClimateChangeMusic"]["Bridge Under Flooded Water #ClimateChangeMusic"]["We'll All Have to Live in a Yellow Submarine #ClimateChangeMusic"]["#RIP @BabatundeUNFPA, crusader for women &amp; girls' health. The intl community will continue to fight for their equality &amp; rights in your name https://t.co/hlYFyvc33v"]["Deeply grateful and proud @MayorPugh50 &amp; @BrianFrosh have pledged to uphold the #ParisClimateAccord. MD is still in.\nhttps://t.co/jvjx4rvlgv https://t.co/fBVD5XxdqG"]["Congratulations, Virginia. \n\nWho's next? \n\n#WeAreStillIn #ParisClimateAgreement https://t.co/vsZIQZ3vh8"]["Re: #ParisAccord, @POTUS may change America's intl agreements. But he can't change Americans' commitment to facts. https://t.co/jpdM7qhz9u"]["This is what leadership looks like. If @POTUS won't act responsibly on #ClimateChange, our cities and states will.\n\nhttps://t.co/X3TAEIDM5t"]["@JulieBursic There are over 500 positions that require Senate confirmation -- 442 have no nominees yet https://t.co/e75KYIk0lS"]["#FakeNews. Your lack of nominations is the problem. There are only 5 political ambassadors pending. All in process. 1 ready for a floor vote https://t.co/ppakz86VmK"]["Our LGBT friends seek only equality &amp; dignity, for all. And what could be more American than building a more perfect union? #Pride2017 https://t.co/yAckAU5Tsm"]["The LGBT community has made huge strides in righting past wrongs. We've come too far to turn back. For #Pride2017, I vow to protect progress https://t.co/AYB6o1P3ZU"]["I stand w/human rights and democracy activists in China and worldwide to remember #TiananmenMassacre https://t.co/ACV16X54wc"]["I'm praying for the injured and families of those killed in tragic #LondonBridge attacks. We stand with and support our ally and friend 🇺🇸🇬🇧"]["Special counsel will investigate criminal activity but #S27 creates a commission to report on ALL facts/foreign interference. #MarchForTruth https://t.co/vaC0Z2klbP"]["This is what democracy looks like. #MarchForTruth https://t.co/I7ysbxQWk6"]["I'm with you, #MarchForTruth. I've introduced a bill to establish an independent commission on Trump/Russia &amp; I intend to fight for it. #S27 https://t.co/PJV4YT1ZDb"]["I agree with @marcorubio, @SenJohnMcCain and @LindseyGrahamSC. This is an alarming step backward for #Egypt.\n\nhttps://t.co/MlUuw9KyLA"]["Background checks should be mandatory whether buying guns from a local shop, a show, or the internet. That's just #CommonSense.\n\n#WearOrange"]["Every single day, more than 90 Americans are killed by guns. I know we can't prevent every tragedy. But we CAN save many lives. #WearOrange"]["Proud to #WearOrange in honor of Gun Violence Prevention Day, and in loving support of all the victims of this senseless, tragic epidemic. https://t.co/g1OBE8DQMc"]["Deeply troubled @POTUS would even consider returning MD compound to the #Russian govt that attacked our democracy.\n\nhttps://t.co/Or5enrWyKP"]["Unacceptable, @POTUS.\n\nI'm exploring legislative solutions to mitigate the damage done today &amp; ensure the US remains a #ClimateChange leader https://t.co/kX6BHY9Aif"]["Moreover, the American people must be exasperated. \n\nThe vast majority - including Trump voters - wanted to stay in the #ParisClimateAccords https://t.co/Y3Vxpdv7zj"]["The world must be exasperated and disappointed in our country today. #ParisClimateAgreement https://t.co/td2LrBJvVs"]["This #ParisClimateAccord decision is not based in science, economics, diplomacy or basic facts. It's transparently political. And dangerous."]["Baffling.\n\nThis is 1 of the most shockingly irresponsible policy moves in recent memory. @POTUS just abdicated US credibility. #ParisAccord https://t.co/kX6BHY9Aif"]["@IndivisibleMCMD @POTUS So am I."]["This assault on fed workers must end. These are #veterans. Health professionals. Civil servants. We owe them better. https://t.co/UKh34LovyS"]["We're talking about current retirees - people in their 60s+ - who can't go back to work to make ends meet. How does this make America great? https://t.co/nq9T7Ffrze"]["Trump's #budget would end annual cost-of-living adjustments for people in the Federal Retirement System— including for current retirees. https://t.co/3TT5YsIKue"]["Federal workers - 30% are veterans - work hard to improve our #economy, our health, our lives. Let's not punish them.https://t.co/UKh34L6UHk"]["This would be a devastating abdication of US leadership. And a material threat to our economy, our health, our credibility. #ParisAgreement https://t.co/fnTiSUvYwC"]["This is a chance to step up, @POTUS. To maintain our nation's credibility - with our allies most of all. Don't abandon the #ParisAgreement. https://t.co/GI8Ad1FKJ5"]["I implore you: do what is best for the health and economic interests of the American people. Do what is right. #ParisAgreement https://t.co/GI8Ad1FKJ5"]["A good, important read on why we can't give up on the #ChesapeakeBay's oysters - and how we can fight their decline:\nhttps://t.co/qNImfMOPRT"]["Absolutely. Big win for the Seagulls on Sunday - congrats @SalisburyU! What an incredibly talented team. https://t.co/VvI4lK0dSn"]["UMD Women lead the way. Men's lax delivers. https://t.co/ulFrXfxJub"]["Let's honor our heroes w/ something greater than engraved statues. Let's be living monuments to the ideals for which they died. #MemorialDay https://t.co/PHmZOsNHqe"]["We are here – free to worship, live &amp; speak according to our own consciences – because of those who saw fire &amp; ran toward it. #MemorialDay https://t.co/pjmJkA8Sg9"]["Remembering the fallen today with a pledge to #GoSilent this afternoon. Will you join too? https://t.co/CW2RZUnuVt"]["Wishing everyone a happy, peaceful #MemorialDay.\n\nAmidst our cookouts &amp; gatherings, let's not forget the gravity of what this day signifies. https://t.co/PlEyetFToc"]["Congratulations Terps! Women's Lax are champs again. https://t.co/8NEj7QUVX8"]["#TrumpCare would be an unmitigated disaster by every measure - just ask the @USCBO. \n\nWe are the United States. This is unacceptable. https://t.co/LGn2nZf25X"]["This is straight from @USCBO\n\nRepublicans had 7 years to come up with a better #healthcare plan than the #ACA. Is this the best they've got? https://t.co/Pfx53C5Thy"]["This alone is reason to reject #TrumpCare.\n\nYes, #healthcare needs fixing. But this isn't a fix. It's an insult.\n\nhttps://t.co/5pTeMGZyPh"]["I'm hoping for UMD vs Navy for an all-Maryland final! https://t.co/UXTD60K1RF"]["If we raised the minimum wage to $15 by 2024, we'd raise wages for the parents of 19 million children. Just 1 reason I want to #RaiseTheWage"]["It isn't just young college students working for #minimumwage. It's families. And parents working full-time should not be living in poverty. https://t.co/X65IzSmWBh"]["#RaiseTheWage b/c America is built on the belief that a fair day's work deserves a fair day's pay &amp; #minimumwage hasn't changed since 2009."]["I'm proud to be supporting the #RaiseTheWage Act - which would raise minimum wage to $15 by 2024 - because our workers deserve fair pay. https://t.co/Njy4q24qmL"]["I wonder if he has shared that wisdom with @POTUS ? https://t.co/MfdPqIUcnf"]["Today's 4th Circuit Court ruling signals it is past time for @POTUS to rescind his discriminatory EO targeting Muslim #refugees &amp; travelers. https://t.co/n9qDxIilmt"]["The 4th Circuit Court rightly noted that, in context, Trump's #immigration order \"drips with religious intolerance, animus &amp; discrimination\" https://t.co/ZyG11xDOww"][".@USCBO's official review of #TrumpCare: 23 million people would lose #healthcare.\n\n23. Million.\n\nDoes this not concern you, @SenateGOP? https://t.co/1Tf2KjVD2r"]["#TrumpCare would be an unmitigated disaster. In MD 181,200 would lose their private coverage. Premiums would increase $742 in just 1 year. https://t.co/rexjhkC4VI"]["The @USCBO is strictly nonpartisan. Both parties have relied on its analysis for generations. \n\nTheir analysis of #TrumpCare: devastating. https://t.co/UKMpE9j1B4"]["23 million more uninsured, says #CBOscore. #Trumpcare is a disaster that puts people's lives at risk while exploding 1/6th of our economy"]["As the GOP continues to push #TrumpCare, remember: everyone gets sick or injured at some point. You shouldn't be uninsurable because of it. https://t.co/HHKBePjUzf"]["#TrumpCare would allow insurance companies to decide what is &amp; isn't covered - including prescriptions. How is that a step forward, @POTUS?"]["Nearly 608,000 Marylanders aged 55-64 have a #PreexistingCondition. \n\nThat's at least 608,000 reasons in my state alone to reject #TrumpCare https://t.co/q3AQ6krskD"]["Here's a fact: 52 million adults under age 65 have a pre-existing condition.\n\nAnother fact: they would all be uninsurable under #TrumpCare. https://t.co/LM93SYaBmM"]["This #TrumpBudget should be considered dead on arrival. Fortunately, our founders developed a system of checks &amp; balances to ensure it is. https://t.co/xEo5lRwH87"]["This #TrumpBudget slashes #healthcare, yet has no problem wasting money on a new border wall that simply won't make us any safer or freer. https://t.co/Twq3Xx27hn"]["This #TrumpBudget slashes critical investments in our #healthcare, infrastructure, homeowner programs &amp; environment.\n\nIt's dead on arrival. https://t.co/ELtw7F6mHp"]["A #budget is supposed to reflect @POTUS' priorities &amp; our country's deepest values. This #TrumpBudget just reflects how out of touch he is."]["Proud that @michelesgranola is #MadeInMD. Powered by clean energy &amp; a commitment to giving back to the community, they rep the best of MD. https://t.co/AP5KrjIsYu"]["Michele from @michelesgranola is one of #Baltimore County's brightest business minds. She's proven you can be both successful and giving. https://t.co/SWD0chgEuh"]["On Friday I had the pleasure of visiting @michelesgranola in Timonium - a truly inspiring, socially conscious &amp; growing business. #MadeInMD https://t.co/mpMi8nN07j"]["Profoundly tragic. I welcome the federal role in this investigation and stand with @BowieState as justice is sought for this heinous crime. https://t.co/WhOPXX2NA3"]["#CelebrateMaryland https://t.co/vLIaR334oC"]["@PreaknessStakes What a race! No #TRIPLECROWN this year but a great win for #Baltimore #CloudComputing"]["https://t.co/kZFpGvxOCn"]["Watching Preakness before throwing out the first pitch at the O's game w @ChrisVanHollen. Most. Maryland. Moment. Ever. #CelebrateMaryland"]["All eyes on #Baltimore for the @PreaknessStakes"]["Crowds lined up at a sold-out Oriole Park at Camden Yards for #CelebrateMaryland day. Getting ready to throw first pitch w @ChrisVanHollen! https://t.co/ehWLljZDbg"]["Before celebrating @PreaknessStakes &amp; #MarylandDay w/ @Orioles celebrate the men and women of our #ArmedForces for their sacrifice &amp; courage"]["Using American families' #healthcare as a political bargaining chip is just wrong. Plain &amp; simple. GOP should work w/ us to improve the #ACA https://t.co/tVVa24XS0i"]["We cannot play politics with Americans' #healthcare. Period. This is a dangerous, irresponsible move by @POTUS. https://t.co/LMtGEPo5Wp"]["Trump wants to sabotage the #ACA rather than work with @SenateDems to fix it. American families will pay the price. https://t.co/EEIxLMQCOH"]["@IndivisibleMCMD @ChrisVanHollen That's the plan!"]["@JohnLeguizamo The Special Counsel will continue a criminal probe but there still needs to be a public accounting of Russia's actions during the election"]["We will not lose track of Republican efforts to sabotage America’s health care system. We will fight it every step https://t.co/Jzi2UCtOWc"]["We should be helping seniors receive services necessary to resume their normal lives, not erecting road blocks to recovery. https://t.co/MdXJTvPSjy"]["#NetNeutrality is about equal access to the web &gt; big broadband profits. Period.\n\nIf you agree, tell @FCC: stop plans to dismantle #TitleII https://t.co/KQS4XHpDUw"]["#NetNeutrality is CRITICAL to freedom of expression, equal access to information &amp; ability of small businesses to compete online w/ big ones https://t.co/HFzvQqnB1a"]["Rolling back #TitleII #NetNeutrality protections helps no one but large broadband companies, who've been lobbying hard on this issue. https://t.co/UVT92lV8Q5"]["If broadband cos. get to control access to websites, they can control access to information, businesses, etc, in their favor. #NetNeutrality https://t.co/l3jmxwOpgl"]