["Thanks to @BeckyQuick &amp; @JoeSquawk for having me as a guest co-host on @SquawkCNBC this morning. Always fun to talk about issues with you and show that some of us in DC do have common sense &amp; are working to get things done. https://t.co/r646DE7TWo"]["Sat down with J.D. Irving CEO Jim Irving to discuss NAFTA &amp; how we can make sure U.S. trade negotiations are fair to American farmers and producers. https://t.co/64yi7fIBaz"]["Thanks to the bipartisan group who I worked w/ to negotiate &amp; write #SESTA, a bill that would crack down on human trafficking &amp; has enough support to pass the Senate. @senrobportman @senblumenthal @senjohnmccain @clairemc @johncornyn #humantraffickingawarenessday"]["Heard from the U.S. Dry Bean Council’s Food Aid Committee about their critical humanitarian work around the globe &amp; ways we can improve market access for commodities grown right here in the United States. https://t.co/SOJ0Z0iKD1"]["We must protect all of our children and make sure they are safe. Our bill would prevent websites like Backpage from enabling the trafficking of and exploitation of children to happen on their sites. #HumanTraffickingAwarenessDay https://t.co/ynkG69gKsp"]["We must do everything in our power to hold those who protect human traffickers accountable for their crimes. #HumanTraffickingAwarenessDay #SESTA https://t.co/3lVtYkZJ1I"]["No child should face the horror of being trafficked for sex, and no mother should be powerless to take action against a website that traffics her child. #HumanTraffickingAwarenessDay #SESTA https://t.co/mAIhiW0Tfq"]["This #HumanTraffickingAwarenessDay, learn the warning signs that someone is in danger. https://t.co/KcjsYzer2x"]["Human trafficking is a form of modern day slavery, and it's happening in North Dakota. We need stronger laws to bring criminals to justice like our bipartisan bill. #HumanTraffickingAwarenessDay https://t.co/p0nGYWPJ7Q"]["Thank you @cindymccain for your unwavering fight against human trafficking &amp; support of our bill. #HumanTraffickingAwarenessDay #SESTA https://t.co/7Y95ZKqQ18"]["@SenateMajLdr The documentary #IAmJaneDoe takes an in-depth look at websites like Backpage and the despicable crimes they facilitate. Was an honor to participate in @marymazzio's film. https://t.co/dYtSVlupkE #HumanTraffickingAwarenessDay #SESTA"]["A bipartisan bill I helped write and introduce to crack down on websites that facilitate human trafficking now has enough support to pass the U.S. Senate. @SenateMajLdr, let’s vote on the Stop Enabling Sex Traffickers Act. #SESTA"]["The https://t.co/nLHDmlX1N8 CEO refused to answer questions, and Congress held him in contempt of Congress. https://t.co/eVOXwE8ZxU"]["I’ve participated in multiple hearings &amp; have tried to make the CEO of https://t.co/nLHDmlX1N8 explain how he can sleep at night knowing he’s profiting from the sale of children for sex. https://t.co/VoUBNX2YYY"]["When I came to the U.S. Senate in 2013, I made it a priority to sound the alarm on human trafficking – which is occurring in our own backyard in North Dakota. https://t.co/WohgEocppM #HumanTraffickingAwarenessDay"]["Nothing like a North Dakota commute. Stay safe, and be sure to monitor weather updates and road conditions. https://t.co/7pyS5RlhGO"]["Congrats and good luck to the U.S. Under-18 team as they head undefeated into the medal round. Britta Curl is from Bismarck, and Anne Bloomer has Gilby roots. #U18WWC https://t.co/IlvJNBHMRJ"]["Sat down with FDIC Chair nominee Jelena McWilliams to talk about the importance of local banks &amp; credit unions and how we need to help small businesses &amp; farms in rural America. She also accepted my invitation to come visit ND. https://t.co/spELLv4941"]["In ND we know hockey.  Disappointing 4 girls across our state that they don’t have a college women’s hockey team to look up to &amp; aspire to anymore. Hope ND’s girls keep playing hockey &amp; other sports &amp; know they matter just as much as the boys. See @nytimes https://t.co/HyHIIcFYKp"]["@inforum Check out some of the snapshots of my busy 2017. These photos are a reminder of why I come to work in the U.S. Senate every day fighting for ND. It’s a true honor to serve our state. https://t.co/Hxyihyvg4m"]["It's been quite a year. Read my op-ed @inforum about how despite the gridlock and partisanship in Congress, I’ve tried to get a lot done for ND by working across the aisle to reach results. That’s what North Dakotans rightfully expect. https://t.co/sXHWosXVNC"]["No family should have to worry their child will be able to get lifesaving medical treatment. Congress needs to reauthorize #CHIP immediately so families don’t have to make that choice. https://t.co/SyAmlA8fqG"]["Congrats to @AlabamaFTBL on their national championship, but @NDSUfootball has won 6 championships in the past 7 years. That seems like a real dynasty CC: @SenDougJones"]["North Dakota grows some wonderful things - wheat, soybeans, and national championship football teams. Yesterday, @SenJohnHoeven &amp; I introduced a resolution in the U.S. Senate to recognize the @NDSUfootball team for their unprecedented success. #FCSChampionship #gobison https://t.co/HOVO7WTU0K"]["I always appreciate the opportunity to have bipartisan discussions at the White House to highlight North Dakota’s priorities. This meeting about border security &amp; protecting DREAMers was a positive step forward. https://t.co/SslJXqvcyC"]["Today is #LawEnforcementAppreciationDay. These brave men &amp; women support and protect our neighborhoods. And @FargoPolice has shown the importance of strong community relationships with #UNITY. Watch the video: https://t.co/PsBsh4Ybdv"]["I've consistently raised concerns about the Republican tax bill's impact on rural America. Modest, temporary help for only some farmers while the wealthy &amp; corporations get permanent breaks isn't fair. A bipartisan process could have made a better bill. https://t.co/n6AfrsT8p2"]["As a member of the Senate Broadband Caucus I’ve been working to make sure expanding broadband access in rural America becomes a reality. I welcome the Administration's help to connect more rural communities w/ high-speed internet. https://t.co/K2EWPjdII8"]["The president also mentioned the opioid epidemic. I’ve held six listening sessions across North Dakota on opioid abuse, &amp; I’m continuing to push for more federal funds to combat this crisis – I hope the administration helps this effort. https://t.co/dovfwLVSFR"]["One of my top priorities is ensuring that the next Farm Bill helps our farmers, ranchers, &amp; honey bee producers cope w/ drought. I hope the administration supports a bipartisan bill that provides a strong safety net, promotes research, &amp; expands exports. https://t.co/abB8T4pJxn"]["I've been fighting to protect agriculture in trade negotiations &amp; have warned against withdrawal from NAFTA. Over 70% of ND’s ag exports go to NAFTA countries. Withdrawal would be a disaster for our rural economy. https://t.co/RQsMDHmMcq"]["Every day I come to work fighting for rural America. In his @FarmBureau speech, the president helped highlight many critical issues to rural communities like agriculture trade, opioid abuse, and access to high-speed internet. #AFBF18"]["Too often, Native American children are impacted by poverty, substance abuse, &amp; domestic violence. I got a bill passed into law to create a commission to address systemic issues affecting Native youth - &amp; it's now one step closer to getting to work. https://t.co/LPD4ruyduG"]["An accurate census is critically important to ensuring rural communities get their fair share of federal resources - but @uscensusbureau's top leadership position has been vacant for months. I'm pushing for the quick nomination of a qualified candidate. https://t.co/z8nHOi5ydy"]["No North Dakota business would close down because it’s “too cold,” especially when it’s not even coat or gloves weather. Check out this @RollCall piece on my attitude toward D.C. winters https://t.co/OPAGCNhDxC"]["Congress must act now to reauthorize the #CHIP program that supports 2,000+ kids in ND. Congress should never play politics with our children – they deserve better. https://t.co/a9PZPC7jC7"]["Looking for new ways to keep you and your family safe in today’s digital world? Check out this @bxchen list of 5 New Year’s tech resolutions for better cybersecurity. #CyberSunday https://t.co/BJZrcb8S7m"]["Many in DC may be panicking about the \"cold\" weather the area is experiencing right now. Here are some of my thoughts about the differences in weather between ND and DC-- with some GIFs to help make my points. https://t.co/VjzKA55f11"]["For a story of unlikely circumstances that lead to love, read this @washingtonpost piece on the power of hope in the face of extraordinary loss. #SelflessSaturday https://t.co/Izw6E8BaTw"]["Congrats @NDSUfootball - 6th win in 7 years! Loved being in #Frisco to see it in person and celebrate with North Dakotans. #NDPride #FCSChampionship #GoBison https://t.co/dvCyWDkl22"]["6/7 ain't bad. Congrats to  @NDSUfootball for their 6th #FCSChampionship #FCSDynasty"]["Surrounded by loud North Dakotans here in #Frisco as @NDSUfootball is going into the half with a lead. We are ready to cheer all four quarters, so I can't wait for the second half. #FCSChampionship"]["Having a blast this morning in #Frisco as @NDSUFootball takes the lead. So many wonderful North Dakotans made the trek. #FCSChampionship #Gobison"]["Just a little excited to meet @NDSUfootball alumni @JoeHaeg59, @KyleEmanuel51 &amp; Billy Turner in #Frisco tonight. #FCSChampionship #GoBison @Colts @Chargers @Broncos https://t.co/nLkyg2iA0m"]["The long term impacts of not fully funding #CHIP will have repercussions down the road – this is unacceptable. Congress needs to fully fund #CHIP now.\nhttps://t.co/R9F3YUX8B5"]["The staff in D.C. is gearing up to watch the @NDSUfootball bring home another win in #Frisco. #GoBison #FCSChampionship https://t.co/pClvn1tzDs"]["Just landed in Texas and logged on to the #BisonTracker app. It looks like our herd of fans is stampeding to #Frisco! I love seeing our state coming together to support @NDSUfootball #FCSChampionship #GoBison https://t.co/UJ2eDgDIQM"]["On the plane heading to #Frisco with a bunch of James Madison fans. They’re pretty cheery right now. They won’t be in 36 hours. #FCSChampionship #GoBison @NDSUfootball"]["In North Dakota, we don't call this a \"snowstorm.\" We call it \"Thursday.\" https://t.co/G4rrpn9bhT"]["John Rood has the skills &amp; experience needed to help deal w/ North Korea threat. I’ve urged for his &amp; other positions to be filled quickly so leadership is in place to keep America safe. Listen to my podcast on the North Korea threat: https://t.co/3dKCt8mDDi https://t.co/HRqBBXTaX6"]["Opioid abuse has been tearing apart communities &amp; families across ND &amp; the US. It's a problem we must work to address in a comprehensive way. #FarmTownStrong is an impt effort to help combat this serious problem, &amp; I've been working in the Senate &amp; across ND to help stop crisis https://t.co/akS3P5csbk"]["Tired of the cold weather? Stay inside and listen to the latest episode of The Hotdish! In my latest podcast I talk to a Republican &amp; a Democrat about why bipartisanship would have made a better tax bill. https://t.co/McKGmTBUnp"]["Thanks for following along! I hope you have happy and healthy new year, and that 2018 is your best year yet. – Heidi"]["Best Twitter handles I followed: @TylerAxness and @TheCuttingEd – you should follow them too!"]["Best hockey game I watched at The Ralph: an exciting win against Omaha in February. #undproud #fightinghawks"]["Best laugh: Ate lunch at Country Kitchen in Casselton. Meal went long, so I called my next meeting at Valley City’s National Guard facility to let them know I’d be late. But they already knew – folks at the diner had given them a heads up. That's small town North Dakota for you!"]["Best place to get a @DietCoke: Any @McDonalds. Nothing beats fountain pop."]["Best part of my job: Hearing from thousands of North Dakotans about their concerns and hopes for the future, &amp; fighting for them every day in the U.S. Senate. It’s a true honor."]["Best book I read: Killers of the Flower Moon by @DavidGrann. As former Attorney General of North Dakota, I’m fascinated by history of law enforcement &amp; issues of crime in Indian Country, &amp; these are issues I'm focused on in the U.S. Senate."]["Best movie I saw: Wind River. Brings valuable attention to the epidemic of violence against indigenous women as I’m fighting to pass my bill, Savanna’s Act, to help address this crisis. #NotInvisible"]["Reflecting on the things I loved in 2017 as we start a new year. Here’s my #Bestof2017 list, and I’d love to see yours!"]["The health of our children should be more important than partisan politics. Congress must stop kicking the can down the road and act on a bipartisan basis to fully fund the #CHIP program.  https://t.co/FDIHw3gw4y"]["#HappyNewYear to everyone across North Dakota as we look back on the events of 2017 and look forward to a successful 2018. https://t.co/0TSp7OAUwd"]["Wishing North Dakotans a Happy #NewYearsEve. Be sure to stay safe this evening as you ring in 2018 with family and friends."]["Farmers across ND are having problems w/ the ARC-CO program, so in October I intro'd a bipartisan plan to fix it &amp; support farmers during challenging times like drought. https://t.co/snqphqhJaX"]["Congrats to these Richland 44 eighth-graders on taking first in ND in the @SamsungUS Solve for Tomorrow Contest. Good luck with your innovative drainage system idea as you prepare for nationals.  \nhttps://t.co/u3Ucfww0Vi"]["The top two @uscensusbureau positions are vacant, so I joined w/ @SenatorCarper in urging the administration to nominate qualified candidates without delay. Read our letter to @POTUS: https://t.co/ifYENgqRAc"]["An accurate census is absolutely essential to making sure North Dakota’s communities are represented &amp; get the resources they need to thrive. But a top government watchdog is warning that the 2020 census is at risk, partly due to lack of leadership. https://t.co/ddIuBXob11"]["Congratulations to Seargent Kylan Klauzer for completing @FBI's National Academy program. His new skills &amp; expertise make him an even stronger asset to the Dickinson Police Department &amp; their efforts to keep the entire community safe. \nhttps://t.co/Kj4qJET1tz"]["One of Santa's best helpers is named Jessy, who happens to live in southeastern North Dakota. Watch this @WDAYnews story about how Jessy and the Haberman family are spreading the spirit of the holidays to families in need in our state. https://t.co/GAgaOETMqP"]["Reasonable people can disagree on policy matters, but I believe it’s important to hear from all perspectives when making decisions consequential to our economy &amp; future generations. I discuss the good &amp; bad of the tax bill in my new podcast - listen here: https://t.co/McKGmTBUnp"]["#MerryChristmas to everyone in North Dakota and across the country as you spend time with friends and family over the holidays. https://t.co/mAR1OYdqVw"]["Happy holidays and congrats to the Valley City @HiLiners art department on being selected to paint the ornaments on ND's tree next to @TheNationalTree. Which native ND birds can you spot? https://t.co/ESYlUFChyi"]["I believe that bipartisanship makes for better policy, so I discussed tax reform w/ a Republican &amp; a Democrat in my latest podcast. Listen to my convo w/ fmr Sen. Kent Conrad &amp; @pswagel https://t.co/0ioCWKhjNd"]["Last night I voted to avoid a government shutdown. But lurching from deadline to deadline is no way to govern, and it’s unfortunate that Congress is once again kicking the can down the road for another few weeks. https://t.co/Nlj7M52XXR"]["Congrats to Col. Rodney D. Lewis – former commander of @319ABW – who the Senate confirmed to be Brigadier General"]["Congrats to Jaden Schmitz, Jacob Moeykens, and Jase Rogness from Hazen HS for winning the 1st round of the #ShowYourEnergy competition. I was thrilled to see your idea of how energy impacts our everyday life. Good luck in the next round of competition!\nhttps://t.co/IoSfSM5lkr"]["Forced arbitration sweeps abuse under the rug &amp; denies justice to victims. @Microsoft is taking the right step, &amp; Congress should pass the bill I helped introduce to end this unfair practice once and for all. https://t.co/OEYnth7mah"]["This @WDAZTV story shows how my bipartisan HEALS Act would help provide emergency housing for ND domestic violence victims and why we must do more to help survivors and their families. https://t.co/bYIw2595qt"]["The Republican tax bill is full of broken promises to the American people &amp; it will hurt ND in the long-term. Every day, I come to work in the U.S. Senate to fight for ND and rural America. Sadly, this bill leaves them behind. Read my full statement: https://t.co/FuCul5NXPL https://t.co/R82t4cG1No"]["Thanks @MSFTFargo – Congress needs to pass DREAM Act soon to protect those brought to US as children through no fault of their own. Over half were 6 yrs old or younger when arrived in US. For many, this is the only country they know &amp; removing these workers would hurt US economy https://t.co/rcyBQBKYw0"]["Met w/ Assoc Atty Gen Rachel Brand from @TheJusticeDept to discuss violence against women, human trafficking, and my efforts to address crisis of murdered &amp; missing Native American women. I invited her to ND to talk w/ tribal, state, law enforcement officials. #NotInvisible https://t.co/KiBSiLS0j0"]["Joined @BloombergTV's @kevcirilli to talk about importance of a fully functioning @EximBankUS for U.S. jobs &amp; competitiveness. Made important progress today by advancing 4 board nominees. https://t.co/glXBbX4RVS"]["Yesterday was a big day for the @cityoffargo —it won the $5 million @GUEnergyPrize. Congrats to @_eFargo, @NDSU, and their business partners on advancing #EnergyEfficiency in their community. I’m proud to be a longtime supporter of your efforts. https://t.co/U8wXjhc3ml"]["On the two year anniversary of this bipartisan deal—we should remember that when Rs and Ds  commit to debating and finding common ground, they can get things done. And that’s how I try to work every day in the Senate https://t.co/ytzUG3UmlU"]["The legislation was a way to both overturn the outdated ban and provide support for renewable energies, including wind energy jobs in ND. https://t.co/8T84njCt6n"]["In December 2015, I successfully helped craft and negotiate a bipartisan deal to lift the 40-year old ban on exporting U.S. crude oil. It was a major victory for ND and US consumers and producers.https://t.co/5g8i2A7L0W"]["Can Republicans and Democrats work together? A deal I helped craft two years ago shows that it’s not only possible, but also critical for supporting real economic growth and national security."]["Congrats to @GoParks on 50 years of supporting and preserving our national parks. @TRooseveltNPS is one of ND’s greatest treasures w/ its rugged landscapes that helped to shape Teddy Roosevelt into becoming one of our most cherished presidents"]["@AARP And provisions in this tax bill will do little to address the myriad of challenges young Americans face, from higher education and housing costs to a lack of retirement planning."]["@AARP Millennials will face higher tax brackets because the Republican tax bill will permanently index tax brackets to a lower rate of inflation, resulting in more middle class income going into higher brackets over time."]["@AARP By the time most millennials will be entering into their prime earning years, the tax cuts will be completely phased out."]["@AARP Although millennials will be paying for these tax cuts, they won’t see much in terms of tax reductions because these cuts are geared toward higher earning workers who are more developed in their careers."]["@AARP The Republican tax bill will hurt millennials. The structure of the tax bill will be particularly devastating for young men and women entering the workforce who will face a nearly $1.5 trillion bill in the next 10 years, just as they are entering their prime working years."]["@AARP To pay for the huge cost of the bill, it could lead to $20 billion in cuts to vital agriculture programs and hinder the negotiation of the 2018 Farm Bill."]["@AARP Republican tax bill will hurt rural America. Middle income families across rural America will lose out under bill in the long-term as the temporary, relatively modest tax decreases they receive will disappear after 2025 while the wealthy &amp; corporations will reap permanent rewards"]["@AARP The Republican tax bill will also drastically increase the nation’s debt by nearly $1.5 trillion, which could lead to $400 billion in cuts to Medicare over 10 years to help pay for the bill, and slash other programs that support seniors."]["The Republican tax bill will hurt seniors. According to @AARP, the bill will provide a large tax cut for corporations while raising taxes &amp; health care premiums for millions of older Americans. https://t.co/e4tq8xEScS"]["The Republican tax bill will hurt small businesses. It will widen the gap between large and small businesses, &amp; essentially punish smaller businesses that can’t afford to pay high priced tax attorneys and accountants to exploit loopholes and glitches in the rules."]["The Republican tax bill will hurt middle income families in the long-term. Read this 👇 https://t.co/Y0Qw7YCpvZ"]["The tax bill will have serious impacts on North Dakotans – middle income families, small business owners, seniors, millennials &amp; more. Here are some examples."]["The Republican tax bill won’t grow the economy or create jobs in the way Republicans say it will, as many large companies have said they will pass most tax savings on to shareholders &amp; not use the majority of the tax cuts to create jobs or boost wages. https://t.co/ZOtWgMdgWv"]["Many academics &amp; experts have concluded that under the Republican tax bill, our country’s debt will grow much faster than the economy. https://t.co/DcYn3AUcxp"]["Republican tax bill provides permanent tax cuts to corporations &amp; large tax cuts for wealthy, while middle income families lose out in the long-term b/c the relatively modest tax cuts they initially receive will expire after 2025 &amp; they will see increased costs in the long run."]["I supported tax cuts for middle income families. But we shouldn’t do it in a way that those families only receive relatively modest, temporary benefits, while the richest Americans – those making millions of dollars per year – and corporations receive the most benefits."]["It’s Congress’ job to put US on a strong path forward. But the Republican tax bill will explode the country’s debt, adding nearly $1.5 trillion on the nation’s credit card – &amp; that’s before accounting for various budget gimmicks – forcing those huge costs onto future generations. https://t.co/I02unywXYZ"]["Held a press conference in Fargo today with a local tax attorney, small business owner, senior citizen, farmer &amp; union rep to explain how Republican tax bill released last Friday evening will impact North Dakotans. https://t.co/sFalNS6MHB"]["Great @WDAYnews story about Fargo-area police helping out local families. Thank you to all those who donated and gave their time to this wonderful holiday tradition https://t.co/aXaTVB25jV"]["Read @TheresaAgovino on how to keep your credit and identity safe online during the holiday shopping season https://t.co/2gwoZd9JJ8 #CyberSunday"]["Great evening @NDFarmersUnion 91st Annual Convention. Heard from many farmers concerned about how changes to the tax code &amp; trade policy could affect them, &amp; discussed my efforts to make the 2018 Farm Bill work for ND - especially in times of drought. https://t.co/dXNBpLiTA6"]["The @dsubluehawks women’s basketball team is getting into the holiday spirit by spreading song and cheer in the Dickinson Community #SelflessSaturday https://t.co/XDafnCulZx"]["Congrats to @NDSUfootball on winning its 6th trip to Frisco! Your tradition and excellence on and off the field is nothing short of outstanding. #FCSPlayoffs #StayHungry"]["Unfortunately, Congress let the Children’s Health Insurance Program expire - it’s long past time to fully fund #CHIP for kids to receive the medical care they need to grow up strong &amp; healthy. https://t.co/un3glf1oe0"]["Important piece in @guardian about high rates of suicide among farmers. Must work to increase access to mental health care in rural areas &amp; increase mental health workforce in rural communities so farmers have access to help. Read more: https://t.co/AUvdXH0Qso CC: @femalefarmers"]["Today is your LAST CHANCE to sign up for or change your plan through #OpenEnrollment! Go to https://t.co/iOXJLIHEb4 now, or visit my webpage to help answer your questions about the process: https://t.co/4rbYiJHdU5 https://t.co/CV88U0UGpV"]["Pushed @USGS to fast-track a new study of resources in the Bakken region. Responsible energy extraction is essential to an all-of-the-above energy strategy, &amp; this study will help bring jobs &amp; investment to ND. https://t.co/ljekR5Dpmt"]["Congrats to @319ABW and @UofNorthDakota on the Air University designation. Looking forward to more airmen taking advantage of all that UND has to offer and receiving their bachelor’s degrees while stationed in North Dakota. https://t.co/xeBjHT9VFD"]["#OpenEnrollment ends TOMORROW. Get covered now at https://t.co/iOXJLIZf2C or go to my webpage to learn how to choose the plan that’s best for you and your family: https://t.co/uEQFEqJw8c https://t.co/JBvrpIvBga"]["@FCC actions will ultimately undermine these safeguards. Going forward, I’ll monitor how internet service providers alter the way the internet is offered and work to find realistic solutions so that the internet can continue to thrive as an open and free platform for everyone."]["Having strong net neutrality protections would have kept the internet on a level playing field to help allow start-up businesses to compete with large corporations and rural communities to access affordable internet service. It’s an issue of fairness."]["@FCC Having high-speed internet is no longer a luxury, it’s a necessity. Each of us uses the internet daily to pay our bills, take online classes, and make routine purchases."]["The decision by the @FCC to roll back net neutrality protections is extremely disappointing."]["Mark Herbert retired from the Capitol Police a while back, but I always make sure to catch up with him and his wife when they are back on Capitol Hill. https://t.co/zfKW7XpKci"]["@JohnCornyn The #HEALSAct would help level the playing field for transitional housing and encourage HUD to find living options that best support survivors. https://t.co/ESO180K1yf"]["@JohnCornyn In recent years, federal funds have been diverted from transitional housing, one of the most critical services provided to victims. https://t.co/F2r2jPE2JB"]["Today @JohnCornyn and  I introduced a bipartisan bill to prioritize emergency housing for victims of domestic violence and their families."]["Met with Alex Azar the nominee for @HHSGov &amp; reinforced the importance of addressing health care challenges in Indian Country and making rural health care a priority https://t.co/lN6xmXgHN9"]["U.S. Capitol Police officers help make sure the Capitol is safe for members, staffers &amp; the public. Today, we delivered some Christmas cookies to them. While it’s a small gesture, cannot express how grateful I am for their work &amp; service. https://t.co/D4FZQsWi4c"]["Thanks for highlighting challenges many schools face in modernizing foodservice equipment and providing healthy meals to our students! Proud to have introduced a bipartisan bill to help address this issue, and will keep pushing to pass it. https://t.co/W6rVaMw71G"]["My Dickinson Office is really getting in the Christmas spirit with this beautiful tree. I hope everyone takes a chance to enjoy all the great festivities the season has to offer. https://t.co/o5wSiQvelb"]["Meeting w/ @USOCC about what we can do to help community banks flourish with my bipartisan bill that provides relief to small banks and credit unions https://t.co/qFuMLFsbLE"]["Met w/ @usdaRD Assist. to the Sec. Ann Hazlett about making sure we are spending federal grant dollars wisely in rural America https://t.co/rIvsWzOlPT"]["Health care #OpenEnrollment ends on FRIDAY. Don’t miss the chance to get you and your family covered—check out my webpage for details on how to sign up: https://t.co/ssYBLbyW9m https://t.co/kedfwKGhxX"]["Strong #NetNeutrality rules protect consumers – especially in rural areas – and I’m very concerned about the FCC’s plan to repeal protections that ensure basic fairness. Read my letter to @ChairmanOfFCC: https://t.co/NRvOWfsnwq https://t.co/9Wos4qZbyF"]["Olivia Lone Bear has been missing since October 24. We must keep the spotlight on efforts to find her &amp; urgently work to address the crisis of missing and murdered indigenous women. #MMIW #NotInvisible https://t.co/qiaNPpoiNQ"]["Did you know that health care open enrollment ends THIS Friday? My friend, Dr. Mary Wakefield, explains in the @gfherald why you and your family should take advantage of the health insurance marketplace before it’s too late. https://t.co/KvbSyQqpdN"]["As I talk to farmers &amp; ranchers across ND, it’s clear that Congress can improve programs that help our agriculture industry recover from drought &amp; other disasters. I've introduced a plan to help - read more @BowmanPioneer: https://t.co/Rb2NjpyQMK"]["Wishing @cj_wentz a speedy recovery. Your hard work and determination represent the best of North Dakota!"]["The Senate Republican tax reform bill will put our kids on the hook to pay for its exorbitant cost without substantially growing the economy. The experts agree: https://t.co/ewyZylYhOj"]["Good piece by @htsuka highlighting differing views on Facebook's messaging app targeted to kids #CyberSunday https://t.co/VYdWMC67m9"]["Wonderful story about Fargo residents and businesses working to make the holidays a little brighter for local families #SelflessSaturday https://t.co/V34pnZuwYl"]["Good luck to @NDSUFootball as the Bison take on Wofford today in the #FCSPlayoffs. Go herd! #stayhungry"]["Read this @willistonherald piece on bill I helped introduce to recruit &amp; retain more rural volunteer first responders\nhttps://t.co/INzjZo3zf9"]["In rural America, you can buy a $90,000 pickup truck w/ a piece of paper, but you can’t buy a $40,000 house bc mortgage regulations designed for big banks are harming small community lenders. I've put fwd a bipartisan plan to help rural communities grow. https://t.co/38oETpEYd5"]["There is no one more deserving to serve on the American Battle Monuments Commission than Robert Wefald – I encouraged the president to appoint Bob and I know he will do our nation proud."]["By making it easier to volunteer and live in rural America, we can attract a new generation of volunteer first responders to keep our communities strong and safe. https://t.co/OYYTXFi4NY"]["96% of ND firefighters are volunteer. Student loan forgiveness would incentivize recruitment and retention and would reward volunteers for their hard work. https://t.co/54eDZWWv7M"]["Today I was excited to help introduce a bill to provide federal student loan forgiveness to volunteer firefighters and EMS teams."][".@GretchenCarlson is right: enough is enough. Proud to join @SenGillibrand, @LindseyGrahamSC, &amp; others to introduce bill to increase protections for victims of sexual harassment in the workplace. https://t.co/qUdU3V7wZJ"]["Discussing new improvements to the Grand Forks Airport with the Grand Forks Airport Authority– airports are critical to supporting ND’s local economies and local jobs. https://t.co/qyYQ2ENgMN"]["Chatted w/ Larry Kotchman-ND State Forrester about what we need to do to protect against wildfires https://t.co/UeCIr45mnN"]["Holding a discussion on the role of Congress with @mvpsd students was the highlight of my day-I can’t wait to see what these bright young students will do to better ND in the future https://t.co/H9rNXefaIS"]["Today, we remember those who made the ultimate sacrifice 76 years ago at Pearl Harbor. Thank you to all those who have served and the brave men and women who continue to keep us safe. https://t.co/u5WazDqeVa"]["2,000+ ND children rely on CHIP for health care – funding will run out if Congress doesn’t work together. @NYTimes details why Congress is putting CHIP in danger when it doesn’t have to be\nhttps://t.co/17cHWkq1QK"]["It's that time of the year again to light up the @USCapitolTree and spread some Christmas cheer! https://t.co/sK1Wnwhxdq"]["Started the #NotInvisible campaign to bring attention to the epidemic of murdered and missing Native American women. And my bill, Savanna's Act, is a needed step to help address this crisis. Join me in urging action to stand up for Native women. https://t.co/UrlPYuh30a"]["After I testified at a U.S. International Trade Commission hearing, I’m glad it took action against unfairly subsidized biodiesel imports from Argentina and Indonesia that are hurting North Dakota jobs https://t.co/Uzefs0gqkR"]["We must commit to zero tolerance – which is where I believe we as a country and Congress should be – and that means Senator Franken should step down. Full statement: https://t.co/4qrZB0mBTo"]["North Dakota’s drought has hit farmers, ranchers, &amp; honey bee producers hard. Today I introduced legislation to strengthen disaster assistance programs to help our ag community get through these difficult times. https://t.co/qzLIpK1IWD"]["You don’t have to convince me about all the great spots in Fargo. Spread the word – check out @foodandwine article on some of Fargo’s best local spots\nhttps://t.co/qZZRMMUYsO"]["Spent some quality time last evening with @NDNationalGuard 188th Air Defense Artillery Regiment who are stationed to protect Washington, D.C. They deserve our thanks today and everyday https://t.co/axpPRpL46k"]["Unlike tax reform, which was written behind closed doors with zero input allowed from Democrats, this bill is an example of how the process should work: negotiations between Rs and Ds, input from experts, &amp; public hearings and debates."]["Today’s action came after more than 20 Committee hearings on regulatory reform &amp; economic growth since 2015. And we’ve received input from over 30 of the top financial regulators about the issue."]["Today we saw a victory for bipartisanship in the U.S. Senate. After years of negotiations over several years with Republicans &amp; Democrats, the Banking Committee passed a bill I helped write to protect consumers &amp; encourage economic growth in rural communities."]["This is how positive, lasting progress is made -- by putting partisan differences aside and working together to strengthen our economy &amp; protect consumers &amp; jobs. And @BPC_Bipartisan agrees: https://t.co/Mi3X9Stkig"]["This bill would improve access to mortgages in rural areas, strengthen protections for veterans &amp; renters facing foreclosure, &amp; improve access to credit for small businesses. And it’s gaining broad support from small lenders in North Dakota. https://t.co/7tUqlYitys"]["It’s not often you see such senators from both sides of the aisle coming together like this. But after years of work, we’ve written a plan that protects consumers &amp; reduces regulatory burdens on community banks &amp; credit unions, which are so important to rural economies."]["This bill was negotiated and crafted over several years and it's an example of how if Rs &amp; Ds work in good faith to get results - as I try to do - Congres can reach bipartisan solutions."]["Today I’m eager to take part in a hearing on a bipartisan bill I’ve helped put forward to protect consumers and promote growth in North Dakota’s rural communities."]["Delivering a speech in front of the Korea Economic Institute on the North Korean nuclear threat and  ways we can boost our trade relationship with South Korea, one of North Dakota's major trading partners. Watch: https://t.co/OKQOUnHbDR"]["When Congress puts partisanship aside, it can forge ahead with solutions that help our economy &amp; rural communities. Proud to be part of bipartisan coalition fighting for families, farmers, &amp; small biz. See op-ed from @BPC_Bipartisan supporting our bill:  https://t.co/Mi3X9Stkig"]["#OpenEnrollment ends soon- head over to https://t.co/iOXJLIZf2C to sign up for #healthcare coverage or make changes to your current plan before December 15! \nLearn more here: https://t.co/asEVbJZEVP https://t.co/R3dDElQ3b3"]["Some North Dakota farmers &amp; co-ops are very worried about how the Republican tax reform bill will impact them. Read this story in @AgWeekMagazine about sugar beet producers who could see their tax bills go way up. https://t.co/6oowY5FkZW"]["As a winter storm comes in, it's a reminder to please stay safe on the roads. https://t.co/9eUrRvGcua"]["It's so encouraging and moving that the #NotInvisible campaign I started to raise awareness about missing &amp; murdered Native American women has gained traction. Hopeful it can help spur action to stop this terrible epidemic. https://t.co/o13uXPB8zo"]["Congratulations @_efargo for being a top 10 finalist in national energy-efficiency competition for $5M. This is a testament to the hard work already being done &amp; Fargo's commitment to energy efficiency. Learn how you can contribute here: https://t.co/Wg0nNowRVn"]["Important to make sure your online information &amp; computer are safe from hackers, scammers, &amp; identity thieves. Check out this tips to stay safe. #CyberSunday https://t.co/t3rdFmcEW9"]["Great to see a team rallying behind their teammate during her time in need. #SelflessSaturday https://t.co/lxC3bWzWQb"]["Every day in the Senate I’m fighting for families across rural America who are counting on us to stand up for them &amp; do the right thing. But under Senate Republican #taxreform bill, they will lose &amp; that’s why I couldn't vote for it. See my full statement: https://t.co/l10T08Kf8b"]["Must read article about how the @FargoPolice are working to unite the community https://t.co/J0BR0sjswP"]["Congress needs to take action &amp; reauthorize CHIP so families don't have to worry about having to file bankruptcy if their child gets hurt or becomes sick. https://t.co/1GL45lUg3n"][".@EPA's final RFS rule is an improvement from proposal in July, but I'm disappointed that biodiesel targets weren't raised as it will impact private investment in the industry &amp; jobs in rural America. https://t.co/EPqylDH7IO"]["The family of Olivia Lone Bear, who has been missing since Oct. 24, are searching this Sat. &amp; Sun. Admire the strength of Savanna LaFontaine-Greywind’s family for joining in the search &amp; thank all of the vols who have been working to bring Olivia home. https://t.co/fB7d86ApeV"]["Introduced bipartisan bill w/@SenJoniErnst that would allow the public to better hold government agencies accountable by making sure the work of inspectors general gets the full &amp; public analysis it deserves &amp; makes sure tax dollars are used efficiently https://t.co/Tlr4INFaYE"]["Important step that my bipartisan bill w/@JohnMcCain to expand AMBER Alert system in Indian Country passed unanimously in the Senate. Urge the House of Rep. to work quickly so it can be signed into law and #NativeYouth can be better protected https://t.co/X8fHrThmXT"]["@gfherald 95% of consumers live outside of the US - if we're not exporting we're losing. ND agriculture community relies on exports to NAFTA countries. Here are the potential impacts of renegotiating &amp; withdrawing from NAFTA in ND https://t.co/Q8IwIWi6kD"][".@gfherald editorial reinforces what I've long said - renegotiating or withdrawing from NAFTA could hurt ND's agriculture economy. I'll keep pushing to make sure that doesn't happen. https://t.co/ml2DcCYD2d"]["Open enrollment is now until December 15. This @gfherald op-ed by former Congressman Pomeroy highlights why it's important you look into your options &amp; make sure you and your family are covered. https://t.co/MWzgSpk88p"]["Met w/North Dakotans from the National Biodiesel Board to talk about the importance of a strong RFS that supports ND producers. https://t.co/mPaDr8Q2DG"]["Joined my colleagues in the U.S. Senate to write letters of thanks and appreciation to our servicemembers &amp; I encourage folks to do the same this holiday season. https://t.co/IoQh55pveq"]["Met w/@myUND's Research Institute for Autonomous Systems to hear updates on its work to research &amp; develop UAS technology in Grand Forks &amp; ND https://t.co/yHCR7IPB59"]["Honored to receive @goFAAR's leadership award for my work against drunk driving &amp; underage drinking. Appreciate its work to promote responsibility &amp; safety https://t.co/soryTDD3hG"]["Thanks to all the folks that helped raise awareness about the violence Native American women face &amp; epidemic of missing &amp; murdered Native women. Please keep it up - we can only start working toward real change when this issue is brought out of the shadows #NotInvisible #MMIW"]["November is National Native American Heritage Month – show your support for Indian Country &amp; help raise awareness about the violence Native American women face by posting a photo holding a sign that says #NotInvisible. #MMIW https://t.co/qdgPlVQXeG"]["Lindsay Vivier White from Turtle Mountain was friendly and outgoing - but her life was cut short and her family now lives with unanswered questions. This should not be happening in America. #NotInvisible #MMIW https://t.co/ZfciKOL99k https://t.co/qoCQJHj1ZG"]["The crisis of missing &amp; murdered Native American women has gone on ignored for too long. Read more about my work to combat it, including Savanna's Act, in my @gfherald op-ed &amp; help raise awareness using #NotInvisible. https://t.co/CgBbBwrLw8"]["Young Native American women like Lakota are robbed of their bright future, and we must put a stop to it. These woman are #NotInvisible. We must raise awareness about &amp; stop these crimes from happening. #MMIW https://t.co/GkWc9AJLEw https://t.co/Gc6H7Qdnyd"]["#NotInvisible effort and my bill, Savanna's Act, are about giving a voice to these voiceless women &amp; making sure we stop the epidemic levels of violence Native American women face. Read more about my bill in @bistrib https://t.co/oMmxiZjpW9"]["For years, I've been working to combat crime, violence &amp; human trafficking in Indian Country, and that includes introducing Savanna's Act which would help combat crisis of missing &amp; murdered Native American women. #NotInvisible #MMIW https://t.co/mmiJolmuAm"]["Mona Lisa was kind &amp; caring. Her family has lived for 38 yrs without the closure &amp; justice they deserve. Share her story, show your support, &amp; together we can work to combat the crisis of missing &amp; murdered Native American women. #NotInvisible #MMIW https://t.co/9dTVx6evKj https://t.co/S2aRZKQUkv"]["After 25 years, Monica Wickre's family wants justice for their daughter, sister &amp; mother. Too many families likes Monica's are forced to live without answers and closure. Monica deserves better. #NotInvisible #MMIW https://t.co/6QFFBlsm7a https://t.co/i1kY3mEfp9"]["@miamaestro Thank you for helping raise awareness about this critical issue!"]["On my podcast, 'The Hotdish,' spoke w/ experts &amp; advocates about their work to help indigenous women overcome obstacles &amp; hardships &amp; my bill, Savanna's Act, which aims to help. Listen &amp; learn more here: https://t.co/MCvptWxzOt #NotInvisible #MMIW"]["Stella Marie Trottier-Graves from Belcourt lived an adventurous &amp; fearless life &amp; was loved by all who met her. But 17 years later and her family has no justice. These are the stories that need to be heard. Please share. #NotInvisible #MMIW https://t.co/gR6bkRzmXd https://t.co/JAt1wz4w3a"]["Introduced bipartisan bill, Savanna's Act, that would help us begin addressing the crisis of missing &amp; murdered Native American women. During cmte hearing, I stressed why this is all of our problem, and why we need to take action to stop it. #NotInvisible #MMIW https://t.co/o4oxVJVHos"]["Native women and girls face a crisis of exploitation, violence &amp; murder and it has to stop. This epidemic is known all too well in Indian Country b/c so many are directly impacted. Today we're standing together to say that these women are #NotInvisible. Join us. #MMIW https://t.co/FKBsjuOdIH"]["84% of Native American women experience violence in their lifetime &amp; on some reservations, they are murdered at 10x the national avg. These women are #NotInvisible &amp; we need to shine a light on these crimes. Join me today to show your support &amp; help raise awareness. #MMIW https://t.co/jiycuoPGZC"]["Learn about my effort to raise awareness about the crisis of missing &amp; murdered Native American women on Facebook Live, and please join in our effort today #NotInvisible https://t.co/nbg5dEQLSt"]["Wonderful to join Susan Carter, @JohannaWriter, &amp; so many incredible female leaders @NatlWomansParty to celebrate women's progress toward equality &amp; the the role of women in society. https://t.co/ASYjlQrPmf"]["Great meeting with @AirForceAssoc about the important role of the @usairforce in the security of the nation &amp; the pivotal role of the work done at @TeamMinot &amp; @319ABW https://t.co/BCk5dOQB1N"]["Talked about NAFTA &amp; how any renegotiation or withdrawal must take into account the needs of agriculture producers with folks from the Canada-US Inter-Parliamentary Group. https://t.co/UtC8tA59dr"]["Met with folks from @iupat82 to discuss workforce challenges in ND &amp; how we can create &amp; support a workforce for the future. https://t.co/jzA4rXOv4I"]["Long said I'll work w/GOP &amp; Dems on tax reform that supports workers, families, &amp; retirees, while growing the economy and staying fiscally responsible. Both sides have common concerns, and if we work together, we could find meaningful reform."]["Joined moderate Democratic senators to call on GOP to work with us on tax reform so we can achieve a lasting result that provides permanency &amp; predictability https://t.co/YNR7hhLnsN"]["Last week in Bismarck w/workers &amp; retirees, I unveiled a new bill I helped write &amp; introduce that would make sure folks got the pensions they earned. More via @KXMB https://t.co/RMLcixwmPl"]["Opioid abuse is tearing apart homes &amp; communities in ND &amp; across the country. Read @bistrib story on how I'm pushing for needed resources to prevent and combat https://t.co/Gn7xZPXH1M"]["Thanks @gfherald for highlighting how important it is that Congress pass the bill I helped write &amp; introduce to hold websites like Backpage accountable for their roles in online sex trafficking https://t.co/aLRVV1uhag"][".@inforum article reinforces my concerns that renegotiating or withdrawing from NAFTA could hurt ND producers. I'll keep fighting to protect ag as talks on NAFTA continue https://t.co/sTgTRjMmeJ"]["Hear from workers/retirees who need Congress to pass a bill I helped write and introduce that would make sure they get the pensions they earned. Their stories are powerful. https://t.co/wU2DoYvOzN"][".@NetSmartz has great tips for how to keep your child safe online. Check it out here: https://t.co/cxm2VdqGbz #CyberSunday"]["Wonderful @AgweekMagazine article about how folks come together to help those in times of need. #SelflessSaturday https://t.co/2WwTf30DGT"]["Encourage folks to go out and shop &amp; dine small for #SmallBizSat today &amp; support the local #smallbiz that make your community great https://t.co/2ElfpayO4I"]["As we gather w/family for Thanksgiving, encourage folks to thank the #vets &amp; servicemembers who sacrifice for the liberties we celebrate https://t.co/uytsVVUHnU"]["Thousands of hard-working North Dakotans were promised their retirements would be safe. Watch this @KXMB video to see how I’m fighting against potentially devastating cuts.  https://t.co/7Y24mSMNHe"]["Read this @Bistrib story on a rally I held with 100 ND workers &amp; retirees to announce a bill to protect their pensions https://t.co/3euDgBMFLv"]["Met w/@UnitedTribesND President Russ McDonald to talk about solutions to help make higher education more affordable &amp; accessible. https://t.co/GP7TOnIsrd"]["Follow me on @snapchat to see more from today's event w/workers &amp; retirees in Bismarck about my bill to make sure they get their hard-earned pensions https://t.co/YtvswHNfC3"]["@BranickQuality Read some of the many stories I've heard from the 2,000 ND workers/retirees whose pensions are being threatened - this shouldn't be happening in America. And I'll fight every day to make sure it doesn't under my watch. https://t.co/wU2DoYvOzN"][".@BranickQuality's Duane Brasch from Fargo knows how important it is that Congress quickly pass my bill so that his employees get the pensions and retirement security they've worked for for decades. https://t.co/XRUmSieOcy"]["Mark Lundeby from Grand Forks knows that if Congress doesn't act quick to pass my bill to protect workers &amp; retirees' pensions, that his family's financial security is in jeopardy. We must pass my bill &amp; stand w/retirees like Mark. https://t.co/NojpW9CYJV"]["Like many Teamsters, Mark Rothschiller from Bismarck gave up time with his family &amp; holidays knowing that he could make up for it during his retirement. Without my bill, Mark will spend his retirement worrying about how to pay his health care bills https://t.co/4L36gfwMFM"]["Dennis Kooren from Fargo said this fight is about more than just pensions - it's about dignity &amp; justice for workers &amp; retires who played by the rules only to have the rug ripped from under them. I agree w/Dennis &amp; that's why I helped write this bill https://t.co/otK5hg4NAi"]["Tony Goetzfried from Bismarck spoke about how so many Teamsters gave up decent wages &amp; pay raises with the promise of a pension. He reinforced how my bill would make sure folks got what they earned https://t.co/PpkD7Ba6qU"]["After getting offered twice the salary &amp; the 'best retirement in the country' Wayne Odegaard from Ruby left his job as a teacher to be a UPS driver. Now, 30 years later, his hard earned pension is being threatened - but my bill would stop that from happening. https://t.co/PCVTSX2LxZ"]["My bill would help folks like Donna Mattson from Fargo &amp; her husband, Mike. Mike worked hard his entire life with the promise of a pension &amp; without it she doesn't know how they'll survive. https://t.co/eNFeFAm18u"]["ICYMI - joined workers/retirees in Bismarck to announce a new bill I helped write to make sure they get their hard-earned pensions. Watch it here: https://t.co/EapfvensNK"]["Today the president carried on the tradition of pardoning @PrezTurkey. This year's turkey, Drumstick, was raised by Carl Wittenburg from Wyndmere whose late father, Wally, was my good friend. What a small world! https://t.co/Cji3fz6Apm"]["Great to join about 300 folks at the ND Association of Soil Conservation Districts' annual meeting today to highlight how I'll fight to make sure the 2018 #FarmBill invests in research &amp; conservation https://t.co/uJ4MentWq4"]["Led bipartisan effort w/@JohnBoozman to warn of the potential impacts of a renegotiation or withdrawal from NAFTA on ND's ag economy &amp; w/@SteveDaines to protect ND dry pea producers from India's unfair trade practices. https://t.co/bTINbeHJYs"]["The Burckhards from Minot open their home to international kids with Down Sydrome &amp; are a true inspiration #NationalAdoptionMonth https://t.co/FVnZkhySOy https://t.co/N42EUi4VKY"][".@USCapitolTree is making its way from @KootenaiNF to Washington, DC - &amp; this weekend hundreds of folks gathered during its stops in Dickinson and Grand Forks. Driving the truck on this journey is Casselton-born Larry Spiekermeier! https://t.co/wVAVsSPM0a"]["#GivingBirthInAmerica highlights why giving birth in the US is becoming more dangerous-reinforcing need for my bill https://t.co/x1nMDmCo9u"]["Check out YouTube's \"Grandma Rule\" &amp; other tips for how teenagers can stay safe online #CyberSunday https://t.co/8BoWJ2ygcp"]["Encourage folks w/difficulties obtaining prescription medicine to reach out to the Prescription Assistance Program https://t.co/8CavBtS1AZ"]["Emily Paulson shares her story &amp; experience during Horizon Middle School's effort to choose kindness. #SelflessSaturday https://t.co/cLdCqJYr64"]["Privileged to announce 8 incredibly talented &amp; smart NDans who I nominated to attend our nation’s military academies. Each of them are hardworking, determined, and eager to serve. #NDPride https://t.co/mhVdQp4ohK"]["PTC has spurred wind energy boom in ND -creating good-paying jobs &amp; supporting economy. House GOP tax bill would gut PTC deal I made &amp; was signed into law in 2015, &amp; would stop wind projects/investments from moving forward https://t.co/UnxfVn9lX6"]["Have questions about your health care coverage or options? Check out my new webpage with information &amp; resources. Folks can enroll now until Dec. 15 https://t.co/udlYYKHpYh"]["Voted with a bipartisan majority of the Senate to pass the National Defense Authorization Act. Great for ND's defense efforts that several key provisions I fought for were included.  Bill will support our national security &amp; boost our economy https://t.co/0aXOkIxXrO"][".@NDNationalGuard homecomings continue – today in Bismarck, Sergeant First Class Jeremy Greenstein was reunited with his wife, Katie. Thank you for your service &amp; welcome home! https://t.co/DlNuE4GeYX"]["Discussed the importance of trauma-informed care to better support &amp; understand challenges youth face, especially in Indian Country w/@Surgeon_General Jerome Adams https://t.co/JVdqsqSJq8"]["Talked about priorities for sea services &amp; other @NavyLeagueUS priorities with Bob Wefald from Bismarck https://t.co/SuqpC3EllJ"]["Met w/NDans with @SHRM to talk about how important it is that a tax reform bill includes provisions to protect workers, levels the playing field, &amp; is fiscally responsible. https://t.co/LV3n9JzOW8"]["Encouraging that ND business &amp; national groups overwhelmingly support my bill that would reduce the burden of the Health Insurance Tax. . This bill would mitigate the negative impact the tax would have on ~71,000 #smallbiz &amp; ~200,000 workers who would see their premiums increase https://t.co/WSWg4SoY9G"]["Coal miners, teamsters &amp; American workers worked hard &amp; played by the rules &amp; I'll keep fighting to make sure they get what was promised &amp; earned. Discussed this w/@MineWorkers today https://t.co/vCPES8oR58"]["Most NDans live in rural areas meaning that rural health care is critical for families &amp; communities. Today for #NationalRuralHealthDay, I want to thank the professionals who continue to provide top-notch care for rural patients. #PowerOfRural https://t.co/tZe0TjJeHB"]["So great to meet Rebecca &amp; her daughter w/@FamilyVoices. @SenKaineOffice told me once that after thanking the group for their work, Rebecca reminded him that they have to fight for their kids every day. Incredible story &amp; an incredible family. https://t.co/uWFsZMC2yq"]["Met w/ND native &amp; past @AOAConnect President Dr. Dori Carlson to talk about how to give consumers more flexibility in coverage &amp; care https://t.co/Efmvd759gI"]["Honored to receive @familyvoicesnd's Champions of Children's Health Award for my work to fight for children with special health care needs https://t.co/5oxwmNJXYM"]["Met w/@ndrealtors to talk about how tax reform must level the playing field, make it easier &amp; less costly to file taxes, &amp; grow the economy https://t.co/S8mmyIvBM9"]["New @Chapin_Hall study found that 1 in 10 young adults experience homelessness over 1 year, &amp; at least 1 in 30 adolescents btwn 13-17. This reinforces need for #RHYA to help #EndYouthHomelessness https://t.co/W7bpMZNjWu"]["After a 10 month deployment, 60 @NDNationalGuard servicemembers are coming home this week. Words can't describe how grateful I am for their service &amp; sacrifice - and everything their families gave up for our nation. https://t.co/SLstcSzeSN"]["Appreciate the kids from the Bismarck Early Childhood Education Program sending me Thanksgiving art to help get my Washington, DC office in the holiday spirit. https://t.co/Q8E9J6IAdZ"]["With majority of Senate Homeland Security Cmte, I voted to advance Kirstjen Nielsen's nomination to lead @DHSgov. At Senate hearing last week, Nielsen committed to prioritizing security improvements at Northern Border. https://t.co/3L1xfInUaR https://t.co/En6r7QdDJI"]["Proud to have support from ND bankers for bipartisan bill I helped negotiate that would provide relief for community banks &amp; credit unions, protect &amp; support consumers, &amp; boost economic growth. More in @MinotDailyNews https://t.co/s8aLSXrrRU"]["No parent or family should have to worry about having to file bankruptcy because their child gets hurt or becomes sick. It’s past time Congress takes action and reauthorizes CHIP. https://t.co/Q8Kxubtntq"]["@politico This bill would support consumers &amp; rural communities by freeing up burdensome regulations on community banks and credit unions which are key lenders to consumers in small, rural towns. https://t.co/l5EF5y90IK"]["@politico Our bill is an example of how I try to work every day to get results for North Dakota in the U.S. Senate. https://t.co/9hpkYbcYPv"]["@politico After 3 years of negotiations, this bipartisan bill is an example of how Republicans and Democrats can work together to reach real, tangible results through compromise – particularly in these partisan times."]["Bipartisan deal I helped negotiate to provide relief for community banks &amp; credit unions, protect &amp; support consumers, &amp; boost economic growth already has support from 9 Republicans, 8 Dems, &amp; 1 Independent. Read more in @politico https://t.co/XpWyY8XeSL https://t.co/yu1vmsnYjx"]["Happy birthday to @JackTrackItDown - hope you keep calling it like you see it! Enjoy your day. https://t.co/0mC4TJ26zn"]["Open enrollment to get health care coverage is now until Dec. 15. Check out my webpage for more info on how to #GetCovered https://t.co/udlYYKHpYh"]["Every day I come to work in the US Senate, I'm fighting for rural America  - &amp; that's what the bipartisan deal w/@MikeCrapo @SenDonnelly @SenatorTester @MarkWarner to reduce burdens on community banks is all about"]["Big news: Helped negotiate bipartisan deal to improve financial regulatory framework, support consumers &amp; promote economic growth. Our bipartisan bill would provide needed relief to community banks &amp; credit unions while also strengthening protections for consumers https://t.co/Gmrvbz9rRw"]["On @agripulse's Open Mic, I talk about how the drought &amp; low commodity prices have impacted ND producers this year &amp; my work to fight for a strong 2018 #FarmBill. Listen here: https://t.co/k8z9kx6mI7"]["Ina Olson from Belcourt has dedicated her entire life to helping foster &amp; adoptive kids #NationalAdoptionMonth https://t.co/wQFxXF0xxB https://t.co/A1lnjPy5o2"]["84% of Native women experience violence in their lifetime &amp; on some reservations, they are murdered at 10x the national average. We talk about how to tackle this crisis on the newest episode of 'The Hotdish' https://t.co/ytPRrS9djF"]["Spread the word: health care open enrollment is now until Dec. 15 - check out my webpage to learn more about your options &amp; to determine the best plan for you &amp;  your family https://t.co/udlYYKHpYh"]["Free &amp; public wifi doesn't mean safe wifi. Check out these tips to make sure your info is protected when you're connected to public wifi. #CyberSunday https://t.co/HuxCWqVLik"]["Great @bistrib story about students at Mandan coming together to help folks in Puerto Rico who were impacted by Hurricane Maria. #SelflessSaturday https://t.co/3T54PBgVzT"]["Spoke at VFW All-Veteran Centennial Memorial in Bismarck today to thank ND's courageous &amp; selfless #veterans for their service &amp; recommit to fighting for them in the Senate https://t.co/I4BT6EofVC"]["In 2015, worked w/Bismarck HS students to honor NDans who never came home from Vietnam War-read their stories here: https://t.co/6pbD0pHBg9 https://t.co/Vt8djwLiyI"]["Today &amp; every day we must honor the sacrifices of our #vets &amp; their families &amp; live up to our duty to support them when they return home https://t.co/hAN3i2uRRO"]["The @USMC has served out nation valiantly from the American Revolution to today’s missions across the globe – Happy Birthday Marines! https://t.co/KvgzuIqP0Z"]["Thanked ND servicemembers &amp; #vets for their sacrifice at Bismarck AMVETS #VeteransDay program &amp; recognized 100th anniversary of entering WWI https://t.co/I3PD0Jw75X"]["Will be on @MPR at 11amCT to talk about Savanna's Act &amp; how it will help combat the crisis of missing &amp; murdered Native American women. Tune in here: https://t.co/efQkM0oyA2"]["Testified at an International Trade Commission hearing on impact of biodiesel imports from Argentina &amp; Indonesia threatening jobs in farming &amp; biodiesel production in ND. The ITC must take action to level the playing field for ND producers https://t.co/KjzBM73zny"]["Live now: talking about open enrollment, need to pass bipartisan deal on health care, and for Congress to reauthorize CHIP – a program that millions of children nationwide rely on for health care. https://t.co/l74TUgprie"]["Ralph McCowan was 1 of the 160 NDans who never came home from Vietnam that I honored on the floor of the U.S. Senate in 2015"]["Honored to meet Rhonda McCowan Grimmer &amp; family, the family of Private First Class Ralph McCowan, who lost his life in the Vietnam War https://t.co/ulrTcnuBsi"]["@SenateCommerce Bipartisan bill clarifies the law websites were hiding behind &amp; no longer shields criminals like Backpage that make $ from child sex slavery"]["@SenateCommerce Congressional investigation into role of Backpage to facilitate #humantrafficking exposed horrific realities &amp; this bill would help stop it https://t.co/1XJ3fugBOS"]["Critical step forward that @SenateCommerce passed bill I helped intro that would hold websites like Backpage acctble for #humantrafficking https://t.co/oMee4sZuz6"]["At Senate hearing, secured commitment from top @DHSgov nominee to visit ND &amp; prioritize challenges at the Northern border if confirmed https://t.co/2tSq0JTFP2"]["On behalf of NDAREC, I pushed @USDA for transparency in its grant making process - basic info on federal $ should be disclosed https://t.co/jzWKa0xM5O"]["Great @KXMB story on @YouthworksND's incredible work to support young NDans in need of a place to live &amp; support https://t.co/oprRWnAlOX"]["Congratulated Longfellow Elementary Principal Erik Hendrickson &amp; teacher Becky Holter on being recognized as @NatlBlueRibbon. #NDProud https://t.co/HHXwjiwWvI"]["Congrats @SanfordHealth's Bismarck Clinics for being named @MillionHeartsUS  #HTNControlChamps &amp; your work to prevent heart attacks/strokes https://t.co/wgfGoPrHTr"]["@SenateBanking Bill included my amdmt that would help understand N. Korea’s relationship w/nations that help it commit fin. crimes &amp; pursue nuclear weapon"]["North Korea is most urgent nat’l security threat to US. @SenateBanking, passed stronger financial sanctions on those doing biz w/N. Korea https://t.co/kfzGBpERe6"]["Olivia Lone Bear has been missing since Oct. 24. Please help spread the word so she gets home safely. https://t.co/6gIzzecjVL"]["9M kids nationwide - including 2,000+ in ND - rely on CHIP for routine checkups, dental care, &amp; more. Congress must reauthorize."]["The Williams' from Dickinson selflessly opened their hearts &amp; home to kids in need. #NationalAdoptionMonth https://t.co/P1DqO8ZUtT"]["Glad the 90 ND WWII &amp; Korean War #vets on @WDAYNews Honor Flight in DC can finally see the memorials built in their honor https://t.co/jxs5g87FpG"]["Have questions abt your health care coverage or options? Check out my new webpage w/info &amp; enroll now until Dec. 15 https://t.co/udlYYKHpYh"]["Enjoyed meeting @MissAmericaND Lizzie Jensen last wknd &amp; learning abt her #IAmMore platform to help combat bullying https://t.co/pKpD2wyTTN https://t.co/25PLIYJq0g"]["Great @inforum story about ambitious young NDans who are tackling school full time &amp; working on the farm. https://t.co/7SpIJZicGl"]["Secured commitment from @USTradeRep Lighthizer to protect ag in talks on NAFTA. Pressed him on how pulling out of NAFTA would hurt farm jobs https://t.co/EdtzxU9BTw"]["Need more info about open enrollment for health care? Check out my website &amp; make sure you're covered before Dec. 15 https://t.co/udlYYKpOzH"]["Listen &amp; share my new episode of 'The Hotdish' to help raise awareness abt crisis of missing/murdered Native women https://t.co/MCvptWxzOt"]["Learn more about 2-step verification &amp; why it's important to keep your information protected online. #CyberSunday https://t.co/aRFlQCPKEB"]["Joined folks in Bismarck today to welcome home @MissAmerica &amp; celebrate Cara Mund day! So proud of how well Cara represents North Dakota https://t.co/pV9FRgbsXZ"]["Bison play an important role in ND's heritage &amp; traditions. Proud to have helped designate today as #NationalBisonDay https://t.co/XZ74wto7Ww"]["Learn about my new webpage w/info &amp; resources about open enrollment for health care (now - Dec. 15) from @bistrib https://t.co/bZK0rMq5xS"]["New episode of 'The Hotdish' focuses on the crisis of missing/murdered Native women - must raise awareness. Listen: https://t.co/MCvptWxzOt https://t.co/UfBU0zJOMX"]["Had lunch w/US Senate Pages to thank them for their hard work w/@SenatorTimScott @SenBooker @maziehirono @SenAngusKing @SenJoniErnst https://t.co/rtSTLVTH0D"]["@Scotus .@SCOTUS decision caused brick &amp; mortar businesses around the country to lose close to $26M every year. Hope @SCOTUS will consider our brief"]["@Scotus Brought case to @SCOTUS in 1992 as ND Tax Commissioner but court said catalog retailers don’t have to pay state sales &amp; use taxes"]["Led bipartisan amicus brief to @SCOTUS urging it to reconsider/overturn 25 yr-old case that disadvantages brick &amp; mortar shops https://t.co/SKZQdi5rW1"]["Happy birthday, @JoelKFGO! I guess you're pretty alright. https://t.co/mMjWCKacGb"]["Also concerned about @uscensusbureau's inability to accurately count &amp; assess Indian Country &amp; rural communities"]["At Senate hearing, pressed my concern over 2020 Census's inability to build public trust &amp; do accurate count. More: https://t.co/8qFZWJXB7R https://t.co/InEuygkBYB"]["Celebrate 128 years of #NDLegendary with some of the best &amp; breathtaking photos of ND I've received over the years https://t.co/gI321dXTji https://t.co/1hCSx7mJYE"]["Read @AgweekMagazine about how my bipartisan bill w/@SenJoniErnst would address farmers' chlgs w/ARC-CO payments https://t.co/2c4y2FrwLA"]["Open enrollment for health care is underway. Read @GradyMcGregor's article on how health ins. options differ this yr https://t.co/mbmhHEoJ9P"]["Great to chat with some folks from Pisek today &amp; thank Geraylyn for all her work to protect the Northern Border at the Port of Entry https://t.co/2Lj1mApzza"]["Access to affordable, quality health care is a must - that's why I'm stepping up to make sure NDans can get info &amp; assistance they need"]["Launched a new webpage offering resources for NDans to sign up for or change health insurance now until Dec. 15 https://t.co/l1FN9UW5eR"]["@SenateBanking #ExIm needs a leader that believes in the mission of the Bank. It was clear @SenateBanking that that is not Scott Garrett https://t.co/NjCKfSVSaU"][".@SenateBanking hearing today, asked #ExIm board nom. Scott Garrett to apologize for his previous statements on &amp; actions to undermine ExIm https://t.co/14tNhbt3vl"]["It’s been more than a month since CHIP expired – Congress must take action &amp; make sure millions of kids have access to quality health care"]["Open enrollment for health care begins today. Read @inform on how changes could impact your ability to get coverage https://t.co/aXgKpOnEae"]["Thinking &amp; praying for you @maziehirono, my Ohana. You’re a strong, tough woman &amp; you’ve got this. But I agree, cancer sucks. https://t.co/xQaQmjsutr"]["Heartbreaking terrorist attack in NY. Thinking of the victims &amp; their families, &amp; grateful to law enforcement. All of us remain #NYCStrong"]["Had the cutest little lamb stop by to trick or treat in my office today. Hope everyone has a Happy Halloween! https://t.co/K95OKEAz4O"]["We need a tax reform plan that protects retirement security for hardworking Americans - not one that makes it more difficult to save"]["Recent reports say House GOP may limit pre-tax contribution limits to 401K retirement savings accounts from $18,000 to $2,400 in tax reform https://t.co/n6CGGsoBwX"]["Reinforced need to focus on preparedness as @fema &amp; other agencies cont. to deal w/aftermath of tragic hurricanes https://t.co/kPrneqFzEV https://t.co/WkZTwL9RI7"]["Olivia Lone Bear went missing Oct. 24 – if folks have any info, please contact law enfmt &amp; help Olivia get home safe https://t.co/7pYo66PVgi https://t.co/94x3svtDZI"]["Had belated birthday breakfast w/my staff &amp; shared stories about my fav b-day &amp; most unusual b-day gift - you know what I mean @JoelKFGO https://t.co/2wS82KzkIs"]["Encourage folks to get out and support local military-owned businesses this week for National Veterans Small Business Week. #MyVetBiz"]["4 yrs ago I intro. my 1st bill as US senator to stand up for #NativeYouth. Proud it was signed into law last yr but still lots of work to do https://t.co/AuGV9LkmG7"]["Congress is failing the 9M kids nationwide - including 2,000+ NDans - who rely on CHIP by failing to reauthorize this critical program"]["Savanna's Act was discussed in @IndianCommittee last week - an important 1st step to help combat crisis of missing/murdered Native women https://t.co/sA6mSorsNq"]["What's an easy way to protect your computer from hackers &amp; scammers? Update your computer software. #CyberSunday https://t.co/yrdUJU3zGB"][".@CityofWestFargo Mayor Rich Mattern does his part to raise awareness about breast cancer #SelflessSaturday https://t.co/zwrvl9XaN0"]["My DC staff &amp; @SenatorCarper's office were getting in the Halloween spirit today. And of course, the Teddy Roosevelt pumpkin won the contest https://t.co/izILozGpUD"]["Heartbreaking stories of missing &amp; murdered Native women from @hprfm. Savanna's Act aims to bring hope &amp; justice https://t.co/bqfqEQ3jVh"]["See my statement on the president declaring the #opioidepidemic a public health emergency: https://t.co/E4KbhZQhEc"]["Met with folks from the Garrison Diversion Conservancy District to talk about projects across the state to meet water needs https://t.co/iHovVxANjL"]["Great to see @FoundingFarmers &amp; so many other DC restaurants @RestaurantHigh United Tastes of America https://t.co/MZdTdhkukK"]["Met w/folks from @thinkpolar &amp; @RedRiverComm to discuss programs that promote universal access to telecommunications services https://t.co/1Ge5HpaFra"]["@SenJoniErnst Prove It Act builds on my years of work to improve how regulations are made &amp; my bipartisan bill that would make regs smarter/more effective"]["@SenJoniErnst Needs of #smallbiz have to be considered as regulations are created, &amp; my Prove It Act w/@SenJoniErnst would help do that https://t.co/qj7GPnB4TV"]["Joined @SenJoniErnst to intro. bipartisan bill that would give #smallbiz a voice &amp; strengthen transparency as regulations are drafted https://t.co/f9yILuYEQ7"]["Thanks @JoshBoschee for coming to DC today to testify at my Senate subcmte hearing on states' regulatory process. https://t.co/5bYu4lkCBt https://t.co/IARTB7h3Ge"][".@SenJohnMcCain is a true hero who has dedicated his life to serving our country on the battlefield &amp; in office. Proud to call him a friend. https://t.co/VzUU7BGp2e"]["Savanna's Act would help give Native women &amp;families the justice they deserve. Read @bistrib on its movement in Sen. https://t.co/fHWREe28y2"]["Proud to help pass bipartisan resolution recognizing today as #DayOfTheDeployed to pay tribute to deployed service members &amp; their families https://t.co/VtH4dllIGJ"]["My @gfherald op-ed reinforces the need for Savanna's Act to help combat crisis of missing/murdered Native women. https://t.co/CgBbBwrLw8"]["Winter is coming, North Dakota. Stay safe out there! https://t.co/fBm5jyL4SP"][".@USCBO report on bipartisan health care deal that I helped work on reinforced that it would make sure families get affordable health care https://t.co/cMEhLyDXtp"]["Interesting &amp; timely @ThisAmerLife story on the topic of cat-calling and sexual harassment. Check it out here: https://t.co/FNYP3N2Ywi"]["@SenatorTester @MartinHeinrich @SenFranken @SenWarren @SenJeffMerkley @RonWyden @SenCortezMasto @lisamurkowski We need solutions to protect Native women &amp; today was a good step. Check out more from today's hearing on my @Snapchat &amp; @instagram stories https://t.co/4fws2PKtHj"]["Thanks for cosponsoring @SenatorTester @MartinHeinrich @SenFranken @SenWarren @SenJeffMerkley @RonWyden @SenCortezMasto @lisamurkowski"]["If you or someone you know in Indian Country is facing violence or gone missing - check out resources on my webpage: https://t.co/e2NlrAEQfV"]["Savanna's Act &amp; work to protect #NativeYouth &amp; Indian Co. are key parts of my #StrongSafe Communities Initiative I started in 2014 https://t.co/DO734MRDeq"]["@IndianCommittee Leading advocate 4 Native women, Carmen O'Leary, spoke @IndianCommittee abt how this is a crisis many tribes face &amp; Savanna's Act will help https://t.co/CLyfcuqm8F"]["@IndianCommittee Native women face a crisis of exploitation, violence, &amp; murder–this hearing &amp; Savanna's Act is imp. step to make sure they're protected https://t.co/P5c3XzH4cz"]["Today @IndianCommittee held a hearing on Savanna's Act, my bipartisan bill to help address epidemic of missing/murdered Native women https://t.co/94SlGXSg3P"]["@AgweekMagazine Love the name &amp; the hair! Thanks for bringing homemade cheese &amp; goodies to the region."]["Great to chat w/my sister Mel on behalf of @YouthworksND &amp; @nn4youth ED Darla Bardine about their work to support &amp; fight for homeless youth https://t.co/5wowBMiDXB"][".@lisamurkowski &amp; I have been working together for years to stand up for Indian Country - proud to have her as cosponsor of Savanna's Act"]["DACA recipients, like Gabriela, Jose, Anna &amp; Antonio who I met with today, are important members of our communities &amp; our economies https://t.co/nv40GWQNRB"]["Excited to meet @cj_wentz's dad &amp; family in my DC office. Could not be prouder of how Carson represents our state on the national stage https://t.co/KdxRPKCEYU"]["LIVE NOW: @IndianCommittee hearing on Savanna's Act-my bill to help combat epidemic of missing/murdered Native women https://t.co/V6mvfEUfWu https://t.co/850qaiCS8E"]["Imp. @WDAZTV story abt need 4 my bill to expand Amber Alert to Indian Co.-a critical step to protecting #NativeYouth https://t.co/blU0ZzymVZ"]["Watch @IndianCommittee hearing today at 1:30pmCT/2:30pmET on Savanna's Act- my bill to help combat epidemic of missing/murdered Native women https://t.co/BGb3eVBM4a"]["Thank you for your service to Arizona &amp; the nation, Senator Flake. Your strong work ethic &amp; determination to do what’s right will be missed."]["Great to see good friends &amp; North Dakotans, Chip &amp; Diane from Fargo, in Washington today https://t.co/bqNDtskjrk"]["Bipartisan bill would improve data to make ARC-CO payments, calculate payments in farmers' physical counties &amp; make payments more accurate"]["@SenJoniErnst Bill follows my work in 2015 to successfully push @USDA to recalculate ARC-CO payments for farmers who have land across multiple counties"]["Introduced bipartisan bill w/@SenJoniErnst to strengthen &amp; improve the ARC-CO program, which helps farmers when commodity prices fall https://t.co/oCjqdI6B3m"]["Shared my #MeToo story b/c we need a cultural shift to rid society of sexual harassment/assault. More @bistrib https://t.co/SdtTAQJ3Qt"]["These coins are for the many women fighting this disease, those who've overcome it, those we lost &amp; the families/friends impacted"]["As result of bipar. bill I intro. &amp; became law, @usmint unveiled design 4 new Commemorative Coin to raise funds/awareness for breast cancer https://t.co/k3msJViKKB"]["Talked w/experts @myUND last wk abt need for community solutions to support missing kids, combat #humantrafficking https://t.co/ZSXHPqGhKs"]["Congratulations to my staffers Cora &amp; Robert, and his wife Julie, for completing the @Marine_Marathon yesterday! #NDPride https://t.co/3dnldVGYVS"]["Guest co-hosted on @SquawkCNBC this morning &amp; talked about my efforts to ensure tax reform works for families, workers &amp; retirees. https://t.co/YTZpKeiA7m"]["Check out YouTube's Safety Center to learn about teen safety, resources, privacy, harassment &amp; more. #CyberSunday https://t.co/WZZb0S060J"]["Williston HS teacher makes sure her students have the computer skills they need to succeed #SelflessSaturday https://t.co/r5h57yvmxd"]["Grateful to join @UNDLawSchool @MissingKids panel on preventing child exploitation &amp; trafficking. We must do more to keep our kids safe. https://t.co/DSnIrdwbtO"]["Pushed @USDA to support understaffed FSA offices in ND to help farmers &amp; ranchers w/ drought needs - Read more @AP: https://t.co/9sdYXkEYMf"]["Regular mammograms = early detection = higher survival rates. Observe #NationalMammogramDay by making sure you get regularly checked https://t.co/7MZVnDrnbE"]["The budget that passed in the U.S. Senate would hurt North Dakotans. Here's my statement. https://t.co/mS1fup8IqL"]["@SecretarySonny As ND FSA offices are busy helping farmers get assistance from drought &amp; end of harvest, today I urged @USDA 2 again deploy additional staff https://t.co/A7e8xiUHS4"]["Appreciate @SecretarySonny heeding my call for jump teams to be deployed to FSA offices in the summer, but they left at end of fiscal year"]["Offered amendment to Senate budget bill-which will be voted on today- that would prohibit taxes from being raised on middle income Americans https://t.co/yGowazgkzc"]["Help break the record for the most ppl reading the same book on the same day to promote early literacy today! #ReadfortheRecord @Jumpstart https://t.co/SRrTjf21S9"]["Before Senate cmte hearing on her nom. to lead @DHSgov, I met w/Kirstjen Nielsen to discuss my priorities in ND &amp; key U.S. security chlgs https://t.co/VkCiQZLmzP"]["After I led bipartisan push last week, reports indicate EPA is backing off its plan to cut biofuel production levels https://t.co/jXcXuR9FUP"]["My bill to delay Health Insurance Tax would help ND #smallbiz invest in their employees &amp; company. Thanks @TrailKingInd for your support. https://t.co/j5pG3PDCFo"]["Unpredictability in health care costs is making it harder for ND #smallbiz to provide quality health ins. -this bill aims to bring certainty https://t.co/VvM6sTlCZv"]["Continues my efforts since 2013 to improve health reform law. Will cont. 2 offer to reduce costs,⬆️ affordability &amp; provide more flexibility"]["Health Insurance Tax could negatively impact ~71,000 #smallbiz &amp; nearly 200,000 workers in ND by increasing premiums &amp; losing access to care"]["Introduced bill to help reduce burden of Health Insurance Tax by delaying the tax for 2 years &amp; making it tax deductible going forward"]["At 10:15amCT, I'll be on @JoelKFGO 2 talk abt Savanna's Act-my bill 2 combat crisis of missing/murdered Native women https://t.co/KgUpe9xyCh"]["Bipartisan deal would fund cost sharing reduction payments for 2 yrs so families don’t see premiums go up &amp; don’t lose access to coverage"]["Helped work on #AlexanderMurray bipartisan deal with immediate fixes to make health care affordable and accessible for ND families https://t.co/ubCSdYMbMF"][".@SenateBanking, continued to hold folks at credit reporting systems accountable for actions that led to Equifax breach https://t.co/Rqltd9ZVBT"]["As talks on NAFTA continue, I remain focused on ND's farmers &amp; ranchers &amp; their need to export to survive. https://t.co/N9lbQTVgEi"]["Ready to get in the Halloween spirit? Check out this Ghost of ND website with ghost stories from across the state https://t.co/ERyV45AxDK"]["Great news - proud to have been working w/ this bipartisan group of senators on immediate fixes so health reform law works better 4 families https://t.co/d23dUAqxnz"][".@SenJohnMcCain is an inspirational public servant who has dedicated his life to our country - congrats on receiving the #LibertyMedal"]["Important story about local immigrants who risked their lives helping U.S. forces in Iraq &amp; now call Moorhead home https://t.co/T4tnc0G9sA"]["Led bipartisan letter w/36 senators to call on administration to keep its word &amp; ⬆️ its proposed 2018 #RFS RVOs https://t.co/0lA6fKYo7Q"]["Love being able to take a deep dive into the complex issues NDans care about on The Hotdish. Catch up here: https://t.co/felQRHUlbp https://t.co/TZYtQyhKPe"]["Great @gfherald piece on need to recruit/retain first responders. I'll keep fighting to help them keep protecting ND https://t.co/y5zL4AmGvS"]["Administration ending cost sharing reduction payments will add ~$200B to federal deficit over 10 years. More via @AP https://t.co/aDnaxZJshE https://t.co/Tjs2mGxbSj"]["Check out these steps to take when online shopping to keep your personal information protected. #CyberSunday https://t.co/2o1unvsISL"]["Admin. cutting fed. funds for cost sharing reduction payments will hurt the 47% of NDans on the marketplace who rely on it to afford care https://t.co/YofnEwFqjH"]["Great to see so many folks helping raise awareness abt suicide prevention in Valley City last wknd #SelflessSaturday https://t.co/EShhnBD6iQ"]["The budget resolution passed in the House of Rep. last wk would cut $10B from #FarmBill - like crop ins., trade progs &amp; more. Not good 4 ND https://t.co/44a17Byfkl"]["Great article on how @sesamestreet is helping children cope w/trauma - an issue I've also been working to address https://t.co/GOWmlmZA9q"]["Great to see ND featured for it's top-notch &amp; innovative work to advance UAS technology. https://t.co/pbaEESBv1P"]["Admin. cut federal funding for cost sharing reduction payments -which 47% of NDans on marketplace rely on to afford quality health insurance https://t.co/0BnUAB47A2"]["Read @AP on how ending cost sharing reduction payments - which the admin. just did - would hurt American families https://t.co/aDnaxZJshE https://t.co/Lo3Iezvepf"]["@USCBO We need bipar. solutions to make sure every family/child has access to the affordable health care they deserve. Anything less is just wrong"]["@USCBO I’ve also been working w/bipar. group of senators on immediate fixes to the health care system –&amp; these payments are at the top of our list."]["@USCBO Months ago, I cosponsored a bill to fix this problem so the administration couldn’t take away NDans’ health care with the stroke of a pen."]["@USCBO We already saw Medica leave the ND insurance market just based on the threat that these payments wouldn’t happen – now it’s a reality."][".@USCBO said this move will force premiums to jump by 20%, reduce access to care &amp; add almost $200B to the deficit https://t.co/aDnay013Ge"]["Cost sharing reduction payments - which 47% of NDans on marketplace use - are fed. funding that helps make health care affordable 4 families"]["Decision to cut off federal funding for cost sharing reduction payments is about a political win, not supporting American families"]["84% of Native women experience violence in their lifetime. Read @Rewire_News to learn abt my bill that aims to help https://t.co/SKUUdc0ALp"]["We must act fast to #ExtendCHIP &amp; make sure the 2,000+ ND kids who rely on the program can cont. to get the affordable health care they need https://t.co/BvN74BB1sG"]["Traveled across eastern ND in 2016 to get a jump start talking w/folks about the 2018 #FarmBill. #NationalFarmersDay https://t.co/oWDdNSq5QX"]["Read about my 2-day, 7 stop drought &amp; #FarmBill tour across western ND in August. #NationalFarmersDay https://t.co/rCMyfPLnY7 https://t.co/lb7vxeeMd7"]["Happy #NationalFarmersDay to the men &amp; women in ND who work hard to feed the world &amp; who I fight for everyday in the U.S. Senate https://t.co/r2X5uTrgq8"]["Happy Sauerkraut Day to all the folks celebrating in @WishekND &amp; congratulations on 92 years of food, family &amp; fun! https://t.co/7Nn7alFMcs"]["Estimated that 500,000 potentially eligible Native students are excluded from accessing federal resources - this bill would help fix that"]["Imp. step forward that my bipartisan bill that would help Native students access fed. resources they're eligible for passed in Senate cmte https://t.co/nW3dxHSlBJ"]["It's absolutely essential that we support &amp; empower young girls to reach their full potential today &amp; every day. #DayoftheGirl https://t.co/UbK2vEY0Kc"]["Spoke @MinneapolisFed Regional Economic Council about tax reform, ND's energy industry, health care, &amp; more https://t.co/sV0ZQ0fdiJ"]["Our country is built on principles of justice &amp; equality - no matter who you love. Proud to stand with ALL Americans. #NationalComingOutDay https://t.co/VfEgA2daC1"]["Urgent that we find a way to #extendCHIP - a program that 2,000+ ND kids rely on for affordable health care https://t.co/XoBzbLqriE"]["Thanks to pioneers like Ada Lovelace &amp; other brilliant #womeninSTEM for blazing a trail for girls to become next generation of leaders"]["Continued my tax reform listening tour in Bismarck &amp; Minot -check out @KXMB story to hear more about our discussion https://t.co/GhsegdCqS5"][".@GoIUPAT Local 82, I saw its top-notch training facility &amp; learned about its innovative strategies to recruit young folks into the Trades https://t.co/wCwkCUqH2L"]["Clean Power Plan rule was unworkable for ND. Need realistic energy solutions to lower emissions &amp; support energy/jobs. Here's my statement. https://t.co/keEaAQR6eO"]["Started by Farm Credit Service &amp; Agribank,  this fund will ensure the Domestic Violence Crisis Center can directly address community chlgs https://t.co/CawQKvlq1Y"]["Helped present the Rural Community Grant Fund to the Minot Area Domestic Violence Crisis Center to support the critical services it provides https://t.co/CmHNfPBOMN"]["Honored to join @SenHoeven to present Lynn Aas - who has committed so much to the US &amp; ND -w/French Legion of Honor for his service in WWII https://t.co/6wLEyWFmjD"]["At 4th stop on my tax reform listening tour in Minot, we talked abt need for tax reform to grow the economy while being fiscally responsible https://t.co/5UNm7IDWHb"]["Continued my listening tour on tax reform today in Bismarck where I heard about NDans' priorities &amp; concerns, &amp; outline my tax reform goals https://t.co/g1cfwj6utu"]["84% of Native women experience violence. This wk I spoke abt Savanna's Act, my bill that aims to address this crisis https://t.co/4H34rhZEEZ https://t.co/iKF9CkKSz8"]["I'm working hard for ND in the Sen. &amp; Center for Effective Lawmaking agrees-named me 1 of most effective US senators https://t.co/jXifV7dA6k"]["Visit this webpage on good digital parenting to learn how to teach your child how to stay safe online #CyberSunday https://t.co/cwWJuGqdMO"]["Deadline to apply to attend a U.S. Service Academy is October 13 – help spread the word &amp; info/app on my website https://t.co/nYNsD4ciWC https://t.co/edAwl1vpjF"]["Last week I introduced Savanna's Act to help combat the crisis of murdered &amp; missing Native women -more via @inforum https://t.co/Tfm7BKvfXw"]["Earl was in the right place at the right time 2 save a little girl &amp;his kindness didn't stop there #SelflessSaturday https://t.co/PvlEcTd5gw"]["@SenFranken Thanks for your support @SenFranken and helping raise awareness &amp; take action on such an important issue."]["Funding will help New Life Center, New Horizons Manor &amp;Pioneer Manor continue supporting NDans who struggle 2 find a safe place to call home"]["Helped present  total of $1.5M in federal funding to 3 projects that support safe, affordable, and sustainable housing in Fargo. https://t.co/ixvFARj4L3"]["Great day to be in Fargo highlighting the newly expanded VA Medical Center that provides top notch health care to ND’s #veterans https://t.co/0IvAiqWLUk"]["Read more in @bistrib abt how my bill - Savanna's Act -would help combat epidemic of missing &amp; murdered Native women https://t.co/oMmxiZjpW9"]["Urged IRS to end its enormous contract with Equifax - the company must be held accountable for info. breach &amp; alleged insider trading https://t.co/J0YwyuDlkU"]["Enjoyed chatting with my staffer Jared's family from Mandan today - always great to see NDans in our Nation's Capital https://t.co/kWzRcTF5rw"]["Great talk w/Bill Bauman from @Bismarck_Y about the incredible work its doing in child care, exercises for seniors &amp; more https://t.co/nDAq0bDbHp"]["NDans sent me to Washington to work for them - proud to be named one of most effective U.S. senators by the Center for Effective Lawmaking https://t.co/67T4Vi35VF"]["Long been working to combat crime, violence &amp; human trafficking in Indian Country -&amp; Savanna's Act &amp; sharing stories builds on those efforts https://t.co/8NRbIVIau4"]["Mona Lisa was kind, caring &amp; athletic. Her family has lived for 38 years without the closure &amp; justice they deserve https://t.co/9dTVx6evKj https://t.co/TXCrOkKg2k"]["Lakota was shy &amp; reserved, &amp; loved by many. She was robbed of her bright future &amp; her family deserves answers https://t.co/GkWc9AJLEw https://t.co/CkFt2qQ6OA"]["Stella from Belcourt lived an adventurous &amp; fearless life &amp;was loved by all who met her. Her family deserves justice https://t.co/gR6bkRzmXd https://t.co/gkslwI9pc5"]["Native women and girls face a crisis of exploitation, violence, &amp; murder. Hope that by sharing stories from families we can raise awareness https://t.co/cVokRmngjj"]["On floor of Senate, I'm sharing stories from families of missing &amp; murdered Native women to raise awareness. Watch: https://t.co/yF9UHWT0kC"]["Watch my Facebook Live today at 1:40pmCT/2:40pmET - I'll be on Senate floor sharing stories from families of missing &amp; murdered Native women https://t.co/rnRuvUn6z5"]["If you or someone you know in Indian Country is facing violence or gone missing - check out resources on my webpage: https://t.co/e2NlrAEQfV https://t.co/6crAkxE5DD"]["Native women &amp; girls face a crisis of exploitation, violence, and murder–we must take action to protect them as I’ve long been working to do https://t.co/83eEmhZ6x2"]["Bill is named for Savanna LaFontaine-Greywind, who was killed in August &amp; builds on bill I intro in June to create Amber alert in Indian Co."]["Today I introduced Savanna's Act - a bill that aims to combat the crisis of murdered &amp; missing Native women &amp; girls. https://t.co/9ZpqvOY1Vr"]["@SenateBanking Pressed him on why there was no protocol in place to protect info &amp; why execs were allowed to make million $ trades during this time"]["~248,000 ND families could be affected by Equifax breach - @SenateBanking I pressed its former CEO on steps its taking protect consumers https://t.co/IL6HkHm24s"]["@JeffFlake @CustomsBorder This bill builds on another bill I introduced – which became law – to secure the Northern Border and keep NDans safe"]["@JeffFlake @CustomsBorder .@CustomsBorder has ~3,000 vacancies across the country. My CBP HiRe Act w/@JeffFlake works to strengthen our borders w/dedicated workforce"]["Good step that my bipartisan bill w/@JeffFlake to alleviate chlgs @CustomsBorder to hire/retain a qualified workforce passed in Senate Cmte https://t.co/N0W5kciLP3"]["Proud day to be a @myUND alum - 16 former @UNDmhockey players are on opening-night @NHL rosters. #UNDProud https://t.co/tNZryfGd0Q https://t.co/2RMnJKIoC7"]["Talked abOUt need for my bipartisan bill that would promote carbon capture by extending 45Q tax credit w/Cloud Peak Energy. #energyFUTURE https://t.co/9LaMX8g8mq"]["On @PowerLunch I talked about how @SenateBanking is working to make sure consumers are protected in wake of Wells Fargo &amp; Equifax scandals https://t.co/fhI0e60h8o"]["Tune in to @CNBC at 1:30pmET/12:30pmCT - I'll be on to talk about my work on @SenateBanking to hold Wells Fargo &amp; Equifax accountable"]["As breast cancer survivor, October is always special. Thanks to orgs. like @ndcancertalk who help fight this disease &amp; support families https://t.co/GDmOTznElE"]["@IBM Our bipartisan bill - which would make sure those involved in these horrific crimes pay the price - passed unanimously in the Senate last wk"]["CHIP is critical for the 2,000+ ND children who rely on it for health care &amp; ND could be out of funding for the program as early as April https://t.co/bw5C4dP1qA"]["NDans rely on mail delivery &amp; I'm working to improve mail delivery/service - met with @USPS Postmaster General to talk abt chlgs in ND https://t.co/BVEYJXRAWi"]["@SenateBanking @WellsFargo Today's hearing dove into what @WellsFargo is doing after being caught w/3.5M+ fake accounts &amp; using arbitration to prevent ppl from justice"][".@SenateBanking, pressed @WellsFargo on how it's working to clean up the culture that led to widespread, criminal behavior &amp; restore trust https://t.co/FM1NS8FizS"]["Met with ND Superintendent Kirsten Baesler to talk about the best strategies to make sure all ND kids have access to quality education https://t.co/4T43bQnAbx"]["Here's what I think would happen if there was a little more ND nice at North Shore High. #MeanGirlsDay https://t.co/fF48NnFzqo"]["Read my op-ed in @gfherald abt need to address urgent threat from North Korea w/tough, smart nat. security strategy https://t.co/1HXemJgz40"]["Wishing for a full recovery for Andrew Gudmunson, a former UND baseball and football player https://t.co/ABaFUxGRwT"]["If you are trying to locate a loved one in Las Vegas, please call: 1-866-535-5654"]["Thinking of the victims in Las Vegas &amp; their families and friends. Thank you to law enforcement 4 heroic actions during a horrible situation"]["Incredible story about Pastor Shipman in Crosby donating a kidney to Noah Knudson #SelflessSaturday https://t.co/JYGFrE6ygy"]["October 13 is the deadline to apply to attend a US Service Academy - visit my website for more details &amp; application https://t.co/nYNsD4tUlc https://t.co/aSI6i5H3OL"]["Long been working on reforms to make health care work better. Most recently working w/ group of Republican &amp; Democratic sens. Learn more: https://t.co/lW6zCXvzUQ"]["Amazing story about recovery and a new home for Danielle John &amp; her family. Thanks to @KwallevandWDAY for telling this important story. https://t.co/pEMGLb1hHU"]["ICYMI—Global anti-human trafficking advocate @cindymccain &amp; I in @IndianCommittee: Stopping #humantrafficking \"has to be our top priority.\" https://t.co/pMhO4rjid6"]["Today I voted 2 extend FAA funding 4 ND's growing economy&amp; I’ll keep fighting 4 the lasting solutions &amp;strong Essential Air Service ND needs"]["China must act w/ the same urgency as the U.S. to push for a denuclearized North Korea and peace in the region. https://t.co/lWnMPQpZwt"]["Great news Judge Erickson was approved by the US Senate—he’s served ND well &amp; will help bring justice to the ppl of the 8th Circuit"]["Great to see General Atomics innovating and setting records in ND with UAS https://t.co/UoZya6iy8Q"]["Listen to The Hotdish to gain better understanding of US-North Korea relationship &amp; how to deal with threat https://t.co/WiPoXfJr8a"]["Met with the Sisseton Wahpeton Oyate Tribe in DC about the importance of improving criminal justice system to better serve Indian Country https://t.co/2PRntTvwc5"]["BREAKING: @CBP's AMO to open pilot training program 4 @myUND aerospace students at @319ABW in Nov! Great opportunity 2 build jobs here in ND"]["Spread the word-deadline to apply to attend a U.S. Service Academy is October 13. Check out my website for info/app https://t.co/nYNsD4tUlc https://t.co/e6w7vaTTpx"]["Chatted w/ ND reps from @CHSTalentScout about supporting the hard working folks in farming, ranching, and manufacturing https://t.co/MLyEj3WJgI"]["Impt story from @PatSpringer with @inforum on how NDans agree Graham-Cassidy health care bill would be bad for ND: https://t.co/BwSdD6CJFD"]["Jessica is an outstanding mother to her 5 adoptive children. Great to have her honored in DC at the @CCAInstitute Angel in Adoption Gala https://t.co/wSdWekwPTR"]["North Korea poses the most urgent nat. security threat currently facing the US - tune into The Hotdish to learn more https://t.co/WiPoXg11ZI https://t.co/PSMV1cxuOA"]["Met with NDans with @wheatworld to talk about how we can maintain &amp; strengthen provisions they rely on in the 2018 #FarmBill https://t.co/62NEfJaelp"]["#GrahamCassidy would have been bad for ND&amp; made health care less accessible/affordable. Instead need bipartisan reforms. Here's my statement https://t.co/Jbg7wZqoVy"]["Talked about tax reform, infrastructure investment, my work to #CutRedTape &amp; more with folks from the Association of General Contractors ND https://t.co/gCiCBOfAdY"]["Met w/@NDAREC to talk about my bipartisan bill to promote carbon capture &amp; ensure that we have a true #alloftheabove energy strategy https://t.co/lUF3BsAIgc"]["Met with leaders from @StPaulUSACE to discuss the progress of projects in North Dakota https://t.co/gCHFGfY7Mt"]["Great to meet ND Principal of the Year, Kristi Brandt from Valley City, to thank her for her hard work &amp; commitment to educating ND's youth https://t.co/I8HHIBFsnz"]["Always enjoy mtg w/Dr. Tami DeCoteau -today she was in DC on behalf of @APA to discuss encouraging public service thru loan forgiveness https://t.co/vKpNV1GcrN"]["Had productive discussion today w/@319ABW Commander Col. Spencer about strengthening the base's role in protecting our national security"]["Live now: I'm on floor of Senate talking abt how #GrahamCassidy would have hurt Indian Co. by slashing Medicaid https://t.co/LeQ1fcWg48"]["Thanks @SandyButtweiler for your 35 years of radio @970WDAY &amp; dedication to the Fargo-Moorhead region"]["During my newest episode, I interview @snydersas, a lead expert on Korea @CFR_org &amp; @micheleflournoy, co-founder &amp; CEO of @CNASdc"]["New on The Hotdish - I talk with experts about history of US-North Korea relations &amp; options to contain the threat https://t.co/WiPoXfJr8a https://t.co/oH7tZTO2eJ"][".@USCBO report on #GrahamCassidy reinforces what many other reports have said: bill is bad for American families https://t.co/e7sZOpUtr2"]["The Watford City Post Office is officially open for business - strengthening @USPS' commitment to improving mail delivery/service in ND https://t.co/sM7MBaTjcN"]["36,000+ NDans rely on community health centers for affordable &amp; comprehensive care. #GrahamCassidy would put those facilities in jeopardy https://t.co/hed0SmyLy2"]["Urged Admin. to fill vacancies that work w/East Asia &amp; Pacific region &amp; would provide stable leadership in our efforts to pursue diplomacy"][".@dickinsonpress highlights severe cuts to fed. prog that helped some of 21,000 NDans who signed up 4 health care https://t.co/V3z5URQl0k"]["Reminder: Deadline to apply to attend a U.S. Service Academy is October 13 – visit my website for more details &amp; app https://t.co/nYNsD4ciWC https://t.co/dC0mUo6uGK"]["Don't just listen to me, @AARP is one of countless health care experts, organizations, &amp; advocates that strongly opposes #GrahamCassidy https://t.co/A6BHh8Fwyg"]["Always think before you share online to make sure you're creating best version of your story. #CyberSunday https://t.co/C8zFhw22zL"]["First weekend of fall wouldn't be complete without some @NDSUfootball - good luck today Bison!"]["We need a bipartisan solution to solve our health care challenges - which I've been working on. I hope we can continue those discussions"]["#GrahamCassidy would hurt ND families. Folks like Ranae made their voices heard in last GOP health care debate &amp; we must do the same now https://t.co/DD6yttwkjV"][".@FargoPolice officer was caught doing good deed - thanks to all ND law enforcement for your work. #SelflessSaturday https://t.co/FHDeOcHhDx"]["Everything the Restemayers from West Fargo were concerned abt in last GOP health care bill are still in jeopardy under #GrahamCassidy https://t.co/HCdSwLggQI"]["Stop 2 of my listening tour on tax reform was in Grand Forks where we focused on reforms to better support workers, families, &amp; retirees https://t.co/cATtlI8QWc"]["Letter from @NDHospitalAssn outlines why it opposes #GrahamCassidy health care bill. Read it here: https://t.co/DlH6SVbM5q"]["Agree. I’ve been mtg w/folks on both sides of aisle &amp; experts to talk abt reforms to make health reform law work better. Hope talks now cont https://t.co/LlhPculnhJ"]["Want to hear from NDans abt how #GrahamCassidy bill would impact you &amp; your families. Call/email my office &amp; make sure your voice is heard https://t.co/tt33w4BoHX"]["Had a wonderful time mtg w/folks &amp; touring @PrairieRootsND - a full-service co-op grocery store that is helping build a healthy community https://t.co/DTvgxCj7nh"]["Called on fed. agencies to train empl in Indian Co. to spot/stop/respond to #humantrafficking &amp; domestic violence https://t.co/2HpoXy9tAd"]["You can't call it a health care bill if it raises costs, rips away coverage from thousands &amp; hurts families. RT if you agree. #GrahamCassidy"]["@deanatch @AtchCos Appreciate your input as we begin the debate on tax reform."]["@CareerFM Thanks for having us this morning to talk about this critical issue."]["Excited to be spending today in Fargo &amp; Grand Forks talking about tax reform &amp; more. Follow along via @snapchat https://t.co/Aomxf6631p"]["Launched my listening tour on tax reform in Fargo w/ #smallbiz owners to hear abt NDan' priorities &amp; concerns in upcoming tax reform debate https://t.co/g5vWSWREt3"]["Concerns Matthew from Williston had this summer about GOP health care bill are threatened again in #GrahamCassidy. We must stop this bill https://t.co/OhCJ6QNkrK"]["Toured ND veterans home in Lisbon to see how new wood workshop is helping local vets thru art therapy &amp; thank folks for their service https://t.co/ScpBoK4Gxo"]["#GrahamCassidy bill will rip away health care from thousands of NDans - call my office &amp; share how it would impact you &amp; your family https://t.co/Nvcb8L6zeI"]["@BobcatCompany @MontanaDakota Project is example of the ingenuity/pragmatism of NDans &amp; ND based companies – they saw a problem &amp; brought forward realistic solutions"]["Yet again, major health care professional organizations &amp; experts strongly oppose the GOP health care bill. #GrahamCassidy https://t.co/LRJS2dAyNR"]["Everyone should have access to affordable health care, but #GrahamCassidy would double no. of uninsured NDans by 2019 (via @urbaninstitute)"]["We should be working to make health care MORE affordable, but #GrahamCassidy bill would rip away support that folks need to afford coverage https://t.co/Hv2L0aPma3"]["@SenDeanHeller Now @SenDeanHeller &amp; I are urging SEC to act on that momentum by quickly appointing someone to serve in that role https://t.co/apyJT753kW"]["My bipar. bill w/@SenDeanHeller to give #smallbiz &amp; startups a seat at the table when the SEC creates rules was signed into law last year"]["ICYMI - intro. bill to incentivize more folks to serve as local volunteer firefighters. Read more in @bistrib https://t.co/FejvDVBHpu"]["Via @AARP, #GrahamCassidy bill could cut $5.5 billion from Medicaid in ND by 2036 - hurting the 90,000+ folks who rely on it"]["Talked about the importance of investing in a true #alloftheabove energy strategy w/@ENERGY Assistant Sec. for Fossil Energy nom. Winberg https://t.co/3hWFE4rVHX"]["Met w/folks from the National Bison Association today to talk about chlgs &amp; issues in the bison farming &amp; ranching industry https://t.co/72SHbVVjQE"]["Read abt how the train derailment near Casselton in December 2013 spurred my work to protect/support 1st responders https://t.co/u6nId4UtrT"]["This bill builds on my years of work to support 1st responders, including my #RESPONSEAct that was signed into law last year https://t.co/v9hYSc72ui"]["The Valley City Fire Chief said my bill would help provide a path 4 younger generations to afford to invest in homes in our communities https://t.co/TGWWIYlD72"]["Dickinson Fire Chief Sivak started as a vol. firefighter in 1978 to help others &amp; now he sees how my bill would give others that opportunity https://t.co/YRGfYVBN6u"]["W/projected statewide population increase, clear we need more affordable housing options &amp; robust vol. firefighting force to protect NDans https://t.co/HzJQx3R8ot"]["My bill would open up more federal housing programs to volunteer 1st responders &amp; help keep them in the force by being able to afford homes https://t.co/xSG71AJJmZ"]["96% of fire depts in ND are volunteer, but as avg age of volunteers ⬆️ &amp; avg number of years served ⬇️, local depts are struggling https://t.co/mwjN73Ie0i"]["Building on years of work, today I intro bill that would open up new housing opportunities to help recruit/retain volunteer 1st responders https://t.co/8DC6q0LaG1"]["Welcomed Jessica from Jamestown as she begins her semester in Washington serving in the U.S. Senate as a Page working on the Senate floor https://t.co/f3kgDXi1HK"]["Appreciate Yvonne Ambrose stopping by my office. She testified @SenateCommerce today abt losing her daughter from #humantrafficking https://t.co/rWEHseiODh"]["Joined @amyklobuchar to introduce commonsense legislation to promote &amp; encourage job training &amp; skill development for students &amp; workers https://t.co/Ipo4lRDb3H"]["ICYMI – had a great talk w/my good friend @SenatorCollins &amp; @AliABCNews about working across the aisle in Congress https://t.co/ia7ZomSUev"][".@clairecmc &amp; I called on @USPS to remedy lack of training rqmts that led to inaccurate reporting of ~2B pieces of delayed mail in 1 yr https://t.co/NMXLfDDeuH"]["Stories like Yvonne's-who lost her daughter due to online sex trafficking-reinforce why we need bill I helped intro to hold websites acctble https://t.co/DkaC8Ypt8z"]["Great discussion w/@CovHousePrez from @CovenantHouse about its critical work to study &amp; combat youth homelessness &amp; #humantrafficking https://t.co/9EHnH6kk6t"]["My provisions that were included will help #vets join the workforce, boost UAS research, &amp; defend against North Korea threat"]["Successfully included 3 provisions in NDAA - which passed in the Senate - that would protect our national security &amp; support ND"]["Watch now as @SenateCommerce talks abt bill I helped intro to stop #humantrafficking online &amp; hold websites acctble https://t.co/HZq02om21h"]["Stopping online #humantrafficking will take comprehensive strategy from all major players, our children deserve it https://t.co/xhsOUGnksl"][".@SenateCommerce examines bill I helped intro that would hold websites like Backpage acctble for #humantrafficking https://t.co/X118OHJU13"]["Live now- @SenatorCollins &amp; I are @TedsBULLETIN talking abt how we're able 2 work across the aisle 2 get things done https://t.co/yLs6025lZT"]["We agree on a lot &amp; I’m hopeful we can come together to make health care more affordable/accessible for families-but #GrahamCassidy isn't it"]["Over past few months, I've met w/GOP &amp; Dem senators, governors, insurance commissioners, patients &amp; insurers to talk about reforms"]["For years, I’ve been offering reasonable reforms to make the current health reform law work better for ND families – which I'm still doing"]["#GrahamCassidy health care bill would hurt ND families &amp; rural communities by ripping away health care 4 many – just like the last GOP bill https://t.co/Obvce29YVv"]["Looking at good schools, a good economy &amp; good neighbors, @MONEY ranked Dickinson as no. 6 place to live in America: https://t.co/Bci6iNhRL0"]["Proud to celebrate 70 years of @usairforce &amp; grateful for its continued support &amp; commitment to @TeamMinot &amp; @319ABW. #AFBday"]["My office worked w/Andres from Fargo to get his TN visa updated - reach out if you have issues my offices can help with. #HeidiHelps https://t.co/UViNLMnZZw"]["Make sure you have a strong password - that means 8+ characters, mix numbers, symbols, &amp; letters, &amp; change it for each site #CyberSunday"]["Important that folks do all they can to stay safe online - so each #CyberSunday, I'll share a helpful internet safety tip"]["Learn about the lives of the brave NDans who gave their lives during Vietnam War on my interactive webpage: https://t.co/d0cG6s4zx1"]["Great news @prairiepublic was chosen to host @KenBurns #VietnamWarPBS on Sept. 19 on PBS to deepen our understanding of Vietnam War"]["Two local moms are doing their part to help reduce the stigma of Down Syndrome from @gfherald: https://t.co/9dTpW5TQgT #SelflessSaturday"]["Heartened to hear directly from @AFGSC_CC that he is focused on keeping @TeamMinot &amp; @319ABW strong &amp; modernizing assets like B-52s https://t.co/ISLqToA2bg"]["Check out my @snapchat for 5 easy ways to make sure you &amp; your information are safe online https://t.co/2IUrXgpU8I"]["Remembering &amp; honoring the brave men &amp; women who sacrificed for our country &amp; those who never returned home. #POWMIARecognitionDay https://t.co/N1O5HSPCdy"]["Enjoyed chatting with Abby &amp; Carson Miller and Darian Webbels - young North Dakotans from Wahpeton https://t.co/0y4DN4muD9"]["Great to catch up with cousin, @mnsustygirl, &amp; talk about issues with organic grain imports https://t.co/nkLfkvFXCe"]["Chatted w/folks from Auto Dealers Assn of ND about the need for commonsense, bipartisan tax reform &amp; other issues affecting the industry https://t.co/ZrjkvNwc22"]["#Alloftheabove energy policy includes support &amp; certainty for ethanol industry - honored to receive @GrowthEnergy's #FuelingGrowth award https://t.co/o6kDvHfiYr"]["Judge Erickson has shown an understanding of Indian law &amp; respect for tribal sovereignty &amp; I was proud to introduce him as nominee in July https://t.co/uszhcDVKmp"]["Great news Judge Ralph Erickson's nomination to serve on Court of Appeals for the 8th District passed thru Senate Cmte today"]["Enjoyed chatting w/John Hanson from ND VFW &amp; his grandkids about how important it is to support &amp; honor our #veterans https://t.co/FlIpBxVwvD"]["@washingtonpost My bill to extend/expand 45Q is unique example of how you can find common ground on a normally divisive issue if you work across the aisle"][".@washingtonpost highlights how my bipartisan bill to promote carbon capture has a real possibility of becoming law https://t.co/V3Wd1fqyjA"]["Always important to make sure your safe online. Check out these cybersecurity resources on my website: https://t.co/J0sIbhOMLE"]["Joined bipar. call 4 investigations into what senior Equifax officials knew about cyber breach &amp; when - they must be held accountable"]["Tune in tmrw at 8amCT/9amET as @SenCapito @SenWhitehouse @SenJohnBarrasso &amp; I discuss our broad bipartisan bill to promote carbon capture https://t.co/1FMigoOno5"]["Leader @nrgenergy reinforced how my bill to promote carbon capture would level playing field btwn CCUS &amp; other low-carbon tech. #FUTUREAct https://t.co/g8TOIGYEcO"][".@CarbonWrangler reinforced how investments in CCUS tech. thru my bill to extend 45Q would help create/sustain jobs &amp; communities #FUTUREAct https://t.co/AVsifF3eMS"]["At Senate hearing, bipar. senators - including @SenJohnBarrasso, &amp; experts highlighted need for my bill to promote carbon capture #FUTUREAct https://t.co/mYvSayEjDJ"]["Appreciate your participation &amp; input as we look for ways to make commonsense improvements. https://t.co/GDnTddW3LW"]["Encouraging to have @DeptofDefense Sec. Mattis @TeamMinot today to reinforce his commitment to the nuclear triad &amp; ND's defense missions https://t.co/OuQoUlEOBm"]["Spread the word - @AARP_ND is holding free technology workshops for folks 50yrs+. Click here for info &amp; to register: https://t.co/5SyvntDzA8 https://t.co/tmIxV3wolt"]["Happy 99th Birthday to one of the best &amp; kindest North Dakotans, Grace Link. ND wouldn't be the same without you. https://t.co/T98xHUsw9J"]["Joined a bipartisan dinner at the White House with the president to discuss tax reform – here’s my statement. https://t.co/u8HGVP1e2s"]["@319ABW This decision shows that key DHS leaders understand the imp. of the AMO mission @319ABW &amp; how it improves security across all our borders."]["After putting pressure on DHS to keep Air &amp; Marine Operations @319ABW, today it heeded my call &amp; will move to renovated facility on base"]["Thanks Credit Union Assn of Dakotas for stopping in to talk abt reg relief, housing finance reform &amp; other issues to support credit unions https://t.co/szHlT12Ffq"]["Honored to receive @NFUDC Golden Triangle award for 5th yr &amp; to talk w/folks about 2018 #FarmBill &amp; needed support to get thru drought https://t.co/ourCoTYL2h"]["Have held 6 mtgs across ND with local leaders to discuss combatting opioid epidemic w/comprehensive strategies https://t.co/CGncEqdNjz"]["W/senators, patients &amp; doctors, discussed need for physicians to be first line of defense to combat opioid crisis https://t.co/ImMU8rZZ1a"]["Great news Senate unanimously passed my bipartisan bill w/@SenDeanHeller to help remove roadblocks to VC investments in rural #smallbiz https://t.co/vaQLvHaLqc"]["Great to speak @NCAI1944 Unity Days to talk about the 3 foundational pieces of #IndianCountry - quality health care, housing &amp; education https://t.co/GCSXfH4GNU"]["@NDFarmersUnion @SenJohnHoeven Looking forward to seeing you all to talk about the 2018 #FarmBill. #NFUflyin17"]["According to ND AG, 248,000+ NDans could be affected by Equifax security breach. Here's how to check &amp; what to do: https://t.co/9TVRt4de1Y"]["Events like #FargoUnited help create trust &amp; build positive relationships - thanks @FargoPolice for your commitment to inclusion &amp; safety"]["After 9/11, we stood together for our country. Now, 16 yrs later, too often division wins out. Today is a reminder that it doesn't have to."]["Helped push 4 law in 2015 that provides medical support to survivors/1st responders like Raymond Pfeifer who I was honored to meet https://t.co/2LAn2XVwNq"]["#NeverForget the horrific events on #September11 &amp; the brave men, women &amp; first responders who ran toward the danger to save others."]["Congratulations @MissAmericaND on being crowned Miss America! #NDPride"]["If you have issues with the VA like Jayne from Grand Forks did, reach out to my office &amp; we'll do everything we can to help. #HeidiHelps https://t.co/35YLeZVdrv"]["Mark your calendars &amp; make sure you and your family have health insurance - open enrollment for 2018 is November 1 – December 15."]["Spoke at ribbon cutting for Mule Barn at Bagg Bonanza Farm in Mooreton today to highlight role of bonanza farms in shaping ND https://t.co/BrXYnfuvrZ"]["As all you sportsmen know, fall = the start of hunting season. Check out ND Game &amp; Fish for info on opening days https://t.co/ilZxnBKXIS"]["ICYMI - earlier this week @CNN featured students @TeamMinot who found unique way to help Hurricane Harvey victims. #SelflessSaturday https://t.co/NCpiEtPsSt"]["It's #PotatoBowl game day in Grand Forks! Hope folks have a great time at the parade &amp; activities, &amp; good luck  @UNDfootball! #UNDProud"]["Always great to join folks @UnitedTribesND Powwow Grand Entry to honor the Native American culture and history https://t.co/LiIb9c2EPY"]["Randy from Dickinson is 1 of the 14,000+ NDans my office has helped since 2013 - here's his story. #HeidiHelps https://t.co/D9Ok2CxzaI"]["@burgessev @TomCottonAR @SteveDaines @SenThomTillis @SenBobCorker The dad haircut looks good on you."]["@Google Everyone can benefit from the ABC's of online safety - check out my webpage w/more @Google tips to stay safe online https://t.co/Sr0axV0g9A https://t.co/5Qthp6AFCT"]["@Google Just as we teach our kids not to open the door for strangers, all kids should learn similar lessons that apply to them online."]["Had a great time at Simle Middle School in Bismarck w/@Google &amp; 1,000+ students talking about how to stay safe online https://t.co/xoaJ1o2nqn"]["Glad Paula from Casselton reached out to my office when her son lost his ID/money in Peru &amp; needed to get home-here's her story #HeidiHelps https://t.co/0yqbgbX5ON"]["@SenateBanking Consponsored bill that Congress passed to impose sanctions on North Korea &amp; I'll keep pushing for tough, smart national security policies"]["Hope that by sharing stories about how my office has helped NDans, like Billie from Dickinson, others will reach out for help. #HeidiHelps https://t.co/1arwcY5ll8"]["Hear from Shelley in Halliday abt how my office helped re-open the local post office-a service that folks in rural areas rely on #HeidiHelps https://t.co/eXK3HXnl1X"]["My office can help NDans resolve issues w/passports - which we did for Leone Linseth's husband in Dickinson. Here's her story. #HeidiHelps https://t.co/tOtnSbTVVc"]["Great to meet with folks from Fargo, Molly &amp; Brooke. https://t.co/v2QJr4sl73"]["Here's how my office helped Jayne from Grand Forks schedule a doctors appt. for her dad - an 82 yr old #veteran - close to home #HeidiHelps https://t.co/X1ipZfUzL3"]["As Congress continues discussion on disaster relief, I'm fighting to make sure Congress helps NDans facing droughts, fires &amp; more"]["Voted w/majority of Senate 4 Hurricane Harvey disaster relief, to fund gov't &amp; extend debt limit for 3 months- good Senate is taking action https://t.co/h9RNTqJrbD"]["@usairforce Since @usairforce Sec. Wilson was a nominee, I've urged her to visit ND's bases. Glad she got up-close look @TeamMinot today"]["Called @usairforce Sec. Wilson today to welcome her to ND &amp; thank her for keeping her commitment to visit ND's great Air Force bases https://t.co/4eMfFUUuzk"]["Since 2013, my office has helped 14,000+ NDans resolve issues. Hope that by sharing some stories, others w/similar issues will reach out"]["Launched #HeidiHelps videos today to highlight how my office has helped folks like Christine from Jamestown resolve issues w/fed. agencies https://t.co/eJ8foLdvmD"][".@thehill opinion piece reinforces need for bipartisan bill I helped intro. to crack down on online sex trafficking https://t.co/J5WL4tYtXh"]["Today the president visited North Dakota to talk about tax reform – here’s my statement. https://t.co/U5iLr3CwkJ"]["Thanks to ND law enforcement for the great work they did today to keep folks safe &amp; make sure everything ran smoothly."]["Still working on my selfie skills but wanted to make sure I got a picture w/the hardworking NDans at Andeavor refinery in Mandan https://t.co/TshSIegmna"]["Great @CNN story about how elementary students @TeamMinot are doing their part to help the victims of Hurricane Harvey. #NDProud https://t.co/6dDpfiIuJf"]["@axios Biggest increases in health care premiums in market cover ~7% of Americans-read @axios on where folks get healthcare https://t.co/eLwO2XR0lk https://t.co/FH80Cpvll4"]["Impt discussion today. Joined over ¼ of U.S. Senate to discuss immediate steps to improve health care for families &amp; make it more affordable https://t.co/We8Ps90rvc"]["Check out @axios on where Congress can focus immediate efforts 2 stabilize Marketplace &amp; make health care affordable https://t.co/pD2iMRs44x"]["@aprilbaumsaway Since 2013, I've been on the front lines to bring #humantrafficking out of the shadows. We've made progress, but there's still a lot to do"]["Great article by @aprilbaumsaway on how ND has started 2 better track, identify, &amp; help victims of #humantrafficking https://t.co/pWggJrx989"]["Clear our immigration system is broken but ending #DACA would hurt US economy &amp; those who only know US as home.More: https://t.co/pmUXfBlLMZ"]["This #LaborDay, let's thank the hardworking folks in ND &amp; across the country who make America what it is today. Thanks for all that you do. https://t.co/rWReNErk06"]["Sept. 11 in Dickinson, @DeptVetAffairs is holding a free open house &amp; resource fair for area #veterans - spread the word! https://t.co/FCLiYIGXC5"]["Spread the word: Brats with the Brave is this Tuesday,  Sept. 5 at new Military Service Center location in Bismarck. Hope folks can attend! https://t.co/h6tE45hX6G"]["Great story about a stranger going above &amp; beyond to make someone's dying wish come true. #SelflessSaturday https://t.co/mt9u2F6pNM"]["Exciting to see @AmericanLegion elect its first female National Commander, Denise Rohan from WI. Good luck, Denise!  https://t.co/XIfcAVIPqm"]["As Hurricane Harvey continues to displace thousands TX, check out @fema for information on how you can help: https://t.co/uA9FVwqSjl"]["Here's my statement on the president's anticipated visit to North Dakota next week to discuss his tax reform plan https://t.co/6ZEvQhoQb9"]["Encourage #veterans in the Dickinson area to get assistance &amp; learn about resources &amp; support at open house &amp; resource fair on Sept. 11 https://t.co/2izEeaIzYG"]["Great news @SouthernCompany will move Vogtle fwd. Let’s get moving on the certainty the project needs to boost nat'l security, reduce carbon"]["Hope folks can join @NDNationalGuard on Sept. 5 to celebrate the new Military Service Center's location in Bismarck at Brats with the Brave https://t.co/l867FNPZJC"]["Opioid abuse is tearing ND communities apart. We must come together, remove stigma, &amp; provide prevention/treatment. #OverdoseAwarenessDay"]["Great to see Fargo featured in @EngineOrg for #StartupsEverywhere to highlight the city's thriving startup industry https://t.co/DHp3b90U9s"]["Happy Birthday @MikeMcFeelyWDAY &amp; thanks for sharing your insight on everything from politics to sports."]["As North Dakotans our hearts go out to all Texans impacted by #Harvey. God bless emergency responders &amp; volunteers working for their safety."]["#SelflessSaturday shout out to Joshua Hefta – a rural mail carrier in Minto who I presented Hero Award to 4 helping save an elderly customer https://t.co/mGC0jCh4Ih"]["Great meeting w/ Turtle Mountain Tribal Council on important activities both in Indian Country &amp; DC https://t.co/C5mY4SZ3G7"]["&amp; I introduced a strong bill to help mitigate the detrimental impact exposure to trauma could have on kids, especially in Indian Country"]["But we can change this. Programs like Generation Art Space are taking important steps to help Native children overcome challenges they faced"]["Suicide is the 2nd leading cause of death for Native youth &amp; 22% experience post-traumatic stress–same rate as newly returning veterans"]["Children who experience 6 or more traumatic events are 30-times more likely to attempt suicide"]["Kids who have 4+ traumatic experiences have 3X the lifetime risk of heart disease &amp; lung cancer and a 20-year difference in life expectancy"]["Trauma is the negative impact stressful events like violence, abuse, or neglect can have on kids. It can lead to lifelong harmful effects"]["Visited Generation Art Space on Turtle Mountain today which helps children on reservations overcome traumatic experiences &amp; heal through art"]["Touring Seven Stone Center for Behavior Health &amp; Wellness discussing how we can best address trauma in Native communities https://t.co/vxykN8zGFu"]["Turtle Mountain Community College is a great example of how a tribal college is helping to prepare students &amp; protect Indian County Heritage https://t.co/cPvpTmLqLW"]["Good discussion on education challenges and opportunities at Turtle Mountain with education leaders today in Belcourt https://t.co/IGl8JfJAQd"]["@NWBC says # of women-owned business in ND jumped by 33+% since 2007 and is now at more than 20,000 businesses #Solutions4HerBiz"]["It’s hard to keep a good woman down when she has a good idea-Joined many women entrepreneurs from ND-Let's encourage more #Solutions4HerBiz https://t.co/kALjkwjFjx"]["Great chat with @EarthKind CEO @KariWBlock &amp; @NWBC about the expanding number of women-owned businesses in ND #Solutions4HerBiz https://t.co/VhFRlMHm3u"]["Great meeting w/ @bismanchamber about need for smart reg reform and energy policy that will help ND’s economy thrive https://t.co/Xl11V7btRA"]["2017 Champion of Health Care Innovation Award from American Life Sciences Innovation Council-must continue work improving NDans health care https://t.co/6uRQ20EFe6"]["Met w/ North Dakota Council of Educational leaders about the importance of Medicaid, impact aid, and rural education priorities https://t.co/McjmzUull3"]["Women play a critical role in ND ag – glad they’re getting some of the recognition they deserve. https://t.co/FbFUTUbBWx"]["Analysis required by my bill that became law to assess N. Border led to new DHS strategy - more via @aprilbaumsaway https://t.co/0jQwpgh108"]["Didn't have glasses for the eclipse so I watched the old-fashioned way w/two pieces of paper -see the tiny crescent moon? #SolarEclipse2017 https://t.co/64E9U0STSP"]["ICYMI - did 2-day, 7 stop drought &amp; Farm Bill tour in western ND to make sure we're best supporting our producers https://t.co/zO1Dfwatjc https://t.co/hd14DhgC0a"]["ICYMI - shared my journey from growing up in Mantador to serving ND in the US Senate w/@rcnewsmonitor. Read it here: https://t.co/JVTdO22q31"]["Learn abt role of refugees/immigrants in our communities w/a community leader &amp; @FargoPolice Cheif on 'The Hotdish' https://t.co/B1XvLwvTkz"]["Great @jamestownsun story about how the folks who go out of their way for others are true heroes #SelflessSaturday https://t.co/IAhvDcsvHO"]["@HomesForOurTrps Read more about Eric Marts, my guest to the 2014 State of the Union. He's an amazing guy. https://t.co/xhi84ams2z"]["Incredible day celebrating my good friend &amp; local blind vet Eric Marts' new home made possible by @HomesForOurTrps. https://t.co/mUfcUxYjTY"]["During my drought &amp; Farm Bill tour last wk, I heard firsthand what we need to maintain &amp; strengthen the Farm Bill https://t.co/zO1DfvSRUC https://t.co/QEb81bTQyL"]["Toured new @SanfordHealth hospital in Fargo today to see how its state-of-the-art technology &amp; new facility will serve the region https://t.co/03roAKDBAw"]["@USPS Mail delivery is critical in ND-which is why for yrs, I've been working to improve mail delivery/service for NDans thru my #FixMyMail effort https://t.co/KiDAo6XmHd"]["@USPS Serving as a rural mail carrier is about more than a job - it’s about a relationship. Mr. Hefta &amp; Ms. Gozdal are wonderful examples of that"]["Today in Fargo I honored @USPS employees Joshua Hefta from Minot &amp; Meredith Gozdal from Drayton, for their dedication to go above &amp; beyond https://t.co/kBtOhRW5fn"]["Join me tmrw for key turning ceremony 4 my good friend&amp; vet, Eric Marts. Excited @HomesForOurTroops built him a home https://t.co/TDfACFG1k3"]["Now on 'The Hotdish' - listen to discussion on role of refugee/immigrants w/a local leader &amp; @FargoPolice Chief https://t.co/B1XvLwNuc7"]["Glad I could spend some time with Jessica Kluck, my 2017 @CCAInstitute #AngelInAdoption, and her family today. She’s a real hero. https://t.co/RSDO9Z0GAs"]["Spending time in ND is the best part of my job. Read abt what I learned during my drought &amp; Farm Bill tour last week https://t.co/zO1Dfwatjc https://t.co/0hWKIPQQ3J"]["@nodakchamber Always work across the aisle to find real energy solutions-my work to lift ban on exporting crude oil is an example: https://t.co/XhCw3VsZpP"]["Joined panel @nodakchamber Policy Summit to talk about my bipartisan push for an #alloftheabove energy strategy &amp; the future of energy in ND https://t.co/Ww8irDuMo9"]["ND peace officers put their lives on the line protecting &amp; serving their communities - thanked them today at ND Peace Officers Conference https://t.co/S20fU3Y0IB"]["Excited to tour the new @UNDSMHS &amp; learn about its plan to address ND's health care workforce needs &amp; teach students in real work setting https://t.co/hTyoqV4bNq"]["Great to meet with my Health Care Advisory Board today to talk about a commonsense path forward on health care reform that would help NDans https://t.co/3o4KJ18lRt"]["Said back in March that trade policies must support farmers &amp; ranchers because trade is foundational to ag in ND.\nhttps://t.co/qAkJJN9Q3o"]["As the administration starts to renegotiate NAFTA, I'll keep working to make sure farmers &amp; ranchers can still export their products abroad"]["@ValleyCHCorg Also highlighted imp. to maintain programs like CDBG - which @ValleyCHCorg has &amp; continues to rely on but president's budget would eliminate"]["@ValleyCHCorg .@ValleyCHCorg we discussed how GOP health care bills would have hurt its ability to serve the community by ripping away Medicaid from NDans"]["During Community Health Center Week, toured @ValleyCHCorg to talk about its role in the community &amp; need to continue support &amp; resources https://t.co/svLCCQlxkI"]["Joined folks at United Lutheran Church's Summer Lunch Program where folks stepped up to fill a need in the community - that's the ND way https://t.co/2Z8fIQFGv8"]["@NoradNorthcom @319ABW Today was chance to show @NoradNorthcom Gen. Robinson @319ABW's surveillance &amp; communication capabilities, partnership w/@GrandSkyND &amp; more https://t.co/vOh7TIoMI5"]["At my request, today @NoradNorthcom Commander Gen. Robinson visited @319ABW to see firsthand its potential for Arctic missions https://t.co/iBSowQW8Wh"]["Congrats Britta! You've worked hard for this &amp; I look forward to cheering for you! https://t.co/jJs2scUwGx"]["Must explicitly condemn hateful, racist white supremacists who violently attacked &amp; intimidated in #Charlottesville. No other way around it."]["Thanks @rcnewsmonitor 4 chatting w/me abt how I got to the US Senate-hope my story inspires young NDans to dream big https://t.co/JVTdO22q31"]["Great to see one of my favorite NDans and state treasure, Grace Link, today. https://t.co/MRQXSC55WG"]["Honored to receive @USChamber Spirit of Enterprise Award. Will continue to make sure the needs of ND #smallbiz are heard in Congress. https://t.co/zFr6CRIj65"]["@lionsclubs Committed to working across the aisle to find commonsense solutions that will make necessary health care fixes for families &amp; businesses"]["Enjoyed meeting w/Bismarck @lionsclubs today to talk about next steps in health care reform &amp; my two-day drought &amp; Farm Bill tour last week https://t.co/33QCeACbBf"]["Joined @TATKylla in Bismarck to reinforce that we need a community response to combat #humantrafficking https://t.co/PznBS2iKIq"]["Heart-wrenching &amp; honest letter from the family of a white supremacist in ND. Reminder that silence is not an option https://t.co/Fbj6wRy4o4"]["Helped ICBND celebrate its 50th convention today in Bismarck &amp; highlighted my work on @SenateBanking to provide reg relief 4 community banks https://t.co/L4eB7UuZNv"]["US clearly still has work to do to end hate, violence &amp; bigotry. Love is stronger &amp; must persevere. #Charlottesville"]["Yesterday was a terrible &amp; tragic day. The KKK and neo Nazis have no place in our country. #Charlottesville"]["Got to hang out with voice of the @FMRedHawks @JackTrackItDown   at the game tonight. What a treat on a beautiful evening. https://t.co/4RZlDgfDLv"]["Focused on programs to maintain &amp; strengthen in 2018 Farm Bill &amp; programs producers rely on that I'll fight to maintain #HeidiInTheField"]["Productive discussion w/leaders in Mandan about the stress of the drought on ND's ag economy, esp. w/low commodity prices #HeidiInTheField https://t.co/Prvim7TjyO"]["On my @Snapchat today is the last day of my 2-day, seven stop #HeidiInTheField drought &amp; Farm Bill tour across western ND - check it out! https://t.co/Lcrt0e0PKr"]["Wrapping up my drought &amp; Farm Bill tour in Mandan talking about ND’s ag economy during the low commodity prices &amp; drought #HeidiInTheField https://t.co/VpG3ipFrCQ"]["At Stone Mill, reinforced my commitment to maintaining USDA export promotion programs in 2018 Farm Bill &amp; imp. of #ExIm #HeidiInTheField https://t.co/gwp2MaPzRZ"]["Next I'm talking abt export promotion programs at Stone Mill-North America's largest organic food flax processing facility #HeidiInTheField https://t.co/hbHERWZE9u"]["At Woodworth Honey &amp; Bee, I heard about how the drought has impacted the health of bees &amp; honey production in ND #HeidiInTheField https://t.co/0hWSCJSbHK"]["Met w/folks at FSA offices in Stark &amp; Dunn Co. abt chlgs they face because of the drought. More via @dickinsonpress https://t.co/wVoCuC4m72"]["Day 2 of my two-day, seven stop #HeidiInTheField drought &amp; Farm Bill tour kicks off at Woodworth Honey &amp; Bee Co in Halliday https://t.co/EpXH6cjz2G"]["Thanks to all the folks who came out to make day 1 of my drought &amp; Farm Bill tour a success. #HeidiInTheField https://t.co/21POj9QWOp"]["Heard firsthand from ranchers in Watford City about array of chgls they’ve faced throughout the drought. #HeidiInTheField https://t.co/orgnkjiPQb"]["Last stop of the day is with ND Grazing Association ranchers in Watford City to talk about chlgs w/the drought #HeidiInTheField https://t.co/FjVVmwYZtJ"]["Follow me on @Snapchat to make sure you don't miss any of my #HeidiInTheField drought &amp; Farm Bill tour across western ND https://t.co/KjAOT5TTqE"]["Folks at Dunn Co. @usdafsa &amp; across ND work hard &amp; I’m committed to helping them get resources they need to do their jobs #HeidiInTheField https://t.co/v7Gm5kpt5a"]["Stopped at Dunn County Highway Dept. community lunch in Killdeer - great to see so many folks come out for a fun afternoon https://t.co/lQMuZlDZyG"]["Heading to @usdafsa office in Dunn Co. to talk with folks firsthand about managing the increased drought-related questions #HeidiInTheField https://t.co/PLgvnv0EI6"]["@NDSU This also reinforces why 2018 Farm Bill must cont. ag research investments to make ND ag safer &amp; more efficient/effective #HeidiInTheField"]["Drought could have significant impacts on our soil – both short &amp; long term. Informative visit @NDSU Ext. in Manning #HeidiInTheField https://t.co/4V1k0lRFb1"]["Next up: @NDSU Ext. in Manning to talk about impacts of the drought on the soil &amp; supporting ag research in 2018 #FarmBill #HeidiInTheField https://t.co/PcCig2kAGK"]["Great to meet the folks at Stark Co. @usdafsa to talk about services &amp; resources they need to help local producers get through this drought https://t.co/JOBJxMzp7E"]["First stop is Stark County @usdafsa office in Dickinson to talk about how it's handling the influx of drought-related inquiries https://t.co/cbVWIaqzY5"]["Excited to kick off my 2- day #HeidiInTheField drought &amp; Farm Bill tour in western ND - should be productive &amp; informative couple of days. https://t.co/GloQsO7giM"]["Working to provide communities w/funding they need for addiction services, treatment programs &amp; recovery efforts through the LifeBOAT Act"]["Helped pass CARA-which uses existing funds to provide more tools for 1st responders, law enforcement &amp; educators responding to opioid crisis"]["Opioid abuse is tearing apart our towns. Held 6 mtgs in ND to bring folks together to discuss comprehensive response https://t.co/kuqjKKhBri"]["@USGAO W/@IndianCommittee Dems, spoke w/authors of report &amp; provider of services to Native victims abt how to use report to sharpen gov.'s response https://t.co/d77SOAlyiG"]["Proud of ND biz that supports wind. I fought for invmts in wind that helped make ND top state for wind energy &amp; 3rd for clean energy jobs https://t.co/Tx2jU0EEZU"]["Worked across the aisle to help intro &amp; pass bill to modernize/strengthen GI Bill so servicemembers &amp; families get earned education benefits https://t.co/EJMTnYCEXf"]["Proud to nominate Jessica Kluck from Bismarck as my 2017 @CCAInstitute #AngelinAdoption - read more in @bistrib https://t.co/GNSfrE9R6R"]["Honoring American heroes who fought for our freedom is an intrinsic part of making sure we cont. to thank those who served. #PurpleHeartDay https://t.co/zhBcK1J8OY"]["Congrats @burgessev on the new addition to your family! It's a wonderful ride you're embarking on."]["Two recent grads made a viral video that lets kids know they can be themselves &amp; that love is love #SelflessSaturday https://t.co/CiF6j4rzTc"]["Senate unanimously passed my bipar. bill w/@SenDanSullivan that would help combat domestic abuse/sexual violence by promoting pro bono work https://t.co/In08bIwQsJ"]["DHS's new strategic plan will address staffing, tech., &amp; terrain chlgs our dedicated workers on the border have been telling me abt 4 yrs"]["After review of threats/chlgs at N. Border - required by my bipartisan legislation - DHS announced its intent to create new strategic plan https://t.co/cqK1M9K18s"]["I've seen broad reach across the aisle to find ways to stabilize health ins. markets. Now, it's about health care, not rhetoric via @NewDay https://t.co/RrMd7AuRGC"]["On @NewDay reinforced that it's clear we can do better to protect our borders, but we can't forget that diversity strengthens our country https://t.co/c7QGZudfdw"]["My bill w/@SenCapito @SenWhitehouse to promote carbon capture is proof that there is room for bipartisanship in the Senate. More on @NewDay https://t.co/rKDAQ5t5Pb"]["ICYMI-on @NewDay, talked about how there is a willingness in Congress working across the aisle to get things done, health care &amp; immigration https://t.co/Qy2z11uerJ"]["Talked on @NewDay abt how bipartisanship can happen in Senate. See my bill on carbon capture tech. Has strong support on both sides of aisle https://t.co/LimxqxSpkN"]["Check out my webpage for more resources &amp; info on how to manage production during the drought &amp; available resources https://t.co/6u5ty9gK6v"]["No rancher should go under b/c of conditions like this drought – this is another practical solution I've pushed for help them make it thru"]["IRS Comm'r heeded my call to alert ND ranchers who've been hit hard by the drought so they know they’re eligible for relief https://t.co/H2paE7SYSV"]["Group of Senate Dems &amp; I had a bizarre meeting with Scott Garrett - the president's nominee to lead #ExIm. Here's our statement: https://t.co/bkdouC1jKe"]["Enjoying the outdoors is part of who we are in ND - that's why I reintro. bipartisan bill w/@SenatorRisch to promote hunting/shooting sports https://t.co/ZyBxXXZhOW"]["Enslavement &amp; trafficking of men/women/kids has incr. nearly 850% since 2010 b/c of anonymity of internet sales - this bill aims to fix that"]["Websites like Backpage have been profiting from facilitating sex trafficking &amp; hiding behind First Amdmt rights - that's disgusting&amp;cowardly https://t.co/yqp5JTDtI1"]["Worked across the aisle to intro. bill that would make sure websites that knowingly facilitate sex trafficking online are held accountable https://t.co/EKStrpPzQa"]["@FortuneMagazine My SEED Act would support the many innovative startups in ND &amp; across rural America by giving them the seeds they need to grow #StartupDay https://t.co/Db6r2HkSVK"]["@FortuneMagazine SEED Act would create a pilot prog. granting funds to 10 small cities across the country which would then be awarded to startups #startupday https://t.co/QESpojWiNO"]["@FortuneMagazine Supporting ND startups is critical 2 supporting local economy-&amp; by investing in rural startups, that's what my SEED Act would do #StartupDay"]["@FortuneMagazine Startups aren't just in NY/CA - &amp; ND is proving that with its impressive talent &amp; innovators who are paving the way w/new tech. #StartupDay https://t.co/qDFf7CeEiq"]["Did you know ND is called Silicon Prairie b/c of its thriving startup industry? Read @FortuneMagazine #StartupDay https://t.co/ol6iJPhJv2"]["@NDStateFair Glad Lonnie Sager, one of the winners of the Best of North Dakota contest, was able to stop by &amp; see his photo on display https://t.co/VrqA8Lzsem"]["@NDStateFair Thanks to all the folks who submitted their beautiful photos and for those who stopped by to see the winners @ndstatefair"]["If you weren't able to check out my booth @ndstatefair, here are the top 3 winners from my Best of North Dakota photo contest https://t.co/ZctMvUkYBW"]["@nytopinion @NickKristof @SenCapito From 2000 to 2014, maternal deaths in the US rose by 26% - more than any industrialized country. That's unacceptable."][".@nytopinion by @NickKristof underscores need 4 my bipartisan bill w/@SenCapito to study pregnancy-related deaths https://t.co/xbjplnupf0"]["'Flat Heidi' had an exciting &amp; fun week @ndstatefair meeting w/NDans, enjoying the games, &amp; all the fun. https://t.co/ge82sAuo6M"]["Met w/NDans from @americanlegion Boys Nation and @ALAGirlsNation - great young leaders who will do great things for ND https://t.co/cehtDhRIxg"]["Cannot support a bill that would rip health care away from tens of thousands of NDans or make it unaffordable. Here's my full statement https://t.co/xW4fhW1ZCu"]["I have many ideas that I’ll keep offering. I’m hopeful there is now an opening for progress. My office door remains wide open."]["For years I’ve said the health reform law isn’t perfect, no law ever is – but we can make it work thru needed reforms"]["GOP &amp; Dems should be able to join together to pass transparent, bipar. reforms to improve health care, as I’ve been working to accomplish"]["Many hoped this bill would pass for political reasons, instead it failed for the right reasons - it hurt our neighbors &amp; communities"]["History will remember where each of us stood during this vote. We should be here to do what is best for the American people."]["I could not support a bill that was crafted behind closed doors &amp; would have ripped health care away from tens of thousands of NDans"]["Far too often in Congress, politics dictates legislation, and it needs to stop. The bill the Senate voted on tonight was a bad bill."]["With majority of Senate, I voted against Senate GOP health care bill that would have ripped away health care from NDans &amp; increase premiums https://t.co/ZXuqmGus01"]["Have been offering many ideas since 2013 to make health care work better. Hope to work w/ Dems &amp; Republicans on them and other ideas. https://t.co/mr64ztpOO3"]["2. What do insurance companies say will be the consequences of elimination of the individual mandate?"]["1. If the business mandate is eliminated how many people will be forced to get health insurance on the individual market?"]["Since Republicans refuse to allow questions here is what I would ask about the GOP health care bill if they would allow it:"]["No hearing on the GOP health care bill and now won't even answer a question on the bill. Beyond frustrating"][".@AmerMedicalAssn came out against Senate GOP health care bill saying it is a \"toxic prescription that would make matters worse.\" https://t.co/ma9vaJiukn"]["Joined @SenatorTomUdall @MartinHeinrich to offer amdmt to GOP health care bill that would protect against cuts to health care Indian Co. https://t.co/BiHEX9lQI3"]["Voted w/nearly entire Senate to pass a bipartisan package of sanctions -which I cosponsored -to hold Russia, Iran, &amp; North Korea accountable https://t.co/bPWbAbK7TE"]["When Senate votes on GOP health care repeal bill today, I'll be voting on what's best for NDans like Ranae from Burlington. https://t.co/JmBbyMeJXS"]["NDans deserve access to quality, affordable health care, access to coverage &amp; peace of mind. But GOP health care bill doesn’t do any of this"]["These are the stories of some of the NDans that I’ll be fighting for during votes on the GOP health care bill today: https://t.co/ZSIPoQjU2I"]["Hospital costs of uncompensated care in ND would increase annually by $31M -making it difficult for rural hospitals to keep their doors open"]["Via Joint Economic Cmte, GOP health care bill would take away health care from 34,600 NDans by 2026, increase premiums by $794 annually https://t.co/F1BEAGyKsH"][".@NDFFA from West Hope has some of their great leaders in DC highlighting the importance of rural communities and supporting farmers https://t.co/IfXHrqNd21"][".@KMOT_TV  story highlights vulnerability of rural hospitals - will fight for programs that would maintain quality services close to home https://t.co/YKK4prXj7F"][".@DougBurgum declared drought disaster in ND. Will cont. pushing USDA 4 resources &amp; hope folks check out my webpage https://t.co/fp7Dvo9uKK https://t.co/4WS0C5sTO8"]["As Senate continues health care debate, I'll keep fighting for NDans like Fran, Wayne, Sue &amp; Anthony https://t.co/M5gkg0otZB"]["Met w/group of inspiring @udallfoundation interns about how to help to build a better future for Indian Country https://t.co/IzHJbRfX8q"]["Met w/Sarah &amp; Sydney from @NLSADD &amp; pledged to stay safe by not driving distracted. Join me in staying safe on the road. #SADD17 @SADDNation https://t.co/xGA91h8HBF"]["Met w/president &amp; secretary of @NDFFA in DC encouraging Congress to support new and beginning farmers and ranchers in the next #FarmBill https://t.co/Sh3OlHKtxz"]["Increasing costs or making it more difficult 4 folks w/pre-existing conditions to get health care puts NDans like Griffin at a disadvantage https://t.co/8ybxTuFMmF"]["Dissapointing that tonight the Senate voted down amendment that would have protected folks w/disabilities like Anthony from Grand Forks https://t.co/k0vp5ZLuzp"]["For these NDans, health care bills aren't abt politics–they’re abt making sure loved ones have access 2 quality care https://t.co/M5gkg0G5ob"]["Met w/@PacificCommand Commander Admiral Harris to discuss the role of nuclear deterrence to maintain tough, smart nat. security strategies https://t.co/Re8c52kW3k"]["Shining a light on type 1 diabetes research &amp; funding is what Addison of Minot and her mom are doing in while in DC w/@JDRF  #JDRFCC17 https://t.co/si1v6RIxhi"]["Senate must pass health care bills that support children w/disabilities - like the Restemayers - &amp; not ones that would rip away coverage https://t.co/5Pwwwd7oen"]["It’s deeply unfortunate the president chose to announce this divisive news in an abbreviated and cavalier manner via social media"]["If a servicemember can do the job and is willing, they should be able to serve – and they should be able to be open about who they are."]["We need to honor -not shame- the men/women who serve our country. The president banning transgender Americans from serving is upsetting https://t.co/AQwwDoxaEO"]["Today &amp; tmrw the Senate will take more votes like the one last night &amp; YOUR health care is at risk. Share your story, make your voice heard"]["This bill was downright bad for ND and it’s great news that it failed by a vote of 43 – 57 last night - but this is just the beginning"]["@AARP @NDMedAssn @NDHospitalAssn Senate GOP health care bill voted on last night wasn't health care reform, it was tax reform 4 the wealthy on backs of the most vulnerable"]["Organizations like @AARP @NDMedAssn @NDHospitalAssn - who I met w/last week &amp; had this to say about BCRA - strongly opposed this bill https://t.co/dgIRSey4he"]["This bill would have been bad for ND. Hear it directly from folks who rely on the programs the GOP wanted to cut https://t.co/M5gkg0G5ob"]["It would strip away health care that families rely on to keep loved ones healthy &amp;make ends meet all while giving a tax break to the wealthy"]["The Senate GOP health care bill that was defeated would have ripped away health care from millions of Americans &amp; raised premiums"]["BCRA was drafted behind closed doors, without input from across the aisle or from experts, no hearings or debate"]["With a wide margin, last night the Senate fortunately defeated the cruel GOP health care bill, Better Care Reconciliation Act (BCRA)"]["President's budget would have slashed fed. funding for CCUS research &amp; dvlmpt by 50%+ - but my call w/15 Dem. senators prevented that"]["Senate appropriators heeded my call to maintain strong funding for research &amp; dvlmpt of CCUS to help make sure we have a viable #future4coal https://t.co/HbS2IteeIJ"]["Proud to intro @senjudiciary &amp; recommend Judge Erickson to serve on US Circuit Court of Appeals for the 8th Circuit https://t.co/11fXZM2XlR https://t.co/DPWlTPst87"]["'Flat Heidi' made her way to the Behavioral Health booth &amp; dairy barn, &amp; met Miss @NDStateFair - what did you do at the Fair today? https://t.co/ouPOHRvdD4"]["Watch and read why the Republican health care bill that passed the Senate today is bad for ND directly from NDans: https://t.co/ZSIPoQ2iE8"]["GOP health care bill that passed in Senate today would rip away Medicaid from families like the Nelsons who use to care 4 their son, Graham https://t.co/0G75TOPN3W"]