["TUNE IN: I'm speaking at @MAChristianUniv in minutes about Dr. Martin Luther King, his connection to #OklahomaCity, &amp; his call for racial unity in America.\n\nWATCH LIVE: https://t.co/VkvGW51xnk"][".@StateDept re-designated #China as a CPC for “severe violations of #religiousfreedom”—further justified by the demolition of a church by Chinese authorities. All should be free to practice their religion without fear of persecution from the government. https://t.co/YUM1bXqPgm"]["I’m glad the House passed a bill to reauthorize Sec. 702 of FISA. This key national security program maintains vital authorities for our Intel community while also protecting everyone's civil liberties. It’s the right approach &amp; I hope the Senate passes it soon."]["The positive news just keeps on coming. Wal-Mart now joining the growing list of companies w/ plans to increase wages for workers because of the #TaxCutsandJobsAct. https://t.co/IIGGkBgMSm"]["More great news thanks to #taxreform. Oklahomans will see lower utility bills this year → https://t.co/VpT7it9goQ"]["Yesterday, the world got to see what some of our immigration &amp; #DACA discussions look like. I remain hopeful we will get something done on the very important issue of #immigration. \n\nI joined @CBSThisMorning to discuss → https://t.co/A1a8X942b0"]["TUNE IN: I’ll be on @CBSThisMorning at 8am ET / 7am CT to discuss #DACA, #ImmigrationReform &amp; Tuesday’s bipartisan immigration mtg at the White House https://t.co/XC2TuwHDFe"]["I’m glad the House is taking up the #BornAlive legislation to protect life. The Senate should do the same &amp; schedule a vote on @BenSasse’s bill. If the protection of living, breathing children &amp; promotion of human dignity can’t be non-partisan, what can? https://t.co/LHRELXgE5P"]["This is fantastic news → @GallupNews reports American optimism about finding a job last year was the highest in 17 years. https://t.co/ysY9WR3n7v"]["Border Security (aka \"The Wall\") Facts:\n✓ There is NO PLAN to build a 2,500 mile concrete wall along entire southern border\n✓ There are places where fencing (The Wall) is the best security. In other places, drones, surveillance &amp; increased border agents are more effective (3/3)"]["Border Security (aka “The Wall”) Facts:\n✓  We already have 650 miles of border fencing (The Wall) RIGHT NOW\n✓  Border fencing (The Wall) has increased considerably over the last 10-15 years, with the support of Dems &amp; Republicans (2/3)"]["Border Security (aka “The Wall”) Facts:\n✓ Border security is something that both Dems &amp; Republicans have agreed is important for national security\n✓ Democrats (including Sens. Clinton, Obama, &amp; Schumer) have voted to build hundreds of miles of border fencing (The Wall) (1/3)"]["It’s a shame that border security has become a partisan issue, especially since my Democratic colleagues have long supported &amp; voted for it. \n\nWe have a unique opportunity to fix #DACA, protect #Dreamers, &amp; improve border security in a bipartisan way – let’s do this. https://t.co/EjB4qGSGi8"]["Last night, #Oklahoma lost a good man, and giant in public service - Norman Lamb. His service in the state Senate, as Secretary of Veterans Affairs, and in many other ways made a difference in our state for years. His faith, work ethic, and positive attitude will be missed. https://t.co/tLGKofjk3e"]["It is no coincidence that countries that persecute religious minorities also struggle with political instability. Like #Iran, #NorthKorea, #Burma, #Pakistan, etc. \n\nIn peaceful, flourishing societies, #ReligiousFreedom is valued &amp; protected for all. \n\nhttps://t.co/27umTM1blI"]["We are continuing to work towards bipartisan immigration reform that will include a solution for #DACA as well as border security. We can provide certainty for #Dreamers while improving national security to benefit all Americans. https://t.co/PS6b3MX2IV"]["Here's your MUST READ of the day. Excellent words from @hughhewitt. https://t.co/j7RdhDzKUl #gridlockreform #MakeTheSenateWorkAgain"]["Just like charities, houses of worship, of any faith, that serve people &amp; are impacted by natural disasters should not be disqualified from assistance simply because they're religious. I'm pleased that #FEMA will now make houses of worship eligible for aid https://t.co/kBlb9NmDEf"]["What a game.... what a season! You made our state proud.  \n\n#RoseBowl\n#Oklahoma\n#BoomerSooner https://t.co/fxstehu6Xy"]["I want to wish all Oklahomans and Americans a safe and prosperous 2018! Happy New Year! https://t.co/I84PVU0Oi3"]["The Iranian people bear the harsh burden of their nation’s poor leadership. Their gov’t continues to invest in sponsoring terrorism instead of its people. Change is desperately needed in Iran. #IranProtests"]["Free &amp; safe elections run by individual states are at the core of our national identity. In the new year, it is imperative that we strengthen our election systems against foreign interference. The #SecureElectionsAct is the bipartisan solution we need. https://t.co/5o4NLrCTfA"]["Congrats #okstate!! #GoPokes https://t.co/QT7KJXshe1"]["Wishing you all peace, joy, and happiness this Christmas Day. God bless us, everyone! #MerryChristmas https://t.co/8sWLtHtNSr"]["I applaud President Morales &amp; the nation of Guatemala for joining the U.S. in starting the process of moving their Embassy in Israel to Jerusalem. Thank you for your bold leadership &amp; continued strong friendship with the U.S. &amp; Israel. https://t.co/o8q7ewBXsC"]["This holiday season is a good time to recommit to family, community &amp; unity. Let's remember that even though we, as Americans, disagree vigorously at times, we are neighbors &amp; we share a love for our great nation.\n\nFrom my family to yours.... #MerryChristmas https://t.co/aqyvd91eAb"]["The thwarted ISIS-inspired attack on San Francisco's Pier 39 is yet another example of the amazing work that the @FBI &amp; intel community do every day. Most Americans will never know these heroes or the many threats they stop. I’m thankful to Christopher Wray &amp; his team."]["WATCH THIS: @CBSThisMorning asked 3 families for their tax returns &amp; found that all 3 would receive tax relief next year because of #TaxReform.\n\n#TaxCutsAndJobsAct https://t.co/NbwvZ3qlAY"]["@kelsey_snell  https://t.co/43jbB3iiSZ"]["Today, we’re introducing the bipartisan #SecureElectionsAct. It’s needed to strengthen election cybersecurity in America &amp; protect against foreign interference in future elections. \n\nCo-sponsored by @amyklobuchar @SenKamalaHarris @SenatorCollins @LindseyGrahamSC &amp; @MartinHeinrich https://t.co/cOlFQpm5hg"]["Today the President signed the Enhancing Veterans Care Act. I'm grateful to work with a leader like @JimInhofe on this issue to bring greater accountability &amp; oversight to @DeptVetAffairs to provide the care our veterans deserve."]["Great to meet w/ students engaging Congress on #DACA today.\n\nKeep in mind:\n✓ #DreamAct has failed Congress 3x\n✓ #CleanDreamActNow would fail again\n✓ There is a bipartisan group working to solve this early in '18 to provide certainty &amp; finally address our immigration problems"]["Under this #TaxReform bill, a single parent with a child earning $41,000 will see a tax cut of nearly 73%. The bill also preserves the Child &amp; Dependent Care Tax Credit to help families care for children &amp; older dependents such as a disabled grandparent. https://t.co/TTTxcHRaku"]["Our #TaxReform bill increases standard deduction, doubles child tax credit, preserves adoption tax credit &amp; expands charitable deduction. With this bill, the typical family of 4 earning the median family income of $73,000 will receive a tax cut of $2,059. https://t.co/TTTxcHRaku"]["The Senate just passed a final #TaxReform bill that will cut taxes for the middle class &amp; lead to economic growth. After 30yrs, we finally have an historic tax reform bill that’s one stop away from being signed into law. https://t.co/TTTxcHRaku"]["Proud to start the conversation addressing the gridlock happening in the Senate. We can be deliberative &amp; productive at the same time. It's time to make the Senate work efficiently for the American people, regardless of who is president. https://t.co/oD9eXlGMeJ"]["Rules Committee hearing on #GridlockReform starting now. TUNE IN → https://t.co/j1Y4XwMxNV"]["You’re going to want to watch this: https://t.co/9eCMOMr2SZ https://t.co/BAxKjn5enH"]["But then you hear there’s a plan to get the Senate working again… https://t.co/eVOtR1RkP3"]["TFW you realize the Senate has only confirmed 261 of Trump’s nominees compared to Obama’s 418 and Bush’s 483 in their first year… https://t.co/iMW8fG2brH"]["TUNE IN: My good friend @SenAngusKing &amp; I will be on the @hughhewitt Radio Show together Tuesday at 7:30am ET / 6:30am CT. You don’t wanna miss our discussion about partisanship &amp; civility in politics, among other topics. https://t.co/zYNiOvVpwa"]["Russia tried to interfere w/ our election systems. Although they didn’t change actual votes, we must strengthen our system. @KamalaHarris, @amyklobuchar, @LindseyGrahamSC &amp; I will soon introduce an election security bill to help protect against foreign cyber interference. https://t.co/r1VTRIU51x"]["There is often an appropriate need for regulations, but I have always preferred less federal regulation, not more. Moving forward, we must be cautious about issuing preemptive regulations &amp; examine the market need for such rules. MORE: https://t.co/bZA8vDankt #NetNeutrality"]["Very proud to introduce Judge Charles Goodwin at his nomination hearing this morning before the Judiciary Committee. Judge Goodwin is highly qualified and will serve Oklahoma and the nation well on the federal bench for the Western District of Oklahoma. https://t.co/EHD3sxXoW2"]["Wishing you all a happy holiday as you begin the celebration of Hanukkah tonight with friends and family. #HappyHanukkah https://t.co/JMf0uEFNps"]["There is a lot of confusion about #CHIP funding that I want to clear up. I fully support CHIP &amp; want to see some major inefficiencies in the program addressed as we work to ensure it will be sustainable for children &amp; families who depend on it. MORE: https://t.co/oYjnuUPQ6Z"]["Terrorists can try to destroy Americans, but they will never destroy our American spirit. Grateful for our law enforcement, homeland security personnel &amp; intel officials who keep us safe every single day, like they did today in New York City. Terror will never win."]["“We are a nation of communities... a brilliant diversity spread like stars, like a thousand points of light in a broad and peaceful sky.” -President George H. W. Bush\n\n#SolutionSunday https://t.co/3yuSwTbVj5"]["Very honored to welcome home the Oklahoma National Guard 45th Infantry Brigade troops from Ukraine. From a very grateful state and nation: thank you, God bless you, and welcome home. https://t.co/QJvHlDICIY"]["Great to join @TaxpayersEllis, @RominaBoccia, @MrRBourne, &amp; @CatoEdwards for today’s #CatoEvents “Curbing Wasteful Spending in 2018”\n\nWe can’t cut what we can’t see. It’s time Congress passes my Taxpayers Right To Know Act: https://t.co/SJC6S9JZCl https://t.co/N1V5PNmufH"]["It was my honor tonight to introduce my good friend @SenatorTimScott, the 2017 @kempfoundation Leadership Award recipient. Looking forward to @OU_Football beating his @ClemsonFB in the National Championship Game! #KLAD17 https://t.co/gYaq3laGm8"]["I applaud the President’s recognition of #Jerusalem as the capital of #Israel &amp; the start of a long process to move the US Embassy to Jerusalem. My full statement → https://t.co/PsulSHgz7L"]["Rear Admiral Greg Slavonic has dutifully served our nation in the @USNavy &amp; he has served the people of Oklahoma as my Chief of Staff. His leadership will be missed on our team, but he will be a tremendous asset as Assistant Secretary of the Navy. https://t.co/vcQIj3kf4I"]["For decades, the U.S. has ignored obvious issues w/ our immigration policy &amp; it’s only made the problem worse. It is time for R’s &amp; D’s to come together so we can provide the certainty that #Dreamers deserve &amp; the border security our country desperately needs. https://t.co/rOkVl8fBFf"]["Pleased that Kirstjen Nielsen has been confirmed as DHS Secretary. Under her leadership, our cyber, border &amp; overall homeland security will be strong. https://t.co/aW6O24l11f"]["America must be a place where we respect freedom and artistic expression &amp; have tolerance for diverse views. The ability to embrace diversity of opinion &amp; still treat people with respect is what makes America special. #JusticeForJack https://t.co/K9u6oIcFdy"]["I highlighted this in last year's #FederalFumbles Vol. 2 as a major problem. I'm glad to see justice is being served. https://t.co/FdbPQ22k5M"]["McConnell is right. Adding a #DACA fix to the spending bill is irresponsible. Congress should not play year-end politics with #Dreamers. https://t.co/8p3NSD5ccU"]["@GreatBlueC Ok. Here is further economic analysis from a tax group that predicts more than 3% growth (Tax Foundation) https://t.co/kh67XbBzBn"]["This group of more than 130 economists predict the Senate #TaxReform bill will “ignite our economy with levels of growth not seen in generations” &amp; more than pay for itself → https://t.co/hW5p2EJc0j https://t.co/kLja5jQU0f"]["@Timberati Sure. Here is a list of more than 130 economists who predict our tax bill will exceed CBO &amp; JCT predictions &amp; pay for itself https://t.co/hW5p2EJc0j"]["@emartin62604 There’s lots of help for low income. For a family/married couple, the first $24,000 is not taxable at all. And according to very conservative estimates, at least 60% of Americans will see a tax cut of at least $100 or more. https://t.co/0Ks4CPRHDR"]["@MattWelch Ok @MattWelch.... deal. I’ll give u one of my most prized possessions: my Johnny Cash autographed Vinyl LP or maybe my @okcthunder Russ jersey. Or maybe a trip to Sonic. My treat. 😉"]["@emartin62604 Sure. Well... the Tax Foundation is independent &amp; nonpartisan. And here is a letter from more than 100 economists saying the same thing: https://t.co/hW5p2EJc0j"]["In last 10yrs, economic growth has collectively averaged less than 2%. Unacceptable. Lots of economists say #TaxReform will grow the economy between 3 &amp; 5%, which pays for itself &amp; even helps pay down fed debt. CBO, JCT scores have always been extremely conservative &amp; often wrong https://t.co/ecMEky7JVH"]["MUST READ → #TaxReform “will bring economic growth back to its historical norm of 3 to 4%. Incredibly, the JCT scored growth for the Senate plan at less than 1%.... The Tax Foundation estimates 3 to 5% growth over the next 10yrs. That's more like it...”\nhttps://t.co/tLSMxFSiUq"]["The #Sooners are going to need a bigger trophy case by the time this season is over. #Boomer \n\n#BIG12 3-peat 🏆🏆🏆\n\nUp next: Heisman trophy\n\nThen: national championship!"]["The Senate just passed a historic #TaxReform bill that will grow the economy &amp; provide tax relief for hard-working Oklahomans. Modest economic growth estimates show this bill will pay for itself &amp; even help pay down our federal debt! https://t.co/fWf61yicOw https://t.co/4omMvJ1ux3"]["Throughout this #TaxReform convo, I’ve been excited to hear my colleagues across the aisle express concern about debt &amp; deficits. I’d like to invite them (&amp; you) to attend this briefing w/me next Thurs on #FederalFumbles &amp; “Curbing Wasteful Spending” https://t.co/48j0662Cua"]["Man, I’ve been nervous all day. Washington really needs a win..... but we can’t give up on this year. Today is big!\n\n#GoCowboys 🏈\n#WASvsDAL"]["Yeah. Not a good day for Eli Manning.... \n\n#FederalFumbles https://t.co/DBSFqp9r0y"]["$2.6 million on chimpanzee retirement\n$30,000 for \"Doggie Hamlet\"\n$85 million to build a hotel &amp; apartment in Kabul\nThe list goes on... #FederalFumbles → https://t.co/a2oauxuQYq https://t.co/ENVQaBrTap"]["I'm LIVE now w/ @DailySignal talking #FederalFumbles. TUNE IN: https://t.co/hlXFQjbaIS"]["@CillizzaCNN Not even close Chris. By far.... @Chaplain_Black has the best voice! 😉"]["HERE IT IS. #FederalFumbles\n\nhttps://t.co/6UgaC7mafO https://t.co/myks3TuAnn"]["Watch the #FederalFumbles press conference LIVE at 11am ET/10am CT: https://t.co/ML3SIexatY"]["Releasing #FederalFumbles Vol. 3 at a press conference this morning at 11am ET/10am CT. It will stream LIVE on my Facebook &amp; YouTube pages →\nhttps://t.co/bALXKos2hp\nhttps://t.co/W0XJ5qlCnI https://t.co/hMuEWigtwA"]["@seungminkim ...or #MochaWithTheMinister 😂"]["TIME CHANGE: This week's #JavawithJames coffee hour in my DC office will be at 10:00am ET on Wednesday morning, instead of the normal 9:00am ET. Please let my office know if you plan to attend and I will look forward to seeing many Oklahomans there! https://t.co/CzOY624RyX"]["Don’t forget to support small businesses today and #shoplocal! #SmallBusinessSaturday #shopsmall https://t.co/teki1AsaEj"]["Wishing you all wonderful day celebrating what you are most thankful for with great food, family, &amp; friends. From my family to yours, #HappyThanksgiving! https://t.co/DLJKNGRWCM"]["In Broken Arrow... welcome home 1st Battalion 279th Infantry Regiment from Ukraine. #Oklahoma is so proud of you. Thank you for your service. https://t.co/9VVcIoQjrG"]["Happy #ThanksgivingEve everyone....  🦃 🇺🇸 https://t.co/N1lfOm18yV"]["SOON. \n\n#FederalFumbles → https://t.co/dvBeAeE3fu https://t.co/1j2R4dBi5r"]["The charitable deduction should be available to all Americans who give to causes they care about, not just those who itemize their taxes. My Universal #CharitableGiving Act creates a universal deduction. More HERE: https://t.co/eZY1z7utUK"]["Relisting #NorthKorea as a State Sponsor of Terrorism is a good decision. Kim Jong-un is threatening the world w/ nuclear &amp; missile threats, while his own people go w/o basic necessities. We must use all diplomatic measures to redirect this dangerous regime."]["Seeing a lot of comments today about the #AdoptionTaxCredit. FYI... it actually IS included in the Senate #TaxReform bill AND the House bill that passed on Thurs. 👍 https://t.co/E2Aw8AHfK2"]["On this #NatlAdoptionDay, we celebrate #adoption. However, there are 110,000 kids in #fostercare who need a forever family. Visit https://t.co/Yn0dQt1vRt &amp; https://t.co/tvitqpSYTJ to learn more."]["The Man. The Myth. The Mountain. Happy birthday @jiminhofe!"]["I applaud @AjitPaiFCC &amp; the #FCC for reforming the Tribal #Lifeline program to reduce fraud &amp; waste, making it more efficient for those who truly need it in #Oklahoma. https://t.co/WuloC2oIHT"]["The #NDAA has passed the Senate &amp; is headed to POTUS's desk. This critical bill enhances military readiness &amp; continues to provide resources &amp; training necessary for the safety, security, &amp; reliability of those that selflessly protect our nation."]["You're doing fine, Oklahoma! 110 years ago Oklahoma became the 46th state to enter the union. Happy Statehood Day! https://t.co/1JedcQA1jk"]["Improving trade agreements is a good thing. Our Trade Rep should prioritize job creation over trade deficits &amp; avoid ‘sunset’ clauses in new agreements. #NAFTA \nhttps://t.co/fswaZXmzo3"]["We have to get the economy growing again, but we have to deal w/ half a trillion dollars in overspending too. We can do both. #TaxReform https://t.co/aJBozzRiai"]["The Obamacare individual mandate tax should be repealed because it hurts people who can’t afford it. Repealing it through #TaxReform would not take away the subsidies for people, just the mandate tax. #MorningJoe https://t.co/GHhruzHWpM"]["I’m sad for the victims and the people of Alabama going through this. But it's good that the nation is talking about moral issues &amp; trying to hold leaders to a higher account. Harassment in Hollywood, Capitol Hill, media, or anywhere is unacceptable. #MorningJoe https://t.co/CspcZzzsN7"]["TUNE IN: Joining @msnbc #MorningJoe at 7:20am ET / 6:20am CT"]["I joined @USCIRF today to discuss #Turkey &amp; their disrespect for #HumanRights. Turkey has unfortunately embraced oppressive policies &amp; continue to unjustly imprison #AndrewBrunson, They are no longer behaving like an American ally. https://t.co/rGbNZNoA3T"]["Proud that an Oklahoman has been appointed to serve on the AG’s Advisory Committee of U.S. Attorneys. Trent Shores, recently confirmed U.S. Attorney for Northern District of #Oklahoma, will do a great job providing advice to the Attorney General.\nhttps://t.co/tqp15ty5ok"]["Watch live Tuesday at https://t.co/1tJdX8roZx\n\n#Turkey #HumanRights #ReligiousFreedom #AndrewBrunson https://t.co/6b15agTRYP"][".@RepRussell &amp; I are back in the U.S. today after traveling to Ukraine &amp; Belgium over the #VeteransDay wknd. It was an honor to visit the Oklahoma National Guard 45th Infantry Brigade. https://t.co/urRN2f5Hua"]["Great to join @jorgeramosnews on Univision's Al Punto to discuss the #DreamAct, the protection of #Dreamers, &amp; the #SucceedAct, a bill I've co-sponsored w/ @SenThomTillis &amp; @senorrinhatch https://t.co/cPyiQfUnOA"]["Grateful for all the houses of worship across Oklahoma &amp; America exploring the foster care &amp; orphan crisis today. Gov’t can’t solve this problem.... we need more families to rise up. #OrphanSunday"]["It’s an honor to spend time with them. Grateful for all who are serving &amp; have served to maintain our freedoms. \n\nHappy #VeteransDay https://t.co/xRW7AvStQo"]["May we never forget the sacrifice of our nation's heroes &amp; their families. To those who have served: God bless you. #HappyVeteransDay https://t.co/jywZPLphWN"]["Be sure to visit The Wall That Heals at the OK History Center this weekend. Beautiful tribute to those who gave their last full measure of devotion in service to our nation. #VeteransDay https://t.co/X637poyUVh https://t.co/zL1dMAAHty"]["Happy 242nd @USMC! Thank you for your service &amp; sacrifice. #SemperFi #HappyBirthdayMarines https://t.co/L3kygAyXyt"]["In the last 10yrs, economic growth has averaged under 2%. This is unacceptable. The Senate #TaxReform plan could provide an opportunity to cut taxes, jump-start economy, &amp; simplify tax code. https://t.co/F4Ijas7HF9"]["Great to join @RealTodTucker this morning to talk Russian trolls &amp; #taxreform. In case you missed it, listen HERE: https://t.co/ojyhJaxvmk"]["TUNE IN: Joining the @hughhewitt radio show at 6:30am CT, OKC’s 1520 KOKC w/ @RealTodTucker at 7:20am CT, &amp; NW OK’s @K101online w/ J. Douglas Williams at 7:40am CT."]["Honored to #StandWithNurses today. Congress should pass the #ConscienceProtectionAct to protect health care providers from gov’t discrimination if they decline to participate in abortions. This should not be controversial. https://t.co/QtahpW4XG9"]["1st Sgt Pascal Cleatus Poolaw Sr., who served his country in 3 wars, gave up his life in Vietnam 50 years ago today. https://t.co/PuvfusS7Fo"]["Our hearts and prayers go out to the victims in Sutherland Springs and that entire community. What a tragic act of evil."]["Our $20 Trillion debt can only be addressed by cutting spending &amp; growing economy. #TaxReform must grow economy enough to help pay down debt https://t.co/sYjZ9CED1e"]["As divisions are inflamed in America, we must recommit to civility &amp; unity, even while we disagree. \nhttps://t.co/UafYkVX0N8"]["TUNE IN: Honored to join a special edition of @meetthepress this Sunday as it celebrates 70yrs. #MTP70 https://t.co/Wmhgx9HGGq"]["Strong #JobsReport. 261K jobs added, unemployment falls to 4.1%, lowest in 17yrs. But economic growth is still not as strong as it should be"]["Good decision by @Georgetown Student Activities Commission. Academia should welcome diversity for ALL student groups\nhttps://t.co/SVAuKVKYx4"][".@chucktodd is right. Russia believes they benefit from division &amp; chaos within American society. We must not let Russia succeed. #MTPDaily https://t.co/CLyCNFeAhP"]["Terrorist threats should not change our nation’s spirit, but it's appropriate to reevaluate #immigration &amp; VISA policies to ensure safety. https://t.co/hecwEqeeon"]["MUST READ → Senate Democrats falsely claim GOP #TaxReform plan will raise taxes for most working-class families\nhttps://t.co/DXW3tmI17B"]["From your neighbors to the north.... Congrats Houston! \n\n#HoustonStrong\n\n#WorldSeries2017 https://t.co/CfgZyaojB2"]["Social media companies should do more to stop Russian false advertising &amp; publicize examples of fake content so Americans can be aware. https://t.co/lq1YrCozXC"]["Great to connect with Oklahomans at #JavawithJames this morning. If you're planning a trip to DC, join me on Wednesdays at 9am! https://t.co/6TBzq5MPIH"]["Russians used social media ads to deceive U.S. voters.My Senate Intelligence Committee wants to hear a plan from tech companies to stop this https://t.co/lOf9cs0QiZ"]["My prayers are with the New York City community. We will not let this terror attack change our spirit or way of life. Terror will never win."]["The American people expect us to get more work done. It’s time to enact #GridlockReform https://t.co/gPGSiAom82"]["Amy Barrett is a highly qualified nominee, &amp; like JFK running for president in 1960, there shouldn’t be a religious test for her either. https://t.co/oEydHpoJrX"]["In America, we have the free exercise of religion. You are free to have a faith &amp; live your faith no matter your job. #ReligiousFreedom https://t.co/eE4ihMzF9F"]["TOMORROW is #TakeBackDay, giving Americans the opportunity to safely &amp; responsibly dispose of unused/expired Rx drugs. More info HERE → https://t.co/Zcs5goWsYs"]["Today we celebrate International #ReligiousFreedom Day. Let's set the example of religious freedom to the rest of the world today. https://t.co/Od6O4IF6Ow"]["The #opioidcrisis is all too real in Oklahoma, impacting families &amp; communities across OK. It's time for action. https://t.co/eYK3cjpbqo"]["The Senate has finally confirmed Scott Palk to the US District Court for the Western District of Oklahoma. Congratulations, Judge Palk!"]["Great to catch up w/ @mactownchamber &amp; McAlester Defense Support Association from MCAAP in DC this morning. https://t.co/34NFGDpzGw"]["Capt. Rose is sacrifice personified. This @CUAggies &amp; @UofOklahoma grad is most deserving of the #MedalofHonor. https://t.co/8sv7rWhhai"]["Scott Palk is not controversial. He was nominated by both Pres. Obama &amp; Trump, yet Democrats stall &amp; waste time. We need #GridlockReform https://t.co/frcD7sBpER"]["Glad my staff was able to attend the departure ceremony for the 180th Cavalry Regiment earlier today. God bless our Oklahoma heroes. https://t.co/AR9puJcHJP"]["@Georgetown We must “recognize different viewpoints, revere our deep commitment to religious freedom.” -Pres.Obama after 15' Obergefell v. Hodges ruling"][".@Georgetown shouldn't use its freedom as a private school to discriminate against students based on their beliefs https://t.co/RZ0c5f7sa2"]["Senate just voted 79-18 on cloture for Scott L. Palk for U.S. District Judge for Western District of #Oklahoma. Final vote today or tomorrow"]["Jeff Flake is a strong advocate against gov’t waste. The Waste Report Caucus won't be the same w/o him. He's a good man &amp; will be missed."]["The Senate Intel Cmte tday reauthorized a key intel program that ensures national security &amp; protects civil liberty https://t.co/9w6gHCehUb"]["Good mtg with my colleagues &amp; @POTUS today. #TaxReform provides an opportunity for economic growth, job creation &amp; higher wages."]["Helping family &amp; small businesses grow through #TaxReform will create jobs, lift wages &amp; reduce debt. \nhttps://t.co/wtRRqYf5vZ"]["Congratulations, Dr. Melchor Antunano on this well-deserved honor. I know you will lead well at IAASM. https://t.co/kWfSFeeRA0"]["Talked #NigerAmbush &amp; current state of #ISIS on @foxandfriends this morning. WATCH → https://t.co/4X9o1YWOvq"]["I joined CBS @FaceTheNation today to discuss the deadly raid in Niger, and the need for #taxreform to grow economy &amp; reduce #federaldebt. https://t.co/eiT6OSlMpv"]["TUNE IN: Looking forward to joining @FaceTheNation on Sunday. https://t.co/b6dgSMzlzB"]["Tonight’s FY2018 budget provides a path for #TaxReform that brings tax code into the 21st century &amp; grows economy. https://t.co/l8AqIuLzSf"]["Busy day but I’m also working on this year’s #FederalFumbles. @BenSasse do you like this entry title? Heard you were Nickelback’s #1 fan. https://t.co/iDdSOw587H"]["Kirstjen Nielsen's extensive experience at @DHSgov will serve us well as she leads the agency. Looking forward to her confirmation hearing. https://t.co/ORXXumX5HZ"]["Great group of Okies at #JavawithJames this morning. If you're planning a trip to DC, stop by Wednesdays the Senate is in session at 9am! https://t.co/WhfH2YNteI"]["Good news. The US-backed Syrian Democratic Forces have worked diligently over 4 months &amp; delivered a crushing blow to the terrorist group. https://t.co/AfVuUmFB9C"]["States are starting to take action before next election. Congress must also be ready to ensure election security. https://t.co/NmWATuiNF2"]["TUNE IN: I'm on @KFOR Flash Point w/@kforkevinogle @MikeCTurpen &amp; Kirk Humphreys tomorrow at 9:30am to talk national security &amp; other topics https://t.co/OBPEbI9pSQ"]["Great to see so many of you at my #CommunityConversation last night in Tulsa. Special thanks to Doc Shaw &amp; @pocketofhope! https://t.co/0Q3h9amSq4"]["Happy Birthday @USNavy! Thank you for 242 years of exceptional service &amp; sacrifice. #NavyBirthday https://t.co/yiyruQieFM"]["Great music &amp; great conversation at the #Big10Ballroom in Tulsa. If you couldn’t make it, tune in HERE: https://t.co/EKM0orHxAm https://t.co/htIaauYI18"]["If you couldn’t make it to my #CommunityConversation in Tulsa tonight, tune in to the #FacebookLIVE: https://t.co/EKM0orHxAm"]["Today's #healthcare Executive Order is good. Congress should still pass reforms to provide stability &amp; lower costs. https://t.co/ty3jVnTWOe"]["Great to spend some time in #Muskogee today, at the @GriffinFoods manufacturing plant, Muskogee Rotary Club &amp; Boulevard Christian School. https://t.co/QGnqylOSN3"]["Kirstjen Nielsen's long history at DHS &amp; work on cybersecurity will serve the Department well. Nielsen is a solid pick for DHS Secretary."]["Outstanding work being done at our #Oklahoma universities. \n\n#GoPokes https://t.co/3HEHyFMQEn"]["Hope to see you tomorrow for a #CommunityConversation at the historic Big 10 Ballroom in North Tulsa. More info: https://t.co/ykEIRygZcD https://t.co/Uz9Kv0M1yf"]["Great to catch up w/ some of our nation's very best. Thank you for your service &amp; commitment to national security. https://t.co/dwvCcsoSmS"]["Has your family ever invited a family of another race to your home for a meal? Check out #SolutionSunday w/ @SenatorTimScott &amp; be inspired. https://t.co/ThM4OjNB6m"]["Truly exemplifying the #OklahomaStandard. Well done @507arw. https://t.co/uSVLw6R78c"]["Join us Thurs. for a #CommunityConversation at the historic Big10 Ballroom. Performances by @pocketofhope &amp; others\nhttps://t.co/ykEIRygZcD https://t.co/dGN1BqOf5V"]["Thanks @JeremyCRadio &amp; @plarsen7 for having me on @crossoveronline to discuss #Dreamers &amp; bipartisanship in Congress\nhttps://t.co/nn9BfNK9FB"]["No one thinks our #immigration system works well. I appreciate the White House's input on reforming our system. https://t.co/gmw3Y6jj6w"]["Today marks an unfortunate anniversary - one year since #AndrewBrunson was unjustly imprisoned in #Turkey without charges. https://t.co/x6xWjtvT6h"]["Today our bipartisan Congressional-Executive Commission on China issued the 2017 Annual Report. It details #humanrights conditions in #China https://t.co/yDEoPf7mzj"]["Ability to live your faith, or have no faith, is an American right. I applaud today’s actions on #ReligiousFreedom. https://t.co/NIfqeOXrrN"]["It’s completely unacceptable for a NATO ally like #Turkey to unjustly imprison an innocent American. #AndrewBrunson https://t.co/fj1xOGxJT3"]["The Johnson O’Malley Act is a critical program that provides academic assistance to Native American students. Glad it passed Committee https://t.co/bexEW9weqp"]["I joined #MTPDaily with @ChuckTodd today to discuss the Senate Intel Cmte's #Russia investigation &amp; also Secretary Tillerson → https://t.co/vw5UeWmec7"]["I'm pleased that these 3 bipartisan bills, to help federal agencies hire the best workforce &amp; reorganize agencies, passed Committee today. https://t.co/yYFdQmTRk3"][".@SenatorBurr &amp; @MarkWarner to give an update on our Senate Intel Cmte #Russia investigation today at 12:15pm ET.   https://t.co/YhiSSUZa0G"]["Great to see so many Okies on the Hill yesterday. Glad I could spend some time and catch up w/ @MWCChamber &amp; @OklahomaBankers. https://t.co/aqtjsd2YCi"]["Thank you House for passing #MicahsLaw &amp; protecting the unborn. It's time for the Senate to do the same. #TheyFeelPain https://t.co/Tu6l5IRiex"]["Congress voted down #DreamAct in 2007,2010 &amp; 2013. It's time to work together on an alternative to protect #Dreamers https://t.co/QEsQcH6Z47"]["ICYMI: I spoke w/ @kilmeade on @foxnewsradio to discuss the shooting in #LasVegas &amp; my #DACA reform proposal, the #SUCCEEDAct. Listen → https://t.co/Q8hzvgEY3d"]["Congrats to Frank M. Coffman &amp; Johnny Lee Kuhlman of OK on their nominations to serve as US Marshals. Thank you for your continued service!"]["#SUCCEEDAct is a fair solution to #DACA, while prohibiting chain migration &amp; discouraging future illegal immigration https://t.co/tlESuUoo3h"]["Our prayers are with the victims &amp; their families of the despicable act of terror in Las Vegas. This was pure evil."][".@GovMaryFallin's #FeedingOklahoma food drive starts off today. Learn more about how to help &amp; where to donate → https://t.co/9BiaobHQwi"]["@BenSasse Don't hate 😏"]["...Grove Valley Elementary, Dove Science Academy &amp; Westwood Elementary. Well done! #oklaed (2/2)"]["Congrats to our OK 2017 National Blue Ribbon Schools: Earl Harris Elementary, Centennial Elementary, Cheyenne Middle School... (1/2)"]["Officially h0me. #WHYNOT https://t.co/bbZ7DqDNL2"]["I applaud the administration for prioritizing the safety and security of our US personnel abroad. https://t.co/2dv4RcUzzH"]["Y'all have been warned...\n\nDon't mess with @BenSasse! 👀\n\nhttps://t.co/TwD4qtjJUj"]["I’ve co-sponsored a bill w/McCain &amp; Lee to permanently exempt #PuertoRico from #JonesAct, to help long-term recovery https://t.co/0EsD8z6doR"]["Amen! Welcome back, @SteveScalise. What an answer to prayer. https://t.co/blaPlf2Tro"]["Russia meddles in American elections &amp; issues to create chaos &amp; division in our society, even using the NFL debate. Don’t let Russia succeed https://t.co/GMOgejPSkx"]["Very encouraged by direction of #taxreform talks to alleviate some of the tax burden on both hardworking American families &amp; job creators."]["We haven’t had meaningful #taxreform since the 80s. It's past time to update &amp; simplify our complicated code to reflect the 21st century."]["Great to see you @AspasiaCarlson and congrats on OK HS Principal of the Year! https://t.co/vBTW0CxV01"]["ICYMI: I spoke w/ @kilmeade on @foxandfriends to discuss the #SUCCEEDAct, my conservative alternative to the Dream Act. Watch → https://t.co/4xS9lmzN7H"]["Great to see so many young people observing #SYATP this morning. 1st amendment protects the right to pray just as much as to not participate"]["An unborn child feels pain at 20 weeks. At a minimum, we should protect this life. Thanks @RepTrentFranks for your leadership. #TheyFeelPain https://t.co/2js8PYnVWV"]["Skyped w/ @swosu freshman &amp; sophomores this morning from my DC office. Great questions on #healthcare. #GoDawgs https://t.co/IhxzMQjHw9"]["REALITY CHECK: The #DreamAct was voted down in 2007, 2010 &amp; 2013. Since it cannot pass Congress, let’s come together &amp; discuss alternatives https://t.co/lP1YqEHr3t"]["I'll just leave this here. #THUNDERUP https://t.co/uU3KP81Ycn"]["Introducing immigration legislation w/ @SenThomTillis, @senorrinhatch at 12pm CT. Watch LIVE here → https://t.co/nXmHy1X2XM #SUCCEEDAct"]["What an amazing beatification mass today for Oklahoman Rev. Stanley Rother, the Roman Catholic Church's first U.S.-born martyr. #BLRother https://t.co/RvjYX4dGuP"]["WOW! \n\nDidn't see that coming.... \n\n#WhyNot \n#ThunderUP https://t.co/at6n87tSKK"]["The #Russians are a determined adversary. We must all secure our election systems &amp; work together. We cannot be caught flat-footed in 2018. https://t.co/p4X6OIypSo"]["Congress has about 6 months to fix #DACA. Next week I'll introduce a bill to protect Dreamers. Here is a preview: https://t.co/cwrkhOxorj"]["I applaud POTUS' N.Korea sanctions. It's necessary to cut off addt’l sources of financing for the despotic &amp; reckless regime of Kim Jung-un"]["US ag exports are on the rise. The ability for our farmers to sell goods abroad is important for Oklahoma &amp; the US economy. @USDAForeignAg https://t.co/ZdoMUCirV4"][".@ItsDarciLynne takes the cake! Congrats to Oklahoma's favorite ventriloquist! #AGT #DarciLynneWins https://t.co/dWKYsJjJcR"]["Wishing the Jewish communities of Oklahoma and across our nation a sweet new year. Happy Rosh Hashanah! https://t.co/Bt44KZZ2lT"][".@President_Boren is an Oklahoma institution. Thank you for your faithful service! #DBo #BoomerSooner"]["It's #NavyWeek in OKC. Great to honor those who serve and see how they spread messages of service &amp; sacrifice around the city and at @OKCNM. https://t.co/amC5k9Ye8v"]["My thoughts &amp; prayers are with the people of Mexico as they deal with this devastating earthquake. America is with you."]["Heartbreaking testimony, but very important to hear. Thank you Yvonne for showing us why Congress must pass #SESTA.\n\nhttps://t.co/LdISQB6aFj"]["Houses of worship should be able to apply for #FEMA grants after natural disasters just like other entities. MORE: https://t.co/VRP3AcVdhO"]["Tonight, we passed the bipartisan National Defense Authorization Act to ensure our troops have what they need for national security. #NDAA"]["POTUS is right. The UN has become a bloated bureaucracy. The focus should be on results &amp; helping people, not simply more UN jobs. #UNGA https://t.co/H6OwwdEOha"]["Happy birthday @usairforce! Thank you to all the #airmen for 70 years of service! #AimHigh #AFbday https://t.co/kuxMPOGNCf"]["Cuba’s neglect of its duty to protect American diplomats &amp; their families cannot go unchallenged. https://t.co/lc1R6R61aK"]["Congrats to Okie Shane Jett on his appointment as Native American Tribal Representative on POTUS's Community Development Advisory Board!"]["Kim Jong-un's missile launches show how much he doesn't care about his own people. Each new provocation increases likelihood of lost lives."]["Great news! By unanimous consent Senate just confirmed Brian Kuester, Trent Shores as US Attorneys for Eastern,Northern District of Oklahoma"][".@SenThomTillis &amp; I are working on a DACA bill. As POTUS said, these are educated &amp; accomplished young people, productive members of society https://t.co/uG7qVPjjn6"]["It was great to talk #TaxReform, #RegulatoryReform &amp; immigration this morning with #Oklahoma job creators. #DCFlyIn2017 @okstatechamber https://t.co/1CUpZJK2GB"]["I always appreciate the time I have to catch up with @ArchbishopOKC when he's in DC. Great to see you today Archbishop Coakley! https://t.co/x1no4pho6X"]["Very good news. https://t.co/GNuDbMJdpq"]["Great hearing today on the federal workforce. We will be more efficient when we cut down on waste &amp; duplication among agencies. https://t.co/vjrizsT7QD"]["Chairing a hearing on reorganizing the federal workforce this morning. Tune in NOW: https://t.co/JBwju7VPEZ"]["Great to connect with @AFRFarmOrg today! https://t.co/rtAI0Smvo4"]["Busy day today w/ hearings &amp; policy meetings, but I was glad have time to sit down w/ @AIPAC President Lillian Pinkus this afternoon. https://t.co/ZF3oxUbzHD"]["BREAKING: The U.S. federal #debt just surpassed $20 trillion. What a travesty. #DebtCeiling #FederalFumbles \nhttps://t.co/WtVKSVtZoe"]["Terrorists tried to divide &amp; destroy us 16 years ago, but we came together as a nation more united than ever. #NeverForget https://t.co/l7wWjwZZOI"]["Cindy &amp; I join Americans across the nation in prayer for Florida as they face #HurrcaneIrma. 🇺🇸"]["Another great Military Academy Day event, this time in Lawton. I'm thankful for all of the Service Academy recruiters who joined us. https://t.co/UVrZEFHNj5"]["Let's go guys! #Boomer #BeatOhioState https://t.co/dw3KPFBMVi"]["This morning's Military Academy Day in Muskogee was a great success. We have many young Oklahomans interested in attending a Service Academy https://t.co/KYKKjlJNxy"]["Here’s my plan to fix the #filibuster &amp; enact process reform to get the Senate working. #GridlockReform https://t.co/zbQ0RPT6PC"]["Good news for the 1st Amendment. Federal court affirms #prayers offered by legislators don't violate Constitution\nhttps://t.co/3JGeTQgn2A"]["In another 3 months, we will debate the #debtceiling again; hopefully, we'll consider serious reforms &amp; debt reductions at that time. (7/7)"]["Months ago, I laid out a plan for the #debtceiling that would focus on addressing the debt &amp; providing predictability to the markets. (6/7)"]["Just a reminder that in FY16 alone, we had a $587 billion deficit &amp; our federal debt is now an outrageous $19.8 trillion. (5/7)"]["It has become clear that Washington no longer sees the debt limit as a chance to actually tackle our runaway debt problems. (4/7)"]["Disaster relief &amp; the debt ceiling should have been completely separate. Period. (3/7)"]["2nd option combined #Harvey relief, a #debtceiling increase, &amp; short-term funding until December 8, which I did not support. (2/7)"]["We had 2 options to address disaster relief for #HurricaneHarvey today: a stand-alone bill that I fully supported &amp; a 2nd option... (1/7)"][".@SenJudiciary today approved Brian Kuester &amp; Trent Shores for US Attorney for Eastern &amp; Northern District of #Oklahoma. Next step: Senate"]["I applaud @BetsyDeVosED's decision today. The @usedgov is taking a positive regulatory step to address the problem. https://t.co/5yLXjPmjHn"]["We shouldn't raise #DebtCeiling w/o reform or cuts. That's the purpose of a debt limit. 3-mo. deal doesn't do either https://t.co/pgid3LqMck"]["If Congress comes through on #TaxReform, it will be to the long-term benefit of the nation. \n\nvia @TheOklahoman → https://t.co/mpeK1zO5WQ"]["Looking forward to our Oklahoma judicial nominees getting a vote this week in Senate Judiciary Committee → https://t.co/OhJ5b0Cv72"]["The #DebtCeiling tends to produce more crisis theatre than actual debt reduction. It's time to consider reform. https://t.co/ZmoHh89jA0"]["North Korea: it makes no sense to further isolate yourself. We all want peace. The U.S. will always stand up for ourselves &amp; our allies."]["#Oklahoma is way ahead of the curve on election machine security &amp; ballot integrity. https://t.co/zdP28NsR18"]["I applaud the nomination of Rep. Jim Bridenstine to be the next NASA administrator. My full statement → https://t.co/G2UZjgUFTB"]["The #DebtCeiling debate should be an opportunity for budget reforms. Our $20 trillion debt (and growing) will eventually hurt the economy. https://t.co/WKTL8j0sVS"]["In the face of a corruption investigation in #Guatemala, the rule of law must prevail https://t.co/hkN4c00LNW"]["So good to finally have college football back! \n\n#OKState #GoPokes\n\n#UTulsa #ReignCane"]["Thank you, @RepTrentFranks for this incredibly moving testament to life.\n\nTake 5 minutes and read this today: https://t.co/WlQerxYS9b"]["More ways to help #Harvey victims. \n\n#OklahomaStandard https://t.co/wMVt14xP0D"]["OG&amp;E crews arrive in Texas to serve #HurricaneHarvery victims. First stop: staging at the airport in Rockport, TX. #OklahomaStandard https://t.co/1LQiSckRl5"]["So many Oklahomans have lived out the #OklahomaStandard by helping #Harvey victims. Here are more ways to help: https://t.co/Xv9ifkSEa2"]["Taking #JavawithJames on the road this morning at The Lokal Okmulgee. Great to connect over a cup of coffee. https://t.co/G9gPSHGLMe"]["Tune in to my community conversation via #FacebookLIVE NOW: https://t.co/pBXYX0lKU6"]["Hosting a community conversation tonight at @okchristian from 5-6pm. Looking forward to the conversation! https://t.co/PV03XGhrMC"]["Japan is our ally. The U.S. &amp; the international community must stand firm with them against this very serious threat."]["The North Korean missile launch over Japan is a very dangerous provocation and a major step in the wrong direction for Kim Jong-un."]["This day in 1963, MLK dreamed that all would not be judged by the color of their skin but the content of their character. #MarchOnWashington https://t.co/iqTx4Cvx2X"]["Great to catch up w/ @EdmondChamber at their membership lunch, talking healthcare, federal debt, &amp; national security. https://t.co/DeUPUDXHQe"]["Thank you to OK organizations doing all they can to help victims of #HurricaneHarvery → @OGandE @USGS_Oklahoma @OKCFD \n@SalArmyAOKEDS"]["OG&amp;E, state search &amp; rescue crews, Central OK Salvation Army staff respond to hurricane flooding relief efforts: https://t.co/KdLUWqjbkq"]["I know red heads are supposed to stick together &amp; all but..... I just don't see an upset tonight. #MayweathervMcgregor"]["Praying for our neighbors to the South across the Red River as they deal with #HurricaneHarvey"]["We should keep the 60-vote filibuster, but change other rules to make the Senate work again. #GridlockReform https://t.co/IsQgntrJeb"]["#DebtCeiling exists so Congress can address growing debt, not so we can automatically raise it w/o cuts or reform https://t.co/LhSRc59z81"]["#OKState tops the nation in Native Americans earning bachelor degrees in engineering. #GoPokes \nhttps://t.co/EcYIYpKbmN"]["To get through the basic operations of the Senate, we need to enact  #GridlockReform. My idea for \"How to Make the Senate Work Again\" → https://t.co/2ccflp8tTw"]["Glad the administration is working on an #AfghanStrategy that will lead to an #Afghanistan that can defend itself &amp; root out extremism."]["The Upper Chamber has become too inefficient at performing the basic tasks of the Senate. The time for #GridlockReform has come. https://t.co/iJqMHwQB5H"]["Contrary to popular belief, you can look at my hair without #EclipseGlasses! #Eclipse2017"]["When was the last time your family had dinner in your home with a family of another race? #SolutionSunday https://t.co/zNhiFbBEDo"]["We should engage each other &amp; celebrate ethnic diversity instead of using it as a wedge to divide. #SolutionSunday https://t.co/IlVQJqQ5Pv"]["It’s been a divisive week for America. I want to encourage you to consider me &amp; @SenatorTimScott’s #SolutionSunday Initiative challenge. https://t.co/jnyAtWBTyh"]["Devastating to see such hate and violence carried out on innocents. My prayers are with all those affected in #Barcelona."][".@kenblackwell is absolutely right. The Time Has Come For #GridlockReform. We must make the #Senate work again. https://t.co/cc35xy2ibl"]["Our words must not create confusion. The supremacy of any race is abhorrent, unAmerican &amp; should be condemned by everyone. Full stop."]["Updating #NAFTA makes sense, but cutting the trade deficit through barriers &amp; taxes on imports would hurt US workers &amp; consumers. #FreeTrade https://t.co/3KClmXzBtu"]["Check out my op-ed in today's @washingtonpost: The Truth About the #Trade Deficit → https://t.co/x7376S07l2"]["MUST READ from @SenatorTimScott → Fight hatred, fear &amp; domestic terror with American ideals. \n\n#SolutionSundays https://t.co/hqyyWWLRER"]["As a nation, we must recommit to build respectful unity together &amp; honor the human dignity of all people. https://t.co/xan2MSCsPv"]["While some may want to remain divided, we cannot and must not ignore the dissension in our culture."]["The supremacy of any race over another is not only immoral, it's contradictory to our Constitution and the idea of America."]["I'm incredibly grieved by the violence &amp; hate that is taking place in Charlottesville."]["The Senate has much work to get done, but we will deliver for the American people behind @SenateMajLdr McConnell."]["On unity and respect... this op-ed is just as relevant today as it was a month ago.\nhttps://t.co/UafYkVX0N8"]["Praying for your surgery and for a speedy recovery. I'll see you soon, @JohnBoozman! https://t.co/gwWilWcXay"]["Ever wonder what a typical day in DC looks like? Here's an inside look → https://t.co/lJfRKY1WW4"]["The world wants to see the N.Korean people prosperous &amp; living in peace. World must also be firm &amp; united in holding Kim Jong-un accountable"]["Kim Jong-un wants the world to respect N.Korea as a responsible member of the int'l community. His actions create the exact opposite dynamic"]["Be sure to check out storm clean-up aid available through @BAChamber &amp; @TulsaChamber → https://t.co/T6M3jORnfD, https://t.co/zjaN8jtjvE"]["Thank-you @chickfila Southroads for serving 600 clean up workers &amp; volunteers w/free food today. One of many serving #Tulsa. #oklahomastrong https://t.co/yDKbwEmF58"]["If your workplace/job was affected by the storms in #Tulsa, check out the resources at @WorkforceTulsa → https://t.co/XMLdLhV14l"]["We pray for the many who are impacted, including those in the hospital &amp; the many who still don't have power. https://t.co/nmeNcQRcUz"]["I'm grateful that it doesn't appear that last night's tornado in #Tulsa caused any fatalities."]["Great jobs report today. 4.3% rate is a 16yr low. The regulatory halt is leading to a 16yr high in confidence.\n\nhttps://t.co/kswcPzjMYA"]["It just feels right that the #Cowboys open the preseason... since they'll probably end the season on Feb 3. \n\n#HallofFameGame to #SuperBowl"]["Important reforms to provide the support our #veterans deserve to better transition to civilian industry headed to the President's desk → https://t.co/Xb9nBNB5jw"]["Congrats to OK's Director of Aging Lance Robertson for being unanimously confirmed by the Senate to be HHS Assistant Secretary for Aging https://t.co/L72C4BlYrV"]["TUNE IN: I'll be on Fox News @AmericaNewsroom at about 8:30am CT (9:30am ET) to discuss #immigration &amp; Russia, Iran, &amp; North Korea sanctions"]["ICYMI: I joined @JakeTapper on @CNN to talk #RussiaSanctions &amp; Senate gridlock. WATCH → https://t.co/AjuEX0vKPG"]["We should keep the 60-vote filibuster, but change other rules. Senate is the only entity in fed gov’t where the minority view is protected https://t.co/vwIC2enAUA"]["I applaud the @POTUS for signing a sanctions bill today to reign in the reckless regimes of Russia, N. Korea &amp; Iran https://t.co/JQoJi8TSyb"]["Here's How to Make the Senate Work Again. Keep the 60-vote filibuster but change these rules → https://t.co/KUeMDwNDH4"]["This legislation is needed to help protect vulnerable people, #EndHumanTrafficking &amp; support the work of organizations like @MissingKids https://t.co/lI8P6gYuQJ"]["I’m pleased Christopher Wray has been confirmed FBI Director. His experience in private &amp; public service will serve our nation well. https://t.co/qJlhGiXo3F"]["Proud to join this bipartisan group to #EndHumanTrafficking &amp; bring justice to victims → https://t.co/sP23aT7DM1 https://t.co/uYBHUtjoLF"]["Sanctions on the president of #Venezuela are warranted. Nicolás Maduro’s oppressive rule is hurting the very people he’s supposed to serve."]["I'm glad Nguyen Cong Chinh &amp; his family are free. We must continue to press Vietnam on their poor #humanrights &amp; #religiousfreedom record. https://t.co/jEjpznPwWq"]["What a week! Profanity. Fights between staff. Controversial statements from leadership. A man cut from the team.\n\n#CowboysCamp #AmericasTeam"]["Good news. The U.S. must not ignore Russia's meddling &amp; provocative actions. We should respond with clear words backed by decisive action. https://t.co/U3t3KQbloj"]["Reince Priebus did a good job as chief of staff. His expertise &amp; relationships with Congress benefited the White House in many ways."]["Unfortunately, the real losers are families trying to make sense of the chaos of their finances &amp; their gov't https://t.co/lFY9El3uEv"]["Some pundits today have focused on what politician or political party \"won\" or \"lost\" over the healthcare vote. This reaction is frustrating"]["Great to see Lebanese PM @saadhariri this morning. The US must continue to be a willing &amp; stable partner to Lebanon. https://t.co/aaSCR0Tz8V"]["#CBO score: Obamacare #RepealAndReplace results in millions of Americans CHOOSING not to buy insurance, not LOSING insurance. Big difference https://t.co/FmVjH53UB5"]["The Senate just voted 98-2 for sanctions against Russia, Iran &amp; North Korea. Provocation from these regimes must not go unanswered."]["TUNE IN: At around 6:30pm ET (5:30pm CT), I'll be giving a floor speech on #healthcare. Watch on C-SPAN2"]["A well-deserved honor. We must continue to provide Capitol Police the resources they need through Leg Branch Approps (passed cmte this AM). https://t.co/Yyd33bufUA"]["The fact that the majority of members on the Appropriations Committee voted to protect a budget gimmick is truly bananas → https://t.co/psMPIYU4A4"]["My staff attended the homecoming ceremony for some of our deployed Oklahoma troops yesterday. God bless you &amp; welcome home! https://t.co/1qQGibiF4U"]["I applaud the nomination of Sam Brownback as Ambassador-at-Large for Int'l #ReligiousFreedom at the State Dept https://t.co/gEuCIMeY09"]["Attorney General Jeff Sessions was right to recuse himself from the Russia investigation. Firing Sessions would be a big mistake. https://t.co/K38xtLuhZd"]["Reform idea - instead of setting an arbitrary deadline, Congress could set a biannual limit &amp; plan ahead on how to address debt reduction"]["Measures to avoid #DebtLimit cost taxpayers billions. And the process produces crisis-theater rather than reforms needed to rein in spending https://t.co/u5Z8EFPD9f"]["Great to hear - looking forward to your return @SteveScalise! #TeamScalise https://t.co/dZ0uOV77vM"]["Great to start this Wednesday with coffee &amp; conversation w/ Oklahomans at #JavawithJames in my DC office! https://t.co/vVboIWI7Ff https://t.co/Rc7Jpkd0ib"]["Late tonite, the Senate voted on a healthcare amendment - revised BCRA w/ Consumer Freedom Option. It failed 43-57. More amendments tomorrow"]["These sanctions are a positive step towards holding the oppressive leaders of Russia, North Korea and Iran accountable. #NationalSecurity https://t.co/ZwFy7tDvIN"]["On today's \"motion to proceed\" &amp; next steps for #healthcare reform → https://t.co/xTPf4xoJEb"]["I’m committed to reform that increases access &amp; lowers costs for Oklahomans of all income levels &amp; health conditions. Let’s start debate."]["This MTP vote will simply begin the open debate &amp; amendment process. This is not a vote on any specific healthcare bill"]["Just voted for today’s #motiontoproceed so the Senate can begin a  bipartisan, open debate &amp; amendment process on healthcare reform."]["Rest in peace, Lt. Heath Meyer. Your sacrifice will never be forgotten. Join me in praying for his family &amp; Oklahoma Highway Patrol."]["Looking forward to seeing you back in the Senate  @SenJohnMcCain! https://t.co/sSET3z1Uk5"]["The Senate Intel Cmte doesn't talk publicly about conversations &amp; interviews that occur within our closed meetings or hearings."]["Closed mtgs are a regular part of our Cmte. The ability to discuss sensitive info in a secure setting is important for national security."]["MUST READ by @EricaJedynak &amp; @johnmtidwell about the bipartisan bill from @CoryBooker &amp; me to cut federal subsidies for sports stadiums. https://t.co/DdGv5QsMH3"]["I joined @FoxNews #SundayFutures to discuss #healthcare, #taxreform &amp; how to Make the Senate Efficient Again. WATCH: https://t.co/YKaMPAWUFR"]["TUNE IN: I'll be on @FoxNews @SundayFutures at 10aET to discuss #taxreform #healthcare &amp; my proposals to make the Senate more efficient"]["America remains deeply divided along racial,political &amp; other lines.This wknd,be a part of the solution. \n\n#SolutionSundays #LoveThyNeighbor https://t.co/YcSl0rZx6k"]["My Washington, DC office at the U.S. Capitol is accepting applications for Fall internships. For info, click here: https://t.co/rU9oXJ0AOX https://t.co/LCdvwONZa2"]["Great to join @EWTNNewsNightly yesterday to discuss John McCain &amp; healthcare reform talks in the Senate. WATCH: https://t.co/csW3lmslWL"]["TUNE IN: I'll be on @EWTNNewsNightly w/ @LaurenAshburn at 6pm ET (5pm CT) to discuss John McCain, #healthcare reform &amp; Senate Intel Cmte."]["We welcome you back soon! https://t.co/PmtiQGdCj8"]["Feeling optimistic that my #FederalFumbles proposals will pass Committee in these bills. Stay tuned.... https://t.co/2MQUlv3E9T"]["Not all regs are bad, but some are unnecessarily burdensome on jobs &amp; families.This is good news. #RegulatoryReform\n\nhttps://t.co/Q6oFDNRTZK"]["Senator John McCain is a fighter. If there is anyone who can beat cancer, it's John. Praying for you @SenJohnMcCain"]["MUST READ @NewsOK Op-Ed → Time to junk government's \"social cost\" estimates https://t.co/f9v15985he"]["Heading to WH to discuss Obamacare repeal.We must find a path to lower #healthcare costs for people of all income levels &amp; health conditions"]["Talked to @PC1170 this morning about #healthcare &amp; #RepealAndReplace. Listen HERE → https://t.co/xDByAKexeC"]["TUNE IN: Our #HSGAC hearing on this issue begins at 10am ET (9am CT). Watch here: https://t.co/CEgoxzPHOH https://t.co/dWrZvG5abn"]["My thoughts on a #HealthcareBill in the Senate → “This is something that has to be done” https://t.co/aoOplP78Nw"]["TUNE IN: I'll be on @foxandfriends at about 7:15am ET (6:15am CT) to talk #healthcare."]["The Russian gov't continues to stifle #humanrights &amp; freedom.... https://t.co/qGGEiP8nFw"]["Great to see @ditchwitch representing Oklahoma at the @WhiteHouse today for #MadeInAmericaWeek → https://t.co/ycBpBoX6Bz"]["Bad actors are trying to hack our election, gov’t &amp; business systems. We must draw clear lines &amp; fight back. #cyberdoctrine #cybersecurity https://t.co/VsqkSXNpvc"]["We can get a man zombie #emoji but still no redhead?! #whereisthelove #GingerProblems #WorldEmojiDay"]["@rickhogaboam Good for you Rick. Remember your priorities... People are always watching you more as a pastor, than a politician. #KeepGodFirst"]["Anyone who has ever worked in fulltime church ministry probably figures that Congress wasn't my 1st experience w/politics. 😂 https://t.co/6ZAfZTNOdK"]["Get well soon my friend. We pray for a speedy recovery. https://t.co/tXZiDxjuCA"]["If the Senate moves forward w/ #healthcare reform, it must include an open bipartisan debate &amp; amendment process. https://t.co/BnfR6xz3O9"]["....the #AffordableCareAct has problems. Deductibles are too high. Co-payments are too high. -Bernie Sanders (June 26, 2017) #healthcare"]["Judge Goodwin has served #Oklahoma well as a magistrate judge. I hope he's confirmed by the Senate soon. https://t.co/zV4AZn1I1S"]["TUNE IN: I'll be on @PBS @NewsHour tonight for Part 5 of Inside Putin's #Russia, a look at US-Russia relations."]["My fellow @CECCgov Commissioners &amp; I are deeply saddened by the death of Nobel Peace Prize winner &amp; #humanrights advocate #LiuXiaobo https://t.co/03KcdlZbIa"]["Chris Wray’s strong leadership in private &amp; public service will serve our nation &amp; #FBI well. Looking forward to supporting his confirmation https://t.co/c5039PlQ0b"]["Today we remember how precious our liberties are &amp; press on spreading the empowering values of respect for life &amp; liberty. #RIPLiuXiaobo"]["Great to catch up w/ Chief Lankford of the Miami Tribe of Oklahoma yesterday to discuss issues important to the Tribe &amp; #IndianCountry https://t.co/2Gv2NVdG0n"]["The best of the best. Congrats @russwest44! #InRussWeTrust #0urMVP https://t.co/F31akgBlc3"]["We must remember we can disagree without being disrespectful. Let's continue to recommit to unity &amp; civility. #NationalDayofCivility https://t.co/41v8CXVZor"]["@SenSchumer Mr. Nye was nominated back in May. Instead of slow-walking process, Senate normally confirms nominees w/unanimous support quickly."]["Senate just confirmed David Nye as a Judge 100-0, yet @SenSchumer stalled his vote for 3 days. It makes no sense to stall unanimous nominees"]["Great to connect w/ Oklahomans in DC today at #JavawithJames. Stop by Wed mornings when the Senate is in session! https://t.co/zpS5eFzKcB https://t.co/M5yDqobvAl"]["Good news. I applaud @USGSA's move to protect U.S. gov't systems from prying Russian eyes. #cybersecurity\nhttps://t.co/lplxl9neHY"]["I am committed to following through on our promises. Oklahomans deserve it. https://t.co/jeXMIag9ZL"]["This Senate has only confirmed 23% of nominations. At this time in Obama's first term the Senate had confirmed 69%. https://t.co/54WrEiQt1R"]["Heartbroken learning about the plane crash involving 16 of our Marines  yesterday in Mississippi. God be with them and their loved ones. https://t.co/CMws2OhdDf"]["TUNE IN: I'll be on the @hughhewitt radio show Tuesday at about 7am ET (6am CT) to talk #healthcare &amp; #nationalsecuriy."]["Congratulations to Floyd and Verna Akin of Maud on their 70th wedding anniversary. Truly a remarkable love story → https://t.co/JuLPFtY8I6"]["My thoughts on Donald Jr.'s mtg w/ Russians, the POTUS' mtg w/ Vladimir Putin, &amp; how America must protect our cyber security. https://t.co/2hZgxM6jFx"]["TUNE IN: I'll be on @NPR @MorningEdition at about 7am ET (6am CT) to discuss cyber security issues &amp; America's need for a cyber doctrine"]["The Bible is not Republican nor Democrat. It's so much greater than any political party... it's inspired by God. (2 Timothy 3:16) https://t.co/qWFvhpdhf0"]["Spent some quality time down in Altus on the #C17 &amp; #KC135 yesterday. Grateful for the men &amp; women at @97AMW. https://t.co/MPhv1iYNWN https://t.co/fUNl6SasgB"]["#JobsReport shows 222K jobs added,surpassing estimates.Good news! But labor force participation still a problem. #RegulatoryReform will help"]["#Russia won’t change their behavior until they experience consequences for their meddling in our 2016 election. https://t.co/chmFX0zfVW"]["#CharlieGard should be afforded the chance to live. #LetCharlieLive \nhttps://t.co/mI2oMnJpy9"]["Kim Jong Un should immediately end all nuclear &amp; missile tests, begin peace talks, release all U.S. citizens, &amp; focus on feeding his people"]["During my visit to #SouthKorea in December, I discussed options with South Korean leaders &amp; United States Forces Korea joint command"]["The Kim Jong Un regime in #NorthKorea is playing a reckless game.Diplomacy must be our 1st option, but nothing should be taken off the table"]["@KaputRose Completely 2 different issues. Trinity Lutheran requested a state-funded program for childcare facilities for safety. Not federal."]["I love sports, but federal subsidies shouldn't finance stadiums for multibillion dollar franchises. #govtwaste \nhttps://t.co/YYfrRqfkg1"]["From the Liberty Fest Parade in Edmond.... Happy #IndependenceDay  \n\n#FourthofJuly2017 \nHappy Birthday, America! 🇺🇸 https://t.co/hEOGqjKQJU"]["As #America celebrates the birth of our nation, let us all recommit to civility &amp; unity. \n\n#FourthofJuly  \n\nhttps://t.co/UafYkVX0N8"]["2/3 of Americans believe #civility in politics is getting worse. We must change this, even while we disagree.\n\nhttps://t.co/UafYkVX0N8"]["Kicked off the #4thofJulyWeekend today in the #Tulsa area at the Bixby Freedom Celebration. #CelebrateFreedom https://t.co/L3Zgh5VkaL"]["Sent a letter to @SenateMajLdr requesting to cancel or shorten the August state work period. READ MORE → https://t.co/xTipg4lX21"]["These are the most important words you'll hear this 4th of July weekend. Congratulations to the newest citizens of the #USA! https://t.co/6WBbyaoeBc"]["I applaud increased sanctions to pressure #NorthKorea to stop missile development. Kim Jong-un regime is a threat to int'l peace &amp; security"]["On the President's tweets this morning → https://t.co/tJJqsV8KCb"]["Chairing an Appropriations hearing on @SenateSAA &amp; US Capitol Police funding beginning at 9:15am CT. Watch HERE: https://t.co/aMvQwI0khv"]["The Senate Armed Services Committee just passed the $640 billion FY2018 #NDAA by a bipartisan unanimous vote of 27–0. #NationalSecurity"]["Great to see @HouseJudiciary working to advance the House companion to my government transparency bill. https://t.co/90xeBOJz3X"]["So sorry to hear my friend. Your family is in my prayers. https://t.co/ItkbsO7yQi"]["WHY NOT?! Congrats @russwest44 on an incredible season! #MVP #InRussWeTrust"]["Bashar al-Assad continues to kill his people &amp; breed terrorism.I applaud the President's statement against another chemical attack in #Syria https://t.co/RXIDW1rjOr"]["#SCOTUS decision for Trinity Lutheran is a win for #religiousfreedom &amp; affirms right to live your faith w/o discrimination from the gov't."]["As #India Prime Minister #Modi visits US, he must account for India’s poor #humanrights &amp; #religiousfreedom record https://t.co/nRCmQgW9n0"]["I could spot these corduroy jackets a mile away! Great to see @FFAOK in DC this week. https://t.co/yenHfuhqov"]["Our veterans deserve the best of the best. Great to see #VAaccountability signed into law to provide better care for those who have served."]["I just spoke w/ @TheLeadCNN about my initial thoughts on the GOP draft #healthcarebill. Check it out → https://t.co/xHYRLkFS85"]["I will analyze this healthcare draft to ensure it is affordable &amp; practical for all Oklahomans. Read it here → https://t.co/cl9q0xz2B2"]["Insurance markets are collapsing, costs are rising, choice is nonexistent. Americans deserve better. #BetterCare"]["Got to meet #Bono while @U2 was in D.C. last night. Pretty cool. #U2TheJoshuaTree2017 @ONECampaign https://t.co/spipd09Y9r"]["Shocking I know, but Democrats &amp; Republicans do work together in DC. Great to work w/ @CoryBooker to cut down on government waste. https://t.co/6P1nWtCZNP"]["Our democracy depends on ensuring our state election systems are secure for future elections. #RussiaInvestigation https://t.co/WQenrwP3E1"]["Packed house this morning at #JavawithJames. Great to have so many Oklahomans stop by. https://t.co/xv0JctQEIJ https://t.co/dtQejTZkcm"]["Not sure about the sources &amp; methods of this unclassified investigation @marcorubio. We must follow the hug facts wherever they lead. https://t.co/kJ9KIOzh8Z"]["Great to have representatives from @OkOptos in DC this week. Thanks for stopping by my office today! https://t.co/ib3wkZh7nl"]["Spoke w/ @WorldRelief Pres. Arbeiter &amp; OK pastors about refugee resettlement &amp; America's posture as a beacon of hope for refugees. (4/4) https://t.co/a2zPLygOi2"]["America has always helped #refugees, either by assisting organizations who serve refugees overseas or providing legal refuge here. (2/4)"]["On #WorldRefugeeDay we remember those around the world forced to leave their homes because of terrorism, religious persecution, &amp; war. (1/4)"]["Otto Warmbier, the student held prisoner by the N.Korean Kim Jong Un regime, has died. What a devastating &amp; tragic situation for his family"]["No one should feel unsafe attending service at a mosque, temple, or church. We must respect free exercise of religion for ALL. #LondonAttack"]["Good luck to Megan Waters from Duncan Middle School as she competes in DC today at the National You Be the Chemist Challenge! @chem_ed"]["Honored to welcome Guatemala Pres. Jimmy Morales &amp; delegation for today's opening of their Consulate in #OKC. OKC's 1st official consulate https://t.co/eRR6hbhvy0"]["On #FathersDay, remember that stable families &amp; more engaged dads can address some problems in America.\nhttps://t.co/a8xqfO7ZTR"]["Ds &amp; Rs pray before the #CongressionalBaseballGame. This actually happens more than most Americans know. Glad the nation could join this one https://t.co/RB2PLAMw6f"]["@senjudiciary Scott is well known in OK for his honesty, integrity &amp; his fair approach in applying the law. Looking forward to voting on his confirmation."]["POTUS’s nominee for US District Judge for the Western District of OK, Scott Palk passed out of @senjudiciary this morning."]["The Senate just sent a clear message to both #Iran &amp; #Russia w/ increased sanctions → we will not look the other way. (2/2)"]["#Russia continuously tries to undermine our democracy while #Iran remains the world’s largest state sponsor of #terrorism. (1/2)"]["Chairing a Regulatory Affairs hearing on the #federalworkforce this morning. Watch LIVE starting at 8:30am CT: https://t.co/8pD6Zxhj31"]["I pray that God would show us how to respond to this tragedy and come together as a nation. #Alexandria https://t.co/hT4hy3igUB"]["I will be speaking on the floor shortly on the shooting in #Alexandria &amp; bravery of our #capitolpolice. Tune in → https://t.co/LQE6fZhQj6"]["Please join me in praying for @SteveScalise, congressional staffers &amp; Capitol Hill police that were shot in Alexandria. This is so terrible."]["Open #SessionsHearing at Senate Intel starting in 5 min. Watch here → https://t.co/JOrDWtMyBs"]["Introduced a bill w/ @CoryBooker to stop taxpayer money from being used to build sports stadiums. #FederalFumbles https://t.co/qg55kE27PQ"]["Talked #SessionsHearing and #religiousfreedom on @AmericaNewsroom this morning. WATCH: https://t.co/OoVHlwfzp8"]["I congratulate Brian Kuester on his nomination to be the US Attorney for the Eastern District of #Oklahoma https://t.co/YHWzglKlbA"]["Looking forward to having AG Jeff Sessions in an open hearing before Senate Intel tomorrow afternoon → https://t.co/1Jx9T3m3gV"]["My full interview on @FaceTheNation with @jdickerson this morning → https://t.co/JBJQb533Tc"]["Great to join the annual #Oklahoma Press Association Convention today. \n\nA free press is vital to a free democracy. #okpress https://t.co/jDmXCurEfg"]["\"No religious test shall ever be required...\" seems pretty straightforward to me. #ReligiousFreedom https://t.co/8w8cLVqx7W"]["My Q&amp;A with James Comey today.  \n\n#ComeyHearings https://t.co/DvrBe71h0Y"]["And we're off. #ComeyHearing https://t.co/qE1aOFpzRU"]["Seems like a slow news day... #ComeyDay"]["TUNE IN: I’ll be on the @TODAYshow Thurs. morning at about 8amET / 7amCT to discuss the #SenateIntelHearing w/ former #FBI Dir. James Comey"]["Great to see @TheJusticeDept heed my recommendation on slush fund reform &amp; work toward transparency. Read more HERE: https://t.co/CzN6fM9hvr"]["My statement on Trump's nomination of Christopher Wray to be the new #FBI director → https://t.co/PT5Sh0TfJP"]["Back-to-back champs! Way to go @OU_Softball #BoomerSooner https://t.co/aoVuTK4OKJ"]["Working w/ @SenJohnMcCain to provide Native American students in underperforming schools w/ more options: https://t.co/OpssOFVgJp"]["Thanks for having us and for the ongoing conversation @NIHDirector https://t.co/dcfoxCPczn"]["We will never comprehend their courage, but we will always be grateful for their sacrifice. #DDay73 #GreatestGeneration https://t.co/34DdtcA5Hh"]["The community in Mustang came together to build Brittany's Play Adventure for kids w/ special needs &amp; I'm glad I could be at its opening! https://t.co/v3qtNhv9sf"]["This #LondonAttack was England's 3rd terrorist event in less than 3 months. The U.S. stands ready to help our ally fight back this evil."]["The Erdoğan regime in #Turkey is still holding American #AndrewBrunson in prison w/o charges. It’s been 8 months! https://t.co/duP2XXPr7X"]["Praying for @eneskanter and his family. Actions of an oppressive regime must be met w/ faith &amp; demands for #freedom &amp; #humanrights for all https://t.co/Abbshyf9od"]["Congrats to Edmond native Rohan Rajeev on his 2nd place finish at the @ScrippsBee. Well done, Rohan! #spellingbee"]["Thanks for having me @TYPros. #Tulsa's future is bright w/you guys stepping up to lead https://t.co/So3CSNcSwP"]["Great to be back in SW #Oklahoma yesterday. I met w/#smallbusiness owners in #Lawton, Ft. Sill officials &amp; Cameron University staff. https://t.co/AhatEPMyuK"]["I'm glad James Comey is testifying before Senate Intel Cmte next Thurs. His testimony will hopefully help end speculation &amp; lead us to facts"]["The @CityofEL should find strength in tolerance &amp; freedom for all. Diversity, not division. #LetThemServe https://t.co/OI5arxYznh"]["Horrific news about the bombing in #Kabul. We must remain committed with our allies around the world in the fight against terrorism."]["Good luck to Rohan Rajeev from Edmond &amp; Edith Fuller from Tulsa at the #ScrippsNationalSpellingBee. We are cheering for you in Oklahoma!"]["On my trip, I was able to visit w/ Oklahoma National Guardsmen &amp; other Oklahomans serving in #Iraq &amp; #Syria. Thank you for your service! https://t.co/fC2E0972wQ"]["Just returned from an intel trip w/ @SenatorBurr to #Iraq &amp; #Syria, evaluating anti-terrorism intelligence programs &amp; military assets. https://t.co/DmU4J1TZkg"]["\"Greater love has no one than this: to lay down one’s life for one’s friends.\" -John 15:13 #MemorialWeekend https://t.co/ZJqNZjPDUa"]["#Ramadan Mubarak! America &amp; the world is better when we peacefully respect our differences &amp; ensure #ReligiousFreedom for all faiths. https://t.co/b64gnB0vxo"]["Our veterans deserve the best. @JimInhofe and I are working to ensure that happens. https://t.co/nbyiy8N5iO"]["Infuriating and heartbreaking. God be with our Christian brothers and sisters in Egypt. https://t.co/PjCAe5Wv0h"]["The burden of unnecessary regulations is crushing #smallbusiness. My bill, #S584, will help ease the burden. #SupportSmallBiz https://t.co/le4hlkA8pu"]["Our Intel Cmte voted unanimously today to give @SenatorBurr &amp; @MarkWarner blanket authority to issue subpoenas for our #Russia investigation"]["#Britain &amp; #Israel are close allies who share common threats w/ us. Despite leaks, we continue to share intel, including about #Manchester https://t.co/R2xp8GlI4S"]["TUNE IN: I'll be on @CNN's @NewDay w/@ChrisCuomo &amp; @AlisynCamerota at about 8:15amET (7:15amCT) to talk intel issues &amp; national security"]["Our bill will be different than #AHCA but we will analyze the #CBOSCORE &amp; ensure a smooth transition to better care. https://t.co/IVA7IQjAds"]["TUNE IN: I'll be on @MSNBC #MTPDaily with @chucktodd today. There's no way there'll be breaking news at 5pm ET right?"]["Speaking now at the International Christian Concern's conference on #religiousfreedom. Watch LIVE: https://t.co/MGjs18lBEf"]["Proud to support parents &amp; kids in #fostercare, passing a resolution in the Senate officially designating May as #FosterCareMonth."]["Congress will disagree on #budget line-items, but we should work together to confront the national debt &amp; fix the broken budget process."]["Ex-CIA Director John Brennan explains why our Russian investigation &amp; handling of classified info is so important. Putin is watching https://t.co/zkWLYaqM52"]["Praying for the many victims &amp; their families in #Manchester. What a senseless act of terror."]["It was a pleasure to meet &amp; discuss foreign policy with the 64th U.S. Secretary of State Madeleine Albright today in my office. @madeleine https://t.co/JSpWYsW5xA"]["#NorthKorea fires another missile, 2 wks after new #SouthKorea Pres. is elected. This is reckless &amp; disrespectful https://t.co/ylnLG85qyh"]["Good news! https://t.co/Y8jrrlEcTb"]["Praying for you @Enes_Kanter \n\n#FreeEnes https://t.co/oCWSKVfRHq"]["James Comey has agreed to testify before our Intel Cmte. I'm hopeful his testimony will provide some clarification for the American people"]["For the 1st time in almost 20yrs, the @USCIRF designated #Russia among it’s worst violators of #religiousfreedom https://t.co/a7j8GlDHdj"]["I appreciated today's all-Senate briefing w/Deputy AG Rod Rosenstein. He is committed to a thorough investigation that is above reproach."]["We cannot get distracted. We have to finish the #healthcare conversation. Families are counting on us. https://t.co/ZTQKvID7Wu"]["I hope strong consideration is given to former #Oklahoma Governor Frank Keating to be the next #FBI Director. https://t.co/ec8JTftIXM"]["Robert Mueller as #SpecialCounsel for DOJ's Russia probe is positive news. Mueller &amp; Intel Cmte will both follow the facts wherever it leads"]["TUNE IN: I'll be on Fox News @SpecialReport w/@BretBaier at 6pm ET / 5pm CT to discuss Senate Intel Cmte &amp; the latest re: James Comey"]["My Homeland Security &amp; Gov't Affairs Committee-passed bills will create #transparency &amp; help #smallbiz grow. \nhttps://t.co/vAZ4YrTKZF"]["Homeland Security &amp; Gov't Affairs Cmte is holding a markup of my 4 bills on #smallbiz, regs &amp; transparency. WATCH: https://t.co/ePxezD9NxC"]["I'm so glad you're ok! https://t.co/bSjpGNfmoi"]["Prayers for @ThomTillis, his family, and staff right now. https://t.co/WsFY0w8so7"]["American #AndrewBrunson has been imprisoned in #Turkey for 7 mos. w/o charges. Pleased to hear the WhiteHouse discussed this w/#Erdogan tday"]["185 industry groups agree → Regulatory reform is needed to #SupportSmallBiz, and #S584 is the answer. https://t.co/EGaWcdZMr2"]["Men &amp; women in blue leave their families every day, ready &amp; willing to do what it takes to ensure our safety. Thank you. #NationalPoliceWeek https://t.co/J5ZGxQee5y"]["Thank you to all the mothers &amp; grandmothers for serving your families well. Enjoy the day! #HappyMothersDay https://t.co/mHCt5l9dym"]["Small businesses account for almost 2/3 of job creation. We must do better to examine how regs affect them. #SupportSmallBiz #S584"]["Proud to work w/ @marcorubio &amp; @ChrisCoons to promote the fundamental human right of #religiousfreedom → https://t.co/zBqdwPeIau https://t.co/8f3SdCFoih"]["Congrats to Brooke Bollinger of Blanchard &amp; Ellie Neidel of OKC--honored in DC this week as Oklahoma's 2017 top youth volunteers. Well done! https://t.co/tSm0jTw0vn"]["Talked #RussiaInvestigation, #cyberattacks, #Iran &amp; more at open Senate Intel hearing yesterday. WATCH → https://t.co/9yrnTAShx0"]["At the 1st #WorldSummit in Defense of #PersecutedChristians, we stand w/the millions around the globe who suffer for Christ\n\n1 Peter 4:12-19 https://t.co/PjTSLKFwNJ"]["I don't have an obligation to cover-up for anyone or send out a message that's inconsistent w/ the facts. Where the facts go, the facts go. https://t.co/XP0k7gO3iN"]["Open Senate Intelligence hearing on worldwide threats starting at 10am ET. Watch LIVE → https://t.co/DKIbASxRlr"]["Our Senate Intel Cmte is subpoenaing former Nat. Security Advisor Mike Flynn for documents regarding #Russia probe \nhttps://t.co/bfBzna5LRi"]["Introduced a reg reform bill today w/ @clairecmc to streamline customer service processes for federal agencies → https://t.co/KHBMdvqMei"]["#JamesComey had an incredibly difficult job in his role as FBI Director &amp; I am grateful for his service. https://t.co/TyBprZaoco"]["Thank you teachers for giving selflessly to the next generation, often playing teacher, parent, counselor, &amp; friend. #NationalTeachersDay"]["Pleased that Scott Palk has again been nominated to serve as a Federal Judge for the Western District of #Oklahoma. He's a great candidate. https://t.co/FB7DMVFEgZ"]["Devastating to see #Sudan live up to its reputation as being 1 of the most egregious violators of #religiousfreedom. https://t.co/bPhPtN5zo8"]["Small businesses are the backbone of our economy. #S584 will provide relief on the regulatory burden they already feel. #SupportSmallBiz"]["Talked #SolutionSundays &amp; #racerelations in America on No Labels Radio. Check it out: https://t.co/pTpnmowIeq"]["Check out this fascinating essay about #family &amp; #adulting from my friend @BenSasse. Adapted from his new book. https://t.co/6mw3PoJDQn"]["Russian hacks are an attack on democracy everywhere. We must take this seriously, support allies &amp; be ready for our elections. #MacronLeaks https://t.co/msznGXIgz8"]["Seeking clarity on plans for refugee program in light of court decisions blocking recent EOs. Read my letter HERE: https://t.co/aKeUBm72KB"]["May is National #FosterCare Month. We are continuing to take positive steps to ensure every kid has a loving &amp; stable place to call home."]["We are not out of things to pray about... far from it. Join me today in praying for our nation. #NationalDayofPrayer https://t.co/4CdRpyNZub"]["More countries, especially at the UN Security Council, must pay their fair share."]["Congress cut funding for contributions to peacekeeping activities &amp; enforced the 25% cap for the first time since 2000."]["I voted for the #omnibus because unlike passing a CR w/ current spending levels, it included needed reforms, savings, &amp; greater transparency"]["The best way to celebrate #SmallBusinessWeek is to #SupportSmallBiz through regulatory relief. #S584 does that. https://t.co/w8kHhqMBVG"]["Join me today in praying for our nation &amp; celebrating our fundamental right to the free exercise of religion. #NationalDayofPrayer https://t.co/g3El1BeE9Q"]["Packed house at #JavawithJames this morning. The more (Okies) the merrier! https://t.co/9Jiv7wvirI"]["Great discussion on #regulations &amp; ideas for #economicdevelopment w/ OK community bankers this morning in my DC office. https://t.co/LK0HxBftcj"]["Grateful for the service &amp; sacrifices of our @OKGuard soldiers serving overseas for the past 11 months. Welcome home! https://t.co/c0ba6juUR2"]["Not all regulations are bad, but reducing unnecessary regs means more jobs, higher wages &amp; an expanding economy. https://t.co/KS1eDZhzOT"]["Thanks to the 25,000 runners who joined us this morning to #RunToRemember at the 17th Annual #OklahomaCity Memorial Marathon. \n#RunOKC https://t.co/cCU4qzw1YP"]["Congress &amp; #POTUS have done a lot in 1st #100Days, like #SCOTUS Judge &amp; regulatory relief. Much more wrk to be done https://t.co/n9dgJ68biX"]["Kim Jong-un is making reckless, dangerous decisions &amp; pursuing nuclear capabilities. We cannot allow a nuclear #NorthKorea https://t.co/r804uQGRJk"]["Nations like #Russia who violate freedom of conscience are more likely to be regional bullies &amp; bad int'l partners\n\nhttps://t.co/YjKf8UuRt4"]["@alexmshirley Glad you asked. Here is the full speech: https://t.co/MuVVgvCH1b"]["As Congress faces yet ANOTHER #governmentshutdown deadline... I urge my colleagues to reform the way we do budgeting. It's not working. https://t.co/rC8A3xq6WI"]["Isn't technology amazing? Great to video chat with the political affairs club at @hhokc this morning while I'm working in DC. https://t.co/HrgsS7WAyx"]["Talked about the #NorthKorea briefing at the White House yesterday &amp; government funding w/ @NEWSRADIOKTOK this morning → https://t.co/MTGoZ4dfvr"]["#ISIS is on the run. Their capacity to hold ground in #Syria &amp; #Iraq is collapsing. Terror will not win\nhttps://t.co/CholNiWERx"]["I visited the #DMZ in Dec. #NorthKorea's Kim Jong-un continues to make reckless decisions. Int'l community should take nothing off the table https://t.co/PmOM0N5q87"]["Great to hear updates from @EnidChamber about Vance AFB and catch them up on what's going on in Congress. https://t.co/UJItV2PNEZ"][".@USGAO's Gene Dodaro agrees → the Taxpayers Right to Know Act would make a huge difference in identifying waste in federal spending. https://t.co/sxup4plyB4"]["#USCIRF2017 report is alarming. #ReligiousFreedom is severely violated around the world. And #Russia is added to list of egregious violators https://t.co/wNY29xFalO"]["Feeling like I'm still at home w/ so many Okies in my DC office for #JavawithJames. The \"Oklahoma Embassy\" is open for business. https://t.co/dSU6eGvCYu"]["Starting an independent investigation will significantly prolong #RussiaProbe. 9/11 Commission took nearly 2yrs. Ken Starr Report took 3yrs https://t.co/NHrS0cLN34"]["Investigations take a long time, especially if they involve highly sensitive methods &amp; classified info. \n\nLISTEN: \nhttps://t.co/ix7Wkme0j1"]["TUNE IN: I'll be on @NPR @MorningEdition in the A.M. at 6:05am CT (7:05am ET) to discuss Intel Cmte probe into Russian election interference"]["Glad that Gov. Sonny Perdue is finally confirmed to be Secretary of @USDA. He'll be a great advocate for the ag community in #Oklahoma. https://t.co/UmKGQbJEUH"]["Looks like I've got some new reading material. Yakoke, @choctawnationOK! https://t.co/ivPQom1Kfk"]["Reports about #Russia probe are wrong. Don’t confuse silence for lack of progress. Intel Cmte must conduct classified investigations quietly https://t.co/D5uwchSfXL"]["Back to DC this morning, but grateful to have been able to connect w/ so many Oklahomans the past 2 weeks! https://t.co/wmdgzVtexv https://t.co/pqHS8JX5G4"]["This A.M. on FNS, I discussed #First100Days, healthcare, DC's broken budget process, #NorthKorea &amp; other topics: https://t.co/lmWr9ZG6BC"]["TUNE IN: I'll be on #FoxNewsSunday tomorrow to discuss #budget, #healthcare &amp; other issues. https://t.co/x7RTNwDAT2"]["My 8th town hall-style community Q&amp;A event for the Easter state work-week in #Oklahoma was yesterday in Mustang. Thanks to all who came out. https://t.co/G53EDyzypg"]["#Russia's Supreme Court just banned Jehovah’s Witnesses. What an outrageous oppression of #religiousfreedom. https://t.co/eR1BO9sHDf"]["Just finished another community Q&amp;A event. It was a pleasure to engage in conversation w/folks in #Norman. Thanks Bob Thompson for hosting https://t.co/wUsdFquxVI"]["The world should know that the U.S. will relentlessly pursue our people who are unjustly imprisoned, including #AndrewBrunson. #FreeAya https://t.co/0314Q4c6j0"]["Our prayers are with #Paris in the wake of today's chilling terrorist attack. America stands with you."]["Great news! Today, the #FCC enacted my 2015 #FederalFumbles suggestion to loosen #regulations on broadcast stations re: charitable giving https://t.co/arRgPkiTB8"]["Join #Oklahoma Statewide #FosterCare Call to Action Day. Learn how to become a foster parent or support foster kids: https://t.co/lyTgfaWddG"]["Java with James on the road continues in Bartlesville this morning. Great conversation on tax reform, healthcare, &amp; foreign affairs. https://t.co/IW41YY3TrZ"]["Congrats to the #Sooners womens gymnastics team for its 2nd straight national championship... 3rd in last 4yrs! #Boomer @OU_WGymnastics https://t.co/uQd7A8MfVB"]["Caught up with some of @KIPP_OKC's best and brightest this afternoon. https://t.co/JckX0Xtc2x"]["9:02am on April 19, 1995 changed our city forever. We will never forget the 168. #WeRemember"]["The #OKC bombing remains one of the worst terrorist attacks on U.S. soil, killing 168 people &amp; injuring more than 850. #WeRemember https://t.co/hhrG49s4gp"]["@OKLiberal grateful for your participation. Please stay engaged and reach out to my office if we can do anything for you in the future."]["Great morning at @RogersStateU touring campus, speaking to school leaders &amp; taking Qs from students. #HillcatNation https://t.co/85F9LbzLcH"]["We mourn the tragic accident &amp; death of Matthew McClanahan, a pipefitter for the Architect of the Capitol. Prayers for his family &amp;coworkers"]["Giving updates on what's going on in DC &amp; talking about my Easter break travels in OK w/ @RSUPublicTV in Claremore https://t.co/H8jSi7HWc8"]["You deserve to know how your taxes are spent! Congress should pass my Taxpayers Right to Know Act now. #TaxDay https://t.co/5K6tmUH7V5"]["Great week of meaningful conversations w/ Okies last week. Looking forward to more productive meetings this week! https://t.co/sHyMFUOfpS"]["I wish you and your family a very #HappyEaster! #HEisRISENindeed https://t.co/PqrMhwU6oV"]["Joy comes in the morning. #HappyEaster"]["I'm so saddened to hear of the sudden death of Rep. David Brumbaugh. Cindy &amp; I pray for his friends &amp; family."]["Amen.                                  #GoodFriday https://t.co/IqnQQcqilU"]["As many celebrate #GoodFriday &amp; #Vaisakhi, let us not forget those who face religious persecution around the world https://t.co/WC7EullP9C"]["Check out this story about American doctors helping victims of #ISIS in #Iraq, including Shelly Kelly of Mustang, #Oklahoma https://t.co/eiDhM1JY9K"]["Walked around downtown Stillwater yesterday to meet #smallbiz owners who are doing great work for the community &amp; living their dreams. https://t.co/XL48oXkww5"]["@dontcallmebill Thanks Will. I appreciate you attending the event today."]["Today's action in Afghanistan shows we will bring appropriate force against an enemy. Our commitment to defeat terrorism is unwavering."]["Grateful that #POTUS today signed a CRA to restore states authority to make funding decisions for Title X providers https://t.co/h0Z6PeECdl"]["Packed house this morning at \"Java with James\" in #Stillwater https://t.co/tcO7dCTxQO"]["@stompnstan Yes Stan, it sure is open to the public. See you tomorrow at Aspen Coffee in Fountain Square."]["Stopped by \"Our Favorite Place\" in downtown Eufaula today to check out all the #madeinOklahoma products. #shopsmall https://t.co/UF1hDJJVKb"]["Honored to join @senrobportman @amyklobuchar &amp; @SenatorDurbin to intro resolution designing April #SecondChanceMonth https://t.co/dLGRP0cwsn"]["Talking w/ some freshman Ironheads at Eufaula High School. Great questions from curious minds. https://t.co/qiwhiQum1L"][".@KittenChild1 Even though I missed Gracelyn at school today, I'm glad we were able to FaceTime this afternoon!"]["Walked into a class in Bixby to find 6th graders already learning about #FederalFumbles. Now that's what I'm talking about! https://t.co/nFbAQKTEqJ"]["Wrapping up meeting w/ over 200 Oklahomans for the night. We may not agree on everything but very glad to have productive conversations."]["Great questions from engaged Oklahomans at my Community Conversations so far. Talking #education #healthcare &amp; more. https://t.co/xypzK4QefQ"]["If you couldn't make it to one of my Community Conversations tonight, tune in to @NEWSRADIOKTOK. @JasonDoyle is LIVE from Kamp's 1910."]["Still a few spots available for tonight's Community Conversations in OKC. Hope to see you there! Sign-up HERE: https://t.co/okJs5WqSNQ"]["Congrats @russwest44 for making  #hist0ry. #Oklahoma is so proud of you &amp; the @okcthunder. #ThunderUp\n\nIt's a wrap! Give that man the MVP"]["There is no peaceful #Syria with #Assad leading it. His leadership only fuels #ISIS &amp; terrorism. @nikkihaley is right https://t.co/YL9ypM00vF"]["The right to peacefully practice any faith, or have no faith, should be a fundamental human right of all people. #Egypt https://t.co/srZRO3FXaU"]["This #PalmSunday attack in #Egypt is despicable. We pray for the victims &amp; their families. Terror will NEVER win\nhttps://t.co/HbSHMXOA8g"]["#Tulsa immigrant from #Syria on #SyrianAirStrikes: \"The action [Trump] took was fantastic, the right thing to do.\"\nhttps://t.co/5y9hwEAjWR"]["Just spoke about #SyriaAirstrike &amp; Russia’s role in the #chemicalweapons attack on the Syrian people on @FoxNews: https://t.co/WZNizOsu9E"]["The Senate is voting now to #ConfirmGorsuch. Tune in to C-SPAN 2 to witness history. https://t.co/LQE6fZzraE"]["The int'l community must join the U.S &amp; demand that #Assad step down &amp; allow the refugees to return to their homes in #Syria. #Airstrikes https://t.co/9nzY50rXcc"]["#Syria Pres. Bashar al-Assad's brutality murders innocent people, creates regional chaos &amp; contributes to the growth of ISIS. #Assad must go"]["I just started my #FacebookLIVE Conversation from Washington DC. Join us now here: https://t.co/z31z8dCJKu https://t.co/xXtBkgzB0q"]["Between votes, I joined a class at Southmoore H.S. in #Moore via skype. Best question: should someone edit POTUS' tweets? 😁@SouthmooreSTUCO https://t.co/n7apSWkamH"]["Devin Nunes offered to step aside from #Russia investigation to avoid distractions &amp; I support his decision. Process must remain bipartisan"]["Senate Democrats just partisan filibustered a #SCOTUS nominee for the 1st time in U.S. history. This is completely unprecedented. #Gorsuch"]["REMINDER: McConnells decision to not consider Garland upheld Senate precedent, which Schumer, Reid &amp; Joe Biden supported for years. #Gorsuch"]["Please visit my website for information about public Community Conversations &amp; Java with James events in Oklahoma: https://t.co/8qJOMWxeNu"]["TIME CHANGE: My #FacebookLIVE Conversation will now be happening at 6:00pm CT TODAY. Tune in HERE: https://t.co/VaGa8OBZqb https://t.co/laqMFWAIhO"]["Any strategy from int'l community &amp; the U.S. to fight #ISIS, terrorism, &amp; stabilize region must involve bringing #Assad to justice. #Syria https://t.co/F0YRX6p5xC"]["Assad’s atrocious use of chemical weapons cannot be tolerated by int'l community, nor should his illegitimate rule in #Syria. #Assad must go https://t.co/aqAnni8qkO"]["Discussing #border security at #HomelandSecurity hearing this morning w/ @DHSgov Sec Kelly. Watch HERE: https://t.co/ev6Dq9q4lj"]["Back by popular demand, I'll be hosting another #FacebookLIVE Conversation this Thursday at 5pm CT. Tune in → https://t.co/VaGa8OBZqb https://t.co/fm08Gfg8EI"]["#Assad is completely unfit to lead #Syria. US must prioritize Assad’s removal and expel Russia &amp; Iran from Syria. https://t.co/Uc18ji1ika"]["\"Indian country has long sought a SCOTUS nominee like Neil Gorsuch\" → Great take by @QuapawTribe Chairman Berrey https://t.co/1dPG6aXp8o"][".@USCBO put out its #budget outlook last week. I hate to spoil the fun for you, but things are not looking good. https://t.co/jMlqxQ20qU"]["Pleased to hear the Trump administration's desire to make #Assad a priority &amp; to help bring him to justice. #ThisWeek @nikkihaley https://t.co/IOQeqhH9QE"]["Senate Intel is not on a witch hunt. We're out to get the facts so we can settle this investigation on #Russia one way or the other. https://t.co/4aaRq5UcmX"]["Interference in elections is not new for #Russia but '16 was different. This testimony from Senate Intel hearing tells us why #Putin did it. https://t.co/oISigE6OMN"]["OPEN Senate Intel Cmte hearings today on #Russia at 9am CT &amp; 1pm CT. Tune in on CSPAN3 or online HERE: https://t.co/WKPRcIu9at"]["Here is our full interview on @MorningJoe on our bipartisan Senate Intel Cmte invesitigation into #Russia https://t.co/DXoxGzc4oH"]["Honored to serve on the Senate Intel Cmte w/this guy! @SenAngusKing \n\n#bipartisanship https://t.co/5cf9E5blND"]["I applaud @SenatorBurr &amp; @MarkWarner for their steady leadership of our Senate Intelligence Cmte. We will follow evidence wherever it leads. https://t.co/rRB2gBkgzb"]["TUNE IN: I'll join @SenAngusKing on @Morning_Joe tomorrow to discuss bipartisan Senate Intel Cmte investigation of #Russia interference."]["In 2006, Senators Joe Biden, Hillary Clinton, Chuck Schumer, &amp; Barack Obama all voted for #NeilGorsuch. He deserves an up-or-down vote."]["Next week, #NeilGorsuch will come to the floor, face final debate, &amp; become the ninth justice of the #SupremeCourt. https://t.co/Az0EEiH0qu"]["It’s time to pass the Pain-Capable Unborn Child Protection Act &amp; the Born-Alive Abortion Survivors Protection Act. https://t.co/RhFuZ3zQK3"]["We cannot be a nation that allows babies who miraculously survive a botched abortion to be left for dead on a hospital table. #ProLife"]["Great to see @OKCattlemen in DC today. Forgot my hat, but @instagram saved the day (follow me @SenatorLankford). https://t.co/fe8hH8BRN6"]["A security threat on the Capitol is a threat against our democracy. Grateful to @CapitolPolice for their service to keep us safe."]["My full interview w/CNN's AC360 on the Senate Intel Cmte processes &amp; investigation into Russian interference: https://t.co/CGfdUWEdRM"]["Great to see @POTUS roll back Obama-era regulations that raise energy costs &amp; harm job creation. https://t.co/CLqOmrRwu7"]["Adherence to rule of law &amp; dedication to separation of powers are not extreme ideas. However, filibustering a SCOTUS nomination is. #Gorsuch"]["It was an honor to speak today at #AIPAC2017 about America's friendship w/#Israel &amp; leadership in world affairs. @StephensWSJ @derekchollet https://t.co/CshfohPUke"]["Open minds, full bellies, can’t lose. @SenatorTimScott #SolutionSundays https://t.co/tSSXSlcO9M"]["Agreed. The concept works for the many divisions in America today - racial, political, socioeconomic, religious, etc. #SolutionSundays https://t.co/vlyAccOTBu"]["What if Americans put aside our differences &amp; dined w/people across racial &amp; social lines? #SolutionSundays @SenatorTimScott #CNNSOTU https://t.co/QjFxQOTj8x"]["Thanks @MemphisSpence. Hopefully more &amp; more Americans will consider doing it. https://t.co/ckhjoxXzeo"]["Russian govt suppresses free speech &amp; bullies its neighbors. The people are right to demand an end to corruption in #Russia. #RussiaProtests"]["Congress must continue to pursue the repeal &amp; replacement of #Obamacare. We must take the necessary time &amp; get this right. https://t.co/GGXFhCQ3y2"]["#Oklahoma has 76% cost increase w/only 1 #Obamacare insurer. Ins. Commissioner says we could have zero for 2018\n\nhttps://t.co/h2W9uVMPmG"]["@alexmshirley I actually talked about that during the Facebook LIVE. You should take a listen. 😀"]["In case you missed it, you can still watch the full video from my #FacebookLIVE this week. Watch HERE: https://t.co/FrMjJyzmfC"]["Great to meet you on our plane tonight @kendallybrown"]["Proud to support confirmation of next US Ambassador to #Israel today. A strong US-Israel relationship is as important as ever. https://t.co/GAYyp0bU6Q"]["Adherence to the rule of law &amp; refusal to legislate from the bench are not extreme ideas. However, filibustering #NeilGorsuch is. #SCOTUS https://t.co/X6rRNvaGy7"]["The #ProLifeGen is what they are today because of @Students4LifeHQ. Grateful for your dedication to life! #SFLA10 https://t.co/6MOnSkH3Wb"]["You're welcome! Thanks for joining in the conversation. https://t.co/d4AElA99yL"]["After our Intel Cmte investigation into Russian interference w/elections is complete, then we can discuss if a Special Prosecutor is needed https://t.co/5ZvBDi8HQC"]["I applaud Chairman Nunes' apology. Intel Cmte investigation into #Russia is nonpartisan &amp; thorough. We follow the evidence wherever it leads"]["Joining @KRMGtulsa LIVE at about 8:45am CT to discuss #RepealAndReplace &amp; #AHCA. TUNE IN → https://t.co/eqzWUjTAbN"]["Starting my #FacebookLIVE Conversation in just a few minutes. Tune in HERE: https://t.co/VaGa8OBZqb"]["Now this is truly #MarchMadness. Check out @RestoreAccount's #TournamentofWaste &amp; make your picks → https://t.co/83Yiwx4MCw"]["Just one year after #BrusselsAttacks, I'm devastated to see the horror in #Westminster. Terrorism will not win. Prayers are w/ the victims."]["Be sure to tune in to my #FacebookLIVE Conversation today. I'll be taking Qs from Oklahomans starting at 4pm CT → https://t.co/VaGa8OBZqb"]["250K kids enter #fostercare every year. Today, I joined @SenGillibrand to introduce a bill to improve the system. https://t.co/cOkazPn3xj"]["Hosting a #FacebookLIVE Conversation TOMORROW. Tune in at 4:00pm CT → https://t.co/VaGa8OBZqb"]["Just returned from an Intelligence Committee trip to the Middle East. Thank you to all those serving abroad to protect the homeland. https://t.co/zWsoVyQqJe"]["While in Lebanon we met w/Embassy personnel &amp; visited Beirut Memorial to honor victims of 1983 terrorist bombings https://t.co/48E9lsCbVm https://t.co/AxTsV4eWn2"]["In the Middle East this wknd on an Intel Cmte trip to evaluate anti-terrorism efforts. 1st stop: Lebanon to meet w/Prime Minister Al-Hariri https://t.co/0S2d0geGqy"]["It’s time for #Turkey to release #AndrewBrunson now. He is a U.S. citizen who has been imprisoned for 5 months w/o charges. https://t.co/aDZY4ftWX9"]["The struggle is real.... 😀 #RedheadsUnite #StPatricksDay https://t.co/tAiS4BgRmh"]["Great game @OSUMBB even in a loss. Thanks for a great season #OKState! Keep your head up. #GoPokes #marchmadness https://t.co/MtcncSuH7o"]["#HappyStPatricksDay.. or for red heads, “Happy Explaining-to-Everyone-That-I'm-Not-Irish Day” #GingerLife @SenatorHeitkamp #StPatricksDay https://t.co/q1EQX4iEZ2"]["I’ve got a good feeling about today! \n\n#OKstate #GoPokes #BeatMichigan #MarchMadness https://t.co/xVMzZL2YKu"]["1-yr after #genocide declaration, #ISIS is losing, but more must be done to end anti #religiousfreedom #persecution\n\nhttps://t.co/eq0ZiUBV5T"]["Based on the info available to us, the Senate Intel Cmte sees no indications that Trump Tower was the subject of surveillance by U.S. https://t.co/nznl2SEC8a"]["As @StateDept restructures, they should develop an aggressive strategy for imprisoned U.S. citizens abroad. https://t.co/whZi7D8Dvp"]["TUNE IN: I'm going on @FoxNews at about 8:15am CT to discuss national security &amp; Intelligence issues."]["Congratulations to our new Director of National Intelligence, Dan Coats! I know you will lead well. https://t.co/pJM3autTyR"]["My Taxpayers Right to Know Act was reported out of committee this AM. Next up → the Senate floor. Read more HERE: https://t.co/VDT6Z9lX8W"]["TUNE IN: I'll be on the @hughhewitt Radio Show at about 6:30am CT (7:30am ET) to discuss #Obamacare #RepealAndReplace &amp; other topics."]["#Russia tried to interfere w/our elections to try to destabilize &amp; create chaos &amp; doubt in gov't. They try to do this around the world. https://t.co/QLhilbpIC8"]["Grateful for @RepMullin's leadership on this → there is important work to be done at Indian Health Service. https://t.co/d2rQKYuCq8"]["Great to see @POTUS address duplication &amp; wasteful spending in exec branch. Big steps in the right direction → https://t.co/utuBVGDAcO"]["Today, I joined @KFAQ Radio Show in #Tulsa to discuss the process to #RepealAndReplace #Obamacare. #AHCA\n\nLISTEN: https://t.co/mzJZJcBFI9"]["Congrats to @OSUMBB for making the big dance! #GoPokes #SelectionSunday #OKState #MarchMadness"]["For #regulations, #OIRA is the most important agency that no one has ever heard of. This pick is really important\n\nhttps://t.co/uoeo2OFGYi"]["Devastating to see the wreckage from the wildfires, but encouraging to see a community come together to support those who are hurting. https://t.co/9W1pfAO7og"]["#AndrewBrunson - a U.S. citizen - has been detained 5 mos. w/o charges. #Turkey should release &amp; send him home now\n\nhttps://t.co/x1l4J9KyhW"]["As I told #SouthKorea leaders during my visit in Dec, US is committed to a strong alliance despite political turmoil https://t.co/8orrFs8atv"]["The #SouthKorean / U.S. friendship is older than just any single election or any single leader. https://t.co/SdehfIp74R"]["Spoke about the wildfires on @K101online this morning. The devastation is truly heartbreaking and my prayers are with all those affected. https://t.co/PcGQcoNSnc"]["If you're wanting to help w/ the OK wildfires, @OKCattlemen have multiple opportunities to donate resources: https://t.co/NrBcL2s6bo"]["Western Equipment in Clinton is taking donations for first responders of the Oklahoma wildfires. Praying for you all in NW OK! https://t.co/RjoWpepz4A"]["Congress must overturn the accountability &amp; state plans regulation so states can maintain more #education control. #EveryStudentSucceeds https://t.co/klkzNGwcyy"]["Outstanding! 5-year-old Edith Fuller from Tulsa is the youngest contestant headed to the @ScrippsBee → https://t.co/NMlLbEEfHU"][".@IndianCommittee hearing at 1:15 CT to talk Trump Admin priorities w/  @SecretaryZinke &amp; @ChickasawNation Lt. Gov Jefferson Keel. WATCH: https://t.co/aiMQM2N5SJ"]["No matter who POTUS is, the federal rulemaking process needs to be improved w/ more transparency &amp; accountability → https://t.co/TgNcMlGjL4"]["I'm saddened to learn of the passing of legendary Oklahoma communicator, Mike McCarville. My prayers are with his loved ones &amp; many friends."]["Great to catch up w/ @NORMANCHAMBER and talk tax &amp; healthcare reform in the Capitol this afternoon. https://t.co/XtpmWxq7Zh"]["All 100 senators are united on this → we will not tolerate threats of violence against the Jewish community. https://t.co/hSvzhmBMrq"]["Oklahomans faced a 76% increase in costs in '16, on top of a 35% increase in '15. #RepealAndReplace should lower costs &amp; expand options."]["House R's have intro'd their plan to #RepealandReplace #Obamacare. In the days ahead, we will debate reforms. Be sure to read for yourself. https://t.co/IpBknA7Sr2"]["After our Intel Cmte investigation into Russian interference w/elections is complete, then we can discuss if a Special Prosecutor is needed https://t.co/mnKxJlvZzH"]["We must help #ISIS genocide victims in Iraq &amp; Syria - Christians, Yizidis &amp; Muslims. Last yr, ISIS was condemned for genocide by @StateDept"]["After an evaluation of immigration vetting is complete, we will continue welcoming refugees &amp; legal immigrants. https://t.co/MOuKxXKeC5"]["A word of caution to the nation - please have patience w/Intel Cmte investigations.The ability for methods to remain classified is important https://t.co/YKeNfVyAjS"]["Thanks for all the birthday wishes. I'm still waiting on my #BoehnerBirthdaySong from @SenateMajLdr &amp; @SenJohnThune 😁 https://t.co/l2v2sM9fKs"]["No matter who is #POTUS, the DOJ &amp; settlement fund needs #transparency. My Stop Settlement Slush Fund Act does this\n\nhttps://t.co/FHqhp2x3iL"]["I wholeheartedly agree. Addressing the #federaldebt shouldn't be a hard decision. MUST READ from @dcexaminer → https://t.co/aRrH6AdpDL"]["On #JeffSessions → everyone needs to step back off the ledge &amp; keep this in context. A call for resignation is ridiculous. https://t.co/xlENrWvPSR"]["Congress should pursue #immigrationreform – strengthened border security, visa modernization, dreamers, etc.  Perhaps this Fall. https://t.co/4Aujglw1TK"]["I am now accepting internship applications for Summer 2017. Check out my website for more info on how to apply: https://t.co/rU9oXJicdx"]["Great to join in conversation w/ the Credit Union Association of Oklahoma today over at the Library of Congress in DC. https://t.co/yjiKtdNYXA"]["Packed house this morning at Java with James. Great to connect with Oklahomans visiting DC. https://t.co/QXdokyMugh"]["Last yr, our economy only grew 1.6% GDP, lowest since 2011. #taxreform &amp; #regulatoryreform will grow economy &amp; create jobs. #JointSession https://t.co/GkfTMDpII1"]["It was a blessing to spend time with you today Mr. Kimbrough. Hope to see you again soon. #HBCUFlyIn @du1869 https://t.co/vcooUE69au"]["Our nearly 250yr American experiment must continue to grow as we nurture the oldest democracy on earth #JointSession https://t.co/CLALcGsnTT"]["I applaud Pres. Trump's call for unity tonight. Americans must come together to solve our problems as a nation. #JointSession https://t.co/9tiOlFtLmi"]["My view walking into the #JointAddress to Congress. #JointSession https://t.co/dhvRS9b7Xj"]["Glad to see @POTUS call for a revision of the overreaching #WOTUS rule &amp; work to restore the federal-state governing balance of water rules."]["Grateful to have the Oklahoma delegation of @AmericanLegion stop by today to discuss our continued support for Oklahoma veterans. https://t.co/Y6fgL7hnDW"]["Honored to speak at today’s #HBCUFlyIn in DC &amp; meet w/Dr. Kent Smith, Pres. of Oklahoma's @LangstonU, the furthest west #HBCU in the U.S. https://t.co/bjypgFrqbT"]["We should honor &amp; have compassion for every human life, at every stage. Watch my statement on physician-assisted suicide from @Heritage → https://t.co/n1x3JKFwUp"]["Speaking at @Heritage on physician-assisted suicide shortly. Watch online here → https://t.co/7TP3mdUcWp"]["Before heading back to DC for session, it was great to visit @36degreesN &amp; also spend time w/so many constituents in #Tulsa. #TulsaTriumphs https://t.co/dh7sSTF8j8"]["We should find history rather than try to ignore it, because there's something we can learn. #TulsaRaceRiot #TulsaTriumphs 🎥: @tulsaworld https://t.co/xHQkjSFVJq"]["Conservatism is about freedom → freedom for all people, of all colors, all backgrounds, all economic situations, and all faiths. #CPAC https://t.co/JZzxrT6i3Q"]["Glad to stop by the State Capitol the other day &amp; visit with our state leaders. https://t.co/tey0FScnGN"]["Great to tour the new GE research facility in OKC &amp; visit w/ employees about regs &amp; issues important to them &amp; the work being done at GE. https://t.co/ywtqHQMlVT"]["MUST READ--@juozapa reports on 1921 Race Riot, #Tulsa, @northtulsa100 &amp; revitalization of #NorthTulsa. #NeverForget\n\nhttps://t.co/ELxGKQXPhO"]["Great to see this act of kindness. We can disagree &amp; still embrace #civility &amp; #religiousfreedom. #LoveThyNeighbor \n\nhttps://t.co/pcXRfRSOWq"]["Our nation must support #religiousfreedom for all faiths, or the right to have no faith. Conservatives can't be confused about this. #CPAC https://t.co/IHR96ZdRlK"]["Congratulations Mike Hunter on the appointment to AG. Mike's experience in the office &amp; other roles in state gov't will serve #Oklahoma well"]["If POTUS issues new #immigration EO, it should clarify implementation &amp; support persecuted religious minorities https://t.co/WjkPhwVAcB"]["TUNE IN: I'll be on @FoxNews @SundayFutures with @MariaBartiromo tomorrow at 9am CT (10am ET) to talk homeland security/intelligence issues"]["What can bring #Democrats &amp; #Republicans together?\n\nListen to learn more @OppLives https://t.co/Wl2ZGHr4kl"]["Congratulations to our newly confirmed EPA Administrator, @ScottPruittOK. Very well deserved--I know you'll lead well."]["#ScottPruitt has fought for states to be in the driver’s seat. At EPA he will push states to make the best decisions for their own citizens. https://t.co/90fyTNYhDK"]["#ScottPruitt will be a superb #EPA Administrator. He won't overreach in its authority. He'll protect the environment https://t.co/urixlV9Kta"]["The accusation that somehow #ScottPruitt wants dirty air &amp; dirty water &amp; our children to be poisoned is ludicrous. https://t.co/YNOa7fMM2A"]["It's confirmed. A vote to #ConfirmPruitt will take place tomorrow (Friday) at 12pm CT (1pm ET). https://t.co/J4W46FZzFj"]["#ScottPruitt will lead the #EPA in a way that spurs energy independence, stewards the environment &amp; fosters economic growth. #ConfirmPruitt"]["Senate just voted 54-46 to invoke cloture on #ScottPruitt for EPA Administrator. This begins up to 30hrs of debate before confirmation vote"]["In case you missed it, I talked w/ @kilmeade on @foxnewsradio about #Russia and intelligence matters. LISTEN: https://t.co/m5PvSmoSJe"]["Congrats to the @NSURiverHawks for national recognition for your #robotics academy. Great news! #TeamNSU @AACTE https://t.co/RyMzrc6yKW"]["Proud to work w/ @SenTedCruz @SenatorFischer @jiminhofe to ensure transparency over the #JudgementFund → https://t.co/YDuJt4mGHQ"]["Great to have @OTripleC President Jerry Steward stop by my DC office to talk #highered https://t.co/s4pqbGU1hf"]["As we work to #endslavery worldwide, we must stand for the human rights of ALL persecuted people, regardless of gender, age, or religion."]["As @IsraeliPM visits, I look forward to building a stronger relationship w/ our greatest ally &amp; only democracy in the Middle East: Israel."]["The Intel Cmte has been investigating #Russia &amp; elections. We will follow the evidence wherever it leads. #MikeFlynn https://t.co/1PySMUzdCF"]["Small businesses are a major driver of #job creation &amp; economic growth. Looking forward to seeing great things from @Linda_McMahon, @SBAgov."]["No one should be forced to act against their religious or moral beliefs &amp; participate in #abortion. https://t.co/AhqL2cBLhE"]["Dr #DavidShulkin was just confirmed 100-0. He's qualified to lead the @DeptVetAffairs &amp; provide more healthcare choice for #veterans."]["Wow\n\nOnly 1 man is responsible for launching these missiles &amp; defying the int'l community: Kim Jong Un. #NorthKorea https://t.co/XCLes9wemm"]["It's great to again join the @NCAI1944 Conference in DC. The federal gov't must honor tribal sovereignty &amp; empower tribes. #ECWS2017 https://t.co/mzlfJzJV5h"]["Welcome back to #LoudCity #KD. You helped build this team but now it belongs to our #MVP #Russ. Go @okcthunder! #ThunderUp #OKC @KDTrey5"]["In case you missed it, my colleague @MarcoRubio gave an important speech this wk about #civility. Please watch: https://t.co/vQ0aS16g9x"]["Talked #travelban &amp; #nationalsecurity on @FoxNews this morning. Check it out → https://t.co/CXezuBwFWM"]["Huge win! @okcthunder over @cavs! #ThunderUp #OKC \n\nSorry @senrobportman. See ya in the playoffs. 😜"]["We as Americans don't have to agree on everything. We can disagree &amp; we can disagree strongly. It doesn't have to be personal. #civility https://t.co/aWEyqFM3Fd"]["Delaying the inevitable does not help the American people… #HistoricObstruction https://t.co/2k71nSxxDS"]["The tone of the #Senate is getting so caustic. We should be able to disagree but treat each other with respect. #Civility #JeffSessions https://t.co/LnLPp40k5s"]["I’ll just leave this here. It's time to #MoveOn. #HistoricObstruction https://t.co/px95rhEUBu"]["You deserve to know how your tax dollars are spent. My Taxpayers Right to Know Act is a big step toward that goal: https://t.co/tT35aX5sSW"]["#NeilGorsuch has an impressive record of interpreting the law without trying to legislate from the bench. Exceptional pick for #SCOTUS."]["Every American should be able to speak freely about their conscience and convictions, no matter what their job is. https://t.co/pWfFRAB0R4"]["-466 yds (most in SB history), 2 TDs\n-7 Super Bowls \n-4 #SuperBowl MVPs\n-5 championships \n\nWell done #TomBrady. Very impressive...."]["I’m participating in my first protest of 2017. I only cheer for America’s Team.  #NotMySuperBowl #Cowboys2018                  \n\n#SuperBowl"]["The #JohnsonAmendment forces people to wear a muzzle in exchange for nonprofit status. That's not fair. #FreeSpeech https://t.co/2OHrDNS7Oq"]["The stall tactics used in this chamber are unbelievable. We all need to be able to get our work done--@POTUS included. https://t.co/lZSyQo2eKd"]["I'm not sure if y'all knew this, but #ScottPruitt likes breathing clean air. In fact, he likes clean water as well. #ConfirmPruitt https://t.co/WE65mPX9hT"]["Attention Okies! OK Mission of Mercy is providing free dental care @ Woodward County Fairgrounds today &amp; tomorrow → https://t.co/U1ZdIoiO27"]["We cannot ignore Iran’s provocation &amp; hope they won’t carry out their threats. Glad @POTUS is responding w/ action. #IranSanctions"]["#BetsyDeVos will work to transfer education policy control from Washington, DC back to states, parents, &amp; local leaders. My full remarks → https://t.co/ssNexupKAy"]["Great to hear from OK educators including Ms. Grier who has taught in public &amp; private OK schools &amp; supports #BetsyDeVos for Dept. of Ed."]["#Iran continues to be a bad actor in the #MiddleEast. It demands a response for the peace of the entire region. https://t.co/tQcBrfMJSR"][".@Linda_McMahon is a proven business owner &amp; I look forward to supporting her nomination to head #SmallBusiness Administration. https://t.co/nQrE3ZLhdY"]["I’m grateful for @POTUS’s support as we work to pass legislation to fix the #JohnsonAmendment https://t.co/G1relJtteV"]["Prayer has always played a vital role in uniting &amp; making us a more generous, more loving &amp; more forgiving people. #NationalPrayerBreakfast"]["The left's response to losing the WH &amp; Congress is to obstruct, divide &amp; go MORE liberal? What am I missing here? #SCOTUS #StrongerTogether https://t.co/gfjeB2rGYh"]["It's time to fix the #JohnsonAmendment. People who work for nonprofits still have constitutional rights. https://t.co/AaaAQfHA2B"]["Introducing the Free Speech Fairness Act w/ @SteveScalise, @FRCdc. WATCH LIVE: https://t.co/CLhJyk8Vl1"]["Great to see so many Okies at my coffee hour today. If you're planning a trip to DC, plan to stop by #JavawithJames! https://t.co/Fu4sXlYViO"]["#NeilGorsuch. Our next Supreme Court Justice. https://t.co/J2puMq2Qi0"]["#NeilGorsuch’s legal opinion on the 1984 #Chevron deference case is classic. If you care about regulations, read it. https://t.co/xpO8sBY8nG"]["Quote of the nite: \"Schumer is about to tell Americans that #NeilGorsuch kicks puppies &amp; heckles piano recitals. That's hogwash.\" -@BenSasse"]["NOTEWORTHY: #NeilGorsuch unanimously passed the Senate by voice-vote in 2006, w/ support from Joe Biden, Hillary Clinton, Schumer &amp; Obama"]["Excellent pick. #NeilGorsuch has served #Oklahoma well on 10th Circuit &amp; he understands constitutional interpretation of law. #SupremeCourt"]["Great to see @POTUS prioritize deregulation. We have to cut back on pace, intrusiveness, &amp; burden of regs on families &amp; small businesses."]["Great to sit down with @RepRyanZinke in my office this morning to discuss his vision for @Interior. https://t.co/kI4E1DMwp8"]["Phones are ringing off the hook in DC, Tulsa, and OKC, and we're working to answer every single call. Yes, all of us. https://t.co/isBnCyHuLm"]["Proud to team up w/ @SenJoniErnst to redirect #PlannedParenthood funding to better use taxpayer dollars &amp; fund #womenshealth. HERE'S HOW → https://t.co/HqwTIZcch2"]["My thoughts on Friday's #immigration &amp; #refugee executive order: https://t.co/OarUlUBpfO"]["We should value freedom &amp; not surrender security. We can protect the homeland while upholding #religiousfreedom &amp; refuge for the persecuted."]["Incredible to see the #ProLifeGeneration standing for life today! #MarchForLife https://t.co/EfNE2tpxdl"]["Today we speak for those who cannot yet speak and we march for those who cannot yet march. #MarchForLife #ProLife"]