["Stay safe on the roads today. Thank you to @IndStatePolice and all out there working to keep Hoosiers safe in hazardous weather conditions. https://t.co/mzDTlRIweK"]["Joe’s Law Enforcement Mental Health and Wellness Act is now law and will help law enforcement agencies establish or enhance mental health care services for their officers.\nhttps://t.co/wbOBPxc4x3"]["It’s not just Carrier: thousands of Hoosiers across Indiana are set to lose their jobs due to outsourcing. #CarrierLayoffs https://t.co/4KkxoUEFK9"]["Joe has long pushed for policies that support corporations investing in our workers &amp; penalize those outsourcing jobs. We need to fix policies so that corporations outsourcing jobs cannot continue deducting moving expenses if they ship Hoosier &amp; American jobs to other countries. https://t.co/oNQTWCOE47"]["Congress missed an opportunity to address outsourcing through the recently passed tax bill. #CarrierLayoffs https://t.co/jy6hKrWeoO"]["Today, 215 #Carrier workers in Indy lose their jobs. We must stand up for American workers and our federal policies should be designed to invest in them. #CarrierLayoffs https://t.co/OtaaIzzL3n"]["More than 200 Hoosiers from @122FighterWing in Fort Wayne may be receiving housing allowances that are too low based on cost of living in the area. Joe, @SenToddYoung &amp; @RepJimBanks urged DoD to look into increasing the military’s basic housing allowance in the Fort Wayne area. https://t.co/uGUL5Vd3h3"]["Thank you Rep. @SusanWBrooks, @IMPDNews, @IndStatePolice, @IndyFOP86, @GLFOP, @NAPOpolice, @FLEOAORG, and all our officers across IN for your advocacy and support of this effort."]["Joe and @SenToddYoung’s Law Enforcement Mental Health and Wellness Act is now law. This will help our law enforcement officers—who often endure repeated exposure to traumatic events—access mental health and wellness services. https://t.co/J0W0BO0MAl"]["Joe supports an open internet that ensures Hoosiers have access to the content of their choice. That’s why he’s joining a bipartisan group of Senators in supporting a resolution that would reverse the FCC’s repeal of #netneutrality. https://t.co/f9vsfH7PPE"]["Thank you to all law enforcement officers for all you do to keep our families and communities safe. - Joe #LawEnforcementAppreciationDay. https://t.co/FSp7d4GYj3"]["All active-duty and reserve servicemembers are required to have an annual mental health assessment, thanks to Joe’s Jacob Sexton Military Suicide Prevention Act, which has now been implemented. Read more: https://t.co/IqCGMyqeys"]["Joe applauded President Trump's executive order that directs the Administration to ensure veterans receive mental health care while transitioning out of the military and back into civilian life. https://t.co/LNEB7SNUMQ"]["WATCH LIVE: Joe is speaking on the Senate floor about ways that Congress can – and must – together:\n- repealing the medical device tax\n- funding #CHIP and Community Health Centers \n- addressing the opioid epidemic \nhttps://t.co/yFhjT8H7oI"]["Joe's staff attended the monthly Gary Chamber of Commerce luncheon yesterday, where Mayor Freeman-Wilson in part discussed progress @GaryChiAirport. The airport has seen rapid growth since Joe helped facilitate its runway expansion. https://t.co/qYGpjPfgFH"]["Joe met with Hoosier @UnitedWay chapter leaders to discuss a shared ongoing commitment to ending the opioid epidemic, as well as bolstering workforce and early childhood development programs. https://t.co/ebLhNJR3vZ"]["Joe’s staff will be hosting a Veterans History Project in Zionsville on Friday, 1/19, 1 PM to 3 PM EST. All area veterans are encouraged to come and share their stories of service. Hoosiers interested in volunteering to interview a veteran are also welcome. https://t.co/x6QW3NsTF7"]["Joe was joined by @SenToddYoung and @RepTrey to welcome @GenDaveGoldfein, Chief of Staff of the @usairforce, to @NAVSEACrane. They discussed Crane’s role in the national defense, potential avenues for an increased Air Force presence at Crane. Read Joe’s statement: https://t.co/lHikIqJVtF"]["Saddened to learn about the loss of @INGuardsman Sgt. 1st Class Mark Boner, who was preparing to deploy with the 38th Sustainment Brigade. We will remember his service to our country, including in Iraq, and pray for his family and fellow Guardsmen. -Joe"]["Joe met with @Teamsters local 135 in Indy to discuss the future of their pensions. Joe recently cosponsored the Butch Lewis Act, which would help retirees receive the pension benefits they were promised and earned. https://t.co/O4jv2OA816"]["Joe recently introduced a bipartisan legislative package to help Hoosiers in rural communities access addiction treatment resources. https://t.co/BAYbSNRpOs"]["Joe's staff was on hand at the Rural Opioid Addiction Symposium hosted by the @agriinstitute to hear from Hoosiers on working together to address opioid abuse in rural communities. #AgAware #AgRuralTalk https://t.co/YHwd4tRP5x"]["Mikaela, your dedication and perseverance are inspiring. We're proud of you and everyone on our swim teams around the state. – Joe https://t.co/5SdxQp3Mls"]["Joe will continue his all-hands-on-deck approach to combating the opioid epidemic in 2018. https://t.co/1QDVzr5h42"]["#ICYMI: President Trump signed Joe's provision on North Korea into law as part of the national defense bill. It requires the Administration within 90 days to develop a comprehensive strategy to confront the threat posed by North Korea. https://t.co/xf9W3BxkvQ"]["Joe, @SenToddYoung, @susanwbrooks’ Law Enforcement Mental Health Act is on the President’s desk to be signed into law. The legislation provides tools for law enforcement agencies to establish or enhance mental health care services for their officers. https://t.co/UblgfpuobD"][".@FarmBureau &amp; @NFUDC working to help farm communities battle opioid addiction. Joe has 3 bipartisan bills to combat opioids in rural areas. https://t.co/WF5ccEfXoI"]["#ICYMI: Joe &amp; @SenToddYoung introduced The Fruit and Vegetable Planting Flexibility Act of 2017 (Farm Flex), which would continue to allow Hoosier farmers to plant specialty crops without experiencing a permanent penalty to commodity program eligibility. https://t.co/IZJUCRsDWc"]["2017 was a banner year for @GaryChiAirport in part from expansions that Joe helped facilitate. Read more about how Gary’s airport is expanding: https://t.co/rAVWgdBGLo"]["Meet Maggie Bailey. She’s one of Indiana’s 150,000 Vietnam War Veterans. Maggie was an Army nurse who volunteered to go to Vietnam. On March 29, 2018 Joe will host an event in Indiana to welcome home Hoosier Vietnam veterans like Maggie. https://t.co/QYeDcLEaGJ"]["Honored to be in Kokomo tonight for the deployment of the @INGuardsman 38th Sustainment Brigade to Kuwait. Thank you for protecting and serving Hoosiers and our country. - Joe https://t.co/XnvtzvhLC0"]["ICYMI: Joe is the second-most bipartisan U.S. Senator in the past quarter-century, according to the Lugar Center. https://t.co/cmPCgtw7iN"]["Happy New Year to all. May it be a happy and healthy one for you and your family. –Joe https://t.co/c8CIoB4FrM"]["Earlier this month, President Trump signed the national defense bill into law – which included Joe’s provision that requires the Administration to present to Congress its strategy on how it plans to deal with North Korea by March. https://t.co/nB9KDKC3IK"]["Hoosiers and Americans support the courageous protesters speaking truth to power in Iran. They seek freedom and the chance to live in peace. -Joe"]["ICYMI: Joe introduced bipartisan legislation that would inform and empower student borrowers by requiring colleges and universities to send each student a yearly letter detailing their total debt. https://t.co/itmiUCb7aK https://t.co/Vji360EZtL"]["ICYMI: Joe’s legislation requiring servicemembers to get mental health checkups every year has officially been implemented by the @INGuardsman. https://t.co/sPfn2C4E65"]["ICYMI: Joe joined a bipartisan group of senators to emphasize to the Administration the need to stand up for American steelworkers by fighting for fair global steel trade. https://t.co/jcFQsIrNIy"]["Congrats @boilerfootball on a great win in #FosterFarmsBowl. -Joe"]["READ: Joe and @SenToddYoung joined together to urge Congress to fully fund new A-10 wing sets, continuing their support for Ft. Wayne's @122FighterWing. https://t.co/6oERMhGOmJ https://t.co/6B6CvjYat2"]["ICYMI: The Senate unanimously passed Joe’s bipartisan bill requiring the VA to study the effectiveness of a 3-digit suicide hotline number – a step toward reducing veteran suicide. https://t.co/Oln9713wpY https://t.co/6Aq7qGyIni"]["Read how Joe's bipartisan leadership advanced a regulatory relief package that is going to protect consumers and help Hoosiers and small businesses access capital from community banks: https://t.co/YgKuLalr3N https://t.co/91QaO5fFfA"]["ICYMI: The bill to designate Aug. 3, 2018 as Ernie Pyle Day – introduced by Joe and @SenToddYoung – passed the Senate. It honors the famed Hoosier journalist who was killed reporting in the WWII Pacific Theater. https://t.co/QFDv13itCW"]["#ICYMI: SAVE THE DATE: Joe will be hosting an event in Indiana to honor Hoosier Vietnam Vets on March 29, 2018 - National Vietnam War Veterans Day. Stay tuned for more details! https://t.co/PbGvokohVv"]["From my family to yours, Merry Christmas and Happy Holidays. –Joe https://t.co/u895u8csoq"]["Joe joined U.S. Marines and local veterans to distribute @ToysForTots_USA toys to children at Memorial Hospital of South Bend. https://t.co/hKqnnTYDGt"]["Read more about the different ways that the bill will help law enforcement officers cope with the challenges of their jobs: https://t.co/Qf11ydudPv"]["Joe's 'Law Enforcement Mental Health and Wellness Act,' introduced with @SenToddYoung, is officially headed to the president's desk to be signed into law. https://t.co/1AB3Y0VSSc"]["Joe urged Congress to work in a bipartisan way to bring more resources to fight the opioid abuse epidemic. @CDCgov released reports this week showing that more than 63,000 people died of a drug overdose in 2016, a 21% increase over 2015. https://t.co/8fRdyRVGdS"]["Over this past year, Joe's made stops at farms and in communities all over Indiana to hear from the food and agriculture community what specifically they want to see in the 2018 Farm Bill. Read more about Joe's Farm Bill Listening Tour here: https://t.co/HS8HS1LMPv https://t.co/rKreKA1GZN"]["Thinking of our troops overseas who won’t be home to spend this holiday with their loved ones. God bless them and God bless Indiana. –Joe https://t.co/ljWe061ZNX"]["ICYMI: Joe and @SenTedCruz have reintroduced bipartisan legislation to promote the hiring of National Guard and Reserves into the federal civil service workforce. https://t.co/tt5Ngn0XXx https://t.co/NxhJmSGWdL"]["WATCH: Hoosier Vietnam War vets talk about their service and what it was like returning home after serving our country. On 3/29/18 - National Vietnam War Veterans Day - Joe will host an event in Indiana to welcome home these vets. https://t.co/O6gqj1h4dj"]["Saddened to hear that Dick Enberg, @IUBloomington alum and broadcasting legend, has died.  Thinking of his family. - Joe"]["ICYMI: Joe spoke on the Senate floor about why the McConnell/Ryan tax hike bill is bad for Hoosier middle class families. https://t.co/VntplJzgBH https://t.co/9eIEeovPAN"]["Joe and Senator Todd Young's bill to support law enforcement mental health and wellness programs is headed to President Trump’s desk to be signed into law. The legislation would help law enforcement agencies establish or enhance mental health care services for their officers. https://t.co/d0i5SB6Jlw"]["LIVE: Joe is speaking on the Senate floor calling on Congress to provide more resources to fight the opioid abuse epidemic. New @CDCgov report found that more than 63,000 Americans died of a drug overdose in 2016. https://t.co/Swg0N1DtPO"]["Joe and @SenToddYoung introduced legislation that would continue to allow Hoosier farmers to plant specialty crops like fruits and vegetables without experiencing a permanent penalty to commodity program eligibility. https://t.co/pDyZGj4myL"]["WATCH: Joe's provision in the national defense bill - which has been signed into law by President Trump - requires the Administration to develop a comprehensive strategy within 90 days to confront the threat posed by North Korea. https://t.co/aFtoM0eGG9"]["Joe's long pushed for policies that support companies investing in our workers &amp; penalize those outsourcing jobs. He opposed McConnell/Ryan tax bill that allows corporations like Rexnord &amp; Carrier to continue deducting moving expenses for shipping U.S. jobs to other countries. https://t.co/N7nOEOhz7S"]["Proud of Fort Wayne’s @AddisonAgen. She had a great run on @NBCTheVoice. -Joe #VoiceFinale https://t.co/1LPeKxsnj4"]["Joe voted against Mitch McConnell and Paul Ryan’s tax bill because it overwhelming benefits the wealthiest instead of middle class families and does not protect American jobs. https://t.co/SNMbRTogYD"]["⚡️ “Joe’s thoughts on the McConnell/Ryan tax bill ” by @SenDonnelly\n\nhttps://t.co/FSzg4pTJta"]["Joe’s been willing to work w/ the President, Administration, GOP, &amp; Dems to reform our tax code. Unfortunately, the tax bill:\n-Overwhelmingly benefits wealthiest and top 1% \n-Fails to address outsourcing of American jobs\n-Is a giveaway to Wall Street &amp; other big money interests"]["WATCH LIVE: Joe is speaking on the Senate floor about Mitch McConnell and Paul Ryan’s tax hike bill. Joe agreed with the President that the focus should be on benefitting middle class families &amp; protecting American jobs. This bill would do the opposite.  https://t.co/Q14IPFTye6"]["SOON: Joe is heading to the Senate floor to speak about the McConnell/Ryan tax Bill. Watch live: https://t.co/0rujnf4jCE"]["Saddened by the passing of New Castle Police Chief Brad Catron. Chief Catron dedicated his life to his community with nearly 30 yrs of service,  including 6 yrs as police chief. Sending prayers to his family, fellow officers, and the entire community. –Joe https://t.co/KsGnyjpMM1"]["Joe introduced a bipartisan bill that would help students borrowers by:\n- requiring universities to send borrowers an annual letter on how much debt they have\n- requiring @usedgov to highlight best practices for teaching financial literacy \nREAD MORE: https://t.co/c72fMpUv7l"]["The Ex-Im Bank is important for small businesses and manufacturers in Indiana that export products and create jobs. Scott Garrett opposed Ex-Im for years, but now wants to lead it. I voted against his nomination to stand up for Hoosier small businesses. -Joe https://t.co/reYhqCprB4"]["Rooting for Fort Wayne’s @AddisonAgen on @NBCTheVoice finale. -Joe #VoiceFinale"]["Joe announced the Hoosiers he's nominating to attend service academies in 2018. Congratulations to all the nominees! More info here: https://t.co/C2f4d7TWW4 https://t.co/pU2wzFk6iP"]["#GoodNews: Joe worked to resolve issues that had stalled the Gary/Chicago airport expansion. The airport has made significant progress in 2017, with a new flight center and a new hangar, and a new customs facility for international flights on the way. https://t.co/ZRrKKQghEi"]["#ICYMI: Joe’s bipartisan legislation to designate March 29th as National Vietnam Veterans Day was signed into law. Joe will host an event in Indiana in 2018 on National Vietnam Veterans Day to recognize and honor our Hoosier Vietnam Veterans. https://t.co/Rk56NT5Sn6"]["#ICYMI: The Lugar Center recognized Joe as the 2nd-most bipartisan Senator of past 25 years. He’s the highest-ranking Senator currently serving &amp; has worked effectively to get things done, including enacting legislation to improve military mental health &amp; address opioid epidemic. https://t.co/0ssXEEb8Un"]["Honored to lay wreaths at Crown Hill Cemetery. Thinking about the brave men and women who have served and made the ultimate sacrifice for our country. - Joe #WAA2017 https://t.co/mBUF393M2T"]["SAVE THE DATE: On March, 29th, 2018, Joe will host an event in Indiana honoring Hoosier Vietnam War Veterans. Joe’s bipartisan legislation to designate March 29th as Vietnam Veterans Day was signed into law by President Trump earlier this year. https://t.co/NRSP2XMgnp"]["Joe continues to push for the reauthorization of the Children’s Health Insurance Program (CHIP), which expired on September 30th. If congress does not act, nearly 115,000 Hoosier children on #CHIP could lose coverage. https://t.co/lqTdzj3AuE"]["Joe and @SenTedCruz introduced the bipartisan Military Reserve Jobs Act, which would help promote the hiring of @NationalGuard members and Reservists. https://t.co/FuQfmrbxWI"]["#ICYMI: President Trump signed Joe's provision on North Korea into law, as part of the national defense bill. It requires the Administration to develop, within 90 days, a comprehensive strategy to confront the threat posed by North Korea. https://t.co/CqPLju79lc"]["Joe supports an open internet and today the FCC voted 3-2 to undermine #NetNeutrality. https://t.co/n3qZnbVHPi"]["Glad Michael Dourson, the Administration's nominee to lead the EPA Office of Chemical Safety and Pollution Prevention, has withdrawn. Hope the Administration will find a qualified nominee for this position in a timely manner. -Joe https://t.co/86xw7Ib1Dm"]["The FCC #netneutrality vote is today. As Joe previously stated, he supports an open internet that ensures Hoosiers have access to the content of their choice. https://t.co/f9vsfH7PPE"]["[2/2] The bill would also require @usedgov to outline best practices for teaching students and their family members financial literacy skills. https://t.co/wxTFemH5JN"]["[1/2] Joe introduced his bipartisan Empowering Student Borrowers Act, which would require colleges and universities to annually send students a letter outlining what they would owe for their student loans and how much it will cost to repay. https://t.co/CM0IZYEvtG"]["The @USNationalGuard has been proudly protecting our country for 381 years. We’re proud of our @INGuardsman. #WeAreGuard https://t.co/Fk4vdMIlke"]["No better place to hold the @NBA All-Star Game than @TheFieldhouse, and no better team than the @Pacers  to host it. – Joe https://t.co/41mC8ypD2u"]["After rejecting bipartisan effort to expand the child tax credit in tax reform, GOP is now working to further cut taxes for the wealthiest. \nhttps://t.co/HVf5CEzUaw https://t.co/tOCO7L2uoM"]["Thinking of the injured @IndStatePolice officer and praying for his recovery. -Joe https://t.co/Y7fwrStyWP"]["Happy #Hanukkah to everyone celebrating. –Joe https://t.co/apJgHeRLEB"]["Leonard Steven Grasz, just confirmed to be a U.S. Circuit Judge for the Eighth Circuit, was only the 2nd nominee in nearly 30 years to be unanimously rated Not Qualified due to concerns about temperament by the @ABAesq. Joe voted no."]["Joe Skyped with students from Heritage Hills High School in Lincoln City. #GoPatriots https://t.co/DVrGsP6LtP"]["President Trump has just signed Joe's provision on North Korea into law, as part of the national defense bill. It requires the Administration to develop a comprehensive strategy to confront the threat posed by North Korea within 90 days. https://t.co/VeyOblGujP"]["Joe helped secure $10.9 million in the 21stCentury Cures Act to help Indiana address #opioid epidemic. Centerstone will be able to provide more treatment services to Hoosiers addicted to opioids because of grants they’ve been awarded through this funding. https://t.co/2chPdpSC8y"]["Joe advocated for tax reform w/ policies that'd encourage corporations to invest in American jobs. This bill has neither the carrot to encourage investment in American workers, nor the stick required to address the outsourcing of jobs to foreign countries. https://t.co/gUxN3Xf36d"]["SAVE THE DATE: Joe will host an event in Indiana on March 29, 2018 to welcome home Hoosier Vietnam Veterans on National Vietnam War Veterans Day. https://t.co/JPKeDzW9k6"]["#ICYMI, the bipartisan regulatory relief package Joe helped craft – which would reduce the regulatory burden on community banks and allow them to more easily lend to Hoosier families – passed the Banking Committee and is headed to the Senate floor. https://t.co/OmfyVW5QFC"]["I've said it before and I'll say it again: Mitch McConnell's tax bill is designed for the wealthy – it hurts middle-class Hoosier families. – Joe https://t.co/ZuUYIiFlAF"]["#ICYMI: Joe’s ‘Jacob Sexton Military Suicide Prevention Act’ has been fully implemented by the @INGuardsman. https://t.co/YsDQupYn8j"]["From the beginning, I’ve been willing to work with Republicans, Democrats, and the President and his Administration. But we need to find a tax code that works for middle-class Hoosier families. – Joe https://t.co/aDxnJ5UKbX"]["As I've said the federal government needs to get the cleanup right in East Chicago. Pleased EPA announced USS Lead Superfund site in East Chicago is on list of sites for targeted attention. -Joe\nhttps://t.co/jAve689ZRV"]["Joe and @SenToddYoung introduced legislation that would designate August 3, 2018, as National Ernie Pyle Day, in remembrance of the celebrated war correspondent and Hoosier journalist. https://t.co/AefS60GApx https://t.co/VZKN57MPDS"]["Tax lawyers said Mitch McConnell’s tax bill is riddled with bugs and loopholes that corporations and the wealthy could take advantage of. At the same time many Hoosier families would see a tax hike. https://t.co/pkowi1DnM3"]["#ICYMI, The Lugar Center has recognized Joe as the second-most bipartisan Senator of the past quarter-century. He’s the highest-ranking Senator currently serving. https://t.co/38YtgzpyCV"]["Stay up to date with the work Joe is doing for Hoosiers by following him on Twitter, Facebook, and Instagram. https://t.co/SuvM7Hln9D"]["We should be enacting policies that help working families get ahead. That’s why I opposed Sen. McConnell’s tax hike bill that would result in nearly a million middle class Hoosier families paying more, while the wealthiest receive a tax cut. –Joe https://t.co/hpjXP64QJE"]["JUST IN: Joe has been recognized as the second-most bipartisan Senator since 1993 – the highest ranking Senator currently serving in the Senate. Read more: https://t.co/ZOfaWHaNBN https://t.co/S3iBvhvrSy"]["#ICYMI: Joe’s North Korea strategy amendment that passed as part of the national defense bill is expected to become law soon. It would require the Administration to bring within 90 days a comprehensive strategy to Congress to address the urgent threat posed by North Korea. https://t.co/6DLKFPR7pn"]["On #PearlHarborDay we honor the brave men and women who fought and died during the attack on Pearl Harbor on this day 76 years ago. Today marks the tragic loss of 2.400 Americans – but also a call to action which the \"Greatest Generation\" answered wholeheartedly. – Joe https://t.co/EBTfqrsGpd"]["Joe voted against Sen. McConnell’s tax reform bill, in part, because it would keep a tax loophole that would mean many Hoosier workers pay a higher tax rate than Wall Street hedge fund managers. https://t.co/Zb9ixBKSLm"]["Happy #NationalMinersDay to all of our Hoosier miners. @MineWorkers risked their lives to help our country meet our energy needs. Joe will keep fighting for your pension benefits that you’ve earned. https://t.co/FFLL1kh9ZU"]["Joe is calling for Senator Franken to resign. https://t.co/ff5i1rnhJs"]["Senate Banking Committee passed a bipartisan regulatory reform package Joe helped craft. This legislation would help reduce regulatory burdens on community banks &amp; credit unions to increase lending to small businesses &amp; families, while ensuring important new consumer protections. https://t.co/pUxCCiczL7"]["I agree with President Trump that we should protect American jobs. I couldn’t support Sen. McConnell’s tax bill because it does nothing to discourage companies from shipping U.S. jobs to foreign countries. – Joe https://t.co/yARWPw2f5x"]["Joe joined @SenToddYoung to introduce bipartisan legislation that would require the VA to formally study its Veteran Crisis Line, to better understand how to make it more effective for veterans in distress. https://t.co/FcWPAD0YGO"]["READ: Joe's bipartisan National Suicide Hotline Improvement Act would require the FCC to study whether to simplify the national suicide hotline number to a 3-digit number. https://t.co/2vR3W0bV6f"]["Joe introduced bipartisan legislation to help bring resources to rural communities through a @USDA grant to combat opioid abuse in rural communities. https://t.co/ggYE0XRyJX"]["ICYMI: Joe made ten stops this year all across Indiana to hear from Hoosier farmers about what they want to see in the 2018 #FarmBill. https://t.co/HS8HS1ubXX https://t.co/0iQEeGh9Ll"]["Joe wants to preserve an open internet for Hoosiers. #netneutrality https://t.co/PtkeK03IiA"]["Maddening that Mitch MConnell couldn't find room in this 479-page bill for my provision to ban companies from writing off moving costs when outsourcing jobs to foreign countries. - Joe https://t.co/hf1VQdFDhw"]["I opposed Mitch McConnell’s bill because it is not tax reform, it’s a partisan tax hike on Indiana’s middle class and it does nothing to prevent outsourcing of US jobs to foreign countries. -Joe\nhttps://t.co/k6UMhjeRLW"]["From Day 1, I’ve engaged with Republicans at every opportunity re: tax reform\n\nI'm disappointed we’re continuing to see a partisan process in Senate. It doesn’t have to be this way. Let’s work together.  - Joe https://t.co/NtekxWZcNF"]["WATCH: Joe’s Jacob Sexton Military Suicide Prevention Act, now implemented by @INGuardsman, is helping servicemembers access mental health services. https://t.co/ZXfGtVILyI"]["@PatrickMurphyPA, I’m proud of veteran Kevin Burke and our #studentvets using the #GIBill benefits they’ve earned. Thank you for your service, Kevin. Congratulations and best of luck in your studies. – Joe https://t.co/jkpLvg5Ssf"]["ICYMI: Joe's bipartisan VA Prescription Data Accountability Act has been signed into law. This will help VA share prescription drug data with state monitoring program to help curb veterans’ opioid abuse. https://t.co/Qvwc8QTEqP"]["Jim Nabors captured the Hoosier spirit singing “Back Home Again in Indiana” at #Indy500 and made us laugh as Gomer Pyle on #TheAndyGriffithShow. Jim, you will be missed. –Joe https://t.co/hOZHm8gobB"]["Disappointed that EPA has again failed to realize the full potential of renewable biodiesel and advanced biofuels. We’re better off when we produce more renewable fuels here at home. We shouldn’t be cutting back. –Joe https://t.co/y4VXdOoFr1"]["This year, Joe made ten stops across Indiana as part of his Farm Bill Listening Tour to hear from Hoosier farmers and Ag stakeholders about what they want to see in the 2018 #FarmBill. https://t.co/HS8HS1ubXX https://t.co/0jAUAvmvVq"]["Joe is urging the Administration to fight for American steelworkers by demanding fair steel trade practices from other countries. https://t.co/EginTPwu0V"]["#ICYMI: Joe's Jacob Sexton Military Suicide Prevention Act—signed into law in 2014 to help improve military mental health—has been fully implemented by @INGuardsman. https://t.co/NroWdGTwda"]["Joe met with retired Hoosier miners to discuss the 'American Miners Pension Act' and the @MineWorkers Pension Fund. Earlier this year, Joe helped secure a permanent fix for retired miners’ health benefits. https://t.co/9L1f9HvGpU"]["Joe’s staff was on hand for the Commander of @US_StratCom General John Hyten’s visit to @NAVSEACrane. https://t.co/iVxSRF2C9d"]["READ: Joe’s statement on North Korea’s latest missile test. https://t.co/g7uU8zBFxv https://t.co/LRRZfNnnAQ"]["#ICYMI: WATCH: Joe introduced bipartisan legislation w/ Sen. @JohnBoozman that would allow veterans who served in Thailand during the Vietnam War the opportunity to prove toxic Agent Orange exposure in order to qualify for VA benefits. https://t.co/ols9pmMBYc"]["This morning, Joe skyped with @LNHSwildcats government class. #GoWildcats @LTGoodNews https://t.co/klnJ4ZBvuz"]["Joe sat down w/ members of #RollingThunder &amp; they discussed how Hoosier Vietnam vets are still suffering from the effects of exposure to Agent Orange. His legislation would ensure all Vietnam War vets who served in Thailand are given the opportunity to receive VA treatment. https://t.co/PbOeffL7rS"]["READ: Joe's statement on Michael Dourson, the Administration's nominee to lead the EPA Office of Chemical Safety and Pollution Prevention. https://t.co/laFhj9BpV2"]["WATCH LIVE: Joe discusses implementation of his Jacob Sexton Act Military Suicide Prevention with the @INGuardsman Adjutant General of Major General Carr and Dr. Edwards. https://t.co/gg6d6RWuMi"]["#ICYMI: Joe called on Senate leadership to do more to combat #opioid abuse in rural and underserved areas. https://t.co/1G8zCDDu0V"]["This #SmallBusinessSaturday we celebrate and recognize the nearly half-million Hoosier small businesses. –Joe https://t.co/eO1IiH2N9q"]["Joe introduced bipartisan legislation to combat the opioid crisis in rural communities. It would direct @USDA to give priority to applicants in rural communities that would use federal grants for substance abuse education, treatment, and prevention. https://t.co/OyK5T4UtvS"]["Nov. is #AlzheimersAwarenessMonth. Joe met w/ @AlzIndiana earlier this yr to hear about challenges of caring for a loved one w/ Alzheimer's. https://t.co/oKT2zjTgUj"]["Wishing you a #HappyThanksgiving. -Joe https://t.co/uYebp9ctPU"]["WATCH: As part of his Farm Bill Listening Tour, Joe visited @FoodFinders to hear from anti-hunger advocates about their priorities for the 2018 Farm Bill. https://t.co/xIPX96wMid"]["Praying for the safe return of 3 missing personnel following @USNavy aircraft crash in the Pacific. Grateful that 8 personnel were rescued and are reportedly in good condition. –Joe"]["Joe's bipartisan VA Prescription Data Accountability Act, which allows the VA to share prescription drug data with state monitoring programs, was signed into law by President Trump. https://t.co/pgrSgL2iLG https://t.co/AGKUFVZ6QE"]["Read about the latest Veterans History Project event that Joe’s staff hosted, and why it's so important to catalog and archive our veterans' stories.  https://t.co/z3fKUd7vpc"]["READ: Joe welcomed @USTreasury's announcement today of additional sanctions against North Korea and its backers. https://t.co/aLrjXlrTkO https://t.co/a28oLBGpzg"]["(2/2) Their bipartisan 'Strengthening the Addiction Treatment Workforce Act' would make addiction treatment facilities eligible for the National Health Service Corps student loan repayment and forgiveness program. https://t.co/pp02DJMOpC"]["(1/2) #ICYMI: Joe and @lisamurkowski of Alaska urged Senate leaders to do more to combat substance use disorders in rural and underserved communities. https://t.co/JXRQ9OqYD1"]["(2/2) Joe talked about the bipartisan regulatory relief package he played a major role in crafting that would reduce burdens for community banks, as well as the need to ensure our workers have the skills training to meet the needs of employers. https://t.co/vBesUOdAX9"]["Today, Joe toured @FoodFinders in Lafayette and met with representatives from statewide anti-hunger groups. The event was part of his Farm Bill Listening Tour around the state to gather input from Hoosiers about what they want to see in the upcoming Farm Bill. https://t.co/Qgc6gkwK9y"]["Today, Joe welcomed President Trump's announcement that he intends to re-designate North Korea as a state sponsor of terrorism. Read more about Joe’s efforts to counter North Korea here: https://t.co/NWVYZSvlRE https://t.co/HJNKsXz44P"]["(2/2) Joe discussed addressing the opioid and heroin epidemics and how mental health services play a crucial role in addressing this public health crisis. He also talked about his bipartisan workforce shortage bill that would help draw professionals to underserved communities. https://t.co/JLNeNDkPia"]["(1/2) Joe received the @USChamber Spirit of Enterprise award at the Lafayette Chamber this morning. https://t.co/bntWGYZo89"]["#GoodNews: @StVincentIN and Gleaners are teaming up to open Indiana’s first food bank-based health clinic. Joe strongly supports  food banks throughout our state and advocates for nutrition programs that serve low-income children and seniors. https://t.co/qK4onMhZ8G"]["Joe joined @SenToddYoung and @GovHolcomb at today's @NDFootball game vs. @NavyFB. https://t.co/BRYmEnu0W5"]["Great to have Admiral Moran at @NotreDame. -Joe https://t.co/BCEDQ4Degw"]["Joe joined @ABC57News for the @NDFootball pregame show. https://t.co/H2OzqDddxe"]["Today is #NationalSurvivorsofSuicideDay, a day to honor friends and families who have lost loved ones to suicide. https://t.co/0QgoNIt81z"]["#ICYMI: Joe’s bipartisan National Suicide Hotline Improvement Act recently passed the Senate. The legislation would encourage the Federal Communications Commission to review ways to make the national suicide prevention hotline more effective. https://t.co/w3baqPWU2R"]["November is #NationalDiabetesMonth. Know the symptoms of diabetes and get screened. https://t.co/VtYskQzP78"]["(2/2) Joe helped negotiate a final national defense bill where he pushed for this provision and others that recognize Indiana’s contribution to our national security. https://t.co/LUAphjqz7Q"]["(1/2) Joe's provision in the defense bill, requiring the Administration to submit a comprehensive strategy on North Korea, is officially headed to President Trump's desk. https://t.co/rbb9pzbG49 https://t.co/F5Ql54TPiR"]["Joe's staff held a Veterans History Project event today in Logansport. One vet interviewed was Wayne Landes, who served in the @usArmy during WWII and fought in the Battle of the Bulge. https://t.co/eyohhh7yj7"]["Read Joe’s statement on Sen. Franken from earlier today: https://t.co/vTaHsg7fGA"]["Joe's bipartisan VA Prescription Data Accountability Act, to expand the VA’s authority to share prescription drug data with state monitoring programs, is now headed to the President's desk to be signed into law. https://t.co/q5lMEhKjvV https://t.co/pW95bpqny6"]["Evansville’s Rev. Adrian Brooks served as a guest chaplain in the Senate today, with Joe’s recommendation. Joe &amp; Rev. Brooks marched in Selma, AL, in 2015 to mark the 50th anniversary of Bloody Sunday. https://t.co/DwxXmo5jfT https://t.co/CuvtkXd1V4"]["The bipartisan bill Joe helped introduce to require amateur athletics organizations, including USA Gymnastics, to report sex-abuse allegations immediately to law enforcement or a child-welfare agency, has passed the Senate. https://t.co/RQJudmz2Cg https://t.co/zg8CITBbkB"]["ICYMI: Joe and @SenatorFischer, leaders of the Armed Services Strategic Forces Subcommittee, wrote an op-ed about why our nuclear arsenal needs to be modernized and well-maintained. https://t.co/ya36u6gQ3L"]["WATCH: Last week, Joe and thousands of Hoosiers got hands-on digital skills training during the #GrowWithGoogle event at @IndianaMuseum. https://t.co/iEC2qrbuOh"]["Joe and Sen. @JohnBoozman introduced a bipartisan bill that would give Vietnam War-era Veterans who served in Thailand the ability to prove exposure to Agent Orange and access the VA benefits they deserve. https://t.co/spUPBLzg6t"]["@SBTribune highlighted Joe’s efforts to help veterans experiencing suicidal thoughts seek help. Joe’s bipartisan legislation recently passed the Senate and would encourage FCC to review ways to make the national suicide prevention hotline more effective. https://t.co/8XKISjK1Rb"]["We can improve access to mental health services for law enforcement officers. That’s why Joe introduced and the Senate passed his bipartisan Law Enforcement Mental Health and Wellness Act. Stories like Officer Nielsen’s highlight the need for this bill. https://t.co/iuLKfZurdt"]["[2/2] Joe carefully crafted this bipartisan deal w/ Sens @MikeCrapo @SenatorHeitkamp @SenatorTester @MarkWarner to develop commonsense policies that'd help Hoosier &amp; American small business owners, veterans, &amp; families. Read more about Joe’s efforts here: https://t.co/apqq1hjo1n"]["[1/2] Joe announced a Banking Committee agreement to allow community banks and credit unions to increase lending to small businesses and families, maintain the safety of our financial system, and offer new consumer protections. https://t.co/nWiQfgVZu5"]["#ICYMI: Joe held a Farm Bill listening session w/ @AncillaCollege ag students and faculty, as well as members of @INFarmBureau, and Indiana Soil and Water Conservation District. https://t.co/AU0S34NDdn"]["ICYMI: Joe wrote an amendment into the #BRINKAct to ensure that @USTreasury has the resources it needs to impose sanctions on North Korea. The bill is now headed to the full Senate for consideration. https://t.co/9Wrw4nMk77"]["READ: Joe and @SenatorFischer, leaders of the Senate Subcommittee on Strategic Forces, wrote an op-ed about why our nuclear arsenal must be modernized and well-maintained. https://t.co/ya36u6yqVj"]["REMINDER: Joe’s staff will be hosting a Veterans History Project event in Logansport 11/16, 1:30 PM to 3:30 PM EST. All area veterans are encouraged to come and share their stories of service. Hoosiers interested in volunteering to interview a veteran are also welcome. https://t.co/86cNoj4fcG"]["This evening, Joe honored and celebrated Hoosier veterans at the Veterans Day Council of Indianapolis Banquet. https://t.co/ZCOYlzkDMy"]["Go @NDFootball! Beat @CanesFootball. -Joe Who you got @chucktodd? #NDFootball #GoIrish"]["WATCH: Joe’s message to Hoosiers on #VeteransDay. https://t.co/4l5Kih0yKI"]["Joe held a Farm Bill listening session yesterday with @AncillaCollege agriculture students and faculty, as well as members of @INFarmBureau, and the Indiana Soil and Water Conservation District. https://t.co/rVYYzhF2Ii"]["I've long supported efforts to address the skills gap &amp; train Hoosiers for in-demand jobs. Hoosier educators, jobseekers, students &amp; local businesses have an opportunity to receive digital skills training from @Google to help prepare them for good-paying STEM jobs in Indiana.-Joe"]["Joe participated in #GrowWithGoogle kickoff in Indy. 2,500 Hoosier will learn new digital skills from @Google experts to help prepare them for jobs in tech related fields, which Indy has become a hub for. https://t.co/OijpEQczJ8"]["#GoodNews: Tomorrow, November 11, all veterans and active-duty military personnel, and everyone in their vehicle, will be admitted FREE to Indiana state parks and state forests. https://t.co/OktpO4ty5N"]["This morning, Joe spoke at the Witham Family YMCA Veterans Day Breakfast in Lebanon. Central Indiana YMCA locations now offer veterans new programs focused on wellness and reintegration. https://t.co/8m1M5RzDij"]["Joe's staff attended the Veterans Day ceremony in Carmel today to honor local veterans. https://t.co/jxwboVFQ7N"]["Joe’s provision calling for a clear, comprehensive strategy to confront the threat posed by North Korea is included in the final national defense bill released today. https://t.co/LwCJ7lL57f https://t.co/EcC0mx7bUa"]["Proud to work w/ Sen. @JohnBoozman on behalf of our Vietnam War veterans exposed to agent orange while serving in Thailand. https://t.co/VKHsws0TGq"]["Joe’s staff attended the Porter County Veteran Treatment Court graduation this afternoon. https://t.co/F1xgGmeUR5"]["ICYMI: Joe's bipartisan legislation with @senorrinhatch to study the creation of a 3-digit, easy-to-remember suicide hotline number passed the Senate unanimously and is headed to the House. https://t.co/1lGcLWxeyg"]["Joe's worked to make sure more Hoosier students are trained to get high-skill, good-paying, in-demand jobs in #STEM fields. #NationalSTEMDay https://t.co/dXqY0jvspL"]["Joe and @SenToddYoung introduced the bipartisan USS Indianapolis Congressional Gold Medal Act to recognize and honor the crew of the USS Indianapolis for their service and sacrifice to the U.S. during WWII. https://t.co/IVYyXKlQ1b"]["Joe’s effort with @senorrinhatch studying whether to simplify the national suicide hotline number passed the Senate. Simplifying the number could potentially make it easier for people with suicidal thoughts or their loved ones to seek help. https://t.co/skQrDqw5Mk"]["Joe discussed his tax reform priorities in a meeting yesterday with WH officials. Joe also urged VP Pence to ensure tax policies support American workers in advance of VP's Thursday trip to Indiana. Read Joe's letter to VP: https://t.co/8X5eYrymCr"]["We're grateful to our first responders who've worked around the clock to help with recovery efforts after the series of tornadoes that recently tore through our communities. – Joe https://t.co/kUbyiYlqF6"]["Joe spoke at the @AmericanLegion reception celebrating the passage of Joe and @SenToddYoung's legislation honoring the organization’s 100th anniversary with a variety of limited edition commemorative coins. https://t.co/uW28sSuq18"]["Joe's amendment to @SenateBanking #BRINKAct would ensure @USTreasury has resources to effectively enforce North Korea sanctions. https://t.co/prJ1boJBZu"]["WATCH: Joe is fighting for the bipartisan #AlexanderMurray agreement, which would help stabilize the health care individual market and lower Hoosiers’ deductibles and co-pays. https://t.co/f1qxTNFiny"]["#ICYMI: Joe and @SenToddYoung's bipartisan legislation to recognize @IndianaDunesNPS as a National Park is awaiting Senate passage. This is the companion legislation to @RepVisclosky's bill that recently passed the House. https://t.co/mR5DBoKsyF"]["At the @INNationalGuard headquarters in Indianapolis, Joe's staff recognized retired @USArmy Col. Roger Peterman for his military service and dedication to our community. https://t.co/B0PBUlsbs1"]["#ICYMI: Joe and @SenToddYoung pitched @amazon on why Indiana would be the best choice for the company’s #HQ2. https://t.co/Xl0FGOXadE"]["#GoodNews: Indy will host the 2022 @CFBPlayoff National Championship. https://t.co/icmfazaBkj"]["Saddened to learn about the shooting at a church in Sutherland Springs, Texas. We mourn for those who lost their lives and are thinking of all who were injured. -Joe"]["Joe's working to ensure Hoosiers in rural communities have access to addiction treatment facilities &amp; services. https://t.co/XBLk4X6jxq"]["Joe spoke at the IN Military Veterans Hall of Fame 2017 Induction Ceremony, where he helped present awards to the 2017 class of inductees. https://t.co/IcTSZ2Vyyh"]["Joe helped secure $10.9 million in federal funding to fight the opioid crisis in Indiana, but we need more to confront this public health crisis. He's calling on Senate Leadership to devote more funds to combat the epidemic. https://t.co/ZTnZem20C8"]["100 years ago today, Corporal James Bethel Gresham became the first Hoosier and one of the first Americans to pay the ultimate sacrifice in WWI. Joe's staff attended events in both Evansville and Indianapolis honoring his legacy. https://t.co/TowjJiyfbB"]["The Administration refused to commit to continuing CSR payments, causing health care costs to rise for many Hoosiers. Joe is pushing for the Senate to pass the bipartisan #AlexanderMurray deal that would help provide relief to families &amp; stabilize markets. https://t.co/LoZeBvZsjh"]["It's an honor to receive the Legislator of the Year award from the Indiana Health Industry Forum. I'm going to keep working to ensure Indiana stays on the forefront of the medical industry. – Joe https://t.co/WwFpo7d5Hw"]["Students from Heritage Hills in Lincoln City stopped by Joe’s office this afternoon while visiting the @uscapitol . #GoPatriots https://t.co/oKh87YNjtn"]["Joe met with @THCofC to discuss economic development in the Wabash Valley. https://t.co/0TQu9VAriW"]["Proud to work w/ @RepVisclosky on legislation that passed the House and would designate the IN Dunes a National Park. https://t.co/buI9Qy9EGP"]["WATCH: During a Senate Banking Hearing, Joe questioned former Rep. Scott Garrett on why he now wants to run the Ex-Im Bank, an agency he has long opposed. The Ex-Im Bank helps IN small businesses export products and create jobs. https://t.co/hMBcnBj7MD"]["Thankful to the veterans in Delphi for trick-or-treating with Hoosier kids last night. – Joe https://t.co/7NUhUufNMZ"]["Joe’s staff will host a #VeteransHistoryProject in Logansport on 11/16. Area veterans are encouraged to come and share their stories. https://t.co/xz8JQoGOrj"]["Joe urged Senate leaders to bring more funding to the fight against the opioid epidemic. READ Joe’s letter here: https://t.co/XDrGERZ0w4 https://t.co/1fGikiddKI"]["Joe, @SenJoniErnst, &amp; @SenRobPortman introduced bipartisan legislation to ensure the RV industry has access to the duty-free trade program. https://t.co/bx1iquGMYm"]["My thoughts are with the victims of the senseless attack in New York City and with the first responders at the scene. - Joe"]["Wishing a fun and safe Halloween to all Hoosier kids trick-or-treating tonight. – Joe #HappyHalloween https://t.co/VXZX3xtlnc"]["#ICYMI: Joe supports bipartisan bills that would reauthorize funding for #CHIP &amp; Community Health Centers. Nearly 115k Hoosier children could lose access to health care unless Congress acts. https://t.co/9WvottzYz8 https://t.co/DuS5QDwZBE"]["(2/2) The pair of Senators explained to @amazon that Indiana has:\n✓ A robust and talented workforce\n✓ Effective transportation infrastructure\n✓ Competitive cost-of-living\n✓ World-class universities\n✓ A strong manufacturing sector"]["(1/2) READ: Joe and @SenToddYoung sent a letter to @amazon urging them to strongly consider Indiana for its second headquarters. https://t.co/JdMEcjnBA8 https://t.co/rf7KZh9Uj2"]["ICYMI: Joe laid out additional steps the federal government can take to confront the opioid crisis, which include expanding prevention services, enhancing border security, and disrupting drug trafficking.  https://t.co/gJK1Goh10y https://t.co/rJPuuCjQWx"]["ICYMI: Joe spoke on the Senate floor last week urging his colleagues to pass the bipartisan #AlexanderMurray agreement, a bipartisan solution to stabilize the healthcare markets. https://t.co/WM9SZvvx0o"]["#GoodNews: Continued progress at the Gary/Chicago International Airport since the runway expansion, which Joe helped facilitate. The Gary Jet Center just opened an 8,300 sq. ft. Flight Center for flight crews and passengers to work and relax in.  https://t.co/44JygA7Hil"]["ICYMI: Joe greeted &amp; thanked Hoosier veterans from northeast &amp; north central Indiana on their trip to DC this week. https://t.co/ajlGUlQWHC https://t.co/029XcAaetS"]["Joe joined the India Association of Indianapolis last night to celebrate its 50th anniversary &amp; #Diwali. https://t.co/6IY22atlyf"]["And Joe is working with @lisamurkowski to increase the number of providers who can treat substance abuse disorders. https://t.co/JDgwGHZSjU https://t.co/kJ3KTlXfpB"]["This summer, Joe teamed w/ @SenatorStrange &amp; @SenPatRoberts on bills to increase access to telemedicine for those battling opioid addiction. https://t.co/ixBXHtGjjW"]["Joe also helped Congress pass, and get signed into law in 2016, the Comprehensive Addiction and Recovery Act #CARA. https://t.co/1vKb7hlSIK https://t.co/wpJLTCEq2M"]["Joe recently helped Indiana get nearly $11 million to combat the opioid abuse epidemic https://t.co/y1ETfSNpHv https://t.co/CmJRUSSBVt"]["REMINDER: It's National Prescription Drug Take Back Day - 10am-2pm. Find your nearest collection site: https://t.co/Ume50pn3hV #DEATakeBack https://t.co/W9BZUBUN6a"]["Joe helped secure nearly $11m for Indiana to combat opioid abuse. He is working on legislation to increase telemedicine treatment options. https://t.co/9ZH69LFqNy"]["WATCH: Joe spoke on the Senate floor about the need to pass the bipartisan #AlexanderMurray agreement, and about how efforts from the Administration to undermine the healthcare law are causing premiums to spike. https://t.co/Zt0hopQr2u"]["Joe’s staff attended a roundtable in Hammond to discuss how we improve the transition for vets living with PTSD back into the community. https://t.co/BNae0k0dNs"]["Tomorrow is National Prescription Drug Take Back Day. Safely get rid of unused prescription drugs to help stop prescription drug abuse. Learn more and find your nearest collection site here: https://t.co/Ume50pn3hV #DEATakeBack https://t.co/0baAldC3og"]["Joe has continued to work in a bipartisan manner w/ Senate colleagues to provide relief to Hoosier families &amp; stabilize #healthcare markets. https://t.co/BDYFuBJ62X"]["Joe highlighted how Administration’s actions related to cost-sharing reduction payments led to uncertainty &amp; increased costs for Americans. https://t.co/pstIqAYKqM"]["Joe talked about the opportunity the Senate has to pass bipartisan #AlexanderMurray agreement. https://t.co/CG2brShm4O"]["READ: Joe’s statement on the President declaring the opioid crisis a ‘nationwide public health emergency.’ https://t.co/GuQG54KErx"]["At Senate Aging hearing yesterday Joe introduced @IUSchoolofEd's Dr. Mank who testified abt the needs of ppl working &amp; aging w/ disabilities https://t.co/yxFGQlvXwc"]["Earlier this afternoon, Joe spent time with students from @OrchardOwl @uscapitol. https://t.co/aV4ktiF35q"]["Joe greeted and thanked Hoosier World War II and Korean War veterans from northeast and north central Indiana who were visiting D.C. #HFNEI https://t.co/eCNiAi6ze1"]["Joe is heading to the Senate floor to talk about why Senate must act and pass bipartisan #AlexanderMurray health care agreement. Watch here: https://t.co/5q0YVFs8jj"]["Joe’s staff hosted a #VeteransHistoryProject yesterday for Hoosier veterans in Clarksville to share their stories from serving in our Armed Forces. https://t.co/KerWi9CVk6"]["Joe announced his support for two bipartisan bills that would reauthorize funding for the Children’s Health Insurance Program #CHIP and the Community Health Centers Fund. https://t.co/oQr0TJIuKw https://t.co/PtMdEJphli"]["It's #NationalFoodDay. On the @SenateAg Committee, Joe's worked to promote rural economic development and help Hoosier farmers produce a safe and reliable food supply. https://t.co/Btt6abT1PJ"]["In advance of Wednesday’s @NationalFFA Convention in Indy, Joe welcomed @IndianaFFA and other FFA members from across the country. #WeCanWeWillFFA https://t.co/ovWRosDABx"]["As we continue to pursue a comprehensive approach to end the #opioidepidemic, there are common-sense steps we can take to strengthen our border enforcement and disrupt drug trafficking. -Joe https://t.co/zIcIIvJ4Jw"]["#ICYMI: Joe asked the President to follow through with declaring the opioid epidemic a national emergency. https://t.co/vXL9fPS44V"]["Joe continues to work in a bipartisan manner to make progress on issues important to Hoosiers. Since joining the Senate, 28 of his legislative efforts have been signed into law – 6 of them this year alone. Here are a few examples: https://t.co/2VthCsS2DM"]["`Last week, the Senate unanimously agreed w/ Joe that companies that ship U.S. jobs abroad should lose tax breaks. https://t.co/SINfZPbM8M"]["Joe released the latest #JustAskJoe, which highlights Susan Couk of Lafayette who needed assistance in replacing medals for her brother’s service in the Air Force during the Vietnam War. https://t.co/RdJGCoEmaa"]["It was great to be with President Mearns at this year's @BallState Homecoming! Best wishes to all the Cardinals, past and present, celebrating this weekend. – Joe #ChirpChirp https://t.co/jN83ufAsLR"]["#ICYMI: Joe hosted @USMC Commandant @GenRobertNeller at Crane. Read more: https://t.co/QvBDbnhsm5"]["Joe visited the Northwest Indiana Information Sharing Security Alliance in Crown Point to thank the first responders and all the members of NIISSA for keeping our communities safe. https://t.co/KYYtyNBGBG"]["[2/2] Earlier this year, Joe introduced bipartisan legislation to protect the credit ratings of veterans wrongly penalized by VA medical bill payment delays. https://t.co/ysSVf8byB1"]["[1/2] #ICYMI: This week, Joe received commitment from the Consumer Data Industry Association to help better safeguard veterans’ credit from harm due to delayed VA medical payments. https://t.co/42Cz6gsIkX"]["The Senate today agreed with Joe in affirming that companies that ship American jobs to foreign countries shouldn’t get tax breaks. WATCH ↓ https://t.co/hVwhQkd9Ez"]["(2/2) Over the past several months, Joe has participated in bipartisan negotiations and listening sessions w/ health care experts. Joe has long said if we want to fix our health care system, we need to work together."]["Joe met with Juanita Duggan, President/CEO of @NFIB to discuss small business growth and job creation. https://t.co/sdOUf4wUJH"]["(2/2) Through the Veterans History Project, veterans’ personal narratives are archived for future use by historians, teachers, and the general public."]["(1/2) Clarksville-area veterans are encouraged to attend the Veterans History Project event this Tuesday, October 24th, to share their stories. https://t.co/zKqXUh7ULD"]["[2/2] Joe introduced the bipartisan Protecting Veterans Credit Act to protect veterans’ credit from being wrongly penalized by VA delays in reimbursements for medical bills. https://t.co/ql4lrTzThf"]["[1/2]At @SenateBanking hearing, Joe got commitment from credit bureaus to help protect veterans’ credit from harm due to VA payment delay. https://t.co/Duc6GIhc7X"]["Happy Diwali to those celebrating the festival of lights. Wishing the glow of the Diya brings you all a bright year ahead. –Joe"]["Joe asked President Trump to follow through with declaring the #opioidepidemic a national emergency. He remains willing to work with the Administration to stem the tide of this public health crisis. https://t.co/dpounOYTeR"]["Joe had coffee this morning with constituents from @NotreDame's Harper Cancer Research Institute, @NRCAnews, and student groups from @DePauwU and Notre Dame. https://t.co/ekMmsmsrI3"]["This morning, Joe spoke with the students in the AP US Government class at Frankton High School in Madison County. Go Eagles! https://t.co/1bD98Dp3Xa"]["[3/3] The NDAA bill – at Joe’s urging – also includes funds for Indiana-specific items, like $24 million for a shipping and receiving facility at @CraneArmyAmmo and $8 million for a military construction project at @THAirport."]["[2/3] Last month, the Senate overwhelmingly passed the bipartisan national defense bill, which included Joe's provision that requires the Department of Defense to present a clear strategy on how it plans to deal with North Korea. https://t.co/jB4PHzyyum"]["[1/3] Today, Joe was named to the Senate conference committee that will negotiate the final national defense bill with the House."]["WATCH: Joe helped secure a $787,000 federal grant to help entrepreneurs and tech start-ups in Pike County. https://t.co/xBTJ4sHha8"]["ICYMI: Joe hosted @USMC Commandant @GenRobertNeller at Crane. Joe has brought a number of military leaders see the work done at this critical military laboratory and meet with the talented workforce. https://t.co/WsAYJ83jMP https://t.co/CraA1B0YCh"]["ICYMI: Joe visited the Willow Treatment Center to continue hearing firsthand the challenges Hoosiers are facing in battling the opioid epidemic. Read more here: https://t.co/n5LOINIWHi"]["Joe helped dedicate @iusb’s newly renovated Riverside Hall. With Joe's support @iusb secured $1 million federal grant to help renovate and expand their Health and Wellness Center. The center is designed to provide affordable, quality primary and preventive health care services. https://t.co/es96TFVjh9"]["Joe’s staff will host a Veterans History Project in Clarksville on Thursday, October 24, from 1:00 PM – 3:00 PM EDT. https://t.co/6V3QXbYAok"]["This morning, Joe visited @INGuardsman members during training exercises @camp_atterbury and toured the installation’s new Wellness Center. https://t.co/QsTGhtqvE2"]["As Joe said 4 mo. ago, to strengthen health care Admin must stop undermining our system. Admin’s actions this wk again sabotage health care. https://t.co/QvcOWpR8I6"]["Joe thanked members of his Service Academy Committee for conducting interviews with students seeking nominations for admittance to the U.S. Military, Naval, Air Force, and Merchant Marine Academies. https://t.co/hQ8lVDf5nY"]["I was honored to attend the Crane Navy Ball last night in French Lick. Yesterday marked 242 years of the @USNavy serving our nation with honor and distinction and we are forever grateful. –Joe #NavyBirthday https://t.co/S3U4F4HE8p"]["READ: Joe’s statement on the Administration’s decision to end important Cost Sharing Reduction payments. https://t.co/HMlEQ1wHGA"]["Great to be in Loogootee! Thanks to Pete Smith owner of the Dairy Master, your tenderloin and everything else on the menu is great. - Joe https://t.co/TSy6aeBgp8"]["Today, Joe hosted @USMC Commandant @GenRobertNeller at Crane, so he could see up-close the critical work Crane’s workforce does to protect our national security &amp; ensure our servicemembers, including the Marines, have the tools they need to succeed. https://t.co/muVeftHlYn"]["Joe has made it a priority to show military leaders the work being done at Crane, and how Hoosiers are on the cutting edge of defense research and technology development. Here are some of the leaders Joe has hosted at Crane: https://t.co/2QHvOwSQ7k"]["On the Senate Armed Services Committee, Joe has worked to support and enhance Crane, which is one of our nation’s most important military labs and munitions depots. https://t.co/uJmfBn9Bkx"]["Today, Joe and @SenToddYoung will host @USMC Commandant @GenRobertNeller at Crane so the Commandant can see firsthand how the women and men at Crane give our military the tools they need to help our troops return home safely and keep our nation safe."]["Joe toured The Willow Treatment Center &amp; held a roundtable discussion on efforts to address the opioid epidemic. https://t.co/whatLCxSes"]["Today, Joe spoke at the @RiseOfRest tour in Speedway, where he highlighted our talented workforce and the growth of start-ups and tech companies in Indiana. https://t.co/vp34W8PzrJ"]["READ: Joe's statement on the Administration’s health care executive order. https://t.co/WWMACYw7BL"]["Today is #NationalFarmersDay, a day to thank our Hoosier farmers for feeding our families &amp; driving our economy. Joe's held listening sessions across the state to get input on the upcoming #FarmBill. https://t.co/t9PeHbelyq"]["Joe again called for the Administration to commit to providing stability to health insurance markets and working together on a bipartisan solution to strengthen our health care system. Read Joe’s letter here: https://t.co/rVyZh8dJto https://t.co/tLxTsfUUXA"]["Joe recently helped the Senate pass a bipartisan bill that would increase sanctions to cut off funding to Hizballah and its affiliates. https://t.co/RmqEuKsrbi"]["Joe visited @IndyParksandRec After Schools Meals Site at Christian Park to help serve meals to students and learn more about the program. https://t.co/W8DzunSKV5"]["It's #WorldMentalHealthDay. Joe's worked to improve access to mental health care services for our servicemembers, veterans, and law enforcement. https://t.co/sljOJQu0f9 https://t.co/TzRv9ixukq"]["I agree with the President that we need to address the outsourcing of American jobs. I’ve talked with him twice about my End Outsourcing Act, and he said he supports my proposal. I hope we can work together to encourage domestic investments that benefit American workers. –Joe https://t.co/3Qr5FDg9df"]["This #FirePreventionWeek, remember to stay in the kitchen while using the stove and replace old wires before they become frayed and dangerous. https://t.co/lgmEEAmSrF https://t.co/DdEFWt7LUv"]["October is #BreastCancerAwarenessMonth. Learn more from the @CDC about breast cancer screenings here: https://t.co/SmSLeHz3Vv https://t.co/YSCEL7K0BG"]["Welcome home to Indiana Task Force 1 who returned from volunteering in Puerto Rico. –Joe https://t.co/pB5BZ9Lmaw"]["St. Joe Co. VA Health Clinic opened its doors last week. Watch Joe talk about what it took to make this health clinic a reality: https://t.co/ZH8VHa6xOP"]["Terry, a Noblesville Vet came to Joe's office for help after being unable to get a VA appointment. Watch the latest \"Just Ask Joe”: https://t.co/X6h6zvtdaF"]["#GoodNews: Carmel was ranked the #1 small city in the country to raise a family. https://t.co/G1YTMsad0V"]["Great to be with my friend @IndyMayorJoe at @AllegionUS in Indy for #MFGDay17. We both wore our blue blazers in hopes of a Colts win at home on Sunday. –Joe https://t.co/DTlL60Z4N7"]["Joe spoke w/ Hoosier students &amp; @AllegionUS employees at the Indy facility about manufacturing jobs in Indy and across Indiana. #MFGDay17 https://t.co/bDdajH1p5Z"]["#ICYMI: After years of hard work Joe, along with the VA and local veterans, made a new VA clinic in north central Indiana a reality. Recently, Joe participated in the grand opening. https://t.co/CLb0bJPAUE"]["#ICYMI: WATCH: At a Banking Committee hearing, Joe pressed Wells Fargo CEO into admitting to outsourcing jobs to the Philippines. https://t.co/KfFEaWm2H5"]["Joe on tax reform: “I want to help working and middle-class families achieve greater economic security.” Watch more here: https://t.co/Xb2LE6EjM7"]["Joe met with Sigal Mandelker, Under Secretary of @USTreasury for Terrorism and Financial Intelligence, to discuss strengthening sanctions against North Korea. https://t.co/7XgMAXBrdd"]["Joe met with a member of the Indiana board directors of @NEAToday to discuss education funding and #CHIP. https://t.co/5Ghz53hke6"]["At @Senatebanking Joe also pressed about services Equifax will offer to millions impacted and the company’s obligation to consumers, who fall victim to identity theft or financial harm in the future due to data breach. https://t.co/O4jEcvgdEo"]["WATCH: Joe questioned Equifax’s commitment to protecting servicemembers' personal data during a @SenateBanking hearing on data breach. https://t.co/bfGEA4RDlq"]["Joe applauded Senate confirmation of fellow Hoosier Ted McKinney to serve as @USDA Under Sec. of Agriculture for Trade &amp; Foreign Ag Affairs. https://t.co/0WKiLecT9m"]["Efforts to undercut health care are harming Hoosiers. It’s unacceptable and why Joe keeps working on a bipartisan solution to stabilize markets. https://t.co/xQ3Ui4gDAK"]["Yesterday, Joe, @Sen_JoeManchin, &amp; @SenCapito introduced bipartisan legislation to protect pension benefits for retired miners. https://t.co/IbYb7mKzPc"]["Joe's bipartisan bill w/ @senorrinhatch &amp; @SenDanSullivan — which pushes for an easy-to-remember 3-digit phone # for @800273TALK — cleared @SenateCommerce today. https://t.co/dU0HDiSNqX"]["Joe spoke to the @nationalcouncil about his work w/ Sen. @lisamurkowski to expand substance use disorder treatment in underserved areas. https://t.co/e1pDPcG4iX"]["Joe was recognized by @nationalcouncil as their Legislator of the Year for his efforts to fight the opioid epidemic in Indiana, specifically his efforts to address provider shortages. https://t.co/8wpzScQvhc"]["In light of the recent #Equifax data breach that put millions of Americans’ data at risk: \n\nFor more info: https://t.co/xzaWMRZF0Z https://t.co/TF4xHsBShE"]["Great to Skype w/ students in the Mount Vernon High School Government class. –Joe #majorpride https://t.co/CBOyKcK4Qm"]["Joe and @SenRonJohnson are urging the House to pass their Right to Try bill, which passed the Senate unanimously earlier this year. https://t.co/QhJYM4cfrd"]["Proud to vote in Senate Ag Committee for Hoosier Ted McKinney to be an @USDA Under Secretary—hope for a full Senate vote soon. –Joe https://t.co/ecL5SAZ01l"]["During #ManufacturingWeek we celebrate IN manufacturers &amp; Hoosier workers who build the most advanced, highest-quality products in the world https://t.co/F7HToTdxDq"]["If you’re trying to locate a loved one following the Las Vegas shooting: https://t.co/KBVa5xA2rx"]["Read: Joe’s statement on the Las Vegas shooting. https://t.co/nAdcUtFN4v"]["[5/5] And Joe worked w/ Transpo to ensure a vets could use public transportation to get to and from new VA clinic. https://t.co/wueGxweVIx"]["[4/5] This wasn't a quick or easy process but Joe stood together w/ vets to break ground on new VA clinic https://t.co/5Bv8Eb1hSB"]["[3/5] Joe worked nonstop to secure VA approval, congressional authorization, and funding for the new clinic. https://t.co/3RLj7hhAGi"]["[2/5] Joe held roundtable and gathered facts to make the case for a new VA clinic. https://t.co/ifPyhcbd0w"]["[1/5]Since 2007 Joe has worked with VA, north central Indiana veterans &amp; veterans advocates to make St.Joseph Co. VA Health Clinic a reality https://t.co/Hw3ggmzOaZ"]["Joe spoke with Hoosiers walking in @CHNw Annual Breast Cancer Awareness 5K in Gary. https://t.co/CcquYW74kt"]["(2/2) Joe continues to push for Senate to extend funding and joined a bipartisan group in urging swift action.\nhttps://t.co/XiuVNzzL34"]["#GoodNews: It's National Public Lands Day - FREE admission to all Indiana State Parks today! https://t.co/UCXJv4bgMM"]["(1/2) Tomorrow reauthorization expires for federally qualified health centers. Indiana has 83 of these centers."]["Joe chronicles his work w/ local vets &amp; VA to make St. Joe VA Clinic a reality--resulting in today's grand opening: https://t.co/NWr91nU7JO"]["Joe asked @usdaRD’s Anne Hazlett about @USDA ability to improve access &amp; funding for opioid abuse treatment in rural areas. https://t.co/YHQrKrdw95"]["Great to join @IndianaChamber and @SenToddYoung tonight. -Joe #ICCinDC https://t.co/04Z97gqNls"]["READ: Joe’s statement following President Trump’s speech on tax reform in Indianapolis: https://t.co/MZdS9szESj"]["At @IndianaDefense breakfast, Joe highlighted his continued commitment to advocating for @navseacrane @CraneArmyAmmo in the Senate. https://t.co/a92iFRGO7o"]["Joe believes #taxreform should create jobs, protect jobs &amp; benefit middle class families. He has pushed for measures to address outsourcing. https://t.co/Y2vPdSi2r9"]["WATCH: This #SuicidePreventionMonth Joe and @SenDanSullivan talk about bipartisan effort to simplify the national suicide hotline number. https://t.co/kY4mBJ26Vr"]["(2/2) And at Joe's urging, the annual defense budget –  passed in the Senate last week – would fully fund $24M in new facilities at Crane."]["(1/2) Joe met w/ leaders of @CraneArmyAmmo to get an update on their work - in Feb he advocated for 90 Crane jobs that were slated to be cut https://t.co/YqLKqgWs4O"]["Praying for Puerto Rico &amp; U.S. Virgin Islands. They are American citizens &amp; I support providing relief in the wake of Hurricane Maria. – Joe"]["Joe will join President Trump tomorrow in Indianapolis for speech on tax reform. https://t.co/VXXUAHBnAq"]["Thank you to Nathan and to all Indiana educators who work tirelessly to shape young Hoosier minds and build tomorrow's leaders. https://t.co/PpRHxbPqaK"]["Joe called on Senate to abandon #GrahamCassidy &amp; return to bipartisan discussions to stabilize health care markets. https://t.co/iWmmfwCIUa"]["According to @ahahospitals #GrahamCassidy would not help stabilize the health insurance markets. https://t.co/aOWHUPIwC4"]["Joe joined a bipartisan group of Senators to introduce a resolution designating September as National Workforce Development Month. https://t.co/Mg4JegMOsx"]["Joe attended the #POWMIA Day event in South Bend to honor all of our servicemembers who haven't made it home. #NeverForget https://t.co/dGhSwj4RbD"]["During #POW/MIA Day event, Joe presented medals to family of WWII vet from New Carlisle. https://t.co/URNlzgbEO9"]["As Indiana struggles w/ #opioid abuse epidemic, the #GrahamCassidy bill would undercut necessary treatment funding.  https://t.co/KndP2Fp3Op"]["Joe believes affordable health care is critical so Hoosiers can live up to their God-given potential. He opposes #GrahamCassidy proposal. https://t.co/LLAmzWz4HM"]["I've said we must cut off lifelines to the Kim regime, including oil supplies &amp; am pleased China will restrict oil exports to N. Korea. -Joe https://t.co/iFBE0fgASE"]["For Joe the #healthcare debate has always been about the health &amp; well-being of Hoosiers. It’s about folks like Beth, Brad, and Kyle. https://t.co/EAwuIIb46S"]["Joe joined Vice President Pence at his tax reform event today in Anderson. Read Joe’s statement: https://t.co/8kFlnyOaJq"]["ICYMI: Joe believes tax reform should include policies that will create new jobs and protect existing jobs. https://t.co/rVcXEsFahR https://t.co/OsxCHuLrOc"]["#ICYMI: Joe and a bipartisan group of Senators introduced a bill that would increase funding for @USDA export promotion programs. https://t.co/k75lQfpEZv"]["Joe will join the VP for his visit to Anderson tomorrow to discuss tax reform. Read Joe’s statement: https://t.co/qLFOK5WhMD"]["Joe stopped by the Jasper County Veterans Service Office in Rensselaer today to thank them for assisting local vets. https://t.co/bhpx4dhC7Y"]["This #FarmSafetyWeek, check to be sure your machinery is in safe, working condition &amp; your kids &amp; grandkids know proper safety protocol. https://t.co/4c8L3s7ZGl"]["Wishing everyone in Indiana and across our country celebrating #RoshHashanah a happy and sweet New Year. -Joe"]["READ: Joe wants continued bipartisan efforts to stabilize markets. #GrahamCassidy would take away coverage &amp; increase premiums for seniors. https://t.co/A1KV5pZDgn"]["Joe &amp; @SenDeanHeller asked @Equifax to explain how it'll protect info of servicemembers in light of data breach. https://t.co/L0HRGOayAD"]["Joe met with 8th graders from St. Louis de Monfort Catholic School in Fishers @uscapitol. https://t.co/4Oec6Ub5aN"]["(2/2) During a Banking hearing in July, Joe asked Chair Yellen about the impact the opioid addiction has on economy &amp; the workforce. https://t.co/J4cgkxCjtz"]["(1/2) Joe &amp; @SenSherrodBrown are urging @federalreserve to explore &amp; devote resources to combat the opioid epidemic. https://t.co/51sJuckiDy"]["Happy to help @IndyGoBus serve Hoosiers in central Indiana. Modern infrastructure is an important part of continued economic development. https://t.co/fbbFaupE1Z"]["Joe's provision in CARA helps programs like Project POINT connect naloxone recipients to long-term treatment: https://t.co/WFpOVPd0Fu"]["Joe welcomed @HHSGov grant for @EskenaziHealth's Project POINT initiative to help curb opioid addiction. https://t.co/FPCeALz8Pd"]["WATCH: At Senate Ag hearing, Joe introduced Hoosier Ted McKinney, nominee for @USDA Under Sec. of Ag for Trade &amp; Foreign Ag. Affairs. https://t.co/TGqYjtSjru"]["(1/4) The latest Senate GOP health care bill would roll back pre-existing condition protections &amp; end HIP 2.0 as we know it. –Joe"]["(2/4) As I've said repeatedly, we should work together to make #healthcare more affordable and accessible for Hoosiers &amp; Americans. –Joe"]["(4/4) We can improve our health care system, and at the very least Congress should do no harm. -Joe"]["Senate passed #NDAA, including Joe’s amendment requiring @DeptofDefense to bring a North Korea strategy to Congress. https://t.co/wzNjLuvgB9"]["Joe’s staff attended 100th home development in Indy’s @IndyNEAR neighborhood. Congrats to Paul on your new home! #Near100homes https://t.co/1eBoWI30xO"]["The @USAirForce &amp; @CIA began their service on this day 70 yrs ago. https://t.co/gVL3UY67x0"]["#ICYMI: Joe spoke on Senate Floor on Friday reiterating the need for a comprehensive strategy to address threat NK poses. https://t.co/CN81lrueOo"]["This #ConstitutionDay, we celebrate not just the 230th anniversary of its signing, but alsoof the rights it enshrines. https://t.co/yXpAzGSPAf"]["With Joe’s help, @IndyGoBus received a federal grant for infrastructure upgrades as they move toward electric buses. https://t.co/0jnb1EktZu"]["Joe walked w/ 3,500 other Hoosiers today in @AFSPIndiana Out of the Darkness Walk &amp; spoke about work that must be done to prevent suicide. https://t.co/XFSY3IEmn5"]["Joe's worked to make sure law enforcement officers have access to mental health services. #SuicidePreventionWeek https://t.co/ivCTVn3TkK"]["Joe's staff watched a Huey helicopters from Grissom land on IN War Memorial law during Indy #POWMIA event. https://t.co/UdJz1xhMLX"]["Continued efforts to undermine health care law &amp; create uncertainty could result in premiums rising 15%. Just look at  latest @USCBO report. https://t.co/tKXYj8Y3na"]["#GoodNews: According to Glassdoor, Indy is the second-best city for jobs in America. https://t.co/XhNfKUFI5E https://t.co/prbp9PGG2v"]["The new St. Joe Co. VA Health Care Center opened today. Joe has worked since '07 to get this center built for north central IN vets. https://t.co/rxNhSeWYJ7"]["On #POWMIA Recognition Day we honor all the brave American servicemembers who were taken prisoner or remain missing. You are never forgotten https://t.co/2781FPqawY"]["READ: Joe's statement on North Korea's latest missile launch. https://t.co/hOFmpqe5fW"]["Joe is sporting an orange tie to bring awareness to childhood hunger in honor of #HungerActionDay &amp; #HungerActionMonth. https://t.co/VzmJdTDdtZ"]["During @SenateAgDems hearing, Joe discussed nutrition programs in #FarmBill18, why food banks need #TEFAP to help food insecure people. https://t.co/QBuIkYh9aG"]["Thanks for coming by. I support @NIH funding so we can continue research to get us closer to finding a cure.  –Joe https://t.co/yV2R2PVOEW"]["Proud to work w/ @GLFOP @senToddYoung @SusanWBrooks &amp; many others on this bill; our officers deserve access to #mentalhealth services. -Joe https://t.co/s7ogWDSkwk"]["WATCH: Joe on @SenateFloor discussing his amendment that would take outsourcing into acct for fed defense contracts. https://t.co/E8pDHr3j7K"]["Joe is heading to the Senate Floor to discuss his amendment that would take outsourcing into account for federal defense contracts."]["This morning, Joe had coffee with Hoosiers from the Indiana Farmers Union, Meals on Wheels of Central Indiana, and other orgs. https://t.co/ivgS0ZteJV"]["Yesterday, Joe attended the second in a series of bipartisan coffees to discuss stabilizing health insurance markets."]["Joe spoke at the Growth Energy Summit this morning, where he accepted the Fueling Growth Award &amp; discussed need for US energy independence. https://t.co/Pb9zFdd9oH"]["REMINDER: Joe's staff will host #VeteransHistoryProject in Crown Point THIS FRIDAY. All area veterans are encouraged to come share stories: https://t.co/pFhFwigp9h"]["READ: Joe’s statement after discussing tax reform over dinner with President Trump. https://t.co/uUzCvmCLR7"]["Joe will push for vote on his End Outsourcing Act, which would ensure federal contracting decisions take into consideration outsourcing. https://t.co/m0ulNVNCQq"]["REMINDER: Service Academy Nomination applications are due THIS FRIDAY, September 15th, by 6:00 PM ET. More info: https://t.co/2ir7KZ95wo https://t.co/OZm5VheDTu"]["Joe met with @INFarmBureau to discuss top priorities for Hoosier farmers &amp; get their input for the upcoming Farm Bill. https://t.co/HXIlqCNAIV"]["Joe met with students from Holy Spirit Catholic School in Indy @uscapitol. https://t.co/GArvtdyoTH"]["Joe's staff attended @GLCommerce 2017 Regional Workforce Summit to see how industries are working together to create success in Lafayette. https://t.co/nSsgLiRlq4"]["Joe met w/ Hoosiers from @AmericanCancer to discuss the importance of funding @NIH &amp; cancer research. https://t.co/QWLNSgjGNv"]["Joe received @uschamber Spirit of Enterprise award today @ZvilleChamber and discussed the opioid epidemic, affordable housing, &amp; small biz. https://t.co/chHadVxzPq"]["Thanks @RecycleForce for the tour of your operation today. Also great to see my friend Gregg Keesling.–Joe https://t.co/GKpIRoNFpY"]["Joe stopped by the 9/11 memorial in Indy to honor those killed in the 9/11 attacks 16 years ago. #NeverForget. https://t.co/VjSOrxUaPR"]["Today we come together as Americans to remember friends and family lost in the tragic terrorist attacks on 9/11 16 years ago. #NeverForget https://t.co/ytR3d5Kcah"]["Let us pay tribute to LaPorte native son and a Hooiser Hall of Famer, coach Ken Schreiber. He'll be missed. -Joe \nhttps://t.co/aAJ8b99udq"]["Joe and @SenatorCollins re-introduced a commonsense fix to the ACA: \"full-time\" should mean 40 hours, not 30. https://t.co/1rUTkP3Rcs"]["Proud of @INGuardsman headed to FL to help w/ response efforts for Hurricane #Irma. Stay safe!  –Joe https://t.co/ojbKzNibYF"]["Joe sent a letter to @USTradeRep outlining principles for #NAFTA renegotiation focused on Hoosier &amp; American workers https://t.co/TP5tALbxjP https://t.co/huGGINdnsh"]["Proud to help pass this bill. We must do all we can to help families of fallen first responders &amp; ensure their kids can get a good edu. –Joe https://t.co/rNvFIS1Z8t"]["W/  Joe’s help, @SBTranspo &amp; @VANIHCS will add a bus stop at the soon-to-open St. Joseph County VA Health Care Center. https://t.co/ztfr3IdssU"]["Joe spoke in the Senate about his amendment to national defense bill calling for an Administration strategy to address NK threat. https://t.co/gB5kTd5NKY"]["Joe’s staff will host a #VeteransHistoryProject in Crown Point 9/15. All area veterans are encouraged to come and share their stories: https://t.co/T1tnUjN7qw"]["#GoodNews: Indy won bid to host @GLFOP conference in 2021. https://t.co/NhSmNr8Olz"]["WATCH LIVE: Joe on @SenateFloor urging Administration to deliver strategy within 90 days to address NK threat. https://t.co/YPL0R7fG04"]["After Joe attended a briefing for Senators from military &amp; intelligence leaders on North Korea, he continued pushing for a clear strategy. https://t.co/lWEvJbQF4e"]["(5/5) Encouraged by good conversation w/ my colleagues &amp; state insurance commissioners before the hearing. –Joe"]["(4/5) Pleased to see 1st in series of bipartisan #healthcare hearings in effort to stabilize premiums &amp; marketplace. –Joe"]["(3/5) Proud to talk w/ bipartisan group of Senators today about ways to work together to improve our #healthcare system. –Joe"]["(2/5) At the least we should do no harm and work to stabilize the market. –Joe"]["(1/5) As I've said, we should work in bipartisan way to make #healthcare more affordable and accessible for Hoosiers &amp; Americans. –Joe"]["Joe will push for passage of his #NDAA amendment requiring Admin. to provide a North Korea strategy to Congress. https://t.co/xAW0ioD6Qg"]["#GoodNews:@railcats are going to the playoffs! Joe was at Friday’s game where he threw the first pitch.#DonnellyDay. https://t.co/fosXKhvodq https://t.co/ZM4RLnX0RE"]["Joe believes Congress should pass bipartisan legislation to protect #DACA youth. https://t.co/jXc5W02Smg"]["Happy #LaborDay to all the hardworking Hoosiers in every corner of our state. https://t.co/V4YCBsDL2b"]["#ICYMI: Joe visited the Clearinghouse in Madison, where he met w/ a number of local volunteers. https://t.co/FHFwBkwuqX"]["#ICYMI: Students @ProsserCareers showed Joe welding, manufacturing, &amp; construction trade programs. #DonnellyDay https://t.co/YwL3jv0Rl6"]["Joe helped Indy Promise Zone receive $100 million in federal assistance to revitalize Indy's East Side. https://t.co/6NQYInFHvo"]["#ICYMI: Joe worked w/ @EvansvilleFD recruits &amp; discussed the Assistance to Firefighters grant he helped the department receive this year. https://t.co/aoPxbzivwz"]["Joe met w/ law enforcement officials to discuss how HIDTA is functioning w/ 4 IN counties coordinating efforts to battle drug epidemics. https://t.co/cIUDePveK4"][".@NotreDame’s own Father Hesburgh honored today by @USPS with a Forever stamp. https://t.co/2HRA9ius1j"]["Joe helped fasten screws for a trailer frame during a #DonnellyDay at Universal Trailer in Bristol. https://t.co/5Izl8gBDuU"]["Joe’s staff attended a Veterans Treatment Court graduation in Grant County &amp; presented congratulatory certificates to the graduates. https://t.co/K1jdFxLoMM"]["Joe received American Life Sciences Innovation Council Champion of Health Care Innovation Award for efforts to improve Hoosiers’ health care https://t.co/8WOGKxxBvp"]["Great to have lunch w/ @IndyKiwanis. Thanks for all that you do for children and communities in Indy. –Joe https://t.co/e5B5PKNNp6"]["Joe discussed infrastructure, health care, and fighting the opioid abuse epidemic w/ Central IN mayors &amp; town council presidents. https://t.co/7ZRzm2V0Ko"]["Joe worked with a @CokeCCBCC employee to load a pallet of soda onto a forklift for his latest #DonnellyDay in Indy. https://t.co/qyaBTL7VxJ"]["Joe and @sensasse sent a letter to @SenateBanking @BankingGOP encouraging continued focus on North Korea sanctions. https://t.co/tqjEUtwNYF https://t.co/WLngyK8JWV"]["Joe operated a backhoe with the help of students enrolled in @prossercareers construction trade program. #DonnellyDay https://t.co/8J1qLN6qer"]["Jacob, a student at @ProsserCareers in New Albany, gave Joe a lesson in welding. #DonnellyDay https://t.co/aMoVrh8sGu"]["Joe had lunch at @indiancreekmkt &amp; toured the revitalized downtown Corydon. https://t.co/JwzPVg6Bdr"]["Joe stopped in at Clearing House in Jefferson Co., a one-stop-shop for Hoosier families who need support to get back on their feet. https://t.co/dcuPMlLjIc"]["Stopped in for breakfast at M&amp;S Main Street Diner in Rising Sun in Ohio County. Great food and great company - try the goetta. -Joe https://t.co/S0apg4pObf"]["If you're able to support victims of #Harvey, be sure it's to a legitimate charity. Tips to identify charity fraud: https://t.co/EResyHTMnl"]["When in Santa Claus, you have to stop at the Christmas Store. Santa wasn't in, he'll be back at 10am on Friday. https://t.co/rFFiiNHM0b"]["During a #DonnellyDay, Joe practiced a fire simulation drill alongside @EvansvilleFD recruits. https://t.co/TpeBGWgLF9"]["Joe stopped in Posey County today to meet with Hoosiers at the Mt. Vernon @AmericanLegion and talk with the @MVDemocrat. https://t.co/Csex75efjY"]["READ: Joe's statement on today's North Korean missile test ↓ https://t.co/Dg9BMulLFz"]["Joe learned about the cutting-edge technology @genomicadvocacy students use to learn about genetic mapping. https://t.co/SJlprtETvC"]["Joe met the @IndianaState students studying for their MS in genetic counseling. #DonnellyDay https://t.co/gnLuroyBf4"]["Joe discussed infrastructure, workforce training, &amp; combatting opioid epidemic during lunch w/ Madison Co. Chamber in Anderson. https://t.co/UOaCcRVXkm"]["Joe helped harvest tomatoes in Grant County at the Carey family farm. https://t.co/3d33ixvDyJ"]["Joe heard from Hoosier tomato farmers about the importance of crop insurance to specialty crop farmers.  #FarmBill https://t.co/M8qbk2jp7R"]["During breakfast w/ Muncie Delaware Co. Chamber of Commerce, Joe talked about growing the region's economy for Hoosier families. https://t.co/VIFkD7MSMK"]["Congrats to Jorge on my staff on being commissioned as a 2nd Lieutenant in @INGuardsman. We're proud of you. -Joe https://t.co/28hv2RL4zX"]["Joe attended Overdose Lifeline's 4th annual Indiana Overdose Day event remembering Hoosiers we've lost to opioid and heroin addiction. https://t.co/Y5SGnRb7R9"]["Thinking about our brothers &amp; sisters in TX during this difficult time. Please know IN has your back and we’re praying for you. –Joe"]["REMINDER: Joe’s staff will host a #VeteransHistoryProject in Jeffersonville 8/31. More info here: https://t.co/Li10xBDmI6"]["North Korea continues its unacceptable behavior. Administration should bring a comprehensive strategy to Congress.\nhttps://t.co/QeOHXSN6gT"]["Joe’s staff attended Evansville Women’s Equality Day to celebrate passage of 19th amendment &amp; honor women working towards greater equality. https://t.co/pSNLoHeKOi"]["Sad to hear of the death of Hoosier servicemember Myles Miller of Marion. My prayers are with his family, friends, and fellow soldiers. -Joe https://t.co/3Z7L0Ll4b6"]["Proud bipartisan VA appeals reform I helped intro is law. It'll help vets facing unacceptable wait times for benefits claims appeals. –Joe https://t.co/VMIRPlrv1l"][".@GaryChiAirport is ready for flights after Joe worked w/ stakeholders to ensure completion of runway expansion. https://t.co/sZ1BC91sZW https://t.co/ma3E3GFtOx"]["Joe welcomed news @USTreasury issued sanctions targeting Chinese &amp; Russian companies &amp; individuals supporting North Korea’s missile program. https://t.co/UfbeSq8DY1"]["Joe’s staff participated in @ChamberBloom Federal Focus luncheon at @IvyTechBL. https://t.co/jgGyXCQmbY"]["Joe’s staff will host a #VeteransHistoryProject in Jeffersonville 8/31. More info here: https://t.co/Kb73YUdi0y"]["READ Joe’s statement following the President’s address to the nation about the U.S. presence in Afghanistan. https://t.co/Jq8GDIIYmH"]["Joe's staff recently attended the @Bedford_Chamber annual dinner and heard from @IndianaUniv President McRobbie. https://t.co/dVfTRwf78R"]["Praying for the sailors who were injured, those missing from the #USSJohnSMcCain, and their families. -Joe"]["READ: Joe’s statement on discovery of USS Indianapolis wreckage. https://t.co/hd4eqLytP5"]["ICYMI Joe &amp; @INFarmBureau sat down w/ Hoosier farmers at @IndyStateFair to hear their priorities for next #FarmBill\nhttps://t.co/VSCWc1RT8v"]["Thinking of those who were lost or injured in #Barcelona terrorist attack &amp; their loved ones. We must stand together against terrorism. -Joe"]["Through Joe's work, Hoosier veterans who used GI Bill at ITT Tech will get benefits refunded for credits that don't transfer. https://t.co/hRQQNKtBl6"]["#ICYMI: Joe stopped by @usdafsa appreciation day at @indystatefair to thank employees for helping Hoosier farmers access @USDA services. https://t.co/TTbNlcAFcb"]["Today POTUS signed bill that Joe helped introduce to assist student veterans harmed by ITT Tech closure.\nhttps://t.co/xSKKMckldY"]["Joe’s opioid workforce bill would incentivize providers to treat ppl w/ substance use disorders in underserved areas https://t.co/oUrN1WQiWh"]["https://t.co/c9aUPMsU5k"]["During Joe’s #DonnellyDay at @GEAviation in Lafayette he helped employees assemble a jet engine. https://t.co/BQdUQzLxWm"]["At @indyrotary lunch, Joe talked about his work to strengthen military mental health care, address opioid epidemic &amp; North Korean threat. https://t.co/MN4crRMIim"]["Joe &amp; @INFarmBureau held Farm Bill listening session at @IndyStateFair to hear priorities from Hoosier farmers &amp; producers for #FarmBill17. https://t.co/6CV0IlRRlW"]["Joe talked w/ @onezonecommerce about expanding opportunities for Hoosier workers and businesses in Fishers &amp; Hamilton Co. https://t.co/OFOUa5rswM"]["For years, Joe has pushed for further action to address China’s unfair trade practices. Read his statement on POTUS' announcement today. https://t.co/wXF4OLaiZL"]["Today is 82nd anniversary of #SocialSecurity, a vital program that allows seniors to access the benefits they’ve earned &amp; retire w/ dignity. https://t.co/YhKueQ0S3H"]["We must stand together against hatred and bigotry that doesn't represent our values as Hoosiers or Americans. -Joe #Charlottesville"]["#ICYMI: Joe’s bipartisan Right to Try bill that passed the Senate would allow terminally ill ppl to exhaust all treatment options. https://t.co/Mzo26l3PDy"]["Joe welcomed news President Trump plans to declare the #opioid crisis a national emergency. https://t.co/4QJm8lchtW"]["Joe's bill to aid @CapitolPolice injured in recent shooting is now law. Intro'd w/ bipartisan group of Congressional Baseball team members. https://t.co/l48Ipvedir"]["Joe’s staff was in Ellettsville for Smithville Fiber’s announcement it's investing over $500K in high-speed fiber connectivity. https://t.co/dLOrpRYSSc"][".@LauraMclinn thanks for joining me and for your continued advocacy for Right to Try. –Joe https://t.co/wGZvDtobYX"]["[3/3] I could not live with the thought of not getting Right to Try done in the Senate for folks like Jordan and others. –Joe https://t.co/zt1i9iDqAE"]["[2/3] Would allow terminally ill people like Jordan, who have exhausted all treatment options, to try experimental drugs. https://t.co/FcwwJEMiTo"]["[1/3] Joe was joined by Laura &amp; Jordan McLinn to discuss Senate Passage of his Right to Try bill. https://t.co/FCzQW91TE3"]["WATCH: Joe is live w/ Jordan &amp; Laura McLinn to talk about the Right to Try Act. https://t.co/3dou0FSNPn"]["#ICYMI: Joe &amp; @SenRonJohnson's Right to Try Act passed the Senate, would allow families new options for treating terminally-ill loved ones. https://t.co/agkfXR180G"]["#ICYMI: Joe reiterated that the U.S. needs a clear, comprehensive strategy to address North Korea. https://t.co/WwrRGRuS90"]["Joe’s staff attended the @HealthLinc Health &amp; Wellness Fair in Valparaiso. https://t.co/ixsPs6JBJD"]["The deadline for Hoosier students to apply for a 2017 U.S. Service Academy Nom. is Sept. 15th. Learn more here: https://t.co/2ir7KZ95wo https://t.co/6XW9Pwq9qe"]["READ: Joe’s statement on reports of North Korea’s miniaturized nuclear warhead: https://t.co/ApZ2x2JL9i"]["#ICYMI: Joe wrote letter of support for @PortsofIndiana-Burns Harbor app to get @USDOT grant. https://t.co/tFKEOM5jOC"]["W/ Joe's help, @PortsofIndiana-Burns Harbor set to receive $9.85M @USDOT federal grant to expand cargo capacity.  https://t.co/fIHmad4TT9"]["[2/2] We all must work together to address this lead crisis and provide safety and security to all impacted residents. -Joe https://t.co/eyZvwvcUWX"]["[1/2] Joe invited @HUDgov @SecretaryCarson to visit East Chicago &amp; is pleased he made the trip out to hear from residents &amp; local officials. https://t.co/7GblkWt998"]["Joe, @govholcomb, @sentoddyoung, @repvisclosky, Mayor Copeland, &amp; other leaders discuss East Chicago lead crisis w @HUDgov @SecretaryCarson. https://t.co/VMKFJgHLG4"]["The Soldiers and Sailors Monument is now an official National Historic Landmark. #GoodNews https://t.co/d8KaxWVcGe"]["#ICYMI Joe visited Richmond to hear about issues facing Hoosier families in their community. https://t.co/qs9ujn7zh8"]["#ICYMI Joe introduced a bipartisan package to help combat substance abuse disorder in rural communities. https://t.co/4XbXUco52P"]["Joe paid his respects to @SouthportPD Lt Aaron Allan, his family, &amp; fellow officers. This is a sad day for all Hoosiers. https://t.co/79uhB3Qhfz"]["#ICYMI Joe’s ‘Right To Try’ bill passed Senate, would help terminally ill people access potentially life-saving medical treatment. https://t.co/FK7NV78j7g"]["#GoodNews: There's been increased cargo activity this year at the @PortsOfIndiana. https://t.co/tiPkTjrk5e"]["Congrats @GaryChiAirport on receiving fed approval for U.S. Customs Border Patrol facility to service intl flights. https://t.co/U8GKRpWd44"]["Congrats to @IFD_NEWS on receiving the Freedom Award for supporting @inguardsman &amp; Reserve employees. https://t.co/Xewac9eWkd"]["Proud to work with @SenToddYoung to support bipartisan @AmericanLegion 100th Anniversary #Coin Act. –Joe https://t.co/3iwbs5mqAc"]["Happy 227th birthday to @USCG, founded on August 4, 1790. #CoastGuardDay #SemperParatus https://t.co/rlJFlRR4Yv"]["Joe visited Pioneer Village at @IndyStateFair and took a turn at driving Jerry and Chub the oxen. https://t.co/vO1nOMmiAE"]["Joe attended the @indianapork Ham Breakfast this morning for opening day of @IndyStateFair. https://t.co/RfRdXFu5jz"]["Joe’s staff attended the @INRedCross Veterans Forum to hear from service providers to Hoosier veterans and their families. https://t.co/cyJf1v5d9Q"]["When my bipartisan 'Right to Try' bill passed Senate, I told Hoosier @LauraMclinn to celebrate. She &amp; Jordan did. Right back atcha’. –Joe https://t.co/IIjkrFJ2BV"]["Congrats to my friend @JeromeAdamsMD, who has been confirmed as Surgeon General. Look forward to working with him. –Joe https://t.co/dbmFjunTLC"]["Joe’s statement on the death of Columbus native and @USArmy Soldier Jonathon Hunter: https://t.co/ihxLaEaERZ"]["[2/2] Jordan McLinn, who has Duchenne muscular dystrophy, and others, could access more treatment options w/ Joe's 'Right To Try' bill. https://t.co/bRU63kI4Qw"]["[1/2] Joe &amp; @SenRonJohnson's 'Right To Try' bill passed Senate &amp; would help terminally ill access investigational drugs for treatment. https://t.co/1GJcC7NZD6"]["Couldn't be @IMPDnews Dep. Chief Waters' service due to Senate being in session. He's a hero. Praying for his family &amp; fellow officers. -Joe https://t.co/fMAfuqnEh8"]["Joe spoke about his End Outsourcing Act, which ensures federal contracts go to companies investing in US workers. https://t.co/bFGOohxOS2"]["Read Joe’s statement on the passing of former @NDFootball Coach Ara Parseghian: https://t.co/xymWutBuQo"][".@SouthportIN recognized fallen @SouthportPD Lt. Aaron Allan during #NationalNightOut by renaming a street in his honor. https://t.co/DAjzW1sGlV"]["READ: Joe’s statement on voting to confirm Christopher Wray to lead @FBI. https://t.co/7rTI4P2T3I"]["Joe and  @SenToddYoung joined to offer bipartisan support of Hoosier @JeromeAdamsMD to serve as U.S. Surgeon General. https://t.co/CznoyCO9Et"]["Joe’s staff attended @IMPD’s #NationalNightOut &amp; Community Crime Fighters of the Year program to recognize Indy area police officers. https://t.co/6VgS5fCui4"]["Joe introduced legislation to reform @FEC so it can better oversee campaign finance laws. https://t.co/AACBsySzCf"]["Joe gave an update on his work to @WCACC &amp; received the Spirit of Enterprise award from @USChamber for efforts to promote job creation. https://t.co/zkXo1xYa2N"]["Joe presented @USArmy Airborne field grade officer Ralph Hull w/ medals he earned during 40yrs of military service. https://t.co/U8coV7c7ir"]["Joe is urging the Administration to do no harm on health care, commit to providing market stability. More here: https://t.co/dUZ74CGuMd https://t.co/bwG265WOwg"]["Today marks the 52nd anniversary since Medicaid and Medicare were signed into law. https://t.co/L504yLjs1l"]["Joe spoke w/ several #USSIndianapolis survivors during their annual reunion in Indy. @USNavy https://t.co/KCtcUBZzAz"]["#ICYMI: READ: Joe helped pass bipartisan sanctions on Iran, Russia &amp; North Korea. https://t.co/5sjloBz8u6"]["Joe announced a bipartisan legislative package to help rural communities fight substance use disorders. https://t.co/NxHHRPzf05"]["READ: Joe’s statement on the most recent North Korean ballistic missile launch. https://t.co/Xqrks1XpA6"]["Joe's staff attended The Moving Wall event in Columbus, a traveling replica of the #VietnamMemorial that honors vets across the US. https://t.co/DUAwMK2f1B"]["Continued collaboration between @NAVSEACrane &amp; @LifeatPurdue will help servicemember preparedness. https://t.co/Qh19zinMeL"]["READ: Joe's statement after voting against the Senate's health care bill. https://t.co/UNRuIQ8k5v https://t.co/eqwXxXRHv2"]["Joe helped the Senate pass bipartisan sanctions on Russia, Iran, North Korea. It's off to President Trump's desk. https://t.co/UuIPIbbzYI https://t.co/qrrKobI6jJ"]["The passing of @IMPDNews Deputy Chief Jim Waters is a tremendous loss for Indianapolis.- Joe. Read his full statement: https://t.co/RbL1Mt2xLs"]["This is another reminder that efforts to repeal the health care law would end HIP 2.0. -Joe https://t.co/RqMyi5PDf9"]["#ICYMI: Joe continues fighting to protect Medicaid &amp; HIP 2.0. https://t.co/l59cImFo2R"]["READ: Joe’s statement regarding announcement banning transgender servicemembers. https://t.co/eNuYaOhyuN"]["WATCH: Joe is live on the Senate floor discussing his motion to protect Medicaid &amp; HIP 2.0 for Hoosiers. https://t.co/XvTH0WjClH"]["Joe's speaking soon on Senate floor to discuss his latest effort to protect Medicaid, including HIP 2.0. https://t.co/0rujnf4jCE"]["#ICYMI: As Senate debates health care, Joe will lead a motion to protect Medicaid, including HIP 2.0 and Medicaid expansion nationwide. https://t.co/7ohuBAZvRA"]["Joe vows to continue fighting for affordable health care for Hoosiers, after voting against moving forward w/ the Senate health care bill. https://t.co/cSQhzW7DNi"]["Joe emphasized the importance of crop insurance &amp; conservation to Indiana's farmers in the upcoming #FarmBill18. https://t.co/db1POnykQZ"]["Joe and @SenToddYoung are working together to help fill state-level leadership positions with @USDA. https://t.co/1HUGsyg4OS"]["If the Senate moves forward w/ health care repeal, Joe will offer an amendment that would protect Medicaid, including HIP 2.0. https://t.co/4V3ZxBNQsY"]["Joe’s #JustAskJoe highlights Peter Gillis of Granger who hit his head in Mexico. Joe’s staff worked w/ @StateDept to get him back to IN. https://t.co/4sx6yy7tCH"]["Praying for IMPD Deputy Chief Jim Waters and sending my thoughts to his family and  fellow @IMPDnews officers. -Joe"]["GoodNews: @KorellisRoofing was awarded the National '17 Silver Master Contractor &amp; Inner Circle of Quality Award. https://t.co/fx0PoPGDPa"]["Joe helped intro G.I. reform bill that would assist student vets, including those harmed by ITT Tech closure. https://t.co/rc1APnlq3S"]["GoodNews: IN's @NAVSEACrane was recognized by @DeptofDefense for their national leadership in value engineering. https://t.co/L7Evo2JaXG"]["Joe helped introduce the bipartisan Wounded Officers Recovery Act that would assist the injured officers. https://t.co/8yMbFydjku"]["#ICYMI: Joe’s staff helped record first-hand experiences of Lafayette veterans to preserve and honor their military service. https://t.co/u8QjN7rxEV"]["Joe’s staff hosted a #VeteransHistoryProject in Lafayette to record first-hand experiences of Hoosiers who served in the military. https://t.co/ajqsOQnaY6"]["Congrats to IN Ag Director Ted McKinney of Tipton, nominated for Under Sec. @USDA for trade &amp; foreign affairs. - Joe https://t.co/EMPgPd2x1B"]["I urge Senate leaders to bring the End Outsourcing Act to the floor so we can make policy changes to protect American #jobs. - Joe https://t.co/AqkBBGpJIS"]["In order to meaningfully address the problem of outsourcing, we’re going to need to work together -Joe https://t.co/3GtZkV8IRK"]["Joe met with the President and Treasury Secretary @stevenmnuchin1 to discuss his End Outsourcing Act. https://t.co/3N2Whpj982"]["During @SenateBanking hearing in Feb. '17 Joe asked Fed Chair Yellen how generations of Hoosier workers will deal w/ effects of outsourcing. https://t.co/rQkghYby4l"]["The #EndOutsourcingAct is based on the following three key principles: https://t.co/2FBX4PP0Ol"]["That’s why in January Joe introduced the End Outsourcing Act to protect American jobs. https://t.co/I20U6e8EZi"]["Americans work hard to help their companies succeed, and in return they should earn a decent living. https://t.co/D1pnfueOMd"]["In Dec.'16, Joe led group of Sens. urging congressional leaders to take action to reward companies investing in U.S. https://t.co/0zgqXJTUbs https://t.co/iEen48lhf5"]["In May of 2016, Joe released a white paper and proposed a policy framework to protect American jobs. https://t.co/n3i7xTJwnz"]["Soon thereafter, Joe attended a union meeting and told Carrier workers he would continue fighting for them. https://t.co/QuRtTZ3n5S"]["The day after Carrier announced it would offshore jobs, Joe questioned Federal Reserve Chair Yellen. https://t.co/54PXbvlXXw"]["It’s not just Carrier: thousands of Hoosiers across Indiana are set to lose their jobs due to outsourcing. https://t.co/EhdZuIZkNs"]["Today, more than 300 Carrier workers in Indy lose their jobs. https://t.co/WoHT4ajKxJ"]["Praying for my dear friend, SASC Chairman &amp; American hero @SenJohnMcCain. Sad to learn he's been diagnosed with cancer. -Joe"]["READ: Joe’s statement on non-partisan @USCBO analysis of Senate legislation that would repeal the existing #healthcare law: https://t.co/ZY35wMgTlr"]["Joe hosted coffee for IN visitors including @bethany_bruins, @CHIPIndy, and other Hoosiers. https://t.co/ph40U2EM0O"]["Proud to work w/ then-Gov. Pence to establish HIP 2.0 thru ACA. When we work together, we improve health care.–Joe https://t.co/Y4abnkQun2"]["Joe met with @INagribiz about the importance of rural broadband, infrastructure investments, and the farm bill. https://t.co/Ibb30uYPZb"]["Joe’s staff will host a Veterans History Project this Thursday in Lafayette to preserve the first-hand experiences of those who served. https://t.co/lPSDsBpR5s"]["READ: Joe continues to push for a bipartisan effort to strengthen our health care system. https://t.co/UpMz6vdpSN"]["Great game against @SenToddYoung and his staff. Fun to carry on the tradition of the Hoosier rivalry game. -Joe https://t.co/IH8e9OLtsN"]["#ICYMI: Joe worked w/ IN school superintendents to highlight how the #healthcare bill would harm students. https://t.co/mvQvpJzCZm"]["#GoodNews @GM Ft. Wayne Assembly received @JDPower award for highest-ranked auto manufacturing quality in Americas. https://t.co/Glx6CcOspE"]["The updated version of the Senate #healthcare bill doesn’t look much different from the previous version. It still would harm Hoosiers. https://t.co/OavMNFS6k5"]["Joe &amp; IN school superintendents outlined how #Medicaid cuts could force public schools to make more tough choices. https://t.co/nxPLolbdMc https://t.co/l4WO9IPogq"]["Wishing my friend @SenJohnMcCain a speedy recovery. -Joe"]["#GoodNews: More veteran mobile care centers will provide services to vets living near Indy. https://t.co/VkecRdHycH"]["The Senate #healthcare bill would cut funding for #Medicaid that helps combat the #opioid epidemic. The @APAPsychiatric says: https://t.co/93qBlpnI0C"]["#ICYMI: Senate #healthcare bill would harm families like Holly’s from Indy who have #Medicaid that allows access to care for her daughter. https://t.co/slubrN5iuA"]["Earlier this week Joe met w/ Hoosier students in the @BRInstitute’s Constitutional Academy and talked about his work as a U.S. Senator. https://t.co/5pHoFVgvq6"]["Joe’s staff will host a #VeteransHistoryProject in Lafayette next Thurs. 7/20. More details here: https://t.co/capY96pLP1"]["Proposed cuts to #Medicaid under the Senate #healthcare bill would hurt those who need help the most. @NHCouncil says: https://t.co/NEOaOPECiC"]["Joe, @SenToddYoung &amp; @RepVisclosky requested continued assistance for East Chicago residents from @HHSGov &amp; @CDCGov. https://t.co/OAMvNSJJ7R"]["Joe attended and delivered remarks at @IndianaBlackExpoInc luncheon. #SC47 #IBE https://t.co/LyVamXQLSo"]["#ICYMI: Joe asked Fed Chair Yellen during @SenateBanking hearing about impact of #opioid epidemic on economy &amp; jobs. https://t.co/v7axWISkai"]["Joe’s staff attended @NAVSEACrane Change of Command. Congrats to Commanding Officer Elder on retirement after 28 years of service in @USNavy https://t.co/85Awlaq1SI"]["WATCH: Joe asked Fed Chair Janet Yellen at @SenateBanking hearing about impact of  #opioid epidemic on economy and job opportunities. https://t.co/fsLDaIQEGb"]["Joe’s staff attended @DeptVetAffairs Town Hall in Terre Haute to hear from vets on health care concerns. https://t.co/JwX1eq5kNM"]["Joe met with @nwsctigersuper Ryan Snoddy of @NWSCkokomo this week to talk about support for public education in the Hoosier state. https://t.co/5L5GYGAewp"]["READ: Joe’s statement denouncing the recent terrorist attack on Hindu pilgrims in Kashmir: https://t.co/zIaPqE5afe"]["Joe hosted coffee with Hoosiers visiting @uscapitol. https://t.co/t0YSVuyKIG"]["CORRECTED: Joe released a statement about the death of a Hoosier @USNavy Corpsman who was on the KC-130 that crashed in MS: https://t.co/Fx3UC5szvH"]["Joe &amp; IN school superintendents highlight how Senate #healthcare bill cuts to #Medicaid would harm IN public schools, students. https://t.co/WVzJME7Woe"]["The Senate #healthcare bill would make it harder for ppl battling addiction to get treatment. Don’t take my word for it.@CASAaddiction says: https://t.co/EbI6rva8or"]["Joe’s staff spoke with @UAW retirees in Auburn about Joe's work on #healthcare and the opioid crisis. https://t.co/NT3770etvh"]["READ: Joe’s statement on @Alcoa restarting smelting operations at its Warrick Operations aluminum smelter near Evansville. https://t.co/mNyCTLLpWE"]["I’m the hired help @MachinistsUnion. I will continue to fight for good-paying Hoosier and American #jobs. –Joe #NDAA #1u https://t.co/esOIex5nj2"]["Joe met with Hoosier representatives from NADCP to talk about drug treatment courts &amp; veterans treatment courts. https://t.co/ovI8ItXXIc"]["The Senate #healthcare bill would harm families and those who need coverage the most. @AmHeartAdvocacy agrees: https://t.co/BodOCqMTgb"]["Great seeing my friend @JoeBiden. Participated in bipartisan discussion on imptnce of research &amp; finding cures to diseases like cancer. -Joe https://t.co/pNhe8SXp9o"]["Joe met with @EMChargers @uscapitol this morning. Go Crimson Chargers! https://t.co/zlRbrodkdj"]["Saddened by @USMC crash in Mississippi, thinking of the Marines who lost their lives &amp; praying for the families.They’re American heroes.-Joe"]["Couldn't leave the Bartholomew Co. Fair without grabbing a ribeye sandwich, it's one of my fair favorites. -Joe https://t.co/bf6ZAUy2UJ"]["Joe’s staff attended @CHIPIndy’s panel on @MCCOYouth's initiative to better serve youth experiencing homelessness. #YouthCountIndy https://t.co/OrQsg2yCRv"]["Joe held a #FarmBill18 listening tour stop in Bartholomew Co. to hear from local @INfarmbureau @IASWCD @Indiana4H and @IndianaFFA members. https://t.co/orAJCztlgK"]["Joe visited @LifeSpringInc to hear from providers on the front lines of the opioid abuse epidemic. https://t.co/OnBUjmoidt"]["The Senate #healthcare bill would fail our children. Just ask @AmerAcadPed. https://t.co/lQVHt7LSVH"]["ICYMI Joe visited @Kuehnertdairy​ as part of his #FarmBill Listening Tour to get input from Hoosiers dairy farmers in upcoming farm bill. https://t.co/yt2SaKWJRf"]["#ICYMI Joe spoke at @OaklawnHealth about his bipartisan bill to incentivize providers to work in substance abuse treatment centers. https://t.co/vHHoXldo6v"]["Costs for older Hoosiers would rise significantly under the Senate #healthcare bill. Just ask @AARPadvocates. https://t.co/uT5nb5h4jx"]["Joe toured Foster Family Pork Farms in Rush County w/ owners Dallas and @MegFoster. https://t.co/T2rI4bnnUV"]["Joe held a #FarmBill listening session w/ pork farmers &amp; @IndianaPork at Foster Family Pork Farms. https://t.co/T8DHYPVBLw"]["We must work together to #FirstDoNoHarm. Don’t just take my word for it, @AmerMedicalAssn says it of the Senate health care bill. https://t.co/KCQfxo5TKg"]["Joe discussed legislation he introduced to help address substance use disorder provider shortages for facilities like @lifespringinc. https://t.co/Nud3GydwhY"]["Joe toured the addiction treatment facility at @lifespringinc in Jeffersonvillle &amp; discussed efforts to treat #opioid addiction. https://t.co/jiZcHbdtPm"]["Read Joe’s statement about the removal of Opana, a prescription opioid pain medication, from the market. https://t.co/zF8ebn4rYA"]["#ICYMI Joe spoke on the Senate floor on how the #healthcare bill would harm Hoosier families, friends, and neighbors. https://t.co/15jwaqoKeU"]["Joe learned how to clean &amp; operate a robotic milker during a #DonnellyDay at @Kuehnertdairy. https://t.co/17eDZv6wlJ"]["Joe talked with 4th generation dairy farmer Alan Kuehnert before meeting w/ other dairy farmers. @Kuehnertdairy. https://t.co/NQM7hYoEcs"][".@IHAConnect says the future of HIP 2.0 is at risk with the Senate #healthcare bill. https://t.co/Pc8S8f7M9k"]["Joe talked w/ @OaklawnHealth's addiction services team about their efforts to combat the opioid abuse epidemic in St.Joe &amp; Elkhart counties. https://t.co/iD1NDnVnTF"]["I had a great time greeting fans tonight at the @SBCubs game and throwing out the first pitch. –Joe #SBCubs https://t.co/H1uvGZUDKO"]["Joe threw out the first pitch at the @sbcubs game this evening at Four Winds Field. #playball #SBCubs https://t.co/jyJjof7ZRu"]["WATCH: Holly from Indianapolis talks about what’s at stake for her family in the health care debate. https://t.co/byBHX2mrmC"]["Wishing everyone a happy and safe 4th of July! –Joe https://t.co/a9NnGe977o"]["WATCH: Beth &amp; Brad discuss how the proposed Senate #healthcare bill would harm their family &amp; their son Kyle. https://t.co/azl6GsJN8A"]["#ICYMI: Joe visited @HCIonline to learn more about how the facility is working to help stem the tide of the opioid epidemic. https://t.co/i1jF4HOCoz"]["WATCH: Abby talks about how the Senate #healthcare bill could impact her family and son Jude, who has Apert syndrome. https://t.co/3MM8LA0bV5"]["Joe &amp; Sen. @lisamurkowski introduced a bipartisan bill to incentivize providers to treat people w/ drug addiction in underserved communities https://t.co/yxNz1vYfE3"]["#ICYMI: Joe shared the stories of Hoosiers who wrote to him out of concern about the Senate #healthcare bill. https://t.co/4Xso94ArKI"]["@HCIonline While visiting @HCIonline Joe also discussed his efforts to combat opioid abuse and his new legislation to address provider shortages. https://t.co/86Q533GlSr"]["Joe visited @HCIonline in Terre Haute &amp; saw first-hand the work being done to treat substance use disorders, including opioid abuse. https://t.co/Wg1ggG4mrf"]["#ICYMI: Joe spoke on the Senate floor about how this #healthcare debate is first and foremost about people &amp; families. https://t.co/wDhn2Jj2kK"]["Special thanks to all of the Hoosier moms &amp; dads who came to our Indy office to voice concerns about the Senate #healthcare bill. https://t.co/KUeGs5tAZT"]["Joe talked w/ central IN families about how proposed drastic cuts in Senate health care bill would harm their kids. https://t.co/ONvWYSkwby"]["Thanks to the vets &amp; volunteers who participated in our VHP in @CityofElkhartIN &amp; thanks to @ElkhartBlazers @UAAFROTC for your help. https://t.co/VqO27wN25V"]["Thanks for stopping by to talk about the importance of #mentalhealth. #NAMICon17 https://t.co/gduDnBvgoe"]["Joe introduced bipartisan bill with @lisamurkowski to help address workforce shortage to confront opioid epidemic. https://t.co/JDgwGHZSjU https://t.co/BRLSqIsu74"]["Joe spoke on Senate floor about ensuring health care is affordable &amp; accessible so every Hoosier can live up to their God-given potential. https://t.co/gJK8Xfo8tP"]["Joe met w/ @IndianaFFA students @uscapitol &amp; discussed his Farm Bill listening tour to get input from Hoosier farmers. https://t.co/D6pv6wwcqm"]["Thanks for having me @AARPIndiana &amp; thanks to Hoosiers who joined. I'll continue work to make #healthcare more affordable &amp; accessible. –Joe https://t.co/2idSOJZdWs"]["W/ Joe’s help, construction resumed on U.S. 20 in New Carlisle. The construction negatively impacted downtown businesses and public safety. https://t.co/tVuwxZTFjh"]["On @AARPIndiana teletownhall Joe spoke abt working together to make #healthcare more accessible for Hoosiers, including ppl in rural areas. https://t.co/7ExhMExxe4"]["WATCH: Joe is live on the Senate floor highlighting Hoosiers who would be harmed by Senate health care bill. https://t.co/bpSkB5bUWV"]["Joe is headed to the floor to highlight stories from Hoosiers on the Senate health care bill. Watch his speech live: https://t.co/0rujnf4jCE"]["Joe asked IN Governor how the Senate health care bill would impact Hoosiers, including those with HIP 2.0. https://t.co/QAacJmHDiT"]["READ: Joe’s statement after Senate GOP announced it would delay a vote on their health care proposal. https://t.co/L4NXR2Be9m"]["#ICYMI: Joe supports the Voting Rights Advancement Act, which would restore voter protections undermined by the Shelby County decision. https://t.co/nU11Zep7Qi"]["REMINDER: Joe’s staff will host a Veterans History Project 6/29 in Elkhart. https://t.co/UMNXSjHItP https://t.co/q81dcI1qmx"]["Read Joe’s statement after the non-partisan @USCBO released its analysis of the Senate health care bill. https://t.co/Mdw07zaCHz"]["ICYMI: Joe believes if we want to improve health care, we must work together, including those who provide health care every day. https://t.co/jmjHgQ33ij"]["#GoodNews: Students at New Prairie HS are taking action to bring awareness to undetected heart conditions. https://t.co/xaVoSZHuYf"]["@POTUS signed into law the bipartisan VA Accountability and Whistleblower Protection Act that Joe supported. https://t.co/npoGOQo0jW"]["1st step to improve health care is for Admin to stop undermining the system. Joe believes we should work together to make HC more affordable https://t.co/2whyS1e8gc"]["Joe &amp; @USTreasury Sec. @stevenmnuchin1 had a constructive conversation about protecting Hoosier jobs, including Joe’s End Outsourcing Act. https://t.co/kObqxMudbQ"]["READ: Joe’s statement after Senate Republicans released their health care plan. https://t.co/VY3A9jEMMc"]["Congrats to the 2017 Hoosier Jefferson Award Winners for your dedication to public service across Indiana. -Joe https://t.co/zYbo8R0epp"]["Joe believes we should do no harm and work in bipartisan way to ensure Hoosiers have access to quality, affordable #healthcare. https://t.co/seqBCWoDpY"]["Proposed cuts to #Medicaid could impact funding for 24,435 seniors in nursing facilities across the state. https://t.co/dxonOtR2KX"]["If you’re a Hoosier senior or person w/ a disability using #Medicaid, proposed cuts would put your #healthcare in jeopardy: https://t.co/X0AkoIFboP"]["If you are the parent of a Hoosier child who has coverage through #Medicaid, proposed cuts would put your child’s #healthcare in jeopardy: https://t.co/DI1qav1ufv"]["(2/2): State of IN would be left with tough choices to cover the cost. https://t.co/ICamMfEAma"]["READ: Joe’s statement about @AnthemInc &amp; @MDwiseinc leaving Indiana’s health care marketplace. https://t.co/KhWOTIdKhT"]["Joe hosted coffee with the @nature_Indiana, Indiana Cast Metals Association, and other Hoosiers visiting @uscapitol. https://t.co/4u2LUUWJaF"]["Joe met w/ @BallState President Mearns to congratulate him on his new role &amp; discuss future plans for Ball State. https://t.co/yk8XdKKWn8"]["READ: Joe’s letter to @DeptVetAffairs @SecShulkin opposing cuts to Individual Unemployability program, which assists disabled vets. https://t.co/L4n2kIMiQk"]["Joe wore a Delphi jersey to the Congressional Baseball Game to honor Libby and Abby as well as a @LSU hat to support @SteveScalise. https://t.co/Vzw66dGCrW"]["WATCH LIVE: Joe speaks on the floor to highlight the Administration’s efforts to undermine health insurance markets. https://t.co/bpSkB4Ujyl"]["Joe’s staff attended the @CraneArmyAmmo Change of Command ceremony today. https://t.co/IvFy2AMWmu"]["(2/2) The event will take place at the Eastlake Terrace in Elkhart, IN from 1:30 PM –3:30 PM EDT. https://t.co/evVIqTa34J"]["(1/2) Joe’s staff will host a Veterans History Project event on Thursday, June 29. https://t.co/UMNXSjHItP"]["Saddened by the loss of the 7 sailors aboard the #USSFitzgerald. My thoughts are w/ their families &amp; the entire USS Fitzgerald crew. -Joe"]["Happy #FathersDay to dads celebrating here in Indiana and across the country. –Joe https://t.co/Y2zF7JgnUI"]["Joe's staff attended Honoring Women Veterans Conference at @UEvansville to talk to vets about #VeteransHistoryProject &amp; casework. https://t.co/dTHUHOeJvL"]["#GoodNews: Conexus connects Hoosier businesses and manufacturers with veterans entering into the workforce. https://t.co/3pBZ2bX9pQ"]["#GoodNews:The non-profit @WSP_Vets collaborates with @NotreDame to prepare veterans for success in academic courses. https://t.co/zmhoWEXYxE"]["#ICYMI: Joe visited the @VAIndianapolis Medical Center to hear directly from veterans about the care they are receiving. https://t.co/siLvEvnpEE"]["Great to play in #congressionalbaseballgame. Always fun to play baseball w/ my friends. Tonight was meaningful for many reasons. -Joe https://t.co/i7BJxGM93I"]["During tonight's @thehillbaseball game Joe is wearing a Delphi softball jersey in honor of Abby and Libby. #CBG17 https://t.co/YsXQ6I2kqZ"]["I look forward to playing in tonight’s @thehillbaseball game w/ my Republican &amp; Democratic colleagues. –Joe #CBG17 https://t.co/neqpDkmUzJ"]["READ: Joe’s statement on why he supports the bipartisan Iran/Russia sanctions bill that passed the Senate: https://t.co/8kqEmFKRAY https://t.co/vTitxrkM8G"]["Joe met with @AirNatlGuard Lt. Gen. Rice and discussed ensuring a strong future for the @122FighterWing. https://t.co/8Zd3HUYHm6"]["Joe spoke at the @amfAR Summit about his commitment to help combat the opioid crisis, HIV/AIDS, and Hepatitis C. https://t.co/vQ5Z3E2TVy"]["On #ArmyDay, we honor and thank those who have served our country in the @USArmy. -Joe https://t.co/bN71JnjUPy"]["Joe and @SenToddYoung met with @NHDIndiana participants to talk about our state’s rich history. #NHDI17 https://t.co/8ukZIooGaL"]["Today is #NationalFlagDay, a day to celebrate and honor the freedoms of the United States. https://t.co/o3CqyMcm5K"]["(2/2) I was practicing at the time with the Democratic team in DC and am okay. -Joe"]["(1/2) I am shocked &amp; praying for the safety &amp; recovery of my friend Steve Scalise &amp; all the others shot, including the officers. -Joe"]["Joe talked to a big group of @IndianaEC Youth Tour students about education &amp; agriculture issues. https://t.co/UN6Df4IOIB"]["Joe and @SenToddYoung met and thanked interns who are working in Indiana offices @uscapitol. https://t.co/gaaT5TDvUD"]["Joe met w/ Rushville Mayor Pavey &amp; Rush County officials to talk about workforce development in the community. https://t.co/HvKu4gp01g"]["Great to meet w/ @Colts Owner Carlie Irsay-Gordon. #GoHorse. –Joe https://t.co/BD3G2QEVUV"]["#ICYMI: Last week Joe called on @SBAgov to provide Salem, IN w/ disaster asst. https://t.co/mjxuZ79GcZ https://t.co/4fDPHpB9CD"]["W/ Joe's support, the Jefferson Township FD was awarded a grant to purchase needed equip. to protect firefighters. https://t.co/9edhAn3ODb https://t.co/4Bt5CECooN"]["Joe’s staff attended a @jfederations meeting in @CityofFortWayne to hear an update on the organization. https://t.co/V0lTqRtUVd"]["Joe visited @VAIndianapolis to hear directly from veterans and discuss the center’s mental health services. https://t.co/8boVPQFa1J"]["Joe attended the Christ Our Shepherd Church veterans program to honor the Hoosier men and women who served our country. https://t.co/oXkAhbW7o3"]["#ICYMI: Joe is pleased by FDA’s request to take the addictive #opioid Opana off the market to help combat the opioid epidemic. https://t.co/IpeSfLR61B"]["WATCH: Joe sat down with Hoosier Rylin Rogers to discuss how the #ACA positively impacted her family. https://t.co/4PTrdXvcyf https://t.co/eX9kZAiRjj"]["#ICYMI: Joe attended @RVIANow’s #RVsMoveAmerica dinner to recognize Hoosier RV manufacturers who fuel jobs across IN. https://t.co/R7gs364BPK"]["WATCH: Joe pressed @usairforce @SecAFOfficial for commitment to continue @122fighterwing air combat mission: https://t.co/cRms1ZQ1F1"]["Joe welcomed FDA’s request to remove prescription opioid medication Opana from the market. https://t.co/XO6cvbRqR5 https://t.co/6TWybQoNKl"]["WATCH: Joe introduced Dallas Bergl of @inovafcu in Elkhart during @SenateBanking re: role of financial institutions in communities. https://t.co/JBAEH9UL8S"]["Today, Joe met with students from Rushville Consolidated High School’s summer government class @uscapitol. https://t.co/LERTblsaHH"]["READ: Joe’s statement on #JamesComey’s testimony before Senate Intel Committee. https://t.co/s2YSxLRxdO"]["Joe helped pass VA accountability &amp; Whistleblower Protection Act to hold employee wrongdoers at VA accountable for misconduct. https://t.co/gzHCPzW7Iq"]["Joe met w/ Hoosier @RVIANow members to discuss economic benefit RV industry has in Indiana. #RVsMoveAmerica https://t.co/x43UF8BiQD"]["Joe met with @beefUSA’s Young Cattlemen’s Hoosier Conference participants to discuss important issues for Indiana’s cattle raisers. https://t.co/69v3s7Xghe"]["Joe met with students from Rensselaer Central Middle School @uscapitol. https://t.co/t2VmHWPuDY"]["W/ Joe's support, the Vincennes FD was awarded grant to purchase needed radio equipment. https://t.co/X8QZdKZbp7"]["Joe received commitment from @SecAFOfficial Wilson that his Sexton Military Suicide Prevention Act is on track to be implemented by Oct. '17 https://t.co/GvWZdEyBeU"]["Joe supports the American Law Enforcement Heroes Act, which encourages law enforcement to hire &amp; train veterans as police officers. https://t.co/71o2bbZzHA"]["Joe received a commitment from Dep. Sec. of @HUDgov nom. to dedicate necessary resources for East Chicago residents affected by lead crisis. https://t.co/ngUI2PgnwR"]["Joe congratulated 5 Hoosier students who received prestigious @BorenAwards to study abroad in areas critical to US national security. https://t.co/ujae1ROvSJ"]["Today is #NationalHigherEducationDay. Joe’s #FoundationForFamilies agenda includes higher education accessibility as a priority. https://t.co/0ATYqcpcPh"]["#GoodNews: @Adams_Eagles is innovating the classroom for students interested in STEM and military careers. https://t.co/YbxOxaqg0f"]["#ICYMI: Joe is fighting for Hoosier jobs through anti-outsourcing efforts. https://t.co/2iSlDwygro"]["Joe stopped in the Grant County Vets’ Service Office to discuss treatment courts, vets issues w/ VSO Mike Houser. https://t.co/MoPIZIsFPj"]["#GoodNews @IFD_NEWS awarded Secretary of Defense Freedom Support Award for support of Natl Guard &amp; Reserve employees https://t.co/kGyT45NvO9"]["#ICYMI: Joe hosted a roundtable w/ @RepJimBanks to discuss ensuring strongest future for Fort Wayne @122fighterwing. https://t.co/0zxnLREIyC"]["Joe believes we must all work together to address #heroin &amp; #opioid epidemics gripping our families &amp; communities. https://t.co/F9mGYbyjO3 https://t.co/iLyzpXC5Pp"]["WATCH: Joe released his #FoundationforFamilies agenda to support caregivers w/ paid family leave. https://t.co/Hl6CfgvpKr"]["Joe supports federal funding for research to #EndAlzheimers. https://t.co/w6GdjWH3oA"]["https://t.co/bkd3EVdx3u"]["Joe &amp; @RepVisclosky recently met with IN #steel industry leaders in NWI to discuss current state of steel industry. https://t.co/N7xO6O5M7n"]["#GoodNews: IN again led the nation in #steel production last year,  producing 27% of American-made steel. https://t.co/eEKoG5jZcv"]["Congrats and good luck to the two Hoosiers competing in the finals of @ScrippsBee. https://t.co/ylno5HuuvU #spellingbee"]["#ICYMI: Joe spoke on Senate floor in support of #mentalhealth services for officers like Lebanon’s Taylor Nielsen. https://t.co/dQ6dDS4yZ5"]["Thanks for the awesome cut, William. Wasn’t able to make it home to Eddie’s in Mishawaka. –Joe https://t.co/Oacn4YOEX9"]["Joe visited @AlzIndiana &amp; spoke w/ Hoosier caregivers about need for paid family &amp; medical leave. https://t.co/aI4NEg9Kcg"]["Great to catch up w/ @INGuardsman MG Carr &amp; @122fighterwing Col. Renwick. We'll continue work supporting 122nd in FW. -Joe https://t.co/4syej6cyRp"]["Following discussion on future of @122fighterwing, Joe outlined critical role 122nd plays in FTW and safety &amp; security of our country. https://t.co/9KSZLctLZr"]["Joe hosted a discussion w/ @RepJimBanks, @INGuardsman MG Carr, Col. Renwick, @mayortomhenry &amp; others re: future of @122fighterwing. https://t.co/nYf5QkhLv4"]["Joe made a quick stop for an iced coffee at Fortezza Coffee in Fort Wayne. https://t.co/YdLR1hJT24"]["Joe surveyed the flood damage in Salem this evening with local officials. https://t.co/pagToknyUN"]["Joe thanked our vets &amp; Gold Star families for their service &amp; paid tribute to servicemembers who gave their lives to protect our freedoms. https://t.co/BuxwacMB4b"]["Joe delivered remarks at the 149th #MemorialDay ceremony at Crown Hill Cemetery. https://t.co/SzccKfCxkk"]["On Memorial Day we pause to honor and remember the brave men and women in uniform who lost their lives in service of our great nation. - Joe https://t.co/BVKyZ4ct9Y"]["Congrats to @TakumaSatoRacer for winning the #Indy500 @IndyCar at the @IMS. -Joe"]["Happy race day at @IMS! #Indy500 https://t.co/7TYWyiaOCL"]["#ICYMI: Joe and @SenatorToddYoung Law Enforcement Mental Health Act passed the Senate. https://t.co/YBhEfDdF8O"]["Joe, @RepVisclosky, @aisisteel &amp; steel industry leaders talked about keeping American steel industry competitive. https://t.co/55idSa5G96"]["Happy 100th Birthday to an incredible leader &amp; former @NotreDame President, the late Fr Hesburgh. His legacy will live on w/ us forever -Joe https://t.co/Erok4cVxKb"]["READ: Joe’s statement after the non-partisan @USCBO released analysis of the American Health Care Act that recently passed the House. https://t.co/1rDqHig2Lt"]["On @NationalMallNPS, Joe thanked Hoosier veterans traveling w/ the Northeast Indiana Honor Flight for their service to our country. https://t.co/DIYjlGjrTX"]["Joe met with @SignatureSchool students from Evansville visiting Washington, D.C. https://t.co/In3303uZC1"]["Joe met with the Madison County Chamber of Commerce to discuss the opioid epidemic, workforce development, &amp; improving our infrastructure. https://t.co/OVhEiTVXoA"]["READ: Joe’s statement on the President’s budget proposal. https://t.co/96nIySkx6E"]["We stand with the victims of the Manchester terrorist attack, their friends, and families. We are one with the people of #Manchester. -Joe"]["Joe spoke at the @INGuardsman Enlistment Ceremony this weekend to congratulate the enlistees &amp; their families. https://t.co/YGx0baoWf5"]["#GoodNews: @City_Lafayette firefighters are leading the way in helping their peers receive mental health assistance. https://t.co/Gqt85m24in"]["We are monitoring the flooding in Salem and across Washington County and stand ready to assist residents."]["In honor of National Red Cross Founder’s Day,  thank you to the @INRedCross for all you do to serve those in need. https://t.co/drTXder0bb"]["Joe &amp; @senrobportman’s bipartisan resolution makes 5/18 DoD Laboratory Day and highlights defense labs like IN’s @NAVSEACrane passed Senate. https://t.co/dzugJuyvqp"]["Joe asked @ustreasury Sec. @stevenmnuchin1 how the WH tax reform proposal will help prevent outsourcing of U.S. jobs. https://t.co/DmmRrYIaVn"]["As POTUS considers @FBI nominees think it's important we have somebody who is independent &amp; w/ significant law enforcement experience. -Joe"]["Joe's staff attended the @NAVSEACrane solar facility ribbon cutting, a project to continue their sustainable energy practices. https://t.co/PNN2eKf8RZ"]["#ICYMI: Joe and @SenatorToddYoung Law Enforcement Mental Health and Wellness Act passed the Senate. https://t.co/4LtUVK6nND"]["Thank you for your support @RickFOP86. https://t.co/5L0QEM5CpE"]["See Joe’s statement on former-FBI director Robert Mueller being named #SpecialCounsel to oversee the Russia investigation: https://t.co/gMKN1BHgZi"]["It was great seeing the Eastern Greene Schools 8th graders during their visit to D.C. Always be sure to do your #thunderbirdbest. —Joe https://t.co/1x4XHs77ch"]["WATCH LIVE: Joe on @SenateFloor discussing Law Enforcement #MentalHealth legislation. #PoliceWeek #EraseTheStigma https://t.co/rp4BpiROVq"]["Joe is heading to @SenateFloor to speak about his Law Enforcement Mental Health legislation. #PoliceWeek #EraseTheStigma"]["At today’s constituent coffee, Joe met @IvyTechCC students, members of @NUCA_National, and other Hoosiers visiting D.C. https://t.co/DOpSVnm6qb"]["As Joe stated earlier, the sharing of classified intel has real world consequences. \nhttps://t.co/0FJASq73vO https://t.co/CDBoPDaC3S"]["It was great to be w/ law enforcement officers and the families of fallen officers at @GLFOP and @indianacops #PoliceWeek cook out. –Joe https://t.co/faCmFcTL7r"]["Jill and I wish our friend Sen.@maziehirono a speedy recovery. -Joe"]["Happy birthday to my friend and former colleague @SenDanCoats. –Joe"]["@SenToddYoung Joe is hopeful the House will quickly consider &amp; pass the Law Enforcement Mental Health and Wellness Act so it becomes law. #EraseTheStigma"]["Joe &amp; @SenToddYoung’s #mentalhealth legislation for law enforcement officers passed the Senate. #EraseTheStigma #PoliceWeek https://t.co/MrMxpkHN0f"]["See Joe’s statement regarding President Trump sharing classified intel with Russia: https://t.co/tsxcQMyJUB"]["Joe attended the 36th Annual National Peace Officers Memorial Service today w/ @INSTATEFOP Pres. Owensby. https://t.co/QhFMssvBtG"]["Joe’s staff attended the LaPorte County Law Enforcement Peace Officer’s Memorial Service to thank those who keep our communities safe. https://t.co/lp5A0mKmRD"]["#GoodNews: @IMPDNews police officer Sergeant Robert Pearsey received the TOP COPS award by NAPO. #PoliceWeek https://t.co/zGYfZTgjAX"]["#ICYMI: Joe visited w/ retired Hoosier miners to thank them for their advocacy &amp; discussed efforts to help pass a permanent health care fix. https://t.co/14hS11YtmO"]["Joe wants to support working moms w/ paid family &amp; medical leave &amp; #equalpay. #FoundationForFamilies Happy #MothersDay. https://t.co/RqnBgC0Jmu"]["Wishing all Hoosier moms a very happy #MothersDay. -Joe"]["#ICYMI: Bipartisan legislation Joe supports to protect young athletes from sexual abuse passed out of Senate Judiciary Committee. https://t.co/R4Rmo11Y8x"]["Joe wants students planning for college to become financially literate &amp; have access to low interest loans. #FoundationForFamilies https://t.co/dGOndofhX0"]["#ICYMI: Joe believes we need a special prosecutor to handle investigation into Russian meddling in 2016 US election. https://t.co/0DsIomE3pw"]["Joe thanked hundreds of retired miners in Oakland City for their advocacy &amp; discussed his work to help pass a permanent health care fix. https://t.co/LMNHl60ri3"]["Thank you to our military spouses for all that you sacrifice to help protect our country. – Joe #MilitarySpouseAppreciationDay https://t.co/5qVQoyr00b"]["Great to meet w/ @IMA1901 &amp; discuss working together to ensure Hoosier workers have necessary skills for good-paying manufacturing jobs -Joe https://t.co/Ig8xZF4RCL"]["Joe joined a bipartisan group of senators to introduce a bill that would protect pensions of retired Hoosier miners. https://t.co/ZvjjRsyGP9 https://t.co/7lhwos4cZs"]["Joe focuses on the need for access to a quality early childhood education in his #FoundationForFamilies agenda: https://t.co/SUQWJgPtcb. https://t.co/GUvHUmBEro"]["Joe spoke w/ #RVindustry Power Breakfast attendees about his continued efforts to help the RV industry prosper. https://t.co/24V41PnbyY"]["Joe’s #FoundationForFamilies agenda includes paid family &amp; medical leave so workers can bond w/ new child or care for an aging parent. https://t.co/jGx8KGlfRJ"]["This morning, Joe met with students from Holy Cross Lutheran School in Indy. https://t.co/WMOaiEaDBz"]["It was an honor to meet these Hoosier @PruSpirit Award winners and thank them for volunteering to strengthen our communities. –Joe https://t.co/hQJ0LCzftv"]["See Joe’s statement about the firing of FBI Director James Comey: https://t.co/KmHRJZuaIB"]["#GoodNews: Elkhart’s Nathan Hite recently became the most decorated Scout in @boyscouts history. https://t.co/R2MmuTrill"]["Today is #NationalTeacherAppreciationDay, a day to thank our teachers including two outstanding Hoosier teachers, Joe Ruhl &amp; Jitka Nelson. https://t.co/gdbb5B65Ju"]["WATCH: Joe announced his #FoundationforFamilies Agenda, aimed at improving the quality of life for Hoosier families. https://t.co/Qheyrzycon"]["Joe helped @EvansvilleFD get an Assistance to Firefighters Grant award from @fema. https://t.co/FzE9We2KhU https://t.co/odyQIMLAw0"]["Mr. President, let's fight together for Rexnord and others, and pass my End Outsourcing Act to keep good jobs in Indiana and US. https://t.co/zbPkfcWAzR"]["#ICYMI: Joe applauded @CrownHillCem &amp; VA reaching agreement that will build cemetery and preserve trees. https://t.co/jJn9KgAg8M"]["#ICYMI: Joe is the 2nd most bipartisan member in Congress according to the Lugar Center Bipartisan Index. https://t.co/SM5SBpl7Xs"]["Small businesses are the cornerstone of our communities across IN. When small business thrives, our communities thrive. #SmallBusinessWeek https://t.co/YJnuowYNMG"]["Joe is pleased Dr. Mark Green withdrew his nomination for Secretary of the Army. https://t.co/HBTuLc03pi https://t.co/mQxDBmnMrA"]["Joe called on #ONDCP to address #opioid &amp; #heroin epidemics &amp; expand access to evidence-based treatment in 2017 nat’l drug control strategy. https://t.co/TDbNuyJrT1"]["Joe supports the #PaycheckFairnessAct, which would empower women to hold employers accountable for pay discrimination. https://t.co/27Ce8n6QFy"]["Thank you to all of our firefighters who put their lives on the line every day to protect our communities. #InternationalFirefightersDay https://t.co/01LshAIKSy"]["Joe will continue fighting to protect 400K Hoosiers insured by HIP2.0 &amp; millions w/ pre-existing conditions who currently can access care. https://t.co/cwHPxsjiVD"]["Joe met with middle school students from Avon’s Kingsway Christian School @uscapitol during their visit to Washington, D.C. https://t.co/UGDCcy3bBU"]["Joe &amp; @senorrinhatch introduced legislation aimed at reducing suicide rates. #MentalHealthAwarenessMonth https://t.co/8Q1Ehu1O3N"]["Joe spoke on the Senate floor thanking @Sen_JoeManchin for his leadership fighting for coal miners’ health benefits. https://t.co/TQV3mMsp2h"]["WATCH: If you need a reminder of the high stakes for Indiana families as GOP pushes #AHCA, listen to Rylin Rodgers. https://t.co/PUBSrWPEX1"]["#ICYMI: There are reports of someone scamming Veterans Choice Program users. The correct VCP number is 866-606-8198. https://t.co/zkyzpP5J9X"]["#ICYMI: Joe voted against the nomination of Jay Clayton for SEC Chair. Read Joe’s op-ed with @SenWarren here: https://t.co/taEDJUi3gq https://t.co/5JqFBZ2f6i"]["Great to meet w/ @jdouglas4, President of @IMS. Looking forward to the 101st running of #Indy500 on 5/28. –Joe https://t.co/ju6xjoQmaD"]["Joe met with students from @MBHS_news today @uscapitol. https://t.co/vTdIhvgHtI"]["Joe praised funding for CARA, miners’ health care that were included in bipartisan budget agreement. https://t.co/Ir8Lxa9ZH7"]["Joe met with @IUBloomington President McRobbie &amp; frmr IN Rep. Lee Hamilton @IUSGIS to discuss working together on higher education funding. https://t.co/RzCHgSUTc3"]["Joe's staff attended the Road to Recovery Staging Dinner in Muncie, a group that brings together law enforcement &amp; individuals in recovery. https://t.co/YqymxGYuvp"]["#ICYMI: Joe helped pass legislation that will provide IN w/ $10.9 million to address #opioid #epidemic. https://t.co/LdqnyjAcQy"]["Law enforcement officials support Joe &amp; @SenToddYoung's Law Enforcement Mental Health &amp; Wellness Act #EraseTheStigma https://t.co/ZlwD3DwzSB https://t.co/qV0UF45Pm0"]["#GoodNews These innovative southern Indiana students are making fresh produce accessible to communities in need. https://t.co/5rJbyO82Mk https://t.co/iRnRW78Dyv"]["Joe helped christen the #USSIndiana w/ @USNavy. The ship will join the US Naval fleet later this year. https://t.co/RMu7LnoODg"]["Learn where to safely dispose of any unwanted &amp; unused Rx drugs here: https://t.co/Bw5x3qtXq3 #NationalPrescriptionDrugTakeBackDay https://t.co/IAIHycA5zD"]["Joe toured the USS Ford at Naval Station Norfolk while in town for the christening of the future USS Indiana. https://t.co/py20a8ijUe"]["WATCH: Joe talked bipartisan efforts w/@SenToddYoung,@SusanWBrooks &amp; @RepValDemings to increase #mentalhealth services for law enforcement. https://t.co/VjlSZGgnDg"]["On #WorkersMemorialDay we remember those who lost their lives while standing up for a safe work environment for all workers. https://t.co/Wk0RKjc5Rp"]["Joe &amp; @SenToddYoung want law enforcement officers to have more access to #mentalhealth services. #EraseTheStigma https://t.co/pkmFk6lhCj"]["Great to meet Jefferson High School biology teacher Joe Ruhl. Congrats on being inducted into the National Teachers Hall of Fame. –Joe https://t.co/u9xKv095Xc"]["Joe will not support the nomination of Alexander Acosta for Secretary of Labor. https://t.co/uCB6omjdPA https://t.co/39vJpWjw5s"]["Joe met w/ Hoosiers visiting D.C., including students from @BoilerUpENGR and Jitka Nelson, the 2017 Indiana teacher of the year. https://t.co/NaNHLsFgCZ"]["READ: Joe’s statement after North Korea briefing at the White House. https://t.co/HhAp98fkab https://t.co/t3JTUlC9I6"]["Joe thanked Hoosier veterans traveling w/ the Northeast Indiana Honor Flight for their service to our country at the World War II Memorial. https://t.co/Kj484RnE1q"]["Joe is the 2nd-most bipartisan member of Congress—in either the U.S. Senate or House--according to @TheLugarCenter https://t.co/WPJsyQDtZx https://t.co/ztsEx0dsWO"]["REMINDER: Joe’s staff is hosting Service Academy Information Nights for students in Valparaiso and South Bend this Thursday. https://t.co/6dWEKBkkdO"]["#GoodNews: A new solar park will power @CityofKokomo with clean energy. https://t.co/OroWvlQyen"]["Joe voted to confirm Sonny Perdue to be the next Secretary of Agriculture. https://t.co/SF6u2EVivQ"]["On #HolocaustRemembranceDay, we remember those murdered during the Holocaust and honor the survivors. #NeverAgain https://t.co/pVHa8vjhAq"]["REMINDER: Joe’s staff is hosting Service Academy Information Nights for students at our Fort Wayne and Indianapolis offices this Wednesday. https://t.co/BWxQvYeGg2"]["WATCH: Joe &amp; SenToddYoung discuss their Law Enforcement Mental Health and Wellness Act in Indy. #erasethestigma https://t.co/oJqmTupGCs https://t.co/xn3SVdegZ5"]["#GoodNews: Robotics team at Penn H.S. in Mishawaka going to FIRST Robotics Competition Championship in St. Louis. https://t.co/0DSloCIL8R"]["#ICYMI: During a #DonnellyDay at @TechshotInc, Joe helped assemble an MVP payload that will be used to conduct research at @Space_Station. https://t.co/bY8kxulAze"]["Happy Earth Day. #EarthDay2017 https://t.co/KJuP9PskxR"]["Joe recently introduced legislation to designate Indiana National Lakeshore as a National Park. #NationalParkWeek https://t.co/4SfD9wl0DS"]["REMINDER: On 4/25 Joe’s staff will host a U.S. Service Academy night in Jeffersonville and Evansville. https://t.co/18aPiqXKih https://t.co/80dD8fUJe8"]["ICYMI: Joe visited East Chicago Wednesday to continue working in bipartisan way to address the lead crisis. https://t.co/gqMs8LKp8j https://t.co/IXCBYsN7W8"]["#ICYMI: Joe welcomed Indiana’s $10.9M @HHSGov federal grant for opioid prevention, treatment &amp; recovery services. https://t.co/rJYseElmPC"]["Joe welcomed President Trump’s executive action regarding the American steel industry. https://t.co/4oEyIObjO1"]["Joe's staff presented a congratulatory letter to Michael, a veteran and graduate of Veterans Treatment Court in @realgrantcounty. https://t.co/DrcJ1pdfSY"]["Joe's staff collected stories from several Hoosier veterans during a #VeteransHistoryProject in Peru. https://t.co/4j559ssnCk"]["Joe announced Indiana will receive $10.9M @HHSGov federal grant for opioid prevention, treatment &amp; recovery services. https://t.co/kIbY0gCH9h"]["Joe’s staff attended the #StateofIndy address, which highlighted efforts to improve public safety, education &amp; invest in local communities. https://t.co/EuavQHfPl4"]["#GoodNews: @CITYOFCARMELIN has been recognized by @TandCmag as the best place to live in the country. https://t.co/cny5O0vdle"]["Joe used a torx screw gun to assemble a @TechshotLights BATLITE used in U.S. Army tents @TechshotInc for his latest #DonnellyDay. https://t.co/FJ2KTefLK3"]["#ICYMI: Joe’s staff will host a Veterans History Project event at Peru City Hall on Thursday from 2:00 – 4:00 p.m. https://t.co/QchpBBobj5"]["Joe’s staff attended a naturalization ceremony at @NotreDame to congratulate over 100 new citizens. https://t.co/LOvXGtMdUP"]["#ICYMI: Joe helped @ivytechCC receive an Economic Development Administration grant to help expand ag-focused workforce training. https://t.co/GExDxtkZpF"]["#GoodNews: Eight @NAVSEACrane employees received an award for saving $1.2 million in costs. https://t.co/3OJxCLCdSm"]["#ICYMI: Joe got hands-on with innovative tech developed at @PurdueAg Corn &amp; Soybean Innovation Center. #DonnellyDay https://t.co/9tw9yIH7bD https://t.co/gPoZSsD14m"]["Joe worked alongside precision machining students @PCCareerCenter for his latest #DonnellyDay. https://t.co/OlQRre5UAS"]["Joe visited @PurdueAg to learn more about their innovative efforts to develop better crop varieties during a #DonnellyDay. https://t.co/u59xS2xFQF"]["Yesterday, Joe visited @smwc to see recent renovations around campus and to talk with faculty and students. https://t.co/ATno58VaIo"]["#ICYMI: Joe visited the McCormick Farm in Knox County to hear from farmers &amp; conservation groups. https://t.co/3AFEv4xZU8"]["Joe met w/ Indiana Statehouse interns to thank them for their engagement &amp; service to our state &amp; talk about creating jobs for all Hoosiers. https://t.co/mCq1Vj4jE4"]["Joe’s staff will host a Veterans History Project event at Peru City Hall on Thursday, April 20th from 2:00 – 4:00 p.m. https://t.co/PdpAGDQkqW"]["Joe held a Farm Bill listening session at McCormick's farm in Vincennes to hear from farmers and land conservation group members. https://t.co/VpDqK6slvS"]["Joe spoke about important work @NAVSEACrane is doing, including advanced technology &amp; ensuring our nuclear deterrent is modernized. https://t.co/vKVtucHBLF"]["Joe got a first-hand look at the cover crops on McCormick Farm in Knox County. https://t.co/DleZVYYOn8"]["This afternoon, Joe stopped by the Daviess County Veterans’ Service Office. https://t.co/EdWyn1wvbH"]["Joe encourages all vets looking for a job to attend ‘Operation Hire a Hoosier Veteran’ on April 19th at the Indiana State Fairgrounds. https://t.co/Cb6hwIJicE"]["Joe stopped for lunch at the Magic Wand Restaurant in Whitley County this afternoon. https://t.co/46T6taW4tq"]["Joe celebrated the 30th anniversary of @SBCubs. https://t.co/EL2FqTgCJB"]["#ICYMI Joe &amp; @SenToddYoung introduced bipartisan bill to support mental health services for law enforcement officers https://t.co/VEReYJHeBF"]["On National Former Prisoner of War Recognition Day, we recognize all Americans who have put their lives on the line for our country. https://t.co/BN9q9mZvCm"]["#ICYMI EPA Admin Pruitt to visit East Chicago following invitation from Joe @SenToddYoung @RepVisclosky @GovHolcomb. https://t.co/yzjgjolxZP"]["#GoodNews @TCMIndy has been ranked as the best museum for families in the country. https://t.co/usnVqfjszO"]["Joe’s statement on the US missile strike in Syria. https://t.co/nuc2zU77LI"]["On Joe’s invitation, @HUDgov Sec. Carson said he intends to visit East Chicago to hear directly from families uprooted by lead contamination https://t.co/ZaCdlLlIZ1"]["At #SASC hearing Joe asked Commanders supporting US counterdrug operations to increase efforts against heroin trafficking from Mexico to US. https://t.co/jai10qbT0R"]["Joe &amp; @SenToddYoung introduced bipartisan legislation that would support #mentalhealth services for law enforcement. https://t.co/oFF4aG2hCF https://t.co/f8cwtP6m6R"]["Joe &amp; @SenToddYoung met with students from St. Charles Catholic School vising the @USCapitol in Washington, D.C. https://t.co/nn21yHMw1l"]["Joe is heading to the Senate Floor to speak in support of retired coal miners. https://t.co/ebaeYLZhB1"]["Joe helped Winchester cancer patient, Jerry Morrison, receive disability benefits in his latest #JustAskJoe. https://t.co/mJmKcFjD1a"]["Joe voted against Clayton in Banking, wants SEC Chair committed to policies keeping jobs in U.S. More here: https://t.co/URZIV9UPf4."]["Following an invite from Joe, @SenToddYoung, @RepVisclosky, &amp; @GovHolcomb, @EPAScottPruitt announced he will visit East Chicago. https://t.co/Nj1uBjv50a"]["Joe enjoyed meeting with @BGElkhartCounty during their visit to D.C. https://t.co/wfcXfC1JOB"]["Joe believes Hoosier women deserve equal pay. #GenderPayGap impacts ability to save for retirement and pay for basic expenses. #EqualPayDay https://t.co/JFbpCwgrb4"]["Joe’s staff attended a welcome home ceremony in Plainfield for Hoosier veterans who recently took an Indy Honor Flight trip to D.C. https://t.co/HQIS6ZqHHU"]["Joe delivered meals to Larry, a 63-year old veteran and @MOWIndianapolis client, during his latest #DonnellyDay. https://t.co/zAP2Z2PYAb"]["Joe delivers meals to Ada, 83, during #DonnellyDay with @MOWIndianapolis. https://t.co/iZN2miQ9Mc"]["Joe picks up meals at @EskenaziHealth to deliver to Hoosier seniors during @MOWIndianapolis #DonnellyDay. https://t.co/7dVloUpbxl"]["#GoodNews @southbendpolice are helping Hoosiers facing hunger. https://t.co/Zi3QY5Xk3p"]["Joe chats with folks at @Starbucks in Indy. https://t.co/WTM9NGulkZ"]["#ICYMI Joe joined @SenToomey to establish National Vietnam War Veterans Day to thank our Vietnam vets for their service &amp; sacrifice. https://t.co/hucLVSLbDq"]["Joe will support the nomination of Judge Neil Gorsuch to the Supreme Court. https://t.co/1XmDlOBc40 https://t.co/xOmuVlKaOX"]["#ICMYI: Joe welcomed the president’s orders to review our trade deficits and enforcement policies. https://t.co/18KDpvxBjh"]["#GoodNews: @IndianaUniv scientists are speeding the path to new treatment for #Zika. https://t.co/dWO9cRf9qR https://t.co/CET0JI9eyQ"]["Joe &amp; @JohnBoozman’s bill for the National Desert Storm War Memorial location signed into law by President. https://t.co/GHf1JPVm0T https://t.co/dlKO08uPhv"]["#GoodNews Indianapolis is leading the way as one of the best cities in the country for women in tech. https://t.co/qihtZO5tqB https://t.co/QNZhxrRKlZ"][".@NavalAcademy @WestPoint_USMA @AF_Academy @USCGAcademy Info on the Service Academy nights in Indy, Ft. Wayne, Evansville, Jeffersonville, South Bend, and Valpo: https://t.co/18aPiqG9qJ"]["Joe’s staff will host Service Academy nights for IN students interested in @NavalAcademy, @WestPoint_USMA, @AF_Academy, @USCGAcademy, #USMMA https://t.co/cswjiHmZ3j"]["Joe called on President Trump to veto the resolution that would undermine consumers’ online privacy. https://t.co/9BIkzUKafb https://t.co/DRnOVQamt3"]["It’s time we invest in hardworking Hoosiers like Brian, rather than companies that chase cheap wages overseas. -Joe https://t.co/8gms8NIttM https://t.co/lGiMyzT6cP"]["Great to meet w/ Indiana Primary Health Care Association, thanks for connecting IN health professionals w/ community health centers. –Joe https://t.co/P7Gn2PJvRX"]["Joe’s staff attended @GCEGC Local Elected Officials Dinner to discuss economic growth in the community. https://t.co/xROleHKnqk"]["At @SenateAging hearing, Joe introduced Dr. Callahan, @IUCAR_RI founder &amp; leader in effort to #ENDALZ. https://t.co/G1AYtBM5Ig"]