["There are great people—many of whom would make great Americans—in every country on the face of the earth. The criterion for immigration should be the character of the individual, not the circumstances, however dire, of their native land."]["I hope the President retracts the suggestion, attributed to him yesterday, that America should not want immigrants from countries which he was accused of describing disparagingly."]["Great news for Pennsylvanians working at over 160 @Walmart locations. Further proof that #TaxReformWorks https://t.co/tAHNxg9RJV"]["I join with my 63 bipartisan cosponsors of #SESTA, the Stop Enabling Sex Traffickers Act, in calling for Senate passage as soon as we can. Sex trafficking is a scourge on humanity and must be stopped. #HumanTraffickingAwarenessDay"]["On #HumanTraffickingAwarenessDay, Sen. Judiciary Committee passed the Amy, Vicky, &amp; Andy Child Pornography Victim Assistance Act. Our bill improves access to restitution for victims exploited by sick criminals who possess this filth. Justice = swift Senate passage of our bill. https://t.co/zqhQFYE6Hk"]["The opioid and heroin crisis has rightfully drawn bipartisan attention in Congress and all levels of government. Today’s opioid emergency declaration sends a clear message that more work remains to be done. My Statement: https://t.co/fwq4dk9CtM"]["Sad to hear about the passing of longtime PA resident, Brig. Gen. Anna Mae Hays. Serving in 3 separate wars, she was the 1st woman in the U.S. Armed Forces to achieve general officer rank. Her memory shall serve as an inspiration for generations to come. https://t.co/8gcpeK5uJT"]["To make this weekend’s @Eagles @AtlantaFalcons match up more interesting, @SenatorIsakson &amp; I made a little wager. When our birds are victorious, he’ll owe me some Georgia fried chicken. If his Falcons win (not happening), I'll owe him a famous Philly cheesesteak. #FlyEaglesFly https://t.co/e5jzpDLaEV"]["For too long, our Vietnam War veterans have been denied the recognition they deserve. I am glad that my staff was able to help honor these American heroes for their bravery and sacrifice. Watch @abc27News highlights: https://t.co/XEZ7Snc0zz"]["Pork-barrel spending on ‘Bridges to Nowhere’ leads taxpayers to nowhere good. Hope House GOP preserves earmark ban: https://t.co/KP0l1xXX1f"]["This #LawEnforcementAppreciationDay, please take a moment to give thanks to the brave men and women who put themselves in harm’s way every day to keep us and our communities safe. Thank you to all who protect and serve. https://t.co/1MQbckP7o7"]["ICYMI: During my tour of @MandSGrinding, I spoke with @69News's @TimSilfies about how #TaxReform will enable business to reinvest and hire as well as give the vast majority of Pennsylvanians a tax cut. WATCH: https://t.co/jHyz5Yd9sw"]["One of the services my office provides is securing military medals for those who've earned them, but never got them. Recently, my Wilkes-Barre office helped Julie Esty of Scranton secure her late father’s Korean War medal. I am honored my staff could help: https://t.co/eQGZe4VLNe"]["Sending my prayers to the family and friends of Lt. Matthew LeTourneau, the two injured @PhillyFireDept firemen, and the civilian victim of this tragic fire. The sacrifices our first responders make to keep us safe should never be forgotten. https://t.co/V2Ifr6nuGu"]["It’s been just two weeks since @POTUS signed the Tax Cuts and Jobs Act and already over one million Americans will have more money in their pocket because of #TaxReform. See the link above."]["Thank you to the great folks at @MandSGrinding in Montgomery County for hosting me today. I really enjoyed the tour and the chance to hear how #TaxReform allows small businesses and manufacturers to more easily grow and reinvest! https://t.co/7Og794ZdNL"]["Thanks to the Tax Cuts &amp; Jobs Act, the number of businesses giving bonuses &amp; higher wages to workers, and increasing investment in their communities, grows each day! Check out this list from @taxreformer showing how workers are already benefiting: https://t.co/9JfifNAejI"]["Working alongside @senorrinhatch has been a tremendous honor. Without him, we never could have gotten #TaxReform across the finish line. Thank you for your service Orrin and enjoy your much deserved retirement. Your leadership and humor shall be missed in these halls."]["I applaud the Iranian people who are rising up in significant numbers against a dangerous regime that has continually treated them badly. #IranProtests"]["Happy new year Pennsylvania! Wishing everyone a happy and peaceful 2018! #NYE2018 https://t.co/in7reciXiu"]["This holiday season, I wish every American good tidings and cheer. From my family to yours, #MerryChristmas! https://t.co/DNiuKJGgg3"]["Last night, a monster tried to kill police officers in Harrisburg. It’s a tribute to our police that the only life lost was the shooter’s. It’s also a stark reminder of the dangers our police and 1st responders face daily. This Christmas, say a prayer for all who keep us safe."]["Through our just-passed pro-growth #TaxReform, we can go from feeble growth projections to dynamic growth that produces new and more wealth for American workers. I sat down with @katebachwsj from @WSJOpinion for The Weekend Interview to explain: https://t.co/0OSUUbVkEr"]["#TaxReform is already delivering higher wages and more jobs! https://t.co/EmqsVgK9zd"]["Now that @SpeakerRyan and @senorrinhatch have signed the Tax Cuts and Jobs Act, there's only one more step to go before the vast majority of families will start seeing tax relief next year. Get your pen ready @POTUS! https://t.co/tgAUMPd2EO"]["About to go live on @AmericaNewsroom, turn on @FoxNews to watch! https://t.co/ggMhkKQnSZ"]["In case you missed my interview with @jaketapper, we discussed how the Tax Cuts and Jobs Act will affect federal deficits. Spoiler alert: they’re going to shrink. https://t.co/X402LNVKci"]["I'm live on @CNN with @jaketapper, watch now! https://t.co/xyU4d8u0My"]["Tonight, the Senate passed historic #TaxReform. I am excited the President will soon sign this bill into law, making good on the promise we made to the American people. My statement: https://t.co/u3D5RShMnd"]["Tonight is a great night for America. We're on the precipice of the most historic #TaxReform in nearly 3 decades. I went to the floor to explain how this crucial bill will result in a direct tax cut for the majority of Americans. Tonight we get it passed: https://t.co/KqZdStcuIf"]["Today is a great day for American taxpayers. Thrilled to see my colleagues in the House pass the most sweeping #TaxReform in over 30 years. Tonight, the Senate will do the same, giving PA families &amp; workers a tax cut &amp; making US employers competitive again."]["We are very close to passing pro-growth #TaxReform that benefits PA families and stimulates our economy. In case you missed it, I outlined the goals we had for this plan in the @PhillyInquirer a few weeks ago: https://t.co/xLnofyJznn"]["My staffers laid wreaths at @ArlingtonNatl this morning. Thank you @WreathsAcross for the opportunity to help honor our nation’s veterans. #WAA2017 https://t.co/f1qsnXTdo9"]["The vast majority of Pennsylvanians will soon get a pay raise because less of their hard earned money will go to Uncle Sam. Read my statement on the conference agreement for the Tax Cuts and Jobs Act: https://t.co/SeIBTT259Y"]["Animal crushing is blatantly inhumane and astonishingly cruel. Glad to have worked with @SenBlumenthal on our bipartisan #PACTAct, which just passed the Senate, to stop this heinous practice: https://t.co/m2XsvtiLWw"]["@chucktodd @MSNBC In case you missed it, you can now watch my segment on #MTPDaily with @ChuckTodd where I spoke about how virtually every working class and middle income family will get a significant tax cut: https://t.co/y6jHp1DH1r"]["Coming up shortly: I'll be joining @chucktodd on #MTPDaily to discuss #TaxReform. Turn on @MSNBC to watch!"]["Holding regulators accountable is not only good for the country from a governing standpoint, but it also saves taxpayers huge sums of money. Very happy to see @POTUS working diligently on this issue. Link: https://t.co/bIZIJJq8pw https://t.co/lNLZdSDUnz"]["My statement on the fifth anniversary of #SandyHook: https://t.co/4ZwFpjTEIp"]["I spoke with @GoErie on our pro-growth #TaxReform bill: “It is going to directly lower the tax burden to working families, middle-income families, people that live paycheck to paycheck.\" Read more about it &amp; other topics here: https://t.co/kA6kYFNxID"]["Wishing all of those celebrating a very happy and festive Hanukkah! https://t.co/tnqD6cCSAu"]["OTDIH 230 years ago, Pennsylvania became the second state to ratify the U.S. Constitution. https://t.co/l6LnMU9hjG"]["It's the most wonderful time of the year! My family and I had a great time picking up this year's Christmas tree at Evergreen Farm in Lower Milford Township. Can you guess who got to pick this year? https://t.co/IAAMZB6Sgw"]["Earlier today I joined @TeamCavuto on @FoxNews to discuss next steps on #TaxReform. I am confident we will soon deliver the tax cuts the American people deserve: https://t.co/orxNXQ4IWW"]["When the Tax Cuts and Jobs Act is enacted, it will mean big changes for small businesses: Less money to Uncle Sam, more money to invest in growing American businesses! https://t.co/BNa36jFF3B"]["Let us never forget the brave souls we lost at #PearlHarbor on December 7th, 76 years ago--a date which will live in infamy. https://t.co/r8yYShGdgw"]["On Fox Biz @Varneyco this AM, I discussed next steps on delivering tax relief for hardworking families. Also weighed in on @POTUS moving our embassy in Israel to Jerusalem. Watch: https://t.co/yIrA5of3GW"]["New update on my effort to hold regulators accountable and ensure compliance with the Congressional Review Act. @USGAO agrees that #CFPB didn’t follow the law. More: https://t.co/GNRdXRav7Z https://t.co/5N7WNsKQkM"]["Because of the historic #TaxReform we passed last week, individuals and families are going to owe less money to Uncle Sam. More: https://t.co/c0jovjEXi7"]["Our #TaxReform bill increases the Child Tax Credit, lowers the tax burden on every income bracket, especially lower income families, while creating more high wage jobs. This is a good deal for all Americans, and the proof will be in people's paychecks: https://t.co/W1wjSV3ZNr"]["New from @philipaklein at @dcexaminer: \"Media are being dishonest about Republican tax bill's treatment of the middle class.\" Check it out: https://t.co/O2IoO31sng"]["80% of Americans paying the individual mandate penalty are in households that make less than $50k annually. We’re making Obamacare optional, no one gets “kicked off.” #MythVsFact https://t.co/Sdt1Znj5bt"]["There are zero changes to Medicare, Medicaid, Social Security, or education funding. Zero. #MythVsFact https://t.co/h634oLEiVN"]["My statement on the verdict in Kate Steinle’s murder case: https://t.co/TGPAKVAgF5"]["The Senate’s Tax Cuts and Jobs Act has gone through regular order and has been open to bipartisan input from the start. That’s just a fact. #MythVsFact https://t.co/6V0Bb3lmh6"]["Just ~0.4% of extra economic growth over 10 yrs fills the $1.5T revenue gap that allows for tax cuts. We're talking about going from 1.9% to 2.3% GDP - and we're at 3% growth now. If you’d like to have smaller deficits then pass this legislation. https://t.co/vNjs9v4K8i"]["137 leading economists agree: Economic growth will accelerate if the Tax Cuts and Jobs Act passes, leading to more jobs, higher wages, and a better standard of living for the American people. The time for #TaxReform is now, and we're going to get it done. https://t.co/dF7RgVcgCx https://t.co/FCaPi9AIdH"]["Today, members of my D.C. staff joined the @RedCross in writing cards for our brave service members, veterans, and their families for the holidays. God bless all who have served, continue to serve, and their families. https://t.co/6o5K1kThF0"]["Today marks 70 yrs since Israel was recognized as a nation by the U.N. I have always been, &amp; continue to be, a strong supporter of Israel. Recently, I co-sponsored a bipartisan bill to combat the anti-Israel boycott, divestment, &amp; sanctions (BDS) movement: https://t.co/77Ow6Ix7HD"]["I joined @MariaBartiromo on @MorningsMaria to discuss, among other issues, where #TaxReform stands in the Senate and the road forward to a strong recovery, greater opportunity, and a higher standard of living for all Pennsylvanians. Watch: https://t.co/C6E2HBDzoU"]["North Korea’s continued provocations, including the launch of yet another ballistic missile, demand immediate action from Congress and this Administration. @ChrisVanHollen and I urge the full Senate to immediately pass the BRINK Act and for the House to follow suit. Statement: https://t.co/d9c6Jqmrcf"][".@IBDinvestors debunks myth that tax bill will hurt the poor. New @jctgov table shows all income groups get tax relief - including those who don't pay income taxes - because of the bill's hike in refundable tax credits: https://t.co/30gCSQHemW https://t.co/9JK2hoo2Ba"]["Check out my op-ed in the @PhillyInquirer on how the Tax Cuts and Jobs Act will result in a strong recovery, greater opportunity, and a higher standard of living for all Pennsylvanians: https://t.co/28IvZfFOFp"]["New analysis from @jctgov and @USCBO shows that every income group in America gets a tax cut in the Senate's Tax Cuts and Jobs Act. Read more: https://t.co/fPjI3LOYrs"]["The reality is that the American family is going to owe less money to Uncle Sam. Check out this video from @GOPSenFinance on how #TaxReform will help you: https://t.co/3TplVVytd7"]["I appreciate Jerome Powell, @federalreserve nominee to be Chairman, taking the time to come by my office and discuss his vision for the Fed. You can watch his nomination hearing tomorrow morning at: https://t.co/QCu4jhGomm https://t.co/ZbVI7p2HUj"]["@BoyerandRitter @RMSides @PPG @ShipleyEnergy @PAManufacturers @DellickerS Joe from @PaCPAs says tax code “creates confusion and unnecessary difficulty.” #TaxReform will help simplify it. https://t.co/VMP7ym6Co1"]["Happy #SmallBizSaturday! With the vast majority of Pennsylvania businesses being small businesses, they are the engine that makes our economy go. Be sure to #ShopSmall today, and support local Pennsylvania businesses! https://t.co/pYukOko3pN"]["I visited @WaterStMission in Lancaster yesterday and got a first hand look at the great work the staff and volunteers do there on Thanksgiving and every other day the year. From my family to yours, Happy Thanksgiving. https://t.co/lH87n2QGWE"]["Happy @RepSmucker was able to join me in Lancaster yesterday to discuss how #TaxReform will benefit Pennsylvania families and businesses. https://t.co/KbVMvTBVWy"]["Leading economists agree, the Senate’s Tax Cuts and Jobs Act means a better economy for workers. Read what they’re saying:  https://t.co/f5wSrypzyM"][".@POTUS is right to re-designate North Korea as a state sponsor of terrorism. Our government must step up pressure on North Korea with more sanctions, like those in @ChrisVanHollen’s and my bipartisan BRINK Act."]["The @GOPSenFinance's Tax Cuts &amp; Jobs Act cuts taxes for PA families &amp; accelerates economic growth. Glad to have the support of @PAChamber, @nfib_pa &amp; @PAManufacturers. More: https://t.co/RWRgHAiGnM"]["Our police officers and first responders represent the best of our society. The heinous murder of Officer Brian Shaw highlights the dangers police officers run towards every day. My thoughts are with Officer Shaw's family, friends, and colleagues. https://t.co/5Mh1nS7pBq"]["Child pornography is a heinous crime. Victims need to be empowered to recover restitution from criminals who produce and traffic this exploitative filth. I’ve joined @senorrinhatch &amp; @SenFeinstein in righting this wrong. More: https://t.co/G9pCPCUMJX"][".@Avik fact-checks claims about repealing Obamacare's individual mandate. The verdict: Repealing the mandate is a tax cut for lower-income Americans. https://t.co/547Ss0O6WY"]["I asked @JCTgov: Does the effective elimination of the individual mandate of the tax bill lead to anyone in any income class paying any additional taxes out of pocket? @JCTGov reply: Elimination of the mandate itself doesn’t create a new individual income tax liability. https://t.co/LmgsQ3dXtc"]["I am very excited about the passage of the Tax Cuts and Jobs Act out of @GOPSenFinance. Pro-growth tax reform maximizes growth of the American economy and gives tax cuts to middle income families. My statement: https://t.co/j6DKOOS3g8"]["Governor Ridge is a great Pennsylvanian and a great friend. I wish him a speedy recovery and hope to see him soon."]["Pleased to see my House colleagues passed their #TaxReform bill. A critical step towards giving PA families a direct tax cut and get our economy moving again! Now it's @GOPSenFinance’s turn."][".@JCTgov confirms: lower and middle income families will get massive tax cuts under @GOPSenFinance #TaxReform plan. https://t.co/m4RBMPcWoX"]["David Freed is a seasoned prosecutor and a dedicated public servant. He will serve the Middle District of PA capably and admirably as U.S. Attorney. I thank my colleagues for supporting his nomination."]["@BoyerandRitter @RMSides @PPG @ShipleyEnergy @PAManufacturers Kevin from @DellickerS in Germansville says our tax code is so complex that “I spend between $5K-10K a year just filing my tax returns, let alone paying the actual rate.” #TaxReform will simplify the tax code &amp; ease the burden on small businesses. https://t.co/aQNuELWQYm"]["Awesome to see the @Hbg_Sch_Dist participating in the #IgniteMyFuture program. Teachers, thanks for all you do to ensure the next generation has the right skills to become the workforce of the future."]["@GOPSenFinance Non-partisan @jctgov confirms: The @GOPSenFinance Tax Cuts and Jobs Act makes no changes to health care programs. https://t.co/c3RCPXblWQ #TaxReform https://t.co/H48HlW7ddY"]["The @GOPSenFinance #TaxReform bill will help PA families in 2 big ways: 1. We lower your federal tax bill. More money for you, less for Uncle Sam. 2. We take arguably the worst business tax code, and make it the best, driving up wages. Learn more: https://t.co/6wgQGi8kff"]["We want to free Americans from the onerous burden of the individual mandate tax, which unduly effects low-income Americans. We will take this up in tomorrow's @GOPSenFinance #TaxReform markup. Watch my @CNBCClosingBell segment to learn more: https://t.co/xmiueoRcbw"]["The individual mandate tax is based on a flawed premise that the fed govt should force Americans to buy overpriced health insurance even if they don't want it/cant afford it. Repealing the ind. mandate tax is direct tax relief for the working class. My statement: https://t.co/KTdzrylbIS"]["Live on @CNBCClosingBell right now to discuss the benefits of #TaxReform! https://t.co/8p3UYw0GVV"]["@BoyerandRitter @RMSides @PPG @ShipleyEnergy David from @PAManufacturers in Harrisburg says our current tax code puts pressure on American companies to leave the U.S. “It’s easier for a foreign company to reinvest in America than it is for American companies.” We can fix this with #TaxReform. https://t.co/qFU3WS7VMn"]["@GOPSenFinance When workers have more capital-intensive equipment to work with, they tend to be more productive, and therefore, earn higher wages. The @GOPSenFinance #TaxReform legislation will make this happen: https://t.co/PY3gqq1THg"][".@GOPSenFinance Tax Cuts and Jobs Act lowers taxes for middle income taxpayers &amp; delivers better jobs, higher wages. It also makes American businesses globally competitive again: https://t.co/b35lmo4Hgp #TaxReform"]["@SenSchumer Funny coming from @SenSchumer, who has probably never met a tax he didn't want to hike. Facts: GOP #TaxReform offsets loss of SALT deduction with larger standard deduction and lower rates while ending incentive for big spending liberal politicians to increase taxes."]["Middle class biggest winners in @GOPSenFinance #taxreform plan, @jctgov says. See the details from @Brian_Faler @politico: https://t.co/hOswYqVY7E"]["Will be joining @chucktodd on @MeetThePress this morning at 10:30 (check your local listings) to discuss the Senate's #TaxReform proposal. Our plan will not only provide a pay raise for working Americans, but incentivize foreign $s to come back to the U.S."][".@TaxFoundation study finds @SenateFinance #TaxReform bill gives middle-income PA family ~$2,700 direct pay raise. https://t.co/ddHyF2d06j"]["This #VeteransDay, let us take the time to honor and reflect on the brave men and women of our armed forces who have in generations past and present selflessly put themselves in harm’s way, to defend the freedoms and liberties we hold most dear: https://t.co/E8q2YhLixg"]["It was an honor to meet @USArmy veteran @ssgtravismills and address the 2017 #YorkPA #VeteransDay Celebration. https://t.co/uW6GMvqJj6"]["OTIDH 1775, the @USMC was founded at the Tun Tavern in Philadelphia. On behalf of a grateful nation, happy birthday to the United States Marine Corps. #USMC242"]["Looking forward to joining @TeamCavuto on @FoxBusiness in just a bit. Make sure to tune in and hear my thoughts on #TaxReform, and how we're working in the Senate to get America's economy booming again. https://t.co/f31cXQZBum"]["Here's an idea of how the @GOPSenFinance plan helps you. #TaxReform by the numbers: https://t.co/DFvoaCI4Jm"]["About to join the folks at @SquawkCNBC for a discussion on the Senate's #TaxReform proposal, and what it means for you. Be sure to watch live on @CNBC! https://t.co/VSjAzX09xG"]["Coming up in just a few minutes, I'll be joining @foxandfriends live on @FoxNews. I look forward to discussing how #TaxReform is going to put more money in your pocket and raise the standard of living for all Americans. https://t.co/YFsQJjdLwH"]["You can now read the comprehensive @GOPSenFinance #TaxReform proposal, known as the Chairman's mark at: https://t.co/aAcaNvmbJf"]["I'm very excited about the #TaxReform proposal we've just unveiled in the Senate, the Tax Cuts and Jobs Act. This #TaxReform package will be a pay raise for the overwhelming majority of Pennsylvanians. https://t.co/wMZZeq7nXQ"][".@GOPSenFinance #TaxReform bill = more investment in the United States -&gt; more jobs, higher wages, &amp; a better standard of living. https://t.co/jVY96WZlc1"][".@RonWyden &amp; I call on the @StateDept to investigate disturbing reports of Azerbaijani authorities detaining gay &amp; transgender people. Learn more: https://t.co/2k8Ymm4iB8"]["@BoyerandRitter @RMSides @PPG Richard from @ShipleyEnergy in York says U.S. tax code has hurt his business. Listen to how #TaxReform would help reduce costs for consumers and encourage businesses to reinvest: https://t.co/uBJIe4FBLy"]["In the wake of Texas, @SenatorCollins &amp; I sent a letter to @DeptofDefense and @DHSgov about proper reporting of criminal records to @FBI . https://t.co/hBykkdy517"]["The U.S. sugar program is a sour deal for American consumers. It's time to reform this government corporate welfare. https://t.co/9Y2fGlYCH4"][".@ChrisVanHollen &amp; my #BRINKAct sends a clear message: banks &amp; firms that work with North Korea can't work with us. https://t.co/NdTYgYPwgT"]["My thoughts are with the @PAStatePolice trooper who was shot at a traffic stop today. I pray for his recovery. https://t.co/reA1jBvzg4"]["@BoyerandRitter @RMSides We need #TaxReform as U.S. code “makes it difficult for US companies” to compete internationally. -John from @PPG. https://t.co/62y7mepW2L"][".@USGAO report @SenKaineOffice &amp; I requested finds seniors at risk of opioid abuse. Medicare improvements needed: https://t.co/5Qe94wD9km"]["Heartbroken by the awful shooting at a church in Sutherland Springs, Texas. May God bless all those affected and their families."]["My staff is happy to support the #ShowYourStripes campaign for @Philarmh. Great org. that helps children &amp; their families in times of need. https://t.co/QowAdazOhq"]["Hats off Abbie Newman &amp; @MissionKidsCAC on the new Montco child advocacy center that will help even more vulnerable kids. You do great work! https://t.co/Ep8pTQqm8e"]["Congratulations to @PennLaw Prof. Bibas on his Senate confirmation to join the U.S. Court of Appeals for the 3rd Circuit. My statement: https://t.co/JkHldoESSN"][".@RepKevinBrady has a great #TaxReform bill for middle-income PA families &amp; economic growth. @HouseGOP should pass it. My statement: https://t.co/bJKKORbT8s"][".@washingtonpost says @SenateDems claim that #TaxReform raises taxes on working-class is FALSE. GOP wants tax cuts! https://t.co/ENpOOnJPnw"]["Tax code is ~75,000 pgs. #TaxReform means “simplification” &amp; “transparency.” -Bob from @BoyerandRitter in Camp Hill https://t.co/WBSjIELjLg"]["Protecting taxpayers with @EximBankUS reform is essential. Watch my remarks at @BankingGOP nominations hearing: https://t.co/azAQlysCOC"]["Horrified by the deadly attack that occurred in #Manhattan. My thoughts are with all of those affected by this terrifying event. https://t.co/WttJcsfjP1"]["The U.S. sugar program is unboolievably bad. Glad to work with @SenatorShaheen to protect taxpayers &amp; ensure reasonable prices for sugar. https://t.co/2cdJJzBpDH"]["Chechen govt. actions against gay men are cowardly, abhorrent, &amp; serious human rights violations. Statement from @SenMarkey &amp; me: https://t.co/0MtlBhc19V"]["From @ManhattanInst: Indiv. mandate harms those it meant to help; does little to increase enrollment/reduce premiums https://t.co/0HT6Rdikqj"]["Regulators must follow the law. Here’s how Congress can hold them accountable: https://t.co/iCU3ACf5IR"]["#TaxReform would \"free up a lot of money..to get new equipment, new employees, pay higher wages” -John from Wind Gap https://t.co/gtl1iwmbim"]["Only 10% of leftover opioids are disposed properly. Learn how to dispose of leftover Rx drugs today: https://t.co/ElOD3uhlFb #DEATakeBack"][".@POTUS's declaration of a Nationwide Public Health Emergency to address the opioid crisis is a reminder of its severity. My statement: https://t.co/rNl0sQ41HB"]["Pleased to meet with members of the @alzassociation. I know the toll Alzheimer's takes on a family &amp; I'm committed to the fight. #EndAlz https://t.co/LK6f4rU3Hz"]["#TaxReform means \"we could hire more people. Invest in our plant and equipment.\" - Bob from Malvern https://t.co/JHsIJzI8cq"]["Thanks @IvankaTrump for coming by to discuss how #TaxReform improves the standard of living for hardworking American families. https://t.co/aoSqFDGhBz"][".@JeffFlake has served the people of Arizona with integrity and honor. My statement on his announced retirement: https://t.co/13AHXswsEU"]["#TaxReform means \"millions of companies just like ours could continue to reinvest.\" -Sean from Bristol https://t.co/gEugCdEl9j"]["My office spoke with Pennsylvanians about why #TaxReform matters to them. I hope you'll hear what they had to say: https://t.co/cDIyalkQkq"]["Tragic reminder of the danger posed by sanctuary city policies. Trial set to begin for Kate Steinle murder suspect: https://t.co/uPGwQVEM5n"]["My statement on tonight’s passage of the budget resolution: https://t.co/jd3ucYoJQc"]["Joined @DanaPerino on the @dailybriefing to discuss how #TaxReform can shrink our deficit and spur economic growth: https://t.co/nY7ZMmuQQT"]["This AM on @BloombergTV I discussed today's budget vote, and what it means for #TaxReform. Full interview: https://t.co/B5hqFblowT https://t.co/3XrqNAvf65"]["To pass #TaxReform, we must first approve a budget resolution. Here’s how USA will benefit: https://t.co/n5niBTyd6b @BudgetGOP"]["#TaxReform has 2 goals. Tax relief for hard-working families &amp; creating right incentives to maximize economic growth."]["While protecting rights of law-abiding citizens, we must work to keep guns away from criminals, terrorists, &amp; the dangerously mentally ill. https://t.co/TUgl1bOxhR"]["Individual mandate adversely affects lower income Americans. @SenTomCotton &amp; I want to give families needed relief: https://t.co/FTi9DPX5aw https://t.co/7c4qhXNaX8"]["Congratulations to my good friend @SenJohnMcCain being awarded the @ConstitutionCtr's #LibertyMedal. A great honor for a great American."]["I joined @SenBobCasey, @GovernorTomWolf &amp; PA reps in asking @JeffBezos to choose PA for @Amazon's new HQ. Read more: https://t.co/oHVDQd9lqC"]["Earlier today members of my DC staff participated in the #Walk2EndAlz. A great event for a crucial cause. Thanks to all who walked! https://t.co/89FJAqqylM"]["Congratulations to the city of Pittsburgh &amp; the @Penguins who celebrated their #StanleyCupChampionship with @POTUS at the @WhiteHouse today! https://t.co/u75sLlhZ2x"]["Manufacturing is key to PA's economy. In 2016, manufacturing provided over 550K jobs + $33 billion in manufactured exported goods! #MFDay17 https://t.co/8bJRViS25f"]["Senate should swiftly approve resolution from @SenMarkey and me condemning 'honor killings' of gay Chechens. Statement below: https://t.co/ui7tl328Ob"]["My statement on the Budget Committee’s passage of the FY2018 budget resolution: https://t.co/d2ZG6jiEiZ"]["Stronger economic growth (more jobs + higher income) means fewer people must rely on safety net programs. #TaxReform @BudgetGOP https://t.co/EIVXjmBb4J"]["Revamped tax code will allow us to achieve the growth our economy is capable of &amp; decrease the deficit in the process. @BudgetGOP #TaxReform https://t.co/SoPVgL6FV6"]["Let’s remember the goals of #TaxReform= maximize econ growth + lower burden on middle income families. @BudgetGOP https://t.co/SLrUTTxi7y"]["Thank you @UsAgainstAlz for inviting me to speak tonight. Your work is crucial in the battle against Alzheimer’s. #StopAlz #UsA2Summit17 https://t.co/OHaEDgEpEB"]["Bill Wolfe Jr. was a beloved husband &amp; coach. Losing him is a tragedy. Deepest condolences to his family, friends, &amp; the Ship community."]["Horrific shooting. Praying for the victims and their families. #LasVegas"]["On this holiest of days, I wish all who are observing #YomKippur an easy fast. G'mar Hatimah Tovah."]["Great talk in Williamsport on how #TaxReform will help US manufacturers expand, succeed. Thx to @LycomingEngines for hosting! https://t.co/gt4vgsGpyv"]["My statement on the 2018 Fiscal Year Budget Resolution: https://t.co/H1GllOXSmj"]["Pennsylvanians are stepping up to assist our fellow Americans in #PuertoRico during their time of need. #Maria https://t.co/Nlw3qvebJp"]["#TaxReform = expanded economic production, higher wages &amp; better standard of living. Watch @BloombergTV: https://t.co/8h33RYcksb"]["Great to see my friend @SteveScalise back on the House floor today. Welcome back. #ScaliseStrong"]["#PuertoRico needs our help. @POTUS right to pay 100% of immediate recovery costs. Should also grant Jones Act waiver ASAP. Cc @MariaQSanchez"]["Reducing business taxes will create jobs and raise wages, expanding opportunity for all Americans. We need #TaxReform now. #MythVFact https://t.co/MoSYL4cycV"]["It's time to give every American a pay raise by lowering their tax burden. My statement on the #TaxReform framework: https://t.co/qZxJ4MSbaG"]["Great to be in Delco this morning talking #TaxReform, regulation, and how we can get our economy moving again. https://t.co/v4XN89p3yW"]["My staff enjoyed spending time with students from Philadelphia as they toured the Capitol. Thanks for visiting! https://t.co/PWjro0iBph"]["Glad @POTUS going after banks facilitating trade w/ NK. My &amp; @ChrisVanHollen’s BRINK Act needed now to put mandatory sanctions on bad banks."]["L'Shana Tova to all who are celebrating Rosh Hashanah."][".@SenatorEnzi, @SenBobCorker &amp; I have a path forward on #TaxReform allowing economy to surge &amp; reduce deficit. More: https://t.co/pxtmA46IPe"]["The U.S. has the highest statutory corp. tax rate in OECD. #TaxReform will make U.S. businesses more competitive. #MythVFact @GOPSenFinance https://t.co/OLAAst0ooU"]["My statement on the passage of the National Defense Authorization Act: https://t.co/DbRc56ZWyH"]["Enjoyed speaking with @timsilfies of @69news about #TaxReform. Check out the interview tonight! https://t.co/yJwYZANUle"]["If you or someone you know is trapped on the US Virgin Islands due to #Irma, please call: (340) 772-0357 or visit https://t.co/XQAbHHoMib."]["OTDIH 1787: our founders signed the Constitution, a first step in what has become the greatest experiment in self-governance. https://t.co/kpS5qvfLLB"]["You'd best bee-lieve we're buzzing over our homemade honey! ICYMI: My family and I recently took up beekeeping: https://t.co/kKrPf7VgOS https://t.co/wslc5DyQKJ"]["For those who wish to aid in #Irma relief, visit: https://t.co/HS9RUSHO1X or https://t.co/WuJWcOZVPv. You can also call 1-800-FL-Help-1."]["My office is working w/the Carbon County VA to give veterans of the Korean War the medals they rightfully earned: https://t.co/ygB2iUlDFH"]["On #POWMIARecognitionDay, we honor the brave men &amp; women who defended our freedoms abroad &amp; have yet to return home. https://t.co/KmH8KVs7Sr"][".@HHSGov's Inspector Gen. must investigate providers fraudulently profiting off those battling addiction: https://t.co/Lv6CBvKn7C"]["Glad to work w/@SenBobCasey to address clean H20, curtail Russian energy. Learn more from @TLnews: https://t.co/0bm4xymTqE"]["2 NDAA amdts by @SenBobCasey &amp; me on Bucks, Montco water contamination &amp; cutting military use of Russian energy: https://t.co/eK1xHHT9re"]["I’ll be live in 2 minutes. Hope you can tune in. https://t.co/ZH2lIZHqmt"]["Just finished a constructive, bipartisan meeting at the White House on #TaxReform. I'm optimistic we'll find a way to get this done."]["I have a confection to make… it's a pretty sweet gig. Thanks to PA candy makers for the sugary supply, glad I can show off PA's best! https://t.co/sBTh5oE7O1"]["Optimistic we can achieve pro-growth #TaxReform to help workers &amp; biz. What needs to happen next via @BloombergTV https://t.co/2aXr5kBUcB"]["My wife Kris attended the Tower of Voices groundbreaking at the flight 93 memorial in Somerset County. A moving tribute to those we lost. https://t.co/o7PEjuGAdj"]["We must never forget the innocent lives that were lost 16 years ago, nor the unity &amp; strength we showed as a nation in the wake of tragedy. https://t.co/fGez9jUhze"]["Korea's econ grew last year, proof current sanctions don't do enough. I call on Senate to pass BRINK Act: https://t.co/Y321uCl5P6"]["To those who are, or have loved ones abroad and in #Irma's path, please check in with the @StateDept: IrmaEmergencyUSC@state.gov"]["I'll be live in studio w/Fox Biz @Varneyco at 11:15 discussing how #TaxReform will generate robust economic growth."][".@RepCharlieDent served the 15th district and PA with honor and distinction. I wish him and his family the best in their future endeavors."]["It's an honor to work on behalf of law enforcement. https://t.co/mJmBQTCPfN"][".@POTUS has made a great choice in nominating @RepTomMarino to serve as drug czar. He'll do a fantastic job."]["The work being done by Dr. June of @PennMedicine &amp; others on gene therapy for cancer patients is awe inspiring: https://t.co/CzrzIwwUw3"]["My statement on today’s debt limit vote: https://t.co/pJk4tWX6Vr"][".@BrandywineSPCA is doing great work to help our four legged friends affected by #Harvey: https://t.co/TJahclVKQi CC:@ASPCA"]["My statement on #DACA: https://t.co/UeyhUgkrDF"]["N. Korea nuke test threatens US, allies security. Must respond w/new sanctions in BRINK Act; @BankingGOP hrg Thurs. https://t.co/5FttOCaWgp"]["Congratulations and Godspeed to @Penn_State's own @Zenanaut being named to @NASA's 2017 astronaut class! https://t.co/26CHzCKvB2"]["Thank you @PBS39Channel for hosting tonight's town hall, and thank you to all who attended and watched online! https://t.co/NDCQXZ7tUy"]["My @PBS39Channel town hall will begin in just a few moments. Watch live: https://t.co/K1LHE2MGLR"]["I look forward to answering your questions tonight during my town hall at 7. There's still time to submit questions: https://t.co/CcON3tA8aP"]["Appreciate @POTUS's call for a more simple, pro-growth tax code to make the US a more competitive place for biz. Time for #TaxReform is now."]["Appreciated the opportunity to sit down with @pastatenaacp to discuss our common goals. https://t.co/0fMdt1JTTY"]["Thank you Structural Modulars Inc. in Clarion County for the tour! Great convo on #TaxReform &amp; boosting affordable manufactured housing. https://t.co/21c4KQbM2f"]["Thank you to the great folks at Brownlee Lumber in Jefferson County for showing me around! Simplifying our tax code will help PA biz thrive. https://t.co/oLUEnKdQFK"]["North Korea's aggression is unacceptable. @ChrisVanHollen and I call on the Senate to take up bipartisan BRINK Act. https://t.co/rSCM6w8Wkj"]["Glad I got the chance to visit God's Country! #PotterCounty https://t.co/ARfgxKbrjz"]["Always good to visit McKean County. My thanks to @ArdaghGroup for hosting me for a tour of their Port Allegany glass plant. https://t.co/Huxoiaz6ya"]["In times of peril, we come together as Americans and lift each other up. Great to see PA stepping in to help those affected by #Harvey. https://t.co/zZEWxQgHos"]["Helpful feedback from #Coudersport area leaders on need to tackle #TaxReform + health care today. https://t.co/sB0HvINNDR"]["Good to catch up with @MarcieSchellham of @TheBradfordEra at Mick’s Little Red Diner. https://t.co/nhFsKKwkYM"]["Pleased @POTUS is taking crucial steps to ensure our police officers have the tools they need to protect themselves &amp; others. My statement: https://t.co/HAqwT15rGU"]["Great to be in Wellsboro this morning talking #TaxReform with local business and community leaders. https://t.co/JMJuKRVEAM"]["Thoughts &amp; prayers are with the people of Texas &amp; Louisiana. Donations to the @RedCross are a great way to help those affected by #Harvey. https://t.co/Q4iMtmmQV2"]["Tickets to attend Thursday's @PBS39Channel town hall will be available beginning at 9 a.m. this morning at https://t.co/CcON3tA8aP."]["Taking part in a town hall next Thursday night in Bethlehem. Full details are available in the article below. https://t.co/KbKMVsJm7P"]["Great NK sanctions op-ed @_ARuggiero: https://t.co/MNm0OCXZ8B. Need BRINK Act to crack down on shady Chinese banks: https://t.co/4fnumPCpDf"]["Godspeed to PA Nat Guard  Charlie Company, 1st Attack Recon. Battalion (Johnstown) on deployment to Afghanistan: https://t.co/49u4oGGYzu"]["Update: @NTSB has taken over the investigation. NHSL is operating local service w/ delays. Receive updates via @SEPTA_SOCIAL."]["Another reminder that Putin is an international pariah and Russia is no friend to the U.S. https://t.co/cPz6CdbBek"]["42 people injured in SEPTA crash outside Philly this morning: https://t.co/TY1DgGQ9QS. We are monitoring and have asked for updates."]["My statement regarding President Trump's address to the nation on #Afghanistan: https://t.co/E6vsblmzsr"]["Heartbreaking news about the #USSJohnSMcCain. Keep the crew in your prayers today."]["Violence against our police cannot continue. We must do more to support and protect them."]["My thoughts and prayers are with the 6 police officers shot last night in PA and FL. https://t.co/cWVFtPAAHZ"]["First Scaramucci, now Bannon. Two great personnel decisions by John Kelly."]["Thoughts and prayers are with the victims of today's senseless attack in #Barcelona. Those affected, please reach out to family &amp; friends. https://t.co/nXimjZqPwX"]["My statement on hate groups in the wake of Charlottesville: https://t.co/d6Z5MyrOMY"]["On the road this summer? Stop by Breezewood, PA! Sounds like @MelanieDGKaplan enjoyed her visit. https://t.co/84JcTchBAy"]["Glad to help @UpperDarbyFire get $1.2M fed grant for new firefighters! Need fed grant help? Visit my site: https://t.co/hsQAloC9T2"]["Thank you to our bright, impressive summer interns who worked diligently on behalf of the people of PA. You have great futures ahead of you! https://t.co/S9QNYiybQc"]["The racism, hate and violence seen in #Charlottesville are vile and unacceptable."][".@POTUS declaring opioid/heroin crisis a nat'l emergency is reminder of its seriousness: ~11 OD deaths/day in PA. https://t.co/FVELrjCDEy"][".@USGSA invites artists to apply for a commission at the new U.S. Courthouse in Harrisburg. Submit by 9/15/17: https://t.co/qYr8dIznxZ"]["On #PurpleHeartDay, we remember and honor their sacrifices. Learn more about our nation’s oldest military award: https://t.co/LmuPlkN8Gj"]["Congrats to Shawna Moore of Phoenixville, who has been named Regimental Commander of the Corps of Cadets at @WestPoint_USMA. https://t.co/fF9BH9nfbA"]["Thank you @Penn_State Pres. Barron &amp; LaunchBox staff/biz owners for the tour. You all are doing great work for startups in PA! https://t.co/0UkqpvwTgD"]["ICYMI: Senate approved S.1182, which celebrates the great work done by the @AmericanLegion for vets and military families. #LegionCoin"]["Working w/@ChrisVanHollen to give foreign banks a choice: do business w/the U.S., or w/ North Korea. Not Both. https://t.co/0vgvE5D94a"]["OTDIH 1790: Congress authorized Sec. of Treasury Alexander Hamilton to create the U.S. Revenue Cutter Service, known today as the @USCG. https://t.co/AYfNv1PTct"]["Congratulations to PA's own Robert Powelson on being confirmed to be a @FERC commissioner. Very well deserved."]["I'll be live on @MorningsMaria at 7:30AM to discuss #TaxReform with @MariaBartiromo. Hope you'll tune in. https://t.co/ggj0fPeG4t"]["For those who still need help or info due to the train derailment, a 2nd comm. outreach center has opened in Bedford, PA (132 East John St.)"]["Monitoring train derailment in Bedford Co. If you need help or info, a comm. outreach center has been set up in Hyndman, PA (152 Hyndman Rd)"]["Congrats to PA's Col. Carl Reece, Col. Mark Schindler &amp; Col. Steve Radulski on their promotions to Brig. Gen. in the @USArmy. Well deserved!"]["So long as North Korea is testing nukes and ICBMs, we need stronger sanctions like my bipartisan BRINK Act."]["Despite current sanctions, North Korea’s economy continues to grow: https://t.co/S2CW3Y4CmB"]["Pennsylvanians can be proud of one of our own: Brigadier General Anthony Carrelli has been promoted to major general in the @usairforce."]["Convicted felon, deported 20 times, released only to sexually assault a 65 yr old. Sanctuary city policies must end. https://t.co/Ikp9VZPiPb"]["Read my statement on the health care reform vote: https://t.co/NTo6ebGEcr"]["We have a duty to put Medicaid on a sustainable path. We can’t kick it down the road &amp; cause a fiscal crisis. MORE: https://t.co/4xCRMjK3Fa https://t.co/c5rX6sgppB"]["Secured agreement from House, Senate ldrship to further tighten North Korea sanctions w/my bipartisan BRINK Act: https://t.co/yD5zSwUSxa"]["There are consequences when foreign nations undermine global stability &amp; threaten USA. Glad Senate passed Russia, Iran, &amp; NK Sanctions"]["WATCH: at 3:45, i'll be speaking about repealing #Obamacare &amp; putting Medicaid on a sustainable path. https://t.co/1wAG7xKKOf"]["#OTDIH 1953, the U.S. and Korea signed an armistice agreement, ending the conflict on the Korean peninsula. https://t.co/fXVtwBFXfk"]["Jeff Sessions is a credit to DOJ, and I continue to support him as Attorney General. Read my statement: https://t.co/tNvxeJRAZX"]["The Senate took an important step forward today by beginning debate on repealing and replacing Obamacare. Read my statement: https://t.co/p352uaIICD"][".@ICEgov lists Philly as one of the worst sanctuary cities: https://t.co/1lgWXoVglv. This dangerous policy must end: https://t.co/Q6AljKLxeP"]["N. Korea's ICBM tests threaten global peace. Bipartisan BRINK Act from @ChrisVanHollen &amp; me is a forceful response: https://t.co/5CshjLvS3x"]["AG Sessions is right. Past time to end dangerous sanctuary cities that put our children at risk. https://t.co/Pdeua0s4eW"]["OTDIH 1969: Earth turned its gaze to the heavens, as mankind set foot on another world for the very first time. #Apollo11 https://t.co/w4535psEIv"]["A powerful and moving statement by @MeghanMcCain. We're all pulling for your Dad. https://t.co/ZmyyTVwxPN"][".@SenJohnMcCain is an American hero. Kris and I send prayers of strength and healing to him and his entire family."]["Young women should aspire to be police officers, not cop killers: https://t.co/sROxmRHruT Glad @JakeTapper agrees. https://t.co/kotlcnREri"]["Read my statement regarding further Senate action on health care reform: https://t.co/UQVhGKwRyM"]["#BetterCare keeps Medicaid expansion. PA gets $50B to cover working-age able-bodied childless adults. #MythVFact https://t.co/IRryzQLu83 https://t.co/KbAXFy2YJI"]["W/ #BetterCare, fed Medicaid $s grow each year. Fed govt will give PA $200B+ over next 10 years. #MythVFact https://t.co/IRryzQtTgv https://t.co/ApVZjAQnix"]["Keeping @SenJohnMcCain in my thoughts as he recovers from recent surgery."]["Today, the Senate unveiled an updated draft of our #BetterCare bill, which aims to address Obamacare’s failures. Read my statement: https://t.co/njvKFFGZfo"]["You can now read the updated Better Care Reconciliation Act draft here: https://t.co/xtsKDrUNsZ"]["North Korea has crossed a dangerous threshold &amp; we must take action. Working w/ @ChrisVanHollen on strong sanctions. https://t.co/JZbZIup0K4"]["Final: Hit It Toomey tops Penn Is Mightier 23-11, retaining the Keystone Cup. Looking forward to next yr's game w/ @SenBobCasey &amp; his squad. https://t.co/gYKtN9kEzV"]["Medicaid must be reformed to be sustainable. Watch the @SpecialReport segment on @FOXNews: https://t.co/38hrD6hmIH"]["244,290 Pennsylvanians paid the individual mandate tax penalty, totaling $47 MILLION. 86% made less than $50k: https://t.co/4qWvAgbK5M"]["Obamacare’s numerous tax hikes made health care costlier and directly hit middle class families. https://t.co/S19lOX2VLH #MythVsFact https://t.co/5wZrbAE9g9"]["When reforming Medicaid, we must also preserve care. W/modest changes, we can. My @USATODAY op-ed w/Larry Lindsey: https://t.co/7lxdwA3BEe"]["Coming up next: I'll be on @squawkCNBC in just a moment. Stay tuned!"]["I'll be joining @JoeNBC &amp; @morningmika on @Morning_Joe shortly. Tune in!"][".@GeorgeWill on HC bill: '@SenToomey provision makes it this century's most significant domestic policy measure.' https://t.co/RoqHckZb1c"]["If you've seen the @nytimes article today, here's a beehind-the-scenes look at the bee installation: https://t.co/kKrPf7VgOS"]["The middle class has been crushed by Obamacare’s tax hike. #BetterCare provides them necessary relief. #MythVsFact https://t.co/HClx2Ag7RZ"]["I sat down w/@AmerRadioJourn to discuss how #BetterCare will save Medicaid, and why we need tax reform now: https://t.co/eoQOqp94FE"]["NYPD officer &amp; mother of 3 assassinated in line of duty today. Thin Blue Line Act would ensure justice is served: https://t.co/mxBmnRUXLx"]["There's many myths out there about the Senate's draft health care bill. Here are the facts: https://t.co/6eQNGgECnH #MythVsFact"]["Thanks @abc27news for hosting this town hall tonight. I appreciated the opportunity to answer questions from across PA."]["Tonight at 7, I'll be joining @abc27news for a town hall. I look forward to answering your questions! How to watch: https://t.co/EpsfxhskT0"]["Wishing everyone a great 4th of July, a wonderful day to celebrate our independence with family and friends. https://t.co/3MCDVKBwWj"]["Under #BetterCare bill, Medicaid expansion stays—and fed. funding levels will eventually match all other Medicaid categories. https://t.co/PurdhY2BHM"]["Coming up soon: I'll be discussing health care reform with @SandraSmithFox on @SundayFutures. hope you'll tune in! #BetterCare"]["While majority of funding comes from the federal govt, Medicaid is consuming state budgets. It must be reformed to provide #BetterCare https://t.co/6zyuJCa6bk"]["Why do we need to reform Medicaid now? Medicaid spending makes up a tenth of the federal budget. It's an unsustainable trend. #BetterCare https://t.co/4vdfrDI3r1"]["Glad House is working to end dangerous sanctuary cities. Hope Senate acts soon. https://t.co/Q6AljKLxeP"]["ICYMI: What others are saying about reforming Medicaid’s growth rate provision. https://t.co/r91275fnAo #BetterCare"]["On w/@HughHewitt &amp; caller's small biz can't afford healthcare: \"it breaks my heart.\" We must act. #BetterCare https://t.co/K4EzLYJpgs"]["Proud to lead bipartisan Senate effort w/@SenMarkey to condemn Chechnya &amp; Russia on \"honor killings\" of gay men. https://t.co/LJSokceEjA"]["CBO analysis shows @SenateGOP #BetterCare plan ups Medicaid $$$ each year, but averts fiscal crisis, preserves program for next generation. https://t.co/kAW54kZ5IL"]["#TBT to when @SenateDems supported per capita caps to reform @MedicaidGov. #BetterCare https://t.co/bpyYP0b1y4"]["Sending thoughts and prayers to @MikePintekKDKA in his fight against cancer. We're all pulling for you!"]["Coming up soon on @CNN, I sat down with @JakeTapper to discuss opioid treatment and saving @MedicaidGov."]["I disagree—the new sugar deal hikes prices for consumers even more. Here’s why: https://t.co/g2VNiL4Jh8 https://t.co/hWu8ZLA9vI"]["Happening now: Joining @FoxNews to discuss health care reform. Hope you can tune in. https://t.co/FEwzx3O1TZ"]["Glad to see @EPAScottPruitt sign proposal repealing harmful #WOTUS rule. Step in the right direction for farmers, landowners, and small biz."]["Congress is not ending Medicaid expansion. https://t.co/ICzZExUWyt #MythVsFact https://t.co/oakuju6MGf"]["Read my statement on CBO’s score of the Better Care Reconciliation Act discussion draft: https://t.co/An4cXpHdWQ"]["I applaud #SCOTUS for striking a blow against religious discrimination. https://t.co/m5LtR3XwFh"]["You can now read the updated Better Care Reconciliation Act draft here: https://t.co/uZP5NfrcfX"]["ICYMI: Read my op-ed on how the BCRA starts to fix Obamacare's failures &amp; preserves our safety net. Also online: https://t.co/fYCAQTqrBt https://t.co/ECPdb8D5lD"]["Live on @FaceTheNation this morning: Joining @Jdickerson to discuss the Senate's health care draft bill."]["I’ll be on @CBS21News shortly to share my views on health care reform. Hope you'll tune in! https://t.co/8SxLd0x15j"]["Always an honor to meet the young men and women who will be attending our great service academies. Watch the video: https://t.co/AtwDv58pMb"]["Happy that @POTUS signed VA Accountability &amp; Whistleblower Protection Act, which I cosponsored, into law. Veterans deserve the best care."]["Per capita caps are a bipartisan idea. Learn more: https://t.co/6eQNGgn0Z7 #MythVsFact https://t.co/hcIHF50hd8"]["Reducing growth rate does not = cut. Learn more: https://t.co/6eQNGgn0Z7 #MythVsFact https://t.co/DyNmQQDZcD"]["Millions will not be kicked off Medicaid. Learn more: https://t.co/6eQNGgn0Z7 #MythVsFact https://t.co/gd9pRGoiNk"]["Medicaid is not sustainable in its current form. Learn more: https://t.co/6eQNGgECnH #MythVsFact https://t.co/qgVqYfYoeM"]["Congress is not ending Medicaid expansion. Learn more: https://t.co/6eQNGgECnH #MythVsFact https://t.co/L8QT40xjwL"]["There's many myths out there about the Senate's draft health care bill. Here are the facts: https://t.co/6eQNGgECnH #MythVsFact"]["My thoughts on how the Senate bill starts to fix Obamacare's failures &amp; preserves our safety net in @phillydotcom: https://t.co/edVnS5CLWY"]["The discussion draft is up. You can view the Senate Republican Health Care bill here: https://t.co/xtsKDscokx"]["Happening soon: I'll be joining @MariaBartiromo on @FoxBusiness to discuss #healthcare and #taxes. Tune in! https://t.co/md963gDE3p"]["I enjoyed discussing pro-growth policies with @Apple CEO @Tim_Cook today. https://t.co/g9ShJdk2fj"]["Wishing all of my fellow dads a very happy and relaxing Father's Day!"]["Joining @69News for a Facebook LIVE town hallI now! Tweet your questions using #AskSenToomey https://t.co/QbPcYAW3S5"]["Great talking this morning w/local small business leaders in the Slate Belt about how we can best grow our economy and cut excess red tape. https://t.co/87WTrZlakg"]["Extending budget window will enable tax code that spurs robust growth. Glad @senorrinhatch &amp; other lawmakers agree: https://t.co/jxATjReeny"]["I have long supported strong sanctions on Iran+Russia. Proud to cosponsor bipartisan bill that passed 98-2: https://t.co/OmUmbMp6o0"]["Today's @federalreserve announcement constitutes a modest step forward in the long overdue process of monetary policy normalization."]["Glad that others agree this is the best path to true pro-growth #TaxReform https://t.co/UdIWLplVCu"]["Proud to co-sponsor bipartisan bill to strengthen &amp; expand sanctions against Russian government: https://t.co/eE2PPkAXrM"]["How do higher sugar prices help ordinary Americans? They don’t. They only help line pockets of big sugar growers. https://t.co/GvNavPMaHM"]["240 years ago in 1777, the Continental Congress adopted the stars and stripes as the design of our nation’s flag. #FlagDay https://t.co/pxIsYStB4J"]["Keeping @SteveScalise, brave Capitol Police, and other victims in my prayers."]["(2/2) CMS predicts Medicaid savings from House bill are 50% below CBO’s projection: https://t.co/CjnPj19AO7"]["(1/2) Nonpartisan independent CMS actuaries have dramatically different projections than CBO on House bill."]["Reforming the #CFPB &amp; reducing regulations is crucial for increasing credit. My statement on @USTreasury report on regulatory relief: https://t.co/eIcH5pKXwa"]["Sugar agreement struck between @CommerceGov &amp; Mexico is a raw deal. Good for big sugar, terrible for US consumers. https://t.co/rQJMp6al14"]["Always helpful to meet with @NCAforCACs PA members. Was happy to hear how the Crime Victims Fund dollars I fought for have helped CACs. https://t.co/ylCjURJeXL"]["A great meeting w/Col. Van Dootingh from the @911_AirliftWing in Pittsburgh. Excited for the base to house new C-17s! https://t.co/TslrLZ28f3"]["Back to back. Congrats to the @penguins! https://t.co/MDv4g2See3"]["@Penn_State President Eric Barron was here this week to update me about PSU’s Commonwealth-wide economic development initiative. https://t.co/6zTy60KGbA"]["I applaud the nomination of Stephanos Bibas to U.S. Court of Appeals for the Third Circuit https://t.co/WEeFE3YVIj"]["Thrilled that 3 with PA roots were just picked for @NASA's 2017 Astronaut Candidate Class. Good luck &amp; Godspeed. https://t.co/EEnB9WMQnW"]["After PGH &amp; Philly VA scandals, honored to support VA Accountability &amp; Whistleblower Protection Act. Veterans deserve best possible care."]["On this 73rd anniversary of #DDay, let us never forget the bravery of the allied forces who stormed the beaches of Normandy. https://t.co/cznCIfWjsR"]["My thoughts are with the people of London. We stand with our UK friends and allies in the fight against violent Islamist extremism."]["Mulvaney's support for attaching spending reforms to debt ceiling vote is a positive step to restoring fiscal sanity."]["Congratulations to 2017 PA Teacher of the Year, Lebanon's @FoxwellForest! Glad my office could help celebrate your achievement. https://t.co/jkjbUiBMwA"]["Thoughts are w/ Councilman David Oh &amp; family. Wishing him a quick recovery &amp; hope his attacker is brought to justice https://t.co/7OFFTULosm"]["Best of luck to the @Penguins! Let’s make it two years in a row! #LetsGoPens #StanleyCupFinal https://t.co/M0RywdSy3c"]["This #MemorialDay, we honor the brave men &amp; women who paid the ultimate sacrifice for our country and freedom. https://t.co/RXQr02IEsY"]["Saddened to hear of the passing of Sen. Jim Bunning. A @Phillies great, he was the only Hall of Fame MLB player to ever serve in Congress."]["On this #PoppyDay, we honor those who made the ultimate sacrifice. Learn more: https://t.co/gSNQVcQEgI https://t.co/K51PlXwaQJ"]["Reviving the economy requires pro-growth tax reform. Director Mulvaney supports my idea on how we can achieve that: https://t.co/knAqs4Fd24"]["About to go live with @RJHarrisWHP580. Tune in: https://t.co/OEQk1zrdVQ"]["Happening soon: I'll be joining @Varneyco on @FoxBusiness in a few moments to discuss the federal budget. https://t.co/qiAmYd8wgR"]["I support the broad goals of the #TrumpBudget, but there are particulars with which I disagree. Read my statement: https://t.co/35TmZVDuyy https://t.co/4f7w67AWwp"]["On with Sue Henry to discuss issues of the day. Listen live @WILKNewsradio: https://t.co/uZfCS3QPGf"]["Tonight’s attack in #Manchester is a tragedy. My thoughts are with the victims and their families."]["As we celebrate #ArmedForcesDay, let's give thanks to the selfless men + women serving in defense of our great nation. https://t.co/NDBy8qwbq1"]["Joe Lieberman would be a great choice to lead the FBI."]["Kris and I extend our deepest condolences to Deputy Clymer, his family, and the entire Bucks County Sheriff’s office https://t.co/2YyCkfbCLZ"]["I will be on @BloombergTV in a few minutes discussing how we can achieve real tax reform. Watch #Daybreak LIVE on @twitter. https://t.co/I4dWSmDHuL"]["Read my statement on the appointment of Robert Mueller to #SpecialCounsel:\nhttps://t.co/j8xfOgHjvE https://t.co/czjfnAkSVp"]["As we honor #PoliceWeek, thank you to the men and women of law enforcement who keep our cities and streets safe. \nhttps://t.co/sSKFPQilVO"]["@maziehirono Wishing my colleague, @maziehirono, all the best as she wins her fight against kidney cancer."]["Read my statement on reports regarding the president’s handling of classified information: https://t.co/BrlkPvbE7I https://t.co/W3P80E7H8A"]["As we honor #PoliceWeek, I was happy @POTUS reiterated need for police to have equipment they need to keep us safe: https://t.co/mxBmnScyD5"]["Thoughts are w/ kids, parents, &amp; teachers of Philly's C.W. Henry School. Thx to 1st responders like @phillypolice. https://t.co/SSLSmuQv52"]["I hope all the moms out there are having a great #MothersDay!"]["Every day public safety officers put themselves in harm's way. This week I re-introduced 3 bills to support them: https://t.co/I9ncvL2uEi"]["I enjoyed meeting with PA's two @PruSpirit honorees: Lorelei McIntyre-Brewer &amp; Amanda Yang, keep up the great work! #PruSpirit2017 https://t.co/jdSKwCK4JD"]["Congrats to new @US_FDA Commissioner @ScottGottliebMD. We recently met to discuss how innovation can help #EndAlz. https://t.co/GD5QcdHEAg"]["@SenBobCasey &amp; I authored the Saracini Aviation Safety Act to protect passengers &amp; pilots from terrorists. Read more https://t.co/dC1MS9aXcu"]["#OTDIH in 1864: PA's own Elizabeth Cochran, AKA Nellie Bly, was born. She was a pioneer in the field of investigative journalism #PaFacts"]["Read my statement on the $1.07 trillion omnibus spending package: https://t.co/DZTCJs5XJs"]["Thank you @resp_solutions advocates for inviting me to speak about common sense gun legislation to make our communities safer https://t.co/HLpfZzgHz5"]["My @BV op-ed on how we can enact dramatic, pro-growth tax reform: https://t.co/GTuapI3YZf"]["During #CharterSchoolsWeek, it's fitting that D.C. host those who've led the fight for school choice, like Philly’s own @SenTonyWilliams."]["Happy to see House act to give working women in the private sector same job flexibility as govt workers. Learn more: https://t.co/TSqmVDUw5o"]["Honored to be in #KOP w/police officers from across PA &amp; USA to thank them for their great work. https://t.co/f5W9uOjISj"]["Good luck to the kids from PGH’s N. Allegheny Intermediate HS &amp; Winchester Thurston School as they compete in the #NatSciBowl. @DOE_SC_NSB"]["Creation of VA Accountability Office is a great step in the ongoing effort for our #veterans to get the services &amp; help they earned."]["ICYMI: I was on @SquawkCNBC this morning sharing my expectations for the type of plan we need for economic recovery: https://t.co/jTJTMv7kwV"]["Thanks to the members of Tuesdays w/ Toomey and Keystone Progress for taking the time to meet with me yesterday. https://t.co/GQgCvkLckc"]["This plan will promote economic growth, create jobs, and raise wages. My statement on @POTUS #tax proposal: https://t.co/tWSEpii2Hq"]["I’ll be on with @SquawkCNBC in a few mins from the Russell rotunda covering tax reform, health care and the first 100 days. https://t.co/FbvtBFxbT2"]["Yesterday I sat down with @6abc in Philadelphia to provide my take on the first 100 days. Watch below: https://t.co/XtjKCC3ztQ"]["Congrats to @USDA @SecretarySonny He will support PA farming, like our NEPA dairy farms, mushroom farms in Chester &amp; everywhere in between. https://t.co/tXh8jRxqi9"]["As Yom HaShoah begins tonight, we remember the 6 million Jews who perished in the Holocaust. #NeverForget https://t.co/MbeOBWdMaX"]["I’ll be in studio with @SquawkCNBC at 7 a.m. to discuss tax reform, deregulation, and news of the day. Hope you can watch. https://t.co/w9P33yP9a7"]["10/Only 6 more days till #TaxFreedomDay when you've worked enough to pay your taxes: https://t.co/39KWPL6XLs via @taxfoundation"]["9/According to @TaxFoundation, the US has the 5th LEAST competitive #tax code among advanced economies: https://t.co/QkxDRHzaId"]["8/In 1913 standard deduction for family was $98k (in today's dollars). Now, it's $12,600: https://t.co/72DRh1psAD via @taxreformer"]["7/Avg. PA homeowner owes ~$13,200 in federal, state &amp; local taxes (2015 data): https://t.co/MxUbU0lpZi via @NerdWallet"]["6/Tax code compliance takes $409B from the economy: https://t.co/ejbH4UnD5b from @taxfoundation"]["5/An avg. taxpayer spends ~13 hours completing their #taxes: https://t.co/pxgIY3Q1qG from @NTU"]["4/Total size of tax code, including statutory language, regulations &amp; case law interpretations is 70,000 pages: https://t.co/j98j6iFYMl"]["3/Americans will collectively spend more on taxes in 2017 than on food, clothing &amp; housing combined: https://t.co/6PF3lTYB6a @taxfoundation"]["2/Americans' total #tax bill of $5.1 TRILLION = 31% of nation’s income: https://t.co/6PF3lTYB6a via @taxfoundation"]["1/Americans will pay $3.5 TRILLION in federal &amp; $1.6 TRILLION in state/local #taxes https://t.co/6PF3lTYB6a via @taxfoundation"]["On #TaxDay, here are 10 reminders why we need to reform our tax system."]["Thank you @AmRevMuseum for a great history lesson. https://t.co/Y0abTig6Ee"]["A very happy and blessed Easter to everyone celebrating."]["Happy #Vaisakhi to all our Sikh friends across Pennsylvania and the country! https://t.co/qynIFROyIa"]["Russia needs to stop horrendous #humanrights violations and “honor killings” against gay men in #Chechnya: https://t.co/3XufYK6XCx"]["Great to be in Erie yesterday visiting @LORDCorporation, which provides good jobs to hundreds &amp; plays a critical role in our nat. security. https://t.co/WEjCixmgvn"]["In 2015, Senate passed my legislation to keep pedophiles out of schools. Tonight @ABC @Nightline airs ongoing fight: https://t.co/kyPOCJmxfa"]["On with Sue Henry @WILKNewsradio discussing issues of the day &amp; taking your questions: https://t.co/gJeVmCL8YG https://t.co/08hPwEQn17"]["To everyone celebrating, I wish you all a joyous Passover. Chag Sameach!"]["My sympathies go out to those affected by the tragedy in San Bernardino today. No parent should fear for their child's safety at school."]["Thank you @pdsacemail for sharing issues that are important to the PA #Downsyndrome community. https://t.co/527mQ1nPZQ"]["My statement on U.S. action against #SyriaAttacks: https://t.co/TiTo4m5PHe"]["I was proud to join a bipartisan majority of my colleagues in confirming #JusticeGorsuch today: https://t.co/Lykydve8RQ"]["Thanks to everyone who joined my tele town hall tonight! https://t.co/BRUHW7ESvP"]["I will be hosting a Tele-Town Hall tonight @ 5:00 PM. You can listen live &amp; submit questions through thislive link: https://t.co/W6zAZr6jrV."]["10/ If Democrats won't allow Judge Gorusch a vote, they won’t allow anyone a vote. #ConfirmGorsuch"]["9/ Even Justice Clarence Thomas, who was confirmed 52-48, a razor thin margin, was not filibustered on the Senate floor."]["8/ I agree w/@marcthiessen who wrote in @WashingtonPost “the idea that Gorsuch should be the first [filibustered] is patently absurd.”"]["7/ @PittsburghPG is right: “Democrats… should accept reality… they’d end up losing a battle to kill his nomination.”"]["6/ @NYTimes reports “There has never been a successful partisan filibuster of a Supreme Court nominee.” Dems wrong to start now."]["5/ While @SenSanders falsely claims there is a 60-vote standard, @GlennKesslerWP awards #ThreePinocchios: https://t.co/UIWWOKhQd8"]["4 /In a historically unprecedented move, many of my Democratic colleagues have decided to filibuster Judge Gorsuch’s confirmation."]["3/ Judge Gorsuch has the intellect, experience, &amp; broad support across party lines. He will apply the rule of law fairly and equally."]["2/ No equivalence to Garland nom. In 2016 election cycle, Rs abided by Schumer Rule: let voters decide. https://t.co/R1W49Y9vvG"]["1/ Here’s my take on the Dem Minority breaking 200+ years of precedent."]["Will host a tele-town hall tomorrow at 5 PM, barring unforeseen Senate business. Full details will be provided tmrw afternoon on my FB page"]["Spoke with @DomShow1210 @TalkRadio1210 on why we need to #ConfirmGorsuch, sanctuary cities &amp; future of healthcare: https://t.co/vo5r6aVKJl"]["Joining @DomShow1210 this morning at 11:00 AM to discuss health care and Judge Gorsuch. You can listen here: https://t.co/C7HS7WQuyY."]["Joining @SquawkCNBC in a few minutes to discuss financial reform. https://t.co/hCe9UJRsAI"]["Thank you students from The Western PA School for the Deaf for stopping by during your visit to our nation’s capital @WPSD_LionPride https://t.co/6ZakNr0j1r"]["On with Gary Sutton now to discuss Judge Neil Gorsuch’s #SCOTUS nomination. Hope you can listen in: https://t.co/DvZETfGDq9"]["Some great hoops being played in Berks County. Congrats to the women of Boyertown HS &amp; the men of Reading HS on winning state titles!"]["Thank you for your service to our country. RIP Tuskegee Airman &amp; Philly resident Maj. John Harrison Jr. https://t.co/bbLf9rC1tT"]["I'm on right now with Sue Henry @WILKNewsradio. Listen here: https://t.co/uZfCS3QPGf"]["Too many lives lost to opioid, heroin abuse. Thankful @POTUS @GovChristie making it a priority to end #OpioidCrisis https://t.co/yZURn8yiOl"]["Judges apply the law impartially. My Senate speech on why to #ConfirmGorsuch https://t.co/0oBHiPlAr6"]["Thank you @POTUS @VP for signing my bill S.305 into law. Proud to honor our Vietnam Veterans today &amp; everyday. #VietnamVeteransDay https://t.co/zLZcweHOq3"]["Spoke with @AIPAC yesterday on the vital US-Israel alliance and American leadership abroad #AIPAC2017 https://t.co/SgeddsmXaW"]["Stopped by @mikepintekKDKA to answer a few questions. For those that weren’t able to listen, here’s the interview: https://t.co/QCcbQryJBU"]["Learn all the ways to celebrate #NationalCheesesteakDay. I take mine wiz wit. https://t.co/sH7fN9Jx1I"]["The newly confirmed Ambassador to Israel, David Friedman, and I share a passion for a strong #Israel. https://t.co/cb4Kc7h1x5"]["Thanks @WexfordDance and friends for stopping by while you are visiting our nation’s capital. https://t.co/QRdgxyJlYA"]["On Saturday, @RepCharlieDent &amp; I hosted an info session on the U.S. service academies in Hamburg. Great to see so many students interested! https://t.co/yZpNr0mVfN"]["Congratulations Natalia Hajlasz from Allderdice HS &amp; Aaron Yeiser from Perkiomen Valley HS, PA’s 2 Finalists @Society4Science #RegeneronSTS https://t.co/VUMKP8KxUG"]["Best of luck to @TUOWLS_WBB, @Bucknell_WBB, @RMUWBasketball, and @PennWBB as the @NCAAwbb tips off this afternoon. #marchmadness"]["Good luck to the reigning, defending champs, @NovaMBB &amp; to this year's Cinderella, @Bucknell_MBB. #LetsMarchNova #rayBucknell #marchmadness"]["Thank you @RepGoodlatte @HouseJudiciary for passing my bill to honor Vietnam veterans: https://t.co/JtIY1gMYxb https://t.co/1U4dD328wP"]["Toomey: Make the cruel 'animal crush' fetish a federal crime https://t.co/VDaFWikJ8m via @thephillyvoice"]["Today @SenBlumenthal and I reintroduced the PACT Act banning one of the worst forms of animal abuse @HumaneSociety https://t.co/nNJj11bD0I https://t.co/oafapi5Fa2"]["Due to bad weather, my offices in Philly, Allentown, Scranton, &amp; Harrisburg are closed today. Stay safe if you're venturing out."]["PA women have played an invaluable role shaping our country; today\nwe celebrate their work. #InternationalWomensDay https://t.co/T1LRAJFcbB"]["Thank you for your support @ADLPhiladelphia. Threats based upon religion are heinous and are unacceptable. https://t.co/qMArCo63aU"]["Great to meet with @IAFFNewsDesk firefighters from PA today. Proud of these first responders keeping PA safe. https://t.co/WXMMUHJBXG"]["Discussed unacceptable anti-Semitic threats w/ @JFedinPhilly &amp; other community leaders yesterday &amp; how we can best address this problem. https://t.co/A95DipZjhL"]["Sam and Robert in my office met with members of Delta Sigma Theta from 21 PA colleges. Topics: HBCUs, health care. https://t.co/FqQv9QWqvm"]["Just met with leaders from Philly’s Tuesdays with Toomey group.  Constructive discussion. Thank you for the feedback."]["Stopping by @CBSPhilly to answer a few questions -- some from social media. Live streaming at about 2:10 today https://t.co/qkAfjhPQjf"]["Great to meet w/@PAFarmBureau &amp; Future Farmers of America. Need tax reform &amp; stop excessive regs on PA farms that + $7.5B to state econ https://t.co/3hnAejBYdX"]["Thanks @BPC_Bipartisan for first-ever legislative action award for working across the  aisle https://t.co/bjZ1vsFutr"]["Productive meeting w Angela Zimmerlink, Vincent Vicites and Dave Lohr- Fayette Co Commissioners about economic development in their county. https://t.co/oqQPcUlPdS"]["My full statement regarding the #JointAddress @POTUS gave tonight are here: https://t.co/xIfzUnMAVO https://t.co/b7eu8D68DQ"]["I thought @POTUS gave a hopeful, optimistic, forward-looking message. #JointAddress"]["Appreciated the visit with @GovernorTomWolf. Constructive dialogue on issues important to PA including health care and infrastructure. https://t.co/4RpJu7PcBH"]["ICYMI: My Pittsburgh office is moving Downtown next week to the Grant Building. Full details here: https://t.co/iet1ANwm8R"]["Anti-Semitic acts and crimes based upon religion are heinous and intolerable. Hoping for a swift investigation. https://t.co/c8SfrQLom1"]["Acts of hate &amp; intolerance, such as what happened in Philly last wknd,are disgusting &amp; have no place in our society. https://t.co/Z7Jm7DWhCc"]["Thx to the leaders of PGH's Tuesdays w/ Toomey group for taking the time yesterday. Looking forward to additional meetings across PA soon. https://t.co/7ac3Z2lHoB"]["Had a productive meeting yesterday w/ members from @TuesToomeyHBG at my HBG office. Looking forward to similar meetings in the future. https://t.co/zh2b3J4mSi"]["democratic capitalism to all other systems. I had the honor of meeting him several times. A kind and gracious man too. RIP. 2/2"]["America lost a giant yesterday. Michael Novak, a man of deep faith, explained the moral superiority of 1/2"]["Good to meet Judge Gorsuch today. He is eminently qualified for #SCOTUS https://t.co/cYHlGeWeAu"]["Saddened to hear of Al Boscov's passing. He was a terrific leader and community partner. My condolences to his family."]["Due to the weather, my offices in PA may be a bit late opening this morning. Be safe out there."]["Glad you stopped by @G_Dahlkemper https://t.co/6elfUsO8RS"]["I introduced Dr. David Shulkin at his hearing to be the head of the VA. Our vets should be first in line for the best care. https://t.co/tBDKrwKyWM"]["My statement on the nomination of Judge Neil Gorsuch to the U.S. Supreme Court: https://t.co/rcpdTgOZ3J"]["Congrats to @SenWarren &amp; Patriots. Paid AFC bet with Penn Pilsner beer @PennBrewery.  Our @steelers will be back next year. https://t.co/xHB79gw2S5"]["Marta from my Allentown office was in Lehighton helping veterans today. https://t.co/Ns6c5ncnaE"]["My statement on Executive Order concerning entry of foreign nationals to the U.S.: https://t.co/vp1LzRecll"]["#holocaustremembrance #NeverForget https://t.co/Uk5HXaItta"]["Patriots had @steelers number last night!  Will pay my debt to @SenWarren with Penn Pilsner Beer @PennBrewery"]["One more win and Pittsburgh's going to the Super Bowl. #HereWeGo https://t.co/vHZ55XrSLw"]["Read here: my reaction to @POTUS @RealDonaldTrump’s #Inauguration https://t.co/z7qeqqQUAh https://t.co/wQe7heXRg3"]["Thank you to the PA National Guard units helping at the Capitol today"]["Last week I wrote this op ed about how we can help keep our children and our communities safe #StopSanctuaryCities https://t.co/uKBWKXLBOQ"]["Looking fwd to a @SamuelAdamsBeer courtesy of @SenWarren after the @Steelers hand the @Patriots a deflating L on Sun https://t.co/Dl8vZoONyw"]["Productive meeting with @realDonaldTrump nom for Securities &amp; Exchange chm Jay Clayton. https://t.co/AK4ZnMX1DI"]["Seema Verma @realDonaldTrump pick for CMS stopped by today.  Good talk about Medicare and Medicaid. https://t.co/FPQg00qkxf"]["#HereWeGo https://t.co/HlVoazm2Ta"][".@AlexsLemonade does a terrific job in the fight against pediatric cancer. Kris &amp; I were honored to join them last night at the Lemon Ball. https://t.co/Fjoj4PMuC1"]["Delighted to speak to OMB nom @RepMickMulvaney about how we can help @realDonaldTrump get fed budget in order https://t.co/JksMGp9tDE"]["My friend @RepTomPrice will be a superb HHS sec.  MD and true leader on HC reform that puts patients 1st. Great pick by @realDonaldTrump https://t.co/019ovzLH2D"]["Enjoyed visiting with @RealBenCarson-- @realDonaldTrump nominee to be HUD secy.  He is a good man with an incredible life story https://t.co/5WyhkfJrFH"]["PA Farm Show fun with Kris and Duncan. Next stop....milk shakes. https://t.co/MhXthJVEn7"]["Had the great honor of serving with @SenDanCoats. Terrific choice for Director of National Intelligence! Good pick by @realDonaldTrump."]["Great to meet Treasury secretary nom @stevenmnuchin1. Discussed encouraging stronger econ growth: reforming tax code &amp; rolling back regs. https://t.co/ifKAcYUizA"]["Happy to have sweetest seat in #Senate.  I am keeping the coveted Candy Desk. Will be full of PA’s best chocolate. @CandyUSA"]["WATCH: Check out this behind-the-scenes look at my day today as I was sworn in to the 115th Congress. https://t.co/J23FIeVTo5"]["I'm eager to get back to work for the people of Pennsylvania. https://t.co/AlPhldS87z"]["Wishing all Pennsylvanians a safe and happy New Year! https://t.co/uZBH59DctU"]["Kris and I extend our deepest prayers and condolences to the family of Trooper Landon Weaver and the @PAStatePolice. https://t.co/1MI9CXvdj8"]["Check out @HaverfordLib’s exhibit, “World War I &amp; America” starting January 2nd! https://t.co/lj1c088QNs"]["From my family to yours - merry Christmas! https://t.co/PzQNSzsnkQ"]["To all those celebrating -- happy Chanukah!"]["Today's condemnation of #Israel by the @UN is appalling. @POTUS caps off 8 years of indifference towards one of our greatest allies. https://t.co/KX5lY0b9hv"]["Looking forward to Christmas with the family! My favorite Christmas movie is Elf – what’s yours? https://t.co/B2FTPbrr7H"]["My staffer, Imani, helped deliver Christmas gifts to veterans at the Coatesville VA Medical Center! https://t.co/j5kvowFmpN https://t.co/JxyX0cBVLs"]["A strong conservative, as OMB director @RepMickMulvaney will help stop overspending in Washington. Good pick by @realDonaldTrump"]["Glad to have such a young fan! Merry Christmas! https://t.co/mrgbSgJLO3"][".@POTUS’ decision to appt Debo Adegbile to Commission on Civil Rights is a slap in the face to every cop in America. https://t.co/mir9iMNozT"]["The senseless killings at #SandyHook inspired me to work across the aisle on commonsense gun safety legislation. https://t.co/Etr0OD0Fhv"]["Four years ago, twenty young children and six school employees were shot and killed at the Sandy Hook Elementary School. #SandyHookPromise https://t.co/SnVITBPFlk"]["If the Russian government or its agents engaged in an effort to meddle in the U.S. election, they need to face serious consequences."]["That bipartisan panel can get to the bottom of what the Russians did or did not do."]["I am in favor of a vigorous investigation by the Senate Intelligence Committee of the Russian email hacking allegations."]["The PACT Act passed the Senate last week. One major step forward for our effort to protect animals from abuse. https://t.co/Ko01jXfRMg https://t.co/N3foho68BK"]["Also, Pennsylvania became the second state to ratify the Constitution in 1787! https://t.co/gtMfZr4cYv"]["#Philly Officer Danny Faulkner was murdered 35 years ago today. His memory lives on. https://t.co/9YpUiAZVhO"]["Joining @SquawkCNBC in 3min from Russell Rotunda in Washington. https://t.co/tZ1j34AH7s"]["We need to stop taxpayer bailouts &amp; costly red tape. Reforming #DoddFrank by all means necessary must be a priority. https://t.co/2CFulOxVMt"]["#NDAA = resources to train/equip our warfighters. Must help men and women who protect us and defeat threats from violent Islamist extremists"]["Great visit with @CongressmanGT and Keystone Little League (Clinton Co.) at the @uscapitol today! https://t.co/o8AmBNNovE"]["#OTD in 1941, #PearlHarbor was attacked. The anchor of the USS Arizona – cast in Chester, Pa. – is on display at the memorial. https://t.co/r8jxDIT1Fx"]["What a comeback!! Amazing game by @PennStateFball! CFP game next? I think so! #Big10Championship #WeAre"]["Good luck to @PennStateFball! Ready for PSU to bring the #B1GChampionship back to PA! #PSUvsWIS"]["Congrats to @Temple_FB on winning the American Athletic Conference! Great win by a great team!"]["#IranSanctionsAct ensures next POTUS can reimpose strict sanctions on the world’s leading state sponsor of terror. Proud to support it."]["Arnold Palmer represents the best of PA. I’m happy the Senate honored him w/ bipart res intro’d by @SenBobCasey &amp; me https://t.co/rBplizklod"]["My friend @RepTomPrice will be superb HHS Sec. MD and true leader on real HC reform that puts patients first. Great pick by @realDonaldTrump"]["Philly's extreme sanctuary city policy is dangerous. We must end SC policies &amp; I'm committed to leading this fight. https://t.co/luoI21RcTO"]["Tomorrow is #SmallBusinessSaturday! I encourage you to visit the small shops, family-owned businesses, and restaurants in your hometown."]["Happy Thanksgiving Pennsylvania, and God bless America."]["On #Thanksgiving, remember the sacrifices of men and women of great character who settled, founded, and defended our country."]["Champion of school choice @BetsyDeVos. Great pick by @realDonaldTrump for education secretary. Look forward to working with her."]["Proud of our brave firefighters who battled the Mount Penn blaze and got it under control quickly."]["My friend and colleague @SenatorSessions has my full support to be the next U.S. Attorney General. https://t.co/Bky9tjECNA"]["My staff surprised me for my birthday today – and my son Duncan (six) discovered the birthday cowboy hat! https://t.co/W3BpNbJLfG"]["“You can't drain the swamp by feeding the alligators pork” Earmarks are a waste of taxpayer $ Glad @SpeakerRyan upholding House ban"]["Hear @DavidJUrban is in the running for RNC chair.  He’d make a good one."]["We owe our veterans a debt of gratitude we can never repay. On this #VeteransDay, be sure to thank the veterans in your family and community https://t.co/JeYnRzx12R"]["Happy birthday @USMC! https://t.co/oXh98AXHGF"]["We are reminded of the dangers they face–2 l.e. officers were shot –1 fatally. Kris &amp; I pray for the wounded officer &amp; send our condolences."]["I can't say it enough: our l.e. officers bravely sacrifice their safety every day to protect our communities. 1/2 https://t.co/2knZrie3cC"]["Proud of PA’s Jaindl Farms &amp; B. Braun for teaming up to help the people of Haiti after #HurricaneMatthew. https://t.co/u2Nj31SNrK"]["More bad news for Pennsylvanians due to #Obamacare. https://t.co/e3aQhash62"]["Kris &amp; I extend our heartfelt condolences to SFC Gloyer's family and friends."]["SFC Gloyer died courageously defending our country in Afghanistan, making what Abe Lincoln described as \"the last full measure of devotion\""]["Congrats to Hazleton, PA’s own @CubsJoeMadd on an amazing #WorldSeries win with the @Cubs. #CubsWin"][".@washingtonpost Kris and I pray for the fallen officers and their families."][".@washingtonpost They also provide yet another example of the risks our law enforcement officers face to protect the rest of us."]["The fatal ambush attacks on two Des Moines police officers early this morning have no possible justification. https://t.co/66WiX3Pur9"]["Happy Halloween! My son Duncan will be trick-or-treating as General George Washington tonight, and will march in his school’s parade today! https://t.co/y5Kqd0qjBc"]["Honored to be recognized for my support of farmers by the @PAFarmBureau. One of my LV staffers, Marta, accepted the award on my behalf. https://t.co/kQt4BOi8tA"]["#FBF: When you lose a bet to a @Cubs fan after seeing your @Pirates fall short in the wild card game #Buccos https://t.co/FGvutZroIz https://t.co/UFgboXZSyq"]["Health costs for PA are skyrocketing. We must replace #Obamacare to protect families from being forced to pay what they can’t afford. https://t.co/ZI5YELktNJ"]["Wishing former U.S. Senator and @Phillies great Jim Bunning a speedy recovery. https://t.co/60ns6x0e68"]["I’m proud to stand with the Lackawanna County Commission for Women to keep our communities safe. My sincerest thank you for this award. https://t.co/ck476Sks2M"]["The Admin.’s own actuaries confirm #Obamacare premiums rising 25% next yr https://t.co/XNkkMPWA4w"]["Proud to be named a \"Taxpayers' Friend\" by @NTU! I will continue to fight for lower taxes and less government red tape. https://t.co/NppuD3xynI"]["Glad Steve from my Pitt office could attend an event to showcase after school programs for kids. Here they are building a car with K’NEX! https://t.co/VyWZrFQlFj"]["I've been fighting to keep prescription drugs off our streets &amp; you can help! Tomorrow is #NationalDrugTakeBackDay https://t.co/YiGF2WNcrr https://t.co/2cdUfx5BX5"]["Saddened to hear of passing of @PhillyPolice Ofcr Douglas Bamberger.Kris &amp; I send our condolences to his wife &amp; kids https://t.co/9dXoj6IDnM"]["Read my statement below on the skyrocketing Obamacare premiums. https://t.co/2AmyrvrYuE"]["That’s why I support bipartisan legislation that holds VA employees accountable. Learn more here: https://t.co/ZvPYnenGjv"][".@POTUS said he’s holding VA bureaucrats accountable. What did the @washingtonpost think of that? https://t.co/BbaXzyLxUq https://t.co/fjrOqEeq4T"]["-@GovMarkDayton in 2011: Fully embraces #Obamacare.\n-Gov. Mark Dayton in 2016: Obamacare \"no longer affordable.\"   https://t.co/9KahlYpKho"]["Thank you to all our hardworking farmers across Pennsylvania and the country! #NationalFarmersDay https://t.co/UMq5kT5bu8"]["To all those celebrating #YomKippur - may God see fit to inscribe you in the Book of Life for another year!"]["Glad my state staff was able to celebrate #ManufacturingDay at businesses across Pennsylvania! https://t.co/CbfWtKJDnd"]["Lord Stanley’s Cup made it to the Capitol this week! Brad from my D.C. office (originally Pittsburgh) wasn’t able to contain his pride! https://t.co/m91gkg8KUr"]["Glad to sign a bipartisan letter to @USDA Sec. Vilsack urging him to protect horses from soring. https://t.co/ZZevEdJpAP"]["Great news! I was glad to support this effort and assist the brave men and women who keep us all safe. https://t.co/tkoSKQVXiA"]["Had a great time at the 22nd Annual Pocono Prayer Breakfast this morning! Thanks for hosting me! https://t.co/SOQ4V7i8m7"]["On Saturday, my staff welcomed home nearly 200 Vietnam vets after their Honor Flight trip to Washington, D.C.! #HonorFlight https://t.co/MxUkLEVKtQ"]["For all those celebrating Rosh Hashanah - may you have a good year! https://t.co/U0ejNBuaYC"]["Glad my Philly staff attended an event today to kick off Domestic Violence Awareness Month! https://t.co/dUgFN6l9G7"]["This is an incredible story. @RepTimMurphy saved a man’s life at the Capitol this week. https://t.co/KnkjnLRx0S"]["We know the Steel City is celebrating #NationalCoffeeDay today! They are the 5th most caffeinated city in the US! https://t.co/h5801LkORw"]["Terrible news coming out of Hoboken, NJ this morning. My thoughts are with those hurt in this serious train crash."]["Glad I had the opportunity to sign the condolence book in memory of Shimon Peres – a true statesman. https://t.co/kmSbRVMtTT"]["Today, @SenBobCasey and I introduced this bipartisan resolution to honor The King. https://t.co/mKMMV0BHWW"]["Thanks to all who attended #LibreRally to bring attn 2 animal abuse.Thanks 2 Speranza Anml Res &amp; @HumaneSociety fighting to end animal abuse https://t.co/ltVp9TCM9V"]["My statement on the Senate vote to override the president’s veto of the Justice Against Sponsors of Terrorism Act. #JASTA https://t.co/EYw4x3go4K"]["A Nobel laureate and a force for peace, Shimon Peres’ deep and abiding commitment to Israel's people and security will never be forgotten."]["My statement on the heartbreaking loss of Arnold Palmer. #TheKing https://t.co/fRUD3oacId"]["I called on the Senate to pass my bipartisan bill to protect animals from abuse – but @SenatorReid blocked it. #PACTAct https://t.co/Q9dKm3izDq"]["Glad my Philly staff could attend a ceremony to honor fallen Philly Officer Walter DeWitt. His memory will live on. https://t.co/6Q275650Kt"][".@POTUS’s war on coal has put health care benefits at risk for thousands of Pennsylvania miners. https://t.co/Mmy4rDEMF5"]["The American people deserve answers on the $1.7 billion cash payments to Iran. https://t.co/BKSzSwEMH1"]["Happy @Penn PO Ed Miller &amp; @PhillyPolice Sgt. Sylvia Young are out of the hosp &amp; recovering at home.They deserve thanks for protecting us. https://t.co/icPSASCXPu"]["What @WellsFargo did was not cross-selling – it was fraud. https://t.co/5e1HVxxZe7"]["We cannot allow these recurring terrorist attacks to become the new normal. https://t.co/ObRGGjMdy1"]["It's time for Philly to heed calls of leaders from across the pol. spectrum &amp; end dangerous sanctuary city policies https://t.co/p7Of61YphS"]["Last night, #Philly cops were attacked for no apparent reason other than the uniform they wear. https://t.co/4kARkkocHG"]["#OTD in 1787, Pennsylvania’s Ben Franklin was among 39 signers of the U.S. Constitution. https://t.co/XPbFnlhu4m"]["My staff is out helping constituents today at State Sen. Vulakovich’s senior expo in Western PA! https://t.co/FHVtgcEEk2"]["They are not forgotten. #POW #MIA https://t.co/BXynZaFqc4"]["Obamacare is full of broken promises. Pennsylvanians shouldn’t suffer because of them. https://t.co/3oX0i1VvI2 https://t.co/mJeDA3QVWg"]["Proud to be named a “Guardian of Small Business” by @NFIB! https://t.co/Zhr6T3CzAx"]["Here's my statement on #WRDA - a major bipartisan win for Pennsylvania! https://t.co/IDyWyZVrQt"]["Visiting DC? Set up a @uscapitol tour through my office! https://t.co/AkeaNEhI3v https://t.co/Nvynq95H5E"]["My thoughts are with former Israeli President Peres and his family – wishing him a quick recovery."]["Congratulations to @PGHSnews's Bill Ziegler - Pennsylvania Principal of the Year! https://t.co/dC6aQA2IGi"]["Glad my staff could honor a hero by attending the ceremony to dedicate the new Bryon Dickson Memorial Garden. https://t.co/vFsqsCZKiW"]["We gathered in Somerset County this morning to remember the brave men and women aboard #Flight93. #NeverForget https://t.co/5dfF6Lq2d9"]["I was honored to be in the presence of the friends &amp; families of the heroes of Flight 93. #Flight93 #NeverForget https://t.co/suO6BaqApN"]["Tomorrow I will be at @Flight93NPS to honor the brave men and women aboard that plane who saved American lives. #NeverForget"][".@FolcroftPD Officer Dorman is back on duty tonight! You, and your entire department, are in our thoughts. Thank you for your service."]["My staff is out and about in PA! Glad my Lehigh Valley manager, Marta, can help folks navigate federal agencies. https://t.co/NputF5e9U0"]["Thank you @john_walsh for supporting my effort to keep our children safe in school. https://t.co/EwwQ80E9G3 https://t.co/X9YRX8OEKg"]["We must move this bipartisan measure forward quickly to solve an urgent problem. I caught up with @WPXI to discuss. https://t.co/zPjodbYgrU"]["While the Miners Protection Act is not perfect, I will vote in support of it in the Finance Committee later this month."]["Now, thousands of coal miner retirees in our state are in imminent danger of losing their health care benefits too."]["Due to @POTUS's relentless war on coal, many Pennsylvania energy jobs have been lost."]["As @SalenaZito departs the Trib, here’s her piece on @SenBobCasey and I working together for PA. Good luck Salena! https://t.co/R6eyi0WXFV"]["Today we pause to celebrate the achievements of the American workforce. Have a happy and safe #LaborDay! https://t.co/YF5LYfHOdM"]["Congratulations to all the athletes from PA who participated in #Rio2016! You made PA and the entire country proud. #Olympics #PAProud"]["Congrats to Nazareth's @JoeKovacsUSA on his #silver medal in the #shotput! PA bringing home more hardware! #Olympics #Rio2016"]["Cheering on PA's own @JoeKovacsUSA &amp; @B1GHomie in the men's #shotput today in #Rio2016! #PAProud #Olympics #trackandfield"]["Great performance by PA's @ItsPooda in the hurdles last night in #Rio2016! #Silvermedal #Olympics #trackandfield"]["We should dump the #TPP &amp; get an agreement that would create jobs and economic growth here at home. https://t.co/v6NAgCkPgA"]["If you're in #Pittsburgh, look for my column in today's @PittsburghPG: #TPP Falls Short. https://t.co/ds6vZbctOa"]["#TPP is not a good deal for Pennsylvania, and I cannot support it. https://t.co/v6NAgCkPgA"]["Another Olympian from PA bringing home the gold! Congrats to PA's @arpolk and @usrowing on the gold! #rowing #RowingInRio #Rio2016"]["Congrats to Philly's @MChamleyWatson who is bringing home a bronze medal in #fencing ! #Olympics #TeamUSA #Rio2016 #PAProud"]["WATCH: I joined the @oreillyfactor to discuss my effort to end dangerous sanctuary city policies. @FoxNews\nhttps://t.co/65O6ouYdLD"]["What a race! #TeamUSA wins #Olympics Gold in the 4x200!@lgsmith19 &amp; @CierraRunge are bringing gold back to PA! Congrats! #swimming #PAProud"]["Ready to cheer on Spring Grove's @Hali_Flickinger as she competes for a medal in #swimming at the #OlympicGames tonight! #TeamUSA #PAProud"]["Congrats to @Hali_Flickinger on making it to the 200M Butterfly final! Way to make PA proud! #Olympics #TeamUSA #PAProud"][".@USAFieldHockey has 10 players from PA &amp; just won their 2nd game in the #OlympicGames Coincidence? I don't think so. #TeamUSA #PAProud"]["Cheering on Philly's Kyle Lowry with the #USMensBasketball team against #China. Let's Go #TeamUSA #Olympics2016"]["Another great win by @ussoccer_wnt! Go #TeamUSA #RioOlympics2016"]["Are you watching the @ussoccer_wnt match tomorrow? Look for the great play of Pennsylvania's own @meghankling! #OlympicGames #USA"]["Excited for the #Olympics #OpeningCeremony tomorrow? Stay tuned as we showcase the 30+ Pennsylvanians participating in the #2016Olympics!"]["Today I got a preview of the equipment @HaverfordPD will showcase at tonight's #NationalNightOut https://t.co/jaGqEz1JLm"]["Saddened by the death of Judge Franklin Van Antwerpen. He was a dedicated public servant &amp; an inspiration to lawyers &amp; judges in the LV. 1/2"]["WATCH:My new legislation would hold China accountable for illegally sending the deadly opioid, fentanyl, to the US. https://t.co/zQXuDc4t2v"]["My deepest sympathies to the family and friends of Captain Robert Melton. #KansasCity"]["Another police officer killed in the line of duty today in #KansasCity. Another terrible loss for the law enforcement community."]["We owe the men and women in blue our gratitude and support everyday. They need our prayers. #BatonRouge"]["Kris &amp; I are heartsick to learn of yet another attack on law enforcement, this time the murder of police officers in #BatonRouge. 1/2"]["Sen. Toomey Releases Statement on Terrorist Attack in #NiceFrance https://t.co/GvJoPh8qvM"]["Great to meet Connie Karasow, #ALZ caregiver from Bucks County, today at my hearing on Alzheimer's. @alzassociation https://t.co/qd21aHXOuF"]["My son Duncan was a critical component to defeating @SenJohnThune's team in softball last night. https://t.co/X3xwdYOLqu"]["Sanctuary cities should not be rewarded with federal money. #StopSanctuaryCities https://t.co/eSdLLlFICE"]["Great visit to the @PAStatePolice Academy Camp Cadet program today! https://t.co/ppuXJFgmUa"]["The disgusting attack in #Dallas has no possible justification. https://t.co/NFKZdyh5WQ"]["Today the Senate votes on my sanctuary city legislation to protect Americans from dangerous criminals &amp; terrorists.\nhttps://t.co/f8HQMbDDDM"]["Philadelphia - the birthplace of American Democracy. Happy Fourth of July! https://t.co/OPmPjKLqDo"]["Prayers for #Dhaka"]["#OTD in 1863, the largest military conflict in North American history began at @GettysburgNMP. https://t.co/dsDXARdHrf"]["Thanks @oreillyfactor for highlighting my bill to protect Americans and proud to stand with you on Kate's Law. https://t.co/LMGFp1sqkg"]["Just FYI - #Hoagiefest is back at @Wawa... https://t.co/dC2w6yyE9G"]["Glad to visit @FolcroftPD Officer Dorman today. I'm thankful he has made such a remarkable recovery. #delcolegend https://t.co/65KPirIgSi"]["My condolences to the families of those killed &amp; praying for the recovery of those wounded by the terrible terrorist attack in #Istanbul"]["Keystone Cup called due to rain. Ended 4-4 in bottom of the first. Stay tuned for rescheduled game!"]["We'll be debuting our new hats! What do you think? https://t.co/ui2gzfgfb7"]["TONIGHT: Hit It Toomey takes on Penn Is Mightier (@SenBobCasey) in 2016 Keystone Cup! Check back for updates regarding weather. #Softball"]["Buddy Ryan will be greatly missed, but forever remembered. https://t.co/4rSX2jlMtY"]["Saddened to hear about the passing of Pat Summitt. We must do all we can to #EndALZ."]["Happy my SEPA manager could be on hand to welcome home Ofc Dorman. Grateful for his recovery #dormanthedelcolegend https://t.co/J26hk1UbpE"]["Our thoughts are with the @FolcroftPD Officer shot today in the line of duty. Praying for a full recovery. https://t.co/puMvgtDfs3"]["To truly get things done, we need to find a way to work together and not just talk past each other. https://t.co/wFWQAgo9ea"]["Best of luck to @ussoccer on their semifinal game in the #CopaAmerica! #OneNation #USAvARG https://t.co/aFIXKcIJPV"]["I commend @SenatorCollins and urge my colleagues to support this important bipartisan effort. https://t.co/j9YxXmJHWx"]["I met Elijah Rodriguez today. Wasn't prepared for the force behind his high-five. https://t.co/eSup18gNwz"]["Last night's votes were nothing more than a partisan charade. Today, bipartisanship is needed more than ever. https://t.co/s5z37oFNgg"]["WATCH: I'm working to bring my colleagues together to keep guns from terrorists and protect the 2nd Amendment. https://t.co/mKVKKscJzK"]["We need understanding from both sides &amp; political courage to prevent more senseless deaths. https://t.co/XU09mhN3SY https://t.co/vrE4DVxuR5"]["Wishing all the dads out there, especially mine, a very happy #FathersDay!"]["Hope we get in a lot of golf today at @usopengolf #USOpen Oakmont and #Pittsburgh great hosts."]["WATCH: Here are the two things I am trying to achieve with the Fighting Terrorism &amp; Upholding Due Process Act.\nhttps://t.co/15sricfRTS"]["Read about my commonsense legislation - the Fighting Terrorism &amp; Upholding Due Process Act: https://t.co/3lMGpODTab"]["I just introduced a bill to help keep guns from terrorists &amp; protect law-abiding Americans. https://t.co/3lMGpODTab https://t.co/V2IhyYp7dE"]["Tomorrow, I will introduce legislation to help keep guns from terrorists and protect law-abiding Americans. https://t.co/VeWImeBQgv"]["We must work together to keep guns from terrorists while protecting the 2nd Amendment.\nhttps://t.co/75yPsPSvZC"]["We need to keep guns out of the hands of terrorist while protecting 2nd Amendment rights for law-abiding citizens.\nhttps://t.co/KUGp13qyNV"]["So glad some of my Pittsburgh staff could attend the #PensParade! Way to go @penguins! https://t.co/xvwwJMx5eA"]["This morning I signed a condolence book for the community of #Orlando that is being signed by senators and staff. https://t.co/KHXPbYvEm2"]["Army Specialist, PA native, and MoH recipient Ross McGinnis would be 29 years old today. https://t.co/H4RiubkVMN"]["Proud to introduce S Resolution w my colleague @SenBobCasey to congratulate the @penguins on bringing home the Cup! https://t.co/PaZY4CzRlS"]["On this day in 1777, the Continental Congress adopted the Stars and Stripes. #FlagDay https://t.co/krQnrKDJpv"]["Heartbreaking to learn a young Pennsylvanian was among the victims in Orlando. Kris &amp; I are praying for her family. https://t.co/TLNyi32x5L"]["My Scranton staff stopped by @AlexsLemonade stand. Kayla raised over $5000 in the last 4 years for @AlexsLemonade. https://t.co/vLknTfvdLZ"]["Congratulations to the @penguins! The 2016 Stanley Cup Champions! #StanleyCup"]["Best of Luck to the @penguins! Hoping they can bring the Cup back to PA! #LetsGoPens #StanleyCupFinal"]["Law enforcement officials are investigating this shooting as an act of terrorism &amp; it appears to have taken many lives. 2/3"]["My heart goes out to the loved ones of those murdered at the nightclub in Orlando this morning. 1/3"]["Looking forward to rooting on the @penguins to one more victory tonight! #LetsGoPens #StanleyCup https://t.co/ccvZ3ZOyrw"]["My thoughts are w the York Sheriff's Dep who was shot &amp; wounded this am. A constant reminder of the sacrifices our L.E. make to keep us safe"]["#USOpen in Pittsburgh/Oakmont next week  PA also hosting @USGA 2016 #USWomensAm in Springfield #USMidAm in Elverson #USWomensMidAm in Erie"]["Reminder of the constant threat of terrorism our Israel allies face everyday. My prayers are with the families of all who were affected."]["Some pretty creative stuff from the @Pirates with this @GameOfThrones themed intro. Take a look! https://t.co/NLY7mYuPZJ"]["The Senate is continuing its work to fight the opioid epidemic and save lives. https://t.co/h4YXeiZQMY https://t.co/gUh1vKVqIw"]["\"Here, the Allies stood and fought against tyranny, in a giant undertaking unparalleled in human history.\" #Reagan https://t.co/MWPKEnNsrG"]["#OTD in 1944, General Eisenhower drafted an \"in case of failure\" letter if invading Normandy was unsuccessful. https://t.co/kzMEleRRbx"]["The @penguins are off to a great start in the #StanleyCup! Keep up the good work!"]["Honored to attend #MemorialDay2016 events in Macungie &amp; Ft Washington to honor those who sacrificed for our freedoms https://t.co/VjXMm4wPJ8"]["This #MemorialDay, read about Specialist Ross McGinnis - a PA hero and MoH recipient. https://t.co/XOkX10280c https://t.co/QlI0Q0TuSY"]["My statement on today's report of a Pennsylvania woman with an antibiotic-resistant superbug. https://t.co/yJHMlAkYLL"]["Once again, @POTUS's promise that premiums would fall $2,500 has been broken. #Obamacare https://t.co/5YyTSrBXwG"]["WATCH: Today I challenged the Obama Administration’s reckless pursuit to re-integrate Iran into the global economy.\nhttps://t.co/Ehy1B6lS6N"][".@POTUS will host the Villanova men's basketball team at the White House next Tuesday."]["China needs to stop exporting fentanyl. Read more about my effort to stem the opioid epidemic in the @PittsburghPG. https://t.co/ViXjiA1tyc"]["Statement: Respect Baltimore Verdict and Judicial Process, Don’t Rush to Judgement https://t.co/YmZB0hg2qa https://t.co/74TvITQAyr"][".@google should apologize and exercise more discretion before it decides to honor someone who supports a cop killer and terrorists."]["Ms. Kochiyama supported cop-killer Mumia Abu-Jamal and Osama bin Laden. @google https://t.co/Xl69enFVZT"][".@google should “Google” who it honors. Yuri Kochiyama is no hero. https://t.co/Xl69enFVZT https://t.co/N1SONTOqae"]["Today I voted to fund resources for our veterans, infrastructure, and the 911th Airlift Wing in Pittsburgh. https://t.co/a9O3f3yNDn"]["WATCH: We must end dangerous sanctuary city policies.\nhttps://t.co/zJAdp5Zdrl"]["The people of America deserve better. We must end dangerous #sanctuarycity policies. https://t.co/tOWkUNHPUz https://t.co/Lnu1Qha5B9"]["The Newhard Farms Corn Shed corn was a hit at last night's #MODGourmetGala! Kris, Bridget, and I had a great time. https://t.co/vOaPL0iRFO"]["The corn is coming from Newhard Farms Corn Shed right outside Allentown. Going for Regional Ingredient Award Winner!"]["Kris and I are heading to #MODGourmetGala. We are making Corn Chowder with Shrimp for the competition. Glad to support March of Dimes."]["My statement on Senate passage of the energy &amp; water funding bill. https://t.co/xvNW6riLMm"]["One year later, we remember the lives lost in the deadly #Amtrak 188 derailment."]["Great visit with @ArmyWarCollege students today! https://t.co/SaTTWZekHS"]["WATCH:The Senate passed my #bipartisan bill to make it easier for kids of fallen heroes to achieve higher education.\nhttps://t.co/hLCEuKOHW9"]["#AmberAlert now includes Missouri. @clairecmc &amp; @RoyBlunt please RT! https://t.co/PHB8Im4Cxo"]["#AmberAlert in Rogersville, TN. @SenBobCorker @SenAlexander please RT! https://t.co/emrrl20BXx"]["Robert Wilson III - @PhillyPolice. End of Watch: March 5, 2015 #NationalPoliceWeek https://t.co/Ixht6G0RxT"]["Paul Koropal - Allegheny County DA's Office. End of Watch: May 5, 2015 #NationalPoliceWeek https://t.co/5iqNGPh4z9"]["Lloyd Reed - St. Clair Township PD. End of Watch: November 28, 2015 #NationalPoliceWeek https://t.co/1ZQ2wnDhjb"]["John Wilding - @ScrantonPolice. End of Watch: July 12, 2015 #NationalPoliceWeek https://t.co/EBtHU2jTD1"]["Eric Eslary - Ligonier Township PD. End of Watch: May 5, 2015 #NationalPoliceWeek https://t.co/5vbvbcnUZ3"]["The @NLEOMF added the names of five Pennsylvania police officers killed in the line of duty in 2015. #NationalPoliceWeek"]["Statue of Freedom flanked by the flags of U.S. Army infantry divisions that liberated Nazi concentration camps. https://t.co/UbHebYCtNi"]["Congratulations to #Philly Officer Jesse Hartnett on being named \"Man of the Year\" by National Police Defense Foundation! You make us proud."]["#HolocaustRemembranceDay https://t.co/6X7bJNA7N3"]["Thank you to all of our firefighters across Pennsylvania! #Internationalfirefightersday https://t.co/JXPHcjQUAC"]["ICYMI: @69News covered my press conference on a bipartisan effort to reduce the heroin and opioid epidemic.\nhttps://t.co/kWP3E7EsJo"]["Why do I work to protect animals from abuse? Because puppies. https://t.co/KdPd8fvtLp @HumaneSociety https://t.co/424bpct5tL"]["WATCH: @KeithRothfus and I address the heroin and prescription painkiller epidemic in Johnstown.\nhttps://t.co/SK1o3ENaeQ"]["A few great photos from this past weekend's @theMMRF Miles for Myeloma 5K! https://t.co/h80UaxkkAS"]["I visited Johnstown with @KeithRothfus to talk about our efforts to address the heroin and opioid epidemic: https://t.co/o7bhdeKNJp"]["To all those celebrating #Passover, Chag Sameach!"]["#NationalHighFiveDay and #tbt to the 2015 Keystone Cup victory! https://t.co/rUpSSyA5sD"]["Obamacare-required survey questions are causing docs to overprescribe narcotics. https://t.co/0SZ8JWlRjH https://t.co/AXJD86rYXB"]["Glad the #FAA bill includes my bipartisan measure to help protect passengers, flight crew, and pilots.\nhttps://t.co/H46quqbsru"]["It's #NationalParkWeek! Find your next outdoor adventure in PA here: https://t.co/nrHzxpHADG"]["Here's why I'm opposing Merrick Garland's Supreme Court nomination: https://t.co/0PUF5HAyer @PennLive https://t.co/lkAgo40edG"]["Thank you @HumaneSociety for awarding me the 2016 Congressional Humane Award! https://t.co/DOpJsdWTpq https://t.co/LZHzWZQQqc"]["Wishing a happy #Vaisakhi to the #Sikh community celebrating in Pennsylvania and around the nation."]["Glad to cosponsor legislation to honor our nation's only fully segregated Hispanic unit, the #Borinqueneers. https://t.co/wj44slSoCv"]["Happy birthday @SenBobCasey! I'm looking forward to this year's #KeystoneCup - just a few months away! https://t.co/CRE4De9GTZ"]["@jrobare The best way to contact me is through my website: https://t.co/nQycP7FUKY Or you can call one of my offices to pass along a message"]["Officer Jesse Hartnett - hero who fought back against terrorism in Philly- is throwing today's 1st pitch! @Phillies https://t.co/v3IpsDzpMv"]["My #Philly manager is a #Nova alum. So glad she got to go to the #NovaParade! @NovaMBB https://t.co/MZPnAY9dz1"]["So glad my Philly office manager could attend the #NovaParade today! Way to go @NovaMBB! https://t.co/CnIfCzRUGU"]["Thank you @espngolic for stopping by my office to discuss diabetes research with Robert! @MikeAndMike https://t.co/TMJ46Fu1Z6"]["It looks good on you! #GoodSport @NovaMBB @NovaAthletics  https://t.co/DC0DMFCY6K"]["WATCH: Thank you @SenBobCasey for your work on this issue. Together we can help make our skies safer. #FAA\nhttps://t.co/imyOUMPtRh"]["Congratulations to @Yuengling_Beer for the top spot in US craft brewing! https://t.co/MRjxZvWzEG"][".@NovaMBB - You made all of Pennsylvania proud. I just had to go to the Senate floor and congratulate you!\nhttps://t.co/oXRBJVampV"]["Great to meet students from Allentown Central Catholic High School today at @uscapitol! https://t.co/mjjDxQ3gEB"][".@NovaMBB hat and shirt heading your way, @SenatorBurr! Great game and great effort by @UNC_Basketball. https://t.co/yc0WFdlZun"][".@SenatorBurr or maybe you've heard of @JoshHart_3? 15.5 PPG AND shoots over 50%. @NovaMBB #ChampOnTBS https://t.co/1r0AiVCFGB"][".@SenatorBurr like to introduce you to @DanielOchefu23. 10 PPG 7.6 RPG. Dominates the paint (see below) #ChampOnTBS https://t.co/N3cV2t7tfs"]["Hey @SenatorBurr - meet @RyArch15. 12.4 PPG and nearly 40% from 3. https://t.co/yQFaoxapTV"]["My thoughts are with those affected by the train accident in SEPA. First responders did a great job."]["Excited to cheer on @NovaMBB at the #FinalFour tonight! Go Cats! #LetsMarchNova #MarchMadness https://t.co/ONzWv6WtZs"]["I've had discussions like this all over PA. We must work together to combat the heroin &amp; opioid epidemic. https://t.co/lFnbUf0ju0"]["#AmberAlert for SEPA https://t.co/5jduMWZihn"]["A huge problem in PA that I've been working to address since I got to the Senate. More here: https://t.co/ghOfU6PKSF https://t.co/uCzuxUBSyP"]["Nice to be on this list and honored to put in the “elbow grease” for the good people of PA.  https://t.co/FC1koymZwX"]["I am visiting Pennsylvanians in the Lehigh Valley and SE PA today.  My staff in DC is safe. Awaiting info on situation at #Capitol."]["He is risen! Happy Easter! https://t.co/JFweXbYRlA"]["#LetsMarchNova! #MarchMadness  https://t.co/8Iw1G3GSt8"]["Way to go @NovaMBB! #MarchMadness  https://t.co/WEkFcJcQhc"]["My full statement on the #Brussels terror attack: https://t.co/nHpCswr2wj https://t.co/FupSCy8mvK"]["Happy #StPatricksDay! My family visited Ireland - the home of my paternal grandparents - in 2012. https://t.co/BNvlc5A2t4"]["...as I have done with dozens of judges submitted by President Obama. #SCOTUS"]["Should Merrick Garland be nominated again by the next president, I would be happy to carefully consider his nomination... #SCOTUS"]["it is wise to give the American people a more direct voice in the selection and confirmation of the next justice. #SCOTUS"]["With the U.S. Supreme Court’s balance at stake, and with the presidential election fewer than eight months away... #SCOTUS"]["Pennsylvania is an undisputed national leader when it comes to agriculture. #NationalAgricultureDay https://t.co/NcwJFDX14x"]["Being an organ donor saves lives. Just ask Sarah Murnaghan: https://t.co/f9Hsv46qG2 #UglyTruth @DonateLifePA https://t.co/eYz28IEQLm"]["Learn how Don and Jean Williams turned their family tragedy into a national effort to protect other officers here: https://t.co/TXrpKd4iJX"]["...in passing bipartisan legislation to help protect other corrections officers. @POTUS signed my bill into law yesterday."]["Called Don Williams, father of fallen corrections officer Eric Williams, to thank him for his efforts... https://t.co/huoPi6g6D4"]["Kris and I send our condolences to the family of Taylor Force, a young veteran taken in a senseless act of terror. https://t.co/rTv9OnIw9O"]["Today, the flag atop the @uscapitol has been lowered to half-staff in memory of Nancy Reagan. https://t.co/8BBrcGeXTD"]["Nancy Reagan was a great First Lady and a wonderful woman. Kris and I send our condolences to her family."]["Thank you @SenSherrodBrown for teaming up to tackle the #heroin &amp; #opioid epidemic - major victory today!\nhttps://t.co/kqKbIm8mQq"]["Kris and I were saddened to learn of former Scranton Mayor Jim McNulty’s passing today. Condolences to Evie and the McNulty family."]["PA reporters, abolitionists, suffragists, civic leaders &amp; artists. #WomensHistoryMonth https://t.co/aDeLlJBswo https://t.co/tu0cj0boc7"]["ICYMI: @The74 highlighted my bipartisan work to protect kids. cc: @campbell_brown https://t.co/qI7PW3GsA1 https://t.co/ntuZGlMCAm"]["WATCH: I joined @CBSPittsburgh to discuss my bipartisan effort to end the heroin and painkiller epidemic.\nhttps://t.co/C32slfrCDF"]["#Bipartisanship https://t.co/KcLfMOqlQ5"]["On the 3rd anniversary of Eric William' death, I'm looking forward to @POTUS signing this bipartisan bill into law: https://t.co/fECna6aoN1"]["Today I met Cadet Colonel Nicholas Basile - he's heading to @WestPoint_USMA in the fall. Was proud to nominate him! https://t.co/3ULNcuzfqZ"]["I think I can help with 2 Down in today's @NYTimesWordplay. (Not 24 Across...) cc: @nytimes https://t.co/49R8hEE6y8"]["My bill with @SenBobCasey to protect federal correctional officers is on its way to @POTUS. https://t.co/fECna6aoN1 https://t.co/5fbRVHWGZy"]["Kris and I send our best wishes to @GovernorTomWolf and his family. https://t.co/caStHZrENJ"]["I oppose the @WhiteHouse’s plan to now lift this ban and unnecessarily compromise our security. #Gitmo"]["The fact is @POTUS has signed multiple bills prohibiting the transfer of dangerous terrorists to U.S. soil. #Gitmo"]["8 years later @POTUS is trying to make good on an ill-conceived campaign promise in spite of bipartisan opposition. #Gitmo"]["Great meeting this morning with representatives from the Pennsylvania @AmericanLegion! https://t.co/WctNIYTDP2"]["Kris and I pray for a speedy recovery. https://t.co/oe9DrodZPk"]["36 years ago today. #MiracleOnIce @usahockey https://t.co/bOFO5ksItq"]["I've been working to find a solution to the heroin and opioid epidemic sweeping across Pa. and the country: https://t.co/oC2orm1i03"]["We lost a great public servant, principled conservative, &amp; tireless defender of the Constitution. My prayers are w/Justice Scalia's family."]["My wife Kris and @tombrokaw shared their cancer stories last night. Kris's mom &amp; Tom are fighting the same battle. https://t.co/Ev9wEsDUM6"]["WATCH: My bipartisan bill, which passed the Senate in Dec., will help protect federal corrections officers.\nhttps://t.co/EZo8PFSfte"]["Way to go @NovaMBB! #NovaNation  https://t.co/2Gx8qGzvmT"]["Great news for our military. Pentagon will use technology to get medical and mental health care to those in uniform.  Thanks @CongressmanGT"]["Happy 75th birthday @the_USO!  https://t.co/SBNRu4zIGE"]["We must put the safety of the American people first. End dangerous sanctuary-city policies: https://t.co/xahXbZrRsx https://t.co/YFBa8ItnKv"]["Happy #GroundhogDay! Punxsutawney Phil did not see his shadow. That means an early spring! https://t.co/p8TDXyYXM6"]["Happy birthday @SpeakerRyan!"]["I'm fighting to stop the opioid abuse epidemic. You can read about my efforts here: https://t.co/PEZ5J5CYDJ https://t.co/ZGCZ2ThhHR"]["This storm is very serious. Many in PA could be impacted -- please stay safe and stay off the roads if at all possible"]["Some of my Pennsylvania offices might be closing early as well due to the weather."]["DC looks to be in the bullseye of the big storm so my Capitol Hill office will be closing at noon to allow those folks to get home safely"]["With the big storm, I regrettably am not going to be able to join my friends in DC today for March for Life. So sorry to miss."]["Here are some takeaways from my roundtable discussion with members of @AIPAC on the #IranDeal: https://t.co/dsCoX8gTK1"]["It was a pleasure to meet with @PhillyMayor Jim Kenney this morning in my Capitol Hill office. https://t.co/NPv0Gi5165"]["#CancerMoonshot is reality at @PennMedicine. Glad to see @VP visit with Dr. June whose discoveries are saving lives. https://t.co/oXLnXAlZOC"]["The time is always right to do what is right. #MLK https://t.co/5H7u8gtqoH"]["Local community rallies in support of @PhillyPolice Officer Jesse Hartnett: https://t.co/tICPjlRoJD #Philly"]