["@realDonaldTrump Eight years ago today, Joe Freddy Francois was a child in Haiti when the earthquake hit. Six years later he graduated as high school valedictorian. The character of this nation is not the character of its president. It is the character of its people.\nhttps://t.co/g9c0FISdRe"]["I could call @realDonaldTrump’s comments racist, vile and disgusting because that is what they are. But I also want to tell you about Joe Freddy Francois because immigrants from Haiti, Africa and everywhere else are an integral part of the American fabric."]["I’m fighting for Washington to work better for our veterans and all working families. Let’s pass the Protecting Veterans from Predatory Lending Act and give our vets more financial security."]["@SenThomTillis Right now, some shady lenders can pocket huge fees by pushing veterans to refinance their VA mortgages - even when the vets end up losing money on the deal. Our bill puts a stop to that."]["I’m glad to partner with @SenThomTillis on a new bipartisan bill to crack down on lenders who are trying to exploit our veterans. https://t.co/jZ6uMEdrxR"]["@realDonaldTrump Responsible nations stick to their agreements – and @realDonaldTrump should stick to the #IranDeal to keep our country safe."]["@realDonaldTrump The Iranian regime supports terror, abuses human rights, &amp; develops ballistic missiles. The worst thing we could do is make it easier for Iran to get its hands on a nuclear weapon."]["@realDonaldTrump This week, @realdonaldtrump faces a choice: keep the #IranDeal intact, or re-impose nuclear sanctions that would violate the agreement and make it easier for Iran to get a nuclear bomb."]["Since 2015, the #IranDeal has blocked Iran’s path to a nuclear bomb. So far, the deal is working. But @realdonaldtrump’s refusal to recertify it could change that."]["@USChamber Here’s the basic problem in Washington. Big business lobbyists are so used to running the place that they label anyone willing to stand up to them as extreme. When Tom Donohue and the @USChamber attack me for standing up to corporate interests, I know I’m doing my job."]["Earlier today I introduced a bill to hold big companies like Equifax accountable to consumers.  Then millionaire lobbyist Tom Donohue who runs the @USChamber called me an extremist."]["@MarkWarner @Equifax If we want @Equifax and other credit reporting agencies to act responsibly with our data, we need to hold them accountable when they screw up. https://t.co/0mZ1ZHqiHG"]["@MarkWarner @Equifax Had this law been in place during the Equifax breach, the company would have had to pay at least $1.5 billion in fines – half of which would have gone straight back to affected consumers. Instead, @Equifax likely made money off the hack."]["Today @MarkWarner and I introduced a new bill that would impose massive, mandatory penalties when companies like @Equifax expose millions of Americans’ personal information. https://t.co/GTugkoudIw"]["UPDATE: The Jobs for Heroes Act – a bipartisan effort to help veterans get jobs – got signed into law yesterday! Glad to team up with my Republican colleagues on this good idea."]["Alex Azar wants to smile and pretend he’s different from @realDonaldTrump’s last HHS Secretary, Tom Price. But I don’t see the difference. They both want to tear down Medicaid. #SayNoToAzar https://t.co/6jvJYkgVJl"]["@realDonaldTrump sure knows how to pick them. Tom Price, his last HHS nominee, left office in scandal. His new nominee, Alex Azar, has a resume that reads like a how-to manual for profiting off government service. #SayNoToAzar https://t.co/BSGjAXXXrA"]["The mayors of Massachusetts – Republicans and Democrats – are worried about @realDonaldTrump’s proposed cuts to the Community Development Block Grant. When mayors ring the alarm bell, we need to listen. https://t.co/ghp1zrnJrZ"]["When corporations file for bankruptcy, they shouldn’t be able to cherry-pick courts that they think will rule in their favor. That's why @JohnCornyn and I introduced a bill to prevent big companies from manipulating the bankruptcy system.  https://t.co/tyBQOTxxNV"]["@realDonaldTrump Congress should act now to pass the SECURE Act and provide qualified TPS  recipients with access to legal permanent residency. Many Salvadorans, Haitians &amp; Nicaraguans have lived, worked and paid taxes in the US  for decades. This is their home. We must #SaveTPS."]["The Trump Admin’s use of TPS to initiate wholesale deportations is fundamentally wrong. These actions do not make America stronger or safer - they weaken our economy and our communities."]["First, the Trump Admin ended Temporary Protected Status for 2,500 Nicaraguans. Then, nearly 60,000 Haitians. Today, @realdonaldtrump crossed another item off his anti-immigrant agenda by terminating TPS for 200,000 Salvadorans."]["Dreamers aren’t bargaining chips. They aren’t pawns in @realDonaldTrump’s game. We made a promise. We said come out of the shadows &amp; be fully woven into the fabric of America because that’s who you are. In America, we work hard &amp; dream big &amp; we must keep our promise to Dreamers."]["Congress needs to take immediate action to protect state marijuana laws, and the patients that rely on them."]["@TheJusticeDept's reckless decision to rescind its policy allowing states to enforce their own drug policies puts our public health and safety at risk."]["States like Massachusetts have put a lot of work into implementing common sense marijuana regulations.  https://t.co/KteYeEzxVe"]["Staying warm in the storm and calling into @BosPublicRadio today at noon. I’ll be talking with @jimbraude and @margeryeagan about my work standing up for working families of MA against powerful corporate interests."]["Stay safe, Massachusetts! And follow @MassEMA and @NWSBoston for updates on #MAsnow. https://t.co/BSDo1akHHp"]["Wishing a warm welcome to my new Senate colleagues Doug Jones and @SenTinaSmith, who were sworn in today to represent Alabama and Minnesota. Let’s get to work!"]["What does living in the shadows look like? Meet Reina and you’ll understand why we need a #DreamActNow. We can’t let @SenateMajLdr Mitch McConnell put this off any longer. https://t.co/bmZGSXUHIT"]["The federal deadline to sign up for health care has passed, but Massachusetts is special. We want everyone to get covered – so our deadline is January 23rd. Head to https://t.co/D6PuXPWLeg to get you and your family insured for 2018. https://t.co/BT0dK0xBvj"]["I stand with the right of the Iranian people to peacefully protest. The people of Iran deserve a government that respects human rights and works to address their grievances.  #IranProtest"]["Honored to participate in the swearing-in ceremony of Framingham’s first-ever mayor, Yvonne Spicer. A gifted educator, Yvonne is now also the first African American woman popularly elected to serve as mayor of a MA city. What a wonderful way to start the new year! https://t.co/pw6bI6uoKU"]["I voted no tonight on a CR that does not include the #DreamActNow. Congress shouldn’t leave town to celebrate the holidays with our families while 800k Dreamers fear being ripped apart from their families &amp; deported to a country they barely know. We must keep our promise. https://t.co/wgG5Y2AuPo"]["Congress should not go home until we keep our promise to help the 800k Dreamers. Heading to the Senate floor to urge my colleagues to pass a clean #DreamActNow. Watch: https://t.co/sF0xMBFHb9"]["@BetsyDeVosED After almost a year of inaction – and over 100k defrauded students waiting for answers – @BetsyDeVosED has a stingy &amp; ridiculous scheme for making many of them pay the fed govt money they don’t owe. It’s shameful. https://t.co/1MxwhwFUzH"]["Dreamers have been active at the Capitol this week – urging Senators to vote on a clean Dream Act before we all leave for the holidays. I’m right there with them. #DreamActNow https://t.co/DunL3hn8Uo"]["People are angry about the #GOPTaxScam – and they are right to be. I am, too. https://t.co/TQaTwktdxu"]["Starting now on @allinwithchris! #inners https://t.co/mekffk31mj"]["Tonight I’ll be talking to @chrislhayes about the terrible #GOPTaxScam that Republicans rammed through Congress today. Tune in! #inners"]["Sooner or later, a reckoning is coming. And I will promise you this: When it does, the politicians who lead this Congress &amp; voted for this tax heist will be held accountable for turning their backs on the American people."]["Americans are angry. And they are right to be angry. Over &amp; over, again &amp; again, they watch this Congress ignore their problems while jumping to do more favors for billionaires, giant companies, &amp; campaign donors."]["The bill that the Republicans jammed through the Senate tonight isn’t tax reform. It’s a heist. Let's call this out for what it is: Government for sale. #GOPTaxScam"]["Tonight I told the @SenateGOP who are ramming through their #GOPTaxScam: It’s a terrible day for millions of working families in this country who just want Congress to work for them. https://t.co/801O1iqUxN"]["GOP donors are popping champagne over the #GOPTaxScam tonight. It’s shameful – and people are right to be angry. To everyone who made their voices heard: Thank you. Stay in this fight – we need you. https://t.co/IGI03EuZT6"]["The #GOPTaxScam is shameful – and it’s the result of a shameful process. Heading to the Senate floor one last time before the @SenateGOP ram through a vote on this terrible bill. Watch live NOW: https://t.co/jc1R7Es8hG"]["No, there isn’t “plenty of time” to pass the Dream Act. 30,000 Dreamers will lose their legal status each month. The Dreamers I just spoke with outside the Capitol can’t wait any longer for Congress to keep its promise. We need the #DreamActNow. https://t.co/2rX4wog12N"]["I’m ready to vote on a clean #DreamActNow. So are many of my colleagues on both sides of the aisle. A majority of Americans support this bipartisan bill. So what the heck are you waiting for, @SenateMajLdr? Let’s do this RIGHT NOW."]["@HouseGOP Big banks sucked down almost $70B in taxpayer bailouts just a few years ago – and now the @HouseGOP want to turn them loose all over again. No Democrat that claims to support working families should join the GOP in supporting this bill. https://t.co/ds2ryUjBSN"]["While the @HouseGOP are set to vote tomorrow on the #GOPTaxScam, they're also gearing up to vote on a bill that would roll back the rules on dozens of the biggest banks in the country."]["The internet doesn’t belong to big internet companies. It belongs to all of us. Read my @southcoasttoday op-ed on why people across MA &amp; around the country should fight the @FCC’s decision to kill net neutrality. https://t.co/qsqqfrguzM"]["@DHSgov .@fema told us the death count in PR is a local matter &amp; the agency wasn't asked to help with it. A thorough review is long overdue. I hope Puerto Rico Governor @RicardoRossello requests any help from federal agencies that PR needs to determine the hurricane's full, tragic scale."]["Two months ago, 12 senators joined me in calling on @DHSgov to provide the resources to ensure the Puerto Rico death toll is accurate, &amp; to ensure the counting methodology is sound. https://t.co/O6FJfF5Tp3"]["For months, I’ve been raising concerns that the death toll in Puerto Rico due to Hurricane Maria was severely undercounted. Now, the Puerto Rican government is acknowledging this reality &amp; ordering a review of all deaths. https://t.co/MUdCkiRlFg"]["Read my new @statnews op-ed on why Congress should reauthorize funding for community health centers in MA &amp; across the country right now. This should be a no-brainer. https://t.co/MfTL9AvdKW"]["Read my @nytimes op-ed with @SenSanders on how this year's budget could work for working people. https://t.co/OIKxff8rkq"]["With a government funding deadline looming, GOP leadership face a choice. Will they spend the week trying to deliver tax breaks for the rich? Or work with Dems to pass a budget that supports working people? https://t.co/7Q3SeeWLTP"]["Many moms have a child care story that sounds a lot like mine. Juggling a growing family &amp; holding a teaching job was tough as nails. Without child care, I was a goner. That’s why I’m fighting for universal child care in our end-of-year budget. https://t.co/sBbzIVD2Kp"]["@AdyBarkan Republicans say they will release their final “tax bill” at 5:30pm today. Now is our last chance to stop it. I’ll be fighting this tax scam to the bitter end and need you to join me. Call, post, email and say no to the #GOPTaxScam"]["Make no mistake: the #GOPTaxScam is not just about numbers. If Congress passes a tax bill that gives corporations massive handouts, it’ll be on the backs of people like @AdyBarkan. https://t.co/IDbermBhek"]["McConnell in 2010: Don’t vote on ACA until Scott Brown (R) is seated.\nMcConnell in 2017: Don’t seat Doug Jones (D) until vote on tax bill. https://t.co/wiZB0D5KgQ"]["The FCC just voted to hand control of the internet over to giant internet companies, but this isn’t over. Congress must step up to repeal this rule, restore net neutrality protections, and defend a fair and open internet."]["Puerto Rico desperately needs help, and @Lin_Manuel explains some of the most important steps we must take. Read his column: https://t.co/v6rAGG5deO"]["The @USTreasury's one-page “analysis” of the GOP’s multi-trillion dollar tax giveaway is a complete sham. I want answers from Secretary Mnuchin before the GOP tries to ram through their giveaway in the next few days. https://t.co/Ls9ntZfUr7 https://t.co/itLpnvPKxh"]["Tomorrow, the @FCC will vote to kill #NetNeutrality rules. We must fight to keep the Internet open and free to all. https://t.co/hY1asn0SbT"][".@SenateGOP should follow precedent @SenateDems set after 2010 special election in MA. Delay vote on tax bill until @GDouglasJones is seated. https://t.co/Sk7VG2UDxm"]["We need to fight for judges that protect the rights of all Americans, not just the wealthy &amp; the well-connected. That’s why I will be voting against these judicial nominees, &amp; I urge my colleagues to do the same."]["This week, the GOP Senate will vote on Steven Grasz, Donny Willett, &amp; James Ho to sit on the federal courts of appeals. The records of all 3 nominees show that they will favor powerful interests over workers, women, LGBTQ individuals, people of color, &amp; religious minorities."]["Now that there’s a GOP President who’s committed to tilting our courts further in favor of the rich &amp; the powerful, Republicans are looking to fill our courts with judges who share that commitment."]["For years, the GOP have worked hand-in-hand with billionaire-funded right-wing groups to ensure that our courts advance the interests of the wealthy &amp; powerful over those of everybody else."]["Are you really trying to bully, intimidate and slut-shame @SenGillibrand? Do you know who you're picking a fight with? Good luck with that, @realDonaldTrump. Nevertheless, #shepersisted. https://t.co/mYJtBZfxiu"]["The American people deserve to know how this #GOPTaxScam will impact the economy and how it will affect middle-class families. @USTreasury promised an economic analysis – but this isn’t it. I look forward to the IG’s investigation providing real answers for American families."]["To recap: After claiming repeatedly he had projections showing the #GOPTaxScam paid for itself, Mnuchin released a report showing that there were no such projections, and that even his own wildly optimistic made-up projections weren’t enough for the plan to pay for itself."]["Where does the other half of the growth come from according to @USTreasury? Partly from proposals that haven’t even been introduced in Congress and may never happen. https://t.co/aZpZlfdcgX"]["Mnuchin’s projection is completely out of line with other projections. It's way higher than credible estimates, and even higher than right-wing projections that ignore the effect of the national debt on growth. https://t.co/7C6KCIWwOB"]["In other words: @USTreasury’s OTP couldn’t support Mnuchin’s claims about economic growth, so he just said it again without evidence."]["While @USTreasury’s OTP made other projections in this report, it didn’t make the key projection that growth would go up about .35% annually thanks to the corporate tax changes in the GOP tax bill."]["A bit of important background on this claim. @USTreasury includes the Office of Tax Policy (OTP). The OTP is staffed by non-political tax experts and economists, who are responsible for projecting the economic impact of changes to the tax code."]["But how does the report show that economic growth WILL be 2.9% instead of 2.2% thanks to the GOP tax plan? It doesn’t! Instead, @USTreasury \"expects approximately half\" of this additional growth to come from corporate tax changes. https://t.co/Vv6MGNCH9j"]["@USTreasury The @USTreasury report says that IF economic growth is 2.9% instead of 2.2% over the next ten years, then the national debt will go down despite the GOP plan’s massive tax giveaway to big corporations. Oh really?"]["In this bogus report, @USTreasury was supposed to use its economic models to project how the GOP tax plan would affect economic growth.\n \nIt didn't do that. It just made up the numbers."]["After I requested an investigation, @USTreasury finally released its \"analysis\" of the #GOPTaxScam. This one-page report is pathetic – and shows Secretary Mnuchin has no basis for claiming that the tax plan \"will pay for itself with growth.\" https://t.co/3KjogQLeHE https://t.co/ZmcwxSkcQN"]["Funding for kids' health insurance &amp; community health centers expired over 2 months ago. MA health advocates wrote me a letter: “Urgent action to reauthorize funding for both programs is necessary to provide certainty for both families &amp; state budgets in MA &amp; across the nation.” https://t.co/01fjk6VzMz"]["Glad to participate in our 4th annual MA Business Matchmaker in Worcester yesterday. Small businesses are at the heart of our economy, &amp; I’m happy to work with @SBAgov to connect them with government contracting opportunities. https://t.co/Tk3sK8RbSS"]["Thanks to @RepLloydDoggett and @HouseDemocrats for following up on this important issue. @USTreasury should not be allowed to hide its economic analysis of the impact of the #GOPTaxScam – or hide that it never even did any analysis. https://t.co/QHiePdZnG5"]["The future of 800k Dreamers hangs in the balance. Millions of kids at risk of losing their health insurance. Pass a clean Dream Act. Reauthorize CHIP. Let’s quit kicking the can down the road. #DreamActNow https://t.co/53HUqcTcXv"][".@SenBernieSanders &amp; I are talking about things Democrats are fighting for in this spending bill that would make a big difference to working families. Watch live now: \nhttps://t.co/AvP2fFxDC9"]["The federal government will run out of money on Friday unless Congress passes a new spending bill. This isn’t just about keeping the lights on - it’s about our values."]["Watch live as I speak to @openmarkets about how competition makes our economy - and our country - stronger: https://t.co/bzQvjuSy6g"]["Heading to the Senate floor to urge passage of the #DreamActNow. Watch live: https://t.co/AMIGUNi5Yo"]["Amendment #60, which prohibits deregulation of banks that fire whistleblowers, failed, 7-16. Four Democrats voted with the Republicans against it. #BankLobbyistsAct"]["Just offered amendment #60, which prohibits deregulation under the #BankLobbyistsAct for financial institutions that have fired or retaliated against whistleblowers."]["Amendment #52 which stops deregulation of banks under consent decree or a deferred prosecution agreement failed, 7-16. Four Democrats voted with the Republicans against it. #BankLobbyistsAct"]["Amendment #49 to prohibit deregulated banks from merging with other banks for 5 years failed, 5-18. Six Democrats voted with the Republicans against it. #BankLobbyistsAct"]["Amendment #47 to require bank execs to certify their banks aren’t breaking the law failed, 7-16. Four Democrats voted with the Republicans against it. #BankLobbyistsAct"]["Just offered amendment #49, which prohibits any bank deregulated under the #BankLobbyistsAct from merging with another bank for 5 years. If this bill is truly about helping community banks, let’s stop big banks from gobbling up other banks."]["Just offered amendment #47, which requires big bank execs that want to be deregulated under the #BankLobbyistsAct to sign an annual certificate that they’ve done due diligence &amp; certify that there’s no criminal conduct or civil fraud happening at their bank."]["Amendment #44 to require public votes on million dollar settlements failed, 8-15. Four Democrats voted with the Republicans against it. #BankLobbyistsAct"]["Amendment #57 to expand the CARD Act failed, 7-16. Four Democrats voted with the Republicans against it. #BankLobbyistsAct"]["Sorry everyone, the @SenateBanking Committee livestream cut out. Tune in here: https://t.co/rBG3zFvmPZ #BankLobbyistsAct"]["Just offered amendment #44, which adds the text of my bipartisan Fed Accountability Act. It requires public votes on settlements greater than $1M. #BankLobbyistsAct https://t.co/XOSVY4bWPw"]["Just offered amendment #57, which expands the CARD Act protections for college students. Banks &amp; credit card companies would have to disclose all financial products &amp; services marketed to students on college campuses. #BankLobbyistsAct"]["Amendment #56 to reform student loan servicing failed, 7-16. Four Democrats voted with the Republicans against it. #BankLobbyistsAct"]["Just offered amendment #56, which reforms student loan servicing with basic consumer protections. It also gives student borrowers the right to sue the companies that administer their student loans if they break the law. #BankLobbyistsAct"]["We’re back live in the @SenateBanking Committee, where the GOP – and some Democrats – have worked out a deal behind closed doors to deregulate big banks. I’m fighting back against the #BankLobbyistsAct. Tune in: https://t.co/AhMJi7Whsx"]["Amendment #40 on the financial exploitation of seniors failed, 7-16. Four Democrats voted with the Republicans against it. #BankLobbyistsAct"]["Just offered amendment #40, dealing with financial exploitation of seniors. The immunity provisions in the #BankLobbyistsAct are too broad. This helps financial firms report the exploitation of seniors without also letting banks off the hook for unrelated consumer violations."]["Amendment #39 on the FREE Act failed, 7-16. Four Democrats voted with the Republicans against it. #BankLobbyistsAct"]["Just called up amendment #39, which would add the FREE Act into the bill. It gives consumers more control over their own data &amp; helps people protect themselves after the Equifax breach. #BankLobbyistsAct https://t.co/iMXkn8YRjA"]["@SenateBanking My staff will be live-tweeting the @SenateBanking #BankLobbyistsAct markup to let you know when the Senate fights for the big banks, not American consumers. Stick around."]["In just a few minutes, the @SenateBanking Committee will be debating this terrible #BankLobbyistsAct. Watch live as I fight for a dozen amendments to put the American people first. https://t.co/rGsNoTouCS https://t.co/8SE0sXjhPn"]["That’s right: Both GOP AND Democratic Senators are trying to roll back rules for banks that took nearly $50B in taxpayer-funded bailouts. It’s insane. #BankLobbyistsAct"]["Tonight the @SenateGOP gave a giant tax break to the rich &amp; left everyone else holding the bag. This is about more than economics – it’s about our values. The Republicans just proved they are morally bankrupt. #GOPTaxScam"]["Working families are already on the ropes – and this #GOPTaxScam is another punch in the gut. We must keep fighting back with everything we’ve got to stop them from delivering the knockout blow."]["This Congress doesn’t work for working families. It works for corporate lobbyists &amp; campaign donors in backroom deals &amp; 1:30 AM votes. This corruption is hollowing out America’s middle class &amp; tearing down our democracy."]["The @SenateGOP just voted against protecting Medicare, Medicaid, and Social Security from future cuts. Make no mistake: they’re on the chopping block next in the GOP Congress. #GOPTaxScam"]["Well there you have it: The @SenateGOP won’t even give Democrats the weekend to read all the lobbyist giveaways they’ve added in chicken scratch to the #GOPTaxScam they're jamming through tonight."][".@SenateGOP is about to try to ram through their #GOPTaxScam bill. Tune in live. https://t.co/J7TPdKoJ87"]["No, I haven’t had time to read the 500-page #GOPTaxScam bill that we’re voting on tonight. I couldn’t read it if I tried – and I did. https://t.co/WgoAT6rxuo"]["Flynn’s admission underscores the importance of the Special Prosecutor. No one is above the law – NO ONE. The American people deserve to know the truth."]["President Trump’s National Security Advisor pled guilty to a federal crime relating to his contacts with the Russian Government. This is not normal. This is not fake news. This is a serious threat to the national security of the United States."]["We can build an America where every kid has a shot at success. Where every family has some basic measure of economic security. Where every senior has enough savings to retire with dignity. That starts by defeating this #GOPTaxScam."]["I don’t think a single middle class family in this country should pay more taxes so that big corporations &amp; billionaires can pay less. Big corporations should pay MORE so that we can cut taxes on working families &amp; small businesses &amp; invest in our future. #GOPTaxScam"]["The #GOPTaxScam is a smash-and-grab job. The GOP don’t even try to hide the corruption. And they don’t worry about how many middle class families are hurt in the caper."]["This #GOPTaxScam is about paying off the rich, corporate donors that helped get the @SenateGOP elected. It’s about the way money has corrupted Washington: millions in campaign contributions for billions in tax giveaways."]["The #GOPTaxScam isn’t about fiscal responsibility. For years, the GOP have whined about exploding debt. If this trillion-dollar #GOPTaxScam passes, the @SenateGOP will turn around next week &amp; say – sorry! There’s no money for Medicare, Medicaid, education, housing, you name it."]["The #GOPTaxScam isn’t about economic growth or jobs. Trickle down doesn’t work. But don’t take my word for it: top execs have admitted that they’ll use tax giveaways to buy back stock &amp; fund new mergers. Nothing for workers."]["The #GOPTaxScam isn’t about helping working people. It RAISES taxes for millions of middle class families. The @SenateGOP had their chance to vote to make middle class tax cuts permanent this afternoon. They voted NO."]["I’m glad @USTreasury's IG responded quickly to my request. Either Treasury used taxpayer funds to conduct analyses it won’t release because they contradict Mnuchin’s claims that this bill grows the economy, or Mnuchin misled the public about the analysis. Either is a big problem. https://t.co/56HWdgvO3S"]["Earlier today, I wrote to the @USTreasury Inspector General to request an investigation into Treasury’s alleged economic analysis of the GOP tax plan. https://t.co/f5loe7iDoA https://t.co/LUiTmns8W1"]["The tax/ANWR vote is happening today. And it’s a close fight. Now is the time to let @realDonaldTrump &amp; the GOP Congress know that ANWR remains off-limits. #ProtectTheArctic https://t.co/jJEwwjlfQB"]["Buried deep in the GOP tax bill – buried deep so no one would notice – is a provision to allow drilling for the first time in ANWR. It’s a shameful handout to Big Oil executives who don’t like being told an area is off-limits. #ProtectTheArctic"]["The Arctic National Wildlife Refuge is one of the last untouched wildernesses in our country. It's a beautiful landscape teeming with life &amp; a national treasure that we have fought to protect for nearly 40 years. #ProtectTheArctic"][".@SenateGOP is about 24 hours away from voting on a bill that would make the middle class pay more taxes so that big corporations and millionaires can pay less. Tune is as I break it down: https://t.co/jc1R7Es8hG"]["Republicans are handing corporations the tax plan of their dreams. And the rest of us will be paying for their joy ride. https://t.co/SkQMJW3WKk"]["The Republican tax bill cuts taxes for corporations and raises taxes on students in debt. This is what Republican leadership looks like. https://t.co/YzqfJ3w32G"]["Hear Flora’s story and you’ll understand why the @CFPB is worth fighting for. https://t.co/XtzRQWNX2E"]["Trump has put a cloud of uncertainty over the @CFPB by attempting to override Dodd-Frank. Mulvaney should take no action until this dispute is decided in the courts. https://t.co/BBBCA6fRYs"]["The only thing that will turn the @CFPB into a disaster is for @realDonaldTrump to ignore Dodd-Frank &amp; name an acting director determined to destroy the agency."]["The @CFPB has returned $12 billion to working families who were cheated. That’s government that works for the people, @realDonaldTrump."]["Less than a decade after taxpayers bailed out the big banks, the banking industry made record profits last year. That's who you're worried about, @realDonaldTrump? https://t.co/O318bHhZbS"]["If @realDonaldTrump believes he is acting legally by ignoring Dodd-Frank, he should go to court &amp; seek a judgment right away to settle this @CFPB dispute."]["By ignoring Dodd-Frank &amp; naming his own acting @CFPB Director, @realDonaldTrump is causing chaos &amp; market uncertainty. So I agree with Rich Cordray: this needs to be decided in the courts."]["Bank lawyer Alan Kaplinsky &amp; I often disagree. But we agree that there is an \"enormous cloud of uncertainty\" over @realDonaldTrump naming Mulvaney acting @CFPB Director. https://t.co/uPiDuRdgtl"][".@realDonaldTrump can nominate the next @CFPB Director - but until that nominee is confirmed by the Senate, Leandra English is the Acting Director under the Dodd-Frank Act."]["The Dodd-Frank Act is clear: if there is a @CFPB Director vacancy, the Deputy Director becomes Acting Director. @realDonaldTrump can’t override that. https://t.co/r949ccaJAb"]["@realDonaldTrump @FCC Ending #NetNeutrality doesn’t serve the public interest or benefit American consumers – it will only benefit the handful of giant companies that will block, filter, or charge more for what we do online."]["We don’t know who is going to have the next big idea in this country, but they’re probably going to need to get online to do it. The decision made today by @realDonaldTrump’s @FCC only tilts the playing field to favor the rich &amp; powerful who have already made it. #NetNeutrality"]["Instead of learning from the terrible tax policy they tried in Kansas, @SenateGOP wants to replicate it nationwide. https://t.co/SYxS9gn4pl"]["Mick Mulvaney thinks the @CFPB shouldn’t exist. A member of the GOP anarchy gang has no business running the agency. This is a giant middle finger to consumers. https://t.co/rDJ3BR2siO"]["Tune in now! https://t.co/jIZYcfSiK8"]["Tonight l’ll be talking with Rachel @Maddow about Rich Cordray &amp; the future of the @CFPB. Tune in!"]["Watch live as I discuss today's breaking news that Director Rich Cordray will be stepping down as director of the @CFPB: https://t.co/GFY0eXOo6E"]["The new Director of the @CFPB must be someone with a track record of protecting consumers &amp; holding financial firms responsible when they cheat people. This is no place for another Trump-appointed industry hack."]["At the @CFPB, Rich Cordray forced the biggest financial institutions to return $12B directly to the people they cheated. He held big banks accountable. He's a dedicated public servant &amp; a tireless watchdog for US consumers – &amp; he will be missed."]["@SenatorDurbin @BetsyDeVos And read the report @SenatorDurbin and I released this week, telling the stories of 8 students who've been cheated by shady #4profit colleges. https://t.co/AbIjNYyX0s"]["Join me and @SenatorDurbin as we urge @BetsyDeVos to help students who've been defrauded by #4profit and scam colleges. #DefendStudents https://t.co/oxeLvFeLCR"]["The news just broke – Senate Republicans want to rip health insurance away from 13 million Americans... through the tax bill. https://t.co/23F6aWHorz"]["The GOP tax plan is the same snake oil they sold in Kansas, pushed by big donors -- not working families. (They’re hoping you don’t notice.) https://t.co/0YLoQOJkOh"]["Republicans already tried slashing taxes for the rich in Kansas. It killed the state economy and working families paid the price."]["Republicans are relying on a few big lies to sell their awful tax plan. One is that slashing taxes for the rich will help working families."]["This guy’s bank got a $1.4B bailout in 2008. Now GOP &amp; Dem Senators want to roll back rules on his bank. That’s how DC works, &amp; it stinks. https://t.co/g6JVZnhns8"]["Trump adviser and ex-banker @GaryCohn45: CEOs are “the most excited group” about GOP tax bill. Me &amp; Bernie: No kidding. https://t.co/h8b6fmhweY"]["We owe our veterans a debt we can never repay. Watch as we honored a special group of vets at the US Capitol this week. #VeteransDay https://t.co/ozP3aRDHVP"][".@SenFranken and I break down what CEOs will do with the tax giveaways they'll get if the GOP's corporate tax bill passes Congress. https://t.co/dDGBedpFcJ"]["Do your job, @realDonaldTrump. Your Administration must work with Puerto Rican authorities to ensure an accurate hurricane fatality count right away."]["This is important. @realDonaldTrump has cited the death count to argue his disaster response to Puerto Rico was top notch. It appears many hurricane deaths are going uncounted. Each day that passes makes it tougher to figure out the true total."]["Last month, 12 senators joined me in calling on the Trump Administration to ensure the accuracy of the fatality count in Puerto Rico. We're still waiting. https://t.co/DPMGalhfch"]["Puerto Rican officials have announced a jump in deaths since Hurricane Maria, but the official hurricane death toll is still just 55. https://t.co/nAtaictW6O"]["Read my @washingtonpost op-ed on how the GOP outsourced its economic agenda to billionaires &amp; corporate donors. https://t.co/hmWdrCwKsw"]["The GOP’s rich donors want tax giveaways, and the party is happy to oblige. https://t.co/aM8KamHl4d"]["Thoughts &amp; prayers are not enough, GOP. We must end this violence. We must stop these tragedies. People are dying while you wait."]["How many kids must die of gun violence on playgrounds &amp; streets every day with no attention at all before we wake up to what’s happening?"]["How many more people must die at churches or concerts or schools before we stop letting the @NRA control this country's gun policies?"]["I'm heartsick for the victims, families &amp; community of Sutherland Springs. But I'm more than heartsick – I'm angry."]["The future of 700k Dreamers as American as you &amp; me hangs in the balance. Do your job, Mr. President. Stop playing politics &amp; fix this."]["Let me be clear: If Trump doesn’t keep his word &amp; Congress doesn’t pass a clean Dream Act, I won’t vote for a spending bill without it."]["After a meeting with the @SenateGOP, it turns out @realDonaldTrump is willing to abandon Dreamers after all. https://t.co/5lVsahEO4W"][".@realDonaldTrump promised to quickly move legislation through Congress to protect Dreamers from deportation. They’re still waiting."]["The @HouseGOP tax plan isn’t about helping the middle class. It’s about shoveling favors to corporate donors. https://t.co/hN55Fdc7b6"]["The GOP unveiled their tax proposal this morning. Who wins and who loses in their plan? Bernie and I will tell you. https://t.co/AjXyKyA8AA"]["The Senate should reject @realDonaldTrump’s judicial nominees &amp; stop helping the rich &amp; powerful capture our courts."]["Nobody who supports 1 justice system for the rich &amp; powerful &amp; 1 for everyone else should get a lifetime appointment to the federal bench. https://t.co/eQpQ4Azjub"]["Read my @Politico op-ed on why Supreme Court justices must demonstrate their commitment to equal justice under law. https://t.co/exzM39L15U"]["The very same day SCOTUS announced they’d hear Janus v AFSCME, Gorsuch was hobnobbing with anti-union funders at the Trump Hotel."]["Justice Gorsuch will likely be the deciding vote in a case to strip public sector unions of the resources they need to give workers a voice."]["2015: GOP Rep tries to kill the Ex-Im Bank.\n2017: Same guy suddenly likes the Ex-Im Bank &amp; wants to run it.\nYou’ve got to be kidding me. https://t.co/2BdeO9THNV"]["Keeping the victims, first responders, &amp; people of NY in our thoughts tonight. We will not let terrorism or fear divide us. #NYCStrong"]["Heading to the Senate floor now to discuss how the GOP have helped powerful interests capture our courts. Watch: https://t.co/jc1R7Es8hG"]["I’ve seen some amazing cases of people spinning through the Washington revolving door, but Brian Montgomery for @FHAgov might take the cake. https://t.co/ZpgRrCOWcy"][".@realDonaldTrump just doesn't get it: banning people from serving based on gender identity is shameful &amp; it makes America less safe."]["Once again, a court has put a stop to another extreme &amp; discriminatory policy of this President. https://t.co/p8EX9NP4I9"]["I'll say it again: the only thing that matters when it comes to allowing military personnel to serve is whether they can handle the job."]["29 days and counting. https://t.co/TunYyBtsHb"]["MA has permanent kiosks to drop off unused opioids &amp; also dropoff locations on Saturday. Find one near you:\n https://t.co/pcgzdw3dbC"]["Saturday 10/28 is National Prescription Drug Take Back Day. Find a dropoff location to safely dispose unused drugs. https://t.co/OkXI9PN7pp"]["I fought hard to pass a bipartisan bill that lets doctors &amp; patients partially fill opioid prescriptions. But you can do your part as well."]["Unused opioids often collect dust in medicine cabinets – but 70% of adults who misuse prescription opioids get them from friends/relatives."]["Millions of Americans get their wisdom teeth taken out or have minor surgery &amp; don't use all the painkillers prescribed to them."]["@SpeakerRyan Wrong, @SpeakerRyan. No group that represents real human beings wanted to make it easier for Wall St to cheat people. Including vet groups. https://t.co/2JezJhQTYW"]["Not once has Congress failed to authorize CHIP, which funds health care for kids. Except this year - when @SenateGOP is in control. https://t.co/2YdIgZMQig"][".@realDonaldTrump's decision to cancel ACA ads was blatantly political, made with no regard for its impact on taxpayers or families."][".@PattyMurray &amp; I called for an investigation on the ACA ads. The IG's findings, released yesterday, are disturbing. https://t.co/vtigx2SFfN"]["Within days of taking office, @realDonaldTrump ordered @HHSGov officials to cancel ads encouraging people to sign up for ACA coverage."]["Bad news: @HouseGOP just passed the @SenateGOP budget. Who comes out ahead in this? The super-rich and big corporations. https://t.co/LFASotOGks"]["Over 20 military &amp; vets groups supported the @CFPB rule protecting our right to sue banks. @SenateGOP sided with the bank lobbyists instead. https://t.co/PkkBz2nURK"]["I’m cosponsoring the USA Rights Act to ensure that the gov't protects our ntl security without trampling on privacy. https://t.co/j9ptqLz8xf"]["Congress must step up &amp; refuse to reauthorize Section 702's surveillance program without significant new protections for Americans’ privacy."]["The US government should not be spying on US citizens’ emails &amp; phone calls without a warrant. Period."]["Watch @VP Pence &amp; the @SenateGOP give a giant wet kiss to Wall Street late last night while they thought you weren’t looking. https://t.co/RomlEjGl81"]["About to join @SenateDems on the floor to fight for CHIP. Children’s health doesn’t belong on the backburner. Watch: https://t.co/jc1R7Es8hG"]["Tonight @VP Pence &amp; the @SenateGOP gave a giant wet kiss to Wall Street. No wonder Americans think the system is rigged against them. It is."]["I’m fighting @VP Pence &amp; the @SenateGOP's gift for the bank lobbyists until the very end. Watch live now: https://t.co/jc1R7Es8hG"]["If the @SenateGOP reverse the @CFPB’s rule tonight, they won’t be promoting a conservative agenda. They’re promoting the banks’ agenda."]["Servicemembers, vets, seniors, and small businesses all support the @CFPB rule. Only people who don’t? Bank lobbyists. Oh, and @Equifax."]["Let’s be clear: No organization that represents actual human beings wants the @SenateGOP to reverse the @CFPB’s arbitration rule."]["Millions of financial contracts have a clause limiting your right to go to court if you’re cheated, so the @CFPB wrote a rule to stop that."]["We’re going to vote tonight on a @SenateGOP proposal that makes it harder to hold @WellsFargo &amp; @Equifax accountable. It's nuts, but true."]["Millions of Americans of all parties think Washington is rigged against them. Tonight’s vote is Exhibit A. https://t.co/0tfDxNahAm"]["The @SenateGOP will soon vote to take away your legal rights against big corporations. I'm fighting back. Watch now: https://t.co/jc1R7Es8hG"]["Warning: calling @Equifax to freeze your credit takes forever and may not even work. We need the FREE Act so freezes are fast and free. https://t.co/dyYMTcfCiR"]["You call this A+ work, @realDonaldTrump? Give me a break. PR &amp; USVI still need much more help. NOW. https://t.co/qecyW4FqLU"]["The GOP need to stop putting children's health at risk &amp; fund CHIP. https://t.co/XooCPkOBo9"]["The latest @SenateGOP budget is garbage. We must fight back to protect the people we love and the programs we care about. https://t.co/9ewKRl7T7G"]["Happy to wear purple for @GLAAD’s #SpiritDay – and to fight every day for a country where LGBTQ youth feel safe and loved. https://t.co/XdNp4BUiIh"][".@realDonaldTrump - do your job. https://t.co/GUcRt9Umun"]["@BetsyDeVosED @MassAGO News flash to @BetsyDeVosED: As long as you keep ignoring the law, state AGs like @MassAGO will be there to enforce the law for students​."]["@BetsyDeVosED @MassAGO Yesterday, 18 state AGs sued @BetsyDeVosED again for illegally suspending Obama Admin #4profit college rules. https://t.co/zdsU6IyEsD"]["@BetsyDeVosED In July, @MassAGO led 19 state AGs in suing DeVos for delaying rules to help students cheated by #4profit colleges. https://t.co/rGYn81CJVn"][".@BetsyDeVosED has gone out of her way to give shady #4profit colleges everything on their wish list, even when it breaks the law."]["It’s long past time for @realDonaldTrump to fight for all Americans – not betray our values &amp; undermine our safety with a Muslim ban."][".@realDonaldTrump just can’t take a hint. His illegal Muslim ban is now 0 for 3 vs the Constitution. https://t.co/F44rFqjqY1"]["To the credit reporting industry, people aren’t their customers. We’re just their products. We need to reform this broken industry. https://t.co/VHWZlC53c1"]["@CFPB The last thing Congress should do is hurt people’s rights to hold big banks accountable. Read my @BostonGlobe op-ed. https://t.co/J9Xd8QW7FM"]["The @CFPB's new rule stops forced arbitration clauses. Surprise, surprise: bank lobbyists hate it. They want Congress to reverse it ASAP."][".@Equifax &amp; @WellsFargo both used forced arbitration clauses hidden in the fine print to keep millions of people from taking them to court."]["This is a disgrace. Our veterans deserve better. I’ll be demanding answers and accountability from @DeptVetAffairs. https://t.co/GJkP639N08"]["It’s a simple question: Do we want Iran to have a nuclear weapon or not? https://t.co/QGEPcGRhqS"]["Wonder why the @GOP tax plan shovels money to billionaires while raising taxes for millions of working families? https://t.co/Z98pze6iR6"][".@realDonaldTrump's attack on the ACA's birth control mandate not only attacked reproductive rights. It attacked women's economic freedom."]["Responsible nations stick to their agreements. Responsible Presidents put America's safety first. If this President won't, Congress must."]["Secretary Mattis said it’s good for our national security to stay in the #Irandeal. Chairman Dunford said Iran was complying with the terms."]["The #Irandeal is keeping Iran’s nuclear program under tough limits &amp; inspections. So far, it’s working to keep Iran away from a nuke."]["The President’s outrageous decision to decertify isolates the US from our allies &amp; increases the risk that Iran gets a nuclear bomb."]["Congress should act to stop @realDonaldTrump from following through on his threat to burn our health insurance system to the ground."]["GOP &amp; Dem governors have urged Congress to keep our promise to families &amp; hold down health insurance premiums. We should listen to them."]["Cutting off payments that help low-income families afford health insurance is petty, cruel, &amp; just plain dumb."]["Chairman @ChuckGrassley should reject @SenateMajLdr’s dangerous proposal to end blue slips &amp; stand up for fair courts &amp; equal justice."][".@SenateDems won’t sit silently while the rich &amp; powerful rig our courts &amp; ram through even more radical, right-wing, pro-corporate judges."]["Now @SenateMajLdr wants to end the decades-long tradition of letting senators weigh in on home-state judicial noms. https://t.co/2qZSP9uCXO"][".@SenateMajLdr McConnell &amp; the GOP used every tool to stop fair, noncontroversial Obama judicial nominees from serving on federal courts."]["Our federal govt must commit to helping the people of Puerto Rico &amp; the US Virgin Islands. US citizens deserve that much from their govt."]["Step up &amp; do your job, @realDonaldTrump. Stop lying about how well things are going in Puerto Rico. Stop trying to avoid responsibility."]["All along, @realDonaldTrump's response in Puerto Rico has been too little, too late. But he gives himself an \"A+.\" Give me a break."]["It is outrageous that @realDonaldTrump is making veiled threats to withdraw relief workers from US citizens in need. That's poor leadership."]["Puerto Rico is still facing a humanitarian crisis. @realDonaldTrump seems more worried about blaming hurricane victims than helping them."]["To all the girls out there who face challenges and barriers and people telling you no: keep fighting like a girl. #DayOfTheGirl https://t.co/gFhz63M4MD"]["I’ll keep fighting for a world where everyone feels safe to be who they are and love who they love. #NationalComingOutDay https://t.co/acho7T1Qgi"]["Congress needs to step up and do its job so doctors and nurses and health centers can do theirs. https://t.co/0y1DjwsKLE"]["Before millions are subjected to another data breach like @Equifax – we must do something about it. That’s why I introduced the FREE Act. https://t.co/xByqeZg1ta"]["Access to birth control is about freedom &amp; the ability to plan &amp; build a future. This attack on basic health care is wrong."]["The year is 2017, not 1917. Millions of Americans use contraception to prevent pregnancy, avoid STIs &amp; manage health conditions."]["Evidently the GOP believe the single most important issue facing our nation is to let employers deny women access to birth control coverage."]["Enough is enough. The credit reporting industry is broken. I want consumers to have control of their own data – not companies like @Equifax. https://t.co/hD5uuykAsD"]["It's ok, @FoxNews! We can agree that @WellsFargo CEO should be fired. This isn't about politics. It's about protecting our pocketbooks. https://t.co/0TPWRHfIEs"]["Incentives for companies like @Equifax are out of whack. Consumers should control their own data. Execs should face consequences for neglect"][".@Equifax did a bad job protecting data because they had no reason to care. They’re making MORE money selling fraud protection products. https://t.co/mhjoCMwH9w"]["About to question the former @Equifax CEO about his company’s inexcusable data breach &amp; response. Watch live: https://t.co/QGWCNeXZnq"]["The fmr CEO of @Equifax is testifying before the @SenateBanking Committee this morning. Watch the hearing live here: https://t.co/QGWCNeXZnq"][".@WellsFargo will never change if the people responsible for the fake accounts scam are still in charge. CEO Tim Sloan needs to be fired. https://t.co/mXswRnulxs"][".@WellsFargo CEO Tim Sloan enabled the bank’s massive fake accounts scam, got rich off it, &amp; helped cover it up. He should be fired. https://t.co/AO4ikpq74G"]["I have more questions for @WellsFargo CEO Sloan about his plans for his lower-level employees. Watch now: https://t.co/nm6TAiiTU6"]["About to question @WellsFargo CEO Sloan about his role in the massive fake accounts scandal. Watch live now: https://t.co/nm6TAiiTU6"]["The new CEO of @WellsFargo is testifying before the @SenateBanking Committee. Watch the whole hearing live now: https://t.co/nm6TAiiTU6"]["The federal government cannot turn its back on our fellow US citizens who are stranded without food, water, electricity &amp; medicine."]["We are worried sick about our brothers and sisters in Puerto Rico and the US Virgin Islands. We must act NOW. https://t.co/1ESchwlqZF"]["Tragedies like Las Vegas have happened too many times. We need to have the conversation about how to stop gun violence. We need it NOW."]["I’m heartsick for people in Nevada &amp; across the country who woke up to this news &amp; are worried that their family &amp; friends are ok."]["I’m heartsick for the victims of last night’s massacre in Las Vegas &amp; their loved ones."]["The definition of \"poor leadership\" is sitting at your golf club while millions of US citizens beg for your help, @realDonaldTrump."]["Disaster relief workers &amp; volunteers are doing God's work right now. PR needs help, not bullying, from the @POTUS. https://t.co/taJi5os93C"]["PR is in CRISIS. US citizens are dying. Millions of people need their govt's help. Stop playing politics with their lives, @realDonaldTrump."]["FEMA's Puerto Rico plans are outdated &amp; are outpaced by charities. Distribution is woefully inadequate &amp; people need basic medical care now."]["I just got off the phone with Mayor @CarmenYulinCruz. I told her to keep up her heroic work &amp; leadership on behalf of Puerto Rico."][".@realDonaldTrump should use his authority to more quickly &amp; comprehensively respond to Puerto Rico &amp; the USVI. These Americans need us. https://t.co/s7pHTXOkyV"]["Congress must immediately take up an appropriations bill to come to Puerto Rico &amp; the US Virgin Islands’ aid."]["Today I met with community leaders &amp; local officials in Worcester &amp; Springfield, &amp; listened to family of people struggling to survive in PR. https://t.co/utRGmqylko"]["Every day, I get more &amp; more calls from people across MA who are desperately worried about the people they love in Puerto Rico."]["With every day that passes, I’m more outraged that the federal govt isn’t doing more to help our fellow Americans in Puerto Rico &amp; the USVI."]["Puerto Rico was already suffering from an economic crisis long before it got hit by the hurricane. Now it faces another humanitarian crisis."][".@realDonaldTrump should pick a new @HHSGov Sec who cares less about luxury travel &amp; ripping away health care &amp; more about families' health."]["The Janus case could tilt the playing field further in favor of corporations &amp; make it much harder for workers to stand up for themselves."]["In deciding to take up the Janus case, the GOP-appointed SCOTUS majority is poised to deal the knock-out blow to public sector unions."]["When the GOP stole @BarackObama's SCOTUS seat &amp; forced Gorsuch through the Senate, they knew their investment would pay off. Today it has."]["Powerful interests invested vast sums of money into confirming judges who will tilt our courts in favor of billionaires &amp; big businesses."]["And the GOP tax plan will explode the deficit, which will lead the GOP to say we need to gut Medicaid, Medicare, infrastructure &amp; education."]["The GOP plan gets rid of the state/local tax deduction for working families while repealing the estate tax for a handful of rich families."]["While the GOP plan slashes the income tax rate for the highest earners, it increases the tax rate that applies to many working families."]["The GOP tax plan delivers massive tax cuts to millionaires &amp; giant corporations &amp; kicks working families to the curb."]["The “new” Republican tax plan is the same warmed-over, trickle-down plan they’ve been pushing for decades."]["The people of Puerto Rico &amp; the USVI need to know their federal government hasn't forgotten them and is doing everything it can to aid them."]["Today I joined fellow Democratic senators in calling for an appropriations bill immediately to help the people of Puerto Rico &amp; the USVI. https://t.co/5tjD3M8mCv"]["Millions of Americans live on Puerto Rico &amp; the USVI. They'll need huge immediate &amp; long-term aid – far more than they've received so far."]["In the wake of powerful hurricanes, Puerto Rico &amp; the US Virgin Islands face an urgent humanitarian crisis. Congress must address it NOW."][".@SenateGOP withdrew their latest health care repeal bill because they didn’t have the votes. I have two words for you: Thank You. https://t.co/EKbCQUH7ra"][".@realDonaldTrump isn't following through on his promise to fix NAFTA and boost working families. It's time for Congress to take action."]["I also wrote a bill w/ @SenSherrodBrown &amp; @SenGillibrand to stop states from restricting workers' right to unionize. https://t.co/DdOxn2HdKp"]["I wrote to the Admin demanding the removal of ISDS from NAFTA. We should look out for families – not corporations. https://t.co/NVJNOV64uO"]["Now @realDonaldTrump &amp; his Administration are reportedly proposing NAFTA provisions that do nothing to bring back American jobs."]["The Trump Administration has failed to get rid of ISDS - the corporate courts in NAFTA that give big businesses their own special rights."]["Despite promising to fix NAFTA's problems, @realDonaldTrump &amp; his Admin have failed to fight for workers through the first 3 rounds."]["The fundamental problem with NAFTA is simple: the agreement doesn't work for American workers."]["The American public deserve answers about what went wrong at @Equifax and what the company plans to do going forward."]["Former @Equifax CEO Smith, along with the new Chair &amp; interim CEO, should all testify before the Senate Banking Committee."]["It's not real accountability if the @Equifax Chairman &amp; CEO resigns without giving back a nickel in pay or publicly answering questions."]["I’ve called for @Equifax execs to be held accountable for their role in failing to stop the data breach &amp; hiding it for 40 days."]["Red alert: this vote could happen as soon as tomorrow. https://t.co/jFk1IL6j0d"]["The @SenateGOP hope you won't notice when they vote to take away your legal right to take big banks to court. This is all hands on deck. https://t.co/kcEvwLGNF6"]["Heading to the Senate floor now to tell the @SenateGOP: Stop fighting for the powerful interests &amp; do your job: https://t.co/jc1R7Es8hG"]["The @SenateGOP are also on the verge of reversing a @CFPB rule that helps you hold firms like @WellsFargo &amp; @Equifax accountable in court."]["9/30 is the deadline for funding CHIP, community health centers, Medicare programs, Medicaid payments, &amp; more. They’re waiting for a vote."]["The @SenateGOP have tried to manufacture a health care crisis to justify repealing the ACA, but a real crisis is about to unfold."]["I’m joining the @IndivisibleTeam live now to talk about why we must #killthebill &amp; save Americans’ health care. Watch! https://t.co/1m1cF9H3g4"]["A man who spent 40 yrs union busting has no business on the @NLRB. Heading to the floor to oppose William Emanuel: https://t.co/jc1R7Es8hG"]["If Congress won't stand up for workers, the very least we can do is give these workers a chance to join together &amp; stand up for themselves."][".@SenateGOP: before you vote to repeal the Affordable Care Act next week, listen to the doctors in your state begging you not to. https://t.co/l7SrlsCnuh"]["We must keep the pressure on to make sure this disaster of a bill isn’t passed next week. https://t.co/OO21dxAOD1"]["The fight to protect Medicaid and the Affordable Care Act is a fight for life and death for people who need opioid addiction treatment. https://t.co/kOlHuUaGYF"]["The federal government must move quickly &amp; do whatever is needed to help Puerto Rico &amp; the US Virgin Islands recover from Maria &amp; Irma."]["My thoughts are with the millions of Americans in Puerto Rico &amp; the US Virgin Islands. I hope electricity and safety are restored quickly."]["I stand with @SenFranken in saying no: We won’t let Trump &amp; the GOP bypass the process &amp; stack courts with pro-corporate, right-wing judges."]["Even worse, Trump &amp; the GOP want Dems to blue slip (aka rubber-stamp) their pro-corporate, right-wing nominees to advance. It’s insulting."]["Trump &amp; the @SenateGOP’s latest trick: flout the precedent of consulting home-state senators on nominees to serve on courts in their states."]["The judges who sit on our courts should have one mission: to provide equal justice under law."]["@Equifax @WellsFargo Corporate executives need to know they’ll be held personally accountable just like anybody else. Otherwise, the consumer scams won’t stop."]["With the @Equifax breach, I’ll be pushing for the same type of corporate accountability that I sought in the @WellsFargo scandal. https://t.co/guOOMepfp2"]["@WellsFargo But I'm still fighting for accountability at @WellsFargo. I'm pushing the Fed to remove all the Board Members who oversaw the scam."]["A year ago today, I told the then-CEO of @WellsFargo he should resign after the bank's massive fake accounts scam. He did. https://t.co/DDM1keBQkF"]["I’m doing everything I can to fight back against the Graham-Cassidy \"health care\" bill – but we need lots of people speaking up again."]["I told MGH Chelsea: The @SenateGOP Graham-Cassidy “health care” bill is just the same set of terrible policies with a fresh coat of paint. https://t.co/P5kw3e66ZS"]["MGH Chelsea keeps families healthy &amp; strengthens our community. They know what repealing the ACA &amp; gutting Medicaid means to MA families. https://t.co/7ZYUAYFzFR"]["@Equifax The credit reporting industry is broken and has been taking advantage of consumers for years. Time to do something about it."]["The @Equifax hack is a nightmare. I introduced the FREE Act to give consumers back control of their data. Congress should pass it ASAP. https://t.co/RtiC0tkc9Q"]["Heading to the floor to discuss the @Equifax breach. People are right to be outraged. https://t.co/jc1R7Es8hG"]["RED ALERT: Trumpcare is not dead. https://t.co/MPsQn1hP65"]["@SenateGOP Tonight I’m joining @SenateDems on the floor to fight (again) to save Americans’ health care. Watch live now: https://t.co/jc1R7Es8hG"]["Cassidy-Graham is just another version of the same old heartless “health care” plan the @SenateGOP have tried to jam down our throats."]["Happy Birthday, @usairforce! Happy to celebrate last week by speaking with Senior Airman Schultz of Springfield, now deployed to SW Asia. https://t.co/G6WRWDnLFx"]["My thoughts are with the Marseille acid attack victims, reportedly BC students. My office has reached out to BC to help however we can."]["The fight to save heath care isn't over. Sound the alarm. We need you to fight today &amp; every day until this @SenateGOP bill is dead."]["Coverage ripped away from tens of millions of Americans with Graham-Cassidy – kids with disabilities, grandparents in nursing homes."]["Graham-Cassidy completely eliminates help for families to buy health insurance. Gone. Good luck on your own."]["The @SenateGOP Graham-Cassidy \"health care\" bill cuts Medicaid funding &amp; rolls back protections for people with pre-existing conditions."]["There's nothing new &amp; improved about the Graham-Cassidy bill – it's the same cruel @SenateGOP \"health care\" bill, but on steroids."]["The @SenateGOP have a big 9/30 deadline to repeal the Affordable Care Act. And here's the scary thing: they might have the votes to do it."]["The Boston Harbor Dredging Project will create jobs, improve the passage of goods, &amp; improve Boston's long-term economic competitiveness. https://t.co/HcoffzUBDu"]["I was happy to join today's kickoff celebration of the Boston Harbor Dredging Project – deepening the harbor to allow bigger ships. https://t.co/zlybo7F35U"]["The Port of Boston has been vital to our economy since the colonial era. But we need to keep investing in infrastructure for it to succeed. https://t.co/DNr0ItoTBT"]["This is good news. At least for now, @realDonaldTrump &amp; AG Sessions can’t bludgeon towns into complying with dumb &amp; dangerous ICE policies. https://t.co/G0U54CuF5Z"][".@AnthemInc's decision is great – but insurers making huge profits off taxpayers shouldn’t need to be shamed into providing coverage."]["Today, @AnthemInc sheepishly announced that they’re partially reversing their decision to leave VA. https://t.co/PBdBMxFub0"]["Yesterday, I called out @AnthemInc for abandoning people in states because Congress won’t help them to squeeze huge profits out of patients. https://t.co/y65E14odXK"]["I’m glad the Senate passed our bipartisan Jobs for Heroes Act yesterday. I hope the House will pass it soon. https://t.co/3TNSO1Q9cM"][".@JohnCornyn &amp; I wrote a bipartisan bill removing obstacles that delay servicemembers' commercial drivers’ licenses. https://t.co/Ik99SrJbSS"]["Veterans who have the training &amp; experience to operate trucks &amp; buses in combat zones have the skills to drive trucks on our highways."]["@Equifax @gao @FTC @CFPB @USGAO We're fighting to hold @Equifax accountable. In the meantime, the @CFPB has a helpful guide to protect yourself: https://t.co/DN3uyhomux"]["I sent letters to @Equifax, the other credit reporting agencies, regulators, &amp; @GAO to figure out how we can reform this broken industry. https://t.co/qL0oN7OQhz"]["On top of these bills, I launched an investigation into the @Equifax breach &amp; credit reporting industry in general. https://t.co/VLssJGpmC6"]["Bad credit doesn’t make you a bad employee. Workers should compete on the merits, not on their credit scores."]["I also reintroduced the Equal Employment for All Act to prevent employers from asking job applicants for their credit histories. https://t.co/dYO2PXEPWs"]["The idea behind our bill is simple: @Equifax doesn't pay you when they sell your data. You shouldn't have to pay them to stop selling it."]["The FREE Act lets you freeze – and unfreeze – access to your credit file at no cost. It's like a free Do Not Call list for your credit data."]["Companies like @Equifax make billions selling access to your data without your consent, then charge you if you want to stop them. It's nuts."]["I introduced the Freedom from Equifax Exploitation (FREE) Act with @brianschatz. Our bill gives you more control of your data. https://t.co/l5pboE0t4q"]["Lot of people are outraged about the @Equifax data breach. I am too. Here’s what I’ve been doing about it this week."]["Today I told an @AnthemInc VP: If they want to make huge profits off taxpayers, they ought to provide decent coverage through the ACA. https://t.co/i6KU8bRKg2"]["More than half of @AnthemInc's revenue comes from programs like Medicare &amp; Medicaid. But they're abandoning people in ACA exchanges."]["Insurance giant @AnthemInc sent Congress a ransom note: bigger tax cuts, or they’d pull out of more state health care exchanges."]["When the GOP tried to repeal the ACA, some – like @BCBSMA – fought for their customers. But not @AnthemInc."]["Undermining the INF Treaty is grossly irresponsible. Heading to the floor now to discuss my NDAA amendment. Watch: https://t.co/jc1R7Es8hG"]["Today I stood with @SenSanders to support his Medicare for All bill. Health care is a basic human right &amp; we fight for basic human rights. https://t.co/Pv7pu8fOM3"]["@USChamber The companies paying for a @USChamber membership – they’re being taken for a ride."][".@USChamber sucks billions of dollars from member companies – so it’ll pick a losing fight if it has to, as long as the money keeps flowing."]["The fiduciary rule is working for consumers, start-ups and big investment companies. So why is the Chamber of Commerce trying to kill it? https://t.co/mqhDnNK0Hj"]["@RandPaul It’s long past time for Congress to do right by our troops &amp; the American people, which is why I’m supporting @RandPaul’s AUMF amendment."][".@RandPaul is fighting for an amendment to the annual defense bill that would repeal the AUMF &amp; give Congress six months to replace it."]["It’s been 16 yrs since Congress passed the existing AUMF after 9/11, but yr after yr, Congress refuses to re-examine this outdated policy."]["Read my @BostonGlobe op-ed on why we must give opioid addiction treatment providers the support they need. https://t.co/HVdk8y0KCJ"]["I met with MA opioid addiction treatment providers who give affordable, innovative care – but they’re stretched too thin. https://t.co/L8eWzLZWXx"]["The opioid epidemic hits all of MA, so we surveyed health providers about how we can improve &amp; expand their work. https://t.co/HqWGUwd0EW"]["To everyone who wrote emails, tweeted, and showed up: Thank you! You saved health care in America. Keep it up, we need you in these fights. https://t.co/PJJH4ujIpc"]["Equifax proves why we must protect your right to join class actions. https://t.co/Z2APQcRb0K"]["Keep fighting, @RepJayapal! #NeverthelessShePersisted https://t.co/QssQq3hWpk"]["Happy to keep the Labor Day celebrations going with the Pioneer Valley CLC today! https://t.co/fAASUbmBtP"][".@wesoldieron is an incredible organization fighting to end veteran homelessness. Very glad to visit their women's program in Leeds today. https://t.co/AWd3so5ufE"]["The @CFPB's new rule would stop companies like @Equifax from avoiding legal accountability like this -- as long as @GOP doesn't reverse it."]["That's right: @Equifax fails to protect your data and then they demand you give up legal rights if you want to limit the damage they caused."][".@Equifax is forcing you to give up your right to join a class action against the company if you want their credit protection product. https://t.co/anu0SE58wg"]["The @Equifax breach is Exhibit A for why we must stop @GOP from reversing the @CFPB's rule protecting your right to join class actions."]["It's also outrageous that @Equifax waited so long to disclose the breach -- needlessly leaving nearly half of America at risk for a month."]["It's outrageous that @Equifax -- a company whose one job is to collect consumer information -- failed to safeguard data for 143M Americans."]["I'm glad community bankers agree: @WellsFargo's Board should be removed. Government must hold big banks accountable. https://t.co/hPb8mAaNF4"]["About to speak on the Senate floor about why we must #DefendDACA and pass the Dream Act now. Watch: https://t.co/jc1R7Es8hG"]["Thank you, @MassAGO Healey, for fighting for Dreamers in MA &amp; across this country. #DefendDACA https://t.co/1OeWJUj7NQ"]["The fight over @CFPB’s arbitration rule is about whose side you stand on: big Wall St banks or military families. https://t.co/3fhi2b8osa"]["I agree, President Obama. https://t.co/A7oRZq5JeH"]["We cannot sit back while our family, friends &amp; neighbors are driven out of their homes. We must fight to protect Dreamers &amp; #DefendDACA."]["America should keep its promises. If @realDonaldTrump doesn’t know that, then Congress must act to make DACA permanent. #DefendDACA"]["Turning our backs on Dreamers makes us weaker, makes us less safe, &amp; betrays our values. #DefendDACA"]["Subjecting Dreamers to mass deportation is part of the bigoted policies that are a cornerstone of @realDonaldTrump’s admin. #DefendDACA"]["Very proud of the @MMAAdmissions &amp; their officers for stepping up to help our friends &amp; family in the Gulf Coast. https://t.co/Ihw3jCxGrD"]["Read my office’s new #LaborDay report on how @realDonaldTrump has betrayed America’s working men &amp; women. https://t.co/9I1Kom4XD2"]["And Trump has proposed huge cuts to @USDOL’s budget – damaging its ability to enforce labor laws &amp; protect/support workers. #LaborDay"]["Trump has delayed/weakened basic worker protections: overtime, beryllium &amp; silica exposure, mine safety, EEOC data, &amp; more. #LaborDay"]["Trump’s nominees for @USDOL &amp; @NLRB have a history of turning their backs on working people. #LaborDay"][".@realDonaldTrump's record is clear: over and over, he’s delivered one sucker punch after another to America's workers. #LaborDay"]["Happy #LaborDay! Today we say loud &amp; clear: Unions built America's middle class, &amp; unions will rebuild America's middle class. https://t.co/8qd2b8zx16"]["Glad to start this #LaborDay in Worcester the 46th annual Central @MassAFLCIO Labor Day breakfast! https://t.co/IYD2pAkFTV"]["@BetsyDeVosED @usedgov Is @BetsyDeVosED trolling us with this DeVry hire? It's astounding, &amp; it’s exactly why I launched #DeVosWatch. https://t.co/3Wcyjh0TJL"][".@BetsyDeVosED hired a former DeVry official to be the cop in charge of policing sham colleges at @usedgov. https://t.co/Irw7VzOyr1"]["Opioid treatment centers like High Point rely on Medicaid. Recent threats put their patients at risk. We need to expand – not cut – funding."]["Last wk, I visited the High Point Treatment Center in Plymouth, a treatment facility on the front lines of the opioid epidemic. #EndOverdose https://t.co/YKlDa6FCNB"]["More than 2000 people died of opioid overdoses in Massachusetts last year. It's an epidemic – and it's heartbreaking. #EndOverdose"]["To every DREAMer in this country: You are an American. This country is your home. And we’re fighting for you. #saveDACA"]["Ending DACA would tear apart families &amp; rip young people away from the only country they’ve ever known. #saveDACA"]["I'm proud of all the men &amp; women in uniform from Massachusetts who are helping with efforts in Houston. https://t.co/BMccQFvqlQ"]["Congress also can't look the other way. We need the @WellsFargo hearing Dems called for earlier this month. https://t.co/hkgsDJt8V4"]["The @federalreserve should remove every @wellsfargo Board member who served during this scandal. I don't know what they're waiting for."]["Unbelievable. @WellsFargo's massive fraud is even worse than we thought. https://t.co/eVJgAgNR0i"]["Think tanks play a critical role in shaping policy, but their credibility is jeopardized when decisions are based on funder preferences."]["This story is troubling. https://t.co/UmRVi2UnSI"]["The people of the Gulf Coast desperately need our help. MA will keep doing everything we can to come to their aid. https://t.co/NdyVVTqp0T"]["And I’m glad that Boston Mayor @Marty_Walsh is sending high-water rescue vehicles &amp; cots to help the people of Houston."]["I’m also glad that two Coast Guard helicopters, a plane, &amp; crew from Cape Cod are already helping with Hurricane #Harvey rescue efforts."]["For updates, safety info &amp; ways to help Hurricane #Harvey victims, go to the @RedCross gulf coast website: https://t.co/k1eadYr9Pe"]["When the unthinkable happens, we rely on each other for help. The victims of Hurricane #Harvey – good, hardworking people – need us now."]["I’m heartsick for Texas. Houston is where I lived after I got married at 19, graduated from college &amp; got my 1st full-time law-teaching job."]["Tonight's 13th town hall of year was our biggest yet: 1500 people filled Concord Carlisle HS's auditorium, cafeteria &amp; lawn. THANK YOU! https://t.co/bEeY7G9726"][".@SenFranken and I need your help to stop Congress from giving away your right to hold big banks accountable. Watch: https://t.co/fiITw5IdZn"]["Wow, 1100 people jammed Furnace Brook Middle School for our Marshfield town hall tonight! Thank you all for joining us! https://t.co/ShT38w6aEl"]["I'm deeply grateful for the 800 people who packed our @UMassD town hall tonight &amp; made their voices heard. Thank you! https://t.co/sm14lSLTtw"]["@USRepKeating We heard from business owners &amp; community leaders about how our gov can be better partners for the South Coast (&amp; ate some terrific cheese). https://t.co/9BOdbsqhEX"]["Today I was in Fall River with @USRepKeating for a tour of Portugalia, an incredible family-owned Portuguese market. https://t.co/gC4aWWH9kC"]["The President of the United States just defended neo-Nazis and blamed those who condemn their racism and hate. This is sick."]["Let me be clear: These cowardly acts of hate aren't welcome in Boston or anywhere else in this country. https://t.co/AJTTk8N92W"]["We make judgments as humans &amp; as a country about right &amp; wrong. When there's evil, we all need to say it. Especially our President."]["How can @realDonaldTrump can show whose side he's on? He can start by publicly calling this what it is: white supremacy."]["Someone was murdered at a Neo-Nazi rally today. That happened. In America. In 2017. It's time to make clear where we stand – all of us."]["This is great news for thousands of MA homeowners. @MassAGO Healey is one tough cookie! https://t.co/5P3fysnj3m"]["I'm grateful for the chance to grab dinner with MA military families in Wiesbaden. They represent our commitment to security in the region. https://t.co/MaL3bNnLIk"]["We also reaffirmed the need for the US &amp; NATO to remain united in countering these asymmetric tactics from Russia."]["We reaffirmed the need to strengthen Europe's capabilities against Russia's aggressive &amp; destabilizing activities throughout Europe."]["I spoke to a conference of senior military leaders in Germany, where I learned more about the US Army's efforts to support NATO &amp; Europe. https://t.co/KHfzVGcaBM"]["I stopped in Wiesbaden, Germany on my way back from Poland &amp; Estonia at the headquarters for US Army operations in Europe. https://t.co/fmtOzaNbtb"]["I also stopped by that Soviet statue. Tiny Estonia is on the frontline of Russian aggression - but they're not moving that statue back. https://t.co/icHASCMxEJ"]["Estonia has learned a lot about orchestrated cyber-attacks. Their expertise is critical to deter &amp; defend against Russian cyber-operations. https://t.co/0D5VHGNKtC"]["In 2007, Estonia moved an old Soviet statue. For days, Estonia was subjected to a massive digital siege of its banks, media, &amp; gov websites."]["I spent time in Estonia this week meeting with top officials &amp; visiting the NATO Cooperative Cyber Defense Center of Excellence. https://t.co/xtiQxrjOwf"]["As Russia engages in aggressive, destabilizing activity in the region, it's important for allies like Poland to know the US has their backs. https://t.co/ybR1xEJYSr"]["I've also been visiting our troops in Poznan &amp; Powidz, &amp; yesterday in Powidz I got to spend time with a unit from Brockton, MA. https://t.co/Ve64V0OZYC"]["For the last few days, I've been in Poland, meeting with US &amp; Polish officials &amp; learning more about Army operations across Eastern Europe. https://t.co/wZratrDflx"]["I'll miss @nikiinthehouse when she retires, &amp; MA will miss her leadership. But Niki's still got a lot of fighting left to do until then."]["Rep @nikiinthehouse is more than my colleague - she's a mentor &amp; a friend. She has shown me how tough women fight for MA families."]["We had a wonderfully thoughtful 10th town hall of the year in Revere last night with @RepKClark &amp; @joeboncore. Thanks to all who joined us! https://t.co/sCs2iOw48D"]["After WWII, a grateful nation helped soldiers get a college education. @realDonaldTrump should sign the #ForeverGIbill to help vets again."]["And our GI Bill legislation restores benefits for veterans who were cheated by predatory for-profit Corinthian Colleges &amp; ITT Tech."]["Our GI Bill legislation gives better Yellow Ribbon benefits for fallen servicemembers’ families, &amp; increased coverage for some reservists."]["I’m very glad to be an original cosponsor of a bipartisan bill to modernize &amp; expand the GI Bill. #ForeverGIbill https://t.co/hZtMcJcM61"]["Passing this bipartisan bill is good for every American who can’t afford $5000 for hearing aids. We’re going to help a lot of people."]["Huge news for millions who suffer hearing loss: Congress has passed my bill to allow certain hearing aids to be sold over the counter. https://t.co/vLuGuJGZwI"]["I voted against Marvin Kaplan for the @NLRB - &amp; I reminded my colleagues why hardworking Americans need an NLRB that’s on their side. https://t.co/Z1xOYuMesC"]["The Trump Admin &amp; @SenateGOP socked it to workers one more time before the summer recess: Confirming an anti-worker nominee to @NLRB."]["Despite all the drama of the Trump Admin, there's one thing they’ve carried out with complete precision: An all-out assault on US workers."]["Heading to the Senate floor to oppose Marvin Kaplan - @realDonaldTrump’s anti-worker nominee to the @NLRB. Watch: https://t.co/jc1R7EJJ9e"]["Rather than weakening the rules on @WellsFargo, Congress should root out all the fraud at the bank &amp; hold the right people accountable."]["Yesterday, my @SenateBanking Democratic colleagues &amp; I asked for a hearing with the @WellsFargo CEO &amp; Board Chair. https://t.co/XVCxipz1sZ https://t.co/Rkx2EJvrMF"]["Even with @WellsFargo cheating its customers left &amp; right, the @GOP wants to roll back the rules &amp; shield big banks from accountability."][".@WellsFargo is a mess. On top of its fake accounts, it charged almost 1M people for car insurance they didn't want. https://t.co/FoQ1VyfVra"]["Congress should pass our student loan servicer bill to ensure @usedgov never heads in the wrong direction again. https://t.co/3AnyT2qXi9"]["We must keep watching @usedgov to make sure its decisions are good for the millions of struggling federal student loan borrowers."]["Today @usedgov announced it will reverse its single loan servicer plan – &amp; I’m glad that they’re changing course. https://t.co/VFDmUun7KM"]["I worked w/ @RoyBlunt, @SenatorShaheen &amp; @SenatorLankford on a bill to stop @usedgov’s terrible loan servicer plan. https://t.co/09jl9Ien0I"]["In June we sent a letter to @BetsyDeVosED with concerns that a single servicer would make an unaccountable monopoly. https://t.co/vu9cTIZsO3"][".@usedgov Sec DeVos had a plan to hand over the entire student loan portfolio to just one “Too Big to Fail” company. https://t.co/FjLkGVy46c"]["@realDonaldTrump .@realDonaldTrump nominated Randy Quarles to be @federalreserve Vice Chair for Supervision, a position to regulate the big banks."]["We had a financial crisis when powerful people in government let big banks run wild. @realDonaldTrump wants to take us back down that road."]["The nightmare is over, at least for now."]["“Skinny repeal” is reckless, cruel &amp; immoral. If the @SenateGOP pass this bill, they'll show they just don’t care about American families."]["Only in the GOP alternative upside down reality can you hate a bill so much that you’re going to vote for it."]["Here’s what you learn in “How to be a Senator 101”: If you support a bill, you vote yes. If you don’t, you vote no."]["Mark my words: If the GOP can’t get a deal in committee that destroys the ACA even more, “skinny repeal” will become the law of the land."]["If the @SenateGOP wanted a bill they could fix in committee, it could’ve been blank piece of paper. They CHOSE to intro this malicious bill."]["And here’s the worst part: The @SenateGOP knows this bill is appalling. One senator called it “a disaster.” “The dumbest thing in history.”"]["CBO says this latest garbage bill will lead to 16 MILLION more uninsured. https://t.co/huOjkQsfha"]["This @SenateGOP bill they’re voting on tonight kills a part of the ACA key to keeping insurance affordable for everyone."]["From what I can tell, “skinny repeal” just means gutting important parts of the Affordable Care Act."]["So here’s the deal: In the dead of night tonight, the @SenateGOP will try to pass a “skinny repeal” of health care."]["The @SenateGOP “skinny bill” is here and it’s exactly as wretched as we thought it’d be. https://t.co/nRxBnQloQB"]["\"C’mon, @SenateGOP. Pass a terrible 'skinny repeal' of health care &amp; we'll 'fix it' in committee!” ?!? https://t.co/fv5Uc9lro1"]["Health care for millions of Americans hangs in the balance and it will all unfold tonight. Here’s what’s happening: https://t.co/gF4A42GxBq"]["The American people don’t think that guaranteed health care is a joke. I look forward to the @SenateGOP learning that lesson."]["The @SenateGOP thinks guaranteed health care is all a big joke. They’re using it as a cynical ploy to play political football."][".@SenSanders is correct: Health care is a right, not a privilege. We have a moral obligation to make sure everyone has access to it."]["We won't let the @SenateGOP pass a bill that defunds Planned Parenthood and strips women's access to basic medical care. We will fight back. https://t.co/QCkqcp76Oq"]["\"Skinny repeal\" should be called \"gut it and run.\" Voting to destroy insurance markets and kick millions off health care remains immoral. https://t.co/D8N1Jlk6tD"]["If the Senate passes \"skinny repeal\" then the @GOP will go into a back room to \"compromise\" between 15M and 23M people losing health care."]["And \"skinny repeal\" would likely result in at least 15 MILLION people losing health insurance. https://t.co/v40pO3cQua"]["If the Senate passes \"skinny repeal\" – which guts the marketplace – premiums will skyrocket. Insurers will quit."]["Senators can hide their final health care bill from the public, but they can't hide from the consequences of their votes."][".@SenateDems will vote to protect Planned Parenthood – and we will vote down this terrible proposal."]["These next votes are on “repeal and run” of the Affordable Care Act – with a ban on Planned Parenthood funding thrown in for kicks."]["This morning @SenateDems will vote to kill @SenateMajLdr McConnell’s second attempt at ripping health care away from millions of people."][".@realDonaldTrump can pretend this is a military decision, but it isn't. Banning troops on gender identity is shameful &amp; makes us less safe."]["By attacking thousands of troops, @realDonaldTrump makes clear that he cares more about extreme ideology than military readiness."]["The only thing – only thing – that matters when it comes to allowing military personnel to serve is whether or not they can handle the job."]["This vote will be the first of many @SenateGOP failures. We're doing everything we can to defend the health care of millions of Americans."]["In addition to being cruel, this first @SenateGOP proposal violates the Budget Act, so it needs 60 votes. It won't get them."]["Tonight @SenateDems will vote to kill @SenateMajLdr McConnell’s first attempt at ripping health care away from millions."]["I'll be talking with Rachel @Maddow about the @SenateGOP’s immoral health care vote soon. Tune in."]["The power to stop the Republicans’ health care bill isn’t in here. The power is with people like you. https://t.co/vNG0DsJfq3"]["We're here on the Capitol steps fighting back against this immoral vote to repeal Americans' health care. https://t.co/0T81m10URJ"]["And I urge my @SenateGOP colleagues: Listen to the world’s best doctors who say repealing the ACA would be devastating for their patients. https://t.co/Mv45JKu9PA"]["I urge my @SenateGOP colleagues: Listen to Jenny talk about how breast cancer &amp; autoimmune disease could bankrupt her family. https://t.co/9VjHrIjpfo"]["I urge my @SenateGOP colleagues: Listen to Chantel talk about her son Nicholas, who was born at 32 weeks &amp; needs Medicaid. https://t.co/o9GQc2lIKQ"]["I urge my @SenateGOP colleagues: Listen to Marika talk about her little boy who has had $4 million worth of medical care. https://t.co/hJhcL0vN1w"]["Americans have begged the @SenateGOP not to repeal their health care. Republicans, Democrats, &amp; Independents. Today, I'm begging too."]["This is not a drill. Within the hour, @SenateGOP will vote to start the process of destroying health care – with no specific plan yet. https://t.co/jvUkyzsGns"][".@NancyPelosi, @MaxineWaters &amp; I are speaking out against GOP efforts to roll back the arbitration rule. Watch now: https://t.co/6206l5Vhc6"]["President @realDonaldTrump &amp; every @SenateGOP member need to read this 10-yr-old boy’s letter before they repeal his mom’s healthcare today. https://t.co/DJpWKE5T4M"]["Heading to the floor now to urge the @SenateGOP: listen to the American people. Don’t repeal health care. Watch: https://t.co/jc1R7Es8hG"][".@realDonaldTrump’s nominee for Dep Sec of the @Interior, David Bernhardt, is a corporate insider &amp; walking conflict of interest. https://t.co/B53vzmQFCp"]["Dr. Pursley says cuts to Medicaid could be the largest threat facing our children that he’s seen in his 30 years on the job: https://t.co/OleXJkRb5x"]["We must have the @CFPB's back as Wall St's buddies in Congress try to roll back the rules. But today: we celebrate. Happy Birthday, @CFPB!"]["The big banks have been against the @CFPB from day one, and their armies of lobbyists are doing all they can to weaken this agency."]["For 6 years, the @CFPB has had 1 mission: to take tricks &amp; traps out of financial products like credit cards and hold cheaters accountable."]["Today is a special day. It’s the 6th birthday of the @CFPB – or, as I like to call it, the Little Agency That Could. https://t.co/TplGMEGlpJ"]["Our report shows: @realDonaldTrump’s team cares more about lining their longtime employers &amp; buddies’ pockets than helping working families."]["We released a report card tracking lobbyists &amp; insiders who have worked for @realDonaldTrump since the election. https://t.co/hklTnGGTWv https://t.co/ZoU6OglfxW"][".@realDonaldTrump broke his promise to “drain the swamp.” Instead of turning away lobbyists &amp; insiders, he welcomed them with open arms."]["I proudly stand with teachers to send a message to @realDonaldTrump and Education Secretary @BetsyDeVos: NO cuts to public education. https://t.co/IykfdyvEGS"]["Our hearts are with you, @SenJohnMcCain. Stay strong &amp; keep fighting."]["It’s time for the @SenateGOP to drop this “health care” bill for good – and do it immediately."]["Data nerds at the CBO confirm that the @SenateGOP “health care” bill would knock 32 million off their insurance. https://t.co/kgHxexC67X"]["The @SenateGOP dug themselves into a hole, &amp; they won’t stop digging. Their \"health care\" bill has gone from bad to worse to embarrassing."]["John Bush’s disrespect for others flatly disqualifies him for the 6th Circuit. Heading to the Senate floor now: https://t.co/tDuILDOoXx"]["Congress needs to step up &amp; pass comprehensive immigration reform. Until then, we must #defendDACA &amp; protect hard-working young immigrants."]["Extreme state AGs have threatened the Trump Admin to end #DACA. Students &amp; young workers who call the US home could be deported. #defendDACA"]["Since 2012, #DACA has protected 800k young people brought to the US as kids from mass deportation. Nearly 22k in MA alone. #defendDACA"]["I’m not at all convinced that working people can rely on William Emanuel to stand up for their rights. I opposed his confirmation to @NLRB. https://t.co/MOXyhQg8Wy"][".@realDonaldTrump’s @NLRB pick spent decades at union-busting law firms, making it harder for workers to improve wages &amp; working conditions."]["We need to defend the ACA – but defending it isn’t enough. It’s time to make both small and big changes to improve health care in America. https://t.co/7IGL8xchVG"]["People from MA &amp; across the country fought this cruel \"health care\" bill &amp; won. We proved: when we fight back, we can win. THANK YOU."][".@realDonaldTrump intends to “let Obamacare fail” by sabotaging it from inside. We can't let down our guard now. https://t.co/hBt2TpuZWl"]["I’m not doing a touchdown dance over health care today. This zombie bill has come back from the dead over &amp; over again."]["It’s abundantly clear: the @SenateGOP don’t have the votes for their tax cut bill – or the votes to repeal the ACA. https://t.co/rQJuFoMoCd"]["Health care is a basic human right – and we’re still out here fighting for it. #ProtectOurCare #SaveMedicaid"]["“70% of Trump's picks for top sub-Cabinet jobs have clear corporate ties.” That’s gov that works for big corporations, not working families. https://t.co/eRNOxYDxxI"]["It took 3 rooms to fit all 1300+ people who came to our town hall at Cape Cod Community College in West Barnstable today. Thank you all! https://t.co/5qbgJmLoT2"]["Now House Republicans are stalling to stop this bill from becoming law. Who are they protecting: Trump or his buddies in the Kremlin? https://t.co/N6lVDUe6s6"]["President Trump asked Putin if he hacked US elections, and then asked him again \"a different way.\" When Putin denied it, Trump gave up."]["Wishing my very best to @SenJohnMcCain &amp; his family. John is one of the toughest fighters I know. I'm sure he'll make a speedy recovery. https://t.co/WQYZCYza6H"]["Holy guacamole, we had 1300 people at our Martha's Vineyard town hall this morning! This is what democracy looks like. Thank you for coming! https://t.co/k4muqC67SO"]["I spoke with Foxborough resident Chantel on the phone recently. She’s worried about what cuts to Medicaid would mean for her son's health. https://t.co/QAfPKCf2eM"]["The Fed can remove @WellsFargo Board members for their role in the fake accounts scam. Yesterday I asked the Fed Chair: why won't you do it? https://t.co/o00KuAz79c"]["Senator @CoryBooker &amp; I want to change our country’s approach to women in prison with the Dignity for Incarcerated Women Act. https://t.co/GD3bsbv3fl"]["The @SenateGOP health care bill released today is the worst one yet: https://t.co/39hBpWXffC"]["I'm reading the latest way that Senate Republicans plan to rip health care away from millions of people. I'll share my thoughts soon. https://t.co/oe9z4bhqFA"]["Thanks @studentvets! Glad to help our vets with student loans get the benefits they deserve. @PattyMurray &amp; I have been at this for a year. https://t.co/HnPpSe4JQp"]["We need a free &amp; open internet – not one that tilts the playing field for the rich &amp; powerful who already made it. We need #netneutrality"][".@realDonaldTrump’s @FCC wants to end #netneutrality so a handful of big companies can block, filter or charge more for what we do online."]["We don’t know who is going to have the next big idea in this country, but they’re probably going to need to get online to do it."]["Back in DC, but still thinking about my trip to Afghanistan. The Administration owes our troops a definition of victory &amp; plan to get there. https://t.co/K5CP8KcLIV"]["Neomi Rao will help the Trump Admin toss out rules big business doesn’t like. I voted No on her nomination for OIRA. https://t.co/tfIBXXURip"]["On my way to the floor to oppose Neomi Rao for head of the Office of Information &amp; Regulatory Affairs. Watch: https://t.co/jc1R7Es8hG"]["Big business lobbyists will spend millions attacking the @CFPB’s arbitration rule. We must be ready to fight back. https://t.co/mIqhosADPx"]["The @CFPB just issued a new rule that bans forced arbitration clauses &amp; lets families hold financial firms accountable when they’re cheated. https://t.co/e3329PBC4U"]["If a credit card company cheats you, it’s hard to hold them accountable. Financial contracts often block you from banding together in court."]["Every Senator – no matter the party – should step up and fight for the millions of babies like Peter who can’t speak for themselves. https://t.co/YiSc3GedAw"]["Breast cancer and an auto-immune disease are hard enough on Jenny. She shouldn’t have to face bankruptcy trying to save her life. https://t.co/q1IVKObiV7"]["We filled 2 auditoriums &amp; still had folks waiting outside for our terrific Pittsfield town hall today. Thanks for making your voices heard! https://t.co/tMzz2JQExC"]["I’ll continue to think about what I saw this week in Afghanistan &amp; incorporate it into my work on the Senate Armed Services Committee. https://t.co/i70hxkplzx"]["Nothing can take the place of seeing what is happening in the region with our own eyes &amp; speaking to the men &amp; women on the ground. https://t.co/Z8IqyaZufj"]["I'm grateful to @SenJohnMcCain for organizing our bipartisan trip to Pakistan &amp; Afghanistan this week. https://t.co/vlwGGUZEAZ"]["While they have taken positive steps, we told Pakistani leaders they must do more to eliminate safe havens &amp; terrorist groups in the region."]["In South Waziristan, Army &amp; local leaders showed us how USAID's development projects are making a real difference in people's lives. https://t.co/ChTU5QUhNI"]["I met with Pakistan Army Chief Gen. Bajwa to discuss the critical role Pakistan must play in countering terrorism in the region. https://t.co/sHaHADJQSu"]["I traveled to Pakistan this week with @SenJohnMcCain &amp; a bipartisan group of Senators to discuss counterterrorism &amp; security in the region. https://t.co/4ScrgytVJE"]["@MassAGO @BetsyDeVosED Betsy DeVos might not like it, but her job is to serve students - &amp; if she won't do it, we will force her to do so. https://t.co/BZbf8v4dlp"]["Today, @MassAGO Healey is leading 18 states in a lawsuit to force @BetsyDeVosED to follow the law &amp; cancel the loans of cheated students."]["MA is challenging Betsy DeVos's illegal attempt to protect fly-by-night schools that cheat students &amp; bury them in mountains of debt."][".@SenateGOP can wave their hands and say everyone will be fine – but here’s what will happen to our seniors if this bill passes. https://t.co/8fe524UuRY"]["Less than .5% of Americans serve in our military. I recently asked Elizabeth Dole @DoleFoundation: how can we all support military families? https://t.co/01doW3aOF0"]["Good news: Jessica &amp; Patrick's bipartisan bill to help domestic terrorism victims made it into the Senate defense bill last week. https://t.co/rMb9J5vfhe"]["Wishing everyone back in Massachusetts, across our country, &amp; far away from home a safe &amp; happy 4th of July celebration. https://t.co/yvAO4LWM47"]["I'm grateful to the men &amp; women who made this trip to Afghanistan possible. https://t.co/esj6UjvmT3"]["We also visited Forward Operating Base Gamberi to hear from the soldiers involved in training Afghan counterparts in Eastern Afghanistan. https://t.co/LSdo0aB874"]["Our deployed troops are incredible, &amp; we got to participate in a promotion &amp; award ceremony for a group of them. https://t.co/4jFeAQc2Gz"]["Today I also got to have lunch with servicemembers from Massachusetts deployed to Afghanistan. https://t.co/0P6IN53Y2U"]["We met with Afghanistan's top leaders in Kabul and received an operational update from General Nicholson and his team."]["When General Nicholson, our Commanding General in Afghanistan, visited me in DC, I told him I'd like to return the favor. https://t.co/BxE3J5f3Gx"]["I’m honored to be spending this 4th of July visiting our troops in Afghanistan. https://t.co/PVkWCoeZGt"]["Great work, Minneapolis! https://t.co/bJ5tLd7mMa"]["Health care pros want @SenateGOP to know: people without healthcare coverage are more likely to die than people with healthcare coverage. https://t.co/tgQw3iHGoe"][".@SenateMajLdr still intends to vote on this shameful healthcare bill. CEOs have stayed quiet. They must speak up. https://t.co/XuiXddxdD7"]["We must keep fighting to save the Affordable Care Act &amp; improve healthcare for American families."][".@SenateMajLdr says he'll get the votes he needs to repeal the Affordable Care Act. It’s still up to us."]["But let’s be clear: The Republicans’ so-called “healthcare” bill comes back to life more often than the lead zombie in a horror movie."]["People in MA &amp; across this country spoke out against this terrible \"healthcare\" bill. Today, you proved that you made your voices heard."]["I’m deeply relieved that @SenateMajLdr delayed a vote on the @SenateGOP's bill to rip health care away from 22 million Americans."]["Heading to the Senate floor to tell the @SenateGOP: It's not too late. Throw your “health care” plan in the trash. https://t.co/jc1R7Es8hG"]["I just got the latest numbers on the @SenateGOP \"health care\" bill — and there are 22 million reasons we need to fight it. https://t.co/cSXqoKWygF"]["This is a tax cut bill paid for by stealing billions from working people &amp; destroying health care for millions. Time to start over."]["A bill that is opposed by the @AmerMedicalAssn because it will literally harm millions is not a \"health care\" bill."]["A bill that kicks 22 million people off insurance to deliver $569 billion in tax giveaways to rich people is not a \"health care\" bill."]["Now we know why the @SenateGOP hid their monstrosity of a “health care” bill. 22 million people will lose their health insurance."]["How could @SenateGOP propose cutting Medicaid for this child and the millions like him? https://t.co/FZcSeKkiyB"]["This loving and hard-working family is what keeps me in this fight. Watch their story: https://t.co/FwGSan61PD"]["What happens to grandma in a world where the Senate “health care” bill passes? https://t.co/PMyrxOzif6"]["Congrats to you and Liz, @sethmoulton! Very happy for you both. https://t.co/7ucnqbUb31"]["The CEO of @BostonChildrens says the @SenateGOP bill is “rejection of our commitment to children &amp; their families.” https://t.co/3QzpcTNFmS"]["MA has the best hospitals &amp; doctors in the country &amp; the world. Read what @MAHealthHosp says about the @SenateGOP healthcare bill. https://t.co/4GoZsju5Y6"]["I’ve read the Republican “health care” bill. This is blood money. They’re paying for tax cuts with American lives. https://t.co/298DLguNiM"]["Heading to the Senate floor now to talk about the @SenateGOP's monstrosity of a so-called healthcare bill. Watch: https://t.co/Zy6PaFeuKv"]["Just got out of a Banking Committee hearing. Reading the @SenateGOP healthcare bill for the first time now. I'll share my thoughts soon. https://t.co/5TrdduAO1Z"]["Women aren’t fools. We know the difference between reality &amp; lies. That’s why we’re fighting back to stop the @SenateGOP healthcare bill. https://t.co/GHTsPpIJn2"]["Rich is right: Workers will die if @realDonaldTrump rolls back protections for exposure to lethal, cancer-causing beryllium on the job. https://t.co/B4APLunB7x"]["Speaking on the Senate floor about how 13 men are trading away women’s healthcare for tax cuts for the rich. Watch: https://t.co/jc1R7Es8hG"]["I’ll fight this mean, scary, reckless, shameful, heartless @SenateGOP healthcare bill every way I can."]["There’s a reason the @SenateGOP don’t want you to see their mean healthcare bill: they know it will hurt real people."]["Gutting funding for babies’ healthcare or seniors’ nursing homes is mean. Letting insurance companies drop cancer survivors is mean."]["But @realDonaldTrump is right: The GOP healthcare bill IS mean. Cutting healthcare for 23M people to give billionaires a tax break is mean."]["There are a lot of words that a President could use to describe their healthcare plan. Effective. Efficient. Comprehensive. Compassionate."]["If you or someone you love needs Medicaid, we need to you to tell your story. The @SenateGOP need to hear you."]["Chantel &amp; Nicholas’ story moved me to my bones. Just watch – these are the hard-working people who would be devastated by Medicaid cuts. https://t.co/26jF5a0yBj"]["About to #holdthefloor with @SenateDems to share stories of MA families who need healthcare. Watch: https://t.co/E7dffRkTBd #ShowUsTheBill"]["Starting hour three of @SenateDems fighting to #holdthefloor to stop Trumpcare. Watch live: https://t.co/0YypUAMNKS #ShowUsTheBill"]["Tune in here to watch the Senate floor live as @SenateDems #holdthefloor to fight Trumpcare: https://t.co/0YypUAMNKS #ShowUsTheBill"]["Health care for 23 million Americans is on the line in the next 2 weeks. Join @SenSanders &amp; me for this powerfully important discussion. https://t.co/pJfynEXmOg"]["The @federalreserve has the legal authority to hold the @WellsFargo Board accountable. It just needs the courage to do it."]["Today I called on the @federalreserve to remove all 12 @WellsFargo Board members who served during the scandal. https://t.co/X47p0QKqNa"]["5000 low-level @WellsFargo employees got fired. Not 1 Board member did. That's our screwed up corporate accountability system in a nutshell."][".@WellsFargo’s Board did little while its low-level employees opened millions of fake accounts to meet their impossible sales quotas."]["2006: Bank CEO says it's safe to deregulate his bank\n2008: His bank gets $1.4B bailout\nYesterday: He's back asking for deregulation\nWatch: https://t.co/h9SjvdAd7o"]["This week I went to a @WSJ lunch of business execs &amp; told them to their faces: it’s time for you to step up on health care. https://t.co/ndyRHVibof"]["Giant corporations are squealing for tax cuts – but they're not saying a word about the millions of people about to lose their health care."]["I’m glad @MassAGO Maura Healey has announced that she’ll fight @BetsyDeVosED &amp; this illegal delay in court. https://t.co/1boESgzl92"]["And Secretary DeVos made it nearly impossible for student cheated by #4profit schools to ever get out from under their massive debt burdens."]["Secretary DeVos made it easier &amp; more profitable for schools to swindle students while keeping their fraud hidden from courts."][".@usedgov Sec @BetsyDeVosED put bogus #4profit colleges ahead of students, vets &amp; taxpayers by illegally delaying an Obama Admin rule."]["Today @SenatorCollins &amp; I introduced the Kensky &amp; Downes Act to help victims of terrorism access treatment at military facilities. https://t.co/81y7aOJcYK"]["My thoughts are with @SteveScalise, all those injured, and the brave Capitol Police who protect us every day."]["As our top law enforcement officer, the AG must be truthful and uphold the law. Sessions cannot continue to serve. He should resign."]["If AG Sessions were truly recused, he should have had nothing to do with firing Comey. He promised to recuse. He broke that promise."]["Today before Congress, AG Sessions refused to answer key questions about his discussions with @realDonaldTrump related to Comey’s firing."]["And now there’s talk that the Special Counsel now running the Russia investigation may be next on the chopping block. That’s bananas."]["But even after recusing himself, Sessions recommended that the President fire FBI Director Comey – who was leading the Russia investigation."]["AG Sessions was forced to recuse himself from the Russia investigation after he lied to Congress about multiple meetings with the Russians."]["The @SenateDems women are speaking out now about the secret GOP plan to repeal ACA by the end of the month. WATCH: https://t.co/HaofPHzsOW"]["Jeff Sessions should have never been confirmed as Attorney General – and I’ve called for him to resign. #SessionsHearing"]["AG Sessions lied to the Senate in January about his own contact with the Russians &amp; played a direct role in firing FBI Director Comey."]["Tune in here to watch AG Jeff Sessions' live testimony before the Senate Intel Committee: https://t.co/rR1S96bCep #SessionsHearing"]["How do @SenateGOP expect us to talk about prescription costs when they’re secretly writing a plan to throw millions off their health care?! https://t.co/4RuO8ZNvRA"]["Read my @BostonGlobe op-ed about how we fought for a conflict of interest rule for retirement advisers, &amp; won. https://t.co/nPTotYIcdY"]["Saving for retirement is hard enough. The last thing families need is to worry if their financial adviser has their best interests in mind."]["In a matchup between @realDonaldTrump’s #MuslimBan &amp; the Constitution, my money’s on the Constitution every time. The 9th Circuit agrees."]["I LOVE the Boston Pride Parade. It shows our Commonwealth and our country at its best. https://t.co/0ea0moLb5g"]["I couldn't have said it better myself, @clairecmc. https://t.co/tSjBk0lk0Z"]["Here’s a little hint for the @HouseGOP: NOBODY silences Democratic Leader @NancyPelosi. #NeverthelessShePersisted https://t.co/M0tTtZQVsu"]["Hundreds of thousands of you stood up to the lobbyists for the conflict of interest rule &amp; we won. Today we celebrate. THANK YOU."]["Congratulations, Ambassador @SenScottBrown! Best wishes to you &amp; Gail in New Zealand. I know you’ll make us proud."]["I’m going to fight my heart out to protect Wall Street reform &amp; the @CFPB. I urge the Senate: Enough with the Wall Street handouts."][".@HouseDemocrats unanimously opposed the #WrongChoiceAct. Dems will keep fighting for working families while the GOP works for Wall St."]["Financial companies pour money into Washington. Their lobbyists swarm the place. The @HouseGOP’s #WrongChoiceAct is their reward."]["Veterans, seniors, &amp; consumers all oppose the @HouseGOP’s #WrongChoiceAct. Know who doesn’t? Big banks &amp; payday lenders."]["Let me repeat: The @HouseGOP voted today to make it nearly impossible to hold big banks accountable for cheating you. #WrongChoiceAct"]["While everyone was watching Comey today, the @HouseGOP just voted to gut the rules on Wall Street. #WrongChoiceAct"]["A hostile foreign gov used a dangerous weapon to undermine our democracy. We must set aside politics &amp; make certain it never happens again."]["No matter who @realDonaldTrump threatens, intimidates, or fires, it’s the job of law enforcement &amp; Congress to get to the bottom of this."]["Comey’s sworn testimony today paints a picture of a President only interested in protecting himself, his aides, &amp; his friends from the law."]["The first job of the President of the United States – the first job – is to protect this nation from threats."]["There’s no question this is a powerfully important moment for the Senate, the Trump-Russia investigation, our rule of law, &amp; our democracy."]["Tune in here to watch former FBI Director Comey’s live testimony before the Senate Intel Committee: https://t.co/nvAwspDgjP #ComeyDay"]["@ColorOfChange @ACLU It’s time to remove the profit motive from our justice system &amp; focus on solutions that make our communities stronger &amp; safer."]["Insightful report from @ColorofChange &amp; @ACLU about how the for-profit bail industry traps people in jail &amp; debt. https://t.co/zklX6nw9gz"]["Read FBI Director Comey's testimony for tomorrow's hearing. This whole thing is crazy. https://t.co/VKa9XO61p8"]["Silencing @SenKamalaHarris for not being “courteous” enough is just unbelievable. Keep fighting, Kamala! #NeverthelessShePersisted https://t.co/58y15qWVzU"]["Democrats stand with veterans, seniors, &amp; working families to oppose the #wrongchoiceact. We won’t let Wall Street crush our economy again."]["Dems remember the 2008 crash. We remember the millions who lost their jobs, homes, &amp; life savings because of Wall Street’s reckless greed."]["Despite all his tough talk on Wall Street, @realDonaldTrump is proudly supporting the #wrongchoiceact to “undo” Dodd-Frank. https://t.co/8QqlnJ0OrJ"]["The @HouseGOP are ramming through a bill this week to roll back Wall Street reform &amp; gut the @CFPB. #wrongchoiceact https://t.co/e9REGLE3Ek"]["Take a look at the faces of @realDonaldTrump’s proposed cuts to the education budget: https://t.co/XSfR1l6gAh"]["A group of Massachusetts women came by the Senate to fight back against Trumpcare – and they inspire me to keep fighting, too. https://t.co/33z1AVfWDy"]["At town halls across MA, people ask me how to fight back &amp; keep fighting back. Here's the thing about democracy: It's up to all of us. https://t.co/W5AEOA8OLO"]["Way to go, Boston! https://t.co/r0kFbCqWxM"]["America’s new chief banking regulator used to be the person defending big banks. @ChrisVanHollen and I blow the whistle on this scandal. https://t.co/CdoquBt6H9"]["Today I’m launching #DeVosWatch, a new oversight effort to hold @BetsyDeVosEd &amp; @usedgov accountable. Watch: https://t.co/4t4ywdcxbE"]["It’s @BetsyDeVosED’s job to put students – not predatory colleges and the student loan industry – first."]["The recent Trump-DeVos education budget upends the student loan program &amp; makes it harder to afford college."]["But so far what has @BetsyDeVosED done? She’s hired advisers tied to shady for-profit colleges &amp; made it easier to cheat students."]["As Education Secretary, @BetsyDeVosED controls the $1T student loan program – a massive responsibility."]["Selling out to these corporations might be @realDonaldTrump’s style, but we must do better as a nation and tackle climate change head-on."]["Now, @realDonaldTrump is about to surrender U.S. climate leadership on the world stage by pulling out of the Paris Agreement."][".@realDonaldTrump and his team have given one handout after another to Big Oil and Big Coal since taking office."]["Let’s honor those who sacrificed for our country by strengthening our promises to servicemembers &amp; their families. https://t.co/40X6J0uV1b"]["Today we remember &amp; honor the men &amp; women who made the ultimate sacrifice for our country &amp; all those who love them. #MemorialDay"][".@realdonaldtrump's budget would impose deep cuts to opioid crisis funding. We can't let this budget be the final word. https://t.co/90MzGZjfqZ"]["Lifting the @US_FDA hiring freeze won't matter if @realDonaldTrump's budget slashes FDA funding 30% &amp; cuts jobs. We need an effective FDA."]["I wrote to @US_FDA about the dangerous hiring freeze in January &amp; again last month. https://t.co/BOnWFaoZyx"]["The @US_FDA is an important cop on the beat, &amp; I've been worried about the impact of @realDonaldTrump's gov hiring freeze on the agency."]["Breaking news: @realDonaldTrump's illegal &amp; unconstitutional Muslim ban is still illegal &amp; unconstitutional."]["@realDonaldTrump I’m heading to the Senate floor now to discuss Trumpcare’s devastating impact on working families. Watch: https://t.co/jc1R7EJJ9e"]["And @realDonaldTrump’s indefensible budget &amp; unforgivable Trumpcare bill cuts the money needed to fight our country’s opioid crisis."]["The GOP Trumpcare plan is as clear as it is cruel: destroy health care for tens of millions in order to give tax cuts to rich people."]["We need more investments in NIH, not less. I’ll fight for MA &amp; oppose these misguided cuts for scientific research."]["My new report shows: NIH funding is critical for MA scientists. But @realDonaldTrump wants to cut NIH by $5.7B. https://t.co/U3r8Su4kWb https://t.co/x1N86CxQ09"]["MA researchers are curing diseases &amp; developing new tech that is driving our economy &amp; helping millions live healthier lives."]["Our government should work for everyone – not just millionaires &amp; billionaires. We can fight back by rejecting Judge Thapar’s nomination."]["There are many reasons to oppose Judge Thapar’s nom for the Sixth Circuit, but one should concern everyone: his money in politics. https://t.co/2wmnPOTT14"]["Like Judge Gorsuch, Judge Amul Thapar made the list of 21 “acceptable” judges that far-right groups handed to Donald Trump."]["Watch @RepKClark . @usedgov Secretary Betsy DeVos’s answer – or lack of one – is horrifying. https://t.co/eBcwki6aT8"]["This isn’t just about economics, it’s about our values. Health care is a basic human right, &amp; @SenateDems WILL fight back to stop Trumpcare."]["The numbers don’t lie here: this new version of Trumpcare will still bankrupt American families. People will die."]["Trumpcare is devastating for the poor. Seniors. Pregnant women. People w/ pre-existing conditions, mental health &amp; substance use disorders."]["The CBO confirmed: Trumpcare is a $663 BILLION tax cut for the rich paid for by kicking 23 MILLION people off of insurance. End of story. https://t.co/lLVhpTMhpu"]["We should be expanding Social Security, not cutting it. We won’t let the GOP dismantle Social Security inch by inch with this budget."][".@realDonaldTrump promised not to cut Social Security. I’ve looked at the budget, &amp; here it is: $73B in Social Security cuts. https://t.co/9QYxEwUPxs"]["Under Trumpcare, 445k MA residents would lose healthcare. We’d lose $10B in state funding. And out-of-pocket costs would skyrocket."]["A new analysis out today shows: Trumpcare will hit Massachusetts like a sledgehammer. https://t.co/f03ZTPOpA1"]["When we fight, we can win. I’m going to keep on fighting any attempts to weaken, undermine, or kill the @USDOL conflict of interest rule."]["@BarackObama @USDOL We can’t let our guard down. The Trump Admin &amp; giant financial firms made it clear: they'll try to roll back this rule as soon as they can."]["@BarackObama @USDOL Good news: We put a stop to the predatory conflicts of interest that cost Americans saving for retirement $17B/yr. https://t.co/Dr1trMUM48"]["I was w/ @BarackObama as he rolled out @USDOL’s rule for retirement advisers. The financial firms tried everything to delay &amp; kill the rule. https://t.co/6zxubsnNUq"][".@realDonaldTrump’s @usedgov budget is an all-out assault on America’s kids, teachers, college students &amp; student loan borrowers. https://t.co/F1UoJTPdrd"]["I love speaking at MA graduations. Watch highlights from @umassamherst. https://t.co/hylNFrqQLj"]["@senorrinhatch @SenWhitehouse The bipartisan College Transparency Act will give students, families, &amp; policymakers an accurate pic of how colleges serve their students."]["I intro'd the College Transparency Act w/ @senorrinhatch, Bill Cassidy &amp; @SenWhitehouse to patch college data gaps: https://t.co/mrz1F9kyak"]["@usedgov .@USedgov makes colleges report completion data only for 1st time, full-time students – not students that switch schools or go part-time."]["Students need accurate, comprehensive info to pick the right college, but the data @USedgov requires colleges to report is old &amp; incomplete."]["Congrats @WheelockCollege grads! I’m honored to join you for commencement today. Friends &amp; family can watch live: https://t.co/r6ur6vce7W"]["@realDonaldTrump @USTreasury Watch this totally bizarre testimony from @USTreasury Sec Mnuchin where he admits he doesn’t support Glass-Steagall. https://t.co/pFTMnqf82m"]["@realDonaldTrump Now that @realDonaldTrump &amp; @USTreasury Sec Mnuchin have met with the Wall Street lobbyists, they’ve done a complete 180 on Glass-Steagall."][".@realDonaldTrump has claimed for months that he supports reinstating Glass-Steagall - the law separating commercial &amp; investment banking."]["As Mueller steps up to enforce the law, Congress must step up too – with its own independent, bipartisan, &amp; transparent investigations."]["For Mr. Mueller to succeed, he needs total authority to pursue this investigation – completely free of any hint of political interference."]["Heading to the Senate floor to oppose DOJ nominee Rachel Brand, &amp; reintroduce my #BankonStudents refi bill. Watch: https://t.co/jc1R7Es8hG"][".@MartinHeinrich &amp; I urged @TheJusticeDept IG to investigate/report on Sessions’ role in Comey’s firing. https://t.co/3GwjA4TUX2 https://t.co/QPOcHLCWxY"]["AG Sessions didn’t just decide to recuse himself because he’s a nice guy. @TheJusticeDept regulations require it."]["Sessions played a role in firing FBI Director Comey – a firing @realDonaldTrump said was, in part, based on Comey’s Russia investigation."]["After getting caught lying about contact with the Russians, Sessions said he’d recused himself from the Trump-Russia investigation."]["@realDonaldTrump @FCC Powerful companies shouldn’t decide how or when we use the internet. That’s why we have to fight back to defend #NetNeutrality."][".@realDonaldTrump’s @FCC votes tomorrow to gut #NetNeutrality rules that keep the internet free &amp; open, &amp; hand control to big broadband."]["Sending my best wishes to @SenThomTillis &amp; his family this morning. Hope you have a very speedy recovery! https://t.co/5nLC3ayWxB"]["@SenatorLankford The bipartisan #TruthinSettlements Act passed unanimously through the Senate in the last Congress. It’s time to make this happen."]["Today @SenatorLankford &amp; I reintroduced our #TruthinSettlements Act to shut down the backroom deal making: https://t.co/WHFVH5SgoY"]["Settlements may be tax deductible or have credits hidden in fine print. If the gov is going to cut deals, we should know what we’re getting."]["When the federal gov reaches a settlement with companies that break the law, they tout a big $ amount. But those numbers can be misleading."]["Wishing all my best for a speedy recovery to my dear friend @maziehirono. Your Senate family is here for you every step of the way!"]["\"Here in America, we embrace &amp; defend democracy.  And we do that by demanding that everyone in our government is accountable.\" #CAPIdeas"]["“No matter how much [@realDonaldTrump] might admire Vladimir Putin’s Russia, here in America, we will never accept autocracy.” #CAPIdeas"]["\"In this country no one is above the law – not even the President of the United States.\" #CAPIdeas"]["“…[Trump's] desire to impress his Russian buddies does not outweigh the safety, security, &amp; lives of Americans &amp; our allies.\" #CAPIdeas"]["\"Now is the time to remind [@realDonaldTrump] that our intelligence secrets are not gossip...\" #CAPIdeas"]["\"Now is the time to remind @realDonaldTrump that our gov is not a plaything to make him richer or a servant to do his bidding.\" #CAPIdeas"]["\"It is time for us to do what Teddy Roosevelt did – and pick up the antitrust stick again.\" #CAPIdeas"]["“Do you get the feeling that if Bernie Madoff weren’t in prison, he’d be in charge of the SEC right now?” #CAPIdeas"]["“In every corner of our economy, competition is choked off… a handful of giant corporations control more &amp; more &amp; compete less &amp; less.\""]["\"When people shrug at @POTUS's conflicts, it’s not because they don’t care – they know money is already causing a deep rot in DC.\" #CAPIdeas"]["\"It doesn’t matter if you’re a nobody or you’re friends with the President – insider trading is illegal.\" #CAPIdeas"]["\"Money has fundamentally reoriented our democracy. Money slithers through our political system like a snake.\" #CAPIdeas"]["\"Concentrated money &amp; power are corrupting our democracy - &amp; becoming dangerously worse with @realDonaldTrump in the WH.\" #CAPIdeas"]["\"Set aside debates about big gov vs. small gov, more gov vs. less gov. The most important thing we need is accountable gov.\" #CAPIdeas"]["In just a few minutes I’ll be speaking about accountable government at the @amprog #CAPIdeas conference. Watch live: https://t.co/2Yry7cNmMH"][".@challiance Health care is a basic human right, &amp; I'm fighting back for our health care in MA &amp; all across the country. https://t.co/jAEnWn8vP6"][".@challiance I spoke with docs, nurses, &amp; healthcare pros who are worried about what repealing the ACA &amp; gutting Medicaid would mean for their patients. https://t.co/f7jJ2JOREQ"]["This morning I got a terrific tour of the @challiance's Malden Care Center. https://t.co/YmvofKKXhl"]["We had a smart, thoughtful, bipartisan, &amp; packed town hall in Ware last night. Very grateful to the hundreds of people who joined us. https://t.co/BIKhvtIZYh"]["Congrats to the @UMassAmherst Class of 2017! You did it! #umass2017 https://t.co/tUvacQLSZd"]["Honored to speak at the @UMassAmherst graduation ceremony this afternoon! #umass2017 https://t.co/JbjmNtZVS8"]["The GOP spent yrs gutting voting rights &amp; suppressing black &amp; Latino votes. We can’t allow @realDonaldTrump to turn the clocks back more."][".@realDonaldTrump picked Kris Kobach – architect of some of the most racist &amp; anti-voter state laws – to lead this new conspiracy crusade."]["Today @realDonaldTrump signed an order launching a \"Vote Fraud Commission,\" but it really should be called a \"Vote Intimidation Commission.\""]["So @realDonaldTrump is taking his make-believe, fact-free stories of voter fraud to a whole new level. https://t.co/NgvtrcZMET"][".@TheJusticeDept Stop hiding behind spokespeople. Rosenstein must testify, under oath, at @senjudiciary on his mtgs with @realDonaldTrump &amp; Director Comey."][".@TheJusticeDept NYT says Comey asked Rosenstein for more resources for Russia investigation – right before firing. DOJ denies. https://t.co/pHvEVOkucR"]["I voted against Rod Rosenstein’s nomination to the #2 spot at @TheJusticeDept because he refused to commit to a special prosecutor."]["I spoke to @allinwithchris about why we need an independent prosecutor to investigate Trump's ties to Russia. Watch. https://t.co/n9N7twATjr"]["In just a few minutes I'll be discussing FBI Director Comey with @allinwithchris. Tune in. #inners"]["We need a real, independent prosecutor who @realDonaldTrump can't fire, Sessions can't intimidate, &amp; Congress can't muzzle. We need it now."]["It’s time for Congress to get their heads out of the sand. @realDonaldTrump cannot pick the person to continue this critical investigation."]["But does anyone seriously believe @realDonaldTrump fired the top person investigating his ties to Russia because he was unfair to Hillary?"]["There’s no question that Comey made questionable decisions during the election. The FBI shouldn’t comment on ongoing investigations."][".@realDonaldTrump Today I urged the CFTC, SEC &amp; EPA to investigate Trump adviser Carl Icahn for insider trading &amp; market manipulation. https://t.co/LfdBJQRBqW https://t.co/Cr3Lvp9mht"][".@realDonaldTrump Icahn made a big bet that the price of renewable fuel credits would drop. Then he advised on policies that made them drop. Icahn made $50M."][".@realDonaldTrump named Carl Icahn as his special adviser – even though Icahn is still majority owner of a petroleum refining company."][".@HouseGOP Watch @SenDuckworth, @SenBillNelson, @SenatorTester &amp; @SenBlumenthal explain: we owe it to vets to stop Trumpcare. https://t.co/Q4lmGWydt4"]["The @HouseGOP’s Trumpcare plan would be devastating for vets in MA &amp; across the country who rely on ACA tax credits to pay for health care."]["The @HouseGOP just voted to strip health care away from millions. We can whimper, we can whine – or we can fight back. #AHCA https://t.co/UuwfcSWkag"]["Health care is a basic human right. We’ll fight as long &amp; hard as we can to make that a reality for everyone in America. #AHCA"]["Disease, sickness, old age touches every family. Tragedy doesn’t ask who you voted for. #AHCA"]["This isn’t football. It’s not about scoring points. #AHCA will devastate Americans’ healthcare. Families will go bankrupt. People will die."]["The only thing that’s changed about Trumpcare is that @HouseGOP made the original plan even more brutal. #AHCA"]["This is the same cruel Trumpcare bill that @HouseGOP tried to pass weeks ago. Still strips coverage from millions &amp; guts Medicaid. #AHCA"]["Trumpcare isn’t a health care bill. A bill that destroys health care for millions to shovel cash to the rich isn’t a health care bill. #AHCA"]["Aggressive negotiations can yield good results – including $100 million to fight the opioid epidemic. https://t.co/bOc4l327qk"]["Starting now! https://t.co/jc1R7Es8hG #SaveRetirement https://t.co/RwdS7pEz4j"][".@USChamber Heading to the Senate floor now to speak out against the state retirement plan CRA. Watch live: https://t.co/jc1R7Es8hG #SaveRetirement"]["Republicans are voting on a bill that would pull the rug out from under state retirement plans. Why? The @USChamber likes the system rigged."]["55 million Americans don’t have access to a workplace retirement account – so states have stepped up to provide these savings accounts."][".@HouseGOP can keep picking the side of big banks like Wells Fargo over servicemembers &amp; vets – but Dems side with vets &amp; working families."]["Every @FinancialCmte R also voted to take away the authority that the @CFPB used to hold Wells Fargo accountable for the fake accounts scam."]["Preserving the @CFPB’s independent funding is critical – including to the vets &amp; servicemembers it protects. https://t.co/uHI7R4RZe8"]["Today, every single Republican on the House @FinancialCmte voted to cut off the @CFPB’s independent funding."]["The @HouseGOP are lining up behind a rotten bill to gut the @CFPB – but @HouseDemocrats are fighting back."]["There is no place for bigotry in the US Army. Dr Mark Green’s comments disqualify him from leadership."]["Our military force's diversity is its greatest strength. The Army Secretary must show genuine support for ALL of our men &amp; women in uniform."]["Muslims, Latinos, &amp; LGBTQ Americans protect our country. They’re part of service member families. They’re part of our great American family."][".@realDonaldTrump’s nominee for Army Secretary – Dr Mark Green – has made hateful &amp; ignorant comments about our fellow Americans."][".@HouseGOP @FSCDems The GOP may want to forget the devastating financial crisis that crashed the economy, but the American people haven’t – and neither will we."][".@HouseGOP Today @FSCDems are standing firm against the #WrongCHOICEAct that rolls back Wall Street reform. Dems will fight back every step of the way."][".@HouseGOP Americans are fed up with a Washington that works great for giant companies but kicks hardworking people in the teeth."]["Today, @HouseGOP are voting to make it legal for employers to cheat workers out of overtime. It's a disgrace. https://t.co/mZxipmCjEJ"]["With working families across the country scraping to make ends meet, Congress should strengthen protections for workers - not gut them."]["That’s the Trump Admin in a nutshell: Rich guys making each other richer &amp; patting themselves on the back. Gross. https://t.co/c3UVpk4HSG"]["I’ve introduced a bipartisan bill with Sen. Rubio to help cut off human traffickers’ access to the banking system: https://t.co/VQmaSwUyaF"]["Human trafficking is an ugly stain on humanity, and we need to use every possible tool to stop it."]["Dozens of incredible kids at Clarke Middle School wrote letters to me about climate change – here's my message back to them. https://t.co/EYlPlrtAMp"]["Tomorrow is National Prescription Drug Take Back Day. Safely dispose of unused pills at a collection site near you: https://t.co/54FD9pGLO5"]["Almost 80% of people at high risk for prescription drug overdose are using opioids legally prescribed to themselves, family, or friends."]["These deaths are another reminder that Washington must do better by working families. Step one: opposing @POTUS's proposed cuts to OSHA."]["A new report shows that 70 Massachusetts workers — from ages 18-74 — lost their lives on the job in 2016 alone: https://t.co/IBWRLuOwmd"]["Today is Workers’ Memorial Day—the 46th birthday of OSHA and a chance to honor workers who have died on the job."][".@HouseGOP @RepHensarling @CFPB Hey @RepHensarling: \"I know you are but what am I\" doesn't work with adults. Americans oppose your plan to gut Wall Street reform."][".@HouseGOP @RepHensarling @CFPB .@RepHensarling even says Wall Street CEOs LOVE Dodd-Frank and that I'm their ally. Ask the ex-CEO of Wells Fargo about that."][".@HouseGOP @RepHensarling The @CFPB forced banks to return $12B to consumers they cheated. But @RepHensarling says Wall Street HATES his plan to kill CFPB. What?!"][".@HouseGOP .@RepHensarling spent yrs trying to kill fin reform, but he says his bill to destroy it actually PROTECTS consumers &amp; FIGHTS Wall St. Huh?!"][".@HouseGOP don't like me calling them out, so now they want you to think their plan to gut fin reform actually holds Wall St accountable! https://t.co/4UflLHQP0E"]["This AM, I told @FinancialCmte their bill to neuter consumer protection &amp; unleash bad behavior on Wall St is immoral https://t.co/nWAXldHm9i"]["Wall St spent over $1M a DAY trying to kill financial reform after the '08 crisis—we still passed it. Now @HouseGOP is back to try &amp; kill it"]["Real tax reform would close up loopholes for the rich &amp; put working families first."]["America's biggest corporations have stashed over $2.6 trillion in profits offshore, &amp; @realDonaldTrump wants to give them a tax cut."][".@realDonaldTrump wants billionaires &amp; giant corporations to pay lower taxes &amp; leave scraps for working families."][".@realDonaldTrump ran 4 companies through bankruptcy. Now he plans to bankrupt our country."]["Yesterday, a court blocked @realDonaldTrump’s order. Trump may not like it, but the Constitution applies to him too. https://t.co/D1ebwDdriH"]["Months ago, I wrote to federal agencies explaining why this executive order violates the constitution. https://t.co/fPboLE9Pqu"][".@realDonaldTrump .@realDonaldTrump’s executive order is immoral, unconstitutional, and dangerous for MA families."]["But @realDonaldTrump issued an executive order to cut off this federal grant money for cities with immigration policies he doesn’t like."]["MA pays more in taxes than we get back in federal dollars, but that money is critical for opioid treatment, homelessness prevention, &amp; more."]["Our MA state senators are worried about @realdonaldtrump's budget cuts for their communities. Glad to hear their concerns in DC today. https://t.co/mkio9MAMWX"]["No surprise here that MA has the best teacher in the US. Congrats to 2017 National Teacher of the Year Sydney Chaffee from Codman Academy! https://t.co/ZcQ6D7dBES"]["Shareholders should vote out every member of the @WellsFargo’s board who was around during this scam. This is about accountability."]["Either @WellsFargo’s board failed to fully investigate the fraud for years or they knew about it and did nothing – either is unacceptable."]["Today I released a letter from @WellsFargo’s auditor showing the board knew of improper sales practices for years: https://t.co/zmUBsOuSoT"][".@WellsFargo’s shareholders get to decide if they will hold their board accountable for their bank’s fraud or just give them a free pass."]["For the 1st time since the @CFPB caught @WellsFargo opening millions of fake accounts for customers, the bank’s shareholders meet today."]["I have just one promise: we will not forget. #ArmenianGenocide https://t.co/E0KYyy4ksZ"][".@realDonaldTrump .@realDonaldTrump’s actions in his first 100 days have shown his tough talk against Wall Street and big corporations was just that: all talk"][".@realDonaldTrump Then @realDonaldTrump ordered a review of tax rules corporations find “burdensome,” like a crackdown on tax-dodging corporate inversions."]["Candidate @realDonaldTrump talked a big game about standing up to Wall Street &amp; big companies that stash profits overseas. (Yeah, right.)"]["Way to go Sydney! Thanks for all you do for Massachusetts students https://t.co/WfKHCIwCUo"]["Congrats @SenScottBrown on your nomination for New Zealand Ambassador! You have my support &amp; I'm sure you'll make the people of MA proud."]["On #OneBostonDay, Boston asks everyone to participate in acts of kindness &amp; service. Join us &amp; learn more at https://t.co/6570AlpArP."]["Saturday is the 4-yr anniv of the Marathon bombings. We remember the victims of that tragedy, but also the generosity of many in its wake."]["Another terrific town hall in Salem tonight! Glad to answer people's questions &amp; talk about how I'm fighting for MA families in the Senate. https://t.co/SA6CYsn2H0"]["In the choice between students &amp; student loan companies, Betsy DeVos made clear she stands with companies that cheat &amp; squeeze borrowers."][".@usedgov Yet another gut punch to struggling student loan borrowers. And another reason we need the @CFPB to protect students when @usedgov fails."]["Make no mistake: Betsy DeVos &amp; @usedgov just gave a big wet kiss to Navient, which pushed students into bad loans. https://t.co/9oSgcuQs4U"][".@usedgov DeVos rolled back protections that make it harder for student loan companies that cheat borrowers to keep raking in gov contracts."][".@usedgov Secretary Betsy DeVos just ripped up policies created last year to protect student loan borrowers. https://t.co/zjaiAtJgZC"][".@CFPB @WellsFargo The @SEC_News &amp; @TheJusticeDept should use all the tools they have to hold Stumpf &amp; @WellsFargo execs accountable under the law."][".@CFPB @WellsFargo .@WellsFargo’s clawback is a good step, but an internal investigation is no substitute for a thorough gov investigation into the scam."][".@CFPB @WellsFargo The @WellsFargo board just clawed back another $75M from 2 execs, including fmr CEO Stumpf. https://t.co/AiHtU2JaeR"]["After the @CFPB helped bring to light the fake accounts scandal at @WellsFargo, the bank’s Board launched an internal investigation."]["If @realDonaldTrump truly wants to help Syrians fleeing murderers, he should drop his effort to ban their children from America immediately."]["Congress must demand an actual strategy, clear goals, and a plan for achieving them before approving additional military action in Syria."]["The President's erratic approach to Syria is not a strategy. It underscores why our Constitution doesn't let Presidents wage war alone."]["Within a week, Trump's Admin went from asserting they wouldn't intervene to launching Tomahawk missiles against Assad. That's erratic."]["Glass-Steagall has bipartisan support: from @SenSanders to @realDonaldTrump; both @TheDemocrats &amp; @RNC platforms. Let’s get this done."]["Today, @SenJohnMcCain, @SenatorCantwell, @SenAngusKing &amp; I are reintroducing the 21st Century Glass-Steagall Act. https://t.co/rgk4w2s6QO https://t.co/z3RCpeaWHh"]["Glass-Steagall was one of the 1st bills I introduced in the Senate 4 yrs ago with @SenJohnMcCain, @SenatorCantwell &amp; @SenAngusKing."]["If bankers want to go gamble with complex financial products, ok – but they shouldn’t do it with the money in grandma’s checking account."]["But let’s get real: Most of the big banks are even bigger now than when we declared them “too big to fail” in 2008 &amp; bailed them out."]["We’ve made some real progress since Wall Street’s high-risk bets brought our economy to its knees."]["If ever we needed a strong, independent Supreme Court with broad public support, it’s now. Rules change or not, we’ll keep fighting for it."]["The GOP will be responsible for every 5-4 decision that throws working Americans under the bus to favor the powerful, moneyed few."]["The GOP will have to own every 5-4 case that opens the floodgates even more to secret spending in our political system."]["The GOP will have to own every 5-4 attack on women’s rights, voting rights, LGBT rights, &amp; freedom of speech &amp; religion."]["Changing the rules to jam through a right-wing, corporate-owned judge means the GOP will have to own the Gorsuch Court."]["I get that the GOP won’t pick a progressive. But if a SCOTUS nominee isn’t mainstream enough for 60 votes, he/she shouldn’t be confirmed."][".@SenJeffMerkley @DunkinDonuts .@SenJeffMerkley is one of the best, and I’m very glad to fight side-by-side with him. #StopGorsuch #holdthefloor"][".@SenJeffMerkley I thought @SenJeffMerkley’s staff might need a sugar boost, so with Jeff on the phone, I dropped off @DunkinDonuts to his office. https://t.co/ispTJor2yY"][".@SenJeffMerkley  is a champion for working families – and he showed it overnight when he spoke for more than 15 hours about Judge Gorsuch."]["Go, @SenJeffMerkley, Go! #StopGorsuch #HoldTheFloor https://t.co/J1Jamon1tl"][".@realDonaldTrump I’m heading to the Senate floor now to discuss why I oppose Neil Gorsuch &amp; why he should not be confirmed: https://t.co/jc1R7Es8hG"]["It’s clear that @realDonaldTrump’s Supreme Court nominee, Neil Gorsuch, doesn’t have enough support in the Senate to be confirmed."]