["@PattyMurray @SecretaryZinke Put together this FL v. NJ side-by-side. The beaches look the same to me. And the risks of an oil spill would upend coastal communities and economies in both of them. @SecretaryZinke needs to treat NJ &amp; every coastal state like he's treating Florida. #NoOffshoreDrilling! https://t.co/9vBZOI464y"]["If Florida beaches deserve protection from offshore drilling, I don't see why NJ doesn't. @SecretaryZinke, come to NJ and see for yourself that our economy ALSO relies on tourism, fishing and coastal business. We can't afford offshore drilling risks. https://t.co/UHd2AIDLfp"]["New Jersey's economy would be just as uprooted by an oil spill as Florida's. We must #KillTheDrill to #ProtectOurCoast. https://t.co/YPbNccCNaS"]["#Breaking: A statement on #DreamAct by my colleagues and I in the Gang of 6. https://t.co/OaLbSF2VhO"]["The beaches look the same to me. And the risks of an oil spill would upend coastal communities and economies in both of them. @SecretaryZinke, treat NJ just like you're treating Florida: #NoOffshoreDrilling! https://t.co/zC31J06vSW"]["The time is now for a robust #DreamAct! It’s not a partisan issue, it’s about what’s morally right and in the best interest of our economy.  #DreamActNow https://t.co/xIcQ1USlMO"]["NJ has the same concerns as Florida @SecretaryZinke. The entire New Jersey Congressional delegation (Republican and Democrat) invites you to NJ to see for yourself. https://t.co/84AbXXe8zs https://t.co/F32gMLnkOx"]["We must do everything we can to battle the heinous crime of sex trafficking. That’s why I’m supporting #SESTA, and I’m proud to work with @NJ_Coalition to end this form of modern slavery. #HumanTraffickingAwarenessDay"]["Some Medicaid recipients physically cannot work, and that is exactly why they need Medicaid.\n\nSome of the poorest Americans need Medicaid to stay healthy so they can find work. \n\nTrump's cruel Medicaid work requirements are wrong and hurt the most vulnerable Americans."]["Hopefully the Secretary's insistence that local voices matter extends to all local voices, no matter our political party. \n#ProtectOurCoast #NoOffshoreDrilling #KillTheDrill https://t.co/XgAEvMP5vW"]["Secretary Zinke says local voices matter in his offshore drilling decisions - I've been speaking out with @CoryBooker and @FrankPallone for years. Let's hope NJ voices of all parties matter. #ProtectOurCoast https://t.co/pB8KiUkAeZ"]["Dreamers had the courage to come out of the shadows. Now Congress must show we have the courage to help them stay in the light. #DreamActNow https://t.co/9kulr1V0mf"]["Adriana is an #AmericanDreamer from Lakewood, NJ. She is an A student, and a role model for all of us. We can’t have young ppl like her worry all through this holiday season. It’s time we give her the security she needs &amp; pass the #DreamActNow https://t.co/voliXHnjAI"]["Sara has been a force – an #AmericanDreamer fighting for Dreamers that, like her, call New Jersey home. She can’t remember living anywhere else, and has dreams to continue to give back to her community. We can’t lose people like Sara. We must pass the #DreamActNow https://t.co/frjtpaQeM6"]["The gov’t gave Erika a chance and made a promise, but now it could be taken away. We must pass a clean #DreamActNow and keep these amazing young people in the country they call home. https://t.co/RyUn8gVIiy"]["DACA gave Elizabeth an opportunity to learn, create &amp; thrive managing a STEM program for students. She knows no country besides the U.S. It’s long past time we honor our promise &amp; pass a clean #DreamActNow so she &amp; all other Dreamers can continue to do so much in our communities https://t.co/oamNQhb4Rv"]["Brenda is a young #AmericanDreamer. She dreams of being a nurse. She dreams of taking care of people in her community. But losing DACA and being deported to a country that is not her real home would be a nightmare. She belongs here. It’s time to pass a clean #DreamActNow https://t.co/EMdULntlTo"]["THREAD - Join me in calling on the GOP to pass the #DreamActNow by RETWEETING these stories. The lives of young #AmericanDreamers are not invisible - they are your neighbors, teachers, friends, soldiers and classmates."]["More proof that the #GOPTaxScam made the tax code even more complicated (not less, like they promised).  Just add it to the list of reasons it’s bad for the middle class, and even worse for NJ. (via @HerbNJDC)  https://t.co/RVkI4ONyeu"]["The good news: A federal court tells Trump Admin #DACA can't end while there’s a legal challenge\n \nThe takeaway: A permanent fix thru legislation is even more important now.\n \nOur deadline for the #DreamAct is still January 19th. No more delays or excuses. #DreamActNow https://t.co/kM2kRf82q0"]["New Jerseyans who worked through the holidays to get forms together and then wait in line to prepay taxes deserve the benefits they were promised. Changing the rules in the middle of the game is unacceptable. https://t.co/yJZk4FjNPj"]["Our #RussiaReport underscores why Putin's interference in 2016 elections must be viewed not as an isolated incident but as part of an ongoing effort to destabilize western democracies &amp; undermine international order. The President must take this seriously. https://t.co/Ki0KomkMLq"]["You’re right Mr. Secretary.  It's dangerous to our coastal communities &amp; economy to let big oil drill off our shores. That’s why we’ve been fighting to #KillTheDrill for years.  So how about taking NJ off the table? (Will having THREE Trump golf courses help?) #ProtectOurCoast https://t.co/dRAPNNxBIC"]["Mr. Secretary, it’s New Jersey calling, from the shore.  What about our local voices? Not just Democrats like myself @CoryBooker, or @FrankPallone, but NJ Republicans like @RepLoBiondo want to #KillTheDrill too. Will New Jersey’s Republican local voices matter? #ProtectOurCoast https://t.co/GwLtJPtXRw"]["NJans are understandably confused and frustrated, anxious about the specter of an imminent tax hike due this year.  They deserve clear, consistent and timely direction https://t.co/Fi5FVr7ASv"]["@melanistsenpai @CoryBooker Thanks for your message. Both of us have signed on to that CRA to restore #NetNeutrality."]["There is a fierce urgency of now when it comes to DACA and passing a #DreamAct. There is a possibility to come to an agreement, but the details are most important"]["@SenatorTester Was happy to provide the jumper cables my friend! #Teamwork #Fixers https://t.co/whG88B66NH"]["A little late coming back from the White House because my friend @SenatorTester had a little car… https://t.co/ulI7qUUu3v"]["A little late coming back from the WH because my friend @SenatorTester had a little car trouble. Friends don’t leave friends at the White House. https://t.co/uvooF9328s"]["SPEAKING NOW AT subcommittee hearing on Attacks on U.S. Diplomats in Cuba. https://t.co/W7Hjpk6Qku"]["TUNE IN NOW to subcommittee hearing on Attacks on U.S. Diplomats in Cuba. #RubioMenendez #Cuba https://t.co/W7Hjpk6Qku"]["Fog over the Capitol. Perfect imagery of our current state of affairs. https://t.co/PpCzPrQIlv"]["Fog over the Capitol. Perfect imagery of our current state of affairs. #capitol #capitolhill… https://t.co/12zYTlY2CS"]["Wow. Trump’s @FERC rejects the Trump’s coal subsidy plan. It’s because burning coal is not only dirty, it’s not even profitable. Bring on the renewable energy jobs in NJ! https://t.co/K68hWiIUsN"]["Today marks 100 days since #CHIP and Community Health Center funding expired. That's 100 days of Republicans neglecting 9 million children &amp; the more than 27 million who go to CHCs (via @NACHC). This is just plain unacceptable! https://t.co/JvigrsF65H"]["@SeanFoxontheroa @MatthewWolfff @EdMarkey @debbiesideris @ProudResister @EzraBridger2018 @CJPatruno @laureldavilacpa @CyrusToulabi @B52Malmet @chuckschumer @SenGillibrand @SenatorBooker Thanks for following up Shawn. Yes I am on Sen Markey's CRA that would restore #NetNeutrality"]["@JaneKleiman @CoryBooker Thanks Jane. Both of us have signed onto the resolution!"]["The American people deserve a free and open internet where Netflix runs at the same speed as Gmail, which runs at the same speed as Facebook, which runs at the same speed as @njdotcom. Proudly supporting @SenMarkey's CRA to restore #NetNeutrality"]["Republicans have spent 100 days ignoring my legislation to reauthorize #CHIP and it is unconscionable. Learn about my bipartisan bill here ---&gt; https://t.co/qcgACJQv9Z"]["Today marks 100 days since #CHIP funding expired. That's 100 days of Republicans neglecting 9 million children. (What were they spending all that time on? Oh just adding $1.5 trillion to the debt to cut taxes for the top 1% - #WrongPriorities)"]["Trump Admin's just announced TPS decision for El Salvador is cruel. The 200,000 Salvadorans w/ Temporary Protected Status are law-abiding, hard-working immigrants (many w/ U.S. citizen children). Congress must not allow them to be sent back to a nation torn by violence. #SaveTPS"]["Temporary Protected Status for 6,800 Salvadorans in New Jersey (w/ 3,900 U.S. citizen children!) must be preserved. It is imperative Congress find a permanent solution to #SaveTPS so hundreds of thousands aren't forced into the shadows to avoid Trump's deportation force. https://t.co/tvwtJ8KiHD"]["La Admin Trump esta ciegamente ansiosa X despoblar a nuestra nación d inmigrantes a toda costa. Es imperativo q el Congreso entienda su papel para defender nuestra posición moral y encontrar una solución permanente para otra comunidad más q se queda indocumentada #ElSalvador #TPS"]["Trump Admin's blind eagerness to depopulate our nation from law-abiding, hard-working immigrants at all costs makes it imperative that Congress defend our moral standing and find a permanent solution for yet another entire community who will now be undocumented. #ElSalvador #TPS"][".@northjersey Ed Board shares our fury over Trump Admin scheme to allow #BigOil to drill off the Jersey Shore. We’ve been through this fight before and won.  We must win again.  Check it out and get fired up to fight. #ProtectOurCoast  https://t.co/DX0N9WAzuo"]["The fact that this is being debated is troubling, and just underscores the need for the Foreign Relations Subcommittee hearing Sen. @marcorubio &amp; I are holding this upcoming week. Too many unanswered questions."]["Cuba must take responsibility for the safety of our diplomats there. Anyone who knows anything about Cuba knows nothing happens without the Castro regime knowing. That includes the 24 separate attacks on our diplomats."]["The Trump Administration plan to drill in the Atlantic ignores thousands of coastal communities, scientific warnings, &amp; even the Department of Interior's own findings! The drilling plan ignores everyone except #BigOil https://t.co/qdeoI0h8ut"]["#BREAKING While excerpts from “Fire and Fury” control the news cycle, the Trump Administration rolled back Obama regs and opened the Atlantic to dangerous oil drilling for the first time. That should cause real Fire and Fury from the American people. https://t.co/Uk9J4Qh3xJ https://t.co/cdoQvhkfLL"]["500,000 fishing families know offshore drilling risks their industry and their livelihood. As far as I'm concerned, that's 500,000 reasons not to do it. #ProtectOurCoast #KillTheDrill https://t.co/kYF99Jdh8G"]["Dictator Maduro does not act alone in his brutal totalitarian rule over Venezuela. I applaud @USTreasury new sanctions on senior military cronies for their ruthless repression of Venezuelans and flagrant complicity in destroying Venezuelan democracy. #SOSVenezuela https://t.co/x24wMjeGdI"]["@barryjgrossman @CoryBooker @SenKamalaHarris It's terrible Barry. I posted yesterday too, and I'm holding a press conference on it now with Gov-elect Murphy and Rep @FrankPallone. Watch here: https://t.co/Xa5cXC0NcY"]["With @PhilMurphyNJ &amp; @FrankPallone in Long Branch to stand up to the Trump Admin's giveaway to #BigOil. Drilling in the Atlantic is dangerous and risk's NJ's economy. #ProtectOurCoast. Watch Live: https://t.co/Xa5cXC0NcY"]["The Trump Admin. is giving #BigOil free rein in our oceans, risking the livelihood of coastal communities and businesses in the name of corporate profit. This is unnecessary, dangerous, and hurts NJ. #KillTheDrill https://t.co/ouPdMHUf7h"]["Turns out the problem was much worse than we thought. More than 320,000 New Jerseyans reported being harassed by these unwanted, annoying calls in 2017.\n\n“Do Not Call Registry\"? More like “Does Not Work Registry.\" The @FTC must do more to stop these scammers. https://t.co/rAPkit1wbH"]["#blizzard2018 is pretty underwhelming here in DC, but thanks @Keeyan29 from Wyckoff for posting these on my Facebook page. Share your pics of the #bombcyclone in the FB comments here: https://t.co/99hkRjsM3o https://t.co/eQGjAYt62l"]["Terrified the Trump Admin drilling decision could bring this BP oil spill ruin to NJ. We all remember Gulf Coast businesses, tourism season, and fishing industry getting turned upside down by this disaster 8 years ago. Have we not learned our lesson? #tbt #ProtectOurCoast https://t.co/mXZL4Cxawi"]["The Trump Administration undoing Obama-era offshore drilling bans is a handout to #BigOil that risks destroying our shore. That's why I stand w/ coastal businesses, fishing communities &amp; those who live on the coast who want to #KillTheDrill &amp; #ProtectOurCoast https://t.co/JOknIvrinI"]["First the Trump Admin. gives a massive tax break to #BigOil ahead of Christmas, now they get free rein in our oceans, risking the livelihood of coastal communities and businesses in the name of big corporate profits. This is unnecessary, dangerous, and hurts NJ. #KillTheDrill https://t.co/tLKG0NuUBU"]["❄️ I’m posting your #Snowday2018 pictures - just tag me in your post! ❄️ The snow storm here in… https://t.co/kkQGUeHwwu"]["This \"voter fraud\" commission was a farce - a thinly veiled attempt to suppress the vote. Its demise is a victory for the Constitution and the American people. https://t.co/8utkIWgGOD"]["Exciting to be able to say Senator Doug Jones and @SenTinaSmith. Can't wait to work with you to help working families and the middle class get ahead. https://t.co/1Yl0vEevFW"]["The size of our @StateDept is more important than the size of Trump’s nuclear button. Let's fund and fully staff US diplomacy, and keep us out of war. https://t.co/jkYUZ7poYH"]["Back in Washington with a lot on our plate. For example, @SenateDems have been demanding action on #CHIP for a while now. \n\nQuick reminder for GOP: I intro'd bipartisan legislation months ago called the KIDS Act to reauthorize #CHIP for 5 years https://t.co/qcgACJQv9Z"]["As of today, 14,586 DACA recipients have lost their protected status. That's 14,586 too many.  #DreamActNow"]["A world of democracies where human rights are universally respected is a safer world, with less war and more economic growth. That's why we need a fully staffed @StateDept promoting democracy &amp; human rights as a cornerstone of US foreign policy."]["Past debates have nothing to do with today's #IranProtests. We all agree ordinary Iranians peacefully rising up to protest their government is a fundamental right, and we stand with these brave protesters. https://t.co/eKcumUMj4U"]["Closely monitoring situation in Iran, possible North Korea - South Korea talks, and emergency meeting called in Pakistan. These major intn'l relations issues affect global stability &amp; American security, so WH must consult Congress &amp; work with us on solutions."]["We have a lot on our plate in 2018. We need to pass the #DreamActNow, fully fund #CHIP &amp; CHCs, pass meaningful disaster relief for Puerto Rico, reauthorize and reform Flood Insurance (#SafeNFIP), begin rebuilding our #infrastructure. There's no time to waste. #backtowork"]["Inspiring to see ordinary people in #IranProtest exercise their fundamental right to protest their govt, especially one whose brutality has ruined so many lives. All over the world I applaud those peacefully advocating for basic rights &amp; demanding accountability from their govt."]["#2017bestnine #mybestnine #happynewyear #newyearsday https://t.co/YPAPpT4irP"]["Happy New Year everyone and welcome to 2018! This past year, I was inspired by the tireless activism of ordinary Americans who care deeply about their future. Starting 2018, I am certain this year we will work hard to move our country forward together. #NewYearsDay"]["These five issues are near and dear to my heart, and I'm not just watching them in 2018, I'll be deeply involved in writing legislation, sounding the alarm, attending meetings, and advocating for #AmericanDreamers &amp; NJ's immigrant families. https://t.co/FTDTU5r1hK"]["North Korea sanctions do not work if China goes behind our back to undermine them. If true, there must be real action behind the rhetoric to hold China accountable.  https://t.co/mcZfZGErRB"]["How many must die on our rails before proven, life-saving, PTC is fully implemented? I have long-advocated for implementing this necessary technology, now let’s finally get this done. https://t.co/W9wQUwddXf"]["Horses are companions, work partners, athletes and cultural icons. Not food. My legislation to permanently ban horse slaughter is still getting blocked, but I'm proud to lead this creative (tho temporary) fix to ban it for now. Learn how --&gt; https://t.co/tYClTLUp9M https://t.co/GtN5KICqzk"]["We're going into the New Year with a lot on our plate. We need to pass the #DreamActNow, fully fund #CHIP &amp; CHCs, pass meaningful disaster relief for Puerto Rico, reauthorize and reform Flood Insurance (#SafeNFIP), begin rebuilding our #infrastructure. There's no time to waste."]["If you know me, you know I'm singing on Christmas. So from my family to yours:\n🎶Have yourself a merry little Christmas now 🎶 \n#MerryChristmas"]["Happy to be home for the holidays, but the plight of the Dreamers weighs heavy on my mind – especially the nearly 14,000 who’ve already lost DACA protections and are going through these holidays with fear. We must work diligently and quickly to pass the Dream Act ASAP."]["I’ve said over and over this #GOPTaxScam hurts our ability to invest in what our state needs such as schools, health, police and firefighters. Well, that includes infrastructure https://t.co/ZAffMF7Q3V"]["13,127 – Dreamers already back in the shadows\n3,403 - Dreamers losing protections thanks to McConnell refusal to include DREAM Act in y'day's funding bill\n22,000 - Dreamers who will have lost protections by March 5\n \nNevertheless, he persisted that it wasn’t a national emergency https://t.co/XkNF4og36A"]["@margotbardel That's great! You can start by volunteering with your local Democratic party, or come to one of my NJ offices to talk to staff on how you can volunteer and start to figure out what you can do. It will be one of the most rewarding choices you make!"]["Extremely disappointed Republicans ignored #AmericanDreamers and went home for the holidays without solving this national emergency. That just means we need to try twice as hard early next year. Let’s get it done. #DreamActNow https://t.co/Fxw9OZINs0"]["I'm voting NO on Republicans' short-term funding bill because:\nit does nothing for American Dreamers\nit has inadequate relief for Puerto Rico, FL, TX, &amp; CA\nit doesn’t even fully fund #CHIP!\n\nThis bill ignores our solemn responsibility to help every community in times of crisis."]["How many must die on our rails in tragedies like Hoboken, the Bronx, Philly and now Dupont before proven, life-saving, PTC is fully implemented? \nLet’s get this done.\n  https://t.co/rTVvzlZ74V https://t.co/woNYWvYEzs"]["@SueBee0619 Thank you for your kind words. Trying to fix their error legislatively now."]["Taxpayers shouldn’t have to subsidize corporate sexual misconduct– nor should victims be taxed after enduring traumatic experiences. That’s why I’m writing a bill to fix this mess. And I will personally write that language so Republicans don't screw this one up too."]["It’s infuriating. My amendment clearly stated I wanted to stop businesses from getting a tax write-off for sexual misconduct and continue protecting victims, but Republican negligence during a haphazard drafting process could now force victims to pay taxes on settlements."]["That’s apparently when things went wrong. In their mad rush to draft this bill, the GOP erroneously included the clause “this chapter” that some experts say could potentially force victims to pay taxes on settlement awards they receive."]["My amendment clearly referred solely to business expense deductions for sexual misconduct payouts. To my surprise, Republicans adopted it. BUT Finance Committee amendments are offered as concepts. Once adopted, Republicans are in charge of writing the actual language. https://t.co/hPdLaF7dSY"]["During the Finance Committee markup, I offered an amendment to stop corporations from writing off sexual misconduct payments as business expenses. That's right, settlement payments for sexual harassment were actually tax deductible."]["I wrote a provision to end corporate tax write-offs for sexual misconduct settlements. But Republicans got sloppy in their mad rush to pass their #GOPTaxScam, and their maddening error may now end up hurting victims.  Here's what happened:"]["@__danicarolina @SenBooker Of course! https://t.co/7Jsbou5yRi"]["The Trump Admin. ended DACA under the pretense that Republicans wouldn't be so heartless to young, hardworking #AmericanDreamers. \nWell that was wrong. \n\nI can't vote for a funding bill that heartlessly and cruelly leaves Dreamers out in the cold this Holiday season. #DreamActNow"]["More than 13,000 Dreamers have already lost their work permits and DACA protections, and now have to spend the holidays in fear that the next knock on the door will be the Trump deportation force. That's a national emergency. I'm voting NO on a CR that doesn't solve it."]["@kengumbo Ken, \nI know how to work with Republicans to get things done, and have done so many times. But that tax bill was nothing but a scam, hiking taxes on the middle class to pay for huge giveaways to corporations and the top 1%. I was proud to vote AGAINST it."]["Adriana is an #AmericanDreamer from Lakewood, NJ. She is an A student, and a role model for all of us. We can’t have young ppl like her worry all through this holiday season. It’s time we give her the security she needs &amp; pass the #DreamActNow https://t.co/dXZ68GkpYR"]["Sara has been a force – an #AmericanDreamer fighting for Dreamers that, like her, call New Jersey home. She can’t remember living anywhere else, and has dreams to continue to give back to her community. We can’t lose people like Sara. We must pass the #DreamActNow https://t.co/JWWopezVQS"]["The gov’t gave Erika a chance and made a promise, but now it could be taken away. We must pass a clean #DreamActNow and keep these amazing young people in the country they call home. https://t.co/hdxYTot6PU"]["DACA gave Elizabeth an opportunity to learn, create &amp; thrive managing a STEM program for students. She knows no country besides the U.S. It’s long past time we honor our promise &amp; pass a clean #DreamActNow so she &amp; all other Dreamers can continue to do so much in our communities https://t.co/u6T6g25zkT"]["We cannot allow a dedicated #AmericanDreamer like Daniella to get swept up in Trump’s deportation force. The U.S. is the only country she knows, and she contributes every day at home, in her community, and at NJ’s @JNJnews. We must protect her. We must pass the #DreamActNow https://t.co/h0oV585IlV"]["Brenda is a young #AmericanDreamer. She dreams of being a nurse. She dreams of taking care of people in her community. But losing DACA and being deported to a country that is not her real home would be a nightmare. She belongs here. It’s time to pass a clean #DreamActNow https://t.co/XFA5Q7G1ZU"]["THREAD - Time is not on our side. Join me in calling on the GOP to pass the #DreamActNow by RETWEETING these stories. The lives of young #AmericanDreamers are not invisible even if Republicans have forced them back into the shadows to languish."]["I introduced bipartisan legislation months ago called the KIDS Act to reauthorize #CHIP for FIVE YEARS. It is stunning Republican leadership has simply ignored it. https://t.co/qcgACJQv9Z"]["The Methodist building facing the US Senate will now have a mural of faces calling for a #DreamActNow. Republicans will have to face our united front every day they block us from passing a #DreamAct.\n\nThank you #IOPDreamers for inviting me! https://t.co/cKHJZv0FdT"]["Something is wrong with GOP priorities if passing trillion dollar tax cuts for corporations is easier than renewing health care for 9 million kids"]["#CHIP does not mean bargaining chip. It's despicable Republicans are gambling w/ the Children’s Health Insurance Program."]["#DreamActNow https://t.co/zdR82DjOWu"]["In just one month Republicans rushed a $1.4 trillion tax package through Congress w/ late night votes, handwritten edits, &amp; cheap legislative tricks\n\nBut renewing children's healthcare? For a whopping $8.2B? When I introd legislation in September? Oh boy, that's gonna be hard"]["How dare Republicans force parents to beg for their children's health insurance. We could have taken care of this in Sept. if Republicans hadn't become distracted  trying to take healthcare away from people and jamming a tax scam through Congress. https://t.co/ODIpfrHWu4"]["Protecting young #AmericanDreamers is in everyone’s interest. 95% of DACA recipients are working or in school. And thanks to DACA protections:\n63% got a better paying job\n54% bought their first car\n48% got a job w/ better conditions\n12% bought their first home.\n\n#DreamActNow"]["There it is. At 12:45 am, Republicans chose party over principle and ignored the American ppl who rejected this morally-bankrupt bill in droves. So sad we couldn’t work on real, deficit-neutral, bipartisan tax reform that simplifies our tax code &amp; delivers real gains to workers."]["As bad as this #GOPTaxScam is for the entire country, it’s particularly worse for New Jersey, threatening to derail investments in education, infrastructure, law enforcement, public health and other job-creating priorities. https://t.co/6EGAvX7XBk"]["And because they just had to, Republicans added insult to injury w/ a #GOPTaxScam that cynically sabotages our health insurance markets, threatening to skyrocket premiums and leave 13 million additional Americans without healthcare."]["Shameful Senate Republicans are about to pass a tax bill that burdens our children w/ trillions in debt, increases taxes on millions of middle class families, and treats NJ’s middle class like America’s piggy bank, all to give away trillions to corporate CEOs and the top 1%"]["NJ’ans can’t afford to subsidize the rest of the country more than we already do, and this highway robbery threatens to drive down home values and decimate our state’s ability to invest in public schools, infrastructure, law enforcement, &amp; vital economic priorities. #GOPTaxScam"]["#GOPTaxScam takes billions from hardworking NJ families by gutting the SALT deduction they rely on to deduct a combined $34 billion every year. And our children get stuck w/ trillions in debt these “deficit hawks” will use as an excuse to cut Social Security, Medicare, &amp; Medicaid"]["Ive always believed our tax code needs simplification for small businesses &amp; the middle class, but Republicans made it crystal clear they werent serious about a real reform like that. Instead they wrote a plan that hurts NJ families &amp; brazenly benefits corporate special interests"]["Calling their tax bill the #TaxCutsAndJobsAct would have been false advertising. Thankfully the name became available in time for me to introduce my own bill that fits the name much better by restoring SALT. https://t.co/uDgRsQkkjs"]["@itsMoeYeah I have been fighting it with all I've got. Absolutely voting no. Here's just some of what I've said: https://t.co/jXnYaHPfMd"]["@gilstar43 @CoryBooker Thank you for your call and for working against this bill. I assure you we're doing everything in our power to fight it, but Republicans are jamming it through. First vote happening right now - @CoryBooker and I are obviously voting no."]["122 young American Dreamers lose DACA protections every day. They study in our schools, serve in our military, work in our hospitals, contribute to our nation's wealth. Without the #DreamActNow, they could be whisked away to a country they don’t remember. https://t.co/bUJ18qAr2Z"]["History won’t be kind to those fighting tooth and nail to stop young #AmericanDreamers from staying in the only country they call home.  Put the #DreamAct up for a vote &amp; I know it will pass.   #DreamActNow"]["Anyone in the House who just voted to pass this ponzi-scheme of a tax bill has abandoned New Jersey, America's middle class and the working families who make this nation great. House Republicans should be ashamed. Americans must hold them accountable."]["If you thought the #GOPTaxPlan was just about taxes, you'd be wrong. Oh no, the effects go much further, even hitting your home values! It is an absolute monstrosity of a bill and anyone who votes for it is abandoning NJ homeowners. https://t.co/o56PQ45thj"]["This tax bill is a direct assault on New Jersey. As Piscataway Mayor Brian Wahler puts it: “This is the screw New Jersey bill.\" I couldn't agree more. https://t.co/kjP2JCB2TC"]["This is why I've fought so hard for mandatory PTC technology to automatically slow down trains. How many must die on our rails in tragedies like Hoboken, the Bronx, Philly and now Dupont before proven, life-saving, PTC is fully implemented? \nLet’s get this done. https://t.co/ycyurxHbWY"]["At the Banking Committee for votes on Export-Import Bank nominees, including Scott Garrett who voted repeatedly to kill the institution he's now been nominated to lead. #EXIM #OpposeGarrett  https://t.co/DlpMUWa5Jd"]["Irene from Brick, NJ wrote to me about Social Security &amp; the GOP tax bill. How are they related? Speaker Paul Ryan &amp; Republicans are already using the $1.4 trillion in debt their tax bill leaves us as an excuse to go after beloved programs YOU have worked your whole life to earn https://t.co/agOENg4RKR"]["I've been sounding the alarm on this since the beginning along with @SenateDems. Republicans' debt-exploding corporate tax cuts are their ticket to justifying Medicare cuts. That's just 1 reason their tax bill is a #GOPTaxScam.   https://t.co/bWdT3CP5Fw"]["2. And yes, I agree that economic security is national security. But then why are we risking that with a tax bill that adds trillions to the debt - much of which we owe foreign nations we're competing with! This National Security Strategy doesn't help us meet challenges abroad"]["1. Extremely disappointed by what was left out of Pres. Trump's speech. Supporting democracy &amp; human rights creates global stability &amp; peace. A National Security Strategy w/o those values strengthens dictators’ ability to oppress &amp; adversaries' ability to create war"]["@edwalz @CoryBooker @USRepRodney Hey Ed, just so you and your followers are aware, @CoryBooker and I are fighting hard to pass a clean #DreamAct before we go home for the holidays. We are fighting the Republicans trying to delay or obstruct it. We need the #DreamActNow"]["@OfficialGregC @CoryBooker @RepJoshG @DonaldNorcross @BillPascrell @RepDonaldPayne @RepBonnie @RepSires tell Twitter - I'd need more than 280 characters to mention everyone"]["@StudentoflifeMD @CoryBooker @RepJoshG @DonaldNorcross @BillPascrell @RepDonaldPayne @RepBonnie @RepSires Well, as only the third state to enter the union, it was on December 18, 1787 that New Jersey ratified the U.S. Constitution, thereby agreeing to join the new nation under it. https://t.co/7AnyUnM6X5"]["I was going to celebrate NJ’s birthday by posting a fun “only in Jersey” list, but my staff got worked up over divisive issues like Wawa and QuickCheck, pork roll v. taylor ham, Bon Jovi v. Springsteen, Eagles v. Giants &amp; Jets - so a simple “Happy Birthday” will have to suffice. https://t.co/Ab1aUAUOFv"]["This #GOPTaxScam goes far beyond taxes. The GOP wants to cut funding for crucial programs that have helped lift Latinos &amp; many Americans out of poverty just to provide a tax cut for the top 1%. Pls keep speaking out! https://t.co/0ebRsZGsvJ"]["Retweet if you think Congress must #ProtectDreamers before we go home for the holidays. #DreamActNow"]["#SundayMorning read. \ntl;dr?\nWINNERS: Corporations &amp; top 1%\nLOSERS: ppl buying health insurance, the average taxpayer, the elderly, low-income families, homeowners, New Jersey. \n#GOPTaxPlan #GOPTaxScam \nhttps://t.co/Wv5K9GO3jS"]["El 90% de los pequeñas negocios latinas NO recibirían ningún beneficio bajo la reforma tributaria republicana, pero las grandes corporaciones sí. En pocas palabras, esto no es una reforma tributaria. https://t.co/hncaM4atD7"]["90% of Latino small businesses would actually receive NO benefit from the #GOPTaxScam, but large corporations will. Simply put, that's not tax reform. https://t.co/fmLTmhPjXw"]["Bajo la reforma tributaria republicana, las grandes corporaciones y los multimillonarios recibirían un recorte de impuestos, mientras que 11.7 millones de familias latinas ganando menos de $75,000 verían un aumento de impuestos o no tendrán ningún alivio fiscal para 2027. https://t.co/aa1FX95gGu"]["New Jerseyans can’t afford to subsidize the rest of the country more than they already do, and this highway robbery threatens to drive down home values and decimate the ability of our state to invest in vital economic priorities. #GOPtaxscam https://t.co/Rp4YdLp4iS"]["Permanent tax cuts for corporations.\nExpiring tax cuts for some families. \nReally shows who Republicans are prioritizing in their #GOPTaxScam.\nhttps://t.co/vdqrgWkwVg"]["We must act before going home for the holidays. Over 12,000 young DACA recipients have already lost their protections. There’s no reason to break our promise to them by kicking the can down the road (Again) #DreamActNow https://t.co/7f22W6LW1w"]["It is long past time Iran returns Bob Levinson &amp; Xiyue Wang. They are Americans who deserve to be reunited with their families for the holidays. Pls read these important letters from Bob's daughter and Xiyue's wife &amp; share them to spread the word. https://t.co/FfPWzPhX86"]["We cannot allow a dedicated #AmericanDreamer like Daniella to get swept up in Trump’s deportation force. The U.S. is the only country she knows, and she contributes every day at home, in her community, and at NJ’s @JNJnews. We must protect her. We must pass the #DreamActNow https://t.co/TX7tOHDxZQ"]["I even offered an amendment requiring corporate tax cuts to expire if workers' wages don't rise. I bet you know how Republicans responded - yup, they rejected it.  #GOPTaxScam https://t.co/dqKacHzBmu"]["Adriana is an #AmericanDreamer from Lakewood, NJ. She is an A student, and a role model for all of us. We can’t have young ppl like her worry all through this holiday season. It’s time we give her the security she needs &amp; pass the #DreamActNow https://t.co/xxChHhO1AD"]["We must pass the #DreamAct before the holidays for ppl like Erika, an #AmericanDreamer whom the gov't promised would be protected if she came forward.  We must pass a clean #DreamActNow to keep her in the only country she calls home. https://t.co/2ah0raVQ9u"]["I’ve gotten so many emails opposed to the Republican tax plan, it would take almost 40,000 sheets of paper to print them all out. I’m not going to kill that many trees, but I will read a few to you today because I'm listening to the NJans who know this bill is a #GOPTaxScam. https://t.co/qDbVzCHqFT"]["If I wasn’t an environmentalist, and I printed out all 39,641 emails I've received asking me to oppose the tax bill, this is how high they'd stack. \n\nI'm listening to the New Jerseyans who know this bill is a #GOPTaxScam https://t.co/2fLG7NPPkc"]["@thecherness @AjitPaiFCC Just tweeted about this exact issue actually: https://t.co/kx1uYTgw78"]["A free and open internet has changed our lives and the world. Without  #NetNeutrality  we risk throttling American innovation, and opening the door to consumer abuses. https://t.co/7FJhd5WAEM"]["Kelly Conklin owns a small business in Kenilworth, NJ. The #GOPTaxScam hurts his family, his business, and his future. \n(Thx @mainstreetweets for connecting us) https://t.co/x8X51bLGoz"]["Thanks @mainstreetweets for finding this great story and all the work you're doing to stop the #GOPTaxScam"]["NJ small business owner John Chambranis explains why the #GOPTaxScam will hurt his business in Bordentown, NJ. I'm listening to him and NJ small business owners like him as I fight to restore full state &amp; local tax deductions to the bill https://t.co/2KV0Hj51M6"]["@JakeOliveira1 @4PublicSchools @NSBActionCenter Been fighting hard Jake. Thanks for talking to your friends and family about how awful this bill is! https://t.co/jXnYaHPfMd"]["SO MUCH we can do to stop gun violence, and @SenateDems have been trying! \nRepublican inaction is unacceptable."]["There is currently a BAN on doing gov't research about gun violence as a public health problem. Just research! We should lift that ban"]["I also co-sponsored simple legislation to ban bump stocks (used in Las Vegas massacre), and close a stupid loophole that allows gun sales without background checks https://t.co/e7N24Ntoam"]["We should pass @SenBlumenthal bill to incentivize gun makers to make safer, smarter products by holding them liable https://t.co/A76vfS5np1"]["I cosponsored @ChrisMurphyCT's bill to ensure anyone buying a gun at a gunshow gets a background check. #CommonSense https://t.co/wzvk6gzMme"]["My Keeping Americans Safe Act would ban large capacity magazines used for mass killing in Vegas, Texas &amp; more https://t.co/gBB3DBrJYB"]["I remember exactly where I was 5 years ago when I heard the horrifying news that 20 children and 6 educators were massacred at #SandyHook. I still pray for their families today, and I’ve tried to find every opportunity to #HonorWithAction thru legislation to #EndGunViolence"]["The GOP wants to cut funding for crucial programs that have helped lift Latinos out of poverty just to provide a tax cut for the rich. #GOPTaxScam https://t.co/EUzfEvoLrG"]["DACA gave Elizabeth an opportunity to learn, create &amp; thrive managing a STEM program for students. She knows no country besides the US. It’s long past time we honor our promise &amp; pass a clean #DreamActNow so she and all other Dreamers can continue to do so much in our communities https://t.co/ssDULCiNxN"]["El 90% de los pequeñas negocios latinas NO recibirían ningún beneficio bajo la reforma tributaria republicana, pero las grandes corporaciones sí. En pocas palabras, esto no es una reforma tributaria. #GOPTaxScam https://t.co/2i6xnXLHJg"]["La reforma tributaria republicana en el Senado pone en peligro las ganancias de 4.2 millones de latinos bajo la Ley del Cuidado de Salud, porque deja a millones de personas sin seguro médico y aumenta las primas por 10%. #GOPTaxScam https://t.co/E4sul2q4Nx"]["EL COLMO: Los republicanos quieren recortar fondos para programas que han ayudado a sacar a los latinos de la pobreza para darle un recorte de impuestos a los multimillonarios. #GOPTaxScam https://t.co/qUXXJSwurE"]["Bajo la reforma tributaria republicana, las grandes corporaciones y los multimillonarios recibirían un recorte de impuestos, mientras que 11.7 millones de familias latinas ganando menos de $75,000 verían un aumento de impuestos o no tendrán ningún alivio fiscal para 2027. https://t.co/Xloi32tGgy"]["In #GOPTaxScam bills we have seen, corporations keep their state &amp; local tax deductions, but individuals lose them. That is a warped sense of priorities. Putting corporations ahead of people isn't pro-growth. https://t.co/AQc4CJ9Upi"]["Sara has been a force – an #AmericanDreamer fighting for Dreamers that, like her, call New Jersey home. She can’t remember living anywhere else, and has dreams to continue to give back to her community. We can’t lose people like Sara. We must pass the #DreamActNow https://t.co/t31gNjsLOv"]["Brenda is a young #AmericanDreamer. She dreams of being a nurse. She dreams of taking care of people in her community. But losing DACA and being deported to a country that is not her real home would be a nightmare. She belongs here. It’s time to pass a clean #DreamActNow https://t.co/XX7JLMvXk8"]["They already have an agreement when we haven't even had a meeting yet! First meeting of conference committee begins at 2, and I'll do all I can to fight for NJ, but they're jamming this #GOPTaxScam through Congress before we even know what's in it! https://t.co/IPHakpblL8"]["Why is this the homepage image on my website?  Because the lives of young #AmericanDreamers are not invisible even if Republicans have forced them back into the shadows to languish. Time is not on our side. Join me in calling on GOP to pass the #DreamActNow. #AmericanDreamer https://t.co/Asgkt9h1it"]["An agreement reached without so much as a meeting with Democrats. This isn't the bipartisan tax reform we need. This is a middle class tax hike forced on the American people as a Christmas gift to corporations and the top 1%. It's a #GOPTaxScam https://t.co/dpVpQdGQc0"]["🎶 “Tomorrow's getting harder, make no mistake, luck ain't enough, you've got to make your own breaks” 🎶\nCongrats to @BonJovi on induction to Rock &amp; Roll Hall of Fame! Proud day for New Jersey!"]["Welcome to the Senate Doug Jones!"]["On the first night of #Hanukkah, may this year’s Festival of Lights be a reminder for Jews around the world to keep alive the flame of hope. Have a wonderful and meaningful eight days and nights—Happy Hanukkah! https://t.co/u1nfl0FFly"]["RT if you agree w/ @SenateDems' 3 simple demands for this tax conference committee:\n1 We need to actually meet, not just vote on what Republicans write in secret\n2 The meetings shld be public &amp; Dem amndments allowed\n3 We need independent analyses of the final bill before voting https://t.co/aIh0OdMaYF"]["🚨🚑 A surprise hospital visit can happen to anyone. If it happens to you, you’ll want health insurance.  This is the final week to sign up, and 8 out of 10 people who go to https://t.co/oqgvcoULhM qualify for a subsidy to help them afford it. So #getcovered today! 🚨🚑 https://t.co/welDySrVJb"]["The kind of growth we must encourage is growth in WORKERS' WAGES. This tax bill simply grows corporate profits and CEO wages. #GOPTaxScam https://t.co/X1qMij8Npi"]["Great news! That must mean you’ll be voting against the tax bill that adds over $1 trillion to that debt you care so much about. https://t.co/PIiltIMOFR"]["Jimmy Kimmel – someone who more than likely is a major beneficiary of Republicans’ tax cuts for the rich – doesn’t care about that. He’s livid that the GOP, in their zeal for helping corporations and the top 1%, has forgotten about children’s health. So am I Jimmy. So am I. https://t.co/jHll6SDMTa"]["Well @SenateDems aren't divided. We oppose cutting the Medicare benefits YOU earned with a lifetime of hard work. First way to stop future Medicare cuts: stopping this horrible debt-exploding #GOPTaxScam https://t.co/qdxEHukk9H"]["I understand why Jimmy Kimmel got emotional. Children’s health should be sacred. It is morally reprehensible Republicans have pushed CHIP aside to focus on a ponzi scheme of a tax plan. Worth watching every minute https://t.co/6ZLArZSQ43"]["Don’t take my word for it, even the Toms River business community says the GOP tax plan hurts NJ.  https://t.co/tuKT3GaP9G"]["🚨 This is it – the final week to sign up for health insurance. 8 out of 10 people who sign up for coverage qualify for a subsidy to help them afford it so sign up today, save money, and #getcovered at https://t.co/oqgvcoULhM https://t.co/KDh68OLihq"]["How can a plan be for the middle class when it has huge, PERMANENT tax cuts for corporations and the top 1%, but the tiny tax cuts that do exist for regular people EXPIRE? #WrongPriorities https://t.co/NvqRJjC9Gc"]["$2,330 might not be a lot to the top 1%, but for the 22% of NJ middle class families who'd lose their SALT deduction, that makes a BIG difference. #GOPTaxScam https://t.co/QYg5oqsep3"]["If you thought the #GOPTaxPlan was just about taxes, you'd be wrong. Oh no, the effects go much further, even hitting your home values! It is an absolute monstrosity of a bill that hammers New Jersey homeowners more than anyone else. https://t.co/36M0hebw1o"]["I want to express my gratitude and support for the first responders after this morning's Port Authority bombing near Times Square. This is a poignant reminder of why we fight so hard for the funds our communities need to keep us safe. https://t.co/sSHUnsRi6n"]["Trump’s Christmas gift for airline industry? More hidden fees for consumers, this time for luggage. https://t.co/arPUHMpqYq"]["This is the last weekend to #GetCovered on the health insurance exchanges. Try some of these creative ways to remind your friends and family. #OpenEnrollment https://t.co/YE6aD2jVxu"]["The success stories of Sara, Adriana, Reiniero and so many others are a testament to the… https://t.co/g00nV6pdns"]["There it is, straight from Paul Ryan's mouth, exactly what we've been warning about. Republicans want to use their debt-exploding corporate tax cuts as an excuse to cut YOUR Social Security and Medicare. If you're not furious, you're not paying attention. https://t.co/dIvRqbjjdS"]["You can bet I'll be bringing this chart with me to the tax conference meeting. The bill's effects go much further than taxes, even hitting your home values! And HALF of the top 30 counties hit hardest are in New Jersey. https://t.co/PYhZp4pWo7"]["Glad to be in the room fighting like hell to stop GOP's middle class tax hikes. I'll use every minute and every tool at my disposal to protect millions of Americans from being sold out by Republicans trying to pad the pockets of corporate special interests. https://t.co/afPEvctm6t"]["We’ve been fighting for a DREAM Act for over a decade. Now is NOT the time to show indifference towards DREAMers when faced by Republicans’ cruelty.  Watch my #DreamActNow call to action on the @DSenFloor NOW\nhttps://t.co/xxEiBSjaUx"]["The March deadline for #DACA is a myth! Over 11,000 young people who've lost their DACA protections know that. Heading to the @DSenFloor to make sure Republicans know too. #DreamActNow WATCH LIVE SOON: https://t.co/Xa5cXC0NcY"]["Dreamers continue to show Washington that they will NOT back down. Today I’m taking to the Senate floor to say neither will I.  Check back to my Facebook at approx. 1 pm as I speak on the @DSenFloor LIVE https://t.co/u8X7z7rvoa"]["76 yrs ago, 2,403 lives were lost at Pearl Harbor, and the course of history changed forever. Today we honor those who’ve made the ultimate sacrifice in defense of our nation, and remember the American people’s unwavering resilience in the darkest of times. #PearlHarborDay https://t.co/snSsrH0ZPH"]["Spoke to @NCLR Janet Murguia on why we need to pass the #DreamActNow. Over 11,00 #DACA… https://t.co/lzrWl9XJwt"]["My Senate colleagues and I from MD, NJ, NY, &amp; CA wrote this to House Republicans from our state: If #GOPTaxPlan is supposed to be a tax cut, then why is it raising taxes on our states? Congress cannot force these partisan tax increases on our constituents without your support. https://t.co/KqV5Wtlahn"]["Under the #GOPtaxscam corporations can deduct their state and local taxes, but working families cannot. How is that fair? @CoryBooker and I asked our House colleagues https://t.co/ZBkF49fa07"]["Why?? I can tell you why. Because Republicans decided massive corporate tax cuts, middle class tax hikes, and dismantling the Affordable Care Act were more important than children's health https://t.co/LOJ9LykJS0"]["We are committed to DREAMers’ dreams becoming a reality. #iMarch #DreamActNow \nWATCH LIVE NOW: https://t.co/qNe6OshP9G"]["En español ahora: https://t.co/qNe6Oszq1e"]["There is no time to wait - we must end this year with a #CleanDreamActNOW. #iMarch #DreamAct #DreamActNow\n WATCH LIVE NOW: https://t.co/qNe6OshP9G https://t.co/MP8NUftF7E"]["My staff will run this account now as we begin our LIVE discussion on the #DreamAct. Join @JMurguia_Unidos &amp; I now: https://t.co/u8X7z7rvoa"]["TUNE IN SOON as I discuss with @WeAreUnidosUS why we need to pass the #DreamActNow, even though Republicans falsely claim we have until March 5th \nWATCH HERE: https://t.co/u8X7z7rvoa"]["Join me and @WeAreUnidosUS for an update on the fight for the Dream Act at 11:15 on Facebook Live! More than 11,000 DACA recipients have already lost their protected status - that's why passing the Dream Act this year is a national emergency. #DreamActNow https://t.co/u8X7z7rvoa https://t.co/yXHRmEkzlu"]["We are at a pivotal moment in the fight for the #DreamAct. TUNE IN today at 11 as I join @WeAreUnidosUS to update everyone on why we need the #DreamActNow  \nhttps://t.co/xxEiBSjaUx https://t.co/LsFMiCfzW5"]["I don’t get it.  Missing a payment while on deployment shouldn’t ruin a military family’s financial future after they come home.  I offered a common sense amendment to the banking bill that would give added protection to servicemen and women on active duty.  But it was defeated. https://t.co/kVPkPH6scp"]["This is simply false. Over 11,000 young DACA recipients - including many in NJ and Texas - have already lost their protections due to the termination of DACA. There’s no reason to break our promise to them by kicking the can down the road (again) #DreamActNow https://t.co/oZfebOrG9d"]["Remember when we saw the huge damage WellsFargo culture caused w/toxic mix of low pay, high risk to consumers, impossible sales quotas, &amp; harsh punishments? My amdmt wld ensure banking bill doesn't reward banks like Wells Fargo for this behavior.  Should be a no brainer, right?"]["The #MasterpieceCakeshop case is not about cake or even weddings. It’s about equal treatment under the law. No one should be refused service based on who you are, whom you love, or what you look like. SCOTUS must do what is right"]["Don't let anyone tell you this isn't a tax increase.  I can't understand how anyone from New Jersey could think this is a good idea. That's why @GLFOP, @njchamber, @NEAToday, @ahahospitals, @AARP, @NJBIA, @IAFFNewsDesk and so many other groups oppose it. https://t.co/Hpa7fXByLY"]["Only reason for Trump Admin to shrink national protected lands is to do bidding of big developers. These are sacred sites &amp; national treasures that should be preserved #MonumentsForAll. #StandWithBearsEars #SaveGrandStaircase https://t.co/5iGEqBJB5A"]["The NFL, NBA, MLB, and NHL can’t go all-in on Fantasy sports (gambling by any other name) and then cry foul on legalized sports betting.  That’s hypocrisy. Here's Lebron playing them the world's tiniest violin. #SCOTUS should bet on NJ! \nhttps://t.co/DmASLE2aT0 https://t.co/8gtP4JwyuX"]["The C in CHIP stands for Children. It’s the Children’s Health Insurance Program. You had no problem cutting $83B in taxes on inheritances for rich children, but poor children need to help themselves get healthcare? \n\nDespicable. https://t.co/Y6HcStb309"]["It’s not over yet. We can’t let the GOP get away with a massive financial injustice. Republicans are now negotiating on a final bill behind closed doors, and YOU deserve to have a voice. https://t.co/Hpa7fXByLY"]["@kristen_19 @nj11forchange @SenBooker Hey Kristen, I assure you I am very much against the tax bill and @corybooker and I have been fighting it with everything we’ve got. Thank you for your dedication to the issue, we need that now more than ever!"]["I hope to God that Senate Republicans go home this weekend and take a good hard look at the people who sent them to Washington.  The people they promised to look out for.  Because those are exactly the people who will be hurt the most.  https://t.co/VNcSKuktqx"]["There you have it. At 1:49 AM, Senate Republicans sold out working people, students, seniors, millennials, and millions of middle class families. Let’s be clear:  The only people who’ll come out on top under the GOP’s tax scam are already sitting up there. https://t.co/VjXn5vVOkZ"]["Republicans say middle class taxes won't go up, and investments in local services won’t go down. All I suggested was that SALT deductions return if they're wrong. But they wouldn't have it. I guess they don't trust what they're saying any more than I do."]["Just intro'd this measure we're now voting on because GOP says gutting SALT deduction to pay for corporate tax breaks won’t force cuts in local investments.  When was the last time a corporate tax cut educated a child, cared for a senior, built a road or kept a neighborhood safe? https://t.co/tFz1UMowC1"]["On @DSenFloor and about to intro a very simple proposal: if state and local investments in infrastructure, education law enforcement, services for our children and our seniors are reduced, the SALT deduction millions of ppl rely on comes back.  Sound good? https://t.co/DlpMUWrGAL"]["Now I voted for an amendment I cosponsored that would have permanently expanded the child tax credit. Republicans, again, said no. #GOPTaxScam"]["I just voted to stop future cuts to Medicare and Social Security that may be triggered by #GOPTaxBill, but not surprisingly the Republicans rejected it. It's almost like they know those kind of painful cuts is exactly what their deficit will lead to. #GOPTaxScam"]["Okay this is absurd. One page of the new #GOPTaxPlan is crossed out with an ex. Another page is just a line. Is that a crossout? Is this page part of the bill? \nWHY AM I ASKING THESE QUESTIONS HOURS BEFORE WE VOTE ON IT?? #GOPTaxScam https://t.co/57Qbi7gT5F"]["So much for regular order! Oh yeah sure, we'll have plenty of time to read the final GOP tax bill - if you can make out the scribbled handwriting snuck into this massive, unsearchable PDF.  #GOPTaxScam https://t.co/a64mNovvHQ"]["Snuck into Republicans' horrible tax bill is an even worse health care bill that will explode Americans' health care premiums, and take insurance from 13 million people. That's why it's a #GOPTxScam https://t.co/JWpqr2ewJs"]["Americans age 50-64 already pay high health care premiums - the last thing they need is a Republican tax bill that jacks up their health insurance costs even more. #GOPTaxScam https://t.co/yUuWNW03dV"]["@DSenFloor @SenatorCantwell @ChrisVanHollen Senator Inhoffe is speaking now, and then I will be joining @SenatorCantwell on the floor to discuss."]["Heading to the @DSenFloor now to try to protect millions of middle class families who will wind up paying taxes on their taxes unless Republicans accept my amendment w/ @SenatorCantwell &amp; @ChrisVanHollen to restore state &amp; local tax deduction.  TUNE IN: https://t.co/4mf0cUXS8m"]["If Republicans block our amendment to protect SALT deduction NJ's middle class relies on, they are increasing the tax burden for millions. The middle-class has supported this nation for decades, now it’s time we support them. https://t.co/9wm6mwRKGY"]["62 yrs ago today, Rosa Parks changed our nation by refusing to give up her bus seat. This bold act of defiance added a new spark to the civil rights movement that ended legalized segregation. Rosa serves an example for all of us to tirelessly fight discrimination in all forms https://t.co/0YXl4LaWiE"]["@DineWithPat @SenBillNelson And now Republicans have shot it down, because their bill was never really about the middle class. https://t.co/TM5jAQV99N"]["@DineWithPat @SenBillNelson Absolutely voting against it. Thanks for always staying on top of things @DineWithPat"]["Now voting for @SenBillNelson motion to make middle class tax cuts permanent because it's absurd to me that corporate tax cuts could be permanent, but tiny, temporary tax relief some families get expire like Cinderella's chariot at midnight"]["Today we remember the lives lost due to HIV/AIDS. Progress has been made, but there is still more work to be done. That’s why I am committed to do all I can to combat the disease and end discrimination towards those living with it. #WorldAIDSDay"]["#GOPTaxScam makes tax cuts for the wealthiest 1% and corporations PERMANENT. But the meager cuts that do exist for families are written in disappearing ink. https://t.co/WhFlROxXC8"]["The tax bill we're voting on today goes far beyond rate changes, and in the long-term could dramatically alter everyone's lives https://t.co/6uuB7cH7q7"]["👇 https://t.co/I2jdzB8rP2"]["Senator Toomey just claimed the state &amp; local tax deduction is a “handout” to states like New Jersey. Heading to the @DSenFloor now to dispel that myth https://t.co/BDSn9JRkyg"]["If Republicans block my amendment tonight w/ @SenatorCantwell to protect SALT deduction NJ's middle class relies on, they are increasing the tax burden for millions. The middle-class has supported this nation for decades, now it’s time we support them.  https://t.co/gCpczRh5xv"]["With time to debate the #GOPTaxPlan being limited, I decided to go live on Facebook to speak to you directly about why this plan is really a #GOPTaxScam. Watch here: https://t.co/OrFg6gyjeW https://t.co/3MVPNQ8IW0"]["This is outrageous. The Trump admin must secure the immediate release of US citizen employees of CITGO detained by the Maduro regime before a Chavez family member takes the helm of an extensive network of refineries &amp; pipelines across the US. #Venezuela https://t.co/CxsNJBTi7H"]["Just voted on @SenBobCasey motion to increase workers' wages. Not surprisingly, Republicans shot it down. #GOPTaxScam"]["GOP says a corporate tax cut say will raise wages. Really? Okay, how about if it doesn’t raise wages, their taxes go right back. Will Republicans take that bet? Doubt it, but I have to try. #GOPTaxScam https://t.co/W3CBba90dF"]["\"The tax cut package, for instance, could trigger rules mandating cuts to Medicare,\"\n\n\"The proposals break from seven decades’ worth of federal efforts to broaden access to higher education.\"\n\n“This tax bill is a grand deception,”\nhttps://t.co/6uuB7cH7q7"]["MUST READ! The Trump tax bill we're voting on today is a bait and switch Ponzi scheme that will cause profound damage to our country for generations. https://t.co/6uuB7cH7q7"]["NJ is an economic powerhouse because we invest in our citizens. We need a tax plan that doesn’t punish us for being a blue state, but rewards us for being a blue-chip state. That's one reason I just voted against motion to proceed to take up the GOP tax plan. https://t.co/Cigq7WzXoK"]["It’s plain wrong to ask hardworking families to DOUBLE PAY their taxes so  that big corporations can pay LESS. And quite frankly I’m sick and tired of Congress treating New Jersey like America’s piggy bank. #GOPTaxPlan #GOPTaxScam https://t.co/VhZvHV3JTI"]["Just left my office and I’m walking to the senate floor now. Time to WATCH LIVE as I explain how Trump’s tax bill is a massive tax on the success of states like NJ. https://t.co/bMYYHQjOIF https://t.co/8SSF7QeaeA"]["How does this outrageous #GOPTaxPlan put New Jersey in the crosshairs? TUNE IN around 3:35 as I explain on the @DSenFloor https://t.co/Yj8tDYNmCY"]["Americans age 50-64 already pay high health care premiums - the last thing they need is a Republican tax bill that jacks up their health insurance costs even more https://t.co/Pxm6n7rjmf"]["Republicans are tirelessly employing sabotage and deception to try and derail the healthcare plans of millions of struggling families. But the American people see through their trickery, and have already signed up in record numbers at https://t.co/RGsg9wiweU https://t.co/iCKj0ZnRci"]["Snuck into Republicans' horrible tax bill is an even worse health care bill that will explode older Americans' health care premiums. It’s unacceptable. https://t.co/gtc9ZPKk0Z"]["Dear AG Sessions,\nPolitical divisiveness and hate rhetoric has reached a boiling point. We fear this disturbing trend will show no signs of reversing unless we take decisive action https://t.co/520h8tkUdZ https://t.co/7MO5yATPce"]["Senator McConnell has said over and over and over that a tax reform package shouldn’t increase the deficit. Yet the #GOPTaxPlan adds an astounding $1.5 trillion to our national debt! So by his own standards, Republicans should reject it. https://t.co/LkGPNTKB3V"]["My friend @RepGutierrez has been a fearless, compassionate voice for anyone pursuing the American Dream. I will dearly miss his trusted advice, tough negotiating skills, and dependable friendship. https://t.co/UgwzrQbVxe https://t.co/3x0HPUf5sQ"]["Another ballistic missile launch from North Korea, and it's still not clear to me how the Trump Administration is pressuring China to act. We seem to be embracing China without them doing anything in return. https://t.co/8DJKYfCw0b"]["Every day Republicans block us from passing the #DreamAct, they inject fear into hardworking young people contributing to our nation as teachers, nurses, doctors and students. If we don’t #ProtectDreamers, we are risking their livelihoods AND our economy. https://t.co/pitQbCkVpw"]["The GOP claims they are the \"Family Values\" party \n1 in 3 Dreamers has a U.S. citizen child \n3 in 4 Dreamers have a U.S. citizen parent, sibling, or spouse \n \nNEWSFLASH: American families will be torn apart if we don't pass a #DreamAct this year. Time to put up &amp; #ProtectDreamers"]["Pressure is building. Momentum is on our side. We need to pass the #DreamAct now!  Everyday we delay, 122 young people lose protections and become targets for Trump's mass deportation force. #ProtectDreamers https://t.co/xwJ95tpDNk"]["#ICYMI. As debate heats up on Senate GOP tax proposal, remember this isn’t tax reform, it’s a budget-busting abomination that treats New Jersey’s middle class like America’s piggy bank and I will not stand for it https://t.co/XxjzZeJ2PD https://t.co/8i91euVkai"]["This #CyberMonday, some of the best online deals are at https://t.co/RGsg9wiweU, where nearly 8 out of 10 people qualify for discounts on health insurance for 2018. Be sure to #GetCovered today!"]["For 6 years, @CFPB has provided BILLIONS in consumer relief as the watchdog America needs. That's why we must #DefendCFPB https://t.co/iD3438NmLC"]["Who is in charge at CFPB? Look at the law, it's right there in plain (Leandra) English. https://t.co/bDY09r4FDm"]["How do I know Leandra English should be in charge of CFPB this morning? \nThe Dodd-Frank law creating @CFPB says the Deputy Director is in charge in the absence of a Director\nThere is currently an absence of a Director\nLeandra English is Deputy Director\nTherefore, she's in charge"]["As tax debate heats up tomorrow, remember the Republican tax bill puts a target on New Jersey, and we need every one of you to rise up against it! https://t.co/4PElMHIJRw"]["Just because you don’t like Dodd-Frank doesn’t mean you can ignore it. The Dodd-Frank Act is clear—in the absence of a director, the deputy director of @CFPB is in charge. That means Leandra English."]["#DidYouKnow if you #ShopSmall today for #SmallBizSat, you are supporting the millions of jobs created by small businesses across America? What's your favorite NJ small business? https://t.co/aFyEQzT03r"]["It's #SmallBizSat and time to #ShopSmall. Whether you avoided #BlackFriday altogether, or were up at 4 am, I hope you can also take some time today to support our small businesses. https://t.co/2J4ULMB4ss"]["I also want to #givethanks for the servicemembers in our military. They are the bravest Americans, often leaving their family for extended periods of time to keep our nation safe. We must honor their sacrifice, thank them for their service, and support them each and every day."]["Today I #givethanks for:\n- My incredible family, whom I love beyond words\n- The opportunity to work together in a spirit of giving, uniting around our common concerns &amp; shared values\n- The privilege of serving the ppl of NJ to ensure they get a government that works for everyone"]["Leftovers go well with health insurance. Remind your guests to sign up for healthcare, no matter where they are in the house. #GetCovered at https://t.co/RGsg9wiweU https://t.co/aWQO8kyMv4"]["Trump is already driving the Republican Party into extinction. Now he’s going after their logo... https://t.co/sHtpQQOgGc"]["Pushing elephants closer to extinction, just so the super rich can hang an inhumane trophy on their mantels.  That's wrong, and @Interior needs to answer our questions. #BeKindToElephants https://t.co/spDgpbQfyD https://t.co/5AZkIBPpFo"]["Tired of nagging your friends &amp; family about signing up for healthcare before enrollment ends? Get creative! Here’s just some ways to sneak a reminder in to their daily lives. #GetCovered #OpenEnrollment https://t.co/cdX2ApeI31"]["Faced by a lack of ‘bad hombres’, the Trump administration is shamelessly creating deportable immigrants out of thin air and tearing apart American families. Congress must find a permanent solution for the Haitian #TPS population that will now be undocumented in 18 months. https://t.co/RfndKOdqn2"]["I am proud of NJ’s own @IbtihajMuhammad for this history-making Barbie doll. She continues to inspire women and girls to break boundaries and redefine what a champion looks like for us all https://t.co/VjtvHpgLeM"]["The Trump Admin’s plan to collect and track social media activity of those who have immigrated to this country seems to be another attempt at intimidating immigrants out of our nation. READ our letter demanding answers from @DHSgov https://t.co/XYFT2FZj1S https://t.co/giEHOQXUtm"]["Surprise surprise, the #GOPTaxPlan will do the opposite of what they said. @mattyglesias explains:  https://t.co/cO7noWAWoe https://t.co/1yJUXLVTnW"]["Today we remember the countless Transgender Americans who lost their lives due to hate and bigotry. I stand with the Transgender community and will continue to fight for full equality in our nation. #TDOR #TDOR2017"]["@cwu_bunzi @CoryBooker That makes three of us Christina. Thanks for speaking out and telling all your friends and family to organize against it. https://t.co/Zyydvtccyx"]["Look around you and find 3 other middle class New Jerseyans. It’s likely losing the SALT deduction means one of you will face higher taxes under the Republican tax plan. That’s not a risk I’m willing to take. We must stop the #GOPTaxScam https://t.co/3riOcD0s2s"]["#ThanksgivingWeek is a great time to #GetCovered.  #OpenEnrollment ends Dec. 15 (half the time we had last year). Make a plan now at https://t.co/RGsg9wiweU https://t.co/oDErbWQZ4f"]["Under the Republican tax plan, \"households earning less than $75,000 per year will see, on average, a tax increase.” That's why it's a #GOPTaxScam, and we must stop it  https://t.co/cO7noWAWoe"]["Stafford Township and all of NJ is proud of @MartinTruex_Jr tonight for winning the #NASCARPlayoffs championship!    #TruexJr #Championship4"]["Corporate profits are up, and wages are stagnant. Yet the GOP proposes a dramatic corporate tax cut?? My amendment was simple: no corporate tax cut without wage growth. But Republicans rejected it. #GOPTaxScam https://t.co/j4HLPQkMWr"]["The courage of my fellow Americans never ceases to inspire me. To all the millions who have fought tooth and nail to defend the ACA and their right to live-saving, affordable healthcare: let’s keep the momentum going. Shop for insurance now at https://t.co/RGsg9wiweU https://t.co/WV1Dsx2gQ7"]["This year’s open-enrollment period has been undermined &amp; attacked by the Trump Administration. But we can fight back by spreading the word to friends, family, neighbors: NOW is the time to sign up for 2018 healthcare at https://t.co/RGsg9wiweU https://t.co/19oJ90Eb8Q"]["Coming together with community healthcare advocates to remind everyone that you only have until December 15 to sign up for health insurance. Go to https://t.co/RGsg9wiweU today and start planning! https://t.co/3hg8G5EZ96"]["By rejecting my amendment to protect SALT deduction NJ's middle class relies on, Republicans are supporting a higher tax burden for millions. The middle-class has supported this nation for decades - it’s time we support them. https://t.co/d5zVgTYAxi"]["It is well-past time that we address the unfair, unequal treatment of Puerto Rico in our tax code. That's why I proposed an amendment to let millions of Puerto Ricans take advantage of the same deductions that help Americans make ends meet. But of course, Republicans rejected it. https://t.co/kckSo9U2Rl"]["GOP says a corporate tax cut say will raise wages. Really? Okay, how about if it doesn’t raise wages, their taxes go right back. I thought that was a common sense amendment, but Republicans rejected it. https://t.co/W9ifP8fuAc"]["Republicans love the middle class so much they want to take their hard earned money and use it for gov. handouts to big oil companies. I filed an amendment to #GOPTaxPlan to put this money back in the pockets of working families, but GOP blocked it. #GOPTaxScam https://t.co/yMP2mnyi9i"]["A todos los que me han apoyado, gracias totales. https://t.co/GJU5Fslh7o"]["To all who have stood by me, thank you. \n https://t.co/9ZuYxMq4vp"]["Pushing elephants closer to extinction, just so the super rich can hang an inhumane trophy on their mantels.  This is wrong. https://t.co/gYNPj87xti"]["$2,330 might not be a lot to the top 1%, but for the 22% of NJ middle class families losing their SALT deduction, that makes a BIG difference. https://t.co/G861cOxAVy"]["Richard Cordray has fought for NJ families at @CFPB and has been a true protector of American consumers.  He will be sorely missed and we @SenateDems and @HouseDemocrats must continue to fight to protect this essential agency."]["@brianschatz Do you trust these people to rewrite our tax code?  I don’t…"]["POLL: The Mnuchins are really happy about:\na) The new wallpaper they just picked out \nb) Richard Cordray departing the @CFPB \nc) The massive tax cut they’re about to get if Republicans pass their #GOPTaxScam https://t.co/GcL56vNVw4"]["How do I know Republicans tax plan isn't about the middle class? It has huge, PERMANENT tax cuts for corporations and the top 1%. But the tiny tax cuts that do exist for regular people, those EXPIRE."]["I stand with @AARPadvocates, senior citizens and the millions whose health insurance is now risked by #GOPTaxPlan https://t.co/oG9IpH44Ik"]["Unbelievable Republicans would try to sneak a terrible healthcare repeal bill into a terrible tax bill. It's like a wolf in wolf's clothing."]["Congrats to NJ’s own @ibtihajmuhammad for this history-making Barbie doll - the first to wear a… https://t.co/aWyru6S0Ju"]["Societies that prioritize equal rights and combating gender-based violence are more secure, stable, and prosperous. That's why we’re introducing the International Violence Against Women Act again. Ending gender-based violence and discrimination must be a top priority for the U.S. https://t.co/mttjwLQWVC"]["As if increasing the middle class tax burden wasn't enough, Republicans now want to sneak a healthcare repeal bill into their tax plan, tearing health insurance from 13 million Americans, and increasing health insurance premiums by 10% https://t.co/YkSSWaR6Xl"]["Instead of helping every American get coverage, Pres. Trump is hoping you don't know it's #OpenEnrollment. \nFight back. #GetCovered @ https://t.co/RGsg9wiweU https://t.co/wy23EHo0Al"]["Not only does the Republican tax plan increase taxes on millions of middle class families, but eventually Republicans will be forced to cut from essential programs to pay for it. That's why it's a #GOPTaxScam https://t.co/GWNOvT166b"]["There is a real human cost to every day that Republicans block a clean #DreamAct in Congress. It’s reprehensible to shrug at 800K American Dreamers who are at risk of unfair detention and deportation.  #DreamActNow https://t.co/uIaPBP173Y"]["Maduro has led his country into a humanitarian disaster and financial despair. We must vigilantly assure that a lifeline from Russia doesn’t further harm U.S. interests in the region https://t.co/ol0YJbwWcY"]["Even President Reagan’s tax policy adviser says Republicans' tax plan won’t pay for itself. That it risks cuts to domestic programs down the line. That's not a risk I'm willing to take. https://t.co/hF4hNLHjnJ"]["“The argument that tax reform is going to raise wages is all a lie.” That’s President Reagan’s tax policy adviser. #NotFakeNews  #GOPTaxScam https://t.co/yPRGWqCfaV"]["Overjoyed at news of Bill Gates investing $100 million to find a cure for Alzheimer's! The heart-wrenching experience of watching my mother struggle with the disease strengthened my resolve to find a cure, and so I pledge to fight for necessary gov't investment too."]["How does a deficit of over $1 trillion from #GOPTaxPlan affect the average American? Not only does it increase taxes on millions of middle class families, but eventually Republicans will be forced to cut from essential programs to pay for it. https://t.co/EZFOUiNwqp"]["Either Trump &amp; the Republicans actually think increasing the tax burden on NJ's middle class is a good way to help working families, or they’re not being honest about who their plan benefits. #GOPTaxScam"]["Happy #VeteransDay and thank you to all our veterans—men and women who wear the uniform of the United States both past and present—who serve across the globe, and stand as a sentry to our liberties and our system of justice. 🇺🇸 https://t.co/K5HV2AnOY7"]["Why aren't working families the most excited? Why aren't New Jersey homeowners? Because Republicans’ tax plan has never really been about them. https://t.co/RIoLJDfcaR"]["Senate GOP proposal isn’t tax reform, it’s a budget-busting abomination that treats New Jersey’s middle class like America’s piggy bank and I will not stand for it. https://t.co/XxjzZeJ2PD https://t.co/Yv8IqnobNP"]["In a stunning move, the Trump Senate GOP tax plan hurts New Jersey EVEN MORE than the House bill. Completely eliminating state &amp; local tax deduction is a direct attack on New Jerseyans"]["Going through Trump/Senate GOP tax plan now (since it was written in secret with no Dem input). They may have tinkered with numbers, but they are still laser focused on gutting tax deductions NJ's middle class relies on."]["President Trump's China comments make the United States look weak and as if we are bowing to China’s whim. Instead of giving China credit for stealing American jobs, the President should be holding China accountable and working to end China’s unfair trade practices."]["28 years ago today, the Berlin Wall - a divisive wall of hate - came crumbling down because ordinary people united to demand democracy and change. Let us celebrate #WorldFreedomDay by pledging our support to those around the globe struggling for freedom and democracy."]["RETWEET if you want @SpeakerRyan and @SenateMajLdr to put the #DreamAct to a vote now! I'm certain it would pass with bipartisan support. #DreamActNow https://t.co/uPHF2mWJEA"]["Republicans should know better than to pretend Dreamers aren't a crucial part of our bright future. We need a clean #DreamActNow. https://t.co/yM49SCJQOI"]["Every Dreamer speaking up in Congress today has an American story to tell.  @SenateGOP should get to know these brave Americans. We must fix DACA with a clean #DreamActNow https://t.co/dKkF55II0V"]["This is democracy in action! Not only are our nation’s immigrant and civil  rights movements surviving in the Trump era, they are flourishing in spite of it. I stand w/ the hundreds of brave young Dreamers who have descended on Capitol Hill to demand a #DreamActNow. https://t.co/EmzxmLug5G"]["Swipe to get the full picture, but this is democracy in action! Not only are our nation’s… https://t.co/IK8eGYvMi8"]["It turns out the Republican’s “fiscal responsibility” was a sham. The #GOPTaxScam would add $1.7 TRILLION to the debt while RAISING the tax burden on many NJ middle class families. Doesn’t sound very responsible to me."]["House Republicans think their tax plan will let you do your taxes on a postcard. Well here's a postcard of all the deductions and tax credits the middle class relies on that they'll throw into the garbage. #GOPTaxScam https://t.co/11qfxuHYGY"]["Raising taxes for more than 25% of Americans is unacceptable. Middle class Americans need MORE money in their pocket, not less. (h/t @TaxPolicyCenter) https://t.co/MjPbfV9vvK"]["This is exactly why I will continue to fight for this screening to be mandatory despite the Trump Administration's attempt to prevent it. People's lives are at risk. https://t.co/Q5XcnFTdwB"]["When the Republican tax giveaway to corporations and the top 1% explodes the deficit, they'll be looking to the middle class to pay for it. #GOPTaxScam https://t.co/2rXF9osXUh"]["A vote for the Republican tax plan is a vote for increasing the tax burden on the middle class. We need a tax code that helps working families, not hurts them. https://t.co/BlMZO808zF"]["The key to a safe community is trust between police and residents. Passing the #DreamAct helps make that a reality. https://t.co/OeAuK4C863 https://t.co/WUamWt0Lhh"]["Why does blowing a $1.7 trillion hole in the deficit matter? Because future Republicans will use it as an excuse to cut Medicare &amp; Social Security. That's not a risk we can take. https://t.co/LF1izp1SD8"]["Proud to intro assault weapons ban w/ my colleagues. Weapons of war are unnecessary for hunting, personal protection or sport. There is only one reason anyone would need assault weapons &amp; high-capacity ammunition magazines, and that’s mass murder. https://t.co/1P9XV2WVwe https://t.co/nQQp45gvLW"]["The non-partisan @USCBO now says the #GOPTaxPlan will blow an even bigger hole in the deficit than they thought. That means future Republicans will have to take even more out of Medicare, Social Security &amp; Education to pay for it. #GOPTaxScam https://t.co/c45kcwyqQF"]["Congress has a duty to protect Dreamers right now. Some Republicans in Congress are eager to… https://t.co/OLE8guuhkt"]["President Trump could deport almost 900 DREAMers serving in our military. They protect our country. We should protect them with the #DreamAct now https://t.co/ZazDuaFG77"]["Anyone who says they'll vote for the #GOPTaxScam is saying they are A-OK with INCREASING the property tax burden on tens of thousands of NJ families, plain and simple."]["Wow. The US is now the ONLY country not to join the Paris climate accord. \nTalk about leading from behind. https://t.co/s5kCnqzEUm"]["By obliterating the #SALT deduction that middle class NJans rely on, the Trump tax plan is effectively a tax INCREASE imposed by the Fed Gov"]["Law enforcement wants a clean #DreamAct to pass because without it, community safety is at risk https://t.co/OeAuK4C863 https://t.co/0QkS2yZp43"]["Retweet if you think we shld protect DACA recipients who bring vital language &amp; healthcare skills to our military. Let's pass the #DreamAct https://t.co/g2efSiknva"]["Revocar el #TPS obliga a comunidades enteras a vivir en las sombras, dejando deportar a inmigrantes al pie de la ley #SaveTPS https://t.co/YS252sOWFs"]["Revoking #TPS forces entire communities into the shadows &amp; subjects law-abiding immigrants to deportation. #SaveTPS https://t.co/XNK4rPelzg https://t.co/vWW2sfBNRU"]["People didn't fight and die for our right to vote just so you could be discouraged by lines. Get in line by 8pm &amp; your vote MUST be counted"]["We need #BRINKAct for North Korea. I've long championed sanctions as a diplomatic tool for pressuring rogue nations to reduce their threat. https://t.co/yqOCvYCU3p"]["If we stop banks &amp; firms from doing business w/ North Korea, we can leverage pressure and stop their nuclear ambitions .#BRINKAct https://t.co/gw93j35fVw"]["What time are you voting today? Make a plan, set an alarm, and go vote. Polls are open until 8 pm https://t.co/iVT6XsHU9P"]["Tomorrow polls will be open from 6:00 a.m to 8:00 p.m. What time are you voting? Don’t know where to go? Check:  https://t.co/wGMpuOs0Iw"]["@ChrisMurphyCT @SenBlumenthal SO MUCH we can do to stop gun violence. \n1 thing we can't do: send thoughts &amp; prayers and then go home. Republican inaction is unacceptable"]["@ChrisMurphyCT @SenBlumenthal There is currently a BAN on doing gov't research about gun violence as a public health problem. Just research! We should lift that ban"]["@ChrisMurphyCT @SenBlumenthal #DidYouKnow if a background check isn't completed in 3 days, a gun sale can go through without one? Another stupid loophole we could fix"]["@ChrisMurphyCT @SenBlumenthal President Bill Clinton passed an assault weapons ban I voted for in 1993. President Bush let it expire. It’s long past time to bring it back"]["@ChrisMurphyCT We should pass @SenBlumenthal bill to incentivize gun makers to make safer, smarter products by holding them liable https://t.co/A76vfS5np1"]["I cosponsored @ChrisMurphyCT's bill to ensure anyone buying a gun at a gunshow gets a background check. #CommonSense https://t.co/wzvk6gzMme"]["My Keeping Americans Safe Act would ban large capacity magazines used for mass killing in Vegas, Texas &amp; more https://t.co/gBB3DBrJYB"]["THREAD: The time is NOW to talk about gun safety. I support and have introduced real legislation that can make a difference. Read on..."]["Learning that the magazine used in #TexasChurchMassacre would have been banned if my bill banning lg capacity mags was law. We must act!"]["I agree that supporting mental health can also be part of the debate, but LOOK Trump hasn't even tried https://t.co/VdPtzupcsc"]["The NJ Chamber of Commerce always supports tax cuts. They can't support Trump Tax plan because they know it's truly a tax INCREASE on NJ. https://t.co/EwfR79LV7Z"]["It’s wrong for #GOPtaxbill to end deductions that middle class NJans rely on just so the President’s heirs get a tax cut https://t.co/RwGURiFOFe"]["You pay taxes on your income and sales. And now GOP wants to end state &amp; local income/sales tax deduction, so you pay taxes ON your taxes https://t.co/Usz6h0sBEs"]["Trump Admin is so determined to round up &amp; deport immigrants, they're willing to end #TPS just to give themselves more targets #SaveTPS"]["How can Trump justify the mass deportation of 325K vulnerable ppl with #TPS?? He can't. We must #SaveTPS https://t.co/XPaojsHQCE"]["20,000 people in New Jersey alone could be deported to dangerous countries if Trump ends #TPS. This cruelty cannot stand. We must #SaveTPS"]["Republicans' proposed tax cuts (mostly for corporations &amp; the top 1%) cost $150 billion a year!… https://t.co/8I72V1GDA6"]["A church on a Sunday. Absolutely horrible. I’m praying for the #texaschurchshooting victims &amp; their families."]["Celebrating the fortitude of Susan B Anthony who 145yrs ago made #herstory as a pioneer for women's suffrage w/ her first attempt to vote https://t.co/aXCfMsj9F8"]["Republicans' proposed tax cuts (mostly for corporations &amp; the top 1%) cost $150 billion a year! Think of the big things we could do w/ that https://t.co/AbLtUj2OPb"]["Republicans' proposed tax cuts (mostly for corporations &amp; the top 1%) cost $150 billion a year! Think of the big things we could do w/ that https://t.co/JWzelbMpOH"]["It’s wrong to end the student loan interest deduction for millions of young ppl w/ college debt just so the President’s heirs get a tax cut https://t.co/RQt1mtbu5w"]["By obliterating deductions that middle class NJans rely on, the Trump tax plan is effectively a property tax INCREASE imposed by the Fed Gov https://t.co/EjyZ9wRXmm"]["Heading to Bloomfield w/ @CoryBooker to detail how the #TrumpTaxPlan will hurt NJ’s middle class &amp; homeowners. #NoDoubleTaxation #TaxReform"]["Trump Tax Bill would INCREASE taxes on middle class families, and make it more expensive to \nbuy a home\nraise a family\nsend kids to college"]["Dear GOP: \nYou can't have a partisan meeting and expect bipartisan results \n\nYou need us\nWe need a #CleanDreamAct this year\n\nYou do the math https://t.co/LG1S1Ky70T"]["My mother worked just as hard as the men at her factory job, but got paid less. For her and all Latinas, I fight for #LatinaEqualPay https://t.co/nxyANtiUTX"]["Latina women lead households across America. How can they raise families making 54¢ on the dollar? #LatinaEqualPayDay https://t.co/BZdPvpfbuy"]["GOP tax plan wld RAISE middle class taxes to pay for massive giveaways to corporations and top 1%. That's ludicrous https://t.co/mGj6CW3eVw"]["Diversity is exactly what makes Edison, NJ great &amp; shld be celebrated. These mailers are disgusting, un-American, &amp; belong in the trash https://t.co/Bq3wl5KQ6d"]["While everyone debates exactly how much House GOP tax plan raises middle class taxes, it clearly cuts corporations' taxes. #WrongPriorities"]["TODAY is the start of #OpenEnrollment. Sign up for health insurance by Dec 15 (half the time we had last year). Make a plan &amp; #getcovered https://t.co/Q5UNVSDEQk"]["We must #StandWithWorkers, and that means supporting unions essential to creating and sustaining the middle class."]["We shouldn’t be spending millions on medicine that ends up in the trash. It makes no sense and we need to act https://t.co/BEa1HJbYm3 https://t.co/6JNnjLUcBA"]["American wrkrs succeed when #EXIM Bank succeeds, so why confirm someone who is against it? #SupportEXIM not #Garrett https://t.co/UZbsqU7HQa"]["The #EXIM bank levels the playing field, saving jobs for American workers, including right here in NJ. #SupportEXIM https://t.co/OlNcS28rg4"]["Voting against #EXIM bank means voting against US jobs. Garrett has done it twice. He can’t lead the EXIM Bank. #SupportEXIM not #Garrett"]["Closely tracking news in Manhattan. Praying for the victims &amp; families of this tragedy. As always, first responders embody courage &amp; heroism"]["OJO: Nueva info d @FEMA sobre refugios temporales en Puerto Rico para desplazados d los huracanes Irma y María: https://t.co/WOcCXGBDv0"]["Puerto Ricans displaced by Hurricanes Irma and Maria should check out this new housing info from @fema https://t.co/hp1Sbaek4y"]["I swear I'm getting more robocalls than ever. And they even look like NJ numbers. Calling on @FTC to help us hang up on robocallers for good https://t.co/ncQMHeX008"]["We must stop GOP from sneaking in legislative riders that let corporations secretly spend $$ to influence our democracy #NoRiders #Halloween https://t.co/9PSHK6eepZ"]["Open enrollment for #Healthcare starts tomorrow! Plan ahead and pick a time to start shopping now at https://t.co/AultHJtcSi https://t.co/zkmIGJfBqj"]["Govt agents waiting outside a hospital room to detain a disabled 10yr old won't \"Make America Safe Again\" #FreeRosa https://t.co/g6QZuGSxSu"]["Good. Discriminating against our transgender servicemembers is no way to honor and thank them for their bravery &amp; service https://t.co/KRuF7q3MT3"]["30% of Americans earning b/w 50k-150k, and 60% of Americans earning b/w 150k - 300k, would see their TAXES GO UP under GOP tax reform plan. https://t.co/lRndd8fXkn"]["Took 3 yrs to win low-interest loans for homeowners &amp; small business damaged by Sandy. Glad this helped recovery effort move along. #Sandy5 https://t.co/bDxjgmQwnn"]["The Sandy Task Force we convened 2 years ago was necessary to bring justice to victims and begin reforming the claims process. #sandy5 https://t.co/Mxn5Kv91E9"]["I'm incredibly proud that this meeting in May 2015 led to FEMA reopening 144,000 claims. Still fighting for those still hurting. #Sandy5 https://t.co/LnDf3VdazK"]["Meeting w/ #Sandy victims like the Quinn family 3.5 yrs ago was eye-opening, &amp; essential to starting to reform a system that failed. #Sandy5 https://t.co/CHEQKm6ODD"]["Fought harder than I ever imagined to pass this $60 billion #Sandy relief bill 5 yrs ago. I'll never forget those who stood w/ us. #Sandy5 https://t.co/cqi7TWzIQb"]["Many are still hurting. But New Jerseyans are strong. New Jerseyans are resilient. 5 yrs after Sandy we remain #StrongerThanTheStorm #sandy5 https://t.co/SmilffoUp4"]["In this video, Paul Ryan struggles to defend Trump's \"tax reform.\" It's pretty darn hard to defend raising taxes on NJ families by $3,500 https://t.co/jAZEDp03qi"]["New Jerseyans already know we pay high taxes. Now Republicans want you to pay taxes ON your… https://t.co/GHvw7uIvyv"]["Not sure how the #TrumpTax plan to end state &amp; local tax deduction will affect you and your family? Here is a video to help you out. https://t.co/VW5OzEJZtc"]["House GOP passed a budget today that lets them end state &amp; local tax deduction, which means HIGHER TAXES on families. This is unacceptable https://t.co/dcpUK8wRNz"]["New Jerseyans already know we pay high taxes. Now Republicans want you to pay taxes ON your taxes. This is crazy. #TrumpTax #NotOnePenny https://t.co/G28wfiSxsI"]["The Trump-Republican tax reform plan is complicated. So here's an easy video on how it forces this middle class family to pay MORE taxes https://t.co/gZg0C66Ucc"]["Our government made a promise to protect DREAMers. We will not allow Pres.Trump’s DHS to deport, target or victimize our DREAMers. https://t.co/8HFS7NU2VO"]["El gobierno prometió respetar la info delicada sobre DREAMers que recolectamos con DACA ¡Le exigimos al DHS de Trump que cumplan! https://t.co/dG9wyb5uWj"]["Called on Pres.Trump to stand up for US employees &amp; emphasize human rights when dealing w/ Turkey. @SenJohnMcCain &amp; 12 bipartisan Sens agree https://t.co/ONE3u7qws9"]["@SenBobCasey @SenMarkey More info on our Combating the Opioid Epidemic Act here: https://t.co/BwNgLGvChW"]["When it comes to the #opioidcrisis, it's time for action not lip service. Intro'd bill w/ @SenBobCasey &amp; @SenMarkey to tackle it head on https://t.co/arsXTCmxu3"]["@UniNoticias @verizon Urging both parties to return to the negotiating table and resolve their differences for the sake of our communities https://t.co/vIzGwlO65q"]["133K of my constituents, many of them Spanish speakers lost access to news in their language because of the @UniNoticias @Verizon dispute..."]["@UNITEDWEDREAM @SenFeinstein @SenatorDurbin @MartinHeinrich @SenCortezMasto @TUSK81 @germanrlopez Las personas que solicitaron DACA se basaron en esta garantía al presentar sus solicitudes https://t.co/Axve5jkyC0"]["Los Demócratas estamos enfocados en proteger a los DREAMers a toda costa. No permitiremos que ICE use información privada en su contra https://t.co/FxmQWxILpl"]["@SenatorDurbin @SenFeinstein @MartinHeinrich @SenCortezMasto @RepLujanGrisham @HispanicCaucus @TUSK81 @UNITEDWEDREAM Information provided as part of DACA program is protected and should not used for enforcement purposes. https://t.co/q8fCBAuI1x"]["Dems are fighting from all angles to #protectDACA. We cannot allow ICE to break the govt’s promise &amp; use confidential info against DREAMers. https://t.co/1OZ0JCdB9G"]["The Americans in Puerto Rico deserve the same treatment as the Americans in Texas &amp; Florida. This aid package cant be the end of this effort https://t.co/gTp6u94tMF"]["@CFPB @Public_Citizen Republicans who save the #RipOffClause today are throwing Americans under the bus to protect Big Banks, plain and simple."]["@CFPB Especially after latest Equifax data breach, it is just common sense to support the @CFPB rule (cc @Public_Citizen) https://t.co/eVjRiZDS1G"]["@CFPB Without the threat of a massive lawsuit, financial institutions are free to continue to defraud their customers with no accountability"]["@CFPB But today, GOP is trying to repeal that rule, thinking Americans should be denied their right to sue when Big Banks don’t play by the rules"]["The @CFPB, supported by many of us in Congress, rightfully banned the #RipOffClause for the financial sector to protect consumer's rights"]["Worse over, financial institutions use #RipOffClause to strip military service-members of their right to justice: https://t.co/CjY8TV4Bug"]["And, Wells Fargo continues to use #RipOffClause to squash customer lawsuits on unfair overdraft fees"]["Even after the Wells Fargo scandal became public, they used a #RipOffClause to deprive customers of their day in court"]["So without the threat of a major lawsuit, Wells Fargo opened millions of fake accounts for their customers which racked up millions in fees"]["Currently, financial institutions can use arbitration clauses (#RipOffClause) to ban you from joining a class-action lawsuit against them"]["THREAD This is how Republicans are making it harder to seek justice from corporations like Equifax &amp; Wells Fargo #RipOffClause #SJRes47 #CRA"]["How we respond to the tragedy in PR will test the collective conscious of our nation. The aid package being debated should only be a start https://t.co/1N6OtvOYB6"]["Just when you thought it couldn't get worse, the @EPA suppresses science to please the chemical industry &amp; risk children's lives. Stunning. https://t.co/JxqIOclxGN"]["PR Disaster Relief Package that Senate debates tonight is an insufficient but long overdue 1st step. Things continue to get worse everyday https://t.co/x3o1zAc7wb"]["War is peace. Freedom is slavery. Ignorance is strength. And perfluorooctanoic acid is safe. https://t.co/jN9tCvgzeP"]["The chemical industry basically gets a mole into the @EPA &amp; dangerous chemicals are suddenly safe? I call BS  https://t.co/rJ0H6rGomc https://t.co/VoLZI3AUCk"]["MUST READ: Trump Admin. lets a chemical industry lackey into @EPA &amp; suddenly dangerous chemicals are no longer banned. It's outrageous https://t.co/xW9Fi4bxfp"]["FYI: There may be little media attn on latest Venezuela elections fraud, but I'm paying attention &amp; won't back down in pushing U.S. to act"]["Being an immigrant doesn’t eliminate a woman’s right to make her own choices about her life &amp; body. #JusticeForJane https://t.co/CpoB1IUAJu https://t.co/3BjopCEJT8"]["Venezuela Dictator Maduro claims election victories? No, that's not how elections work, that's how oppression works. https://t.co/7RKwhZcApn"]["To all my friends celebrating tonight, I wish you a Happy Diwali. Want to learn more? Check this out:\nhttps://t.co/Ky5GPnjoA7"]["On @DSenFloor soon to denounce GOP budget cuts, $1.5 trillion debt bomb &amp; demand equal treatment for PR. WATCH https://t.co/1y5dfD8O8Q"]["Simply put, this budget does not reflect our values."]["80% of GOP's tax breaks would go to the top 1% while large swaths of the middle class could see a tax increase to pay for those tax breaks"]["I also can't support a budget that sets up an elimination of the state and local tax deduction that NJ middle class residents rely on"]["Not to mention the GOP budget takes over $1.4 TRILLION dollars from Medicaid and Medicare"]["It cuts $800 billion from our investments in affordable housing, medical research &amp; education!"]["This is all while ballooning the deficit by $1.5 TRILLION over the next decade"]["The GOP budget lets them shower the super-rich and corporations with trillions in tax breaks"]["The GOP budget allows them to move towards a tax package that raises taxes on hard working middle class families"]["THREAD: Why I’ll vote NO on GOP budget"]["Preparing to go on the @DSenFloor at 7 pm to talk PR and denounce the harmful Republican budget cuts. TUNE IN HERE https://t.co/1y5dfD8O8Q https://t.co/hxpUNlEyua"]["Tonight Im speaking out on the @DSenfloor. As Americans, PuertoRicans deserve real, effective &amp; fair disaster relief https://t.co/1y5dfD8O8Q https://t.co/uR9fMVSAjB"]["We can’t let vital community oriented policing programs fall victim to GOP budget cuts. So I intro'd an amendment to protect them https://t.co/ARdDKuKxwW"]["Republicans want to cut taxes for the top 1%, but blocked this budget amendment protecting the middle class from tax increases. For real... https://t.co/EQtINcJ01y"]["Trump travel ban still undermines core values that built this country &amp; harms our natl security. Lets end it (again) https://t.co/WXgn25zblc https://t.co/0JWhrem36Y"]["Our fight to #saveTPS goes on. @DHSgov must do the right thing: renew TPS protections for Honduras &amp; El Salvador https://t.co/xQQct5wcUL https://t.co/WxAW21XxlB"]["Republican budget being debated is an assault on Medicare &amp; Medicaid, cutting $1.4 trillion! We @SenateDems are fighting it w/ amendments https://t.co/nVEsuLrqfg"]["Republicans have no problem taking $473 billion from Medicare in their budget to give tax cuts to the top 1%. Really shows who they value https://t.co/xe72hV2zMy"]["Cutting $1 TRILLION from Medicaid &amp; BILLIONS from Medicare to help the top 1% is unconscionable. What a terrible deal for the middle class https://t.co/XM14fJRkJ8"]["Thanks to all who came out &amp; had a blast w/ @RepGutierrez and NJ’s Hispanic community at #HHM2017. Photos here: https://t.co/bpsX1OVSuR https://t.co/b1w4Uv2F7e"]["$1 Trillion. That's not a typo, I mean trillion with a T. \nFrankly, those kind of Medicaid cuts are immoral. https://t.co/YeKLfZjKN6"]["I've been pushing for bipartisan solutions to improve healthcare for all Americans from the beginning. I'm reviewing this promising proposal https://t.co/AsR9Cw9bqB"]["We need to fast-track PR recovery. FEMA &amp; the Admin must allow PR to start rebuilding infrastructure, water facilities, utilities &amp; more https://t.co/lib6Px0zTf"]["Guess what? FEWER Puerto Ricans have power restored than a week ago. Our fellow Americans are in desperate need https://t.co/JjKR6cvdw4"]["This Republican budget is a new kind of Robin Hood: take from mom and dad to give to the Trumps. I say Medicare cuts are unacceptable. https://t.co/Ey6HlWXeRH"]["Everything is set for #HispanicHeritageMonth 2017 at Union City High School. Food dancing and more. See you at 3pm! https://t.co/WUvzA13c1t https://t.co/MtEJbgT6vu"]["This #SundayMorning I'm preparing for our great #HispanicHeritageMonth celebration in Union City at 3 pm TODAY! See you there? https://t.co/Vmsoww9coh"]["We’ve got a great event planned for you tomorrow. Come enjoy music, performances, dinner and more all on us. https://t.co/WUvzA13c1t https://t.co/7l0jQ4tfcB"]["Infrastructure investment benefits all. For businesses: huge savings. For workers: faster transit. For families: a healthier environment. https://t.co/DmQRYk2v6R"]["This Sunday - there’s no better way to celebrate #HispanicHeritageMonth than bringing the… https://t.co/y28HVtFHDL"]["Who’s excited for our #HHM2017 celebration? Keynote speaker @RepGutierrez is! Come see us Sunday. RSVP here https://t.co/OuhJiBl2jR https://t.co/HVLwkvSfel"]["I joined @CoryBooker &amp; a bipartisan delegation to fund a new NJ Portal Bridge. We need high-quality infrastructure to grow our economy. https://t.co/qG2SkKamKI"]["We need to confront a belligerent Iran, not alienate our allies. Read my full statement: https://t.co/SFP2bb4wM7 https://t.co/cpkJF9d8rI"]["160,000 students skip school every day for fear of being bullied. This is unacceptable. We need to #StandUpToBullying"]["The citizens of Puerto Rico should not be the collateral damage in Trump’s political vendettas. PR response thus far is a calamity. https://t.co/7tNhOgF21z"]["The President will commit taxpayer funds for a political stunt over football, but can’t be bothered to help PR during a humanitarian crisis?"]["#tbt to working to protect DREAMers w/ @RepGutierrez last year. He'll be at our #HHM17 celebration in NJ. Will you? https://t.co/OuhJiBl2jR https://t.co/FH2anL7l4g"]["Join me &amp; @RepGutierrez Sunday the 15th for my Annual Celebration of #HispanicHeritageMonth in Union City! RSVP https://t.co/OuhJiBl2jR https://t.co/FOwkgLbxYv"]["Hispanics have the highest exposure rates for 10 out of 14 major pollutants.\nEnding Clean Power Plan just hurts them\nhttps://t.co/QVdGlS2YJL"]["Pres.Trump ending the Clean Power Plan goes beyond climate change, it also pollutes our air, hurting our kids. They deserve better than this https://t.co/czJgqYJCnG"]["Pres.Trump ending the Clean Power Plan is disastrous for public health. The fossil fuel industry clearly has a vice grip on the Trump Admin. https://t.co/Zb3urZcEW2"]["This Sunday - there’s no better way to celebrate #HispanicHeritageMonth than bringing the… https://t.co/JXkWyN8h34"]["Today is #WorldMentalHealthDay. Let’s debunk the stigma that prevents those who need help to speak out. Lend a hand. Listen. Help."]["Join me THIS SUNDAY for my #HispanicHeritageMonth celebration in Union City! RSVP &amp; we'll be sure to save you a seat https://t.co/OuhJiBl2jR https://t.co/cXlSDRlQLv"]["#ICYMI My legislation intro'd w/ @CoryBooker &amp; colleagues wld ban large capacity magazines used for mass murder https://t.co/gBB3DBrJYB https://t.co/0ksEf8HkCI"]["Show me your budget &amp; I'll tell you your values. Clearly Republicans dont value Medicaid's lifesaving care for children, seniors, &amp; disabled https://t.co/QDVAcb2Dfw"]["Young DREAMers shldnt be traded for more measures that terrorize families &amp; unaccompanied minors fleeing violence. This “offer” is offensive https://t.co/Ev9B3Sf2Pr"]["Proud @RepGutierrez will be our Keynote speaker at my free  #HispanicHeritageMonth event one week from today! RSVP https://t.co/WUvzA13c1t https://t.co/BLxcihoNCI"]["Warmer oceans mean deadly hurricanes more frequently. Harvey, Irma, Maria, now #HurricaneNate? ClimateChange is at our doorstep. Time to act"]["La mejor manera de celebrar el #MesDeLaHerenciaHispana? Reunir a la comunidad X resistir y celebrar nuestra cultura\nhttps://t.co/OuhJiBl2jR https://t.co/BJvrkd9ii4"]["This Republican budget is a new kind of Robin Hood: take from mom and dad to give to the Trumps. I say Medicare cuts are unacceptable. https://t.co/IlSYVbGGaV"]["In typical fashion, the President loves to put his name on things that make him money. His latest venture? The GOP estate tax cut https://t.co/aWcT4Pa273"]["Join me October 15 for my 8th annual celebration of #HispanicHeritageMonth in Union City! RSVP here https://t.co/OuhJiBl2jR  #HHM2017 https://t.co/9QFWiN4ZwL"]["How many more “deadliest mass shootings in U.S. history” until we can pass commonsense legislation? Let's start here https://t.co/gBB3DBrJYB https://t.co/WtUNRvXuRD"]["If we were able to rightfully send 20,000 troops to Haiti, surely we can get more boots on the ground to save American lives in Puerto Rico https://t.co/hXu6rC2fw0"]["Puerto Rico may be \"an island in a big ocean\" as the President called it, but it's an island of American citizens constantly neglected. https://t.co/OZYdPMLZ1W"]["Puerto Ricans need more than paper towels. They need a serious aid package. WATCH the @DSenFloor at 1:15 HERE: https://t.co/u8X7z7rvoa"]["My trip to Puerto Rico was stunning. My Senate colleagues need to hear about it. Bringing pics to @DSenFloor @ 1:15: https://t.co/u8X7z7rvoa https://t.co/SLxUipKb3s"]["Automatic weapons are illegal. Bump stocks that let ppl convert firearms into automatic weapons should be too. The Automatic Gunfire Prevention Act is a commonsense bill. Commonsense means Congress would be stupid not to pass it."]["We’re Americans. We are not powerless. We can help prevent horrific massacres like in Las Vegas. That’s why I cosponsored a bill banning bump stocks &amp; plan to reintroduce my legislation to outlaw large capacity ammunition."]["With the end of DACA, the future of DREAMers is uncertain. I’m here to assure them that my… https://t.co/101VCCEs0y"]["DREAMers had the courage to come out of the shadows. Now we must show them we have the courage to help them stay in the light! #DreamActNow https://t.co/JUZXPsOc53"]["As Congress faces a momentous decision for our DREAMers' futures, our fight for a clean #DreamActNow is a national emergency. It is our responsibility to protect the underrepresented, and harness the talents of those eager to keep America great."]["GOP’s new tax plan would leave NJ with the second highest share of taxpayers with tax increases while millionaires will pay nearly $75,000 LESS.\n\nThx @NJPolicy https://t.co/wQAdIW6DYR"]["Today our bill to protect health care for millions of children is one step closer to becoming law.\nhttps://t.co/HyWtn1lF1w"]["I want the brave DREAMers descending on Capitol Hill today to know: @SenateDems are with you &amp; won't stop fighting for the #DreamActNow. https://t.co/w7rLB8b6me"]["The day before the final DACA renewal deadline, DREAMers are on Capitol Hill sharing their stories - their American stories - w/ the representatives now charged with their livelihoods. Passing the #DreamActNow is the only option. Working every day to see that occur."]["The #Equifaxbreach was only the beginning if we don't act quickly to stop another round of fraud stemming from scam artists. Urged the FCC to answer these 5 questions and act today. https://t.co/j4mBWgULW5 https://t.co/6Fyss1xLL0"]["The Consumer Financial Protection Bureau has ensured banks who break the rules can’t use a #RipOffClause to keep their customers from suing. That’s why I’m fighting to protect @CFPB from Republican attempts to dismantle it."]["DACA renewal applications must ARRIVE by Thursday. Here is how to find out if you're eligible &amp; the next steps: https://t.co/eML8wOn8Vf https://t.co/4HTjZSJ8Kb"]["Hey @WellsFargo, if you say “customers come first” why won’t you let them seek justice for the injustice you caused them? Your #RipOffClause is unfair and we must support @CFPB effort to fight it."]["This was a sound decision. Cuba must change its behavior and uphold obligations to protect foreign diplomats https://t.co/Rn7szu1uux"]["In celebration of #HispanicHeritageMonth I invite you to RSVP to our annual celebration October 15th in Union City https://t.co/WUvzA13c1t https://t.co/fZzRutAZUu"]["The only thing more frequent than these horrifying mass shootings, is the amount of times the gun lobby blocks common-sense reform. We need everyone to speak up &amp; pressure my Republican colleagues to act."]["154,000 DACA youths qualify to have their status renewed. Make sure all your paper work + fee payment are sent ASAP! It must ARRIVE at @DHSgov by Oct 5th! That doesn’t mean mail it by the 5th, it needs to ARRIVE on the 5th. https://t.co/eML8wOn8Vf https://t.co/cUYVJFMjA5"]["154,000 DREAMers con DACA deben renovar su estatus. ¡Asegúrense que sus formularios y $ tarifa sean enviados CUANTO ANTES. Todo debe llegar a @DHSgov en/antes del 5 de octubre!  https://t.co/ynQdYELwGw https://t.co/O2uX2U9G8F"]["¡Atención!: Los formularios para renovar #DACA tienen que ser RECIBIDOS en/antes del 5 de Oct. Envíelos por correo ANTES de la fecha límite. Solo quedan 3 días más. Info aca: https://t.co/uSgjaDZ4c3 https://t.co/RGyJDWtPRP"]["Please remember: Your #DACA renewal application has to be RECEIVED by the Oct. 5th deadline, not just mailed by the deadline. It  is only 3 days away. More info: https://t.co/dPQ03RLpib"]["Republicans' hearing on a bill to make gun silencers easier to get was postponed after the last high-profile mass shooting. Will they pull the bill now? I bet they do whatever the @NRA tells them to do."]["I have worked for years to ban high-capacity gun clips and renew the assault weapons ban, yet time and time again Republicans and the gun industry block us. We must mobilize and do something to prevent more tragedies."]["Columbine. Sandy Hook. Aurora. VA Tech. Orlando. Las Vegas. You all know what I'm talking about and I haven't even said it yet. That's a uniquely American problem that I refuse to ignore."]["Waking up to a heavy heart with the horrifying news out of Las Vegas. My thoughts &amp; prayers are with all of the victims &amp; their families."]["Pres.Trump is so unfamiliar w/ what real leadership looks like, that when San Juan Mayor @CarmenYulinCruz shows it, he attacks her. Shameful https://t.co/0ZwYnA6jwR"]["Now returning from PR, \"Trump's Katrina\" comparison no longer accurate. This is worse. At least Bush never blamed &amp; attacked those suffering https://t.co/EO28NvtVq3"]["I know Puerto Rico doesn't get Electoral College votes, Mr. President, but there are real Americans there suffering. Time to do more!"]["Mr. President, I just saw this in PR. Attacking Mayor @CarmenYulinCruz isn't doing a damn thing to clean it up &amp; begin recovery. Grow up! https://t.co/VKXjOyvd1C"]["I saw this utter devastation in #PuertoRico firsthand today. The WH needs ALL HANDS ON DECK. This is breathtaking damage &amp; they need aid. https://t.co/ZNMN3QQVJX"]["Top line coordination is great but we must also find ways to support grassroots efforts of locals to clear roads and reconnect families https://t.co/MUIfu3vx5k"]["9 days after the storm &amp; this govt command center was only place with reliable service. That's prolonging suffering &amp; needs to be fixed asap https://t.co/eunUxvObiY"]["9 days after Hurricane struck and POTUS still hasn't declared 100% of PR a disaster! Well guess what, 100% is in chaos and needs help now https://t.co/KEqKvzTnnl"]["Seeing devastation in #PuertoRico, it feels like the hurricane just hit yesterday. This federal response needs to double or triple right now https://t.co/nr0YrQPrCh"]["My helicopter tour of #PuertoRico was bone-chilling. It doesn't look like the Puerto Rico so many know and love. We need much larger action https://t.co/q03A5M5tEN"]["Now in San Juan, #PuertoRico, and the devastation is already overwhelming. Angel, who works in my DC office and has family in PR, is with me and will post updates on this account when possible as we learn about how Congress can help suffering Puerto Ricans"]["@DHSgov I will be speaking to Puerto Ricans on the ground today and report back the reality of the situation."]["@DHSgov And 3 - White House blocks members of Congress from traveling to the island to assess damage &amp; fed gov. response, and now declares it a \"good news story.\""]["@DHSgov 2 - WH doesn’t declare state of emergency for the entire island, for some unknown reason"]["@DHSgov 1 - Maria devastates Puerto Rico &amp; WH doesn’t acknowledge crisis for 5 whole days, ...."]["I hope @dhsgov Sec. Elaine Duke joins me in Puerto Rico today to hear from Puerto Ricans on the ground that none of this is a \"good news story.\" On the contrary... https://t.co/Y6DLAWPPcu"]["Touched down in #PuertoRico &amp; met by PR Gov. @ricardorossello. The Gov. has so much on his plate and I'm here to see how Washington can help https://t.co/0G0g678ZX7"]["Puerto Ricans need their govt to do its job! This cld be another Katrina if we dont fully mobilize every resource at the fed govt’s disposal https://t.co/HG1b8LilqN"]["As I head to Puerto Rico, I'm frustrated the Trump Admin didn't act the instant we knew a Category 5 hurricane was going to hit the island https://t.co/ecdnsO1sps"]["Salgo hacia #PuertoRico esta noche. Necesitamos una evaluación sobre el terreno para entender cómo el Congreso puede impulsar esfuerzos de recuperación. Los puertorriqueños en la isla necesitan que su gobierno federal ayude lo antes posible.  #UnidosPorPuertoRico"]["Heading to #PuertoRico. We need on-the-ground assessment to see how Congress can jumpstart recovery efforts. Puerto Ricans suffering on the island need their Federal government to help ASAP."]["Calling on U.S. airlines to unite in our shared humanity, not profit off the suffering of victims in #PuertoRico \nhttps://t.co/6uPZynX522 https://t.co/IqZUM4fmiV"]["@CommerceGov @FCC @USCG @DeptofDefense 8. President Trump should ensure that FEMA, Coast Guard, and DOD work together effectively to restore all ports to working condition."]["7.POTUS must send assets &amp; expertise from across the fed govt to restore communications, such as @CommerceGov, @FCC, @USCG &amp; @DeptofDefense"]["6.Congress must waive local cost share requirement for FEMA public assistance disaster funding for all categories of FEMA public assistance"]["5.Send more Department of Defense assets: construction battalions to repair power and transportation infrastructure, command and control aircraft for air traffic control; helicopters for search and rescue; and 1,500 service members to provide disaster and humanitarian assistance."]["4. Use all fed resources to restore power, including sending Energy Dept experts; 500 utility employees; 100 fuel trucks; &amp; 200 generators"]["3. President Trump should request more funding to assist Puerto Rico’s Medicaid program, something I've long advocated for."]["2. President Trump should appoint a Special Assistant for Rebuilding, to coordinate the multi-faceted federal efforts for Puerto Rico"]["1.President Trump must issue a full Disaster Declaration for the entire island of Puerto Rico, which astonishingly has yet to happen."]["THREAD: The Trump Admin must do more for #PuertoRico and USVI. Here's just 8 actions my colleagues and I are asking for now https://t.co/QIaNCAnYSS"]["How will we rebuild America’s infrastructure, prepare workers for the jobs of tomorrow, or care for our seniors if Republicans give millionaires another massive tax cut? https://t.co/mojjyCNehF"]["So far it looks like Republicans' #TaxReform plan:\n1. Cuts taxes for wealthiest 1%\n2. INCREASES taxes on lowest income earners \n3. Makes middle class families pay taxes twice by eliminating the state &amp; local tax deduction\n\nSounds like reform for the 1%, not the whole country"]["White House's new tax plan is a reminder that Republicans are all for wealth redistribution - so long as it redistributes to those who are already wealthy. #TaxReform #TaxReformForSome"]["Over a dozen members of Congress say they’d join @MarcoRubio &amp; I to head to Puerto Rico to assess disaster response. Restricting us doesn’t serve millions in NJ &amp; across U.S. waiting to get a hold of their families. These are Americans who need our help. We will not back down! https://t.co/FXLFq3zDex"]["Proud to have led this letter because Congress needs to act fast in this dire crisis. Glad to have the support of @SenWarren, @CoryBooker, @SenSchumer, @SenGillibrand, @SenBobCasey, @SenBlumenthal, @SenMarkey, @SenatorDurbin, @SenDuckworth, @SenSherrodBrown https://t.co/L59LOr3ip0"]["Wkring hard w/ @SenateDems to do everything possible for #PuertoRico. See thread from @ChrisMurphyCT on some of what we shld do.  \nMy briefings w/FEMA &amp; PR officials are bone chilling. #UnidosPorPuertoRico.  We won't leave our fellow Americans behind. https://t.co/fQujY3tpcJ https://t.co/eEhc8LDFN0"]["Just got off the phone w #PuertoRico Gov @ricardorossello &amp; the situation is dire. We must act now &amp; stop this from becoming another Katrina"]["Will miss @BobCorker's keen intellect, bipartisanship &amp; zeal for diplomacy to promote American values. We need ppl like him more than ever https://t.co/8LV403yRCx"]["#PuertoRico needs targeted aid to rebuild. Urging Republican leaders to help us act today and rebuild Puerto Rico https://t.co/fQujY3tpcJ https://t.co/ZjfaoHgFEP"]["@sternkind @CoryBooker Working hard on it! Had calls with FEMA &amp; PR Governor. Today pushed for Congressional aid. Still doing more! https://t.co/7RwcRucIcQ"]["@DorisLin Working hard on it Doris! Had calls with FEMA &amp; PR Governor. Today pushed for Congressional aid. Still doing more! https://t.co/7RwcRucIcQ"]["@MLConklin @SenBooker Working hard on it Melanie! Had calls with FEMA &amp; PR Governor. Today pushed for Congressional aid. Still doing more! https://t.co/7RwcRucIcQ"]["Thank you for the geography lesson Mr. President (oceans are indeed big), but the 3.4M Americans living in Puerto Rico need help now! https://t.co/YLrkizjNX5"]["Proud to be one of many #MenForChoice who will never stop fighting for #ReproRights, no matter how many times Republicans try to thwart it https://t.co/nO6yuRNZym"]["A multicultural America is a stronger America. And the incredible diversity of our country was… https://t.co/dGAo82BYmu"]["#PuertoRico necesita fondos federales ya mismo. Urgiéndole al liderazgo Republicano que nos permita reconstruir a PR https://t.co/F7iSV8xio9 https://t.co/gUm9aZgKJU"]["My brother lives in PR. So do 3.4M Americans. Urging @SenateMajLdr &amp; @SpeakerRyan to let us give #PuertoRicoRelief https://t.co/fQujY3tpcJ https://t.co/IliEeRrXqM"]["This isn't nearly enough for the 143M ppl put at risk. I want hearings &amp; new laws. We need accountability so this doesn't happen again https://t.co/EdNkUZQm98"]["Hurricanes upended some DREAMers' lives just as #DACA may end. No reason @DHSgov can't extend #DACA renewal deadline https://t.co/z0ghRvaDE2"]["If the non-partisan CBO says a health care bill takes coverage from millions of families, it’s not really a health care bill is it? https://t.co/MPOBlcjJIG"]["While scrambling to collect $495 to pay for urgent #DACA renewal, Hurricanes rocked some DREAMers' lives.We say @DHSgov shld extend deadline https://t.co/yYngrXE3nD"]["Instead of only helping some states, how about we #KillTheBill &amp; protect EVERY state from cruel repeal plan that eviscerates Medicaid https://t.co/VH6IQ7hkRB"]["When doctors oppose a #healthcare bill because it violates the medical oath “first #DoNoHarm” it must be pretty bad https://t.co/gOuTdgbPHE https://t.co/qJoQ0FyxrC"]["Disguising their intentions with terms like \"premium tax credits\" &amp; “less than 400% of poverty level” won’t help Republicans. The Truth: https://t.co/DtGHjwXKLi"]["Absolutely! Always will! https://t.co/KSdyF3kh6I"]["Republicans say they're against higher taxes. But their #healthcare cuts could force states to increase taxes to make up for lost funds... https://t.co/Vnnk1B2BuY"]["LOS👏BORICUAS👏SON  AMERICANOS👏. Son parte de nuestras fuerzas armadas; protegen nuestro país. Es nuestra obligación ayudarlos https://t.co/pSXit2Be54"]["PUERTO👏RICANS👏ARE👏AMERICANS👏. They serve our military; they wear our uniform; they protect our country. It’s our duty to be there for them https://t.co/pSXit2Be54"]["How is the GOP going to tell 32 million working class Americans who will lose coverage under their bill that they “fixed” the ACA?"]["Republicans are trying desperately to give Pres.Trump a win, but guess what? NO ONE wins when MILLIONS lose healthcare under their bill"]["Ali's son Ethan had a rare birth defect. Republicans passing a bill saying he has a pre-existing condition &amp; must pay more wld be despicable https://t.co/11WvoZgc4V"]["Si necesitas saber cómo renovar #DACA u obtener ayuda para hacerlo,Rutgers Law en CAMDEN tiene taller d Información  https://t.co/e2Us2TF1aj"]["Need to know how to renew #DACA. or even get help doing it? Rutgers Law in CAMDEN has it all tmr. Full info here https://t.co/Gyb2KCugU3 https://t.co/lweeo1tXMt"]["Speaking to Ali and her son Ethan today at our rally to stop Republicans' healthcare repeal… https://t.co/ACkc9XgADk"]["The fight is not over. If Republicans still bring a bill to the Senate floor, I will be there to vote against it and RESIST https://t.co/lca8g7d1dY"]["Opponents of latest #Trumpcare turned out in droves today in Newark. TY @NJCitizenAction @CWADistrict1 @1199SEIU_NJ @BlueWave_NJ @PPActionNJ https://t.co/9w5ZVEzImU"]["Brave Americans like @aliranger, Mariel, and Jean sharing their stories defeated #Trumpcare last time, and I know we can do it again! https://t.co/CmMiQUhq44"]["The only way we stop #Trumpcare is if the people march, call &amp; demand it! Thx to the incredible ppl at @NJCitizenAction for leading the way! https://t.co/cC9Igs8F24"]["Si necesitas saber cómo renovar #DACA u obtener ayuda para hacerlo,Rutgers Law en CAMDEN tiene taller d Información https://t.co/e2Us2TF1aj"]["#DACA recipients eligible for renewals must do so ASAP.  Rutgers Law in CAMDEN this Saturday has free assistance. https://t.co/Gyb2KCugU3 https://t.co/qMxjv6fjch"]["TODAY join us in at Newark city hall at 11 am. Speak out against last-ditch healthcare repeal effort w @NJCitizenAction, labor &amp; faith Ldrs https://t.co/v0ERCyJp4c"]["“Per-Capita Cap” in new #Trumpcare simply means: States get billions cut from budget, YOU lose services and YOU pay higher taxes https://t.co/fetdOaxn94"]["Sec. @StevenMnuchin1: We need clarification on Trump Admin efforts to prevent possible Russian acquisition of CITGO https://t.co/KvB7fau4Pz"]["GOP's draconian cuts to healthcare will put even more at risk. How do we rebuild our roads and fund our schools with a budget cut like this? https://t.co/awS1GMtN7O"]["@theoli_co @SenBillNelson @CoryBooker Was briefed by FEMA just this morning Hector and working hard on it. Here's what we discussed: https://t.co/dVfzd4uAhI"]["Briefed this am by @FEMA Regional Administrator John Rabin on Fed response to Hurricane #MariaPR. Here's what I know https://t.co/dVfzd4uAhI https://t.co/ZUOEcKsKYg"]["11 million ppl insured by Medicaid expansion are working families. Taking their healthcare just to claim a political victory is disgraceful https://t.co/s4BvLbslCH"]["New #Trumpcare doesn't care if costs of insuring seniors, disabled &amp; children go up, states' funding is capped. That's what I call stupid https://t.co/Od947Vo0ed"]["#tbt to when \"pre-existing conditions\" were a thing &amp; sick people paid more for coverage. Republicans apparently thought that was great https://t.co/EfqiJdD5cs"]["Health experts agree: New GOP healthcare repeal bill decimates healthcare funding, risking lives! We must stop #Trumpcare 2.0 https://t.co/xCqSD8u5ZV"]["Equifax knew about security threat &amp; did nothing. We need stronger data security at ALL credit reporting bureaus  https://t.co/MlBh1lGoY1"]["It’s time for Commercial Privacy Bill of Rights. We must hold Equifax accountable for data breach of 143M consumers – incl. 4M in NJ https://t.co/UAr3OOk9t0"]["I've cointroduced FREE Act w/ @SenWarren to let Americans to freeze &amp; unfreeze credit for free after Equifax hack https://t.co/D8P3J8dQ9j https://t.co/Xe6bhFUcAr"]["I’m proud to stand w/ @njcitizenaction &amp; fight to protect NJ families from identity theft &amp; financial fraud after epic Equifax breach. https://t.co/Lc8wyRvIQG"]["Happy #RoshHashanah. I hope your new year is defined by peace and prosperity.  From my family to yours, L’Shanah Tovah."]["Jimmy Kimmel knows his own test &amp; the Cassidy bill gets a big fat “F”. Thx @jimmykimmel for pulling back the curtain on this tragic show. https://t.co/iBzLv5nc0w"]["The Kimmel test is not \"your child gets healthcare if &amp; only if your father is Jimmy Kimmel.\" Worth watching  https://t.co/iEqz3SFaAc"]["Para los Puertorriqueños lidiando con #MariaPR: Sepan que su gobierno federal está pendiente y no los olvidará https://t.co/Lw8h4e6aM1 https://t.co/CVWRMktRNc"]["ATENCION: Todas las personas en Puerto Rico deben considerar seguir estas cuentas para actualizaciones sobre #HurricaneMaria  #MariaPR https://t.co/7s7Jvb3LTZ"]["Para las personas afectadas por #MariaPR, por favor llamar al 311 o https://t.co/XLbqqafAXZ para obtener información sobre sitios de refugio https://t.co/mR6kBxxRUj"]["NHC dará una actualización en vivo a través de Periscope a las 11:15 AM AST (EDT) en inglés y español. @NWS @NOAA @NOAAComms https://t.co/6N7NbwCwGV"]["To Puerto Ricans suffering through Hurricane Maria: Your federal government won't forget you. https://t.co/7T0ggVFcKQ https://t.co/X1Cg9SpzIF"]["My thoughts and prayers go out to the residents of Puerto Rico and their families in New Jersey https://t.co/7T0ggVFcKQ"]["Say NO to the latest Senate GOP assault on your healthcare! NJ is among the states most penalized, so we must rally to #ProtectOurCare https://t.co/nIqXKhQZQ4"]["Say NO to the devastating #healthcare cuts in Republicans' latest #Trumpcare! They may have rebranded, but it's just as mean as before. https://t.co/Ab0efKj1RB"]["Working hard on it - if Congress doesn't #FixTheCliff, the effects will be devastating https://t.co/QABgs3oDEU https://t.co/6cdXsSy5rS"]["Proud to intro bipartisan legislation to extend program for home visits to at-risk pregnant women &amp; families https://t.co/brdUhUdS42 https://t.co/D0ydLvCkeC"]["Been fighting for bold reforms for yrs to reassert US leadership in fight against human trafficking. Glad we took a big step forward today https://t.co/GSJvVhtqsC"]["@stevenmnuchin1 @SenRubioPress We need to know with certainty what the Trump Administration is doing about this national security threat. We have been asking for months. https://t.co/H0bt6vDpTI"]["@stevenmnuchin1 @SenRubioPress Given Venezuela's dire situation, there are clear threats posed by possibility of Rosneft's takeover of critical U.S. energy infrastructure"]["@stevenmnuchin1 @SenRubioPress Sec. @Stevenmnuchin1 told me this would be reviewed at CFIUS back in May, but we have yet to get any official notice https://t.co/cLIJkHnElJ"]["Sec. @StevenMnuchin1: We need clarification on Trump Admin efforts to prevent possible Russian acquisition of CITGO https://t.co/gcOszTei9B https://t.co/elEUCpYMHf"]["@FCC @JohnLeguizamo Read about my efforts with @RepLujanGrisham here: https://t.co/unHmJ2o8dK"]["#Emmys were a reminder of the value of diverse programming. Asking @FCC for plan on ensuring greater Latino representation in Media https://t.co/1VMx9VdJtF"]["BREAKING @FTC must look beyond Equifax &amp; review personal data security at credit agencies @TransUnion &amp; @Experia too https://t.co/l6rWlKSA1m https://t.co/fZvTVn05TI"]["These were my #TuesdayThoughts in July. It is maddening they’re still my #TuesdayThoughts https://t.co/cEIGmsYqya"]["This is what I tweeted about the last failed #Trumpcare bill. I could literally say the exact same thing about their new attempt. #DejaVu https://t.co/elafMqRm7Z"]["🚨Red alert🚨: latest GOP healthcare repeal lets insurance co.'s charge sick ppl more! So those w/ pre-existing conditions may lose coverage"]["Happy 70th birthday @usairforce! Thank you to the women &amp; men of the best air force in the world for all you do to keep us safe. #AFBday https://t.co/ENBiFbsJTf"]["ACA helped millions of working Americans by expanding Medicaid &amp; tax credits to buy insurance. GOP wants to take it all away. #Trumpcare"]["In any tax reform debate, we should put working families &amp; the middle-class 1st https://t.co/3SDdmptHLt"]["🚨Republicans' healthcare repeal is back! They have rebranded it. But if you take a look: it's still as mean as #Trumpcare https://t.co/K20uMcyD08"]["NJ'ans always help out. Proud of NJ Air Guard from @jointbasemdl for volunteering to help #HurricaneIrma victims https://t.co/TTm9t2ot5W"]["Proud my resolution marking the start of #HispanicHeritageMonth was adopted unanimously last night by the Senate. https://t.co/XUZrpDyu9A https://t.co/5et7F9gYgA"]["Betsy DeVos may roll back anti-sexual assault rules, but rest assured that @NJ_CASA, myself &amp; other ldrs aren't backing down from this fight https://t.co/Kv4j7Ryu3y"]["Amazing community ldrs today told me how Betsy DeVos Title IX changes may hurt our fight against sexual assault. It is horrifying &amp; wrong https://t.co/oGJ1CXONnS"]["Thank you @NJ_CASA for leading our roundtable to discuss how we go forward as Betsy DeVos rolls back Obama admin anti-sexual assault rules https://t.co/TdOJDSauLm"]["@HispanicCaucus @latinomuseum @SenateDems Let's celebrate #HispanicHeritageMonth by keeping the focus on our future. Our Latino DREAMers are #HereToStay, and we will fight for them"]["Today begins #HispanicHeritageMonth. I'm proud Latino/as have given so much to U.S. culture &amp; history, and we will continue to do so! https://t.co/HrjaytQ70v"]["Today we recognize the bravery of POWs and remember those who served but haven't returned. You are not forgotten. #POWMIARecognitionDay https://t.co/SrrwQXIYrJ"]["#ProtectOurCare. New GOP healthcare repeal plan is a wolf in shoddy sheep's clothing that's easy to see thru. Just ask Republican Governors: https://t.co/7bsrk2JY69"]["This is why we need hearings before voting on a bill. Health experts agree: New GOP repeal bill decimates healthcare funding, risking lives! https://t.co/A5sHHbXbDb"]["This is why we need hearings before voting on a bill. Health experts agree: New GOP repeal bill decimates healthcare funding, risking lives! https://t.co/PoPTeT226m"]["Republicans have taken their cruel healthcare repeal bill and just rebranded it. But if you take a look: it's still as mean as #Trumpcare https://t.co/ynrO2AzKnY"]["Proud of @SenateDems #ABetterDeal on childcare. Costs have soared so much it rivals paying for college. Our solution https://t.co/fGrtc5dsYh https://t.co/qh5PVclrM7"]["Children deserve high-quality early learning &amp; care that helps them thrive without bankrupting parents. We need #ABetterDeal. #Childcare4all"]["Proud to support Child Care 4 Working Families Act to DOUBLE the number of children eligible for child care assistance #ChildCare4All"]["If we don't #ProtectDreamers w/ #DREAMAct, there's an expiration date on their livelihoods, and a start date on rolling mass deportations"]["Congrats @montclairstateu @RowanUniversity @NJIT @RutgersU @SetonHall @FollowStevens &amp; #1 Universty in US @Princeton https://t.co/nxc4slIcc3 https://t.co/g6v57gqss1"]["Non-Citizens serving our military shouldn’t be discharged due to their immigration status. They wear our uniform, they’re one of us. #NDAA https://t.co/Uj8RkjxZQX"]["I've been working for a long time on this issue because financial ruin shouldn't befall those sacrificing for our country. #NDAA https://t.co/F9iFDbh8lM"]["Military dogs &amp; their handlers play a growing role in our military, so as Senate debates Defense Authorization I say we recognize them #NDAA https://t.co/7BppHiDvBQ"]["Wrking w/ NJ’s health centers to #FixtheCliff! A 70% funding cut Sept 30th wld devastate NJ’s underinsured https://t.co/z7n8njwVR3"]["Very sad to hear of Edith Windsor's passing. She was a trailblazer for LGBTQ community. Marriage equality changed our country for the better"]["Incredibly proud to have passed legislation in the Senate to give Puerto Ricans the same investor protections those in the states get https://t.co/qrMYxjlnoB"]["NJ Democrats &amp; Republicans agree: @RutgersU's CAIT deserves $14M to be federal research center for #infrastructure https://t.co/IY52RwSu9p"]["@alfranken @SenCortezMasto Most importantly, I'm calling for congressional hearings to get to the bottom of this maddening scandal: https://t.co/R1TqwdzRjZ"]["@alfranken @SenCortezMasto And in light of this massive breach, I'll be asking for a federal review of ALL credit reporting agencies, which I think is long overdue"]["I am working w/ @alfranken &amp; @SenCortezMasto to ensure those affected will still be able to sue: https://t.co/Sb1biRFHUI"]["I am outraged that a company almost wholly unaccountable to the public could wreak so much havoc on innocent people."]["Then we learn that some top Equifax Execs sold the company’s shares just days after the incident, making $1.8M in profits!"]["This means that if every American affected paid the fee, Equifax could make more than $1B (not a typo, that’s a B)"]["And if those affected want to freeze their credit in order to protect themselves, they have to pay Equifax a $5-$10 fee"]["Equifax then tried to sneakily take away the victim’s right to sue, only to reverse that decision after severe public outrage"]["Equifax apparently wasted those 6 weeks, failing to figure out how to best help the citizens they put in danger of identity/credit theft."]["What’s jaw-dropping is that it took Equifax 6 weeks to inform the public that the breach even happened &amp; that they were at extreme risk"]["First, Equifax is one of the nation's 3 credit reporting agencies so the security breach there is a huge deal that requires immediate action"]["As I said at Bayonne Interfaith Memorial Service, our values give us strength to overcome terror &amp; show that Americans never give in to fear https://t.co/0QVsik5XHi"]["I always appreciate community on this day.  Next, heading to @CityofBayonne for their interfaith memorial service honoring victims of 9/11"]["A solemn morning in West Orange with families of those lost on 9/11. Continually inspired by their resilience &amp; resolve. #NeverForget https://t.co/LtvAknBgu7"]["And we will continue to act on our shared responsibility to do all we can so Americans may live, learn, work &amp; worship without fear"]["Today must always be a day of remembrance. We'll #NeverForget those we lost nor the unity that brought us together in the wake of such evil."]["And I remember the resilience. Jersey City, Hoboken &amp; other NJ communities became staging grounds for blood donations, fundraisers &amp; prayer"]["I remember vividly the stories of so many NJ'ans who came to my office needing help - they lost a father, a sister, a partner, a son."]["16 yrs later, as NJ'ans look across the Hudson, the absence of the twin towers is a painful reminder of all we lost on 9/11. \n#NeverForget"]["Health Centers are facing a 70% cut in federal funding on Sept. 30th unless we act. I told NJ… https://t.co/xyjtlXzvib"]["Been getting calls &amp; emails, and today NJ's Haitian clergy also told me: #TPS &amp; #DACA literally save lives. That's why I'm fighting for them https://t.co/7Log3LeL6P"]["Proud to stand w/ NJ’s health centers to #FixtheCliff! We're wrking to stop a 70% funding cut Sept 30th that wld devastate NJ’s underinsured https://t.co/EBhCN4tnz9"]["Glad to see this news. Extended family is family! Pres Trump's travel ban is discriminatory and un-American. https://t.co/eEiTmspLN6"]["Exciting news @aerofarms! Grant funding means more innovation, healthy food options in cities, and Jersey jobs! Looking fwd to cont growth https://t.co/yvYrVnLahx"]["Public health officials are essential responders after disasters or terrorist attacks, so Im proud to announce over $21M for @NJDeptofHealth https://t.co/vtXUninlUX"]["How many once-in-a-generation storms must happen before GOP wakes up to the need to address climate change? Praying for those in Irma's path"]["Rallied in Newark to protect #DREAMers. They deserve a shot at the #AmericanDream &amp; right now that means #DREAMAct https://t.co/RSNnQ2doW8"]["We refuse to let Pres.Trump treat brave young ppl as bargaining chips. We need to protect them w a clean &amp; swift DREAM Act - no poison pills https://t.co/LVE66u6qaf"]["The brave #DREAMers here today in Newark are Americans through and through. They grew up here. We need the #DREAMAct to keep them home. https://t.co/CGWmvYh99f"]["Pres. Trump has put an expiration date on DREAMers' livelihoods, and a start date on rolling mass deportations unless we pass the #DREAMAct https://t.co/JAboYHYZdT"]["Joining NJ DREAMers and community to demand clean DREAM Act! Join us at 4 pm! https://t.co/rc8RDRMUiP"]["Proud to secure this important $$ to keep NJ safe from terrorism. Esp glad $3.8M included 4 religious org protection https://t.co/zkZOdcJS4l https://t.co/mQaiGuxIZG"]["Finally BIPARTISAN hearings today on fixing our #healthcare system. #ICYMI, I wrote this on need for bipartisanship https://t.co/u4eg3HltPk"]["Ending #DACA would tear apart families and endanger lives. We must work quickly to pass the DREAM Act https://t.co/FoMjfNHZ8J"]["Dreamers like Erika &amp; Sara shld be able to work &amp; contribute to our state w/o fear of deportation. We must pass a clean DREAM Act. https://t.co/IotLbY0aik"]["I personally worked for years to convince the Obama administration to create the DACA program… https://t.co/oEgf2UBwcU"]["To #DREAMers, You will help lead this nation into a brighter, more prosperous future. United we DREAM, together we FIGHT. #DefendDACA https://t.co/U76iPYDti9"]["This brazen attack on young ppl won't go unanswered. Passing a clean DREAM Act is now a national emergency. #DefendDACA #DREAMAct #DACAWorks"]["Mr. President,\nYou went after children. You better brace yourself for the civil rights fight of our generation. #DefendDACA"]["IF REPORTS ARE TRUE, Pres Trump better prepare for the civil rights fight of his admin. A clean DREAM Act is now a Nat Emergency #DefendDACA https://t.co/YhFQJJQV6N"]["Targeting 800,000 young ppl &amp; taking their sense of security wouldn't be law &amp; order. It'd be chaos &amp; fear. Ending #DACA wld be devastating. https://t.co/PfZsZajzyI"]["While touring Bob Hagemann's Jersey City @CorgiSpirits, we spoke about need 4 Craft Beverage Modernization &amp; Tax Reform Act  #JerseyJobsTour https://t.co/nMhEtnU6s6"]["Distilleries put out many new products a year, so I was happy to help undo backlog @ Alc. Bureau &amp; speed up label approvals #JerseyJobsTour https://t.co/NMLmXe02jr"]["I thank Bob Hagemann for working to integrate @CorgiSpirits w other Hudson businesses, thereby growing our economy even more #JerseyJobsTour https://t.co/dmrsyzdmIk"]["The craft beverage industry is growing fast, but brewing spirits alone contributes more than $120B to our national economy. #JerseyJobsTour https://t.co/Mh8WJ9kD1e"]["Next stop on my #JerseyJobsTour: first &amp; only distillery in Hudson County. @CorgiSpirits is a craft distillery specializing in gin &amp; vodka https://t.co/gVjYpATaPN"]["Honored to receive Champion of Health Care Innovation Award. I'll always fight for the investment we need for medical breakthroughs https://t.co/vArNsOZt5p"]["To achieve economic security we need workers’ AND women’s rights. This #LaborDayWeekend I proudly support both. #NotWithoutRepro"]["Erika is an honors student in Union County, NJ. She's lived here since age 4. When we say #DefendDACA, we're saying defend Erika https://t.co/5mxoAjbfhX"]["Ending #DACA will treat model citizens the same as hardened criminals. We will not stand idly by, Mr President, we will #DefendDACA https://t.co/Dmsv4q9agN"]["Ending #DACA &amp; deporting ppl Pres.Trump called \"incredible kids\" &amp; Gen. Kelly called \"model citizens\" is simply wrong. #DefendDACA https://t.co/AJX1s5ftC3"]["Students in DC! There's no better way to be a part of and learn the legislative process than interning in our office https://t.co/sEox2FaYr8 https://t.co/HStnS3Ms60"]["I stood #WithDreamers &amp; community ldrs in rally 2 #DefendDACA. Ppl like Erika &amp; Sara shld be able to work &amp; contribute to our state w/o fear https://t.co/ZhVK3Jpx6m"]["Targeting 800,000 children &amp; taking their sense of security would be devastating. Ending #DACA wouldn't be law &amp; order, it'd be chaos &amp; fear https://t.co/mqVpjUaOYe"]["Rallied in NJ to #SaveDACA for ppl like Erika, an honors student in Union County who's lived here since age 4. We won't give up this fight! https://t.co/SzbYsywyBY"]["Ending #DACA would put model citizens in the same bucket as hardened criminals. We will not stand idly by, Mr President. #DefendDACA https://t.co/sG3VOBPwGt"]["Sara is a graduate of Union County College. She's lived in Hillside since age 4. When we call on @POTUS to #SaveDACA, we're saying Save Sara https://t.co/iSLopMAr79"]["Pres. Trump said he'd find a #DACA solution \"to make people proud.\" Ending #DACA to harm DREAMers would be shameful, harmful and unAmerican https://t.co/BKjhWeihxY"]["In NJ today w/ community ldrs to say DACA works! Ending #DACA wld upend communities of students, soldiers, teachers, &amp; care-givers #SaveDACA https://t.co/4fwfETh9GV"]["Join me &amp; the NJ community TODAY at 10:30AM at @NJCUniversity to stand together &amp; demand that President Trump not revoke #DACA. #DefendDACA https://t.co/03UYZXCrvR"]["Mañana nos reuniremos como comunidadpara exigirle al Pres Trump q no revoque DACA. Acompáñanos en nuestro rally a las 1030 en @NJCUniversity https://t.co/IVlZoB6xlV"]["We will stand together &amp; we will demand that President Trump not revoke #DACA. Join me and the NJ community TOMORROW 10:30AM @NJCUniversity https://t.co/bJYtLJKONz"]["Temporary Protected Status gives thousands a shot at stability, safety &amp; success. Ending #TPS would risk lives &amp; upend communities https://t.co/rBXHv3ngda"]["Mañana mitín en @NJCUniversity con la comunidad para defender #DACA (10:30am). El Pres Trump debe escucharnos y respetar a nuestros DREAMers https://t.co/nuLdRr80S6"]["TOMORROW at 1030am: NJ community, students &amp; DREAMers rally to #defendDACA @NJCUniversity. Pres Trump must hear&amp;respect our community #DACA https://t.co/KzszS4bjY1"]["28 yrs ago my good friend Rep. @RosLehtinen became the 1st Hispanic woman elected to Congress. A real trailblazer for Latinxs #OrgullosoDeTi https://t.co/n5Y1cORqpU"]["Thinking of my daughter &amp; granddaughter as we celebrate women's voting rights. Our fight for equality is far from over. #WomensEqualityDay https://t.co/jdCQtj9DY7"]["Ending DACA wouldn't make our country safer or help our immigration systm. It'd simply tear apart more families &amp; endanger lives #DefendDACA"]["We worked for years to create #DACA &amp; I refuse to let its beneficiaries be victimized in the name of nativist fear mongering. #DefendDACA"]["This WH must hear our voices &amp; protect model citizens (as Gen.Kelly calls them). Ending #DACA would be cruel, inhumane &amp; simply un-American https://t.co/5dv0dNOfkW"]["After 5 years of #DACA, I want to remind the admin: mass deportations violate everything that makes this nation great. #DefendDACA https://t.co/lJI2zeve7J"]["RT if you think ending DACA &amp; deporting ppl Pres.Trump called \"good kids\" &amp; Gen. Kelly called \"model citizens\" is simply wrong. #DefendDACA https://t.co/cBkh3fs8Sa"]["Standing with the people of Ukraine and Ukrainian-Americans today as we celebrate 26 years of independence from Soviet rule https://t.co/coszTxJmOb"]["This investment will go a long way in helping NJ's small &amp; medium manufacturers - an integral part of our economy https://t.co/EJFR64mLOk https://t.co/ApuHWEqNui"]["Navy sailor Kenneth Smith died in service to our country. We honor his sacrifice &amp; mourn the loss of a NJ hero. Prayers for him &amp; his family https://t.co/lRddb3NhMI"]["On #BlackRibbonDay we remember lives shattered by Stalinism &amp; Nazism. We must never allow these horrors again https://t.co/dSob4ATJ57"]["Especially after Charlottesville, very concerned @DHSgov is de-emphasizing domestic terrorism &amp; far-right extremism. We want answers https://t.co/QuAS55vOUK"]["Thx #GlobalCitizen advocates for your Twitter organizing. I'm proud to support full funding 4 foreign aid &amp; lead the charge against cuts https://t.co/UyQHLtoPn9"]["POTUS can't get Mexico to pay for a wall &amp; now bc Americans don't want to pay for it, he's going to shut down the government?? Unacceptable"]["✓ Mexicans won't pay for Trump's border wall \n✓ Americans shouldn't pay for Trump's border wall\n\n You could say many sides won't pay for it."]["Bringing agriculture jobs to cities, @AeroFarms hires local, uses less water, &amp; is expanding in NJ. #JerseyJobsTour https://t.co/g3VhRCnLTq"]["Proposed sleep apnea regulation doesn't kill jobs, it saves lives. New Jerseyans know that all too well. https://t.co/hPsvwlpyoQ https://t.co/ATLJqh1iSX"]["Please be safe if looking at the #SolarEclipse2017 today. Only look IF you have the NECESSARY safety glasses: https://t.co/8keaLUYL47 https://t.co/L3d0qiqsA2"]["The #USSJohnSMcCain tragedy is a frightening reminder of the risk our servicemembers take every day. Praying for our @USNavy sailors today"]["Once the famous Bell Labs building, @BellWorksNJ is bringing a new generation of innovators to NJ.  #JerseyJobsTour https://t.co/cuv3V0goMN"]["My week of National Health Center posts isn't just words. I am proud of my record of support for their vital role in healthcare #NHCW17 https://t.co/7OSuVN49mF"]["While he never should have been in the WH, I’m glad Bannon is out. But he's just one staffer &amp; we need real action to undo the damage done https://t.co/s6qHu9lu3v"]["Health insurers are increasing premiums because of uncertainty over what Trump Admin. will do. This sabotage is hurting American families https://t.co/9SpaPIU0CM"]["Superstorm Sandy victims were cheated by a system that put policyholders last. The time for #safeNFIP reform is now  https://t.co/Qx6FlfFIPU"]["Sandy victims were cheated by a system that put policyholders last. #SAFEnfip reform holds FEMA accountable by giving homeowners more rights https://t.co/aRy1GzR0HI"]["Thanks @StopFemaNow's George Kasimos for rallying w/ @FrankPallone &amp; I today in support of our bipartisan flood insurance reform, #safeNFIP https://t.co/yuaqDv6mTY"]["Not only is our flood insurance reform bill bipartisan, but we also have the support of @floodadvocate Lisa Sharrard! #safeNFIP https://t.co/LsUKqG5mLv"]["Unfairly overcharged by flood insurance? You're not alone. Our bipartisan bill would help by capping premium increases at 10%. #SAFEnfip https://t.co/MBEVHC3kzY"]["We need our #SAFEnfip to stop the exorbitant rate hikes on flood insurance that many saw after Sandy. More details: https://t.co/que1zWs6wy https://t.co/V9vN6Zdn8T"]["My heart aches for those in #Barcelona today. I am keeping the victims, their families and all affected in my prayers"]["National Health Centers serve nearly 484,000 NJ'ans. So I wont back down in my fight to ensure they're supported &amp; fairly reimbursed #NHCW17 https://t.co/vInMBRiPaU"]["Having a great time at Perth Amboy's @JRMC_news National Health Center Week Health Fair. Proud to support essential health centers. #NHCW17 https://t.co/FVZiePfsQS"]["Celebrating National Health Center Week at Perth Amboy's @JRMC_news where for 17 yrs underserved NJ'ans have been able to get care #NHCW17 https://t.co/OI1Qg10aOc"]["We must support our National Health Centers, which provide healthcare to uninsured, underinsured &amp; underserved who need it most. #NHCW17 https://t.co/hJsqP5KzxK"]["Democrats have been offering to work w/ Republicans on solutions to healthcare. Instead, R’s are purposely sabotaging the insurance mrkt https://t.co/eYYbhSCC6P"]["The President of the United States just went on TV &amp; defended ppl attending a white supremacist rally of neoNazis &amp; klansmen.\nJust sickening"]["Every day Dreamers give back to the communities &amp; country they love. #DACA simply lets them do it without fear of deportation. #DefendDACA https://t.co/CPHoCfUTJs"]["Apoyo #DREAMers que se organizaron, reunieron, y exigieron DACA. Estamos juntos en esta pelea, vamos a #DefenderDACA porque #DACAfunciona https://t.co/muhiOqS6CL"]["On the 5th anniversary of #DACA, I want to remind the admin: mass deportations violate everything that makes this nation great. #DefendDACA https://t.co/bn1cS42WQx"]["I stood with DREAMers who organized, rallied, &amp; demanded DACA. We're now in the fight of our lives, but we'll #DefendDACA because #DACAworks https://t.co/0ebVbjGcOj"]["In New Jersey, 23 health centers &amp; satellite sites in 129 communities provide NJans with preventive &amp; primary health care services. #NHCW17 https://t.co/BGCk6X4Fgy"]["Happy National Health Center Week! I have always fought for &amp; will keep defending health centers that help NJ communities every day  #NHCW17 https://t.co/sy5Jjrif2O"]["56 yrs ago y'day, the Soviets' Berlin Wall tore the world in half. It was an ineffective wall of hate &amp; it belongs in the dustbin of history"]["White supremacy has no place in #Charlotesville or in our nation. This bigotry is un-American. What IS American is standing up to bigotry"]["@MaxKingsleyEh @slpng_giants_ca Thanks for your concern Max, but actually that ad does not come from me. It's an outside group, but I can reach out to them"]["I believe we need a modern tax system &amp; can work w/ GOP on tax reform. In negotiations, I will put working families &amp; the middle-class 1st https://t.co/zKXCkqqJ4u"]["Laundry list of what House GOP wants to cut:\n\nEducation\nJob training\nScientific research\nDefense\nFood assistance\nMedicare \nMedicaid https://t.co/zUKfWgCZi4"]["Closely watching this troubling situation in a nation where the Castro regime has a history of surveillance &amp; sabotage. We must find answers https://t.co/oEyXfXVvKz"]["On #BookLoversDay, I join with @njla in supporting public humanities to promote learning &amp; community engagement. TY for these great messages https://t.co/tBuNGvM4r1"]["We must hold those responsible for a sham legislature accountable &amp; work w/ OAS &amp; regional allies to support true democracy in #Venezuela https://t.co/POWX2SCbxE"]["There are still barriers to #votingrights, and some want even more. We must #RestoreTheVRA for the sake of our democracy."]["On page 493 of the leaked climate change report, we see that more than a third of sea level rise since 1880 happened after 1990. https://t.co/c6EBAeJRJe"]["My favorite part of page 32 of the leaked climate change report: \"there are no alternative explanations.\" \nI'd add: or alternative facts. https://t.co/efxdRm8Hfw"]["I remember this milestone 8 years ago so well. Still incredibly proud to have voted for 1st Hispanic Supreme Court Justice, Sonia Sotomayor https://t.co/18lPTPRRbv"]["Scientists say a 2 degree Celsius rise would be detrimental to planet. Page 217 shows a 2.8-4.8 degree increase…that’s catastrophic https://t.co/iBNuODib2o"]["Pg 308: Climate change --&gt; more storms on East Coast --&gt; more New Jerseyans at risk. This is NOT what we need after Superstorm Sandy https://t.co/DZpyw1t2i9"]["Retweet if you think this climate change report needs to be seen. We can't let the Trump Administration ignore it. https://t.co/YcSiovyhS2"]["Proposed sleep apnea regulation doesn't kill jobs, it saves lives. New Jerseyans know that all too well.  https://t.co/iXpuvlV5kd"]["52 yrs after #VRA, there are still barriers to voting and some want even more. We must #RestoreTheVRA for the sake of our democracy."]["Fighting for New Jersey side-by-side with my favorite vegan, @CoryBooker. Happy #FriendshipDay https://t.co/JfdJL5c99x"]["If #BigOil can afford to pay their CEOs $92 million, they don't need billions in tax breaks. https://t.co/YQ07u7z5tQ https://t.co/6X7uII4xde"]["Taxpayers pay #BigOil $470 BILLION because of loopholes. Yes you read that right. I'm proposing we fix that https://t.co/YQ07u7z5tQ https://t.co/mmfmfPhTLy"]["As we explore tax reform, I hope we can discuss my bill to end handouts to highly-profitable #BigOil corporations https://t.co/YQ07u7z5tQ https://t.co/qpYKTquHsR"]["Families deserve the peace of mind to take days off to care for their loved ones, and it shouldn't cost them. We need #FamilyAct. #fmla24"]["24yrs of #FMLA helping American families - it's now time to expand to a more comprehensive #PaidLeave plan, that’s why I support #FAMILYAct"]["@SecretaryZinke: NJ reps say we must protect our coastal communities. Don't drill off the Jersey shore. Our letter: https://t.co/BJdxb2noeq https://t.co/qCcFgESXbo"]["#ICYMI FIFA must dismiss Russia as host of @FIFAWorldCup if forced labor reports are true. Ignoring them=complicity https://t.co/fECGcQN8e7 https://t.co/nUhdLJ3pcY"]["Once again, @WellsFargo wagon rolls over its customers. This time: auto insurance scam. We're demanding answers! \nhttps://t.co/VxNOMQScLg https://t.co/i9we1Qqt8J"]["Has GOP learned nothing? We need bipartisan, practical solutions to solve challenges. RAISE Act is partisan, extremist &amp; hurts our economy https://t.co/I6fBzCST3E"]["@FIFAWorldCup @SenBlumenthal @SenMarkey @SenSherrodBrown @amyklobuchar @SenCoryGardner Read about our bipartisan effort here: https://t.co/fECGcR4JCH"]["Calling on FIFA to dismiss Russia as @FIFAWorldCup host if they used forced labor. If FIFA ignores these abuses, they are complicit in them https://t.co/cdjqBDrsQU"]["I believe we need a modern tax system &amp; can work w/ GOP on tax reform. In negotiations, I will put working families &amp; the middle-class 1st https://t.co/oAQVkrdXD9"]["If @StateDept is truly being remade to abandon democracy promotion, you can bet I'll be putting up one hell of a fight every step of the way"]["Democracies are less likely to go to war w/ each other so how can State Dept \"shape a safer, more prosperous world” w/o promoting democracy?"]["Pulling back our support of democracies around the globe is exactly how you create more Venezuelas. More Cubas. More Irans. More conflict."]["This would be a dangerous abdication of U.S leadership, making our world less safe by destabilizing global security https://t.co/68AIKs8X3m"]["Having met w/ Air Mobility Command leadership for years, and written to the Air Force Secretary… https://t.co/8ZqLudU5Ua"]["My bipartisan flood insurance program reforms put policyholders 1st, provide unprecedented $$ for mitigation, resiliency &amp; voluntary buyouts https://t.co/UwTrn7FKji"]["A ruthless dictator punishing his own ppl. My heart breaks for the Lopez &amp; Ledezma families. #Venezuela needs int'l help NOW. #SOSVenezuela https://t.co/rzrYGQwJv9"]["Happy to support our servicemembers at @jointbasemdl to secure and expand missions, esp. getting new KC-46 air refueling tankers. https://t.co/L2ByjXUAn2"]["Having met w/ AMC ldrship, written to AF Secretary &amp; proved @jointbasemdl shld have nxt gen. refueling tankers- today we celebrated victory! https://t.co/KPz2HDBrlD"]["#BlackWomensEqualPay is 1 reason I’ve called on Fortune 100 companies to increase women of color representation in C-Suites &amp; Exec Boards https://t.co/Xbpb75UJsv"]["New @Stockton_edu campus may completely change Atlantic City- draws ppl 2 city, new customer base, trains skilled workforce #JerseyJobsTour https://t.co/D0szCMIJoL"][".@Stockton_edu new campus is right on AC boardwalk. Yes, that's fun for students but also new customers for local businesses #JerseyJobsTour https://t.co/g7myY7Cr6k"]["Spking w/ @Stockton_edu prez Harvey Kesselman about the need to diversify Atlantic City economy beyond casino industry. #JerseyJobsTour https://t.co/CLOFTj7FWw"]["Next #JerseyJobsTour stop is site of @Stockton_edu’s new campus. Speaking with President Kesselman about what it will bring to Atlantic City https://t.co/uJZIU9U4Lm"]["There are consequences to violently undermining democracy &amp; attacking peaceful protesters. Ppl of Venezuela: the U.S. stands with you https://t.co/4MQ1TIOFRs"]["Con la falsa elección constituyente, Maduro agarra control d cada rama del gobierno.El pueblo venezolano necesita de la comunidad internacnl https://t.co/XbYm1PfGtf"]["Again, Venezuelan ppl have shown bravery &amp; resolve. Again their Dictator has shown no remorse. His violent subversion of Democracy must end"]["Maduro's sham election gives him full control of every branch of gov't. W/ Venezuelans powerless, intn'l community must step in with action https://t.co/ISPn7ah7Qo"]