["122 more #Dreamers will lose their #DACA protection today, in addition to the more than 15,000 young people who've already lost theirs since this #FailingPresident's heartless decision to rescind it. The clock is ticking and too many lives are hanging in the balance #DreamActNow"]["So appalling. Immigrants helped build this country and are, in fact, what makes it great. We need to pass the SECURE Act to protect #TPS https://t.co/IPBw7PzhoY"]["Delighted to meet with social work professors and one of their brilliant young students from my Alma mater, @unevadareno, today! Social work is one of the toughest, but most important lines of work out there. https://t.co/l5Z0v30FzJ"]["Totally cruel. The majority on #Medicaid who don't work are ill, disabled, going to school, or caring for family. Yet another decision by our #FailingPresident based on no facts or expertise, just prejudices against lower-income Americans. https://t.co/Qgny4iKElz"]["On #HumanTraffickingAwarenessDay my DC, Las Vegas, &amp; Reno offices wear blue in solidarity with the victims of human trafficking. But we need to do more than this symbolic gesture - Congress must pass the #SESTA Act to ensure victims receive the justice they deserve #WearBlueDayNV https://t.co/7r9SEXDzYf"]["Over 100 CEOs agree: @realDonaldTrump's decision to rescind #DACA has created an impending crisis in our nation's workforce. #Dreamers contribute to our communities and our economy. #DreamActNow\n\nhttps://t.co/WJr31CLZIn"]["Any infrastructure plan of @realDonaldTrump @SecElaineChao should have bipartisan solutions. My &amp; @SenatorBurr's bipartisan #SmartCities bill should be included. This bill would update inefficient transpo systems to help better connect our communities. \nhttps://t.co/NeYkOLYoM3"]["On #HumanTraffickingAwarenessDay, I reaffirm my commitment in fighting to ensure the victims of this heinous crime have the resources and tools they need to regain their voice and get their life back. Part of that commitment is fighting to ensure Congress passes the #SESTA Act."]["#SESTA Act, which I'm a co-sponsor of, would give state law enforcement officials the power to take action against individuals or businesses that violate federal sex trafficking laws. Congress must pass this bill to help ensure justice for victims. #HumanTraffickingAwarenessDay"]["RT if you stand with #Dreamers and want the GOP to stop the cruel games &amp; pass the #DreamActNow."]["#Dreamers are our nation’s veterans, teachers, engineers, business owners &amp; future leaders. Why we wouldn't we want them in our country's future? Deporting them robs our communities of their contributions &amp; betrays America’s immigrant heritage. @SenateGOP pass the #DreamActNow"]["Ending #TPS for Salvadorans in America is devastating for businesses &amp; state economies. From the @USChamber &amp; @NAHBhome, industry leaders agree we need these hardworking contributors. Congress must act &amp; pass legislation to #SaveTPS"][".@realDonaldTrump just ended #TPS for Salvadorans in America, marking the fourth termination of TPS in four months. This is an attack on families and essential workers who love and contribute to our communities. Congress must step up and step in to protect them. #SaveTPS"]["Glad @USDOT is in Las Vegas discussing innovation in transportation, including Smart Communities and drones, two legislative priorities of mine. I appreciated talking to @SecElaineChao just this week about how we can work together to advance these important technologies #CES2018 https://t.co/Kxyo0Qeckf"][".@LVCVA expansion project will be a boon to Las Vegas' economy, create jobs, &amp; help keep Las Vegas as the top trade show destination in the world - right where it belongs. My father would be proud. Eager to see this come to life. https://t.co/sZLHJNgGpC"][".@AjitPaiFCC's #NetNeutrality decision destroys the principle of a truly #FreeandOpenInternet. @SenMarkey's CRA, which I've co-sponsored, is crucial to overturning this reckless decision made w/out adequate consumer protections for all who depend on access to quality broadband."]["As of today, 15,315 #DACA recipients are at risk of facing deportation. We cannot turn our backs on #Dreamers. We must embrace them. They are living examples of what America stands for as a nation built through the sweat &amp; hard work of generations of immigrants. #DreamActNow https://t.co/vvJmhPp3Lk"]["On #LawEnforcementAppreciationDay, I'd like to thank every police officer in Nevada - and throughout the country - for all the sacrifices they make every day to protect us and keep us out of harm's way. We are grateful to you for your brave service. https://t.co/7sXxxJsErh"][".@realDonaldTrump's decision to revoke TPS for El Salvadorans means thousands of TPS holders in NV are at risk of deportation. It's also another poignant reminder that we have an anti-immigrant POTUS who turns his back on hardworking families and governs by fear &amp; intimidation. https://t.co/1ZSbkoLhAx"]["100 days ago the GOP let #CHIP &amp; community health centers funding expire. Refusing to fund these programs, allowing state governments to go bankrupt, forcing community health centers to shut their doors &amp; go out of business - this isn't what the American people sent us here to do https://t.co/zHxL0LQIcN"]["Authorities still looking for suspect that vandalized @OurCenterReno. \nPlease contact @RenoPolice w/ any information. Discrimination &amp; acts of violence is reprehensible. I stand with @OurCenterReno &amp; the LGBTQA community. https://t.co/DHMhNjfvXb"][".@AjitPaiFCC action to rescind #NetNeutrality rules ends a truly free and open internet as we know it. We must fight. I’m proud to stand for Nevadan’s access to quality broadband, it’s a necessity. That's why I’m co-sponsoring @SenMarkey's CRA that stops Pai's reckless action."]["My appreciation for giving back came from my parents &amp; grandparents. They were hard workers, but they never forgot their roots. You don't forget that when you succeed, others helped you get there, &amp; so you help others as well. \n\nMore reflections from my first year in Congress --&gt; https://t.co/hjchux6uGC"][".@realDonaldTrump's decision to revoke #TPS for over 250,000 Salvadorans will not only tear families apart, deportation could expose thousands of them to potentially dangerous and life-threatening situations. We must pass the SECURE Act to provide a path to citizenship. https://t.co/emkzm6ioCr"]["Since @realDonaldTrump's heartless decision to rescind #DACA, 15,193 young people have lost their protection. These #Dreamers are now facing deportation &amp; being torn from their families. Their lives are hanging in the balance b/c of GOP inaction. It cannot continue. #DreamActNow https://t.co/IR8fLWIVWA"]["As of today, 14,829 #DACA recipients have lost their protection - putting them at risk of deportation, and being torn apart from their families &amp; the country they call home. \n\nCongressional failure to act is cruel &amp; unacceptable. The GOP must step up &amp; pass the #DreamActNow. https://t.co/ztn140iDQa"]["The Senate has a laundry list of issues to address before the government’s short-term funding expires in 2 weeks. We must work to pass the Dream Act, reauthorize CHIP, &amp; stabilize our healthcare system. With your help, we can get this done. Speak out &amp; call your representatives!"]["122 more Dreamers lost their DACA today, in addition to the more than 14,000 who already lost DACA since September. Time’s running out for these young men and women. Congress must pass the #DreamActNow."]["Nevada’s marijuana industry is a boon to our economy: it supports nearly 300 small businesses and currently employs more than 6,700 Nevadans. AG Sessions’ decision to ignore states’ rights will create uncertainty and could cost Nevada millions in economic revenue."]["Nevada voters made it clear that the state should be able to enforce its marijuana laws without federal interference. We must respect the will of states while ensuring prosecutorial resources are used effectively."]["AG Sessions says he’s an advocate for states’ rights. His decision today exposes his hypocrisy. By rescinding the Cole memo, this administration is trampling on the will of Nevadans and creating unnecessary confusion for our state. https://t.co/csAlwYjXCk"]["Three former DHS Secretary’s agree, Congress must pass the Dream Act now. Let’s protect these young people who know no other home but the United States. They’re our teachers, service members, and friends. They\nbelong here. #DreamActNow https://t.co/qFgMz4JXI4"]["Congratulations &amp; welcome to our newest colleagues, Sen. Doug Jones &amp; @SenTinaSmith. Eager to work w/them to help working families get ahead https://t.co/9XrLfXNEJB"]["Wishing all a fun and safe New Year's Eve celebration tonight! Here's to a happy and healthful 2018!"]["On the first day of the holiday, wishing all those that are celebrating this week a very Happy Kwanzaa!"]["Wishing the happiest of holiday to all from myself, Paul, and our big family! Grateful for their amazing support &amp; Italian cookies for days. https://t.co/qQWyrqI0Rw"]["My vote on the CR tonight was a vote for Nevada’s priorities. And I will not stop fighting until we pass the #DreamAct and pass government funding legislation that prioritizes the long-term needs of Americans. My full statement --&gt;https://t.co/1QmZHu9TNA"]["As of today, 13,006 #DACA recipients have lost their protection - and now living in fear of deportation and being torn apart from their families. This is a crisis happening right now.\n\nThe GOP must step up to protect #Dreamers, who make our communities stronger. #DreamActNow https://t.co/EDgxSNvFRI"]["My office has received 1,085 calls &amp; 15,271 letters on the #GOPTaxScam. @SenateGOP @HouseGOP if you're curious where Nevadans stand on your bill for the top 1% &amp; big corporations - the numbers speak for themselves:\n \n9.6% in favor\n90.4% are OPPOSED\n \nNo doubt. This bill is a scam"]["11 Republican and Democratic governors deliver a strong message to Congress: A bipartisan solution is needed urgently to protect #DACA recipients - who are losing their protection everyday - from deportation &amp; being torn from their families. #DreamActNow https://t.co/v8ZemGHdPt"]["In the early hours of the morning, @SenateGOP gave a giant tax cut to big corporations - like the #BigBanks &amp; #BigOil - &amp; the top 1%, ignoring decades of their own fiscal responsibility gospel. Our kids will be paying for this $1.5 trillion corporate giveaway for decades to come. https://t.co/4cW0hn5D6I"]["Angela, from Las Vegas, is a #DACA recipient who is now at risk of deportation and being torn apart from her family if the GOP fails to pass #DreamActNow. We cannot continue to leave 800,000 #Dreamers' lives hanging in the balance b/c of Congressional inaction. #AmericanDreamer https://t.co/jvgoxOrpmA"]["Congratulations, @unlv Class of 2017! You should be very proud. https://t.co/CTMBQOqq1L"]["#Dreamers contribute to our communities &amp; make them stronger. Blue jeans, hamburgers, ketchup, YouTube, Google, Apple. These are iconic American inventions, and they were all created, in whole or in part, by immigrants. @SenateMajLdr pass the #DreamActNow https://t.co/m6QL0oxNu9"]["Excellent news. Congratulations, @ladygaga. Welcome to Las Vegas! #LasVegasGoesGaga https://t.co/t3L3j2Fn1U"]["As of today, 12,762 #DACA recipients have lost their protection - and now at risk of being deported, torn away from their families and the only home they've ever known. \n\nEvery day the GOP refuses to bring up the #DreamActNow, 122 more #Dreamers' lives hang in the balance. https://t.co/TL0pmeCY5F"]["800,000 #Dreamers don’t want special treatment. They want the chance to continue contributing to our communities without the fear of deportation, and being torn apart from their families, looming over their heads.\n\nThe GOP must take up &amp; pass the #DreamActNow #AmericanDreamer"]["As of today, 12,641 #Dreamers have lost their protection, and now at risk of deportation and being torn apart from their families. Time is running out. We need to give these young people the peace of mind they deserve, especially during the holidays. We must pass the #DreamActNow https://t.co/yYl8WSIa07"]["Heartbroken over this news. Thank you to all of the first responders on the scene working to get folks to safety. My thoughts and prayers are with the victims and the families of all of those affected by this tragic accident. https://t.co/3ZKNSIanok"]["Over 12,000 #Dreamers have lost their #DACA protections since @realDonaldTrump's heartless decision to rescind it. \n\nThis is a watershed moment. People will ask, where were you when Dreamers lives were hanging in the balance? It's time we pass the #DreamActNow #AmericanDreamer"]["Astrid, from Las Vegas, is one of the 12,000 #Dreamers in NV that makes our communities stronger. We must protect Dreamers like her, keep families together, and give them the peace of mind they've earned. It's past time the GOP bring up and pass the #DreamActNow. #AmericanDreamer https://t.co/oFtH5o5NXN"]["TODAY IN RENO:\n\n@NVHealthLink is hosting a Holiday Health Fair for the last day of open enrollment today from Noon-8pm at the Reno-Sparks Convention Center. Nevadans who need in-person assistance signing-up for healthcare, please stop by. They're there to help! #GetCoveredNow https://t.co/p58aho2HbB"]["TODAY IN LAS VEGAS: \n\n@NVHealthLink is hosting a Holiday Health Fair for the last day of open enrollment today from Noon-8pm at St. Rose Dominican Hospital. Nevadans who need in-person assistance signing-up for healthcare, please stop by. They're there to help! #GetCoveredNow https://t.co/y4TqvML3VE"]["TOMORROW: Don't forget to #GetCovered, Nevada! Tomorrow is the LAST day to sign-up for healthcare, compare health insurance plans, or change your coverage. \n\nFor all Nevadans, @NVHealthLink is there to help you sign-up for quality, affordable healthcare --&gt;https://t.co/bpXlUzDe0m https://t.co/1AINsNrcA6"]["@ChrisMurphyCT @JohnCornyn @SenFeinstein We cannot ignore the lives of those murdered or wounded at #SandyHook, #1October and every other mass shooting. We must get something done in honor of the loved ones who are still with us. Congress must work together to reduce gun violence across this country. #HonorWithAction"]["@ChrisMurphyCT @JohnCornyn I'm also a co-sponsor of @SenFeinstein's bill to ban bump stocks, a device that turns a semi-automatic rifle into an even deadlier weapon to kill as many people as possible. These devices do not belong in our communities. We must pass this bill to reduce gun violence &amp; save lives"]["@ChrisMurphyCT That is why I'm a proud co-sponsor of @ChrisMurphyCT @JohnCornyn's bipartisan bill to fix inefficiencies in the national background check system, so that violent criminals and domestic abusers will not be able to purchase a gun from registered dealers. #HonorWithAction"][".@ChrisMurphyCT has said the issue of gun violence found him after the massacre at #SandyHook. I am devastated to say the issue of gun violence has found me, too, after #1October. Like him, I'm making it my mission to prevent tragedies like these from ever happening again."]["The right to own a gun must be balanced by the right of every American to be able to go out in public without fearing they’ll be shot and killed at Church. Or in a movie theatre. Or in a classroom. Or at a night club. Or on a baseball field. Or at a concert."]["Today marks five years since 20 children &amp; six educators were murdered in a senseless act of gun violence at #SandyHook. The epidemic of gun violence has touched all corners of America, including my hometown of Las Vegas. It's past time we pass common-sense gun laws to save lives"]["Thank you, @UCIPRTeam, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/hbhLwBwEau"]["Thank you, @TransEquality, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/YT0YrFuQte"]["Thank you, @NevadaState, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/7f31mbgRht"]["Thank you, @girls_inc, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/sqvyWCdU7Z"]["Thank you, @LasVegasSun, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/KNffJc7uqN"]["Thank you, @unevadareno, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/9VPh5uu12f"]["Thank you, @SenatorCardin, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/Y6iXhcrsbl"]["Thank you, @SenatorHeitkamp, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/echGd44oWP"]["If Congress doesn't pass the #DreamActNow, 800,000 #Dreamers in our communities are going to see their lives fall apart. This is a humanitarian crisis. Today, I blacked out my site all day with just the words: \"I Stand With DREAMERS,\" to show we recognize you &amp; will keep fighting https://t.co/oTJa2ZgzLn"]["Thank you, Leader @NancyPelosi, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/gBodHUaZoV"]["Thank you, @LCVoters, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/buKjgknA7g"]["Thank you, @SenBlumenthal, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/rFCTuDXnEo"]["Thank you, @SenWhitehouse, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/3KMy7TCOy9"]["Thank you, @SenWarren, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/zgYYzzRWfq"]["Thank you, @ChrisMurphyCT, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/sUQCqYIZUV"]["Thank you, @SenDuckworth, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/AeJqhmZ8yK"]["Thank you, @SenBennetCO, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/Yr03d7UNDg"]["Thank you, @SenKamalaHarris, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/BnK12P3t70"]["Thank you, @CHIRLA, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/C8ZHPZUTcD"]["Thank you, @SenateDems, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/paCcWJ6smB"]["Thank you, @SenSchumer, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/ICbUHUJhBt"]["Thank you, @RonWyden, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/snIKXuHB41"]["Thank you, @lyft, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/hTyYy7460t"]["Thank you, @MartinHeinrich, for standing in solidarity with #Dreamers. \n\nIt's past time the GOP join Democrats and pass the #DreamActNow before the end of the year. We must keep families together and give 800,000 Dreamers the peace of mind they have earned. https://t.co/mT7mG4UaBC"]["Thank you, @SenatorMenendez for being a leader in this fight and standing in solidarity with #Dreamers . You're right, time is not on our side. The GOP must step up to do the right thing and pass the #DreamActNow #AmericanDreamer https://t.co/mVDilv7PId"]["Astrid from Las Vegas is one of the over 13,000 #Dreamers who has benefited greatly from #DACA. Astrid is the perfect example of the many contributions #Dreamers make to our communities across this country. #DreamActNow #AmericanDreamer https://t.co/lQxV9tO6IM"]["More than 12,000 #Dreamers have lost their #DACA protection &amp; are now at risk of deportation. This is a humanitarian crisis, not just for these families, but for our country. If you go to my website, this is what you'll see all day. It's past time for the GOP to pass #DreamActNow https://t.co/jiKos5VVRh"]["Last night, Alabama elected @GDouglasJones to the Senate. Today, the House and Senate conferees will meet for their ONE public hearing on the #GOPTaxScam. Alabamians made their voices heard loud &amp; clear last night. @SenateMajLdr, we must wait for that vote to join us in Senate."]["To all those celebrating the eight-day Jewish festival of lights, I wish you a #HappyHanukkah"]["@amprog It’s time to recognize that #Dreamers are Americans. That their stories are no different from any of ours. That by taking away their protections, by allowing them to return to the shadows, we are allowing a vicious cycle to grind 800,000 dreams into the dust. #DreamActNow"]["@amprog My mom &amp; dad worked all their lives so that my sister and I could become the first in our family to earn a college degree. My family taught me that when someone opens a door for you, you hold it open for the next person coming along after. That's why I'm here. #DreamActNow"]["@amprog Dreamers’ stories are no different from my own. My grandfather was born in Chihuahua, Mexico. He crossed the Rio Grande to come to this country. He served in our military, became a citizen, married my grandmother, and raised a family. #DreamActNow"]["@amprog The Dream Act is an investment in our future. Republicans in Congress are looking for a way to reduce the federal deficit. Well, I have a solution for you. Passing the Dream Act would decrease the federal deficit by $2.2 billion over ten years.  #DreamActNow"]["@amprog We are a nation of immigrants. But we are caught in a vicious cycle. We look to our ancestors for inspiration. We benefit from the contributions of immigrants. But every generation, we default to the arrogance of power, and treat immigrants as scapegoats, and shut them out."]["@amprog The 800,000 #Dreamers in this country don’t want special treatment. They want the chance to live their lives and do all of those things, without the fear of deportation looming over their heads. #DreamActNow"]["@amprog When are we going to acknowledge what basic economics, history, and scientific research have all proven to be true—that immigrants make our economy stronger? That immigrants come to our country &amp; start businesses, create jobs, and invent technologies that change our world?"]["@amprog Blue jeans, hamburgers, ketchup, YouTube, Google, Apple. Even America’s best idea—our national parks. These are iconic American inventions, and yet they were all created, in whole or in part, by immigrants. #DreamActNow"]["@amprog Immigrants are a fundamental part of our communities. They always have been. They have built our railroads, our cities, and our highways. They have founded businesses, invented groundbreaking technologies, and discovered lifesaving cures."]["@amprog We cannot turn our backs on #Dreamers. We must embrace them. They are living examples of what America stands for as a nation built through the sweat and hard work of generations of immigrants. #DreamActNow"]["@amprog What is Congress missing? Why are some members of this body unable to see all of the contributions #Dreamers make? Pass the #DreamActNow"]["@amprog Over 800 business leaders from companies like Airbnb, Amazon, Facebook, Google, Lyft, and Microsoft, have signed a letter to Congress, urging legislators to pass the #DreamActNow."][".@amprog estimates that our GDP will shrink by $460.3 billion over the next decade."]["Since this Administration ended #DACA , more than 11,000 DACA recipients have lost their status - that's 122 every day. If we fail to pass legislation to protect Dreamers, 800,000 kids will be forced to watch their lives fall apart. #DreamActNow"]["LIVE SOON: Headed to the #Senate floor momentarily to call on the GOP to step up, do the right thing, and pass the #DreamActNow. We must give the over 800,000 #Dreamers the peace of mind they've earned - especially during the holiday season.\n\nWATCH LIVE --&gt;https://t.co/J85JS3Efzz"]["Each #Dreamer that loses their #DACA protection risks losing their home, their job, their family, and their country.\n\nEach day that Congress doesn't act, this number will continue to grow. Time is running out. It's time to pass the #DreamActNow. https://t.co/5lqZRGeQM6"]["Blanca is an #AmericanDreamer who came to this country from Mexico when she was just seven months old. Blanca is one of the over 13,000 Nevada Dreamers at risk of deportation, being ripped apart from her family. Blanca deserves peace of mind she will be protected. #DreamActNow https://t.co/5fXJBp5cpX"][".@realDonaldTrump's decision to rescind #DACA was not based on sound economic policy. DACA is a crisis for businesses across America. If #Dreamers lose their jobs, employers will incur nearly $3.4 billion in turnover costs. #DreamActNow #AmericanDREAMer"]["From fighting to repeal \"Don't Ask, Don't Tell\", to ensuring healthcare for 9/11 first responders, &amp; helping to implement campus sexual assault reforms - @SenGillibrand is a leader, whose voice is needed. \n\nThe only lightweight here is this #failing President, @realDonaldTrump. https://t.co/TlYC05ud2u"]["Trump’s decision to deport #DREAMers is not guided by sound policy, but by xenophobia &amp; myths. Deporting them robs our communities of their contributions and betrays America’s immigrant heritage. We must put partisanship aside and pass the #DreamActNow before the end of the year."]["Dreamers are our nation’s teachers, engineers, leaders, business owners, future leaders and so much more; they are our neighbors and our friends. We must protect them from deportation by passing the #DreamActNow #AmericanDREAMer"]["Incredibly excited about @Switch initiative that will be the first renewable project built on a @blmnv Solar Energy Zone. The energy produced will contribute to their goal of 100% renewable energy, power up to 46,000 homes, and create 1,300 jobs. https://t.co/WZfBznIfTZ"]["I had the best time on Saturday in Reno joining first responders &amp; volunteers distributing toys at the annual @ElSoldeNevada Toy Drive. The holiday season reminds us of the importance of giving, especially to children &amp; families in our communities who may need a helping hand. https://t.co/9G38Nq1W97"]["Maria from Reno, NV, is one of over 13,000 brilliant, hardworking #Dreamers who calls Nevada home. Dreamers like Maria is what helps make our communities stronger. \n\nCongress must pass #DreamActNow and protect people like Maria from being deported from her home. #AmericanDREAMer https://t.co/eBnhMvG3W1"]["Aaron is one of over 13,000 Nevada #Dreamers who is at risk of deportation because of @realDonaldTrump's heartless decision to rescind #DACA. Congress must pass the #DreamActNow to keep families together. #AmericanDreamer https://t.co/i7WYYsDvxq"]["#Dreamers live in our communities, go to our churches, shop in our grocery stores, attend our schools, are our neighbors and our friends. Why would we make them live a dual life? Why would we treat them differently? Why would we kick them out of their homes? #DreamActNow"]["Since @realDonaldTrump ended #DACA, more than 11,000 DACA recipients have lost their status. 122 more #Dreamers each day are losing their protections. We must pass the #DreamActNow to protect them &amp; keep their families together. #AmericanDreamer"]["Great addressing @unevadareno Engineering, Journalism, Liberal Arts, Medicine, Graduate School, and Division of Health Science #Classof2017 https://t.co/kkNh7pmscK"]["Delighted to join #Classof2017 @unevadareno Student Ambassadors for lunch today. Inspiring group of young people. Your futures are bright! https://t.co/kh86ghmrKO"]["Honored to deliver the commencement speech to the #Classof2017 of @unevadareno this morning. Congratulations to the graduates! #PackPride https://t.co/SMxnoTrjRC"]["Best of luck today to Nevada's Ethan Palelei playing for @WestPoint_USMA &amp; Jarvis Polu playing for @NavalAcademy at #ArmyNavyGame!"]["In the #GOPTaxScam, tax giveaways for big corporations like Big Oil &amp; the Big Banks &gt; health coverage for 13 million Americans and affordable premiums. https://t.co/Hm9CKn2KeP"]["The Senate GOP and House GOP don’t always agree, but when it came to the #GOPTaxScam, both prioritized cutting taxes for big corporations. https://t.co/YwDgoBi3jb"]["Time is running out, Nevada! Only one week left during open enrollment. You can't afford to not be insured. Don't wait for an accident to happen for you to #GetCovered. \n\nFind out what insurance plans you qualify for today. @NVHealthLink is here to help: https://t.co/Qg0bfcDWOj https://t.co/uPg4qrBZiy"]["Today, on #PearlHarbor Remembrance Day, we honor and thank all of the courageous men and women who fought for our freedoms that day. We also remember the brave nurses who stepped up and responded with bravery. #HonorThem Cc: @USNavy @USMC @USArmy @USCG @usairforce https://t.co/T7YQi3DtaE"]["Last night, #DREAMers &amp; advocates rallied to demand Congress pass #DreamActNow. Trump's heartless decision to rescind #DACA has unleashed fear in the hearts of 800,000 #Dreamers, who are at risk of deportation &amp; being ripped away from their families. It is past time, we must act https://t.co/5ROUBnDkYJ"]["Recently, @SenateBanking marked up #DoddFrankRollback. I offered six amendments, including one to ensure consumers get their day in court &amp; a measure ensuring housing payment protections for seniors. All six were rejected. We cannot let the #BigBanks win. @CFPB must remain strong https://t.co/sZw0uTNorm"]["My time working with survivors has shown me that the epidemic of sexual harassment and sexual assault is bigger than one Senator and that the culture of the United States Congress must change. https://t.co/2ArwHKtPx6"]["Yesterday, I testified before @senjudiciary on #1October. I was joined by a hero named Heather, a Las Vegas massacre survivor, who recalled her \"own night of terror.\" It's clear: #1October victims &amp; all Americans need action now to help reduce gun violence https://t.co/0jxiGnVw1d"][".@realDonaldTrump's decision undermines long-standing U.S. policy that the final status of Jerusalem should be decided as a part of a broader peace agreement between the Israeli and Palestinian people and their governments. https://t.co/IIhnB4pm9B"]["On National Miners Day, I honor the contributions and sacrifices made by miners across the US, especially the nearly 30,000 miners in NV."]["Thank you, @ChrisCoons. Proud to work alongside you to help fight for common-sense gun violence prevention measures. https://t.co/PzPVVmAC8h"]["@senjudiciary The mass shooting on #1October was made more lethal b/c of #bumpstocks. I'm a proud cosponsor of @SenFeinstein's bill to ban these devices that don't belong in our communities. We cannot - and should not - wait to do so through a lengthy rule-making process. We need action now. https://t.co/XbGzv5Nm3o"]["On #1October, my hometown of Las Vegas became the site of the worst mass shooting in modern history. Today, I testified in front of @senjudiciary to outline the common-sense steps we can take to help stop senseless massacres like this from ever happening again. https://t.co/Z2uKKXyTTP"]["Sexual harassment in any context is unacceptable. I'm disappointed &amp; disgusted with the allegations concerning @SenFranken, and he should be held accountable. \n\nMore on my statement on sexual harassment and needed meaningful reforms of the Ethics process: https://t.co/tU4j4p5alv"]["@CFPB We all know that access to justice is essential. You don’t have to be an attorney to know that you should have the right – &amp; choice – to a court. If we want to help provide consumer relief, we wouldn’t take away a consumer's choice to have their day in court. #DoddFrankRollback https://t.co/OVK2hoEEJA"]["@CFPB Today, in the Banking Committee, I offered an amendment to reinstate prohibition of @CFPB's #RipoffClause. Every consumer deserves to have their day in court &amp; sue bad actors. If we're about protecting consumers, GOP wouldn't have voted down my amendment. #DoddFrankRollback https://t.co/180HC5uZoS"]["@CFPB Credit unions &amp; community banks in NV got no relief after the housing crisis. We should do right by our small community banks, but I have heartburn over rolling back oversight of the #BigBanks. They're the ones that caused the crisis to begin with in Nevada. #DoddFrankRollback https://t.co/utPlM8Dtvi"]["NV was one of the hardest hit states during the housing crisis. As AG, my biggest frustration then was that the federal government wasn't conducting oversight or regulating #BigBanks. @CFPB's now the watchdog that keeps them accountable. We cannot roll back the oversight on them. https://t.co/VTYbjVQSDk"][".@ATFHQ says they'll conduct a rule-making process on bump stocks. This lengthy regulatory process could take years. We cannot afford to wait while bump stocks remain legal in our communities. Congress should act now to prevent another #1October shooting &amp; ban bump stocks today. https://t.co/CTV2drr2Qm"]["#DoddFrankRollback weakens stress tests for all large banks – banks that together took $239B in taxpayer bailouts last time around. We cannot afford to gamble another nearly $240B of hardworking Americans' tax dollars on this bill."]["Who's helped by #DoddFrankRollback?\n-Big Banks.\n\nWho's NOT helped by #DoddFrankRollback?\n-Americans burdened with student loan debt. \n-Homeowners who are still underwater. \n-Workers who haven't had a raise in years."]["Community banks provide critical services to customers, homeowners &amp; #smallbiz. We must support efforts to help them. But we cannot roll back accountability measures on the largest banks with nothing to help hardworking people who have the most to lose. #DoddFrankRollback"]["#DoddFrankRollback puts taxpayers at risk of another bank bailout and puts homeowners at risk of the same traps that led to the foreclosure crisis – where NV felt it worst - all while doing virtually nothing for hardworking Americans."]["JUST IN: Proud to have the support of 375 groups who agree w/ my @SenateBanking amendment to reinstate @CFPB #ripoffclause. \n\nConsumers should have the choice to enter arbitration or have their day in court when defrauded by bad actors. #DoddFrankRollback\nhttps://t.co/waHXJlVVLN"][".@realDonaldTrump's #MuslimBan is racist, disgusting, &amp; an attack on the Bill of Rights. It will do nothing to improve our national security &amp; only serves to fan hatred. Our Founders built a country on the principle of religious freedom &amp; respect. Remember that, @realDonaldTrump. https://t.co/mfsZw0rk1s"]["Due to reports that bots filed 100s of 1000s of comments to @FCC during #NetNeutrality policymaking process, I joined @SenatorHassan @SenateDems calling on @AjitPaiFCC to delay the planned 12/14 vote until an investigation of state of record is conducted. https://t.co/pSrUCwDjHK"]["#MonumentsForAll gives us the fortune to experience &amp; explore. Protecting our national monuments is vital, so generations to come can enjoy. They're a source of economic revenue - generating over $59 billion annually - and gives a needed boost to our rural communities' economy."][".@realDonaldTrump is engaging in a full on assault of the century-old Antiquities Act. No president has ever challenged its authority, until Trump. We must defend our heritage and way of life - that means protecting our #MonumentsForAll! \n\nRT if you're with me in this fight! https://t.co/yuhconwIng"]["Only 11 more days left to #GetCovered, Nevada! \n\nIf you're looking to sign-up for quality, affordable health care, want to compare insurance options, or change your current plan - please make sure to do so before open enrollment ends on 12/15! To sign up--&gt;https://t.co/bpXlUzDe0m https://t.co/fJl4fpD3bT"]["You rejected #Trumpcare every time bc you raised your voices! Raise them again &amp; tell your reps to oppose #GOPTaxScam if goes to conference."]["Ramming #GOPTaxScam through in the dead of night was by design. GOP knows working families will be paying for their $1.5 T gift to big corps"]["From the start, the process was shameful. A bill that will affect every American was drafted in secret, behind closed doors w/ no Dem input."]["Early this morning, Republicans forced their #GOPTaxScam through to final passage - all to deliver an early Xmas gift to top 1% &amp; big corps."]["Let's be clear what's happening in the Senate right now: We just got the revised #GOPTaxScam 500-page bill that we'll be forced to vote on. Even if there were time to read it, we couldn't if we tried! \n\nThis is insane. And Washington dysfunction at its finest. #NotWhyICameHere https://t.co/lGAlAbgZCA"]["Q: When there's bipartisan consensus to not pass #GOPTaxScam b/c it will result in 13 million Americans to become uninsured &amp; cause skyrocketing premiums, then why is GOP so eager to pass it?\n \nA: Huge tax break for their friends, like Big Oil &amp; Big Banks https://t.co/J8xHs6sr3E"]["The global fight against HIV/AIDS requires our unwavering commitment and leadership. PEPFAR has saved over 11 million lives &amp; led to a 47% decrease in AIDS-related deaths. \n\nOn #WorldAIDSDay, let's recommit ourselves to fighting and winning this battle. @ONECampaign https://t.co/08Z0scfogW"]["Amazing that lobbyists know what amendments will be part of the #GOPTaxPlan before @SenateDems. You're right, @clairecmc. This process is appalling. This is not how this body is supposed to work. https://t.co/b0ApQRm5w1"][".@UNLV graduate students nervous over ability to afford graduate school if #GOPTaxScam passes. This is wrong. We should be making higher education more affordable, not less. https://t.co/Hu9y0WJVEG"]["We still haven't seen the revised #GOPTaxScam - not even the Senate Republicans who've said they'll vote for it - yet, we'll be forced to vote on it potentially within hours. Time to raise your voice &amp; tell your reps to vote NO! \n\nYou did it with #Trumpcare, we can do it again! https://t.co/lba78jMdPh"]["#GOPTaxScam gives tax breaks to top 1% under the false promise that America's working families - someday - will be better off because big corporations &amp; investors will do something better with the money than working families."]["The cost of the #GOPTaxScam is too high for the 13 million Americans who will become uninsured if they lose their live-saving health coverage. https://t.co/pPA6NwUq1n"]["Republican tax cuts for the top 1% &amp; big corporations will not pay for themselves  – everyday Americans will be hit by the #GOPTaxScam to foot the bill. https://t.co/NgybDw2N8E"]["Only two more weeks left during open enrollment! And with the holiday season in full swing, please take the time to #GetCovered, Nevada. \n\nI encourage Nevadans to watch my video walkthrough of @NVHealthLink &amp; learn how to sign-up for healthcare. Be sure to sign up by 12/15! https://t.co/hdkw2DcjEk"]["The GOP has argued their #GOPTaxScam would pay for itself through economic growth. This week, @SenateMajLdr even said their plan would not be a \"deficit-producing effort.\" \n\nThe official scorekeeper has weighed in &amp; the GOP's wrong. It would blow a huge hole in our deficit. https://t.co/UmuTzC8b2I"]["#GOPTaxScam is a direct attack on taxpaying immigrant families. Eligibility restrictions to the Child Tax Credit will threaten hard working immigrant families. \n\n#GOP must stop catering to top 1% &amp; big corporations, &amp; start standing up for working families https://t.co/vmRtpS8hs4"]["Fmr. Reagan Budget Director on #GOPTaxScam: \"Wall Street is foaming at the mouth for this.\" He's right. Why? Because this legislative unicorn gives your tax money back to the Big Banks. It's shameful. Execs on Wall Street don't need a tax cut, America's hardworking families do. https://t.co/QjcmfmiZlk"]["When our tax code was reformed in 1986, it was a bipartisan process. The Senate held 36 hearings over 10 months. This time? Completely partisan &amp; not a single hearing has been held. \n\nSo, why is the #GOPTaxScam getting rammed through the Senate? Watch as I tell you exactly why. https://t.co/9bWPWKk2q2"]["#GOPTaxScam is smoke &amp; mirrors. While the GOP claims it will help hardworking middle-class families, the fact is they will see their taxes go up over a decade. All to give the top 1% &amp; big corps - like Big Oil &amp; Big Banks - permanent tax giveaways to ship American jobs overseas."]["Calling all @unevadareno students! \n\nAre you interested in interning in my Reno, Las Vegas, or Washington, DC office? Stop by the Joe Crowley Student Union today to learn more about internship opportunities! My Reno team will be there until 2pm to answer your questions. https://t.co/iVu22KjUTP"]["The party of \"fiscal responsibility\" is on the cusp of passing their #GOPTaxScam in Senate. Their bill explodes the deficit by over $1 trillion to give a Christmas bonus to Wall Street, big corps, &amp; top 1%.  \n\nOur future is on the line! Call &amp; tweet to tell your rep to vote NO!"]["Paul &amp; I are saddened by the passing of our friend, Joe Crowley. Joe dedicated his life to education as a professor &amp; the longest-serving president @unevadareno. I'm infinitely grateful for his support throughout the years. My deepest condolences to Joe's wife, Joy, &amp; his family."]["It's time we eliminate tax loopholes that put everyday Americans on the hook for special interests' lobbying. Today, I introduced legislation that ends taxpayer subsidies for lobbyists &amp; closes a loophole that gives them unnecessary tax breaks. https://t.co/L9XGGJA3FM"][".@USCBO confirms: Alexander-Murray compromise to stabilize the marketplace won't undo the harm #GOPTaxScam will cause. If GOP is serious about helping Nevada's working families, they should abandon this plan to take away the healthcare of 13 million Americans. https://t.co/ZltKnT6RIn"]["84% of Native American women experience violence in their life. I stand by these women who experience staggering levels of violence &amp; murder. You are #NotInvisible. We cannot allow this to continue to happen. Join me to help raise awareness of this epidemic &amp; show your support. https://t.co/gdwYif6Tzp"]["This headline says it all. #GOPTaxScam will result in 13 million more Americans to become uninsured, skyrocketing premiums, &amp; further destabilize the marketplace. \n\nWe have been down this road before. The GOP needs to retire their tired playbook &amp; quit attacking our healthcare. https://t.co/HR429Ww0P2"]["Grateful to you and all of our first responders on the scene working hard to keep us safe. https://t.co/fFPJKmOf2E"]["This is a setback that gives Big Banks, payday lenders, &amp; credit card co's a strong ally @CFPB. Americans deserve a director w/ a proven record of protecting borrowers. Mulvaney has no business leading an independent consumer agency that's he's voted against &amp; vowed to destroy. https://t.co/OKBmh7SLf7"][".@TransCanada claimed a #KeyStone oil spill exceeding 50 barrels wouldn't be more than once every seven to 11 years. There's been three in less than a year. Congress should be vigilant in oversight efforts for repeated environmental disasters committed by the same operators. https://t.co/a8KiTfBlg4"]["Over 500,000 middle class Nevadans will see their taxes go up in 2027 with the #GOPTaxScam - all to give permanent tax giveaways to big corporations. \n\nHow does this bill help NV's middle class when 1 in nearly 6 Nevadans are footing the bill to pay for tax cuts for big corps? https://t.co/n560PkH3Tf"]["Here's what the GOP's on the fast-track to do:\n\n-Rip care away from 13 million Americans\n-Raise taxes on the poor &amp; middle class over a decade\n-Give permanent tax cuts for big corporations &amp; more $$$ to Big Banks\n\nTime to speak out &amp; tell your reps to vote NO on the #GOPTaxScam! https://t.co/kWQpF7UcvV"]["HAPPENING NOW IN ELY: @NVHealthLink &amp; my staff are at the White Pine County Chamber to help Nevadans enroll into healthcare. Have questions about your care or want to compare health plans? They're there to assist! Stop in before 4pm\nLocation:\n636 Aultman Street\nEly, Nevada 89301 https://t.co/ohptpFDDdD"]["#DREAMers deserve peace of mind before the end of the year, and especially during the holiday season. RT to urge the GOP to bring the #DREAMAct to the floor to #ProtectDREAMers &amp; keep families from being ripped apart!"]["Nevada, it's time to #GetCovered! If you're looking for quality, affordable insurance or want to compare plans, now is the time to enroll. https://t.co/2Mq0O7ZNB7"]["Open enrollment is well underway! Watch as I chat with Heather, the ED of @NVHealthLink, how Nevadans can easily #GetCovered before 12/15! https://t.co/GZamXctbah"][".@realDonaldTrump must respect the Wall Street Reform law and allow Leandra English to fulfill her obligations to American consumers @CFPB. She is now the Acting Director at the Bureau, and my office will recognize her leadership. https://t.co/DEa9dGE87a"]["#GOPTaxScam will hurt rural Nevadans, potentially leaving them with no coverage options or facing plans with skyrocketing premiums. We should be making healthcare more accessible and affordable in our rural communities, not less. https://t.co/APcZXVqpMl"]["With the holiday season in full swing, don't forget to take the time to #GetCovered during open enrollment!\n\nIf you need quality, affordable healthcare or want to compare health insurance plans - now is the time to do it! Nevadans, go to @NVHealthLink before it ends on 12/15! https://t.co/NInETAfjH5"]["Today is #SmallBizSat! Small businesses are the engine to our economy. #ShopSmall today to support the businesses that unite our communities https://t.co/5cV9EXMkeL"]["Paul and I wish all a very #HappyThanksgiving and peaceful day with family, friends, and loved ones. Grateful to our brave servicemembers, law enforcement, and first responders that work so hard everyday to keep us safe. https://t.co/JveKiObEc9"]["Saddened to learn of this terrible news. Praying for a safe return of the three missing &amp; grateful to the servicemembers working to rescue. https://t.co/CWuEyNRHMN"]["If we want to truly create jobs &amp; grow our economy, one thing we can all agree on is that we ought to be investing in our infrastructure. https://t.co/cyQA5x35QP"]["@SenateMajLdr Thank you @SenKamalaHarris @SenFeinstein @SenDuckworth @maziehirono @SenatorBaldwin @SenWarren @SenatorCantwell @PattyMurray @SenGillibrand @amyklobuchar for fighting to protect #DACA recipients alongside me &amp; keep them from being torn away from their children &amp; their only home."][".@SenateMajLdr, w/ the holidays here, you must pass the #DreamAct before #Senate recesses in Dec. 53% of #DACA recipients are women &amp; 1/4 are parents to American citizen children. The future of these mothers &amp; their kids have been thrown into uncertainty &amp; now face deportation. https://t.co/TX3NQfnkbA"]["Innovation's key to building a better future for NV. It was great to tour the Southern NV Traffic Management Center &amp; discuss ways we can boost NV's infrastructure &amp; transpo systems. My Moving FIRST Act builds on #SmartCities challenge to enhance tech advancements in transpo. https://t.co/5FotnhVPg5"]["WATCH: At an open enrollment site in Las Vegas, I spoke with Irene, a Nevadan enrolling into the exchanges, and Alyson, a navigator speaking to just how easy the process can be: https://t.co/Jv9b9ihkrt\n\n#GetCovered, NV, before open enrollment ends on 12/15! @NVHealthLink can help"]["HAPPENING SOON: I will be going LIVE on @facebook from Las Vegas at an open enrollment site to talk about the importance of Nevadans signing up for healthcare before open enrollment ends on December 15! \n\nJoin me &amp; learn how to #GetCovered --&gt;https://t.co/J85JS3Efzz"]["Today, @FlyFrontier began service from @RenoAirport to Denver, non-stop. Another option for our neighbors in the Colorado Rockies to travel to the Sierra Nevada! https://t.co/F247b98cW8"]["Trump Admin's decision exposes nearly 60k Haitians to deportation &amp; rip families apart. By turning its back on people in need, this Admin's demonstrated to the world its unabashed indifference to human suffering. I condemn this heartless decision &amp; will continue to fight for them https://t.co/qWBTlsADg9"]["@AjitPaiFCC 3) I opposed @AjitPaiFCC's nomination for this exact reason. A free &amp; open internet - one that doesn't pick &amp; choose - provides an environment for entrepreneurship, innovation, &amp; creativity. \n\nRT to let your reps know you want to protect a free &amp; open internet! #NetNeutrality"]["@AjitPaiFCC 2) Chairman @AjitPaiFCC plan to repeal current #NetNeutrality rules completely disregarded the tens of millions of Americans that spoke out in support of a free &amp; open internet. With this decision, holding bad actors more accountable will be difficult."]["Last night, I sat down with immigration leaders from Washoe County to learn how @realDonaldTrump &amp; the GOPs callousness towards #DACA recipients has harmed Northern NV's youth. Inaction to protect #DREAMers is unacceptable. I will continue to fight for passage of the #DreamAct. https://t.co/alf9BbmYKy"]["I commend the passage of the Law on Eliminating Violence Against Women in Tunisia. This is an important advancement in implementing Tunisia's new constitution's provisions on gender equality. More from my letter to President Essebi of Tunisia --&gt; https://t.co/LyaSd2s5HY"]["On Transgender Day of Remembrance, we honor all who lost their lives due to heinous and cruel acts of violence and hatred. Today, we must recommit ourselves to fighting for the transgender community &amp; ensure all in this country can live their lives free of discrimination. #TDOR"]["#GOPTaxScam would cause 13 million more Americans to become uninsured, including 4 million by 2019 alone. It would send premiums skyrocketing &amp; destabalize the marketplace even more. \n\nThis, all in the name of giving big corporations &amp; wealthiest tax breaks. Completely outrageous"]["Many believe signing up for a plan on the exchanges is a long &amp; complicated process. This couldn't be further from the truth. I encourage Nevadans to watch my video walkthrough of @NVHealthLink &amp; learn how to #GetCovered! Be sure to sign up before open enrollment ends on 12/15! https://t.co/BLUQ8AXqvY"]["#GOPTaxScam gives poor &amp; middle-class American families temporary tax relief while handing big corporations, who do not need it, a permanent tax cut. \n\nRewarding the wealthiest - who have long exploited loopholes in our tax code to avoid paying their fair share - is plain wrong."]["The holidays are a time to spend w/ family &amp; friends. It's also the time to sign up for health insurance before 12/15! @NVHealthLink has more than three dozen locations offering in-person assistance, &amp; you can enroll online, too! More in my op-ed w/ @rgj: https://t.co/6zaFwANebP"]["Let's get this straight: #GOPTaxScam eliminates #SALT deductions that help pay for the salaries and equipment for our law enforcement agencies, so they can give big corporations &amp; the wealthy a handout. This is no way we should be treating the brave men &amp; women that keep us safe. https://t.co/LyWK7cusdF"]["Come out to @unevadareno today to show your support for the 800,000 #DREAMers across the country! DREAMers make our communities stronger, and I will continue to fight for you. #protectDreamers #HereToStay #IOPDreamers https://t.co/jzhmyHIu7n"][".@WhipHoyer, glad you got see for yourself why Nevada is at the forefront of this incredible technology that's helping our communities become better connected! https://t.co/tcfsJDDOyu"]["#GOPTaxScam gives the poor &amp; middle-class American families temporary tax relief while handing big corporations, who do not need it, a permanent tax cut. Rewarding the wealthiest that have long exploited loopholes in our tax code to avoid paying their fair share is plain wrong."]["TODAY IN RENO: My staff's hosting office hours for bilingual speakers @ the Women and Children's Center from 11am-1pm; 3905 Neil Rd, Suite 2"]["Congratulations to all 1,485 Nationally Board Certified teachers in NV! This distinguished professional benchmark is something to be proud of, and we certainly are of you. You have one of the toughest jobs there are - thank you! https://t.co/KKoD4pbsro"]["Only 9% of Americans with #pancreaticcancer survive 5+ years. It's the world's deadliest major cancer. That's why it's important to know the risk factors. On #WorldPancreaticCancerDay, we must recommit to prioritizing lifesaving research @NIH #WPCD #PANCaware https://t.co/Ytg0RdMPXr"]["Las Vegas saw the deadliest massacre due to gun violence on #1October. No city or town should ever have to bear this distinction. I'm proud to co-sponsor the Fix NICS Act w/ @ChrisMurphyCT @JohnCornyn to ensure records of violent criminals are submitted in background check system https://t.co/hODzbzMJB2"]["Today, with the passage of @HouseGOP version of the #GOPTaxScam, they've shown Americans their top priority: showering giant corporations with an enormous tax break. https://t.co/Ect2XDo1NZ"]["#GOPTaxScam would result in 13 million more Americans to become uninsured, it would send premiums skyrocketing, &amp; destabalize the marketplace even more. \n\nThis, all in the name of giving big corporations &amp; the wealthiest tax breaks. This is outrageous.  https://t.co/X3XKMlTZyZ"]["Let's break the #GOPTaxScam down here. It will: \n-Raise taxes on the poor in 2021\n-Raise taxes on hardworking middle-class NV families after 2025\n-Raise taxes on all Americans after 2027\n\nWhy? To give a permanent handout to big corporations already sitting pretty. This is a sham. https://t.co/LFygIV80yW"]["Proud to cosponsor the Military Domestic Violence Reporting Enhancement Act that will close a dangerous loophole that allowed the Sutherland Springs, TX, gunman to avoid reporting requirements in order to buy military assault weapons. https://t.co/mVjGZqKATs"]["This is deeply disappointing and this type of behavior is unacceptable. I support the Ethics Committee process and investigation into this inappropriate conduct. I expect to hear more from Sen. Franken. https://t.co/stSf3pdY0a"]["TODAY IN FERNLEY: My staff will be holding office hours from 10am until 2pm at the Fernley Senior Center. Have questions, curious about resources available, or need help navigating a federal agency? We're here to help!\n\nFernley Senior Center\n1170 W. Newlands Dr.\nFernley, NV 89408"]["@CFPB The next @CFPB Director needs to be a strong advocate for borrowers, service members, seniors &amp; students - not another Wall Street insider. In light of #GOP threats to dismantle @CFPB, we must work hard to keep rules protecting working families from bad financial actors in place."]["@CFPB NV was ground zero for the housing crisis. @CFPB become one of my strongest allies in fighting for relief for families that lost their homes. I want to thank Mr. Cordray for his dedication to protecting consumers &amp; for helping bring justice to Americans cheated by the Big Banks."]["@CFPB Director Cordray fought to hold the Big Banks accountable for wrongdoing &amp; ensured that Nevada homeowners that were preyed upon during the housing crisis received justice. Thanks to his leadership, he secured $29 billion for more than 12 million consumers in just six short years."]["Director Richard Cordray has been a staunch protector of hardworking Americans against injustices committed by powerful financial institutions. He's lead the @CFPB on behalf of American consumers in protecting students, seniors, and homeowners."][".@USCBO says the #GOPTaxScam could result in tens of billions of dollars in cuts to #Medicare. \n\nHow can the #GOP reconcile gutting critical care our seniors rely on to pay for tax breaks for big corporations &amp; the richest Americans?\nhttps://t.co/1pbqAnHKnM"]["Leaders in the healthcare industry confirm: Repealing this critical piece to #ACA would cause premiums to skyrocket, destabilize the marketplace, &amp; kick 13 million of their health insurance plans. \n\nWhy is the #GOP so obsessed with gutting our care? RT if you want to keep yours! https://t.co/c5VznM5qat"][".@SenateGOP deal-making 101:\n\n-Give tax giveaways and kickbacks to big corporations and the wealthy ✓\n-Kick 13 million Americans off their health insurance #GOPTaxScam ✓\n-Sell out the #ArcticRefuge to #BigOil ✓"][".@SenateGOP should be listening to environmental experts like Stan, who has lived in Alaska for decades. Congress should not be selling out the #ArcticRefuge to give more tax breaks to #BigOil. We must #protectthearctic https://t.co/QL8SZNd28l"]["Republicans argue #ArcticRefuge drilling will lower oil prices, achieve energy dominance, &amp; be a significant deficit reducer. \n\nLet's be clear: It's won't. #ArcticRefuge drilling will end up being a taxpayer giveaway to #BigOil &amp; gas.\n#protectthearctic https://t.co/iHJs3S52aR"]["This morning, Republicans will vote a bill out of committee to open the #ArcticRefuge up to drilling for Big Oil &amp; gas - all in the name of deficit reduction.  \n\nNews flash: It will barely put a dent in the deficit. This is a lose-lose. #protectthearctic #GOPTaxScam https://t.co/0LRSdLBLSd"]["My staff attended the Las Vegas Project Homeless Connect today, a resource &amp; service fair for people experiencing homelessness or at risk of homelessness. \n\nWe must continue to do whatever we can to end homelessness across this country, &amp; HUD funding is critical to that effort. https://t.co/ieCvsdmlPi"]["Today, I spoke with the governors of Puerto Rico &amp; the Virgin Islands around relief efforts following Hurricanes Maria &amp; Irma. One of their needs is for Congress to allocate additional funding so these countries can rebuild using greener, more energy efficient technologies. https://t.co/90n3V7kmqX"]["Maria from northern Nevada is an example of the true impact of @realDonaldTrump's heartless &amp; senseless decision to rescind #DACA. DREAMers are hardworking, contribute to our communities, &amp; make our country &amp; economy stronger. #ProtectDreamers #HereToStay https://t.co/ZMHhtAhRwC"]["DEADLINE TOMORROW: Are you interested in interning in my Washington, DC, Las Vegas, or Reno office? Apply to be an intern for Spring 2018 semester &amp; learn more about the legislative process &amp; how we engage with &amp; serve the Battle Born state.\n\nApply --&gt; https://t.co/hVwAmivg7F https://t.co/r5RHTcrrPV"]["Latest in the #GOPTaxScam: Ripping affordable healthcare away from 13 million Americans in order for the GOP to give their biggest fans (big corporations and the uber-wealthy) a giveaway they do not need. \n\nWe've been down this road. Enough with the #ACASabotage already. https://t.co/kMWszLkCov"]["The GOP was right about one thing, their plan is easy. Both House and Senate plans have just two steps: cut taxes for the wealthy now and pay for tax cuts later by cutting the programs that Nevada's working families rely on. #GOPTaxScam"]["How could the #GOPTaxScam help you and your family when their proposal was designed to help the wealthy and America's biggest corporations? \n\nTell the GOP to go back to the drawing board and work across the aisle to give meaningful relief to hardworking American families."]["TODAY IN FALLON: \nMy office will be at the Churchill County Senior Center from 1-3pm. If you have questions or need help navigating a federal agency, please stop by!\n\nLOCATION:\nChurchill County Senior Center\n310 E. Court St.\nFallon, NV 89406"]["The #GOPTaxScam eliminates the tax deduction that helps make up for teachers out-of-pocket expenses that help equip their students w/ the education they deserve. Teachers have one of the toughest jobs out there. The #GOPTaxScam punishes them to pay for tax breaks for the rich. https://t.co/H1pxkYVzUj"]["Powerful and moving tribute, @RAIDERS. https://t.co/iGQ7wG49oG"]["Congratulations, @LasVegasWNBA on winning #1 pick in the draft lottery! Already beginning your time in Las Vegas with a win! https://t.co/u9dSn1mBbz"]["Congratulations to the nearly 900 @GVRcasino workers who are now unionized! As the daughter of a union member, I know how important NV's unions are to fighting for the hardworking men &amp; women that are essential to NV's economy. https://t.co/ILbbOlUDqN"]["Open enrollment for 2018 plans is underway! If you need assistance signing up for quality healthcare or need help comparing plans, you must enroll before 12/15! For Nevadans needing help --&gt; https://t.co/bpXlUzDe0m #GetCovered https://t.co/tEenlYwUQf"][".@realDonaldTrump and GOP's latest plan: send health insurance premiums skyrocketing and leave millions more uninsured, all to give tax cuts to big corporations and the wealthiest few. https://t.co/UXLKnKvNBA"]["Today, my staff will be holding office hours at the Douglas County Senior Center in Gardnerville from 10am-12pm. \n\nIf you have questions, need help with a federal agency, or want to know how my office can assist you - please stop by! \n\n1329 Waterloo Ln.\nGardnerville, NV 89410"]["Today, we must recommit to honoring our veterans' service &amp; sacrifice by supporting them both in combat &amp; when they return home #VeteransDay https://t.co/A42CnhhMdL"]["In honor of #VeteransDay, &amp; all the brave men &amp; women in uniform serving or have served, @RTCSNV @RTCWashoe services will be free tomorrow."]["Grateful to the brave men &amp; women who have served, or are currently serving, in the Marine Corps for their service. Happy birthday, @USMC! https://t.co/5bvqbudNd2"]["I celebrate the nearly 900 DREAMers serving in our military today &amp; the over 500k veterans of foreign birth that have served our country. Trump rescinding #DACA is bad for our country’s safety, our economy, and bad for NV. Congress must honor their service and pass the #DreamAct https://t.co/vi9XylE8ib"]["GOP in Congress have introduced yet another tax reform proposal crafted on a partisan basis behind closed doors. We need bipartisan tax reform that is not a tax hike for NV's working and middle class families, not permanent handouts to the wealthy &amp; corporate special interests. https://t.co/SilQfwgdU6"]["Despite this Admin's efforts to sabotage the #ACA, it's clear Americans need - and value - quality, affordable healthcare across this country.\n\nIf you're a Nevadan, make sure to sign up before open enrollment ends on 12/15 --&gt;https://t.co/ZKlhdyIcqY https://t.co/PSrBNyWEoL"]["@realDonaldTrump I call on @SenateGOP to honor the service of #DREAMers serving in our military and pass the #DreamActNow. I will not stop fighting for DREAMers &amp; their families until they do."]["@realDonaldTrump I want every DREAMer to know something: You are not alone. You belong here. You are American."][".@realDonaldTrump's action to rescind #DACA &amp; threaten deportation of 800,000 #DREAMers is bad for our country's safety, bad for our economy, and bad for Nevada."]["DREAMers represent the very best of us - every single DREAMer - and I have met with so many in NV, they work hard. They put themselves through school. They serve our country. They support their families. And they make better lives for themselves &amp; their communities in Nevada."]["Veterans Day is Saturday, but for the nearly 900 DREAMers serving in our military, it's a reminder that their Commander-In-Chief does not honor their service. He's told them their service to America &amp; their patriotism is not wanted."]["I'm here today to send a clear message to the DREAMers back home in NV, and throughout the country: I hear you, I stand with you, and together we will make sure Congress passes the #DreamActNow"]["Nearly 900 brave DREAMers have answered the call to serve to defend our country and keep Americans safe. Now, they face deportation b/c their Commander-In-Chief has rescinded #DACA. I call on @SenateGOP to honor their service and pass the #DreamActNow https://t.co/LNDygdv68i"]["Incredibly touching, @carrieunderwood @CountryMusic. Thank you. The power of human compassion will continue to help us heal. #VegasStrong https://t.co/PAP6TS8VXw"]["Las Vegas moving forward! Applying new technology will help our NV communities become better connected &amp; improve our way of life. That's exactly what my #smartcities bill with @SenatorBurr would do. https://t.co/TkNftsJnmo"]["What's so egregious about what @Equifax has done to the 1.3 million Nevadans whose data was compromised, is that they'll have to spend the rest of their lives clearing up their good name. \n\nMore from my conversation with @Equifax CEO --&gt; https://t.co/UrWDmttP99"]["The @Equifax data breech is egregious. It's incumbent upon us all, including leaders in the private sector, to have the most sophisticated security - always protecting it. When you fail to do that, you should be held accountable &amp; there should be restitution for those consumers. https://t.co/QrfgUhNqJn"]["For years, Republicans have argued that cutting taxes would spark major economic growth and eventually, the cuts would pay for themselves. A former economist for President Reagan lays out a much different scenario --&gt; https://t.co/KgZj9rd5QV"][".@PattyMurray was inspired to run for office after a state legislature told her \"you can't make a difference, you're just a Mom in tennis shoes.\" Well, thankfully - she proved him wrong. \n\nIn the age of @realDonaldTrump, listen to her powerful message for us all --&gt; https://t.co/ibGmSoGbAE"]["Are you interested in interning in my DC, Las Vegas, or Reno office next spring? Deadline to apply is a week from today, 11/15! Be sure to get your application in &gt;&gt; https://t.co/hVwAmivg7F"]["Republicans say #GOPTaxPlan will be so simple, you can file your taxes on a postcard. Here's a postcard highlighting the real winners of this bill. Spoiler alert: it's not Nevada's working families. https://t.co/wb8iXECWRz"]["#GOPTaxScam will add $259 billion to the deficit. For a party that prides itself on \"fiscal responsibility\", it's clear their rhetoric on responsible budgeting has always been a farce. https://t.co/MPMGgTRvYL"]["My staff is at the Douglas County Senior Center today holding office hours until Noon. Whether you have questions, need help navigating a federal agency, or want to know how best my office can help - I encourage you to stop by! 1329 Waterloo Ln., Gardnerville, NV 89410 https://t.co/B2jVeJDpcU"]["Open enrollment for 2018 plans is underway! Make sure to sign-up for health insurance before open enrollment ends on December 15th. @NVHealthLink can help you get started &gt;&gt;https://t.co/ZKlhdyIcqY https://t.co/v0CYqAsPqD"]["Honored to be included in this list of progressive women fighting to protect a women's right to choose, immigrant families from being torn apart, paycheck fairness, gun violence prevention and all of the ways @realDonaldTrump's working to take our country to an ugly &amp; dark place. https://t.co/5nqM69vl44"]["Open enrollment is underway &amp; despite @realDonaldTrump's #ACASabotage efforts around open enrollment, we're seeing record numbers! \n\nIf you're a Nevadan in need of quality care or wanting to compare plans --&gt;https://t.co/G1pzLg7Lpm https://t.co/tUF0Zime6A"]["We should be making higher education more accessible. #GOPTaxScam eliminates an employer incentive that helps provide educational assistance to employees. My Upward Mobility Enhancement Act w/ @JeffFlake improves upon this aspect of the code so more employers will take advantage. https://t.co/f7fHGNHQV6"]["The #GOPTaxScam is just smoke &amp; mirrors. Any way you look at it, over time, it's a middle class tax hike for Nevada's hardworking families. https://t.co/Y5jgQkGmbJ"]["Tax reform ought to help the middle class thrive &amp; the most vulnerable among us get ahead, not one tailored for the wealthy donor elite. https://t.co/jxpuv8SDgx"]["Ending #TPS will rip Francis in NV away from her children. This is cruel &amp; not who we are as a country. Congress must act w/ a permanent fix https://t.co/rqVEKIzptc"]["Ending #TPS for Nicaraguans is cruel. I won't stop fighting until these families are kept intact &amp; protected from this xenophobic Admin. https://t.co/orAV7qh7rM"]["What an incredible tribute to #1October victims, their families, &amp; the spirit of our resilient &amp; caring community, @NellisAFB. #VegasStrong https://t.co/duYcsa3lgn"]["At a time when North Korea is accelerating its nuclear program, the #BRINKAct is best way to get DPRK to the nuclear negotiating table. https://t.co/FlG6lXmI2s"]["The #BRINKAct will send a clear message: Any banks or firms that do business with North Korea can't do business with the United States."]["Small businesses are the engine to our economy. We ought to help create environment so they can thrive. Pass-through loophole doesn't do it https://t.co/2qTi8fHA49"]["Open enrollment has begun! Nevadans needing care, looking to compare plans, or curious on costs of current plan --&gt; https://t.co/MnpRtTwNMT https://t.co/KvyeCzBPpA"]["By 2027, @TaxPolicyCenter says richest will be pocketing $300k more a year in tax breaks, while middle class would pay $2k more. Outrageous. https://t.co/mn9N4aZp0x"]["#GOPTaxPlan eliminates #SALTD that could deprive our kids from the education they deserve. We need to heed this call from our school leaders https://t.co/Qb78hxJFSK"]["SOON: Headed to the floor w/ @SenatorCollins to intro our BOLD Infrastructure for Alzheimer's Act to help w/ prevention &amp; raising awareness."]["Ending #TPS for 60k Hondurans &amp; Nicaraguans could pave way for mass deportation of those in US legally. @DHSgov decision should protect. https://t.co/Dx8BsgfwGq"]["Thinking of my colleague @RandPaul. Violence is never the answer &amp; should always be condemned. Please get well soon. https://t.co/qYtR1r9ElM"]["My heart is with the families affected by this act of terror in Texas. Grateful to our brave first responders &amp; the helpers. Prayers for all"]["Remembering the two brave miners killed this week at Marigold Mine tonight. My deepest sympathies to their families. https://t.co/yER1czd9hu"]["@HouseGOP @realDonaldTrump @USCBO The #GOPTaxPlan is a non-starter for Nevada. I urge every Nevadan to call, email, tweet your representatives and make your voice heard."]["@HouseGOP @realDonaldTrump @USCBO GOP negotiated away financial security of middle class to give corporations &amp; richest few an X'mas present. Trump family must be ecstatic."]["@HouseGOP @realDonaldTrump .@USCBO analysis will unmask this bill for what it is: a threat to the financial security of our country &amp; economic wellbeing of NV families"]["@HouseGOP @realDonaldTrump #GOPTaxPlan threatens crucial middle class tax deductions that NV relies on - credits for student loans, childcare, and medical expenses."]["@HouseGOP @realDonaldTrump The party of \"fiscal responsibility\" wants to add trillions to deficit w/ plan. Their rhetoric on budgeting &amp; deficit reduction is a farce."]["@HouseGOP When @realDonaldTrump &amp; his special interest friends ask for a handout, congressional Republicans jump into action."][".@HouseGOP tax proposal hands a fat bonus to big corporations and the rich on the backs of Nevada's hardworking families, seniors &amp; poor."]["Nevada was ground zero for the housing crisis. We're still recovering. @NAHBhome says #GOPTaxPlan could lead to another housing recession. https://t.co/OVEctU59rK"]["¡Feliz Día de los Muertos! Hoy honramos y recordamos a nuestros seres queridos quienes han fallecido."]["Happy Day of the Dead! Today, we honor the beautiful memory of our loved ones who have passed."]["Grateful for the incredible support shown to our community as we continue to heal. Congress must act to reduce gun violence. #VegasStrong https://t.co/qGuWTHNpBf"]["#DREAMers fear deportation b/c Trump rescinded #DACA program. @realDonaldTrump, you claimed in Sept. you'd work with Ds to fix, let's see it https://t.co/tbuyUGbY2G"]["I am a proud cosponsor of the Paycheck Fairness Act! It is unconscionable that women are not paid equally for their work. #LatinaEqualPay"]["RT &amp; spread the word: 80¢ doesn’t tell the whole story. Latinas are paid just 54¢ for every $1 paid to their male colleagues #LatinaEqualPay"]["My two-cents on the $.54 #wagegap facing Latinas: It’s outrageous &amp; we must push for #LatinaEqualPay by passing the Paycheck Fairness Act!"]["Latinas have to work 306 extra days to earn what their male colleagues make in a year - more than any female minority group. #LatinaEqualPay"]["OPEN ENROLLMENT: Nevadans needing quality healthcare or want to compare insurance plans, get help near you today: https://t.co/G1pzLg7Lpm https://t.co/nbh7Sppo5C"]["As a Latina, I'm using my seat at the table to close gender pay gap. It's unacceptable that Latinas earn $.54 on the $1! #LatinaEqualPayDay https://t.co/JlAS0KKDgy"]["#ArcticRefuge drilling will end up being a taxpayer giveaway to #BigOil &amp; gas.  This is a raw deal for Nevadans. \nhttps://t.co/iHJs3S52aR"]["Many are still hospitalized &amp; recovering from #1October shooting. Blood donations are the biggest need. Pls donate! https://t.co/htBMpTpkhD"]["The Ruby Mountains are stunning, &amp; enjoyed by many. Make your voice heard if you don't want to see them sold off --&gt;https://t.co/7u7jEfPyn6"]["While @realDonaldTrump might refuse to allow open enrollment to be successful, I will not. Nevadans, #GetCovered: https://t.co/G1pzLg7Lpm"]["It's been 1 month since #1October massacre in Las Vegas &amp; Congress hasn't passed a thing to prevent gun violence. We will continue to fight. https://t.co/rnibyRmwKB"]["We're a great nation. We know how to take care of our kids. Their healthcare should be beyond partisan politics. Congress must #ExtendCHIP! https://t.co/u1KOjlzh0m"][".@NVHealthLink helping Nevadans in Reno choose the right insurance plan for them! #GetCovered during open enrollment https://t.co/G1pzLfQa0M https://t.co/IsOPF0vtb2"]["What does it mean to #StandWithWorkers? It means we'll fight for unions and the middle class - not for corporate special interests."]["Janus v. @AFSCME is yet another attempt to chip away at workers’ power in the workplace. Today and every day, we must #StandWithWorkers."]["The special interests behind Janus v. @AFSCME want to make the wealthy wealthier at the expense of American workers. I #StandWithWorkers."]["Janus v @AFSCME is an attack on workers' freedom to advocate for themselves. We can't let corporate special interests win #StandWithWorkers"]["Open Enrollment starts today! Review insurance plans &amp; #GetCoveredNow! Spread the word to family &amp; friends and encourage them to do the same https://t.co/KSK2mPKYep"]["Bump stocks helped contribute to #LasVegasShooting. They don't belong in our communities. @SenateGOP join me &amp; @SenFeinstein on bill banning https://t.co/CYCJfHicq2"]["Open enrollment stars TODAY! Nevadan that needs care or wants to compare plans? #GetCovered w/ @NVHealthLink or @HealthCareGov until 12/15! https://t.co/EaeNVzGjMx"]["Deporting 325,000 #TPS recipients would go down in history as one of our nation’s darkest chapters. We must #SaveTPS."]["TODAY: Open Enrollment starts! Nevadans needing care, interested in a new plan, or want to inquire on premiums --&gt;https://t.co/G1pzLg7Lpm https://t.co/2GQv1Mlwla"]["GOP has one priority: ripping off NV's working families. Any tax reform proposal should represent their interests, not the special interests https://t.co/ZepNQk9fm2"]["#Garrett's views of the LQBTQ community don't belong anywhere near the #EXIM Bank. #SupportEXIM"]["By voting against the #EXIM Bank - twice - #Garrett voted to send American jobs overseas. That's not the leader we need. #SupportEXIM"]["#Garrett doesn't believe #EXIM Bank should exist. How can American biz trust the Bank to support them with him at the helm? #SupportEXIM"]["To support US jobs, we need to support #EXIM. We must confirm a leader who believes in power of American workers. Scott Garrett's not it."]["@SenFeinstein @ChrisMurphyCT I call on @SenateGOP to work w/ me &amp; my colleagues. Let's finally do something for loved ones lost at Sandy Hook, Pulse, &amp; Las Vegas."]["@SenFeinstein @ChrisMurphyCT But the right to own a gun must also be weighed equally to right of Americans not to be killed by someone who has no business owning a gun."]["@SenFeinstein @ChrisMurphyCT I grew up in a family of gun owners &amp; hunters. My husband is a retired Secret Service agent. We are both proud gun owners."]["@SenFeinstein @ChrisMurphyCT Let me be very clear: this isn't about banning or taking away guns. I believe Americans have the right to own guns."]["@SenFeinstein @ChrisMurphyCT We'll never stop every tragedy, but isn't an excuse not to do something to protect Americans from what's clearly becoming a health crisis."]["@SenFeinstein @ChrisMurphyCT I don't just speak for myself, I speak for majority of Nevadans who voted to pass Q1 ballot initiative authorizing background checks in NV."]["@SenFeinstein I support @ChrisMurphyCT's background checks bill that will help keep guns out of hands of mentally ill, criminals, &amp; terrorists."]["@SenFeinstein We need to get weapons designed for warfare out of the hands of people who have no business owning them."]["I've been an advocate for common sense gun safety measures since my time as AG. I've co-sponsored @SenFeinstein's ban on bump stocks."]["In days since, I've worked w/ colleagues to see how we can do our best to stop tragedies like this from ever happening in another community"]["After the loss of 58 lives by a terrorist in Las Vegas, the issue of gun violence found me. And it found 22,000 people at that concert."]["One month since #1October &amp; Congress still has done nothing to act on gun violence prevention. Watch LIVE soon: https://t.co/E7WhGHVmTn"]["Horrified &amp; saddened by the news out of NYC. Thank you to the first responders &amp; @NYPDnews on the scene. Praying for all those impacted."]["Trump said his Supreme Court noms would be pro-life &amp; pro-gun. Joan Larsen was on his shortlist. Her confirmation now getting rushed through"][".@SenateGOP's ramming through a vote to confirm Amy Barrett whose writings raise questions whether she'd follow precedent, incl. Roe v. Wade"]["Republicans want to make it harder and harder for women to access health care. That’s why they want to remake our courts. #CourtsMatter"][".@realDonaldTrump's discriminatory \"Muslim ban\" was blocked by our courts. That's why Republicans want to remake our courts. #CourtsMatter"]["Federal courts serve as an independent check on the President, so @realDonaldTrump wants to stack courts w/ judges who see things his way."]["President Trump has demonstrated a lack of respect for the rule of law &amp; now GOP's ramming through his right-wing court picks. #CourtsMatter"]["Tomorrow is the first day of #openenrollment. If you need access to care, want a new plan, or ensure premiums haven't risen, please log in! https://t.co/XvTw2QMvtr"]["153 years ago today, NV entered the Union. Proud to be #BattleBorn. If I can't be in NV today, these will more than do! Happy #NevadaDay! https://t.co/a5kIMz4jsQ"]["GOP's tax plan would give a tax cut of $700k to country's 175k wealthiest families. Remind how this is going to help NV's working families? https://t.co/gYkNO0H0ZW"]["As a product of @ClarkCountySch - &amp; proud of it - I will always fight to ensure our young people have access to a quality public education. https://t.co/DLQqTyesjS"]["Las Vegas will never be the same. We must reduce gun violence in U.S. Congress can start by passing bump stocks ban &amp; expanded bkgrd checks. https://t.co/gpUynV1N0P"]["Discrimination has no place in our Armed Forces. Ruling against Trump's #transban reflects our American values of inclusion and respect. https://t.co/4Mh8x2Erxc"][".@realDonaldTrump must respect the rule of law and let Special Counsel Mueller continue to carry out the investigation w/out interference. https://t.co/81Drg3reGf"]["Visited w/ resilient, inspiring children of @LittleLobbyists in costume for the big day tomorrow! We must ensure they have access to care. https://t.co/BGqlfg47le"]["Las Vegas' very own, 7 yr. old Hailey Dawson will throw out first pitch at #WorldSeries tonight. She's already the true MVP! You inspire us. https://t.co/Bt0cEcLcOT"]["This hike could very well price Nevadans out from the means to enjoy the parks in NV &amp; neighboring CA &amp; UT states. https://t.co/x3ggz9oqI7"][".@JoeBiden &amp; @ladygaga are right. #ItsOnUs - all of us - to help stop sexual assault &amp; ensure victims have access to the tools they need. https://t.co/pJkPIEyXXP"]["Touring the Ruby Mountains this past summer. This is one of the many reasons why I love this beautiful state. Happy #NevadaDay (observed)! https://t.co/ETy6wJJrPt"]["Thank you @QuickenLoans for stepping up &amp; doing the right thing by victims, survivors, &amp; the families impacted by #1October shooting. https://t.co/or28NBliYi"]["The #TrumpTax plan would raise taxes on nearly 211,000 Nevada households in 2018. NV families cannot afford to pay almost 16% more in taxes."]["Presidents Reagan, Bush 41 &amp; Bush 42 all tried trickle-down tax cuts. None of them succeeded in helping hardworking NV families #NotOnePenny"]["We’ve done the math on the #TrumpTax plan &amp; it just doesn’t add up to savings for middle class Nevada families. #NotOnePenny https://t.co/E4xM78Flmf"][".@POTUS said he wouldn’t cut Medicare or Medicaid. Yet another  #TrumpTax broken promise &amp; all to give tax cuts to the wealthy. #NotOnePenny https://t.co/7aYKeZyHV3"]["What will the #TrumpTax plan mean for working NV families? Higher taxes, unless you’re one of the wealthiest Americans. #NotOnePenny"]["@senorrinhatch Allowing #CHIP to expire, state gov'ts to go bankrupt, rural hospitals to have to shut their doors - is not what we were sent here to do."]["@senorrinhatch All of us get sick sometimes. But no one should have to go into bankruptcy to pay for their son or daughter's medical treatment &amp; care #CHIP"]["@senorrinhatch Americans understand that children's healthcare is something that should be beyond the reach of partisan politics. We need to reauth #CHIP"]["@senorrinhatch 27,000 children in NV rely on #CHIP for basic healthcare. If Congress continues to do nothing, these children will have no access to care."]["@senorrinhatch Children's healthcare isn't a partisan issue in NV. Over the past 20 years, more than 60k kids have benefited from the #CHIP program."]["#CHIP isn't a partisan issue. It was intro'd by Sen. Kennedy, a Dem., &amp; Republican @senorrinhatch in 1997. Why's it being politicized now?"]["SOON: Heading to the floor to call on our republican colleagues to reauthorize the #CHIP program to ensure kids have access to basic care."]["#Vegas is home to over 120k Filipinos who enrich our community. Glad #Senate unanimously recognize Oct. as Filipino American Heritage month"]["We need to do whatever we can to stop the gun violence that has become too common. It's past time Congress pass expanded background checks. https://t.co/buW9kVke2x"]["Intro'd the Upward Mobility Enhancement Act w/ Sen. @JeffFlake that will help employers recruit talent &amp; employees pursue higher education https://t.co/CGaGRdsDqK"]["Great seeing @OppVillageLV! Their profound work helps those w/ disabilities realize career goals through vocational training &amp; employment. https://t.co/Ox0IMXp9vT"]["Delighted our Filipino Veterans of WWII were presented with the Congressional Gold Medal today. We are forever grateful for your service. https://t.co/9vbPsi1aFe"]["Enjoying our public lands is a way of life in NV &amp; shouldn't be sold off to highest bidder. Tell @BLM what you think https://t.co/rNnTByoSLH https://t.co/NlAAwo2rRv"]["Loopholes in our background checks system make us all less safe. Congress must pass the Background Check Expansion Act to reduce gun safety https://t.co/74T1t1Slzg"]["Background checks work, but major loopholes mean that ¼ of all guns are acquired without one. Congress must pass expanded background checks. https://t.co/qWk4hMRarH"]["If a person can’t pass a background check, they shouldn’t be able to buy a gun. It should be that simple. RT if you agree!"]["It's past time to get something done to reduce gun violence across this country. Let's do that by passing universal background checks."]["This is just commonsense, this is about reducing gun violence, this is about protecting our families."]["The right to own a gun must also be weighed equally to the right of Americans not to be killed by someone who has no business owning one."]["This is not about banning or taking away guns. I believe Americans have the right to own guns. My husband and I are proud gun owners."]["I don't speak for myself. I speak for the majority of Nevadans who voted to pass Q1 ballot initiative on background checks for gun sales."]["I support background checks that help keep weapons used to kill out of the hands of the severely mentally ill, criminals &amp; terrorists."]["I've been an advocate for commonsense gun safety measures since my time as NV's AG. I know law enforcement supports reducing gun violence."]["HAPPENING at 2pm ET/11am PT --&gt; Joining @ChrisMurphyCT to intro the Background Check Expansion Act. Watch LIVE: https://t.co/E7WhGHVmTn"]["We must work to reduce gun violence. The vast majority of Americans support background checks. Congress is the only place this is an issue"]["Nearly 30 million Americans still don't have health insurance. We need a #StatePublicOption to #UnlockMedicaid and close the gap."]["@SenBrianSchatz Over 300,000 Nevadans gained access to care through #Medicaid expansion. #StatePublicOption would give NV the choice to buy into Medicaid."]["#Medicaid expansion has been hugely successful in NV. We must build on this success. Proud to join @SenBrianSchatz #StatePublicOption bill. https://t.co/MbEpiT29I5"]["It's time to keep the door wide open. It's time Congress immediately take up &amp; pass the DREAM Act to #ProtectDreamers. #HereToStay"]["DREAMers are our future doctors, lawyers, engineers, business owners, soldiers, &amp; leaders. We will not send 800k kids back into the shadows."]["If these young men &amp; women - who are active members of our workforce - are deported, NV's economy would lose $585 million every year."]["Businesses across U.S. from Silicon Valley to Wall Street to ranchers &amp; cattlemen in rural NV know this is bad economics. #ProtectDreamers"]["Trump rescinding #DACA doesn't fix our broken system. It bullies vulnerable, hardworking immigrants &amp; their families. #ProtectDreamers"]["I've met some of the 13k DREAMers in NV and they're incredible. People ask me: \"what would you tell DREAMers?\" I tell them they belong here"]["I'm here today because my grandfather had the courage to come to this country from Mexico. We should not be shutting the door behind us."]["94% of DACA recipients pursued higher education thanks to the program. The #DreamAct would continue to provide that access. #ProtectDreamers https://t.co/My4wSWkPyD"]["Tonight, my #GOP colleagues sent a clear message to #BigBanks &amp; large corporations: It's okay to deceive and cheat hardworking NV families."]["Reconnecting with former @Creech_AFB Commanding Officer, Gen. Cunningham &amp; discussing Asia Pacific threats in new role at Kadena AFB. https://t.co/Xoo1F1nWuQ"]["#Senate passed emergency funding is a good first step in wake of 3 horrific hurricanes &amp; CA fires, but more needs to be done to help rebuild"]["@CFPB @Equifax @WellsFargo The @CFPB's simple, straightforward rule will stop the abusive #RipoffClause practice. But the #GOP is working hard to protect it."]["@CFPB @Equifax @WellsFargo Buried deep in fine print of contracts are #ForcedArbitration clauses that force consumers to give up their right to have their day in court"]["The @CFPB protects consumers &amp; holds the #BigBanks &amp; places like @Equifax @WellsFargo accountable when consumers are taken advantage of."]["As AG, I took on the #BigBanks that preyed upon NV homeowners &amp; brought back $1.9 billion in relief to Nevada hardworking families."]["The #VegasStrong Resiliency Center is open for those impacted by #1October, seeking assistance and counseling. Location: 1524 Pinto Lane. https://t.co/aC1rRw9Pog"]["It's been over 3 weeks since #1October. There are commonsense steps we must take to reduce gun violence. The status quo isn't saving lives. https://t.co/eW6OotkHW2"]["Hispanic communities need their timely news today more than ever. I hope @Univision and @verizonfios come back to the negotiating table."]["Thank you @RenoFireDept for helping to keep our neighbors safe. #Senate must get CA the funding it needs to recover. https://t.co/rMjk9gO1DJ"]["KS state tried a similar #TrumpTax plan &amp; it hurt Mike, a Republican farmer. The GOP ought to be listening to hardworking Americans like him https://t.co/5I7BiBIEAe"]["REMINDER: Only a week left to get your application in for nomination considered to a U.S. Service Academy. Apply: https://t.co/jcyPFo3WjJ"]["OPENING TODAY: #VegasStrong Resiliency Center to assist those impacted by #1October. Located at 1524 Pinto Lane; hours are 10am-7pm. https://t.co/kquSPceMUZ"]["Had the best time at the Pride Festival, celebrating love &amp; the profound impact our LGBTQ community has on the great City of Las Vegas! https://t.co/XNHK9S7Dwz"]["On #NationalMammographyDay, reminding women everywhere of the importance of regular mammograms for early detection. It could save your life."]["I couldn't agree more! Many of the reasons why I'm so proud to call #LasVegas my hometown right here in this video. Check it out @JeffBezos! https://t.co/mrhEgsrY0i"]["Rural NV's facing a shortage of healthcare options &amp; many are not getting the care they deserve. #MedicareX's public option will help fix. https://t.co/ImdJwBgB05"]["Office Hartfield was a father, husband, veteran, youth football coach, &amp; a true hero. Grateful for his service to our country. #VegasStrong https://t.co/QkESCNWDOY"]["The dangerous #GOPbudget just paved the way for a \"#taxreform\" bill that will inevitably only further deepen the pockets of the wealthy few"][".@SenateGOP jammed through a reckless budget that guts Medicaid/Medicare that 100s of 1000s of Nevadans rely on, all for tax cuts for rich."]["#ArticRefuge drilling revenue covers &lt;1% of #GOPbudget tax cuts for the rich &amp; at risk of being given away to #BigOil. #ProtectTheArctic"]["REMINDER: Tomorrow, 10/20, is the last day property from #1October shooting can be recovered at the Family Assistance Center from 9am-7pm PT https://t.co/eQIa7oKm9i"]["Proud to join you to express loud and clear that reproductive healthcare decisions should be made by a woman &amp; her doctor, not men in DC. https://t.co/hCCbVB35rj"]["80% of #PuertoRico is w/out power &amp; 3/10 lack access to safe drinking water. Not a perfect score by any standard, @realDonaldTrump #FakeMath https://t.co/bmRlH2wz4e"]["To all Nevadans interested in attending a U.S. Service Academy, don't forget the deadline is 10/30 at 5pm PT! Apply: https://t.co/jcyPFo3WjJ"]["Proud to cosponsor #MedicareX to help deliver quality, affordable care to every Nevadan, no matter their zip code --&gt;https://t.co/iB9L29K9Zc"]["#GOPbudget will cut #Medicare by nearly $500 billion &amp; gut #Medicaid by $1 trillion. This will hurt Nevada families who need them for care."]["In letter request w/ @SenDeanHeller to @TheJusticeDept: NV needs more funding to cover overtime costs for ongoing #1October investigation. https://t.co/GEDR4tCdOh"]["¡Porque las mujeres y niñas pueden ser las líderes e innovadoras del futuro! Nuestra economía se beneficia cuando todos contribuyen. https://t.co/3q7faQQ24N"]["Today on Senate floor, I called on Congress to summon the strength &amp; finally do something to reduce gun violence --&gt;https://t.co/ThZo2PXCr7"]["HAPPENING SOON: I will be delivering my maiden speech on the #Senate floor. Watch LIVE at 5:30pm ET/2:30pm PT --&gt;https://t.co/J85JS3VQY9"]["I applaud efforts to make NV greener &amp; help ease travel in rural NV for EV owners. My #SMARTcities bill will help. https://t.co/KGLcNGbLBx"]["My friend @SenatorReid has given me lots of great advice, but one thing in particular has really stuck with me --&gt; https://t.co/Oef38HTxmQ"]["2:30PM PT TODAY: I'll be on floor honoring #1October victims &amp; outlining what we can do to help prevent another massacre from happening."]["#AlexanderMurray will help stabilize market &amp; ensure families' premiums won't rise. A good step in right direction. https://t.co/xQ2Oi67TRP"]["In letter request w/ @SenDeanHeller to @SocialSecurity: Submit a formal public notice how it intends to assist #1October victims &amp; families. https://t.co/eL2OxQBDYW"]["Reno team attending #LiteracyIsTheCure launch; @uwnns mission to help ensure all children across NV are reading at grade level by 3rd grade. https://t.co/qDf1UavpPS"]["Excellent news! A big welcome to you! And NV's first professional women's team to boot. Look forward to watching you play! #HomeMeansNevada https://t.co/ngMRzzlTYz"][".@realDonaldTrump said Rs who want to cut Medicaid \"are wrong.\" #GOPBudget guts it by $1 trillion. Explain that --&gt;\nhttps://t.co/jRYW58KVO1"][".@realDonaldTrump intends to declare the #opioidcrisis a national emergency. #Medicaid's on frontlines fighting it, yet #GOPBudget guts it. https://t.co/yawY0xsl2F"][".@Equifax breach compromised 1.3+ million Nevadans' info. Reclaiming your identity could have a lifelong impact. This is why it's egregious. https://t.co/qXhCwREKMV"]["The Senate is now debating the #GOPBudget. Curious how it will help the hardworking middle class families of Nevada? Spoiler alert: It won't https://t.co/ovlpVJkpCN"]["Proud to intro legislation w/ @SenCapito to help encourage young girls to pursue an education or career in STEM--&gt;https://t.co/RWCwrZQXLx"]["Attended the 926th Air Force Reserve Wing Change of Command @NellisAFB. Thank you for your leadership, Col. Anderson &amp; welcome Col. Schultz. https://t.co/3DPMee5YWc"]["Proud #Senate passed my &amp; @SenDeanHeller's resolution honoring victims of #1October. We're resilient &amp; #VegasStrong.\nhttps://t.co/9KjMwNIyXI"]["Diversity's not just a checkbox. It's a commitment. Honored to sit down with LGBTQ Congressional staffers to hear their perspectives today. https://t.co/LeTJG2etkR"]["As victims of #1October continue to receive treatment, they should only be concerned with getting better, not pricey out-of-network costs. https://t.co/Q0PGjl5CFR"]["Powerful and amazing. Thank you to all those that came out to show your support. #VegasStrong https://t.co/AQBeyyUX2G"]["Our community is forever grateful for the heroic acts our first responders performed on #1October. Thank you, @RAIDERS for this tribute. https://t.co/Zaz9PwnSri"]["Thank you for having me and working hard to keep us safe! https://t.co/iGwCJsajG5"][".@realDonaldTrump's EO will result in skyrocketing premiums &amp; send the marketplace into a death spiral. Nevada healthcare expert agrees --&gt; https://t.co/HBy3dqBj1f"]["Happy Birthday @USNavy! Thank you to all the brave men &amp; women who've served or are currently serving to keep our waters safe.  #242NavyBday"][".@realDonaldTrump's spiteful &amp; reckless actions will result in skyrocketing premiums &amp; will further undermine the insurance marketplaces. https://t.co/D4ThvhA1PM"][".@realDonaldTrump's actions today will stifle our efforts in countering Iran. He's undermined our national security &amp; our global leadership. https://t.co/XBTUFT328V"]["Once again, @realDonaldTrump is sabotaging our healthcare system. Nevadans cannot afford premium spikes like this. Rs must work w/ Ds to fix https://t.co/KRTQmq5zX7"]["Thanks @AMR_Social @MedicWest for doing the right thing &amp; not charging #1October victims for transpo or medical attention given #VegasStrong https://t.co/K4VSdqCwBw"][".@realDonaldTrump's EO is another attempt at #ACAsabotage. It will further destabilize our healthcare system &amp; create skyrocketing premiums. https://t.co/ZyVnhEyVbz"]["So incredibly touched by this thoughtful, beautiful gesture from our friends in Hawaii. We're grateful for your amazing support #VegasStrong https://t.co/myAXadE0eS"]["In letter w/@SenDeanHeller to mortgage lenders: don't initiate or finalize foreclose on #1October victims &amp; families https://t.co/DKLoObTSzW"]["Thank you to @NVNationalGuard for all of your efforts in helping our neighbors and friends in Puerto Rico. https://t.co/XjT5iyTvZy"]["Joined @SenateDems to urge @NIH to renew the gun violence research program. We need all resources to help end the gun violence epidemic. https://t.co/73VaUNqDBl"]["Reno team @tmccnevada's opening of the Diversity &amp; International Student Center Office that will help facilitate a culture of inclusion. https://t.co/Dd7uHgbfEN"]["Thank you @TheJusticeDept for the much-needed relief for our law enforcement who've been working around-the-clock in wake of #1October. https://t.co/VxgROfkjk2"]["Great visit w/ Spring Valley ER nurses of #1October. Your efforts were heroic. Thank you. And happy #EmergencyNursesDay! Cc: @ValleyHealthLV https://t.co/hFqvM8NQj6"]["Thank you to the brave men &amp; women of @ClarkCountyFD who were on the scene on #1October working hard to save lives. #VegasStrong https://t.co/MaX2vLKAt8"]["@BloodHeroes If you can, please donate. Victims of #1October shooting will need them in the weeks &amp; months to come. Make an appt: https://t.co/VzImdoREE6"][".@BloodHeroes has received over 3,400 blood donations following #1October w/ 51% being first-time donors. Amazing. Donations is biggest need https://t.co/ERM0lZbbow"]["Incredibly powerful tribute to our community. Continue to be grateful to first responders, law enforcement, medical personnel, &amp; all vols. https://t.co/rXYTl5zIjd"]["@amprog I want DREAMers in NV &amp; in the LGBTQ community to know something: You are not alone. You belong here. You are equal. You are American."]["@amprog One thing we don't hear enough about is the incredible contributions DREAMers make to our communities. DREAMers are hardworking."]["@amprog Same-sex relationships are criminalized in nearly 80 countries. Even countries without anti-LGBTQ laws are still dangerous for LGBTQ people"]["@amprog DREAMers who identify as LGBTQ could face harsher discrimination &amp; violence if they are sent back. For them, this is about life and death."]["@amprog In NV alone, we have 13,000 DREAMers and 577 of them identify as LGBTQ. Trump's cruel actions against them is a disgrace. #ProtectDreamers"]["Joining @amprog on call against Trump's actions to play w/ the lives of 800k DREAMers &amp; the threat it poses to 75k LGBTQ DREAMers in U.S."]["Stopped by @Allegiant to thank them for doing the right thing &amp; providing nearly 200 free flights so far to folks impacted by #1October. https://t.co/WkA5ypISkA"]["Concert-goers from #1October in Section C can retrieve personal belongings \nat South Hall of Las Vegas Convention Center, 3150 Paradise Rd. https://t.co/wyqCIWWdFm"]["Repealing #CleanPowerPlan is a major threat to public health, neglects to address climate change, &amp; will hurt NV's clean energy economy --&gt; https://t.co/nXCNBcRd6t"]["Praying for the safety of our neighbors in CA impacted by the devastating wildfires. Thank you to the first responders working tirelessly. https://t.co/5mxhOg82VI"]["Well said, @LasVegasSun. The compassion &amp; selflessness shown from this community has been remarkable. #VegasStrong\nhttps://t.co/JKbSKeMw5d"]["Best of luck to @GoldenKnights tonight! Thank you for helping to show the nation what an amazing community it is we live in. #VegasStrong https://t.co/air9f6xANT"]["Toured @ValleyHealthLV &amp; met w/ the doctors &amp; nurses who treated victims of #1October. Thank you for working tirelessly to save lives. https://t.co/d5DVGfu5Fu"]["The names &amp; faces of the 58 beautiful souls killed on #1October will never be forgotten. Prayers for their families. https://t.co/YDHyNsR14h"]["We've show the nation we're compassionate. We've stood together since #1October &amp; will continue to. Thanks @VP for joining us in #LasVegas. https://t.co/wx6sNvK5us"]["Another everyday hero who risked their life to help a stranger on #1October. This is #VegasStrong --&gt; https://t.co/Y0JnKjyJ5B"]["Family Assistance Center is open 9am-7pm, located at the Las Vegas Conventiom Center. Can seek help w/ lodging, transpo, counseling &amp; more https://t.co/IX7xPAynZ6"]["The spirit of our young people always gives me hope. Thank you to the students of @Wright_CCSD, you inspire us! #VegasStrong https://t.co/NPfUDIkzaz"]["Excellent news! We needed that after this week. Congratulations, @GoldenKnights! #VegasStrong https://t.co/rdoSA0PK6v"]["Thank you, @NHL. We're grateful for your support and kind words. #VegasStrong https://t.co/nmmRD6QCzn"]["Access to contraception shouldn't be a luxury for those who can afford it. Women's health decisions are theirs to make, not their CEO's. https://t.co/UWmAbr6Boi"]["Thank you for all of your amazing support to help keep us #VegasStrong https://t.co/HaebSi02hg"]["The show of support and unity from our great state is overwhelming. Beyond proud to call Nevada home. #VegasStrong #HomeMeansNevada https://t.co/5OYd4M1rN7"]["Happy to see both teams supporting #VegasStrong tonight as @GoldenKnights play @DallasStars. Compassion is something all teams can support. https://t.co/WcilWQuY5o"]["Blood donations will still be needed in the months to come. Schedule an appt. &amp; continue to help #LasVegas heal: https://t.co/nHRF5WoYms"]["Grateful to all the doctors &amp; nurses who were true heroes this week. Proud of all Las Vegas hospital personnel who work hard to save lives. https://t.co/QT4ynPsq92"]["Learning more how 200+ EMTs of @AMR_Social deployed over 100 ambulances in response to the tragic shooting. Thank you for your heroism. https://t.co/KamUlsKOhq"]["Learning how 200+ EMTs w/@AMR_Social quickly mobilized to respond to Sunday's horrific shooting. Grateful for this incredible operation. https://t.co/8vEw2i5UBh"][".@AMR_Social had over 200 EMTs &amp; over 100 ambulances respond on Sunday. These brave men &amp; women saved many lives. Thank you! #VegasStrong https://t.co/X5r0oCja0X"]["That is right. #VegasStrong https://t.co/D7W4bdrd3X"]["Proud of our community for coming together during such tragedy. Wear silver and blue today in solidarity. #NevadaProud #VegasStrong https://t.co/Rjdim715Q5"]["Some in my Vegas staff joined me to donate blood yesterday. After speaking w/ many in medical community, message is the same: please donate. https://t.co/xwb4Sq6E2Y"]["We cannot thank this incredible community enough. I have never been more proud to call Las Vegas home. #VegasStrong #HomeMeansNevada https://t.co/6CMschgqwW"]["This is amazing. #VegasStrong https://t.co/OaNaA0GWwu"]["Thank you, @NHLBruins. Just like the spirit of Boston would not be broken, nor will ours. We're grateful for the support #VegasStrong https://t.co/LgIU1mX2Ey"]["My statement on the @NRA's announcement today to end the bump stock loophole --&gt; https://t.co/tDNvD4D1Cq"]["We had a massacre that occurred in #LasVegas on Sunday night. We need to do everything we can to bring gun safety measures forward. https://t.co/4DbQyDwL7r"][".@GonzagaLaw, thank you for your kind words. Please encourage any other fellow alums living in NV to donate blood: https://t.co/VzImdoREE6 https://t.co/EbNJthVDUf"][".@LVMPD Officer Hartfield was a father, @NVNationalGuard Sgt. 1st Class, a youth football coach &amp; much more. He will be remembered as a hero https://t.co/R259w2evWu"]["As AG for 8 years, I was very vocal about passing commonsense gun laws. Nevadans are expecting this type of conversation to occur. It has to https://t.co/iuHtbX0RSf"]["I'm so proud of the response from this community. We have so many families mourning &amp; right now, it's about bringing them relief &amp; comfort. https://t.co/mmLN5zKBJl"]["Chatting w/ vols at the blood donation bank I gave at today. They're working overtime to help ensure the need is being met &amp; we thank you! https://t.co/yvZ3UiB7Vl"]["So proud of the overwhelming display of generosity from this community. Just incredible. Thank you! #VegasStrong https://t.co/f9XgINA8MU"]["After meeting with the medical community, all have said: Most important need is to give blood. Join me in channeling our grief for the good! https://t.co/RN6ZiVqCiY"]["Proud of the support from this community &amp; to all that have given blood. That need will be greatest in weeks ahead. https://t.co/8mMVvWOeVb"]["I will be joining @mitchellreports on @MSNBC LIVE from #LasVegas soon."]["Beautiful. Continue to be in awe of this incredible community. We are in pain &amp; hurting, but our spirit still shines bright. #VegasStrong https://t.co/2m3CEWDjW1"]["Saddened to learn of the passing of Don Carano today. His generosity &amp; incredible contributions to northern NV will always be remembered."]["Joined @SenFeinstein's bill to close \"bump stocks\" loophole that turns a semi-automatic into a fully automatic, as seen in #LasVegasShooting https://t.co/J9o3YsLmxS"]["After talking w/ many in the medical community, one theme made clear to me: The biggest need is blood. Please donate https://t.co/VzImdoREE6"]["You did do the right thing. But you're also a hero, #JonathanSmith. You represent the best of human kind. Thank you https://t.co/BC1ACm0Gnp"]["Grateful to these @NellisAFB servicemembers for protecting these lives. Continue to be proud &amp; grateful for the heroic acts seen on Sunday. https://t.co/uCuD6E0TVN"]["Thank you for doing amazing work for our community during this difficult time #VegasStrong https://t.co/ea6UCfz8tl"]["I've talked to first responders, law enforcement, doctors, &amp; concert-goers that all worked to save lives. They portray the best of humanity."]["Couple of those is the big heart &amp; community. @BloodHeroes will be hosting blood drives @unlv. Please give if you can. This is biggest need. https://t.co/Wp3lL3JcSQ"]["Critical resources available to all those impacted by the #LasVegasShooting. @LVMPD's working tirelessly to assist: https://t.co/UbYyKXWirz https://t.co/zoFDFWahZJ"]["I've met some of the 13k DREAMers in NV and they're incredible. People ask me: \"what would you tell DREAMers?\" I tell them, you belong here."]["If your #DACA expires, you must overnight your renewal documents TODAY to be received by tomorrow's, 10/5, deadline https://t.co/fdyPMMvOkb"]["If you're one of the 13k DREAMers in Nevada &amp; your #DACA expires, the deadline to renew is TOMORROW, 10/5. Please get your paperwork in ASAP https://t.co/KiQO4gOvmL"]["Our young people amaze me. I am with you. #VegasStrong https://t.co/0cD5zjBsF7"]["Joined CEO of @SunriseLasVegas, a medical center working to save lives. A VA mobile counseling unit also on site to help victims coping. https://t.co/VtkIBxOhSe"]["Visiting w/ volunteers of @SNVredcross. Their response working to get resources to those affected by #LasVegasShooting has been phenomenal. https://t.co/luFKXOnS8W"]["I was AG for 8 years. I was on the forefront advocating for common sense gun control measures in NV &amp; across country. I'll continue to do so https://t.co/1Efh6uTPbT"][".@lyft @Uber are providing free rides to blood donation centers, hospitals &amp; family resource centers for those impacted in #LasVagasShooting"]["In letter to airlines, @SenDeanHeller and I call on them to help families affected w/ certain fees while they're dealing w/ the unthinkable https://t.co/LFjlYshSqe"]["Our first responders, the medical community, law enforcement, &amp; staff at hotels are coming together &amp; working hard to support #VegasStrong https://t.co/DjkRZEZDDd"]["There are families suffering &amp; looking for hope they'll be connected w/ their loved ones. That's what this is about - bringing them support. https://t.co/H4NI1yz9XH"]["This is most important - the work being done by our medical community to save lives. Continuing to keep all in my prayers &amp; here to assist. https://t.co/HI8bpaaw6u"]["One of the biggest needs is for people to donate blood. Please donate if you can &amp; find a bank near you https://t.co/VzImdoREE6 #VegasStrong"]["If you're looking for or need to report a missing loved one, please call: 1-800-536-9488. @LVMPD is working around-the-clock to assist."]["The selflessness displayed by people pitching in &amp; helping in any way they can embodies the spirit &amp; heart of our great state. #VegasStrong https://t.co/D0pemtGpHZ"]["We must support the ongoing investigation. There will be plenty of time to play politics, but now we must come together, support, &amp; comfort"]["Families are dealing with injured loved ones or the loss of one. We, as a Las Vegas community, are here to bring comfort &amp; relief to them."]["Thank you to our first responders, EMTs, medical community, our law enforcement - everybody who ran into the face of danger to save lives."]["Some on my staff attending a prayer vigil in Reno. Beautiful sight and beautiful sound on this very dark, sad day. #HomeMeansNevada https://t.co/rg1iL4RSEY"][".@unlv prayer vigil tonight. Inspired and touched from the outpouring of love and support shown to our great community. #VegasStrong https://t.co/NyB5kUdiGL"]["Thank you @Uber &amp; Yellow Checker Taxi for doing the right thing &amp; offering free rides to folks affected by #LasVegasShooting #VegasStrong https://t.co/VU99cziSzX"]["There will be a candlelight vigil service held at the Guardian Angel Cathedral at 5pm, 302 Cathedral Drive, near Encore hotel. #VegasStrong https://t.co/bQk6mGQY7t"]["Thank you @lyft for offering free rides to hospitals, blood donation centers, &amp; the Family Reunification Center at the Convention Center. https://t.co/qF2A3xbTtk"]["Tonight at 5pm, there will be a prayer vigil held at City Hall to remember those affected by the tragic #LasVegasShooting #PrayForVegas https://t.co/fceOpHwToZ"]["Thank you, @Allegiant for doing what you can during this time of great tragedy, sadness, and need. #LasVegasShooting #VegasStrong https://t.co/vQPhNypRs4"]["Incredibly heartened to see the outpouring of support for those affected by #LasVegasShooting. You can always find helpers in any tragedy. https://t.co/QrQNmEmYGm"]["If you want to donate blood to victims of the #LasVegasShooting, avoid lines &amp; save time by making an appointment: https://t.co/AS72A4eQ8Y https://t.co/gzUn2ZvqFT"]["On my way to Vegas now. I'll be on ground to support efforts to help those affected by #LasVegasShooting. My office is available to assist."]["Family Reunification Center at the LV Convention Center will host victims' families; provide food, water, and help with hotel &amp; transpo"]["A full list of locations to donate blood to help those affected in the #LasVegasShooting. Thank you to everyone for your help &amp; prayers. https://t.co/CSPVHaNX3l"]["If you're from the Las Vegas area and/or attended last night's concert and on @facebook, please mark yourself \"safe\""]["To locate family members and/or loved ones who attended last night's concert in Las Vegas, please call 1-866-535-5654."]["Praying for all those affected by this senseless tragedy. Thank you to all the first responders. I will continue to monitor the situation."]["To celebrate the 1st #NVPublicLandsDay, access to all @NVStateParks are free today! Find a park &amp; enjoy NV's history https://t.co/9yfyMHJT1B https://t.co/bNujTD9QUV"][".@CarmenYulinCruz, we hear you! @realDonaldTrump listen to this plea. This is a humanitarian crisis. Puerto Rico needs aid now. Do your job! https://t.co/P6wsiF9Yzz"][".@realDonaldTrump attacks on @CarmenYulinCruz are atrocious. Mayor Cruz's defining what true leadership looks like. She's owed aid &amp; apology https://t.co/evxe6YZYeW"]["My Reno staff attended the \"Take Me Home Huey\" project @nevadaart to honor veterans we've lost from suicide, an issue we must address. https://t.co/xqljwFqLmk"]["Wishing our Jewish friends and neighbors in Nevada and across the country a meaningful and peaceful day of reflection.  #YomKippur"]["In letter w/ @PattyMurray @SenateDems, we urge Betsy DeVos to immediately reverse course on her disgraceful campus sexual assault decision: https://t.co/NOwhl2ri4b"]["I hope the next HHS Sec. is focused more on bipartisanship to fix what's not working in #ACA. Americans have real concerns over their care."][".@SecPriceMD, you still owe the American people an explanation and a check for your mishandling of taxpayer dollars. https://t.co/tbKLtF8X0u"]["DREAMers are fellow survivors of these terrible storms. @realDonaldTrump must extend the arbitrary 10/5 deadline for them to request #DACA. https://t.co/nZXmeFR3IZ"]["3.5 million Americans are w/out power, food &amp; clean drinking water in Puerto Rico. This is a public health crisis &amp; must be treated like one https://t.co/Y9RDJ1b4h3"]["NNV law enforcement agencies &amp; community leaders hosted an immigration forum in Reno this week. It's critical immigrants know their rights. https://t.co/4PyjzmiajR"]["Looking for fun things to do tomorrow? Check out one of NV's many state parks for FREE Saturday for #PublicLandsDay! https://t.co/Tvr0U1x7Cg"]["It's shameful to punish our kids b/c of partisan fights in Washington. CHIP is about to expire, leaving 9 million kids w/out healthcare. https://t.co/X46AbF41aK"]["The humanitarian crisis in Puerto Rico &amp; USVIS is dire. The health &amp; well-being of millions depend on swift action. Trump Admin can act now: https://t.co/VoZKJK5xLA"]["Packed house at dinner for the @NVNACO annual conference in Winnemucca last night. Reno team's learning how best to coordinate w/ local govs https://t.co/ar8Eknamw9"]["As Nevadans, we love our public lands. It's part of our history &amp; way of life. My Reno staff is learning all there is to enjoy while @NVNACO https://t.co/0m2v2p6ueE"]["Proud to see the generosity of the Las Vegas community helping our loved ones &amp; neighbors after #MexicoEarthquake -&gt; https://t.co/33RFdZA1YA"]["I made sex trafficking a crime as AG but it's not in all states. Authorities ought to be able to coordinate &amp; prosecute as one when it's not https://t.co/PYOQguPKB5"]["Does your #DACA expire between now and March 5, 2018? Submit your renewal application before October 5, 2017 ASAP→ https://t.co/fdyPMMvOkb"]["Our neighbors in Puerto Rico &amp; the U.S. Virgin Islands are American citizens. We must ensure they're not neglected. Here's how we can help: https://t.co/uwK13pqxwx"]["@AjitPaiFCC The one million comments submitted to @FCC around maintaining an open &amp; free internet ought to be reviewed seriously by @AjitPaiFCC."]["I have serious concerns about the whole process @AjitPaiFCC is leading to potentially harm a free and open internet #NetNeutrality"]["Alongside the champion of the #DREAMAct, @SenatorDurbin, we're calling on Senate to take up &amp; pass the #DREAMAct. We must #ProtectDreamers. https://t.co/ramdrhuCUj"]["Congress must work together to secure funds for search, rescue &amp; recovery operations for our neighbors in Puerto Rico &amp; U.S. Virgin Islands."]["The aftermath of #HurricaneMaria will be felt for decades. Puerto Rico &amp; U.S. Virgin Islands needs assistance ASAP--&gt;https://t.co/Bc5zcntO9r"]["I'm calling on GOP to stop effort to overturn a critical rule that helps consumers seek justice against bad actors: https://t.co/Q2NnuXtrez"][".@realDonaldTrump had this to say about this new tax plan: \"it's not good for me.\" I'm more interested in knowing whether it's good for NV. https://t.co/qhPGnf7H70"]["The wealthiest few would be the real winners w/ GOP's tax reform framework, providing little relief to NV's working families. #TrumpTaxScam"]["@SenatorDurbin My grandfathers had the courage to come to this country. My story is no different than anyone else's. So why do we shut the door behind us?"]["@SenatorDurbin Businesses across U.S. from Silicon Valley to Wall Street to ranchers &amp; cattlemen in rural NV know this is bad economics. #ProtectDreamers"]["@SenatorDurbin Rescinding #DACA doesn't fix our broken system. It bullies vulnerable, hardworking immigrants &amp; their families. #ProtectDreamers"]["@SenatorDurbin If these young men &amp; women, who are active members of our workforce, were deported, NV's economy would lose $585 million every year."]["@SenatorDurbin I've met some of the 13k DREAMers in NV and they're incredible. People ask me: \"what would you tell DREAMers?\" I tell them, you belong here."]["Joining @SenatorDurbin &amp; first responder of #HurricaneHarvey - a DREAMer - on call to urge the GOP to immediately take up &amp; pass #DreamAct"]["Learn more on how best to seek grant opportunities through my office. Reno staff now helping @NVNACO at conference https://t.co/m32kbTePPA https://t.co/SQm3WFmItk"]["The deadline to renew your #DACA status is October 5th. Do it now→ https://t.co/fdyPMMvOkb #ProtectDreamers"]["Big companies are trying to use fine print to silence Nevadans. We must protect consumers, students, &amp; our servicemembers' access to justice"]["We can't let these big companies off the hook! The @CFPB's rule gives Main Street a fighting chance against the Big Banks &amp; seek justice."]["Since @Equifax breach of 143 million Americans' info, I've received nearly 4 dozen letters from Nevadans seeking justice."]["With at least 54,000 @WellsFargo fake accounts created in Nevada, it's more important than ever that consumers have protections from @CFPB."]["When we let Nevadans have their day in court, it puts another cop on the beat to ensure Big Banks can’t gouge borrowers w/ tricks &amp; traps."]["Whether it's fake accounts from @WellsFargo or @Equifax data breach, consumers need access to justice system &amp; have their day in court."]["The @CFPB issued a simple, straightforward rule that safeguards the right of every single American consumer to hold Big Banks accountable."]["In its short life, the @CFPB has returned $12 billion to 29 million consumers. In NV, the CFPB has worked to resolve about 14,600 cases."]["As NV's AG, I took on the Big Banks that preyed upon NV families, bringing back $1.9 billion to NV. Now, @CFPB looks out for consumers."]["Fraud shouldn't be kept secret like in @WellsFargo scandal - American people need @CFPB rule so companies don't take advantage of consumers."][".@CFPB’s rule banning forced arbitration guarantees consumers their day in court to hold the worst companies accountable."]["Joined @SenateDems to push Trump Admin to extend the renewal deadline for #DACA recipients affected by hurricanes --&gt;https://t.co/CXAOr7oqkK"]["#PuertoRico &amp; the U.S. Virgin Islands are on the verge of a full-blown humanitarian crisis. They deserve the full support of our government. https://t.co/dlqt6fh9UY"]["Honored to meet w/ Jillyn Pendleton, NV's Principal of the Year from my alma mater, @ClarkChargers! Great to hear about her amazing work. https://t.co/r0mTFP1OUV"]["Before the #ACA, Indian health services denied tribal members' claims for basic &amp; preventative care. We must work to ensure we never go back https://t.co/RECZWR5OMS"]["Does your #DACA expire between now and March 5, 2018? Submit your renewal application before October 5, 2017 ASAP→ https://t.co/fdyPMMvOkb"]["Now that @SenateGOP has abandon efforts to rip care away from 32 million, it's critical we work together to fix what needs fixing in #ACA."]["Thanks to everyone that used your voice to help us kill #GrahamCassidy. The power of our voices should never be underestimated. https://t.co/LKH6PaJ7is"]["Cassie in NV relies on @PPFA for affordable care. #GrahamCassidy defunds Planned Parenthood, which would leave her w/ little access to care. https://t.co/WOrcCBiZdK"]["Does your #DACA expire March 5, 2018? If so, you must renew by 10/5/17. My office has helpful resources to do so: https://t.co/8RTIdUmQSD"]["What does #GrahamCassidy's #Trumpcare do? None of these things. If you want to protect your healthcare, tell your senators to vote NO! https://t.co/tvpqzabs1D"]["Follow along LIVE at 6:00pm ET/3:00pm PT while I discuss how reckless #GrahamCassidy's #Trumpcare would be for NV: https://t.co/OvmTRDQuDZ"]["Kari's an RN who works at a hospital in Las Vegas. She says if the #ACA's repealed, her emergency rooms will be overrun w/ the uninsured. https://t.co/QHPGSb2KBG"]["Victoria, a @PPFA organizer in NV worries that if #GrahamCassidy passes, the 18,000 patients they see every year would be left w/out care. https://t.co/vMuMwzhWzw"]["#GrahamCassidy eliminaría o debilitaría las protecciones para más de 1 millón de nevadenses con condiciones pre-existentes."]["Reverend Hansen from Las Vegas, NV is right. #GrahamCassidy would decimate the progress we have made. #GrahamCassidy is an unjust proposal. https://t.co/izfGDPj0yR"]["#GrahamCassidy is not about Republicans and Democrats, it's about life and death. @SenateGOP, stop playing politics with healthcare."]["#GrahamCassidy is not about Republicans and Democrats, it's about life and death. Stop playing politics with healthcare."]["#GrahamCassidy disproportionately affects our most vulnerable. Time to stop playing politics at the expense of children, seniors &amp; the poor."]["American families are hurting. We need less partisanship, more cooperation to lower healthcare costs. Vote no on #GrahamCassidy."]["Nevadans deserve better than a bill that will deprive them of care they need. Let's work to expand access, not diminish it. #GrahamCassidy"][".@SenateGOP is wasting time on #GrahamCassidy. Instead, we need to work together to stabilize markets to help as many people as possible."]["Pastor Johnson of Boulder City, NV, is concerned her son would be denied coverage b/c of his seizure disorder if #GrahamCassidy is passed. https://t.co/WAdtSoLaAy"]["No CBO score, no vote. @SenateGOP, stop trying to pass this bill without bipartisan support, transparency. #GrahamCassidyNO"]["#GrahamCassidy does nothing to help Nevadans. It was written to satisfy the bad hombre sitting in the White House."]["#GrahamCassidy would restrict access to maternity care, raise prescription drug prices, &amp; deny mental health treatment services to Nevadans."]["#GrahamCassidy shows how low @SenateGOP is willing to go to repeal the #ACA. Stop playing political games &amp; do your jobs."]["A vote for #GrahamCassidy is nothing less than a vote to take away lifesaving, affordable health care from thousands of Nevadans."]["Having healthcare brings peace of mind. Ripping it away from people is simply cruel. Tell your reps #GrahamCassidyNO! We're down to the wire"]["Bishop Edwards in NV says #GrahamCassidy has no winners. He says it's not only bad public policy, but it's even worse morality. He's right. https://t.co/L53S0kYufb"]["Just when you thought #Trumpcare couldn’t get any worse, it does in the form of #GrahamCassidy. Tell your representatives: Enough is enough."]["Eric from NNV tells us how #GrahamCassidy would throw rural NV to the curb. We need to end this assault on hardworking families &amp; keep #ACA. https://t.co/jAeF8Z0HbY"]["Voting for #GrahamCassidy w/o @USCBO review is careless &amp; irresponsible. What is @SenateGOP trying to hide in their bill? Tell your reps NO!"]["Shaun of NNV has seen firsthand how the #ACA provided healthcare for thousands of Nevadans who would not otherwise get the care they need. https://t.co/5BKzauR8Sd"]["Did you know #GrahamCassidy would strip Nevada of as much as $2 billion in federal funds by 2027? Call your reps and tell them to vote NO! https://t.co/PPXWbmRU6H"]["Nevada has too much to lose under #GrahamCassidy. We must defeat it for our state's well-being. https://t.co/u4FZdZx1Kh"]["To secure a political win, @realDonaldTrump is putting the lives of tens of millions of Americans at risk. Stop #GrahamCassidy."]["#GrahamCassidy will take away healthcare from 158,000 kids in my state. I'm going to fight to make sure it doesn't pass. Speak out!"]["#GrahamCassidy is not dead. We must double down our efforts! Flood the phone lines &amp; tell your Senator to vote NO: 202.224.3121"]["After battling cancer, Joe of NV credits #ACA &amp; #Medicaid for saving his life. His warning if #GrahamCassidy passes: https://t.co/OvmTRDQuDZ"]["Under #ACA, Nevada has more $$$ for maternal &amp; mental health, substance abuse treatment, &amp; lowered Rx costs. #GrahamCassidy takes us back."]["Dems in Congress have tried to work with Republicans to fix #ACA. #GrahamCassidy does nothing but create more problems and harm Nevadans."]["#GrahamCassidy allows Nevadans w/ preexisting conditions to be discriminated against, raises health costs, &amp; lowers quality. RT &amp; speak out!"][".@realDonaldTrump gutting campus sexual assault protections will go down as one of the great civil rights crisis of our time. https://t.co/Ed7Bn489TS"]["#GrahamCassidy is like the Hunger Games. The Capitol gets to pit seniors, kids, &amp; the sick against each other. https://t.co/2CKlRPlbLk"]["If you don’t want to lose access to care, pls make your voices heard! The fight to protect our care is on. Tell your reps #GrahamCassidyNO! https://t.co/7oRPMlHjE8"][".@SenJohnMcCain's doing the right thing, but the fight isn't over. #GrahamCassidy could still pass. Keep speaking out! Tell your reps NO! https://t.co/kxrGPb9NXR"]["NV's fought hard for access to substance abuse treatment. #GrahamCassidy would reverse all progress in helping to fight the #opioidcrisis https://t.co/8ub9eXvxYJ"]["#GrahamCassidy ends #Medicaid as we know it. This would devastate Nevada's rural hospitals &amp; the communities that rely on them. #KillTheBill https://t.co/BpvvoQ4HOW"]["NV's @lpackard's battling stage 4 cancer. @realDonaldTrump tried to silence her by blocking her. Not going to happen. RT so he hears her! https://t.co/kQ3NndMxpw"][".@GovSandoval is spot on. #GrahamCassidy's a false choice &amp; pits NV's most vulnerable against one another. This bill will take NV backwards. https://t.co/EKEm7A7hYb"]["If you or someone you know has a pre-existing condition, you could be denied coverage under #GrahamCassidy. Tell your reps to vote NO!"]["In June &amp; July, you called, wrote, tweeted at the GOP to demand they lay off your healthcare. We need your voices again! #GrahamCassidyNO"]["Since 5/5 when Republicans introduced their first version of #Trumpcare, my office has received 7,350 letters OPPOSING it. #KillTheBill"]["89% of healthcare calls to my office since 5/5 have strongly opposed #Trumpcare. Call your reps &amp; tell them to vote NO on #GrahamCassidy!"][".@jimmykimmel knows #GrahamCassidy's version of #Trumpcare would be catastrophic. RT if you're with Jimmy. https://t.co/MiUk8oUM7b"]["NV’s @lpackard is battling stage 4 cancer. #GrahamCassidy could take her care &amp; life. @realDonaldTrump won't listen. RT to make sure he does https://t.co/j4UfbnL6o1"][".@GovSandoval signed #Medicaid expansion into law, granting 328,000 Nevadans healthcare coverage. #GrahamCassidy would take that all away. https://t.co/oq9NQQFUp8"]["Coverage from #MexicoCityearthquake &amp; #HurricaneMaria is devastating. Praying for our neighbors in Mexico &amp; the Caribbean during this time."][".@realDonaldTrump look @lpackard &amp; tell her that. You can’t. You blocked her. #GrahamCassidy will deny her &amp; millions of Americans coverage. https://t.co/L2seoVSZ1s"][".@BCBSAssociation says #GrahamCassidy \"would increase uncertainty in the marketplace.\" They're right. It’ll destroy rural health care in NV. https://t.co/LF1zIIyVYO"]["#GrahamCassidy ends #Medicaid as we know it. 2/3 of seniors in a nursing home rely on Medicaid. This bill would throw them in the streets. https://t.co/S2qiM3A4xO"]["Shanah Tovah! Wishing all our Jewish friends in Nevada &amp; across the country a very happy and blessed New Year. #RoshHashanah"]["#GrahamCassidy ends #Medicaid as we know it. If passed, kids will suffer. https://t.co/i1bytkybYm"]["Less care, higher cost. Substance abuse, maternity, mental health &amp; prescription coverage on the chopping block #GrahamCassidy = #Trumpcare. https://t.co/4M8p4gQcve"]["#GrahamCassidy fails the #JimmyKimmelTest. https://t.co/dfAmA16CPF"][".@SenRonJohnson is right. We have more than enough information to know how dire #GrahamCassidy will be for Nevada families. https://t.co/f1IzhfPGVw"]["#GrahamCassidy would eliminate #ACA tax credits that help nearly 64k Nevadans afford healthcare. This reckless bill is not one NV can afford https://t.co/hbmnvXWv8S"]["The Senate will bring up the worst version of #Trumpcare for a vote next week. We NEED to stop it now. https://t.co/aLiodBPl1B"]["If #GrahamCassidy passes, 243k Nevadans will lose lifesaving care. This bill is evil &amp; if passed, people could die. This is not hyperbole."]["@SenateGOP is in a dead sprint to repeal #ACA w/ #GrahamCassidy in next 10 days. This is the most dangerous we've seen. Time is running out."]["#GrahamCassidy is the most radical of any #Trumpcare bills we've seen. The gist: If this passes by 9/30, 32 million will lose their care. https://t.co/wu2DAsQKMa"]["The ugly reality: #GrahamCassidy is the worst of all #Trumpcare versions &amp; we only have 10 days to kill it. We must mobilize &amp; speak out! https://t.co/iqrHISaaVv"]["The only way we'll improve upon what's not working w/ the #ACA is by working in a bipartisan fashion. Anything different could mean disaster https://t.co/W3NboAvXJq"]["Nevadans made their voices clear the last time the GOP tried to repeal the #ACA: They want to keep their healthcare!"]["Now that @SenateGOP has a deadline to repeal the #ACA, they're more hell-bent than ever. RT to tell them you want to keep your healthcare!"]["Importante recurso para los nevadenses que tienen familia en México y aún no saben de su paradero --&gt; https://t.co/KJIasSi6vc"]["Thinking of our Mexican friends and neighbors after this horrific earthquake. Sending my thoughts and prayers to the people of Mexico. https://t.co/7wR6TjKCMa"]["Thanks @GovSandoval for standing up for Nevadans that rely on #Medicaid or have a pre-existing condition. #GrahamCassidy's reckless for NV. https://t.co/XwSLbHIRsu"]["If you have a pre-existing condition, #GrahamCassidy's version of #Trumpcare could deny you coverage or charge you more. This bill's a sham https://t.co/d4E2VwICSZ"][".@SenateGOP will force a vote on #Trumpcare before 9/30 w/o having a clear sense of its impact. This is the height of irresponsibility. https://t.co/oLuTqea68I"]["Another @Equifax data breach revealed. I've called for a hearing in @SenateCommerce to get to the bottom of this. Consumers deserve answers https://t.co/mRSJmyLrbs"][".@realDonaldTrump's immoral #TransBan promotes discrimination in our military &amp; is harming its readiness. https://t.co/6R5SrC6LTx"]["Proud to announce $190 million for NV in the #NDAA. @SenDeanHeller &amp; I worked to ensure our military facilities have the resources they need https://t.co/mKOZ6qZpAG"]["My amdts in #NDAA passage will strengthen our military &amp; ensure our men and women in uniform have the resources they need to keep us safe. https://t.co/eMjCBBBhPx"]["#GrahamCassidy would end #Medicaid as we know it. #GOPs last ditch effort to repeal the #ACA is just as reckless as the ones before them. https://t.co/Cw6KYBPQDN"]["To the brave men and women who've served in the @usairforce - thank you for your service &amp; sacrifice. You inspire us always. #USAF70 https://t.co/AYOcJJfl0l"][".@SenateGOP's latest version of #Trumpcare is a disgrace. #GrahamCassidy would end #Medicaid as we know it. We must keep fighting for #ACA. https://t.co/okTpIjFurq"]["Alarming statistics in NV. I'm working w/@DeptVetAffairs to ensure vets access suicide prevention resources &amp; care. https://t.co/PcudmhMpnD"]["Great tour of @ReedRaiders HS Enterprise Project this weekend. Thanks for all you do to get our students ready for college &amp; future careers! https://t.co/16MD78BBHY"]["Small businesses keep our economy growing in NV. It's critical we support them. More from my visit w/ @RSChamberNV: https://t.co/N7IPJXjbIv"]["We won't kick 800k DREAMers out of the only home they know. Congress needs to act &amp; that means passing the #DREAMAct. More w/ @Refinery29: https://t.co/w02uTDxhTC"]["As a Mexican American, #HispanicHeritageMonth is special to me. In NV alone, Hispanic culture has shaped our communities &amp; made us stronger https://t.co/6E5gfoAsrr"]["My #LasVegas staff attended the National #POWMIA Recognition Ceremony @NellisAFB to remember our brave vets taken prisoner or still missing. https://t.co/2Ceek5feei"]["Discussed opportunities &amp; challenges confronting @RSChamberNV and unveiled new small biz guide. Chamber is essential partner to NV's economy https://t.co/VWu8NCtNZh"]["My bill w/ @SenatorBurr will encourage transportation innovation in our communities big &amp; small. #SmartCities https://t.co/eiu4PAIkK6"]["While, @realDonaldTrump wants to deport #DREAMers - my message: You have a right to be here &amp; I'm fighting for you -&gt;https://t.co/QTRnNz7jyq"]["#GrahamCassidy guts #Medicaid by $639 million, a program 640k Nevadans rely on for care. This bill is not for NV. https://t.co/MJfuAmrQtq"]["Proud of @Foothill_HS junior, Noah MacFawn, for pitching in with #HurricaneHarvey relief efforts. You demonstrate the best of Nevada. https://t.co/sFuH5PoFGO"]["Inspired by @RanchoRamsLV students speaking out for #DREAMers. Congress must take up and pass the #DREAMAct. https://t.co/kMuh05q9kE"]["Pleased to intro the Moving FIRST Act w/ @SenatorBurr, which will help address the transpo challenges our communities large and small face. https://t.co/Lp8pzOYPqg"]["This Saturday, 9/16, at 10am @UNLVLaw will host a #DACA renewal assistance fair at the Moot Court Room. Details on what you need to bring--&gt; https://t.co/I8sPFLSGvX"]["Proud my #LasVegas staff joined @RanchoRamsLV to fight for our friends &amp; neighbors. The 13k Nevada #DREAMers make our communities stronger. https://t.co/qtp2KVXaiV"]["Thank you to Edith Windsor for standing up for equality &amp; inclusion for our LGBTQ community. You inspired us all.  https://t.co/E65NfiavF2"]["This statistic is unacceptable. We must do better to ensure all expectant mothers have access to quality, affordable maternal care. #BumpDay https://t.co/gkh5t7MOFS"]["I'll continue to fight for VAWA and the survivors of domestic violence to ensure that no one has to live in fear for their safety. #VAWA23 https://t.co/iIh2V0WGrd"]["NV has become a hub for innovation &amp; tech companies, creating jobs &amp; boosting our economy. NV would be an excellent choice for @amazon's HQ2 https://t.co/cpzz0grqrt"]["100s of thousands of Nevadans gained coverage through #Medicaid expansion. @SenateGOP's scheme to repeal the #ACA would end it as we know it https://t.co/lrudKLLiW2"]["@realDonaldTrump .@realDonaldTrump you can bet I will be fighting like hell everyday to ensure the 13,000 NV DREAMers know they're protected &amp; #HereToStay"][".@realDonaldTrump Wrong. I have &amp; so have the 800k+ DREAMers you've threatened to deport with this heartless &amp; cruel decision. #HereToStay https://t.co/06ECXkxLE0"]["On #SuicidePreventionWeek &amp; every week, my message to everyone struggling with suicidal thoughts and depression is this: You're not alone. https://t.co/MKtfJKNz50"]["Proud these three bills passed the Senate. Combating human trafficking &amp; protecting consumers were two of my top priorities as NV's AG. https://t.co/FvyRLWfROX"]["My amdts to #NDAA address concerns of NV's service members, create jobs, provide scholarships, &amp; demand accountability from this Admin. https://t.co/QllBHIopee"]["Productive discussion today with Lincoln County Commissioners Varlin Higbee and Jared Brackenbury in DC. Thank you for stopping by. https://t.co/rgzcWzcZ63"]["Over 143 million Americans' private info was compromised w/ the @Equifax data breach. Here's how to stay protected: https://t.co/4fpe7e12Do"][".@realDonaldTrump's #MuslimBan is the antithesis of what this country represents - inclusion and opportunity. This is still un-American. https://t.co/XOSnlrveY4"][".@SEC @TheJusticeDept @FTC must investigate whether @Equifax executives sold more than $1.5 million in stocks before its massive data breach https://t.co/f3nIUgQeGy"]["The GOP plan cuts estate taxes for just 50 of the wealthiest in Nevada. That's not a serious tax plan for NV's middle class. #NotOnePenny"]["Proud to see @unlv tied for nation's most diverse university! Diversity is our strength in NV &amp; across this country. https://t.co/IQcrGlEJ7a"][".@ramusaorg is coming to Reno from 9/29-10/1, offering free medical care at the @HealthyWashoe. For more details: https://t.co/9EAKl1BLQr"][".@unlv's offering FREE assistance until October 5 for #DACA recipients needing to renew. For help: 702.895.2080 --&gt;https://t.co/e718bn4hbL"]["Excited to launch my Spanish-language site! It's imperative Nevadans have access to the resources my office offers. https://t.co/R00jpgRVhb"]["Devastation from #HurricaneIrma was felt by millions &amp; 100s of thousands remain in shelters. Here's how you can help https://t.co/U64BIZBYUx"]["143m Americans' info was compromised w/ @Equifax data breech. I urged its CEO to end its forced arbitration clause that's harming consumers. https://t.co/7s6kSd1liq"]["Proud my Las Vegas staff joined to march with #Dreamers. We will never stop fighting for you. The GOP must take up &amp; pass the #DREAMAct now https://t.co/zNf5J5HBAk"]["Thank you to the brave Airmen from @NellisAFB shipped out to Florida to assist in the #HurricaneIrma efforts. We are praying for your safety https://t.co/ML3xNDuI2I"]["Honored @SenKamalaHarris &amp; AfAm female staffers joined me to discuss the best ways we can improve diversity &amp; upward mobility in Congress. https://t.co/qU8Bg5ve1j"]["Proud to see @NVNationalGuard deployed to help with #HurricaneIrma relief efforts. Thank you for your service in FL's great time of need. https://t.co/Hfq84xG0y1"]["For many survivors of 9/11, the physical &amp; emotional scars of that day can never fully heal. We must always remember &amp; honor those we lost. https://t.co/XARtZ8lxvE"]["Trump might want to sabotage the #ACA, but I'll ensure people know how to access care! Open enrollment begins 11/1! https://t.co/pvfEne9F6j"]["The data security breach of 143 million Americans' private information at Equifax is deeply concerning. These consumers deserve answers. https://t.co/p91ulkps2R"]["#XQLive's challenging schools on how best we prepare kids for jobs of the future. Watch @8pm ET! #RethinkHighSchool https://t.co/RW3BCkfS4S"]["#DACA recipients, if yours expires before 3/5/18, you must renew by 10/5/17. @CUNYCitizenship @CSNV1 will help you renew for free! Details: https://t.co/tTKmHbZvpB"]["Encouraged to see @unrmed is working to help ensure our rural Nevada communities have access to quality doctors. https://t.co/tjgJUKDNi4"]["Glad the #Senate agreed to send over $15b in relief to #HurricaneHarvey &amp; #HurricaneIrma victims. Helping communities rebuild is priority."]["This Reno tradition is a must! Congrats, @renoballoon on your 36th year! Here's all you need to know for this weekend's affair --&gt; https://t.co/7drwAhLWkP"]["If Trump didn't want to play politics w/ 800k lives he would've said \"send me this bill.\" We must pass the #DREAMAct https://t.co/JrtLpwdfgH"]["200k U.S. kids could lose their parents if DREAMers are deported. @SpeakerRyan &amp; @SenateMajLdr, fix it. Pass the #DREAMAct now. #HereToStay https://t.co/I2pgSYfg4d"]["You rescinded #DACA. Your disgraceful action unleashed fear in 100s of thousands of DREAMers hearts. I call on GOP to pass the #DREAMAct now https://t.co/zf9mzuwaLJ"]["At 6:30pm ET/3:30pm PT, I'll be LIVE to talk about the urgent need for Congress to pass the #DREAMAct. FOLLOW--&gt; https://t.co/oZCbsPisqv https://t.co/rcXN64eUZm"]["DREAMers contribute to our economy. They are not depressing wages and they're not taking away others' jobs. That is a fact. #DefendDREAMers https://t.co/9vwxpbV0v6"]["People ask me \"What would you tell the DREAMers and these families in your state?\" I would tell them - you belong here. #HeretoStay https://t.co/ymbTf3Y2yc"]["Thanks for your leadership, @TomSteyer. We must work hard to keep immigrant families together. It’s the right thing to do. #ProtectDREAMers https://t.co/xdEpuQSHHU"]["Come out in Reno today at 11am to show you stand with DREAMers - our friends, our neighbors, and the future of our country. #HereToStay https://t.co/cFQuXbbvfM"]["Congratulations, @LuzGrayNV on becoming a U.S. Citizen last week! We are proud you call Nevada home. https://t.co/Lr16qhka3G"]["@realDonaldTrump @SpeakerRyan @SenateMajLdr .@realDonaldTrump has manufactured a crisis. Republicans must now step up to the plate and fix this. We must pass the #DREAMAct now!"]["@realDonaldTrump It's past time for @SpeakerRyan &amp; @SenateMajLdr finally stand up &amp; reject the xenophobic &amp; white supremacists enabling of this Admin."]["@realDonaldTrump Businesses from Silicon Valley to Wall Street to rural communities in NV know this is bad economics. Congress must act &amp; pass the #DreamAct"]["@realDonaldTrump DREAMers are our future doctors, lawyers, engineers, business owners, soldiers, &amp; leaders. We will not send 800k kids back into the shadows."]["@realDonaldTrump .@realDonaldTrump has chosen to target kids in my state. I know these DREAMers. I've met their families &amp; friends. We will not be silenced."]["If @realDonaldTrump had really wanted to show DREAMers \"great heart\" - he would've called on Congress to pass a bill addressing the problem."]["Rescinding #DACA doesn't fix our broken immigration system. It bullies vulnerable, hardworking immigrants &amp; their families. #ProtectDREAMers"]["If these young men &amp; women, who are active members of the workforce were deported, NV's economy would lose $585MM every year. #DefendDACA"]["We are going to get this done and we're not going to stop until we pass the #DreamAct. #ProtectDREAMers"]["It's time for @realDonaldTrump to show heart and work with us to pass the #DreamAct. It's time to stop the rhetoric in the WH &amp; move fwd"]["We will will not hurt our country's economy by losing $433 billion over the next ten years, just so Trump can fulfill a campaign promise."]["What @realDonaldTrump has done is a disgrace to our country &amp; what we stand for. NV has 12k #DACA recipients - our neighbors &amp; our friends"]["I'm here today because my grandfather had the courage to come to this country from Mexico. We do not shut the door behind us."]