["This law is about giving law enforcement tools they need to keep fentanyl out of our country &amp; off OH streets. We must build on this bipartisan momentum &amp; come together to start combatting the addiction epidemic like public health emergency that it is. -SB https://t.co/4Ghufsc4HR https://t.co/i5LCT3bEbi"]["We’ve seen the devastating effects that human trafficking has on communities in OH &amp; across the country. We must do more to protect Ohioans from the most heinous of crimes &amp; to provide justice, restitution, and healing for trafficking survivors. -SB #HumanTraffickingAwarenessDay"]["Dayton, Ohio: “the funkiest place on Earth.” https://t.co/KwFR4ouTWE"]["On the way to the White House to watch President Trump sign the bipartisan INTERDICT Act into law. We’ve been working on this legislation for over a year – and today’s signing is a big step in the fight against opioids. https://t.co/t6mMlPIiMw"]["Couldn’t agree more, @senrobportman. It’s past time for folks in Congress with taxpayer-funded health care to do their jobs and extend #CHIP, so families don’t pay the price. #SaveCHIP https://t.co/Q7aFMyi3Ls"]["Thank you to the Ohioans aiding with relief efforts in communities still cleaning up from this year’s hurricanes. You represent the very best of our state. https://t.co/Oq3hFMurqX"]["@FarmBureau Last year, the Hartschuhs led efforts to collect and deliver farm goods to Kansas ranches devastated by wildfires. Their goodwill and giving spirit inspires us all. https://t.co/fu5xu6lFq2"]["Congratulations to Sycamore’s Greg and Rose Hartschuh – the winners of the @FarmBureau’s Excellence in Agriculture Award. https://t.co/xGbEftplzG"]["@SenatorDurbin @SenStabenow @SenatorHassan @SenateDems 1.5 million workers were promised pensions over a lifetime of hard work. We have a responsibility to keep our promise to protect the retirement they earned. https://t.co/YneOCYoynV"]["Making it harder to vote is a direct attack on democracy. Speaking out today about why it’s so important for the Supreme Court to uphold the Sixth Circuit’s decision that purging voters is against the law - follow along at https://t.co/EAYYbS6f2p. https://t.co/OrwGftuoyM"]["Proud to work with @senrobportman, @ChrisMurphyCT, and @LindseyGrahamSC on our new bill. Taxpayer dollars should support American-made products, and our federal agencies should lead the way in promoting U.S. jobs and products. https://t.co/AvM3X3ZrZ5"]["WATCH LIVE: 101 days after Congress allowed #CHIP to expire, Sherrod again demands that Congress take action. https://t.co/gixxNa9Oi5"]["Law enforcement put themselves on the front line every day to keep us safe – today and every day, we are grateful to you and your families for your work, your commitment, and your sacrifice. #LawEnforcementAppreciationDay https://t.co/do6sfGmvT2"]["Excited to welcome @SenDougJones and @JerryMoran to @SenateBanking! (you may want to brush up on your @RealMeatLoaf lyrics now.)"]["In the 2018 #FarmBill, we must work to improve water quality, preserve the farm safety net, and promote crops grown in Ohio. But above all else, we need to listen to our state’s farmers and work together on this important legislation."]["The @FCC's vote last month to repeal #NetNeutrality was shameful - and Congress must restore these vital rules."]["#NetNeutrality is about whose side we're on - do we stand with big corporations, or with the millions of Americans who depend on the internet to obtain our news, communicate with friends and family, complete homework, and conduct business?"]["Today marks 101 days since #CHIP funding expired. That's 101 days that Congress has let families wake up in fear that their child will lose their health coverage. \n\nThat's unacceptable."]["It’s no secret: Ohio-made cars are the best cars. Congratulations to Honda’s 13,000+ Ohio workers, who made this milestone possible. https://t.co/kN3EWHvB9y"]["By working with @NatlParkService to honor the key sites and moments of the Civil Rights Movement, we can help preserve the legacy and struggle of those who risked their lives to demand full and equal participation in our democracy. -SB https://t.co/N6x3w5qQN1"]["The battlefield cross is a sacred tradition of American service members, and government bureaucracy shouldn't keep Ohio veterans and their families from honoring those who served with this powerful symbol. -SB https://t.co/3nrBEVJ3XM"]["Great to join Sheriff Tharp and medical professionals in Toledo this morning to urge @POTUS to sign our INTERDICT Act into law. We must get more resources to the people who can help stem the flow of fentanyl into Ohio communities. https://t.co/ZDecuMZE4z"]["Congratulations to Jonathan Juravich, @OHEducation’s 2018 Teacher of the Year and one of four finalists for @CCSSO’s 2018 Nat'l Teacher of the Year. People across the U.S. are hearing about the creativity &amp; dedication he brings to his classroom in Powell. https://t.co/A69gq6JEf8"]["Proud to introduce the Bridge Investment Act with @RonWyden and @SenWhitehouse to repair and replace outdated bridges across the country, and promote American jobs."]["Rebuilding bridges across the U.S. will create new jobs and make the country more competitive. But states and cities can’t do it alone – they need real investment to help fix these outdated bridges that clog up our roads and leave drivers at greater risk of an accident."]["The proof. cc: @rollcall https://t.co/J9S3M2AL4G https://t.co/kqUcmC6HoZ"]["It’s past time for folks in Congress with taxpayer-funded health care to do their jobs and extend #CHIP, so families don’t pay the price."]["Congratulations and welcome to @SenTinaSmith and Senator Doug Jones as they are sworn in today. Looking forward to working together to support middle-class families."]["The @vindicator editorial board called Senate’s passage of the INTERDICT Act some of “the best news of the year.” Ohioans know that we need to make every effort to keep fentanyl out of the country and off Ohio streets. https://t.co/9v9bD5tq1C"]["Happy New Year! Time to get to work extending #CHIP, securing the pensions of Ohio workers, making real infrastructure investments, and protecting Dreamers. What are you looking forward to in the New Year?"]["We want to hear from you. What are your priorities in 2018? https://t.co/TwOfGxJY1r"]["There's more work to be done in 2018 from reauthorizing #CHIP, to securing Ohio workers' retirements, to passing a Farm Bill, making hard work pay off, rebuilding crumbling infrastructure, pushing for better trade policy, &amp; protecting the Medicare and SS Ohioans have earned."]["We also brought Ohioans together with the Ohio Women’s Leadership Summit, the Propel Ohio Collegiate Leadership Summit, &amp; 18 Summer Manufacturing Camps in 16 counties. https://t.co/hR9LaC1O94"]["The new laws will:\n-help keep fentanyl out of the US\n-expand education opportunities for Ohio vets\n-hold North Korea, Russia, &amp; Iran accountable\n-help law enforcement hire veterans &amp;\n-create a civil rights network at national parks"]["It's been quite a year in our office. We've worked across the aisle to introduce more than 165 bipartisan bills and sent five of them to the President's desk to become law, along with legislation to protect Ohio military bases."]["Elaine Woloshyn worked to help newcomers to this country make their home in Summit County, and changed so many lives in the process. https://t.co/W7LZ9Jt0EJ"]["I urge President Trump to sign the bipartisan INTERDICT Act into law immediately, so we can give law enforcement the tools they need to keep fentanyl out of Ohio and off our streets. -SB https://t.co/bGyE1BEYCy"]["Wishing a joyous holiday to all those celebrating #Kwanzaa!"]["Any time someone told Butch Lewis, an OH Teamster, that he was working too hard, he replied “It’s my job to keep this company afloat, so we will have a retirement.” Learn more about the bill we named in his honor to protect the retirement workers earned → https://t.co/c52hEMhFFM https://t.co/QfcEjP9QHQ"]["Wishing a very merry Christmas to all who celebrate. And to our servicemembers celebrating at home or overseas – thank you for your service."]["If we truly value a hard day’s work in this country, we can start by keeping the promise to @Teamsters, @MineWorkers, and over a million other workers in this country. We must pass the Butch Lewis Act to give these workers the retirement they earned. https://t.co/Dt0XeH9kEt"]["Great to see the holiday spirit is alive and well with @UAW Local 1112 – setting an example for us all. https://t.co/OykEsZrNoM"]["BREAKING NEWS: the bipartisan INTERDICT Act - which will help keep fentanyl out of the country and off of Ohio streets - is headed to the President’s desk. https://t.co/eMj4U91H2u"][".@AAAnews says that a record-breaking 107 million Americans are traveling over the holidays this year. Looking for a road trip soundtrack or in-flight entertainment? Check out Episode 2 of Canarycast, “Don’t Take What We Earned” → https://t.co/c52hEMzh4m https://t.co/VhUnB6j53P"]["Sent a message to @CDCgov &amp; @HHSGov: words matter. \n\nBanning the use of the words \"vulnerable,” “entitlement,” “diversity,” “transgender,” “fetus,” “evidence-based,” and “science-based\" across @HHSGov is damaging to public health. https://t.co/jCMu0ZhHbT https://t.co/H6FnZOQL8j"]["Urging President Trump to sign our bipartisan bill into law immediately, so we can give law enforcement the tools they need to keep this drug out of Ohio and off our streets."]["Glad that the Senate joined the House in passing the bipartisan INTERDICT Act tonight - Ohioans are dying from overdoses at the second highest rate in the country, and this is an important step in keeping fentanyl out of the U.S. and off Ohio streets."]["Meanwhile, families are living in fear that their children are going to lose health insurance and retired workers are headed into Christmas without any security that the pensions they’ve earned will be there next year. Congress needs to stay here and do our jobs. -SB"]["Congress hasn’t done its job all year long, and now Leader McConnell wants to pass another short term band aid and go on Christmas vacation."]["@GLFOP .@PaariUSA is also calling for the Senate to immediately pass the INTERDICT Act, to help stop fentanyl at our borders. As their letter says, “This holiday season too many seats at too many tables are empty due to the unrelenting flow of fentanyl into the United States.\" https://t.co/kgvALFO2Er"]["Sorry everyone, the livestream cut out. Watch Sherrod’s full floor speech on CHIP here → https://t.co/z5QoiYk2qK https://t.co/Xu9mIFC8zB"]["WATCH LIVE: Sherrod calls on Congress to do its job and extend CHIP. “This is about whose side you’re on. Do we work for the corporations that send our jobs overseas, or for the children who may wake up on Christmas morning without health insurance?” https://t.co/d2ID92WPiP"]["@CDCgov Law enforcement need every tool available to keep fentanyl out of the country and off of Ohio streets. Anything we can do to stop fentanyl at our borders will help combat this epidemic - and that starts with passing the INTERDICT Act. https://t.co/MI2bftNsWP"]["This @CDCgov report reveals that Ohio has the 2nd highest death rate by drug overdose in the country, confirming what too many Ohioans already know – the opioid epidemic is devastating our communities. https://t.co/1mZzCXKBlA"]["If we want to give tax cuts to the middle class, let's give tax cuts to the middle class – and this bill doesn't do that. https://t.co/PKtaLYpuGV"]["Thank you @RepMarcyKaptur for sharing these stories. 1.5 million workers are counting on us to pass the Butch Lewis Act so that they can have the retirement that they’ve earned – there’s no time to waste. https://t.co/UU4WcneaE5"]["Grateful to the officers and first responders on the scene. Hoping for a quick recovery of the wounded officer and thinking of everyone involved. https://t.co/l8DuLbxpgX"]["This tax bill will force Ohioans to pay for tax cuts for millionaires and corporations by taking away their healthcare, driving up insurance premiums and forcing cuts to Medicare."]["WATCH LIVE: Sherrod slams the Republican tax bill on the Senate floor. “The American people deserve better, and we can do better for them by starting from scratch with one goal in mind: putting more money in the pockets of the people we serve.” https://t.co/TBxTxqwJYX https://t.co/nM6ECAGLCZ"]["On the way to the Senate floor to speak about who really benefits from this tax bill: millionaires and corporations. Tune in at https://t.co/6WU0F8Su8V https://t.co/1q5BO2f2aO"]["Happy birthday @senrobportman! Looking forward to another year of working together for Ohio (and a rematch on the softball diamond). -SB https://t.co/zczP7mDu2O"]["BREAKING NEWS: tax plan written by former Goldman Sachs execs benefits banks like Goldman Sachs. https://t.co/503m9qIuMK"]["We have lost American jobs because of the games that have been played with the #EXIM Bank. The Banking Committee advanced four qualified nominees for the Board and one for Inspector General, and the full Senate should immediately confirm them. -SB"]["This tax bill takes healthcare away from Ohioans to pay for handouts to millionaires and corporations. That's shameful."]["Great to join Ohio retirees at @Teamsters Local 100 in Cincinnati today. We stand together in calling for Congress to pass the Butch Lewis Act, to ensure that 1.5 million workers can keep the pensions they've earned. https://t.co/kTx4V0OmBA"]["Episode 2 of our podcast Canarycast features two Ohioans at the forefront of the fight for workers to receive the pensions they've earned. One way Congress can value work right away is to pass the Butch Lewis Act and protect these pensions. Hear more → https://t.co/c52hEMzh4m https://t.co/haL8eF29tu"]["And it won’t stop there – Congressional Republicans are already planning to steal the money Ohioans have paid into Medicare and Social Security to pay for the hole they are blowing in the deficit. -SB"]["Tax reform should have been an opportunity to work together to cut taxes for working people. Instead Washington chose to cut taxes for millionaires and corporations and pay for it by cutting Medicare and kicking people off their health insurance."]["You can still sign up for healthcare or change your plan through the healthcare exchange. Visit https://t.co/qYEGrFUPsN or call 1-800-318-2596 before midnight tonight!"]["Wall Street squandered pension money for over a million workers. Now Congress has a responsibility to keep the promise to protect the pensions they earned and to do it this year, before it is too late. We must pass the Butch Lewis Act of 2017. https://t.co/Dt0XeH9kEt"]["Six more reasons to visit Cleveland and the @rockhall - congratulations to @BonJovi, Dire Straits, @NinaSimoneMusic, Sister Rosetta Tharpe, @thecarsband, and @MoodyBluesToday! #RockHall2018 https://t.co/5MXLr6tZzS"]["As a proud Jeep owner, can’t wait to see the Ohio-made 2018 Jeep Wrangler out on the roads. https://t.co/Hjjx7lSZEv"]["Introducing a resolution to undo today’s shameful @FCC vote to repeal #NetNeutrality &amp; to restore these vital rules. An open internet is vital to keeping prices down and protecting free speech, consumer choice &amp; access to public information in our country. https://t.co/2J8vvYySMj"]["One of the highlights of the year – dropping off toys for @ToysForTots_USA to distribute to families across the country, and getting a chance to thank our servicemembers. https://t.co/n50t36yCph"]["Internet providers should not be able to slow down your internet access based upon the shows you watch, the teams you cheer for, or the political views you espouse. Urging the @FCC to vote in favor of #NetNeutrality today."]["WATCH: Sherrod unveils his new series, “Wall Street’s War on Workers” – which will lay out the case for how Wall Street undermines American workers, and the changes we need to make in this country to grow our middle class and make hard work pay off. https://t.co/0xcEcKL3eC"]["WATCH: Rita Lewis speaks about how her late husband Butch - a proud Teamster who'd been on the front lines of the pension fight - would feel to know that the pensions fix bill is named after him. https://t.co/ua9ubdjODM"]["By passing the Butch Lewis Act of 2017, we ensure that over a million workers can spend the holidays enjoying time with their families – not worrying about if their pension checks will still come next year. https://t.co/F4aM0OLgUh"]["The fight for pensions is about whose side you’re on – are we going to work for Wall Street and corporate CEOs or workers who just want the retirement they earned? https://t.co/fSnH3ZLpcC"]["WATCH LIVE: Sherrod stands with his colleagues to call for passage of the Butch Lewis Act, which would ensure that 1.5 million workers across the country can keep the pensions they earned. https://t.co/mowGnkzUdI"]["I am grateful to the women who had the courage to come forward. Because of them and so many others like them, we are seeing meaningful change. I look forward to finding opportunities to work with Doug Jones in the Senate to support middle-class families. -SB"]["Nathali, in Columbus, works as a product development and design engineer at Honda. She’s lived here since she was a 9-year old girl. https://t.co/blw0VEYA31"]["Heard from Elvis, who grew up in Northwest Ohio. He graduated from Ohio State, and now works at Nationwide. https://t.co/6yuiIX30L3"]["Shared stories on the Senate floor tonight from Dreamers across Ohio, about what this country means to them, and how they are contributing to our communities."]["To all Ohioans lighting the first candle on the menorah tonight, #HappyHanukkah! Wishing you a joyous festival of lights."]["WATCH LIVE: Sherrod takes to the Senate floor to share the stories of Dreamers. \"It’s time for us to come together and pass a bipartisan, commonsense solution that protects these kids, and upholds our American values.\" https://t.co/kZkUB8PUmT"]["Congratulations to Jamie, the New Philadelphia Fire Department's first-ever female firefighter - a new role model for young women in Ohio to look up to. https://t.co/g2xcaalGX5"][".@jimmykimmel said it best: \"I don't know what could be more disgusting than putting a tax cut that mostly goes to rich people ahead of the lives of children.\"\n\nWe need to put politics aside, roll up our sleeves, and extend #CHIP for families across Ohio. https://t.co/aNEnzu6MIf"]["Simeon Booker changed the world of journalism with the stories he told and the barriers he broke. He will be missed. https://t.co/bux07WHvT3"]["The deadline to #GetCovered by the healthcare exchange is this Friday 12/15 - and comparing plans is as easy as 1-2-3:\n1. Go to https://t.co/ExJ8wW2ifQ\n2. Click on “Get Coverage” on the upper left\n3. Click on \"See Plans &amp; Prices\" on the lower right and follow the prompts"]["Ohio retirees deserve the pensions that they were promised. By passing the Butch Lewis Act, we deliver them the financial security that they've earned. More from @ohiodotcom: https://t.co/sInAQaKCAA"]["Urging @AjitPaiFCC to delay the @FCC vote to repeal #NetNeutrality until the necessary steps are taken to determine its impact. Chairman Pai must heed his own advice and give the American people “a full and fair opportunity to participate in this process.” https://t.co/QJoeE7G70U"]["The deadline to enroll in health insurance through the exchange is one week away! Add SenSherrodBrown on @Snapchat to learn more about all the different ways you can #GetCovered → https://t.co/EAYYbS6f2p https://t.co/kUyVRPEluD"]["One year ago today, we lost an American hero and my dear friend. We were all better to know him. Godspeed, John. -SB https://t.co/6sp0VEkTiO"]["@jctgov @CustomsBorder @ARCgov That means money will automatically be taken from Medicare &amp; other programs like support for Ohio farmers and funding that ensures @CustomsBorder can keep our borders secure in order to pay for the $1 trillion hole the Republican tax plan blows in the deficit. Shameful."]["@jctgov @CustomsBorder @ARCgov These programs are getting cut because of a law called Pay-As-You-Go - if by the end of '17, the cost of all leg passed this yr would increase the deficit compared to previous yrs, it triggers automatic spending cuts across the budget including Medicare &amp; other critical programs."]["@jctgov @CustomsBorder Appalachian Regional Commission: $4 million would be cut from @ARCgov, which supports Ohio and twelve other states across Appalachia to stimulate local economies, provide job training, expand broadband access in rural areas, and support local infrastructure needs."]["@jctgov @CustomsBorder Payments to the Military Retirement Fund: The Military Retirement Fund, which supports retirement benefits for Ohio members of the military who have retired from active duty, as well as disability and survivor benefits, would be cut by $7.5 billion."]["@jctgov @CustomsBorder Transportation Funding: More than $850 million would be cut from federal programs to build and maintain Ohio’s roads, bridges, and airports."]["@jctgov @CustomsBorder Benefits for Public Safety Officers: $10 million would be cut from the Public Safety Officers’ Benefits Program, which provides disability benefits to Ohio officers injured in the line of duty as well as survivor &amp; education benefits to family members killed in the line of duty."]["@jctgov @CustomsBorder Support for Ohio farmers: More than $18 billion would be cut from programs that help Ohio farmers do everything from stabilize farm prices to protect Lake Erie."]["@jctgov Border Security: @CustomsBorder's operations and support will be cut by $1.3 billion. That makes U.S. borders less secure overall and takes critical resources away from Customs and Border Patrol officers working to keep fentanyl from entering Ohio communities."][".@jctgov confirmed GOP tax bill will add $1tril to the federal deficit, even after accounting for economic growth. We know that will force automatic cuts to Medicare - but what else will be slashed to pay for tax cuts to corporations that send jobs overseas? \nHere are just a few:"]["Hear that sound? It's Wall Street executives popping champagne, as they watch the @CFPB turn from Ohioans' cop on the beat to the banks' butler. https://t.co/u2wdU5Hd6y"]["Ohio! Today is the last day to sign up for Medicare coverage or change your current plan - call 1-800-MEDICARE or visit https://t.co/77AUAUAMYq for information on the different plans, costs, and changes."]["WATCH: at the @SenateBanking markup of #DoddFrankRollback, we tried again &amp; again to make this bill better for the people we serve - and each time, our efforts were rejected. \ncc: @SenJackReed @SenWarren @SenCortezMasto @brianschatz &amp; @SenatorMenendez \n\nhttps://t.co/N7PBTId5C2 https://t.co/gizMpyIWNJ"]["Calling on @AjitPaiFCC to delay #NetNeutrality vote until we can ensure people were properly heard. https://t.co/zIzeEgHBZp"]["The public comment period is critical to making sure Americans are heard. We cannot allow people to be drowned out by bots. #NetNeutrality https://t.co/qh5mR8PaCU"]["It’s #NationalMinersDay this week. No better way to celebrate than hearing from Ohio @MineWorkers about the critical need to pass our pension protection bill. https://t.co/mXQq9K1QKG"]["A summary of yesterday’s @SenateBanking markup of #DoddFrankRollback:\n• Big banks won\n• Students, servicemembers, seniors, homeowners and victims of Wells Fargo &amp; Equifax lost.\n \ncc: @SenJackReed @SenWarren @SenCortezMasto @SenatorMenendez &amp; @brianschatz https://t.co/N7PBTId5C2 https://t.co/SldfL3ms9S"]["To that end, I am also signing on to Senator Gillibrand’s bill to reform the way Congress deals with complaints. Congress should be held to the highest standards. -SB"]["I also believe the ethics committee should continue to investigate. He is entitled to the investigation. And their findings will be important to informing changes that are needed in Congress."]["I have listened to them. I have listened to my female colleagues, to women I work with and women in my life. And I agree the time has come for Senator Franken to step aside."]["We have a serious problem in this country with sexual harassment and assault – in Congress, in Hollywood, in business, in the military – everywhere."]["These are banks we want to help?"]["UBS: sold toxic mortgage backed securities."]["Credit Suisse: illegally did business with Iran."]["Barclays: manipulated electric energy prices in Western U.S. markets."]["Deutsche Bank: manipulated the benchmark interest rates used to set borrowers' mortgages."]["Santander: illegally repossessed cars from members of the military that were serving our country overseas."]["#DoddFrankRollback weakens oversight of foreign megabanks operating in the U.S. – the same banks that have repeatedly violated U.S. laws. Let’s run through a few of their rap sheets:"]["@SenateBanking @SenJackReed @SenWarren @SenCortezMasto @CFPB So, #DoddFrankRollback is YES to banks raking in record profits, NO to Americans struggling with student loan debt, NO to support for servicemembers, NO to protecting seniors, NO to Homeowners, NO to victims of Wells Fargo &amp; Equifax."]["@SenateBanking @SenJackReed @SenWarren @SenCortezMasto @CFPB .@SenCortezMasto to require loss mitigation protections for seniors with reverse mortgages that fall behind in property taxes, insurance or homeowners’ association payments. Committee votes no."]["@SenateBanking @SenJackReed @SenWarren .@SenCortezMasto to reinstate @CFPB arbitration rule to give consumers their day in court. Committee votes no."]["@SenateBanking @SenJackReed .@SenWarren gives consumers tools to control their own financial information. Committee votes no."]["@SenateBanking Next up: @SenJackReed’s proposal to provide greater financial protection to servicemembers. Committee votes no."]["@SenateBanking First up: Brown amendment to help people struggling with student debt. Committee votes no."]["HAPPENING NOW: @SenateBanking is voting on amendments to improve #DoddFrankRollback by providing relief for consumers."]["#DoddFrankRollback allows some banks to sell you an adjustable rate mortgage they know you can’t afford, takes away your right to go before a judge to block a wrongful foreclosure, and rolls back protections that help ensure you can afford the true price of homeownership."]["#DoddFrankRollback puts taxpayers at risk of another bank bailout and puts homeowners at risk of the same traps that led to the foreclosure crisis – all while doing virtually nothing for hardworking Americans."]["WATCH LIVE: Sherrod outlines how Dodd-Frank rollbacks put taxpayers and homeowners at risk without helping working Americans. https://t.co/TBCFjrZH9g"]["We need to put politics aside, roll up our sleeves, and extend CHIP for families across Ohio. -SB https://t.co/rKwEp4U82v"]["Here it is: 500 pages of special interest provisions, written in back rooms with lobbyists and no time for senators – let alone the American people – to read it before voting. We need to start over and work together to cut taxes for working people, not corporations. https://t.co/qKjhNIlwgK"]["Chairman Hatch: the Republican chairman of the Senate Finance Committee blamed ‘liberal programs’ for the nation’s debt."]["Chairman Kevin Brady: the chairman of the Ways and Means Committee said this month that tax overhaul “alone won’t get us back to a balanced budget.” He said that House Republicans would soon turn toward “welfare reform and tackling the entitlements.”"]["Speaker Ryan: at a town hall-style event in Virginia on Tuesday night, the House speaker said the most important steps that could be taken to reduce the national debt were spurring economic growth and making changes to entitlement programs."]["WATCH LIVE: Sherrod fights to expand the Child Tax Credit and put more money in the pockets of working families. https://t.co/ktCLsHurfL"]["President Trump: “We’re looking very strongly at welfare reform, and that’ll all take place right after taxes, very soon, very shortly after taxes.”"]["Senator Marco Rubio: the Republican Senator said this week, “The driver of our debt is the structure of Social Security and Medicare for future beneficiaries,” as he called for federal spending cuts."]["Independent tax experts tell us the GOP plan will blow a $1 trillion hole in the deficit (yep, even after all that supposed economic growth). And they’re going to pay for that deficit by taking your money from Medicare and Social Security.\n\nHow do we know that? They told us so:"]["#WorldAIDSDay is about more than just promoting awareness. It’s about building upon that awareness to advance prevention efforts through global healthcare outreach, to support those who are living with HIV, and to honor those who have lost their lives to this disease."]["DON'T MISS: important news from Dayton shows how the GOP tax bill will hurt Ohio communities. https://t.co/CfVjcR5nG9"]["And #ACA Open Enrollment ends just a week later, on Friday, December 15th. If you’d like to sign up for coverage or make a change to your current plan, call 1-800-318-2596 or visit https://t.co/nlHUOkszDU."]["Medicare Open Enrollment ends this week, on Thursday, December 7th. If you’d like to sign up for coverage or make a change to your current plan, call 1-800-MEDICARE or visit https://t.co/77AUAUAMYq."]["If we pass this tax bill, and give big tax cuts to corporations that send jobs overseas, middle-class and working families will pay for it. https://t.co/lRCIQwgf2P"]["The math of sending jobs overseas: 20 is larger than 0. https://t.co/uKQ4a058nI"]["BREAKING NEWS: 5.2 million seniors could see an increase in their taxes if this tax bill passes - and the Medicare they've paid into their whole lives will be slashed as well. That's unacceptable. https://t.co/w3HBGSFjau"]["HAPPENING NOW: On Sherrod’s Snapchat, we’re highlighting the 7 things you should know about the Senate Republican tax bill (and it’s not pretty). Check it out → https://t.co/EAYYbS6f2p https://t.co/FpI7SDkwKI"]["WATCH LIVE: Sherrod makes the case for his Patriot Employers Tax Credit. If we are going to cut taxes for corporations, reward those that keep jobs in this country and invest in American workers. https://t.co/m7hJluBLkv"]["If we want to cut taxes for the middle class, let’s cut taxes for the middle class – and this bill doesn’t do that. https://t.co/SavyQZT42T"]["The best way to cut taxes for the middle class is to cut taxes for the middle class - not hand tax breaks to corporations and hope some of it trickles down. Take these CEOs’ word for it: it won’t."]["The jig is up: CEOs confirm they will spend tax cuts on shareholder profits, not increasing wages for workers or creating jobs. https://t.co/BKirCfMGBn"]["HAPPENING NOW: Surprise guest Senator @CoryBooker joins Sherrod to kick off today's Facebook Live Town Hall on tax reform. https://t.co/4HpL9YQ6Ah https://t.co/gZEeUCWh7l"]["Rather than playing politics over who runs @CFPB, @WhiteHouse needs to look out for the working families the agency serves. That means @POTUS must follow the law &amp; nominate a permanent director immediately who will fight for working people instead of lenders that cheat them. -SB"]["I’ve stood up to presidents of both parties on trade, and I’m willing to work with @POTUS to hold him accountable for his promises to Ohio workers. -SB \nhttps://t.co/ItDBqMbeu6"]["Ohio! Open enrollment for 2018 health care coverage ends in less than 4 weeks. Register online at https://t.co/nlHUOkszDU or find free help nearby to help you sign up → https://t.co/cD9PvsEgQz"]["Have you submitted your questions about #TaxReform for my Facebook Live Town Hall tomorrow morning at 10:45am? Email your Qs to townhall@brown.senate.gov or comment here → https://t.co/4HpL9YQ6Ah https://t.co/mLiysTHXYO"]["Questions about tax reform? Join me for a Facebook Live Town Hall this Wednesday at 10:45am, where I’ll answer your questions about the Senate Republicans’ tax / healthcare repeal plan. Email your Qs to townhall@brown.senate.gov or comment them here → https://t.co/4HpL9YQ6Ah https://t.co/qt4JN9vF1V"]["Joined Ohio workers in Toledo this morning to discuss my foreign investments bill with Senator @ChuckGrassley. It’s simple – before we do business with a foreign entity, let’s make sure it will create jobs and grow the U.S. economy. https://t.co/JitCX7GO8h"]["WATCH LIVE: Sherrod questions the priorities of this Congress as families face losing their child’s health insurance without #CHIP funding, and working Americans face losing the financial protection of @CFPB. “People want to know, whose side are you on?” https://t.co/UdZO1NvI5G"]["This headline says it all: \"Senate GOP tax bill hurts the poor more than originally thought, CBO finds\" → https://t.co/DKr6g1dudX"]["The @CFPB’s actions have resulted in $12 billion in relief for 29 million hardworking Americans who were cheated by financial institutions. Gutting #CFPB is taking money out of the pockets of hardworking people. #DefendCFPB https://t.co/kR5Z7gxUr0"]["The last thing Americans need is for politicians to turn back the clock to the days when Wall Street was free to prey on working families, wreck the economy, and hand taxpayers the bill. We must #DefendCFPB. https://t.co/juCvJev1l6"]["Who wins if the @CFPB is gutted? Wall Street banks and other huge corporations that never pay the price for cheating working people. #DefendCFPB https://t.co/YLvfpfXtQ2"]["Our job is to look out for the people we serve – not Wall Street banks and corporations trying to scam consumers. Whose side are we on: hardworking Americans, or big banks? #DefendCFPB https://t.co/4Qn0a7vy9P"]["Americans deserve a full-time cop on the beat with a proven track record of fighting for them, not a part-time Director with a record of working for Wall Street. -SB"]["@CFPB That’s why the Dodd-Frank law is clear that Deputy Director English is the legal Acting Director, and she must be allowed to continue the agency’s work standing up for working families against financial abuse until a permanent Director is confirmed by the Senate."]["Independence is critical to the @CFPB’s ability to aggressively and successfully fight for hardworking Americans and against Wall Street abuses."]["@CFPB The Administration must quickly nominate a leader for the @CFPB who has bipartisan support and a track record of standing up to Wall St."]["Under Director Cordray, the @CFPB secured $12 billion for 29 million hardworking Americans."]["As we reflect on our blessings, let us take time today to think of Ohioans who struggle to put food on the table today – as well as those who are working today to support their families. And to our servicemembers celebrating at home or overseas – thank you for your service. -SB"]["Wishing you all a safe and happy Thanksgiving. Today, Connie and I are reminded of all that we have to be grateful for this year – particularly the birth of our youngest grandchild, Ela Constance, just a few weeks ago."]["@DeptVetAffairs Hearings like this one are so important, because the best ideas don’t come out of Washington – they come from conversations like the ones we had today, with the women and men who serve our country, and the @DeptVetAffairs officials who serve them"]["Honored to bring the Senate Committee on Veterans' Affairs to Columbus today - and glad to be joined by @DeptVetAffairs officials to hear directly from Ohio veterans. https://t.co/jlgp8x2deW"]["Without #NetNeutrality, the internet would fall under control of a few companies to tell you what you can or can't have access to online. We cannot let this happen. https://t.co/7R1FBvYIWS"]["In all seriousness - the Senate Republican tax plan hands a massive tax cut to millionaires and corporations who ship their jobs overseas, while middle class Americans foot the bill. That's shameful."]["3. Millionaires should be extra grateful for their fortunes under this bill - those earning $1M+ will pay 4.2% less in federal taxes by 2021, while those making between $20k - $30k will pay 13.3% more."]["2. The new incentives to outsource production and keep jobs overseas may be like Christmas coming early for wealthy corporate executives. They'll be literally rewarded for their offshore profits - what a gift!"]["1. Corporations should be very grateful for the permanent tax cut they're given in this bill! While middle class families are left to wonder what will become of their temporary tax cuts, corps can rest easy this Thanksgiving knowing their tax rate will be cut by more than 40%."]["It's almost Thanksgiving - a time for Americans to sit back and reflect with gratitude on what we have. And with their new tax bill this year, Senate Republicans are giving corporations and millionaires a whole lot to be thankful for."]["No one should ever have to feel afraid, ashamed, or silenced simply for being who they are. Violence – of any kind – cannot and will not be tolerated. #TDOR https://t.co/XJtzFN742J"]["@USCBO IN SHORT: this bill doesn’t cut taxes for working people. Instead, it takes away Ohioans’ healthcare and cuts the Medicare they have paid into for years – all to pay for tax cuts for the very corporations that send Ohio jobs overseas."]["@USCBO 6. On Thurs, JCT revealed that even while the bill makes its corporate tax cuts permanent, it lets the cuts for working Americans expire in just a few years. According to a study from JCT, families earning &lt; $75k would start seeing annual increase in taxes over the next decade."]["@USCBO 5. Also on Wednesday, the Joint Economic Committee revealed that the bill would force a $25 billion cut to Medicare next year and a $16.4 billion Medicare cut for Ohio over ten years. https://t.co/EzlfdQ7GHw https://t.co/pOi2tkyG9N"]["@USCBO 4. On Wednesday, a tax expert confirmed middle-class Ohioans could pay more in premium hikes than they’ll get in tax cuts under the bill. https://t.co/R4imHITT6k"]["@USCBO 3. Also on Tuesday, we learned from @USCBO that the bill would cause 13 million people to lose their insurance and raise insurance premiums by about 10 percent each year. https://t.co/DcjxmFSrfC"]["1. On Tuesday, a tax expert confirmed to Senator Brown that the bill actually encourages corporations to outsource jobs. https://t.co/vXTHpS0CPm"]["Here’s what we learned last week about the Senate GOP tax proposal during last week’s Finance Committee hearings:"]["Instead of cutting taxes on corporations that send jobs overseas and pretending it will somehow end up in the pockets of workers, let’s cut out the middle man and give a direct tax cut to the middle class. https://t.co/XzgheU9Jka"]["Sherrod’s now on Snapchat! Add SenSherrodBrown for an inside look into today’s Propel Ohio Collegiate Leadership Summit at @uakron → https://t.co/EAYYbS6f2p https://t.co/FTAqnhteyr"]["BREAKING NEWS: Sherrod is bringing the Senate Committee on Veterans’ Affairs to Columbus on Tuesday, November 21st. If you are an Ohio veteran and are interested in sharing your questions for VA officials and the Senate Committee, let us know here → https://t.co/ddP5ukTcy3"]["Instead of cutting taxes on corporations that send jobs overseas and pretending it will somehow end up in the pockets of workers, let’s cut out the middle man and give a direct tax cut to the middle class."]["People deserve to know what’s in the committee bill passed late last night. Instead of taking our amendments to cut taxes for the middle class, it takes away healthcare, raises premiums &amp; cuts Medicare - all to pay for tax cuts for corporations. https://t.co/Q05QVY70wu"]["Instead of cutting taxes for working people in Ohio, this bill takes away their healthcare, raises their premiums and forces deep cuts to the Medicare program they’ve paid into for years. Why? All to pay for tax cuts for corporations that send American jobs overseas. -SB"]["Ohio seniors have paid into Medicare their entire lives. That $25 billion is your money. And this tax bill steals it to pay for tax cuts for corporations that send jobs overseas. Shameful. https://t.co/zOrDIO9PWI"]["Thank you to so many @Teamsters and @MineWorkers for traveling here to fight for the retirement you earned. Wall Street and corporate raiders squandered your money. Now your government has a responsibility to keep the promise of the pensions you earned. https://t.co/u7eLY5wmn5"]["An expert witness confirmed yesterday that under the Senate Republican tax bill, Ohioans will owe more in health insurance premium hikes than they'll get back in tax cuts.\n\nThat adds up to a rip-off. https://t.co/b9F06mjoTR"]["🚨 🚨 🚨 An important thread from Senator @RonWyden - while the Senate Republican tax plan hands a massive tax cut to millionaires and corporations who ship their jobs overseas, middle-class Americans are footing the bill. https://t.co/RaBxQATTMe"]["@jctgov Make no mistake: this is just another way that Senate Republicans are trying to hike taxes on the middle class, so they can spend billions more on tax cuts for millionaires and corporations that send jobs overseas."]["The head of the nonpartisan @jctgov wrote in 2011 that - if the government decided to use chained CPI for taxes - 69% of the tax increase would come from taxpayers with incomes under $100,000, while taxpayers in the highest income brackets would barely feel the effect."]["Right now, Senate Republicans are trying to use an accounting trick, known as a chained Consumer Price Index (CPI), in the new tax code. This would mean less adjustment for inflation, a tax increase that would disproportionately impact middle-class families."]["Thank you @Sen_JoeManchin, @SenatorHeitkamp, @SenatorBaldwin, @SenDonnelly, @SenatorDurbin, @SenDuckworth, @SenGaryPeters, @SenFranken, @clairecmc, @SenStabenow, &amp; Sen Klobuchar for joining me in introducing the Butch Lewis Act to protect workers' hard-earned retirement."]["Yesterday, an expert witness confirmed the GOP tax bill will force a $25 billion cut to Medicare. Ohio seniors have paid into Medicare their entire lives. That $25 billion is your money. And this bill steals it to pay for tax cuts for corps that send jobs overseas. Shameful. https://t.co/2ER2RMuJUc"]["@DispatchAlerts If confirmed as Comptroller of the Currency, Mr. Otting would be in charge of ensuring all national banks, including banks like Wells Fargo, are complying with the law, operating in a safe and sound manner, and protecting consumers.\n\nCan we really trust him to do that?"]["@DispatchAlerts The abuses were so bad that Mr. Otting signed an OCC consent order – a legal agreement a bank and its regulator enter into when illegal practices at the bank have gotten so bad, the government has to step in.  In any other Administration, this would be disqualifying."]["This Administration is putting the banking industry back in charge of policing itself. And Joseph Otting is yet another bank exec who profited off the financial crisis who is being rewarded by the Trump Administration with a powerful job overseeing our nation’s banking system."]["WATCH: House, Senate Leaders endorse Sherrod’s plan to protect the retirement Ohio Teamsters, Miners and others have earned. https://t.co/ofDldDEjXb"]["Statistics predict we will lose 11 Ohioans to the opioid epidemic by the end of today. Ohioans want to help. But the GOP tax bill makes Ohioans pay taxes on donations to treatment facilities. My amendment would fix that. https://t.co/X9B9ZpLBj5"]["Margaret Mead said that wisdom and knowledge are passed from grandparent to grandchild – we’re so lucky to welcome Ela Constance into our family. -SB https://t.co/GurUqAAaDN"]["If a corp shuts down an Ohio factory, it gets a tax deduction for moving to China. But if the factory workers have to move to get jobs, they pay taxes on their move. Tried to fix that with my amendment tonight. GOP rejected it, showing this bill is for corps, not working people. https://t.co/QGZI5lkFvA"]["I have real questions about the @StateDept contract approval process - and I intend to get answers. -SB https://t.co/A29rgwfqsS"]["WATCH: Expert witness confirms that Ohioans will owe more in health insurance premium hikes under the Senate Republican bill than they would get back in tax cuts. \n \nWhy are Ohioans getting ripped off? To pay for tax cuts for corporations that send jobs overseas. https://t.co/1fojZ78FRS"]["A novel concept: if we want to cut taxes for the middle class, maybe we ought to cut taxes for the middle class. https://t.co/dxW04pQkxi"]["@MarchofDimes @American_Heart @CF_Foundation @ACSCAN @mssociety @LutheranSvcs @LungAssociation @AmDiabetesAssn @NHCouncil @EpilepsyFdn @RareDiseases @liverUSA @FamilyVoices @ConsumersUnion @MLH_CHD @WithoutViolence (For the record: no better use for the new 280 character limit than thanking the voices speaking out in this fight.)"]["Thank you for your advocacy, @MarchofDimes @American_Heart @CF_Foundation @ACSCAN @mssociety @LutheranSvcs @LungAssociation @AmDiabetesAssn @NHCouncil @EpilepsyFdn @RareDiseases @liverUSA @FamilyVoices @ConsumersUnion @MLH_CHD @WithoutViolence"]["16 patient and consumer groups agree: repealing the individual mandate results in 13 million more Americans uninsured and higher premiums – and that’s unacceptable. https://t.co/535Izp0WlU"]["@USCBO Tax reform should be about cutting taxes for working families, not raising the price of their health insurance."]["@USCBO Good question. @USCBO also says repeal would save the government $338 billion by taking away money that now goes to help people afford insurance.  Aha! That’s $338 billion more they can spend on tax cuts for millionaires and corporations that send jobs overseas."]["According to @USCBO, repealing the individual mandate would kick 13 million people off their health insurance &amp; increase premiums by 10%. \n\nSo what does kicking some people off their insurance &amp; making it more expensive for others have to do with tax reform?"]["Tax reform should be about cutting taxes for the middle class, not raising the cost of their health insurance. https://t.co/1o4HwSRkUi"]["Expert tax witness confirms - instead of putting money in the pockets of the middle class, the Senate Republican tax bill actually encourages corporations to outsource their jobs and keep their profits overseas. https://t.co/HePve3YnYl"]["Cheers to that. 🍻 https://t.co/9HPZAbaXV8"]["We want to work together to pass tax cuts for working families and middle-class Americans and reward employers who invest in American jobs.\n \nSo let’s work together to put money directly in the pockets of the American people. -SB"]["We have a chance to work together in a bipartisan way to do some real good for American workers."]["The only problem is, it doesn’t work – and it never has."]["Instead, this bill hands more than a trillion dollars to wealthy multinational corporations – some of the same corporations that have sent American jobs overseas – and asks working people to trust that somehow that money will end up increasing their wages."]["That’s what the President says he wants. That’s what I want – and I hope we get there.\n \nUnfortunately, that’s not what this bill does right now."]["Tax reform should be about one thing: putting money in the pockets of working people in Ohio and across the county."]["WATCH LIVE: Sherrod delivers his opening statement about the Senate Republican tax reform plan. \"Tax reform should be about one thing: putting money in the pockets of working people.\" https://t.co/SohVLFJeaQ"]["That's unacceptable. We need to come together on a bipartisan tax reform plan that benefits workers and middle class families - not corporations that send jobs overseas."]["Our goal for tax reform must be to put more money in the pockets of working families - but the Senate Republican plan raises taxes for millions of Americans. https://t.co/WVt7vQNKX8"]["Grateful for the Ohio National Guard's 137th Signal Company and all other Ohioans aiding in Puerto Rico's relief efforts. These selfless men and women represent the very best of our state. https://t.co/siX5Wpg1YJ"]["As the only Ohioan to serve a full term on the Senate Veterans’ Committee, and the son of a WWII veteran, it’s one of my greatest honors in this job to be able to award veterans the medals they have earned. -SB https://t.co/qg815ShQZg"]["On #VeteransDay, we pause to remember those who have served. We owe our veterans and military families our deepest gratitude."]["And today, our bipartisan Stop Enabling Sex Traffickers Act - led by @senrobportman - was advanced, an important effort to protect women &amp; young girls from modern-day slavery."]["Yesterday, we ushered forward our banking package that will ramp up efforts within the financial sector and at the Treasury Department to combat human trafficking."]["We must do more to protect Ohioans from human trafficking, and to provide justice, restitution, and healing for trafficking survivors. Proud that the Senate has advanced two important efforts to this end this week."]["All prescription medications—especially addictive opioid painkillers—must be disposed of safely to prevent them from falling into the wrong hands. \n \nGreat to see the success of Prescription Drug Take Back Day, which collected 35k lbs of Rx in Ohio. https://t.co/fo0IVB80yu"][".@Allergan's monopoly keeps the price of their drug high, and limits competition. We're demanding answers about their recent patent sale. https://t.co/ODJo37eTk3"]["@NLRB The last thing we need is another nominee who doesn’t value work or respect the Americans who do it."]["@NLRB Someone who views unions and collective bargaining as a threat to be dealt with has no business serving as the top lawyer for @NLRB."]["Peter Robb - the nominee to serve as General Counsel of the @NLRB - has spent his career working to strip workers of their rights."]["Pyongyang’s human rights violations, including its treatment of Ohioan Otto Warmbier which resulted in his death, must not go unpunished."]["Today we advanced legislation that builds upon the sanctions tools we have already provided the Administration to counter North Korea."]["@RepTimRyan Learn more here: https://t.co/zkgzixNNSi"]["@RepTimRyan Couldn’t agree more w/ Ed Barker, a retired Teamster, who said: \"We did our part, now it’s time for MoC to cross party lines and do theirs.” https://t.co/SjbvYRF6Ot"]["In Youngstown today with @RepTimRyan to introduce my plan to ensure that Ohio retirees can keep the pensions they've earned. https://t.co/UpBK0sV6mf"]["Heartbreaking. Thinking of the victims and their loved ones. Thank you to all first responders on the scene. https://t.co/aipVvqqAC5"]["We shouldn’t be pitting Ohio seniors against Ohio children. -SB #CHIP https://t.co/c3sxxgC4Ou"]["Have you signed up for your 2018 health coverage yet? → https://t.co/CeUAMfichf"]["Workers should not be punished based on outdated job titles that have little to do with the job they do. -SB https://t.co/mplcJxI8BQ"]["The House tax reform proposal won't touch workers' retirement savings - and that's good news. My full statement: https://t.co/FMPx2dg1fz"]["Connie – I love you, and I couldn’t be prouder to be your partner. Congratulations. -SB https://t.co/x8wmtwHrk9"]["Tax reform must be about putting more money in the pockets of working people, not stealing from their retirement. https://t.co/puIFwpewp8"]["Starting TODAY, you can enroll in a new health care plan or change your coverage on the health exchange. Why wait? → https://t.co/CeUAMfichf https://t.co/ejpl3ucJx2"]["Instead of stacking the deck even further in favor of corporate CEOs, we need to make it easier for workers to organize. #StandWithWorkers"]["WATCH LIVE: Sherrod leads senators speaking out about Janus v. @AFSCME, and the need to always #StandWithWorkers → https://t.co/hYNGIsPHxO"]["What Washington and Wall Street don’t seem to understand is that workers drive our economy, not corporations. #StandWithWorkers"]["What does it mean to #StandWithWorkers? It means we'll fight for unions and the middle class - not for corporate special interests."]["As a proud Jeep owner, can't wait to see the Ohio-made 2018 Jeep Wrangler out on the roads. https://t.co/iO8hyNxxYB"]["We need an #EXIM President who will commit to strengthening this important resource for American jobs &amp; businesses. #SupportEXIM"]["But after opponents like Garrett hobbled #EXIM, OH felt effect sharply—value of OH exports supported by #EXIM was cut almost in half in '16."]["Bottom line: #EXIM is good for Ohio jobs, Ohio manufacturers &amp; Ohio businesses. Its President must commit to #SupportEXIM &amp; its good work."]["Dick Rogovin, whose Cambridge company makes bridge components with American steel, hopes to grow his business with the help of #EXIM Bank."]["Assistance from #EXIM supported 19 Ohio jobs at A.J. Rose Manufacturing Company in Cleveland - whose car parts can now be found worldwide."]["Robbins Sports Surfaces, a family-owned small biz in Cincinnati, hired more workers after growth resulting from #EXIM's insurance policy."]["The #EXIM Bank is crucial to the success of US manufacturing and US small businesses. Just look at its impact in Ohio. #SupportEXIM"]["#EXIM President must be its champion. Garrett - an outspoken critic of the Bank - is not that person. #SupportEXIM to support American jobs."]["#EXIM is one of the best lines of defense for American jobs. It levels the playing field for American companies w/ our foreign competitors."]["Heartbroken for the victims, their families, &amp; all those affected by the horrific attack in NYC. Thank you to first responders at the scene."]["Seniors should never have to choose btwn putting food on table &amp; filling Rxs. We must prevent the looming tax hike. https://t.co/JwOWtfaM9B"]["The bottom line: workers’ retirement savings must not bankroll corporate tax cuts. Period. https://t.co/oNioGHEvq9"]["With a tax hike on seniors looming, joined Ohioans in Cleveland today to talk about my bipartisan fix w/ @senrobportman, endorsed by @AARP. https://t.co/O22Z5wL4qt"][".@realDonaldTrump pledged no changes to workers' 401(k)s - now congressional Republicans must make good on his promise. https://t.co/moPm38uLta"]["@LegioninDC @CFPB @CFPBMilitary fights for the men and women who fight for our country - and gutting the arbitration rule prevents them from doing their job. https://t.co/LQZ01qWHwz"]["Couldn’t agree more. And as @LegioninDC says at the end of this terrific thread – “@cfpb we got your back.” https://t.co/LXD3eluUOa"]["Tomorrow, safely dispose of your unused prescription medications at one of over 200 Drug Take Back sites in Ohio: https://t.co/uYzTPFftHd https://t.co/vvB3xSFg31"]["Our tax policy should put real money back in pockets of working families. That's our job. My bill w/ @SenBennetCO → https://t.co/36XLyWvgyh"]["It’s time for us to come together to fund #CHIP and ensure that the families we work for have the health care they need for their children."]["\"It’s the difference btwn living a middle class lifestyle or...the poverty line.\" What #CHIP means to one OH family:\nhttps://t.co/7U9AJnXG2X"]["That means @POTUS must use this to boost treatment, invest in the ppl &amp; programs that fight this every day &amp; make treatment more affordable."]["The opioid emergency declaration is an important step—but it is long overdue &amp; will mean nothing if it isn’t followed w/ immediate actions."]["WATCH LIVE: Sherrod speaks out about #CHIP – which Congress allowed to expire last month. https://t.co/xwCnXkVQYo"]["@realDonaldTrump Let's do bipartisan tax reform and keep your promise to protect 401(k)s and put more money in the pockets of working people."][".@realDonaldTrump—2 days ago, you said there would be \"NO change to your 401(k).\" But GOP is ignoring your promise. https://t.co/Of0ClwKmLz"]["This is good news &amp; proves what we've been saying all along: we must continue to come together to make #ACA better for the people we serve."]["CBO says that bipartisan Alexander-Murray bill would ↓ deficit by $3.8B over 10 years - while ending CSRs would ↑ deficit by almost $200B."]["In the dead of night, Washington elites took away your right to justice if you're cheated by Wall St banks or payday lenders. Disgraceful. https://t.co/n4uFVvTYSg"]["By voting to take rights away from customers, the Senate voted tonight to side with @WellsFargo lobbyists over the people we serve. -SB"]["Spoke out on Senate floor ahead of expected vote on forced arbitration. Asked my colleagues \"Whose side are you on?\" https://t.co/5mWwWtQuAm"]["@CFPB Urging Senate colleagues today to stand w/ these customers &amp; the people we represent as we vote either to protect or to gut this rule."]["@CFPB Our job is to fight for the servicemembers, student borrowers, seniors, and hardworking Americans who depend on @CFPB to look out for them."]["@CFPB Wall Street banks and payday lenders have armies of lobbyists and lawyers on their sides."][".@CFPB arbitration rule ensures Ohioans can see their day in court if they are scammed—at its core, it's financial protection for consumers."]["Too many financial companies continue to use forced arbitration to block customers from seeking justice once they’ve been cheated or harmed."]["It's simple: forced arbitration always gives the advantage to big banks. Big banks use forced arbitration to take advantage of customers."]["@CustomsBorder Learn about my bipartisan bill that would help stop fentanyl at our borders &amp; keep it out of our communities → https://t.co/Vw5tcwiuCZ"]["@WellsFargo @CFPB It’s our job to protect the people we serve – not corporations trying to scam consumers.\nThanks to @RealBankReform for this important video."]["@WellsFargo .@CFPB arbitration rule now protects Americans from these fine-print clauses from banks &amp; payday lenders—but Congress may repeal it this wk."]["Archie, Angela, &amp; Gwen were all scammed by @WellsFargo - and because of fine-print arbitration clauses, they never got their day in court. https://t.co/iYuS87qgEC"]["By focusing on middle class &amp; rewarding corporations that keep jobs in the US, we can get bipartisan tax reform that everyone can support."]["Democrats are ready to work together on tax reform that puts more money in the pockets of working people."]["Couldn’t agree more Mr. President. But GOP may not be on the same page. https://t.co/zhbIpqOYw0 https://t.co/eXMSE55EXE"]["Drop off your unused prescription meds at one of Ohio's 200+ Drug Take Back Sites this Saturday from 10am to 2pm: https://t.co/uYzTPFftHd"]["Unused prescription medicines must be disposed of in a safe, responsible way to prevent them from falling into the wrong hands."]["Opioid addiction epidemic is one of biggest public health emergencies in my lifetime - &amp; all too often addiction starts in medicine cabinet. https://t.co/QHDNEqsT3y"]["National Prescription Drug Take Back Day is this Saturday, October 28th, from 10am to 2pm. Find your location here: https://t.co/uYzTPFftHd https://t.co/QuQTVnrgZQ"]["Thank you to all officers who run toward danger to keep others safe."]["Terrible news. Officer Justin Leo gave his life working to keep Ohioans safe - thinking of his loved ones today. https://t.co/HxbE1KURu6"]["Find a full list of Prescription Drug Take Back sites in Ohio here: https://t.co/uYzTPFftHd https://t.co/eOlPo6NTY6"]["We want to ensure @DEAHQ &amp; other related agencies have all of the tools necessary to fight the addiction epidemic. https://t.co/hV2XEDYpg2"]["Demanding answers with @SenGillibrand on how the @usairforce adjudicates cases of sexual harassment and assault. https://t.co/jK2wKHWiwx"]["Outrageous. https://t.co/UNsaoVyJv8"]["Bill w/@senrobportman will help deduct cost of going to Dr &amp; buying Rx's for seniors - proud to have @aarp's support https://t.co/6sMc6jKPl6"]["High health costs shouldn’t leave seniors making impossible decision btwn putting gas in car or food on table &amp; filling needed prescriptions"]["Proud to work with Senator @ChuckGrassley to ensure that foreign investments don't hurt our economy and our jobs → https://t.co/coYaDEMqOJ"]["Foreign investments should lead to good-paying jobs in Chillicothe and Chesterville – not huge payouts for the Chinese government."]["It’s simple – before we do business with a foreign entity, let’s make sure it will create jobs and grow the U.S. economy."]["Wishing a joyful #Diwali to all Ohioans celebrating - may your celebration be full of light and love."]["@BankofAmerica @ChipotleTweets Our economy simply cannot grow if American workers don’t share in the wealth they help create. My full statement → https://t.co/Srtonwjpd3"][".@BankofAmerica's downgrade of @ChipotleTweets is everything that's wrong with Wall St. https://t.co/G5WJAXeKMn"]["@nwlc This isn't just a health issue - this is an economic issue. The government and your boss should not make these decisions for you."]["Before #ACA guaranteed birth control coverage, those costs accounted for 30-44% of women’s total out-of-pocket health care costs (via @nwlc)"]["Gave @realDonaldTrump two of my bills that do exactly that - glad to have his support for these ideas. https://t.co/jPk7wqBaoa"]["If tax reform puts $$$ in pockets of working families &amp; rewards corporations who keep jobs here &amp; pay good wages, we can do it bipartisanly."]["If we focus on putting money in the pockets of working families – as @realdonaldtrump says he wants to – we can get bipartisan tax reform. https://t.co/bAaW3LyuGI"]["This is exactly how Senate shd work for those we serve – coming together to prevent working fams from paying more for healthcare they need. https://t.co/h4oOYg8xQx"]["When one door closes, another opens. CLE is home to multiple record-breaking teams - going to be a great #OpeningDay for @cavs! #AllForOne"]["To combat opioid epidemic, we must help Ohioans get rid of unused medication - to keep it out of the wrong hands. https://t.co/AQYQEIXi7g"]["We have to treat opioid epidemic as the crisis that it is, not an opportunity to lock ppl up &amp; ignore the problem. https://t.co/162FnvMkHL"]["Unused prescription medicines must be disposed of in a safe, responsible way to prevent them from falling into the wrong hands. -SB"]["Joined law enforcement in Youngstown today to highlight the upcoming National Prescription Drug Take Back Day on October 28th. https://t.co/po0VYfoCWQ"]["@SenatorHeitkamp And don't forget to listen to the first episode of my podcast, \"Nobody's Rust Belt,\" here on iTunes: https://t.co/c52hEMzh4m https://t.co/FoS3zqYaDz"]["Full-time senators, part-time podcast hosts. Learn about my show \"Canarycast\" and @SenatorHeitkamp's \"The Hotdish\": https://t.co/hqGu1CkDB2 https://t.co/NkduoDfceC"]["@CFPB The @CFPB payday lending rule is good for our country, and good for Ohio. Learn more here: https://t.co/yBYrStFcQB"]["@CFPB Payday lenders have exploited loophole after loophole to trap working people in debt. This will help put an end to their abusive practices."]["@CFPB The @CFPB rule prevents shady lenders from taking control of your checking account &amp; offers Ohioans a path to affordably pay down loans."]["Recently, @CFPB finalized payday lending rule, to rein in predatory payday loans that often keep working people trapped in a cycle of debt."]["These payday lenders saddle borrowers with triple-digit interest rates &amp; cost Ohioans over $500 million/year in fees alone."]["Why did Ohio try to cap these rates? Shady payday lenders have only their own interests at heart."]["Ohio has the highest payday loan prices in the US - despite the fact that almost 2/3 of Ohioans voted to cap payday loan rates."]["Now more than ever, Congress should come together and prevent prices from spiking for Ohio families. -SB"]["President Trump’s actions threaten to raise healthcare costs and jeopardize insurance coverage for Ohioans."]["Pulling the rug out from under efforts to make Ohioans’ health insurance more affordable is not the way to make healthcare work better."]["Thank you to police and first responders. Thinking of all involved. https://t.co/BCaobLIi4M"]["My statement on @POTUS decertifying the Iran Nuclear Agreement → https://t.co/y0j6YM9qn2"]["@Equifax Called on @USTreasury earlier this week to bar @Equifax from eligibility for contracts with the government: https://t.co/7lAXTuawXF"]["Suspending IRS contract is only the first step. We cannot know taxpayers are protected until @Equifax is banned from all federal contracts. https://t.co/arZGnt6Nmb"]["This #NationalFarmersDay, I’m focused on how we can help connect farmers to their communities. My Local FARMS Act: https://t.co/dCSmo909Pj"]["Why should we buy apples from Washington when we could get them from the Hirsch Fruit Farm in Chillicothe?"]["Puerto Ricans are American citizens and deserve the same compassion and support as other Americans after a natural disaster. https://t.co/scUlU9FY8e"]["@Equifax Called on @USTreasury earlier this week to bar @Equifax from eligibility for government contracts: https://t.co/7lAXTuawXF"]["More proof of what we already knew: @Equifax is not worthy of taxpayer dollars. https://t.co/pg9Hj3TQ8u"]["In CLE we work for every victory &amp; take nothing for granted - #ALDS is no exception. @Indians are ready to bring Game 5 home. #RallyTogether"]["The First Amendment protects freedom of the press - which means news networks should be able to report freely w/o fear of closure or threats https://t.co/yYqOAxa1Jt"]["Kaitlyn, we Clevelanders all feel your pain. But Rule 1 of Cleveland sports fandom: we never give up hope! -SB https://t.co/LojBFdfad3"]["@Equifax Called on @USTreasury today to bar @Equifax from eligibility for new or renewed government contracts. https://t.co/6V4Ajqfqn5"][".@Equifax is simply is not a company that deserves to be trusted with Americans’ personal data or taxpayer dollars."]["As we start work on the next Farm Bill, I want to hear directly from Ohio farmers. Great to hear ideas from farmers in Oregon today. -SB https://t.co/xAEfOHhY3m"]["Don't worry. Made it home to watch by the 5th. https://t.co/s1WT9DMUvk"]["When the crowd demands Pulitzer Prize winning @ConnieSchultz, you give them @ConnieSchultz. https://t.co/XerccwbJPu"]["Taking in the scene from backstage with @ConnieSchultz before going on with the @PodSaveAmerica crew. https://t.co/eEEiqJyVoq"]["Before going on @PodSaveAmerica, it’s important to know what you’re getting into. Asking everyone here what baseball team they support. https://t.co/ylbB9Daj94"]["Welcome to the Buckeye State. Here we say OH-IO. Hope you left those shirts in ❌ichigan where they belong. \ncc: @SenStabenow https://t.co/12gXgn3vlu"]["Couldn't agree more. Proud to work with @senrobportman to get this done for Ohio kids. #CHIP https://t.co/aaWPNuzl2n"]["Our celebration of manufacturing doesn't have to end after #MFGDay17. Check out Canarycast Ep1, \"Nobody's Rust Belt\" https://t.co/c52hEMzh4m"]["Stop #3 on #MFGDay17: a great roundtable in Muskingum County. Muskingum's also home to one of our Summer Mfg Camps: https://t.co/WGjeAfCRgI https://t.co/8uYAKabacV"]["It’s about time @USTradeRep took the pen away from corporate lobbyists &amp; started writing trade policy that puts American workers first, -SB https://t.co/IBMr9iUZnN"]["Instead of turning industry wish lists into reports, Treasury shd focus on protecting ppl from banks like Wells Fargo that abuse customers. https://t.co/qDTuWmPx6N"]["Healthcare decisions should be between you and your doctor, not the government and your boss. https://t.co/bWX5S2wKI0"]["Stop #2 on #MFGDay17: Cambridge, for a roundtable discussion with manufacturers and community leaders. https://t.co/qNxfJCoItc"]["Stop 1 on #MFGDay17: Canfield, for a manufacturing roundtable and a chance to meet students learning about manufacturing careers. https://t.co/gNBZ7bbsxW"]["Manufacturing has the strongest multiplier effect of any industry–for every $1 we invest in mfg, we add an additional $1.48 to our economy."]["No better way to spend #MFGDay17 than traveling around our state to talk to Ohioans about the importance of manufacturing."]["@Indians @Yankees Watching on TV tonight from our Cleveland home shouldn’t break Dad’s rule. Let’s show ‘em how we do things in Cleveland. -SB https://t.co/02MNosS8HE"]["Dad &amp; I went to many @Indians games. But never against @Yankees. Dad didn't want Mickey Mantle &amp; Moose Skowron to get 15¢ of his tix price."]["@WhirlpoolCorp Spoke to Paula and two other workers from Clyde @WhirlpoolCorp plant about exactly this on my podcast Canarycast: https://t.co/c52hEMhFFM https://t.co/GmiUMEBuWd"]["Paula is right: a level playing field is necessary for @WhirlpoolCorp workers to continue their world-class work. https://t.co/5lk8nxECHm"]["My statement on @CFPB's predatory payday lending rule → https://t.co/LtpCT3yJ8U"]["Why should Ohioans buy raspberries from CA, when they could buy them from a farm in Knox County? My Local FARMS Act: https://t.co/dCSmo909Pj"]["Learn more about our 3rd annual Propel Ohio Collegiate Leadership Summit for Ohio college students at @uakron: https://t.co/Yiq4VJJ8Jy https://t.co/GhsqW6Fm5D"][".@Equifax doesn't think people shd control their own financial data—so why shd a company that's had so many security failures be allowed to? https://t.co/eJCsKV7ZHI"][".@Equifax makes $ off ppl's data THEN charges fees for credit monitoring products after they’ve become identity theft victims. Is that fair? https://t.co/7x49D6xreH"]["What should have been @Equifax's bigger spending priority: compensation for executives, or protection for people's personal information? https://t.co/XGhfa2UqHJ"]["The 145 million Americans exposed in the @Equifax data breach - including 5.2 million Ohioans - deserve answers."]["@Equifax If @Equifax doesn’t think consumers should control their own data, why should a company with so many security failures be allowed to? -SB"]["Corps can’t traffic in private medical records. Asked @Equifax why Americans shouldn’t have same ownership over their financial records."]["@Equifax In hindsight, I asked Mr. Smith if he thinks @Equifax should have spent more $$$ protecting peoples’ data rather than compensating him. -SB"]["According to Mr. Smith's testimony yesterday, over the last three years, @equifax spent $250M on cybersecurity – that’s about $85M a year."]["@Equifax So please do not make the same mistake @WellsFargo did – now is the time to give this committee the whole story. -SB"]["@Equifax Your actions have exposed over half the country’s adults to financial harm. @Equifax has forfeited its right to corporate secrets."]["@Equifax All of @Equifax’s actions up to this point demonstrate that this is not a company that deserves to be trusted with Americans’ personal data."]["@Equifax A big financial institution screws up. Executives walk away with millions of dollars. Tens of millions of Americans end up holding the bag."]["The story of the @Equifax data breach is a familiar one."]["LIVE: @SenateBanking &amp; @BankingGOP demand answers from fmr @Equifax CEO on data breach that exposed 145M Americans https://t.co/G9vpwoMnYF"]["@Manyakitty307 @WhirlpoolCorp Hi Julie! Soundcloud has an app for Androids - you can download it here: https://t.co/dBpf9JroT8"]["Is this from @TheOnion? Equifax should not be trusted with taxpayer dollars. https://t.co/PT3llquEdO"][".@WellsFargo CEO refuses to commit to ending use of forced arbitration clauses. The bank will continue to deny customers their day in court. https://t.co/yMStqxyGI4"]["In Ep1 - Nobody's Rust Belt - I talk to OH workers from Clyde @WhirlpoolCorp plant about modern manufacturing jobs. https://t.co/c52hEMzh4m https://t.co/UaUoPqwjTr"]["On my new podcast Canarycast, we're going to talk about what we can do to make hard work pay off again. https://t.co/c52hEMzh4m https://t.co/0Ebfk0WJGG"]["These brave servicemembers represent the best of Ohio. Grateful to have them helping on the ground in Puerto Rico. https://t.co/cUGKKX1sAg"]["@WellsFargo We should be supporting @CFPB &amp; other financial watchdogs that stand up for hardworking Americans when big comps take advantage of them. -SB"]["@WellsFargo We need rules to guard against abuses in forced arbitration, payday lending, debt collection, mortgage servicing &amp; credit reporting accuracy"]["@WellsFargo And yet @WellsFargo told this committee that fraudulent sales practices were limited to the Community Bank."]["@WellsFargo The bank was aware of the problems in its auto loan division in July 2016."]["@WellsFargo It also revealed it had stuck 800k customers w/ auto insurance policies – w/o telling them or checking to see if they already had insurance."]["@WellsFargo In August, @WellsFargo finally disclosed that the number of fraudulent accounts was at least 3.5M -- 70% higher than it originally reported."]["@WellsFargo Before being forced to come clean by a multi-agency investigation, @WellsFargo went to great lengths to bury this scandal."]["@WellsFargo We have learned over the past year that the problems at @WellsFargo are much larger and more systemic than the bank originally disclosed."]["@WellsFargo The bank’s punitive sales goals had pressured its employees into opening over 2 million fraudulent checking and credit card accounts."]["A year ago, then-@WellsFargo CEO John Stumpf sat in this hearing room attempting to explain the inexplicable."]["LIVE NOW: Sherrod &amp; @SenateBanking press @WellsFargo CEO Timothy Sloan for answers for millions of cheated consumers https://t.co/y1SpYur6ID"]["@AjitPaiFCC @FCC Without #NetNeutrality, the internet would fall under control of a few companies to tell you what you can or can't have access to online."][".@AjitPaiFCC has been intent on destroying #netneutrality as head of @FCC - he is a danger to free &amp; open internet. https://t.co/Col7xwYz6i"]["Thank you to all law enforcement, first responders &amp; medical personnel responding to this horrific tragedy."]["We stand with Las Vegas &amp; everyone affected by this senseless violence. https://t.co/PVyUiRLBqF"][".@HHSGov's taxpayer dollars should go toward healthcare, not private jets. My full statement: https://t.co/4nI71jFRy1"]["Wishing an easy fast to all Ohioans observing #YomKippur. G'mar chatimah tovah."]["Partnering with @SenMarkey to ensure accountability in prescription painkiller production - learn more: https://t.co/KAsfVehhC0"]["Drug companies &amp; DEA have a responsibility to make sure they aren’t over-producing opioids that end up on Ohio streets."][".@DwyaneWade - on behalf of all Clevelanders, welcome to our city. \n\nA helpful place to start, from the experts: https://t.co/96tIWP8kgJ"]["Hoping for speedy recovery for all involved. Thank you to officers who put themselves in harm’s way to keep us safe. https://t.co/tof69K7fLC"]["Great news. We must continue to expand opportunities for students to graduate without crippling debt &amp; prepare themselves for good jobs. https://t.co/7Vgdik4Qe4"]["Glad to have you back, @SteveScalise! https://t.co/L2VQd50fth"]["Even one veteran losing his or her life to suicide is too many. Pressed @SecShulkin on how he plans to address this public health crisis. https://t.co/fWCQ5m3RVc"]["This is an important 1st step. We need to come together to lower prices &amp; make healthcare work better for everyone. https://t.co/QmWN3yn6gd"]["Working Ohioans deserve tax reform that helps them keep more of the money they’ve earned &amp; creates good-paying jobs. My full statement: https://t.co/3VP6o0gmKT"]["Proud to be one of many #MenForChoice. https://t.co/6SDXEU1Nsu"]["Sherrod is answering healthcare questions LIVE on Facebook. Tune in here and comment with your questions: https://t.co/cM0xOAdA1n"]["Looking forward to taking your questions during my Facebook Live town hall on healthcare tonight at 6pm → https://t.co/cM0xOAdA1n https://t.co/HmHLP7gTtV"]["@CFPB @CMSGov @usedgov As elected officials, it’s our job to protect the people we serve – not banks and corporations trying to scam consumers. -SB"]["@CFPB @CMSGov @usedgov And I’m urging the Administration to do the right thing and move forward with protections at @usedgov and @CMSGov."]["@CFPB @CMSGov @usedgov I’m supporting @CFPB's rule &amp; fighting efforts to overturn it, making it easier for banks like Wells Fargo to deny rights to their customers"]["@CFPB @CMSGov @usedgov Now the Senate is considering doing the same as early as this week."]["@CFPB @CMSGov @usedgov The House already passed a law overturning @CFPB's rule, voting to leave consumers vulnerable to sneaky clauses by banks &amp; payday lenders."]["@CFPB @CMSGov @usedgov But now action by Congress and the Administration puts those protections in jeopardy."]["Thankfully, the @CFPB, the @CMSGov, and @usedgov took action to protect consumers."]["These clauses, tucked in the fine print, force Ohioans to sign away their rights to access the court system if they are cheated."]["The recent fake account scandal at Wells Fargo and the data breach at Equifax have brought to light so-called “forced arbitration.”"]["WATCH LIVE: As Congress debates overturning @CFPB’s arbitration rule, Sherrod stands up for working families → https://t.co/1i75eG5saH"]["@Equifax @Equifax executives cannot be allowed to wash their hands of this while millions of Americans are left to deal with the consequences. -SB"]["There’s no easy out for working families that @Equifax exposed to cyber criminals, so there shouldn’t be a big payday for the company’s CEO. https://t.co/xVlJ9T3G6w"]["Have you submitted your questions about #GrahamCassidy for my Facebook Live Town Hall tomorrow night? Comment here: https://t.co/cM0xOAdA1n"]["As we honor Little Rock 9 let’s remember how much work is left to ensure all children have access to = opportunities https://t.co/qaTDKTD5QO"]["This move shows @Target understands that investing in workers is not just the right thing to do, it’s good for business. https://t.co/uTquevbU1W"]["NEW LINK: We’re continuing to stream today's #GrahamCassidy hearing - watch what's happening right now here → https://t.co/vpnNapaHn2"]["Entering the hearing earlier with 200 letters from Ohio to enter into the record. https://t.co/Hi3wbYmIwO"]["TUNE IN NOW: Sherrod begins his line of questioning at today's Senate Finance Committee hearing on #GrahamCassidy https://t.co/3OuOo6zZkb"]["Bottom line: we cannot strip healthcare away from our children, our parents &amp; grandparents, our friends &amp; neighbors in recovery, &amp; our vets. https://t.co/WNm6iaN5xL"]["Keep speaking out. We’re listening. https://t.co/G3f5Q23l42"]["We are streaming today's hearing on #GrahamCassidy from Senate Finance Committee live on Facebook - tune in here → https://t.co/3OuOo6zZkb"]["This hearing should have been held in a much larger room, allowing more Americans to participate. https://t.co/ZsPr8NlLiX https://t.co/3EFEpNPQy8"]["Thank you to Youngstown Historical Center of Industry &amp; Labor for their efforts to preserve the rich history of manufacturing in the Valley."]["It is important that we take time to remember the history of our communities and celebrate the achievements and dedication of our workers."]["#BlackMonday devastated the Valley - but the workers who forged the steel that built this country did not give up."]["40 years after #BlackMonday, Youngstown held the inaugural Steel Heritage Week. https://t.co/5qBOYkSznC"]["Join my Facebook Live town hall tmrw, where I'll answer your Qs about the latest attempt to take away healthcare → https://t.co/cM0xOAdA1n https://t.co/fDSzsQ4L0I"]["Hundreds are already in line to watch today's hearing on #GrahamCassidy - you can watch the full livestream at 2pm @ https://t.co/6WU0F8Su8V https://t.co/44jZXE1sme"]["@HHSGov To ensure that taxpayer money is spent responsibly, urged @MickMulvaneyOMB to investigate taxpayer-funded travel in the Executive Branch. https://t.co/T8jwrwDlMS"]["Every dollar from @HHSGov should go toward keeping Americans healthy - not private jets for Secretary Price. https://t.co/7rWVUf7x9X"]["@AmerMedicalAssn @AARP: the bill “would result in an age tax for older Americans who would see their health care costs increase under this bill.”"]["@AmerMedicalAssn: \"We believe the Graham-Cassidy Amendment would result in millions of Americans losing their health insurance coverage...\""]["There’s a lot of conversation about what exactly #GrahamCassidy would do to your health insurance – here’s what the experts are saying:"]["WATCH LIVE: Sherrod stands w/ Ohioans against Graham-Cassidy, which takes away our number one tool to fight opioids. https://t.co/S7SlBVmHXG"]["@cbo We cannot let politicians in Washington, with taxpayer-funded healthcare, pull the rug out from under Ohio families and communities."]["@cbo And #GrahamCassidy allows insurance companies to charge Ohioans age 50 and older more for their insurance."]["According @CBO, the House GOP plan - nearly identical to #GrahamCassidy - would cause premiums to go up an average of about 20% next year."]["And whether or not you're on Medicaid, you're looking at a premium increase next year if #GrahamCassidy becomes law."]["As well as the 3 in 5 nursing home residents in Ohio who rely on Medicaid to cover the cost of their care."]["Also hurt: 71,000 veterans in Ohio who get their coverage through Medicaid, and 150,000 Ohioans getting opioid treatment."]["So who gets hurt by these Medicaid cuts?\nTo start: 973,000 children in Ohio who rely on Medicaid for their health insurance"]["It cuts a net $20 BILLION from Ohio. For every $1 OH spends on Medicaid on average, 63¢ comes from federal $ that #GrahamCassidy would cut."]["#GrahamCassidy is just another name for kicking people off their insurance - it's dangerous and it will do irreparable damage to Ohio."]["On #WorldAlzheimersDay we shine a light on a disease that affects many Ohio families - and we recommit ourselves to working toward a cure. https://t.co/S5nAYcLwO6"]["@SenateBanking @WellsFargo @Equifax Congress needs to stand on the side of working people, not Wall St. These hearings are about getting answers for the people we serve. -SB"][".@SenateBanking will hold two bipartisan hearings in October to press @WellsFargo and @Equifax for answers. https://t.co/UVapuTGLir"]["Everyone should be able to go to work each day knowing they will come home safe and healthy. Read our full letter to @SecretaryAcosta → https://t.co/N2Jsa6ZEA7"]["Learn more about my new bill, the Protecting Workers and Improving Standards Act: https://t.co/XU6bWq9cKh"]["So-called right-to-work laws give corporations the ability to trample workers’ rights and dismantle unions. I refuse to let that happen."]["We cannot let politicians with healthcare paid for by taxpayers throw hundreds of thousands of Ohioans off of their health insurance. https://t.co/GCIUB5UCmn"]["Proud to see this important initiative from Ohio's @kroger. They set an example for us all. #NoHungerNoWaste https://t.co/s6CYfmsvi3"]["We cannot let politicians in Washington, with taxpayer funded healthcare, pull the rug out from under Ohio families and communities."]["#GrahamCassidy is just another name for kicking people off their insurance."]["There is no excuse here - nursing home residents deserve the right to seek justice if they are mistreated. Period. https://t.co/UKRbi8oKVT"]["We’ve heard far too much talk about what’s good for corporations and not enough talk about what’s best for American workers. -SB https://t.co/I7o1kBXnN1"]["It freezes @PPFA funding, It weakens protections for coverage w/ pre-existing conditions.\n \nIt's bad for Ohio and it's bad for our country."]["It enables states to redefine what qualifies as an \"essential health benefit\" – taking 10 benefits away from Ohio families."]["It allows insurers to slap an age tax on Ohioans 50 + and raises their premiums."]["This bill slashes the No. 1 tool we have in the opioid fight — Medicaid treatment."]["It will undoubtedly cause premiums to spike."]["#GrahamCassidy is just as dangerous as every repeal plan we've seen so far."]["If we want to prepare students for 21st century jobs, we need to invest in 21st century classrooms. Good to discuss my plan in CBUS today. https://t.co/JsmStDiw6r"]["@WhiteHouse As a member of bipartisan HBCU caucus, looking forward to supporting our nation’s HBCUs together - including Wilberforce &amp; @CentralState87."]["Congratulations to Ohio's Johnathan Holifield, the new Executive Director for @WhiteHouse Initiative on HBCUs. https://t.co/e9XMvLxSD9"]["This #MakeWorkPayMonday, read about my plan to fight back against worker misclassification &amp; restore workers' power: https://t.co/3csrCy7mEF"]["Temp workers, contractors &amp; subcontractors are often paid lower wages &amp; provided less job security, fewer benefits &amp; fewer legal protections"]["\"The contractor model offers comps lower costs, more flexibility &amp; fewer management headaches. Workers get far less from the arrangement.\" https://t.co/A7NXNcw7BS"]["A message to @MLB Commissioner Manfred from Sherrod (and Franklin) on the @Indians' historic win streak → https://t.co/F6qqWPOLR6"]["The best way to appreciate truck drivers is to honor our commitment &amp; ensure they get the pensions they earned. #TruckDriverAppreciationWeek"][".@MLB Commissioner Manfred: it's time to set the \"record\" straight. @Indians' 22nd win makes them rightful owners of ⚾️ longest win streak. https://t.co/wzwR3JXEXi"]["Joined with Senator Cassidy - my co-chair of the Senate Subcommittee on Social Security - to demand answers from @SocialSecurity Admin. -SB https://t.co/clkeoU9rsr"]["We need to know whether SS data is vulnerable to cybercriminals and I intend to find out what’s being done to ensure all are protected. https://t.co/zfvmS6iUqs"]["We honor &amp; remember these brave servicemembers, and we stand w/ their loved ones. Their sacrifice - and their patriotism - is not forgotten. https://t.co/siCgwh7iH4"]["@BetsyDeVosED @CFPB We're asking @BetsyDeVosED to reverse this decision. Students and borrowers cannot afford to see these protections rolled back. https://t.co/ed8tQsrs8w"]["@BetsyDeVosED @CFPB @CFPB oversight protects students from predatory lenders &amp; other bad actors - this decision leaves them at the mercy of shady corporations."][".@BetsyDeVosED tried to sneak this under the radar before Labor Day Wknd - but she's refusing to share student aid complaint info w/ @cfpb."]["Make that: ⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️\n\n@Indians - you made Cleveland very proud tonight."]["WATCH LIVE: With NDAA on the floor, Sherrod calls for Equifax protections for servicemembers → https://t.co/tsms5sdLGo"]["Washington's best ideas to pay for huge tax cuts for Wall St are to slash SS &amp; then steal from workers' retirement. \nTwo words: hell no. -SB https://t.co/2EMmZC3LR7"]["But if they want to steal from middle-class families’ retirement for Wall Street, they will have one hell of a fight on their hands. -SB"]["If POTUS &amp; Rs want to work w/us to build a tax code that puts more $ in pockets of working fams &amp; small biz, Ds are ready to work together."]["Not if I have anything to say about it."]["You’ve got to be kidding me: their 2 best ideas to pay for huge tax cuts for Wall St are to slash SS &amp; then steal from workers' retirement."]["The latest idea is to tax working families’ retirement savings. https://t.co/5JzXGZDC9P"]["Martin Feldstein let the cat out of the bag: Washington plans to pay for tax reform with cuts to SS &amp; Medicare. https://t.co/jA3vnZ0HYJ"]["Updating the EITC through our GAIN Act will make sure all workers can keep more of the money they earned for their work. https://t.co/jzC3wS77Ny"]["⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️⚾️ #history  \n\ncc: @Indians"]["@CFPB Before you ever click \"I agree\" or sign a dotted line - always read the fine print."]["@CFPB Some for-profit colleges include forced arbitration clauses in their enrollment contracts for new students. https://t.co/ZvaRiYJybM"]["@CFPB Certain employers even include forced arbitration clauses in their contracts. https://t.co/pln5JhjSzU"]["@CFPB The nursing home industry is one repeat offender - many contracts force residents to give up their rights. https://t.co/Db6dU4HExj"]["@CFPB But banks &amp; payday lenders aren't the only abusers of forced arbitration - it exists in footnotes and fine print of all kinds of contracts."]["@CFPB Take advantage of the @CFPB's resources before you sign financial contracts: https://t.co/HgGm9kq7yD"]["@CFPB Congress must support the @CFPB rule and stand with you, not Wall Street. https://t.co/FLXWOsUCh2"]["@CFPB's rule will stop banks &amp; payday lenders from using arbitration to limit your rights – but that rule is under attack in Congress."]["After the fake account scandal, Wells Fargo's arbitration clauses continue to prevent customers from seeking justice https://t.co/Uk1PXXcdkI"]["Forced arbitration clauses live in the fine print. When you sign certain contracts, you may be signing away your rights."]["Equifax's data breach put the spotlight on forced arbitration - which bars consumers from going to court in the event that they're cheated."]["@Equifax If they knew about breach when they sold those stocks, that’s insider trading. We're calling for it to be prosecuted to full extent of law. https://t.co/9MncoIU0CS"][".@Equifax knew about the breach in late July, but customers weren't notified until 9/7. Meanwhile, 3 top Equifax execs dumped their stocks."]["Proud of the committee’s bipartisan effort to extend CHIP funding for 5 more yrs &amp; protect healthcare for OH children across the state. -SB https://t.co/ImUacskcmm"]["Edith will be remembered for the bravery &amp; pride she showed as she led the fight for what's right. https://t.co/K0tbSOUgFA"]["Excited to be joined by Marian Wright Edelman &amp; @senrobportman at Propel Ohio Collegiate Leadership Summit. More: https://t.co/Yiq4VJJ8Jy https://t.co/964Sbfbg0n"]["The fact that it took public shaming for this to happen is further proof why @CFPB's rule is needed. https://t.co/oKVPyoHCZ6"]["Our veterans don’t often speak about their service. But through these medals and these ceremonies, we learn their stories."]["Honored to present overdue military medals to George Burress, a Vietnam veteran from Cleveland, today. https://t.co/mWwGkGmpV9"]["Making sure all of our kids have access to the best possible care is something we should all be able to work together on. -SB #CHIP https://t.co/WpEkgWFI2I"]["Regardless of whether @POTUS chooses to declare opioid epidemic a national emergency, continued inaction on this issue is deeply concerning. https://t.co/hqj6jgSPQ6"]["Our first responders, military, &amp; all those who sacrifice to keep us safe show the world our spirit of service, determination &amp; unity."]["On 9/11 we reflect on the memories of those we lost. We also honor &amp; thank those who responded to call to action that day &amp; every day since."]["Moved by the selflessness of these Ohioans - and all others from our state who've helped with relief efforts.\nhttps://t.co/iGjsc7KIQA"]["Don’t forget to follow what's happening at this year's Ohio Women’s Leadership Conference on our new Instagram → https://t.co/CnfzQk3G3E https://t.co/zhKkLxh2HN"]["WATCH LIVE: Sherrod, @ConnieSchultz &amp; @SenKamalaHarris take the stage at 3rd Annual Ohio Women’s Leadership Summit → https://t.co/k8HZY7uUbP"]["As they say, a picture’s worth 1,000 words. Check out our new @instagram to see more of what we're doing for Ohio: https://t.co/CnfzQk3G3E https://t.co/NVZyPcT9IK"]["@WarrenBuffett American consumers deserve better. Wells Fargo needs to stop avoiding accountability and return to @SenateBanking to explain themselves."][".@WarrenBuffett is right – fake accounts, unfair overdraft fees, scam insurance &amp; forced arbitration. How many more cockroaches are there? https://t.co/tEszQ5beBJ"]["This is one more reminder why @CFPB’s rule blocking forced arbitration is so important to protect the rights of working Americans. -SB"]["Equifax should remove forced arbitration from TrustedID immediately, not take advantage of customers they put at risk."]["Now it’s pushing credit monitoring w/a fine-print arbitration clause that requires victims to give up their right to seek justice in court."]["Equifax’s breach affects 143M Americans who didn’t choose to be monitored."]["Equifax victims: read the fine print before signing up for credit monitoring. You could be signing away your rights. https://t.co/pDrZarIXXJ"]["One August highlight was traveling around the state to hear from Ohio farmers. Proud to bring their concerns to DC → https://t.co/7hbQhLLcye"]["Proud to testify on behalf of Ohio @WhirlpoolCorp workers at ITC today. These workers - and all Ohioans - deserve a level playing field. https://t.co/bq07pdWVMk"]["@SecPriceMD We spend a lot of $$$ treating people once they are sick, but let’s talk about how we can prevent them from getting sick in the first place."]["Wrote to @SecPriceMD with Senator Cassidy, asking him to work with us to fix the healthcare system so it keeps people healthy. https://t.co/JEIaIsmWra"][".@POTUS did the right thing – he reached across aisle &amp; worked w/ both parties to get this done. That’s the work we were elected to do. -SB https://t.co/b86k0iFo1g"]["Proud to team up with @senrobportman on a pair of bills to do just that. Learn more: https://t.co/Vw5tcwiuCZ"]["Awful. This is why we must continue to work to stop fentanyl from reaching Ohio communities. https://t.co/FSdJ7qKpGx"]["If they’re confirmed, will Quarles &amp; Otting begin working for American taxpayers or will they continue working for the banking industry? -SB"]["Otting’s bank made $ by kicking seniors &amp; fams out of their homes while pocketing $2.5B from the FDIC to protect his bank from these losses."]["I am not confident Quarles took to heart the costly lessons of the financial crisis.  He seems far too ready to relax the rules for Wall St."]["The financial crisis devastated Ohio communities and communities across the nation with lost jobs, foreclosed homes, and evaporated savings."]["Two words: Rally Together. https://t.co/fFLLFNvvUm"]["These brave Ohioans - and other Ohioans helping with relief efforts - represent the very best of our state. https://t.co/ocvsuS6UEK"]["Making sure all of our kids have access to the best possible care is something we should all be able to work together on."]["Because of CHIP, 209k Ohio children have access to quality, affordable health care today – health care they may not have received otherwise."]["Stood with Ohioans in Cleveland today to call on Congress to extend the Children's Health Insurance Program. https://t.co/aiG99vnQOi"]["It says a lot about a policy when the official announcing it refuses to take questions from press. This cannot be justified. #DACA"]["This Labor Day, let’s celebrate by recommitting ourselves to respecting and valuing hard work. -SB https://t.co/AVGIJ1cGy5"]["Americans work too hard for too little. This Labor Day, Sherrod’s leading the convo about making hard work pay off. https://t.co/AVGIJ1uhpD"]["We will not let Washington politicians with taxpayer-funded retirement accounts steal from workers. -SB"]["I have two words for this: hell no. https://t.co/5JzXGZDC9P"]["This is one concrete step we can take, right now, to help stop fentanyl from entering our communities &amp; destroying any more Ohio families."]["On Overdose Awareness Day yday, spent time w/ OH law enforcement to discuss my INTERDICT Act—which wd help keep fentanyl out of our country. https://t.co/z9abk3rV29"]["Franklin may have a bone to pick with me about this constituent meeting... -SB https://t.co/X0HkOdO1wW"]["A proud Buckeye tonight. Let's start the season strong! #GoBucks https://t.co/I1l5nujxNL"]["I call on @POTUS &amp; @SecretaryAcosta to make good on the President’s campaign promise to fight for workers and appeal the ruling. -SB https://t.co/aVdXQ0WJvI"]["We can’t grow a strong economy if we only focus on coasts or big cities—smaller cities &amp; towns are where so many Ohioans live &amp; raise fams."]["Good to join local mayors and business leaders in Dover, Ohio today to discuss the need for economic policies that work for Ohioans. https://t.co/rwEcEFYWlt"]["Wells Fargo harmed millions more customers than originally disclosed, and continues to avoid accountability by hiding behind the fine print."]["Outrageous. https://t.co/J0WWmqEZpX."]["When helping #HurricaneHarvey victims, beware of any charity scams looking to steal your money or info. https://t.co/BTG1Yw0UDg"]["In the midst of such generosity, it is important to recognize the presence of scams that are claiming to be charities for #Harvey relief."]["Proud to be an Ohioan as so many from our state dedicate their time and resources to help with the relief efforts for #HurricaneHarvey."]["@SenWarren @SenFeinstein @SenKamalaHarris Pacific 9 is just one abusive trucking company. All US corps must be held accountable to not support labor abuses. https://t.co/ixL92N24ym"]["After we questioned 16 retailers abt their work w/ trucking companies who abuse workers, Costco reportedly dropped its contract w/ Pacific 9 https://t.co/hQigpvUNsl"]["Asked @BetsyDeVosED to appoint qualified, independent permanent Chief Enforcement Officer—this doesn't pass the test https://t.co/1tOsmv3Bza https://t.co/A0OIJiGcOu"]["Our hearts break for Nick's loved ones, and all those affected by Hurricane Harvey. https://t.co/8oRcsMRx7f"]["We must set high standards &amp; put workers ahead of corporations. Read my full 4-point plan for NAFTA renegotiation: https://t.co/8JbMj37ppR"]["We know what causes outsourcing: low wages &amp; exploited workers. That's why I've called for strong labor standards up front in NAFTA talks. https://t.co/Kpge8HOwzu"]["I work with this president when he’s right on trade. -SB https://t.co/01UzRJP5hE"]["The work done at Magna TEAM Systems is another example of the skill and innovation of Ohio workers. Thanks for a great tour today. https://t.co/eLXWu2BN2t"]["Manufacturers and businesses like @WhirlpoolCorp are cornerstones of our economy. Great to visit their plant in Clyde today. https://t.co/oCPZ4Rf2oM"]["Wishing @SenJohnMcCain - a great sparring partner and an even better friend - a very happy birthday."]["I want workers at the table. I don't want these trade agreements written by corporate interests. -SB https://t.co/7liYqkHVfb"]["As we start work on next Farm Bill, I want to hear directly from OH farmers. That’s why I’m holding RTs like this one around the state. -SB"]["Great to meet Ohio farmers at a roundtable in Wooster today. https://t.co/hh3TGhRvEf"]["I’ve stood up to presidents of both parties against bad trade agreements. -SB https://t.co/pJapDP7HkF"]["Meeting with Ohioans - and Mansfieldians - is always a highlight. https://t.co/uWOsy1ZJiQ"]["We must not rest until every woman in OH &amp; around the globe has the opportunity to harness her power &amp; her abilities to reach her potential."]["On #WomensEqualityDay, we take stock of how far we've come towards ensuring = opportunities for women - but recognize how far we have to go."]["Petty Officer Drake’s passing is heartbreaking news for Ohio and for our nation. -SB https://t.co/sX4BdvS9tX"]["Shameful. We should not turn away anyone who is willing and able to serve this country and help keep America safe. https://t.co/Pq2lmoPY74"]["Sebastian Gorka - and all who share his extremist views - have no place in the White House. -SB https://t.co/P9QwYL1gXt"]["An honor to meet with law enforcement and faith and community leaders at the National Underground Railroad Freedom Center in Cincinnati. https://t.co/tIztARd5Vf"]["Grateful for the service of these Ohioans - and thinking of those in #HurricaneHarvey's path.  Stay safe. https://t.co/oy0EomeFB0"]["Thank you for this beautiful tribute, @senorrinhatch. We’re thinking of Jacob’s family during this horrible time. https://t.co/0GyJ9pgGza"]["Hey @timkaine - looking forward to the @Indians vs @Royals game tonight. \n\nNo need to be intimidated - we're only 6 games up. -SB"]["It’s our responsibility to make clear, without equivocation, that racism and hate are not welcome in our state."]["Met with Ohio law enforcement and community leaders in Columbus today to discuss how we can continue to keep Ohio communities safe. https://t.co/BHVQ1WSMjN"]["My office and I will continue working with community partners to ensure rural Ohio gets the support it needs. -SB https://t.co/UhbILUFkvD"]["On this day 26 years ago, the people of Ukraine boldly declared their independence from Soviet rule. Happy Ukrainian Independence Day!"]["We must defend @CFPB’s new arbitration rule and protect Ohioans’ right to a day in court when they’re ripped off by big companies."]["Wells Fargo promised to make things right, but continues to pursue forced arbitration against customers it harmed. https://t.co/MlRp3ZaWxT"]["Great news. Every Ohioan - and every American - deserves access to affordable, quality health coverage. https://t.co/TuuVKkPlwJ"]["We should not turn away anyone who is willing and able to serve this country and help keep America safe.  -SB\nhttps://t.co/IDXCvTllpo"]["Overturning @CFPB’s arbitration rule will help banks &amp; payday lenders continue to get away with cheating customers. https://t.co/GljxqpRHfb"]["Requested answers today from AG Sessions &amp; FBI Director Wray on how their agencies will support state &amp; local law enforcement in this fight. https://t.co/Ww4HraQ6DP"]["It's simple: fed law enforcement agencies should help local and state police keep Ohioans safe from hate crimes &amp; domestic terrorist groups."]["The untold story of Bannon's firing is how many Bannon acolytes are still in positions of power all over the Admin. https://t.co/iZums7YQEQ"]["Thinking of Jacob’s family during this horrible time, and joining Ohioans in praying for Jacob’s well-being and safety. https://t.co/yDBTLzvt6l"]["If work isn’t valued, Americans can’t earn their way to a better life for their families. Read my letter in @nytimes https://t.co/YIgmxyKwzG"]["A commitment to ‘win’ is not a clear strategy, and our troops on the ground in Afghanistan deserve more. -SB https://t.co/e2k99z602Q"]["HHS' Teresa Manning referred to Joe Sobran - an anti-Semite known for calling Holocaust deniers \"courageous\" - as a \"national treasure.\""]["Cleveland, don't forget to save your Eclipse glasses - we're in the path of totality for the next eclipse in 2024!"]["Connie and I are thinking of Judge Bruzzese and his family, and we pray for his recovery. -SB https://t.co/YxqGMMHGJS"]["Thoughts are with these brave sailors and their loved ones. https://t.co/rAzvu7oh1s"]["The WH's Julia Hahn is closely aligned with Bannon's views - Ann Coulter said that she wants Hahn to be Pres \"as soon as she's old enough.\""]["Sebastian Gorka, a deputy assistant to the president, said that the recent bombing of a MN mosque may have been a \"fake hate crime.”"]["Take Stephen Miller - who the noted white supremacist Richard Spencer claimed as a mentee."]["We must not rest until President Trump has removed each of these anti-Semitic, racist, misogynistic cronies from his Administration."]["Bannon's removal is a good step but just a start. The WH is full of his acolytes - people who embrace the same bigotry &amp; hate as he does."]["Proud to join this effort. Symbols of the confederacy shd be removed from taxpayer-funded public property &amp; put in museums where they belong https://t.co/uAmCqQoaRt"]["In the light of this week's events, let’s talk about some of the best ways to stand up to hate. https://t.co/zWPA9bZi57"]["In other words, the President of the United States should begin to act like the President of the United States."]["Steve Bannon should have never been in the WH. He has promoted anti-Semitism, racism and misogyny, embracing bigotry and hate speech."]["Horrified by today's events in Barcelona - as we learn more, thinking of those affected and sending gratitude to first responders."]["We will not tolerate threats, intimidation or violence against our neighbors."]["As proud Ohioans, it’s our responsibility to make clear to the KKK &amp; others that their hate is not welcome here. https://t.co/EajWkwLVzy"]["Millions of Ohioans and tens of millions of Americans of all backgrounds support you."]["To anyone who may be feeling afraid, unsafe or unwelcome as a result of hate and bigotry, please know that you are not alone."]["We stand w/this family &amp; anyone targeted by hate. Bigotry, racism &amp; antisemitism are not welcome in our communities. https://t.co/7o0jB7hl7X"]["Proud of the bipartisan efforts to pass this bill into law &amp; look forward to continuing to work on behalf of those who served our country. https://t.co/I1EDJcOrzt"]["As @RichardTrumka said yesterday: American workers reject bigotry. The business community must do the same. https://t.co/haywaKtV4y"]["It's up to each of us to speak out against racism and bigotry and antisemitism. -SB https://t.co/VvRDPvaogB"]["“On behalf of America’s working people, who reject all notions of legitimacy of these bigoted groups.” https://t.co/xP27zaJIKH"]["@AP We cannot let racism hide behind the cloak of euphemisms or turns of phrase. We must call it what it is: bigotry, hatred, intolerance."]["\"At @AP....the term 'alt-right' should be avoided because it is meant as a euphemism to disguise racist aims.\" https://t.co/j3u6Fqjt7s"]["American jobs shouldn’t be up for negotiation. This time workers must be at the table. My @USATODAY oped on NAFTA → https://t.co/0EdMngglPO"]["This is only the tip of the iceberg when it comes to changes Wells Fargo needs to make to restore public confidence https://t.co/pTLgXafdw1"]["There are not ‘many sides’ to blame for #Charlottesville. There is right and wrong. White nationalism, hatred and bigotry are wrong. -SB"]["I urge POTUS to end the dangerous game he is playing and work w/ Dems &amp; Repubs to make good on these payments and stabilize the market. -SB https://t.co/I335vzT8QW"]["We can't turn the clock back to the days when Wall Street was free to prey on Ohioans, wreck the economy, and hand taxpayers the bill."]["When China cheats our trade laws, Ohio workers pay the price. Read my full statement on POTUS' trade action against China: https://t.co/0ONG6INTJr"]["As Bill's wife Annie said, \"Bill Burke and I stand for peace and equality, not hatred and injustice.\""]["Thoughts are with Bill Burke, his loved ones, and all those affected by yesterday's violence in Charlottesville. https://t.co/y6nB3wJwKt"]["I stand with my Republican colleague. This was domestic terrorism. We must all condemn white nationalism. -SB https://t.co/3EaqilKL7h"]["Ohio stands behind Virginia as the state copes with this senseless violence. My full statement: https://t.co/7lAXMmzkbD"]["Hatred and bigotry have no place in America. We must stand united against attempts to threaten and intimidate our friends and neighbors. https://t.co/SMVauuYkCp"]["While this is an important step, combatting the opioid epidemic requires more than words - it requires meaningful action and investment. -SB https://t.co/l2KCQtqM3o"]["We need to restore value to work, which will make our country a better place for every single American. https://t.co/LYlBBhnbAG"]["The bottom line here: Wages and benefits have declined or stagnated for American workers for decades. https://t.co/UMrD9TcPd7"]["#TBT to a great evening on the softball diamond with the Blue Collars. Our team cheer is timeless: Fair Trade, Fair Calls! https://t.co/iwnOLXuT5c"]["@CFPB We can't turn the clock back to the days when Wall Street was free to prey on Ohioans, wreck the economy, and hand taxpayers the bill."]["@CFPB Despite this, too many in Washington seem to have amnesia about the havoc wreaked by Wall Street."]["@CFPB Many still haven't recovered from crisis. 17% of OH homeowners owe more on their mortgage than their home is worth. https://t.co/hikxHhmoO4"]["@CFPB But Wells Fargo's continued cheating is just one example that shows we still have work to do. https://t.co/OgC1WwQCCU"]["We passed Dodd-Frank Wall Street reform and created the @CFPB to protect American consumers."]["We've come a long way since then to protect Americans from Wall Street greed. https://t.co/HPscEoRtJV"]["A financial crisis that would cost millions of Americans their jobs and homes began 10 years ago today."]["We cannot allow for-profit colleges to cheat veterans out of the quality-education they’ve earned. -SB https://t.co/fQ6BMQb2Zy"]["This is outrageous. DOJ should make it easier, not harder for Ohioans to exercise their right to vote. https://t.co/oHsux2w64p"]["Congratulations to Sr. Airman Joshua O’Sullivan for this honor - our nation is grateful for his service. https://t.co/eHKnr09Vda?"]["On #PurpleHeartDay, we honor those who have sacrificed to keep Americans safe, and thank them for their service to our country."]["In today's edition of Ohio Fun Facts: learn about the annual @TwinsDaysFest in Twinsburg, Ohio → https://t.co/P0j3ag94kL"]["It’s possible for Rs &amp; Ds to find common ground and workable solutions. We’ve done it before &amp; we can do it again. \nhttps://t.co/oTbgKmvLtE"][".@FCC has received 15M+ comments from folks speaking out on net neutrality - the comment period should be restored to its original length. https://t.co/rLn9mOcbT2"]["CHIP has often been the difference between getting the care they need to grow into healthy adults and slipping through the cracks."]["For the last 20 years, millions of children across the country have depended on CHIP for their healthcare needs. https://t.co/JBV9DPDR61"]["A heartbreaking tragedy. My thoughts are with James' loved ones and the entire Scouting community. -SB https://t.co/PnV3BwhQ5D"]["\"This is the health care story that nobody talks about.” Thanks to @SteveKoff for this important read. https://t.co/Db6dU4HExj"]["Passing the INTERDICT Act would help stop fentanyl at the border and better protect officers from it while they're on the job."]["Thank you to these officers, and to all law enforcement working to keep our communities safe every day: https://t.co/1cAUeE9Cfa"]["Great to launch a new chapter of @MBK_Alliance in Springfield today - these students will grow into the leaders of the future. https://t.co/Y3ZFJYbHim"]["Giving people more quality choices at reasonable prices is something we can all agree on. -SB https://t.co/xymM7U5BIP"]["A beautiful story about the kindness of people. https://t.co/95WbEJ3ns6"]["But we must do more to ensure no Ohioan has to choose b/w taking care of a loved one &amp; their paycheck - starting w/ passing the FAMILY Act."]["The #FMLA has meant many workers can take needed time off without having to worry about losing their jobs or health insurance. #FMLA24"]["The threats and uncertainty around healthcare need to stop. Instead, let’s work together to lower costs and stabilize the market. https://t.co/SkY7HPPkcK"]["My new bill would provide $100B over 10 yrs to update schools &amp; would create an estimated 1.9M jobs nationally: https://t.co/pOvb3nZTJn"]["Investing in 21st century classrooms will support good jobs, putting Ohioans to work rebuilding schools with American-made materials."]["Students can’t learn in schools that are crumbling around them. https://t.co/Kfc4z5bewb"]["I will keep working w/ @senrobportman &amp; the Admin to make sure Ohio communities have our support in the fight against opioid addiction. -SB"]["This report cannot be the end of the conversation about opioids – we need to work together to turn recs into action. https://t.co/nKFsUvTAEk"]["This comprehensive sanctions bill shows North Korea, Iran and Russia we stand ready to hold them accountable. -SB https://t.co/4N3W3kZpv5"]["WATCH LIVE: Sherrod slams the president's latest nominee to @NLRB &amp; speaks out about the declining value of work. https://t.co/9vqAdn8Xkj"]["It’s pretty simple: Gutting @CFPB’s rule means banks get away w/ cheating their customers. Read my letter in @WSJ: https://t.co/2VtVgm4kKZ https://t.co/4aaXsDc1FQ"]["@senrobportman We need to bring all traffickers to justice. With evolving technology, we must ensure the law keeps pace with this modern-day slavery."]["Proud to work with @senrobportman on our new bipartisan bill to ensure justice for human trafficking survivors. https://t.co/MocPjxoC4t"]["The Low-Income Housing Tax Credit is a critical tool in developing affordable housing and should be protected and expanded."]["#AffordableHousing crisis is poised to get worse. With no action, in 10 yrs nearly 15M Americans could be paying half their income on rent. https://t.co/5LngEDHGMO"][".@SenFeinstein, @SenWarren, @SenKamalaHarris and I demand that top retail CEOs crack down on abuse in the port trucking industry. https://t.co/hOUHDeMSqi"]["We cannot allow corporate profits to come at the expense of workers. #MakeWorkPayMonday https://t.co/Uj75JmZtdj"]["Black women earning 63¢ on the dollar is bad for workers, families &amp; our country. We cannot rest until all are guaranteed = pay for = work."]["Black women have to work 8 extra mos - until 7/31 of following yr - to earn what their male counterparts earn in a yr. #BlackWomensEqualPay"]["WATCH: Sherrod explains how Wells Fargo’s latest scandal proves why Wall St protections are as important as ever https://t.co/OJBp2zRDuz"]["This project is a great example of the value of the LIHTC - one of America's most successful affordable housing programs."]["Make sure you aren’t tricked into a fee when paying bills by phone - thanks to @CFPB for this important warning https://t.co/6Z3SJW1hSF"]["Great news. We must keep working toward a more stable system to ensure every Ohioan has access to health coverage. https://t.co/TA2Zx983J9"]["To commemorate this anniversary, please share your stories - how has Medicaid or Medicare made an impact in your life?"]["52 years ago today, Medicaid and Medicare were signed into law - and it's never been more important to protect these critical programs."]["Because of your bravery in sharing your stories, Ohioans will keep their healthcare coverage. Fewer families will live in fear.\n \nThank you. https://t.co/m2dyzzr5zD"]["Wells Fargo has a lot of explaining to do, and we cannot let up until every single customer is made whole. -SB https://t.co/439tVWoPb2"]["We still have work to do. Now is the time for all of us to come together to lower prices and make healthcare work better for everyone."]["Thank you for telling your stories and making your voices heard. Millions of people will keep their healthcare because of what you did. https://t.co/dyE7GG4G65"]["Let’s kick the lobbyists out, listen to the people we serve &amp; come together to lower prices &amp; make healthcare work better for everyone. -SB"]["This bill failed because people in Ohio and all across the country spoke out and shared their stories."]["@ESPNCourtlen https://t.co/wrUGUvB3io"]["Thanks to all who spoke out to defeat this terrible bill. It’s time for both sides to come together &amp; work on real solutions you deserve."]["Good find, Bob. https://t.co/LO2BbEBfiL"]["We have senators voting on something praying what they’re voting for doesn’t pass – but it very well could. The House could pass this tmrw."]["There’s nothing “skinny” about the damage this bill would do to Ohioans trying to afford care for their families."]["It’s despicable that Senators with taxpayer-funded healthcare are ignoring the pleas of working families."]["WATCH LIVE: Sherrod's on the Senate floor telling the stories of Ohioans at risk of losing their healthcare → https://t.co/QZ52ndHbPV"]["I plan on offering amdt to ensure middle class &amp; those struggling to get into middle class will not see increase in their healthcare costs: https://t.co/IqyNFCjYJB"]["Heartbreaking. We must stand with the victim of this horrible crime and make clear Ohio will not tolerate hate. https://t.co/OSelwhh13v"]["WATCH LIVE: Sherrod speaks as the Senate gets set to pass tough new sanctions on Russia, North Korea, and Iran. https://t.co/3l7mucpPVX"]["This headline says it all. https://t.co/pSTrvnfcTY"]["Governor @JohnKasich knows that's a bad deal. https://t.co/rKVC1Yl9zX"]["What does ‘skinny repeal’ mean for Ohio? \n\n561k kicked off coverage, premiums up $550/year &amp; hospitals out $5mil.\n\nhttps://t.co/HRenxIobI0"]["My concern is whether they will work for American taxpayers and working families. -SB"]["My concern isn’t whether today’s nominees have a great deal of experience working for banks. They do."]["Mr. Quarles bemoaned the role of “the government” as a “player in the financial sector” rather than a “referee.”"]["Mr. Otting’s bank made money by kicking seniors out of their homes, and then turned around and said the government made them do it."]["It was an opportunity to profit by flipping failing banks bought at low prices &amp; foreclosing on working fams–all while raking in taxpayer $."]["But for wealthy bank executives and private equity investors, the crisis wasn’t a life-changing event."]["The financial crisis devastated the Ohio families that lost their jobs, their homes, and their savings."]["Banks were not “well capitalized.” Taxpayers paid billions to bail those banks out while Quarles &amp; his co turned a profit off of the crisis."]["Contrary to Quarles’s predictions in 06, the economy was not “strong,” the financial sector was not “healthy” &amp; our future was not “bright.”"]["But many of his stmts from then lead me to wonder whether he was asleep at the switch or willfully turning a blind eye to Wall St abuses."]["Mr. Quarles served as Treasury’s Undersecretary for Domestic Finance in the years leading up to the 2008 financial crisis."]["Terrible news from the Ohio State Fair tonight - thinking of all those affected and their loved ones. https://t.co/sAjioHkRvA"]["The uncertainty the GOP is inserting in the healthcare market may cause even more people to lose their insurance: https://t.co/gLwC3tq73t"]["It's less about the trailer &amp; more the material of Thor's hammer—we need to crack down on any illegal uru dumping &amp; support American steel. https://t.co/0GdSJrqwlg"]["Up next: a vote to protect Medicaid coverage - the #1 tool we have in the fight against opioids. https://t.co/Szbyg03Y5Z"]["Looking forward to taking your questions during my Facebook Live town hall on healthcare this afternoon at 5:05pm → https://t.co/vb4eoVe0rR https://t.co/6pZT5UlNma"]["All who serve in our military deserve our gratitude &amp; respect. We should not turn away people who are willing &amp; able to serve this country."]["Tonight's vote is more evidence of what we already knew: there's no viable plan to replace healthcare repeal would rip away from millions."]["Whether you were a Girl Scout, a Boy Scout, an Eagle Scout, or part of a Scouting family - what did Scouting and our oath mean to you?"]["The Eagle Scouts oath has been a guiding force in my life. We can all learn from the values it preaches. https://t.co/o4A72h8Xfd"][".@realDonaldTrump - Ohioans behind you are holding up signs that say \"Buy American, Hire American.\" Will you support our Buy America bill? https://t.co/YgCxQZf6iI"]["This is outrageous - stoking fears of voter fraud that doesn’t exist undermines our democracy &amp; damages people’s faith in our elections. https://t.co/G25MmJslBC"]["WATCH LIVE: Sherrod slams today's Senate vote to rip healthcare away from thousands of Ohioans.\nhttps://t.co/Q7Si8wxicC"]["My full statement on the House's passage of the bipartisan sanctions bill I helped negotiate to hold Russia, Iran &amp; North Korea accountable: https://t.co/qxdxNqjccR"]["@CFPB I urge the House to stand with these customers, not lobbyists for big banks and payday lenders. -SB"]["The @CFPB rule will ensure banks like Wells Fargo can’t block consumers from justice in the future."]["Wells Fargo has used fine print arbitration to cheat millions of its customers. https://t.co/nNs7GJ9sKI"]["It’s unconscionable MoC would work to undermine rights of consumers to have day in court when they’re cheated by banks &amp; payday lenders."]["It’s despicable that Senators with taxpayer-funded healthcare are ignoring the pleas of working families. My full statement: https://t.co/NZvrtDi1ex"]["Instead of ripping away these health benefits, we should be working together to lower costs and make healthcare work better for everyone."]["10. Pediatric services - it should be as easy &amp; inexpensive as possible for our kids - like Benjamin from Akron - to get the care they need. https://t.co/e1dLWkPao6"]["9. Preventive and wellness services like screenings and vaccines - cost shouldn't prevent people from keeping themselves healthy."]["7. Rehab services &amp; devices - sometimes, a diagnosis &amp; medication isn't enough to fully recover, and your full treatment should be covered."]["6. Prescription drugs - it's no secret drug prices are getting higher &amp; higher, and insurance is a lifeline for so many who depend on them."]["5. Mental health services &amp; addiction treatment - for people like Brittany, who said Medicaid was critical to her recovery from addiction. https://t.co/iwK3L2o6at"]["4. Care for women when they're pregnant - maternity care and treatment through labor and post-delivery, and care for newborns."]["3. Hospitalization - surgeries, stitches, laboratory tests, and the room and board itself."]["2. Emergency services - because no one should worry about whether or not they can afford care in a crisis."]["1. Outpatient care you receive outside of a hospital - like routine checkups, screenings, and other regular procedures."]["Here's exactly what Republicans are trying to take away from you as they work to repeal the #ACA and the 10 benefits it guarantees:"]["The #ACA widened healthcare access, fought price discrimination, &amp; defined 10 Essential Health Benefits that all insurance plans must cover."]["We’ve seen the devastating effects that human trafficking has on communities in Ohio &amp; across the US - we must do more to fight this crime."]["Recently intro'd a bill to put fed trafficking coordinators in place to streamline efforts to guard against &amp; investigate matters like this."]["Horrific. https://t.co/6WqbGqbLl7"]["Have you submitted your healthcare questions for my Facebook Live town hall yet? Comment here with your Qs today: https://t.co/vb4eoVe0rR https://t.co/85eTHMKckW"]["It also must face consequences for its human rights abuses, including the despicable actions that took the life of Otto Warmbier."]["North Korea must face consequences for its nuclear weapons and missile testing program."]["This holds North Korea &amp; Iran accountable for their actions &amp; sends a message to Moscow - US will not tolerate Russian attacks on democracy. https://t.co/UcoQDQbxUd"]["I urge @SantanderBankUS to respect the rights of these workers to elect union representation that will give them those protections. -SB"]["It’s critical workers are empowered to speak out if their company is harming them or its customers."]["The behavior outlined here is troubling &amp; if true, shows predatory practices boost $$ for banks &amp; execs while hurting customers &amp; workers. https://t.co/HXnkNifET1"]["The @CFPB's arbitration rule would ensure that consumers cheated by banks or pay day lenders would have their day in court."]["Wells Fargo opened up 3.5M fake accounts - including 1,579 in Ohio - but the #ripoffclause prevented customers from getting justice."]["Submit your questions by emailing townhall@brown.senate.gov or commenting here → https://t.co/vb4eoVe0rR"]["The latest action on healthcare leaves us with more questions than ever - I'll address more Qs in a FB Live town hall this Thurs at 5:05pm. https://t.co/acJ8KaF6jl"]["@POTUS @senrobportman You said you'd never let our workers down—w/ my bill, we can work together to support what they make in the USA. -SB\nhttps://t.co/QsaurDJJNy https://t.co/bJIR98XIxG"]["@POTUS My Buy America bill w/ @senrobportman requires American infrastructure tax $ to be spent on American iron &amp; steel. That means jobs in Ytown."][".@POTUS - steelworkers in Youngstown would love to hear your plan to enforce Buy America rules, and I want to help. https://t.co/TLE3o66slN"]["How many chances every year are there for a baseball player to pitch an Immaculate Inning? Sherrod explains → https://t.co/7uiyZtXLn8 https://t.co/lzJBy1XpBQ"]["REMEMBER: you should never disclose your Social Security number to pay your bills - and anything telling you to do so may be a scam."]["WARNING: A scam involving consumers and Federal Reserve Banks has recently affected Ohioans. Learn more: https://t.co/hNuT3hMKD5"]["What do you get when you give an @Indians fan a board &amp; marker 2 weeks after @Cookie_Carrasco's Immaculate Inning? https://t.co/7uiyZtXLn8 https://t.co/2Dmmxwr2yn"]["This week, John Glenn would have turned 96 - and it's no secret that Ohio misses him. Moved by these tributes. https://t.co/Al3jWZd85r"]["@CFPB And the strong performance of US banks in the stress test is just further proof that Dodd-Frank is doing exactly what it's supposed to do."]["@CFPB Since then, we've seen the law's successes: the @CFPB's actions have resulted in $12bil in relief for more than 29bil American consumers."]["@CFPB It was a promise to American taxpayers that they'd never again be forced to foot the bill for too-big-to fails banks and Wall St greed."]["7 years ago, Dodd-Frank Wall Street Reform and Consumer Protection Act became law – which then created the @CFPB one year later."]["Happy birthday to my hero – and the only person with whom I’d want to take a 3am train. -SB https://t.co/BMEELD8dtC"]["Excited to announce that @SecretaryPerry has accepted the invitation I extended w/ @senrobportman to tour the Piketon Plant on July 31. -SB"]["The Akron Beacon Journal said it best – “Health Debate is Personal”\nRead more: https://t.co/38h75O8CD4 https://t.co/eV8RDkBoJg"]["The headline says it all: $200 Billion More Won’t Fix Unfixable Senate Health Bill https://t.co/gtNcBEFIYs https://t.co/hrf9eVQQzv"]["Congrats to @OhioState alum Deborah Elliot on her @Jeopardy success - or should we say, \"what is 'congrats'?\" \nhttps://t.co/SDlCFE6qNd"]["@SenJohnMcCain I'm one of the many who's sharpening my arguments in anticipation. Can't wait to see you soon. -SB"]["Get ready for a fight. \n\ncc: @CFPB https://t.co/ISzh6zhEcs"]["Learn more about John Bush’s record by watching my full floor speech here → https://t.co/PLYXlDlB6n"]["Can they be confident that their case would be decided fairly and impartially – that justice would be served? Can you be?"]["Imagine if today an LGBT Ohioan or Michigander or Tennessean or Kentuckian faced this man on appeal."]["Imagine if the man who boldly repeated homophobic slurs had heard the Obergefell appeal."]["The Obergefell decision guaranteeing right to marriage equality came out of Southern District of OH &amp; was initially appealed to 6th Circuit. https://t.co/diPV3M2B4t"]["Today the Senate confirmed John Bush - a man with a record of promoting bigotry &amp; discrimination - as a 6th Circuit Court of Appeals judge."]["Ralph was kind, effective &amp; always delivered for OH. I knew him well after 15 yrs serving together &amp; loved every opportunity to see him. -SB"]["I was honored to speak about Ralph Regula last yr when he received Lifetime Achievement Award from Massillon WestStark Chamber of Commerce. https://t.co/pbAAFJvsEP"]["Connie and I are thinking of @SenJohnMcCain and his family as we wish him a full recovery. -SB"]["John has more fight in him than anyone I know, and I look forward to having him back in the Senate soon."]["Anyone with common sense knows paying more for less is a bad deal. https://t.co/sCGnMYG7PM"]["@CFPB @CFPBMilitary Wall Street banks, car title lenders, and big corporations have armies of expensive lobbyists – the @CFPB is Ohioans’ cop on the beat."]["@CFPB @CFPBMilitary And just last week, the @CFPB published a rule that will guarantee Ohioans get their day in court if they are cheated by their bank."]["@CFPB @CFPBMilitary Last October, the @CFPB levied a record-setting $100 million fine against Wells Fargo for its fake account scandal."]["@CFPB @CFPBMilitary More than 23,000 Ohioans have filed complaints with the @CFPB against financial companies."]["@CFPB In 6 years, the @CFPB’s actions have resulted in $12 billion in relief for more than 29 million American consumers."]["This week marks the 6th birthday of the @CFPB—that's 6 yrs of protecting consumers from financial scams &amp; predatory practices by big banks."]["Mr. Bush has a clear record of promoting bigotry and discrimination that has no place in our courts."]["Can John Bush be trusted to put aside his personal views when considering the law? Even according to his own words, no, he cannot."]["It’s the reason African Americans &amp; women can vote, that segregation is part of the past, and that marriage equality is part of the future."]["Judicial impartiality is a principal of democracy and the backbone of our government."]["Cleveland lost a hero today with the passing of Judge Jean Murrell Capers. My full statement: https://t.co/mTdNLsYggd"]["Excited to announce that our 3rd annual Women’s Leadership Summit will be on Sept 9th in CBUS. Visit https://t.co/XhLXDLqcZS for more info. https://t.co/LZsz9pNzZz"]["Sherrod is answering healthcare questions LIVE on Facebook. Tune in here and comment with your questions → https://t.co/zaCsiWZvPw"]["@senrobportman Congratulations on a great win! As any good Cleveland fan knows, there’s always next year. -SB https://t.co/W8V6sntlV6"]["Now is the time for Repubs &amp; Dems to work together on a bipartisan plan to lower costs and make healthcare work better for everyone. -SB"]["No one does softball like Ohioans. Who will win this year's Buckeye Spectacular: the Brown Blue Collars or the Portman Swing State Sluggers? https://t.co/wb32MGnlWE"]["\"My dad worked in the auto industry &amp; paid into the system over 30 years...Without Medicaid coverage my dad would be on the streets.\" –Kelly https://t.co/W479kdRRDz"]["“My mother is 95 &amp; receives a pension of only $1500/mon. Medicaid keeps her alive so she is able to spend time w her kids &amp; grandkids.” –Bob https://t.co/N9rWmjW8fH"]["“Medicaid has been a godsend to take care of our mother since our father passed away.\" –Emma https://t.co/MimkGfbwly"]["Wanted to share the stories I heard in Toledo this AM, from Ohioans who know firsthand the importance of Medicaid coverage in nursing homes."]["@KaiserFamFound These are people who worked hard to build good lives for their fams &amp; they shouldn’t have to lose it all to med expenses in their later yrs."]["According to @KaiserFamFound, 3 in 5 nursing home residents in Ohio rely on Medicaid to cover the cost of their care."]["Stood against the harmful cuts to nursing homes in the Senate healthcare bill with Ohioans in Toledo this morning. https://t.co/zk5LrWhXEE"]["Have you submitted your healthcare questions for my Facebook Live town hall yet? Comment here with your Qs today: https://t.co/zaCsiWZvPw https://t.co/SeErCJqKjJ"]["Washington must always remember who we work for: kids like Noble &amp; their families, who deserve quality, affordable care - no matter what. https://t.co/vwPAsEYC2z"]["As Noble's mom said, a new healthcare bill could be \"...the difference between being middle class or not, keeping our house or not.\""]["It was a pleasure to meet with the \"littlest lobbyists\" last week – like Noble Lett, who visited with his family: https://t.co/20b8pQIr1F"]["Join me for another Facebook Live Town Hall about the healthcare bill this Tuesday at 6pm. Comment here w/ your Qs: https://t.co/zaCsiWZvPw https://t.co/EmV9rgaw8z"]["Saddened by the loss of Liu Xiaobo – inspiring champion for human rights. China must let his wife Liu Xia go."]["Ohio farmers have always been innovators--read how they're working to improve the water quality of Lake Erie #FridaysontheFarm https://t.co/SEAUnXWA99"]["The GOP healthcare bill harms Ohioans in rural communities to pad the pockets of insurance &amp; pharma CEOs. https://t.co/Sg7yQtCslK"]["It’s absolutely shameful that politicians want to keep access to more health benefits for themselves - but not for the people they work for. https://t.co/nVuCMZEVm2"]["It cuts approx $800B from Medicaid, which covers nearly 1M Ohio children, accounting for more than half of Ohio’s entire Medicaid population https://t.co/MM9J3C7xJO"]["It could allow insurance cos to once again to discriminate against individuals w pre-existing conditions, pricing them out of necessary care https://t.co/CyHum2KsFc"]["Ohioans b/w 50-65 who don't have coverage thru employer would face even higher healthcare costs &amp; be charged up to 5x as much for coverage. https://t.co/8yPUGb7ZRh"]["The bill would end the Medicaid expansion and replace it with just $45B to address the opioid crisis in the entire country for 10 years. https://t.co/Gj1bDS3x2s"]["I’m ready to work with Republicans to lower costs and make healthcare work better, but that’s not what this bill does. My full statement: https://t.co/gfrAqfJIF0"]["My Ohio colleagues and I will continue our bipartisan efforts to secure the necessary investment to keep Lake Erie safe. -SB"]["As today’s forecast indicates, we need every tool at our disposal to protect the health of Lake Erie. https://t.co/lSkm6ndlPF"]["The last thing we need is another watchdog who believes that what’s good for Wall Street is good for America. -SB\nhttps://t.co/j9P3sp0SIf"]["Protecting Medicaid and CHIP for Ohio’s kids? We’ll fist-bump to that. https://t.co/oIZ3sQRxLf"]["When we fight for Medicaid and CHIP, we’re really fighting for kids like Madison, Noble, Jordan, and Benjamin, &amp; their families. https://t.co/BfgAqhGNTw"]["W/o #NetNeutrality the internet would fall under control of a few Big Broadband Cos to tell you what you can or can't have access to online. https://t.co/ZoPW4Pbgy4"]["Last wk @Cookie_Carrasco pitched an immaculate inning – one of the rarest feats in baseball. Tribe in 1st place at the break. #RallyTogether"]["The last thing we need is another watchdog who believes that what’s good for Wall St is good for America. Statement on Randal Quarles' nom: https://t.co/RHevDpoNqq"][".@DEAHQ must do its part to crack down on the amount of opioids flooding the market. Read our letter to DEA Acting Administrator Rosenberg → https://t.co/2mCPe8W7Yc"]["Summer vacation shouldn’t mean our children going hungry. Learn more about Ohio’s Summer Food Service Program: https://t.co/cVut5IChYT"]["This #MakeWorkPayMonday, let’s talk about the important news about the Department of Labor’s overtime rule. https://t.co/8qFoZFgVJU https://t.co/Cjon81BI9N"]["@CFPB Ohio consumers deserve the ability to seek relief through the justice system when they’ve been wronged by a bank or payday lender. -SB"]["Great news - the @CFPB will finalize its rule to protect consumers’ ability to hold big banks accountable if they are scammed."]["Doing right by our veterans is not a Democratic issue or a Republican issue – it’s an American value. Proud to serve on Veterans Committee. https://t.co/N9XFQGaLrx"]["Thinking of Sgt White, his family &amp; the Uniontown community. Thanks to law enforcement who sacrifice to keep us safe https://t.co/uThqp2qTTl"]["@CoryBooker @JeremyBell21 The feeling is mutual, my friend. -SB"]["Connie and I are thinking of everyone affected by this senseless gun violence in Colerain Township Saturday. My full statement: https://t.co/s3kML8gztg"]["More than half of Ohio's Medicaid patients are children - and this healthcare bill could rip their care away. We can't let that happen."]["Stood with working families and doctors against plans to gut Medicaid in Cleveland this morning. https://t.co/IgbxvxSAgw"]["“If not for the Medicaid expansion, I would have buried my daughter by now.” –Joe in Cincy, on his daughter’s recovery from opioid addiction https://t.co/CJfYiBnqDb"]["Instead of ✂ taxes for insurance CEOs &amp; Big Pharma, we should be working together to lower costs &amp; make healthcare work better for everyone. https://t.co/w2HXSWiKlo"]["Washington can't throw $ at this bill &amp; hope these problems go away - more $ won't do any good w/o a Medicaid program to keep folks covered."]["@DaytonChildrens Medicaid is a lifeline for so many Ohioans with children. We cannot allow their care to be ripped away."]["Stood with Ohio families at @DaytonChildrens this morning to speak out against the GOP healthcare plan and its devastating cuts to Medicaid. https://t.co/10sTCq4p6l"]["@Indians @MLB He overcame discrimination and hostility as a young man to lead Cleveland to victory and lead our country in the right direction. -SB"]["70 years ago today, Larry Doby debuted with the @Indians and became @MLB's 2nd African-American player: https://t.co/4uMUUoedgJ"]["The Senate Republicans' healthcare bill takes away #1 tool we have in the fight against opioids – Medicaid treatment. That's unacceptable."]["Thanks to all who joined me in Zanesville to discuss our fight against the opioid epidemic - &amp; the need for Washington to take it seriously. https://t.co/f4CMzj6wSm"]["As I said to @SecPriceMD last month: you cannot treat a disease with grant funding. We cannot just throw money at this problem. https://t.co/Ctnj92NuRL"]["More $$ w/o Medicaid coverage doesn’t do much good. \n\nThe GOP can’t just throw money at this bill &amp; make it better. \nhttps://t.co/DykSeLg55Z"]["Great to stop in Martins Ferry for lunch with retired miners, to talk about our fight for pensions – and to enjoy some DeFelice Bros Pizza! https://t.co/ivqvGl9UCL"]["It’s simple – if you work 50 or 60 hours a week, your paycheck should reflect those extra hours. Read more here: https://t.co/VimhJ4Ra38"]["130,000 Ohio workers were promised a long-overdue raise when this rule was announced &amp; the President must keep that promise for ALL of them."]["ICYMI: the Trump Administration is moving forward with overtime pay - but we can’t let them leave some workers behind."]["If places like Warren are left behind, our economy suffers. If we aren’t fighting for these places, then we aren’t doing our jobs right. -SB"]["In Warren this morning talking about ways to grow our economy and support good-paying jobs. https://t.co/5BPu18utpd"]["Happy 4th of July! Thank you to service members, veterans &amp; military families who have sacrificed so much so we can celebrate independence."]["We must do more to protect Ohioans from the most heinous of crimes &amp; provide justice, restitution &amp; healing for trafficking survivors. -SB"]["ICYMI: my bill to fight human trafficking passed a key vote in committee. https://t.co/Aedn8iayNE"]["@JohnKasich Read more from @DispatchAlerts → https://t.co/wNgWbCO5yZ"]["I’m proud of Governor @JohnKasich for standing up for Ohio families and doing what’s needed to combat the opioid crisis. Full statement: https://t.co/B9sNsh0koY"]