["The @PressHerald Editorial Board agrees with Maine’s Congressional delegation: offshore drilling threatens to compromise some of our state’s most important industries. Read more: https://t.co/0ILJVVGN6k"]["Joined with @SenatorCollins and the rest of New England’s Senators to introduce a bill protecting our waters from offshore drilling. The health of Maine’s ocean is one of our state’s great economic resources, and it must be defended. #mepolitics"]["#SenatorsNeedToEatToo https://t.co/g2ipmtPekn"]["Last year, I led a bipartisan letter to the White House from 48 senators, urging that any infrastructure plan contains direct funding for rural broadband. As infrastructure discussions unfold, I will continue to push for a plan that helps rural Maine thrive."]["\"It is going to take a sizable investment to bridge the country's technological gap... and for the sake of rural America, it has to come now.\" Timely editorial from the Press Herald on the importance of rural broadband efforts. #mepolitics https://t.co/PwCOOt8Wxr"]["Thanks to the @NRDC and the @NRCMenvironment for hosting, and for all the great work they do to protect our environment for the next generation."]["We had thousands of people dial in tonight - an energizing, important conversation. If I could boil it all down to just one idea, it'd be this video. https://t.co/05YNbGJDvi"]["This evening, I am joining the @NRDC and @NRCMenvironment for their tele-town hall to discuss the critical environmental issues we face in Maine. #mepolitics https://t.co/0c9ICYfXHT"]["This is an excellent bill from @SenatorCollins and @SenatorBaldwin, that will help family caregivers in Maine and across the country continue providing support for loved ones. I’m proud to support the legislation. https://t.co/LndJWLK7Cj"]["I support @SenMarkey’s bill to defend #NetNeutrality, which is critically important to a free and open internet. My statement: https://t.co/WU7gazGsYX"]["The internet is critical to the 21st century American economy, which is why universal access to affordable broadband is so important. Today’s announcement that the Administration will prioritize investments in expanding rural broadband  infrastructure is a welcome step."]["If you’d like to speak out against offshore drilling in Maine, you will have an opportunity this month. DETAILS:\n\nWHAT: Public meeting on offshore drilling\nWHO: Interior Department’s Bureau of Ocean Energy Management\nWHERE: Augusta Civic Center\nWHEN: Jan. 22 @ 3 pm\n\n#mepolitics"]["So many of our key industries, from tourism and recreation to fishing, rely on healthy oceans. A single mistake could change that forever, rob our state of a key resource and permanently harm people across Maine. The risk of a catastrophe far outweighs any benefits. #mepolitics"]["Maine’s oceans support countless jobs in our state, and play a major role in our economy. That’s why @SenatorCollins and I wrote to Interior Secretary Zinke today, expressing our opposition to the Department’s plan to open up the coast of Maine for offshore drilling. #mepolitics https://t.co/tjMhRPU17Q"]["High-speed internet isn’t a luxury – it’s a vital economic driver that businesses rely on to compete in the 21st century marketplace. We can’t allow our rural communities to be left behind. #mepolitics"]["I hope that this weekend’s infrastructure discussions at Camp David included this bipartisan request from 48 senators to support rural broadband.\nhttps://t.co/gX7gwCNjgd"]["I oppose drilling off our coast. Keeping Maine's water clean and bountiful is absolutely essential to our livelihood. #mepolitics"]["Remember to stay warm, check on your neighbors, and take care of each other – it’s what we do in Maine."]["History does have a way of repeating itself; nearly 20 years after the Ice Storm, Maine is faced with another serious winter storm. To mark the anniversary, and remind the people of Maine about lessons learned, I wanted to share some reflections on how we face these events. https://t.co/cN01BzPbZR"]["Headed back to Washington today with lots to do. Drawing inspiration for the work ahead from one of Maine’s great statesmen, Joshua Chamberlain. A personal favorite: “Loyalty then, is not mere conformity. It is fidelity; truth to faith; constancy of soul.” https://t.co/pfGKjk4f4L"]["Trust me, I know it’s cold in Maine – I don’t break out the flannel-lined jeans for just anything. But the @bangordailynews makes an important point here: this stretch of cold weather doesn’t mean that climate change isn’t real. Read: https://t.co/rcEtOCMcTF"]["@ssgtravismills We discuss Travis’s experience as a quadruple amputee and how that informs his Foundation’s work to help injured veterans regain a sense of purpose and direction, as well as Jack’s work with justice-involved veterans. Truly one of our best episodes – hope you’ll give it a listen. https://t.co/S0YUcHRHSH"]["Honored to be joined by @ssgtravismills and Jack Richards on this month’s Inside Maine to talk about helping veterans transition back into civilian life. Link here: https://t.co/tEfZ7VdC6R"]["No better place to spend the holidays than Maine – here’s my weekly column on what makes this time of year so special in our state: https://t.co/WQJwVe3Tjf"]["Happy holidays to you and yours! https://t.co/ZZZfH7GHmU"]["There’s no better place to celebrate the holidays than Maine – and Officer Jeremy Turner of the Portland PD just showed why! A beautiful performance, and an excellent example of our state’s special spirit during this time of year. https://t.co/rdPQBITW21"]["Good news for some Maine people – if you were affected by October’s windstorm and missed the ACA’s December 15th deadline to #GetCovered, you still have time. December 31st is your new deadline, be sure to sign up! #mepolitics  https://t.co/vhhcJrO5ZM"]["My statement on tonight’s tax vote: https://t.co/oLxHSPB1i1"]["While we’re debating a massive unfunded tax cut on the Senate floor, a reminder that CHIP – a program that provides insurance for tens of thousands of Maine children – is awaiting Congressional action.  https://t.co/7HnDPxnaub"]["Deadlines matter everywhere else – so why don’t they in the Senate? My floor speech on the work we’ve left undone: https://t.co/3vmKJ2tGQY"]["Speaking on the Senate floor about the deadlines we're missing right now. WATCH LIVE: https://t.co/ToMNAlxgCp"]["The word for someone who’s lived to the age of 110 is ‘supercentenarian’ – and Maine’s oldest resident, Dorris Farrar, is certainly super. It was my pleasure to visit her with her at Hawthorne House in Freeport, and present her with a flag that’s flown over the Capitol. https://t.co/HBB7tTRaXS"]["Proud to join with @SenatorCollins to recognize the efforts of @WreathsAcross to honor veterans. https://t.co/oQuieBEZ1u"]["We 'mustache' you a question – did you get your healthcare through Open Enrollment yet? If not, hurry! TOMORROW is the last day to get covered for 2018 – sign up at https://t.co/MxZm2w64o7, or by calling 1-800-318-2596. https://t.co/368VJmMK8y"]["The open internet is a vital part of 21st century life, and a force for good in the American economy – which is why today’s @FCC vote to repeal net neutrality protections was such a monumental mistake. Joining @MaineCalling to discuss at 1:30, listen here: https://t.co/cyn2Xd5U3R"]["Today, @SenatorCollins and I called on the @FCC and @AjitPaiFCC to cancel the vote on repealing #netneutrality #mepolitics https://t.co/BRk3qiqaL1"]["There are nearly 117,000 veterans living in Maine – brave men and women who answered the call to serve, and continue to play vital roles in our communities. Thanks to @Mainebiz for highlighting their impact on Maine businesses. \n\nhttps://t.co/vSNT7loTQb"]["Wishing a Happy #Hanukkah to all celebrating!"]["Thrilled to share that following a letter I sent earlier this year, the VA has announced that they’re funding three new staff positions in Maine to help veterans confront mental health issues, substance abuse and homelessness. More from the @PressHerald: https://t.co/Y4PN1u6ObS"]["@WreathsAcross A wonderful tribute to America’s fallen heroes and their families. My gratitude to all who make this special tradition a reality year after year."][".@WreathsAcross has been delivering Maine-made wreaths to Arlington National Cemetery during the holidays for nearly 30 years. This year, they’re bringing more than 200,000 wreaths from Washington County to just outside of Washington, D.C."]["Second is Dan Reardon, a member of my staff, waving to the Wreaths Across America caravan as it passes through Scarborough. https://t.co/yh293LzlUr"]["Two photos from today: first is me, joining Senator Collins on the steps of the Capitol to lay a wreath on the Capitol Steps in honor of Wreaths Across America. https://t.co/YvObkGk00K"]["Glad to see so many of our state’s rural hospitals recognized for the incredible work they do. Even as rural health providers face many challenges, they continue to deliver vital care to Maine’s rural populations. https://t.co/mlqVamqCKN"]["Robert Coles, a Machias man who served at #PearlHarbor, spoke w/ the @bangordailynews last year. While he is no longer with us, his service &amp; sacrifice will never be forgotten: https://t.co/c7V0f4Iz9j"]["76 years after the attack on #PearlHarbor, we honor the men &amp; women who proudly served in defense of our country that fateful day &amp; memorialize their bravery in the face of grave peril."]["Today, I once again attempted to get my Senate colleagues to take an approach to taxes that does not leave our kids holding the bill. Watch my speech on the Senate floor arguing for a deficit-neutral tax bill: https://t.co/LY1Gpulhlc"]["My statement on Sen. Franken: https://t.co/SuI2gmHHRk"]["We could have done this bill on a bipartisan basis, and in a way that allowed the American people to make their voice heard. Instead, we passed this. The Senate owes our country better."]["This is why hearings matter. This is why input from experts matter. This is why process matters."]["What happens when you rush a massive piece of legislation through the Senate with handwritten edits in the margins? You make mistakes. Example: https://t.co/QVgHcLxIGk"]["#NetNeutrality is crucial to maintain a free and open internet – and the FCC shouldn’t let fake comments sway its decision-making process. My letter to the FCC with @SenatorHassan + 25 colleagues: https://t.co/Rs2lzqgxpQ"]["Leslie Morissette’s work with @grahamtasticorg has made her a Maine hero for years, and now, her efforts to connect kids battling illnesses with their family, friends and schools has earned her a spot as a @CNNHeroes finalist. Vote for her here: https://t.co/8j1tdFmswd https://t.co/QHkWL0iiSz"]["This morning, I'll join @FaceTheNation to discuss the Senate tax plan. Hope you can tune in."]["My statement on the Senate’s passage of the tax bill: https://t.co/E1EjLFLgkM"]["Spent some more time answering the phone on the tax bill. We've been swamped with calls, almost entirely against the bill--and I agree with them. #mepolitics https://t.co/n30WKK1Xhf"]["Fielding a call urging me to vote ‘no’ on the Senate tax bill. The ratio of calls to my office is overwhelming – for every one person who supports this plan, I hear from 50 opponents. The people don’t want us to pass this bill. https://t.co/5H0w5kEZN1"]["Talked with @Morning_Joe about the Senate tax plan, which couldn’t be more important – and as of now, we don’t even know what’s in it! WATCH: https://t.co/2MDQu0r52r"]["TUNE IN: Going on @MorningJoe shortly to discuss the Senate tax plan."]["Joining @andersoncooper on @AC360 shortly to discuss today’s tax bill developments on the Senate floor. Hope you can tune in!"]["Disappointed that the Senate rejected my motion to recommit the tax bill to the Finance Committee. This bill is too important to rush – we need to get it right."]["We cannot pass this massive debt onto our children: https://t.co/ccuGfx3dsv"]["WATCH NOW: Speaking on the Senate floor about my proposal to send the tax reform package back to the Senate Finance Committee to make this bill deficit neutral: https://t.co/jzZHAhz5i0"]["Today, I sat down w/ members of the Arcadia Alliance, an international partnership between Maine &amp; Norwegian boat builders who are working together to establish a foothold for energy efficient carbon fiber ferries in U.S. markets. #mepolitics https://t.co/lOHdeo16bF"]["Great to speak w/ Rangeley Lakes Regional High School students during my Capitol Class today! The kids’ questions are always insightful, and I always come away learning something too. #mepolitics https://t.co/FWlTOXOFyl"]["There’s still an opportunity for bipartisan tax reform. We're here, we're ready to talk. https://t.co/blgp5gT1ao"]["Joining my Senate colleagues shortly to discuss the need for a bipartisan approach to tax reform. WATCH: https://t.co/eiXkQVPogF"]["My tax reform op-ed with @TimKaine in @axios. Senator Kaine and myself, along with many of our colleagues, want to work with Senate leadership to boost our economy and help the middle class – but this process isn’t the way to do it. Read more: https://t.co/F0QSvgkLm9"]["Congratulations to Maine’s own SFC Ryan McCarthy for this honor!\n \nhttps://t.co/G4BNX9wKZg"]["The Senate shouldn’t pass a harmful tax bill just to say it’s done. https://t.co/maulEt7sLy"]["Small businesses fuel Maine’s economy – and in some cases, they fuel its Senator as well! Celebrating #SmallBusinessSaturday in Norway, with a bit of help from Café Nomad coffee. https://t.co/ks8ZfudLMy"]["Today is a special day, full of family and friends and food and reflections of gratitude. I shared some things I'm thankful for, and a few thoughts on our political climate, here; I hope you'll give them a read. \n\nWishing you a Happy Thanksgiving - Angus\n\nhttps://t.co/CgoFyOlTfe"]["From the mountains to the ocean, our state is founded in our outdoor heritage, and the formation of the Maine Outdoor Brands alliance is a great way to promote Maine’s adventurous legacy. @Mainebiz: https://t.co/9PBMbiae4X"]["The internet is a vital piece of the modern economy, and a cornerstone of 21st century life. It needs to remain open for all – not just the highest bidder. I stand with @JRosenworcel in defense of #NetNeutrality. https://t.co/SejnlPFnCc"]["Childcare is critical for working families and, as a result, for our economy -- but the cost is increasingly becoming a major financial burden for Maine families. Read about my bill to promote affordable childcare in my @PressHerald op-ed w/ @Mark_Shriver https://t.co/7NurBxPaS1"]["This month is National Home Care and Hospice month. The men and women who care for Maine's aging population are vital to our state -- here is my column honoring them. https://t.co/mHt8P1MWud"]["What Sen. Franken did was wrong. *Period.* This is a case that should be heard by the Senate Ethics Committee."]["Today is #NationalRuralHealthDay, and I’m LIVE on the Senate floor to discuss Congress’s lack of action to fund Federally Qualified Health Centers. WATCH: https://t.co/hqf1TEXxAu"]["I look forward to reviewing the new procedures, and will continue to push for a bill to expand congressional oversight of the process and ensure that intelligence agencies participate."]["The Vulnerabilities Equities Process, or VEP, is a vital framework to identify and patch cyber security flaws. I’m glad to see the Administration is recognizing the importance of the VEP, and attempting to improve it."]["In today’s meeting of the Energy and Natural Resources Committee, I expressed my opposition to proposed legislation that would open up new sections of the Arctic National Wildlife Refuge to drilling. WATCH: https://t.co/fkoBs8zNtg"]["There aren’t many giants left in the Senate – but John McCain is one of them. It was a privilege to attend the Army’s special Twilight Tattoo in his honor. https://t.co/TEs5UJrGRf"]["It’s generally a bad idea to “hack the Pentagon” – but thanks to a DoD program I’ve pushed for, hackers are helping identify security vulnerabilities. They've found almost 3,000 bugs in the last year! A great step that other gov agencies should take. https://t.co/owcQLWCGWR"][".@SenatorCollins has a better view than me, so I borrowed her office for this photo. \nhttps://t.co/YNQxBNwphR https://t.co/eaIkbjjaWf"]["President John F. Kennedy once said: ‘As we express our gratitude, we must never forget that the highest appreciation is not to utter words of thanks but to live by them.’ Captain Thomas Hudner would never utter the word ‘hero’ in reference to himself, but that’s how he lived. https://t.co/W29zNhYyoN"]["We will never be able to repay the debt of gratitude we owe our veterans. My Veterans Day Column: https://t.co/BJfCrT2Wyi"]["From a cell phone to call loved ones and a snack to a simple handshake, the Maine Troop Greeters make sure our servicemembers know how much our nation appreciates their sacrifices. An honor to join them today. https://t.co/iq43xeQhwd"]["This moment was a true honor for me – I’ll never forget it. https://t.co/Q28OLMYeY1"]["Charles Shay – Penobscot Tribal Elder and WWII vet who won a Silver Star for his service as a medic on D-Day – is a true Maine hero. Today, I presented him with a flag that’s flown over the Capitol. https://t.co/dMisBzmOER"]["Thanks to @PCHC for hosting me today, and for all the work they do to help make sure the people of Maine can find insurance that works for them. https://t.co/vMTOYcLJtt"]["Will be going LIVE on Facebook at 6:30 p.m. to talk about ACA open enrollment. Hope you can join me!"]["By raising awareness &amp; supporting medical research we can help more than 137,000 ME people w/ diabetes live happy, healthy lives #mepolitics"]["Proud to join a bipartisan group to introduce a resolution honoring November as #AmericanDiabetesMonth."]["Tim and Dave have served Maine’s agricultural community for decades, and I look forward to working with them at the USDA. https://t.co/jvGjuEbpo2"]["Health insurance saves lives, and ACA plans may be cheaper than you think. December 15th will be here soon, so start shopping! #mepolitics https://t.co/CMPFUIbEJ7"]["TUNE IN: joining @MorningJoe at 7:20."]["Heartbroken to see evil inflicted upon another community. Praying for the victims and families in Sutherland Springs."]["I can paddle; canoe? https://t.co/fKFg03aSN3"]["Starting off this AM on @NewDay – tune in at 7:20 to watch!"]["This @gmfus website highlights how Russian-influence networks seek to manipulate public debate. Important to educate the American people. https://t.co/YIT9n19qwt"]["Also in Intel, I showed chart from #Hamilton68 that measures hashtag use by Russian-linked accounts. Full dashboard: https://t.co/viAOMNWsFW"]["An important question following today’s hearing – I was disappointed that the CEOs did not testify. https://t.co/L2AWvfydcD"]["In today’s Intel Hearing, I highlighted how Russians are posting on both sides of debates to exacerbate divisions. https://t.co/c0ZmIi2pXx"]["TUNE IN: Will be joining @mitchellreports at approx. 12:30 to talk today’s Senate Intel Hearing w/ execs from Facebook, Twitter and Google."]["Today the Senate Intel Committee will have execs from Facebook, Twitter and Google. I previewed the hearing w/ NPR: https://t.co/rM3PxJMOI4"]["The people of NYC are mourning tonight -- but as always, they remain unbroken in the face of hate. Maine, and the nation, stands with them."]["To those in Maine dealing with downed trees and loss of power – stay safe. Thankful to first responders and power crews for their hard work."]["Happening soon -- tune in! https://t.co/OnCOqRhBKd"]["@NatlParkService .@SenatorCollins &amp; I last night wrote to @Interior to outline alternative strategies to fix problem. @PressHerald: https://t.co/tOnEo8p6lM"]["We need to think bigger to address @NatlParkService backlog – almost tripling fees @ Acadia &amp; other Natl Parks will not solve the problem"]["The PACE Act, intro-d with @SenatorBurr, will help more low-income parents afford childcare and remain in the workforce. https://t.co/E7TyMvmKF8"]["Hmm, \"devilishly handsome\" is too many letters... 🤔 https://t.co/nudMAGFJiv"]["About to follow my fellow mustachioed Senator @SenJohnHoeven on @mitchellreports #SenateMustacheCaucus https://t.co/hMHX9IaGfs"]["HEADS UP: I'll be joining @mitchellreports on @MSNBC around noon. Hope you can tune in!"]["The Senate is better for @JeffFlake’s service – the “better angels” of his nature will be missed. https://t.co/Eh56bjThgr"]["@opp_alliance It may seem early – but with only 6 weeks to make sure you’re covered for 2018, vital to start planning now! #mepolitics"]["@opp_alliance 4) Create a list of the doctors and prescriptions you want your plan to cover."]["@opp_alliance 3) If you are offered health coverage through a job, get information about it."]["@opp_alliance 2) Get income documents for everyone you file taxes with – pay stubs, last tax return, etc."]["@opp_alliance 1) If you have a Marketplace account, make sure you have your login info or reset your password if you can’t remember it."]["@opp_alliance Open enrollment starts Nov. 1, and time frame to enroll is only 6 weeks. It’s important that you act quickly to secure coverage. NEXT STEPS:"]["This AM, I joined healthcare advocates at @opp_alliance in South Portland to highlight ACA Open Enrollment. #mepolitics"]["“If it helps sell some lobsters, I’m for it.” Thanks @HarrySmith for highlighting Maine’s lobster industry and our need for a lobster emoji! https://t.co/GYKStrqQIG"]["I just hit 100k followers, but these guys have me beat. Congrats to Brian and Matthew Haley for 100 years of Haley’s Metal in Biddeford! https://t.co/LuBInXtak6"]["Great convo with @HarrySmith about how important lobster is to the Maine economy. Tune in to NBC News tonight to watch! #mepolitics 🦀 🔨"]["Maine’s own, Claire Bridgeo! Juggles my schedule and this plate of blueberry bread -- join us Wed mornings! Details: https://t.co/dOBFWZCslT https://t.co/wo61g5juYq"]["Talking about how we can support rural Maine at 1:30 – listen live: https://t.co/cyn2Xd5U3R #MEpolitics https://t.co/4I9xY6mNGG"]["If you’d like to watch my full speech, you can find it here: https://t.co/j1gCajEhiH"]["Also discussed how these “tax cuts” are actually just passing the costs to our kids and grandkids. https://t.co/AxsajOzlFG"]["Spoke on the Senate floor about how the proposed tax plan will impact seniors. WATCH: https://t.co/kd93GTaXfR"]["Today is both #NationalBioenergyDay and #ForestProductsWeek! Grateful to all who turn Maine’s resources into new economic opportunities."]["Speaking on the floor shortly to discuss the budget before the Senate. Watch: https://t.co/8MvfQy7dn4"]["Will be joining Wolf Blitzer on CNN shortly, hope you can tune in!"]["There are some things that everyone can agree on, like ribs. Fun talking BBQ and bipartisanship w/ @nielslesniewski. https://t.co/ppWr66hQTK"]["Earlier this month, I talked about ACA sabotage.  \n\nLast night, the admin announced no CSRs.\n\nThis won't help Americans get healthcare. https://t.co/4O3ZqZNFIF"]["The folks at the York County Shelters Program are doing incredible work. Grateful for their efforts on behalf of Maine. https://t.co/z98mCjELI5"]["Great morning celebrating Maine manufacturing with HS students at Pratt and Whitney in North Berwick! https://t.co/LK4zlBALte"]["Music to my ears – congrats to Dover-Foxcroft music teacher Kaitlin Young for being named Maine’s teacher of the year! https://t.co/CpVBKB3DiM"]["“George Washington Carver figured 106 things to do with peanuts. What we need is 106 things to do with wood fiber.” – Sen. King"]["Dr. Mark Johnson says we’re in the midst of “a long term effort to explore new uses for forest products” #mepolitics #RobbinsLumber"]["\"I consider this an exciting opportunity for Maine and the country... I think we're talking about the future here\" - Sen. King"]["Chairing an Energy Committee Field Hearing in Searsmont on how to maximize Maine's natural resources. Watch live: https://t.co/bCbrmrlO4V"]["Great to talk w/ George Hale and @RicTyler this AM about today’s field hearing and boosting rural Maine. Listen:  https://t.co/8nXjGVgn7Q"]["Tomorrow, I’m chairing a Senate Committee on Energy and Natural Resources Field Hearing in Searsmont. A preview of what we’ll discuss: https://t.co/zZSxuT4Ol6"]["In my opening statement to the Budget Committee, I quoted a very smart hardware store clerk in Brunswick. Watch: https://t.co/BiwzW9qdch"]["The Affordable Care Act isn’t collapsing – it’s being mugged. #mepolitics https://t.co/3uYraSwWMM"]["Happening now: Live on the Senate floor to talk about healthcare."]["Met with reps from the National Council for Behavioral Health to discuss treatment for mental health issues and the opioid epidemic. https://t.co/aiW4akvBqf"]["Congrats to Dr. Jeffrey Hall of Cambridge, Maine – I would have sent well wishes sooner, but my circadian rhythm must have been off. https://t.co/d1SfveicbU"]["Devastating news out of Las Vegas. Praying for the victims and loved ones affected by this tragedy."]["This month's Inside Maine podcast is about the lobster industry! If only there were an emoji I could use...\n\nListen: https://t.co/tEfZ7VdC6R https://t.co/Ez6G2Sd5ma"]["@secnav76 To @SECNAV76, I say: you’re welcome back any time, especially if you keep bringing two destroyers with you! https://t.co/PxBdWKud1S"]["I was honored to join Secretary Spencer (@SECNAV76) and show him the incredible work that happens every day at BIW. https://t.co/1ojNZFwyZ5"]["@secnav76 In advance of @SECNAV76's visit, Sen. Collins, Rep. Pingree and I proud to announce agreement btwn BIW and Navy to build 2 new destroyers."]["This honor recognizes the hard work from educators, students and families – grateful for your efforts to build a bright future for Maine."]["3 Blue Ribbon Schools in ME! Congrats to Fourteenth Street School (Bangor) Connors-Emerson School (Bar Harbor) &amp; Falmouth Elementary School!"]["Excited to welcome @SECNAV76 to BIW, and show him the important contributions of Maine workers to national security. https://t.co/r4xiulRkQZ"]["@SteveDaines National Parks are true treasures – by modernizing the ticketing process, we can introduce new generations to their wonder."]["The program is a major success – in fact, the process is so easy that I bought a ticket to Acadia during the hearing! (cc @SteveDaines) https://t.co/QfTmDdhFgc"]["In yesterday’s National Parks hearing, we heard results from the pilot program I pushed for allowing online sales of park passes. https://t.co/EywlFIZWHb"]["Drug addiction is a disease, but it’s not a death sentence. Watch my speech on the Senate floor: https://t.co/UGmZ4Zny6P"]["@AmericanTelemed Any conversation about healthcare must make sure rural areas have access to affordable care – telehealth would improve care and lower costs."]["Speaking on the Senate floor shortly about National Recovery Month – tune in."]["Bob is a great public servant, and a great friend. The Senate will miss him. https://t.co/4n0to5NhLg"]["Great to meet with Maine Principal of the Year Daniel Welch, from Boothbay Region High School. Thanks for your dedication to Maine students! https://t.co/dLpk7dYBWn"]["American citizens are hurting -- we need to do more to help them."]["Proud of Maine for answering the call. Maine National Guard in USVI: https://t.co/ryylQu3ob2, Red Cross vols in PR: https://t.co/S96NZLhitI"]["My statement on the Congressional Budget Office's preliminary score of Graham-Cassidy: https://t.co/rQR3ENSGS2"]["I'm pushing to grow the profile of lobsters, any way I can – including emojis. https://t.co/jafZXFqW2L"]["Today is a very special day for our state: Happy #NationalLobsterDay!"]["Today we celebrate two proud Maine traditions -- happy National Hunting and Fishing Day! https://t.co/cbfRQ09DYX"]["Opioid abuse kills more than 1 person/day in Maine; we need all hands on deck. Grateful to CVS for taking action. https://t.co/HF9vJuk9M5"]["One more photo from Jackman yesterday – a staffer caught a Senator plying his craft. https://t.co/NYlkUsUrJa"]["Some photos from my day in Jackman yesterday: https://t.co/q9M4olTvKP"][".…and our next steps on healthcare must to provide them with the aid that they need, not shortchange them. END"]["I’ll continue to say clearly, and loudly, that our rural hospitals need our help…"]["So, when I go back to Washington next week to discuss healthcare, I’ll carry the concerns and challenges of Jackman/rural Maine with me."]["This impacts everything – a CBP officer told me today they struggle to recruit/keep border patrol personnel due to limited healthcare."]["That means that the a mill worker on the late shift, or an elderly citizen who slips and falls, would have to drive over an hour for care."]["At the moment, Jackman stands to lose overnight emergency medical services at the end of the year."]["Communities need access to close and affordable healthcare in order to thrive."]["Cybercrime costs the global economy hundreds of billions of dollars a year – it’s critical that we protect our networks."]["Concerned to hear SEC's database was breached. This is another example of why we need strong cyber defenses."]["Jackman is one of many towns with these challenges – they need bipartisan help. Look forward to hearing more tomorrow. (3/3)"]["Jackman could lose overnight emergency/ambulance care at the end of 2017, forcing residents to drive more than an hour for care. (2/3)"]["Tomorrow, I’ll be meeting with local leaders in Jackman to discuss the healthcare crisis they, and other rural towns, face. (1/3)"]["@EdSuperHighway Connectivity is so important to preparing our students for the future– grateful to all who’ve helped close the gap! #erate #mepolitics"]["@EdSuperHighway Proud to have supported modernizing the #erate which funds these efforts. We’re now seeing the results in our schools. #mepolitics"]["Great numbers from @EdSuperHighway : nearly 170k Maine students, in 99% of school districts, have high speed internet access! #mepolitics https://t.co/GCV7Ouy0sy"]["This healthcare process is simply irresponsible. https://t.co/Cd9qHjKn5i"]["Full video of my speech on the Senate floor on #thegreathealthcareskedaddle: https://t.co/XRkI79BPqN"]["\"The great healthcare skedaddle.\" -Angus King #thegreathealthcareskedaddle"]["On the Senate floor right now talking healthcare -- tune in! #mepolitics"]["Spent some time this AM talking to constituents about healthcare. I'm a no on Graham-Cassidy. #mepolitics https://t.co/GdMwzmI1Ox"]["@westgov I’m hopeful that the Senate will take a positive step towards securing our grid and pass this bill quickly. (3/3)"]["@westgov This bill would protect our electric grid from cyber-attacks by looking to employ low-tech redundancies to defend it from hacking. (2/3)"]["Grateful to the Western Governors’ Association (@westgov) for their support of my Securing Energy Infrastructure Act. (1/3)"]["Heading back to Washington this afternoon – always wish I could stay a bit longer in Maine, but lots of important work to be done."]["A pleasure to meet with the United Farmer Veterans of Maine earlier this week. https://t.co/7bA8607we0"]["…and your Nation is here to support you.  #POWMIARecognitionDay 7/7"]["Today, we come together to express our gratitude to our missing heroes and to offer support to their loved ones #POWMIARecognitionDay 5/7"]["…by joining together in our unyielding efforts to leave no one behind. #POWMIARecognitionDay 4/7"]["Each time a lawmaker or visitor walks by that flag, it is reminds us to honor the sacrifice of those still unaccounted for… 3/7"]["That flag is at the center of our Nation’s capital to illustrate the truth in these words: #YouAreNotForgotten 2/7"]["There are two flags that grace the halls of our Capitol Rotunda: the American flag and the POW/MIA flag. #POWMIARecognitionDay 1/7 https://t.co/7wVNKD1kt1"]["Equifax has some questions to answer. https://t.co/siGeloyFll"]["Heart disease is the #1 cause of death in Maine – great to meet with the cardiologists who work hard to keep our state healthy. https://t.co/Dnikno9iMF"]["Thrilled to announce my new spokesmen, @JackOFaherty1 &amp; @JeffSobotko. Excited to see the work they’ll do for the people of Maine #mepolitics"]["We will #NeverForget. My statement on the 16th anniversary of #September11: https://t.co/SnvcoykdG8"]["Thank you all for the incredible work you do every day to care for our nation’s veterans. (3/3) #mepolitics https://t.co/qeJgZhYDRA"]["Including a reunion with Ellie Newell, who’s worked at the facility since we broke ground in ’95 – my first year as gov! (2/3) #mepolitics https://t.co/23vP91pZ1l"]["Had an excellent meeting this morning with the dedicated staff at the Maine Veterans’ Home in South Paris… 1/3 #mepolitics"]["A shot from backstage at @hardball with @SenBlumenthal -- hope you were able to tune in! https://t.co/vzyeJEwtef"]["Senate unanimously passed my bipartisan bill to help states/localities fight mosquito-borne diseases. Details: https://t.co/v0hML2GuBy"]["Heartbreaking – once again on track for more than one overdose death per day. Not just numbers: family, friends, neighbors. We must act. https://t.co/z7UsqJz2jx"]["Spent morning hearing from state officials re: stabilizing healthcare market. Now more than ever, need a bipartisan approach. #mepolitics https://t.co/lr6WCSxHeF"]["HEADS UP: I'll be joining @wolfblitzer on @CNN shortly. Hope you can tune in! https://t.co/0qBxDsktun"]["Please see my statement on the Administration's DACA announcement: https://t.co/KV6loGZOR1"]["A busy August in Maine, meeting w/ ppl from Sanford to Fort Fairfield &amp; everywhere in between. Your insights prepare me for the work ahead. https://t.co/vC4trl9QpV"]["Expanded access to high-speed cell service is great news for businesses and communities in Maine @TMobile #mepolitics https://t.co/ZKxQGsT9qa"]["Tune in to my Facebook page to watch live https://t.co/Pd9xxmGs8W"]["Look forward to joining Jesup Memorial Library's speaker series on civil discourse and democracy in Bar Harbor tonight! #mepolitics https://t.co/8WxR0EFWHh"]["I presented Bar Harbor Bank and Trust Co. w/ a Congressional Record statement congratulating them on 130 years of service to the community. https://t.co/HZFvElZELX"]["Toured Hinkley Yachts manufacturing facility in Trenton today to discuss their work and strategies to strengthen Maine's workforce https://t.co/P8uyVpRaYC"]["Jennifer Neptune, a Head Basketmaker from the Penobscot Nation, was in Acadia today for a basketry and beadwork demonstration @AbbeMuseum https://t.co/WJe2x3mmxE"]["In Acadia to discuss research, education, and prevention initiatives for tick- and mosquito-borne diseases #mepolitics https://t.co/uuKUraglA6"]["Joined the Ellsworth community 4 the launch of its open access fiber network which will help provide high-speed internet to local businesses https://t.co/ooUoo27adM"]["A busy day in the Bangor region! Visited @penquisCAP childcare center, Somic America, @BangorFireDept, @MaineVets &amp; Bangor Veterans Center https://t.co/bcwBtHiYdl"]["@penquisCAP Spoke w/ parents &amp; childcare professionals abt PACE Act, bill I introed w/ @SenatorBurr to make childcare more affordable 4 working families https://t.co/4FmpsSQvZw"]["Fun to sit down and read to kids at @penquisCAP childcare center in Bangor https://t.co/Lf2q2e9hje"]["@UMPIowls Welcome news for the hardworking students across our state #mepolitics"]["Please to announce @umpiowls has received two Upward Bound Program grant awards totaling $639,257!"]["Finished the trip this afternoon after a ride through Mount Vernon and Manchester. Here's a pic of the group #mildhogs #angusontheroad https://t.co/sBBE1G0MDu"]["Last day of the ride today. Thanks to all the good Maine people who stopped and talked to me along the road! #angusontheroad https://t.co/tKAacMt4q7"]["Keeping American sailors and servicemembers aboard the USS John S McCain in my thoughts &amp; thankful to all those leading the search &amp; rescue https://t.co/gQjsfINBff"]["Wonderful evening at Bell Hill Meetinghouse in Otisfield. Had the pleasure to introduce fellow biker &amp; comedian Gary Crocker #angusontheroad https://t.co/stPJfVs0Sw"]["@boyscouts Garrett fixed up a 1929 Model A for his Eagle Scout project and took me for a spin in it. Hard work pays off! #angusontheroad https://t.co/c0dxLkvJr7"]["Honored join the South Paris community to congratulate Garrett Haslett at his Eagle Scout ceremony @boyscouts #leadership #angusontheroad https://t.co/ovOOX2SwRd"]["Beautiful ride down Route 142 to Dixfield &amp; Route 2 over to Bethel. Stopped in at the Sunday River Brewing Co. for lunch #angusontheroad https://t.co/19ObF5BCN9"]["Had a great ride through Augusta, Winslow, Skowhegan, Monson, Bingham &amp; Kingfield yesterday. Looking forward to more today! #angusontheroad https://t.co/WWC5NjlPwf"]["Rounded out the day at the High Peaks Community Picnic in Kingfield. Great times, great people! #angusontheroad #mepolitics https://t.co/pSYMufB9SC"]["Fun start to my bike ride through Maine at The Red Barn in Augusta this morning. Hope to see you on Maine's back roads! #angusontheroad https://t.co/o85CboNacF"]["Maine is a state of neighbors. This is not who we are. The KKK is not welcome here. https://t.co/WGJinaRn1c"]["Visited Waterville Public Library to hear about its digital literacy and career development efforts @JRosenworcel #DigitalLearning https://t.co/1CBnfP4lII"]["Pleasure to join the Kennebec Valley Chamber this morning! Looking forward to a packed day w/ @JRosenworcel to talk rural broadband https://t.co/vtzLwSPWyU"]["https://t.co/8sdxvP8zVI"]["Spent time at Trafton Senior Center in Sanford today &amp; discussed how home modification can help ME seniors age comfortably &amp; independently https://t.co/r0osM7H8nT"]["Racism in all forms is wrong. Let's hope the President's words begin to unite what white supremacists and bigotry in VA aimed to divide."]["Actions of hate groups in Virginia are unacceptable and unAmerican and have no place anywhere in our country."]["A national emergency declaration could make both a psychological and practical difference. Must back with good policy. https://t.co/3OQkbopb7i"]["Spoke at the @PIRotary luncheon about strategies to grow Maine’s rural economy. https://t.co/vppEATzWxW"]["Throwback Thursday to earlier this week up in Aroostook County! @ICarePharmacy #tbt #mepolitics https://t.co/3c1BfbxiV6"]["Great to stop into the Appalachian Trail Cafe in Millinocket on Tuesday and hear from local people in the Katahdin region #mepolitics https://t.co/Zibre9UNK6"]["A wonderful example of people helping people!"]["The Kids @AuburnPD PAL center work with mentors &amp; Master Gardner of the @UMaine Cooperative Extension to maintain a garden out front https://t.co/DK3H9aFLPf"]["Moving visit at @TJCLewiston, I served lunch for people in the L/A area &amp; w/ @AuburnPD Police Activity League (PAL) https://t.co/wq43Pwpr5V"]["Great visits to Aroostook and Penobscot Counties on Mon. &amp; Tues. &amp; thanks to all the hardworking people looking to help their communities! https://t.co/U2AdQxLkpu"]["Happy workers are more productive workers. This bill will both support Maine people and is a positive payback that's good for the economy."]["At Lamey Wellehan in Auburn to outline my support for #FAMILYAct and paid family and medical leave #paidleave #mepolitics https://t.co/rhNB9CPatb"]["The work taking place at the former mill site is a ray of positivity &amp; hope in Millinocket! https://t.co/9HPs67wHHK"]["Today I joined @OurKatahdin &amp; local leaders to discuss strategies to create jobs in Millinocket &amp; Katahdin region. https://t.co/DMuEaN1fFG"]["Fun day in Wilton for the 35th Annual Blueberry Festival Parade! #mepolitics @DailyBulldog: https://t.co/1rtQgRqH2E"]["Pleased by today's confirmation of @JRosenworcel as #FCC Commissioner. Looking fwd to working w/her to close the digital divide #homeworkgap"]["Joined bipartisan group to write to @TheJusticeDept abt protection of 5th Amendment rights. Read @RandPaul’s op-ed: https://t.co/vS6R6Lj82W"]["Doing what I can to look out for @Smokey_Bear in today’s #ENR hearing #NotSmokeyTheBear https://t.co/8Z7eJLp6ag"]["Great story on Erin French's hard work at the Lost Kitchen in Freedom, ME. More from the @nytimes: https://t.co/t5PbcoNUCt"]["@SenatorCollins The appeals process has not been updated since the 1930s &amp; this bill will consolidate this process. Learn more HERE: https://t.co/J36nJ2QgtY"]["@SenatorCollins Veteran Appeals Improvement and Modernization Act will help veterans receive a fair and timely review of their appeals."]["@SenatorCollins ...and also authorizes funding for a medical clinic for veterans in the Portland area: https://t.co/268wtQPpXq"]["The Senate passed two important pieces of legislation I cosponsored that will support Maine veterans and improve their access to health care"]["@SenatorCollins What better way to celebrate Nat’l Lobster Day than with the 7th @MELobsterFest, which kicked off in Rockland today! #mepolitics #lobstah"]["Pleased to join w/ @SenatorCollins to announce Senate unanimously passed a resolution naming Sept 25, 2017 National #Lobster Day #lobstertie https://t.co/CUZIQbIMLo"]["Great to join in the Loring House Apartments ribbon cutting yesterday! Let’s help seniors age with the independence and dignity they deserve https://t.co/m7BLxfPCpN"]["On this month’s Inside Maine Podcast, I discuss ME’s vibrant arts culture &amp; its impact on our local economy. Listen: https://t.co/UsyAyjuggC"]["@SenJohnMcCain @SenatorCollins @lisamurkowski It's easy to stand up to your opponents, but it's hard to stand up to your friends: https://t.co/Tw4PxfEFfa"]["Thx to @SenJohnMcCain @SenatorCollins &amp; @lisamurkowski. Those were some of the bravest votes I’ve ever seen in politics."]["Here’s the Glamorous Life of a US Senator. That’s me holding @timkaine’s poster. You can tell by my lobster tie #humaneasel https://t.co/1C35EpkJqJ"]["HEADS UP: Holding a press conference 11:45-12 @ Portland Int’l Jetport to discuss the Senate health care vote early this morning #mepolitics"]["LIVE ON FB @ 11:30: At Mercy Hospital to discuss path forward for comprehensive, bipartisan health care policy: https://t.co/bu4eth0K0h"]["I love John McCain. I've traveled with him, I've been tongue lashed by him, I've worked with him, and I wish I could be with him tonight."]["Great to speak w/ Rebecca Tapley, 2017 Maine Teacher of the Year Finalist from Brooklin &amp; Karen MacDonald 2014 Maine Teacher of the Year! https://t.co/3lotj6kChR"]["Proud Sebastian Belle of the ME Aquaculture Assoc has been appointed to @NOAA Marine Fisheries Advisory Committee: https://t.co/z7BSF1wFPB"]["Please see my statement on my meeting today with Christopher Wray, President Trump's nominee to serve as Director of the FBI: https://t.co/CJE7CqSXnJ"]["We’re going to spend a lot of money building walls – they may not be in Mexico – but they’re going to be seawalls all up and down the coast. https://t.co/w7j1cWUcMD"]["In the #ENR hearing today, I pressed energy experts on the costs of climate change and the impact of LNG exports for Maine consumers."]["Let’s get to work on a bipartisan basis to expand access to health care and make it less expensive for the American people #mepolitics https://t.co/OS9L5uMuuE"]["Pleasure to join you to discuss this important issue! In case anyone missed it, you can catch up on my remarks here: https://t.co/BsfmjHa8MJ https://t.co/KqizPLRFGJ"]["Congrats to @pphbkeyes for being 1 of 8 journalists selected for the inaugural Dorothea and Leo Rabkin Prize #mepolitics https://t.co/z8jNwWRqWv"]["It's time for Congress to commit to making meaningful &amp; bipartisan improvements to the ACA to make health care more affordable #mepolitics"]["Great to meet w/ @CleanAirMoms from Maine and their families today. You are protecting the health and safety of our children! #mepolitics https://t.co/6WxxRkjsgD"]["We need to hold hearings &amp; listen to insurance &amp; medical professionals &amp; hear frm hospitals &amp; constituents to understand more before we vote https://t.co/kGvvv2vUR3"]["Proud of the work of men &amp; women in the ME National Guard whose close partnership w/ Montenegro helped its ascension to NATO #mepolitics https://t.co/C7JcZ2Ko4w"]["Great to join @CNN @NewDay to discuss Russia’s interference in the 2016 election and the health care debate. WATCH: https://t.co/LA6ozA3jov"]["The internet is a powerful engine for economic and social opportunity and it must remain open to all – not just the highest bidder https://t.co/7cksrTE6Qw"]["Today is the #NetNeutrality day of action. Let’s work together to protect the open internet that supports free speech and innovation."]["Great to meet you and thanks for your dedication to ending Alzheimer's! https://t.co/ozMLGgLiJ5"]["My staffer summed up the aftermath @ her desk. Nothing is too on brand when it comes to Maine IMO @LLBean #Renys #lobstah #blueberrycrums https://t.co/bsmUGNuxvy"]["If you’re in town visiting DC from Maine, stop by my office for some coffee and homemade blueberry cake at 9 am on Wednesdays #mepolitics"]["Excited @connctwithaxiom &amp; @Microsoft @AAIGrantFund will collaborate to close the #DigitalDivide in rural Maine w/ #TVWS technology"]["Thx to @machiasnews for covering my visit Down East last week. I want to work to provide affordable, accessible health coverage for ME ppl. https://t.co/WMx1twlNLl"]["Read my ideas on securing America's critical infrastructure from Sept 2016 op-ed w/ @SenatorRisch: https://t.co/qrYMpolTCD"]["That's why I've introduced a bill that aims to protect America's electric grid from cyber-attacks."]["News of attempts to hack nuclear power plants underscores need for US to develop comprehensive cyber strategy: https://t.co/Txh7sVbTZu"]["…that it will make health insurance more expensive for them and that it will endanger community hospitals in rural parts of the state."]["I am very concerned that people in communities like Eastport and Machias will get hammered by this bill..."]["I also visited w/ health professionals from across Washington County @ Eastport Health Care Clinic &amp; Down East Community Hospital in Machias"]["Wonderful few days Down East this week! The streets were packed w/ patriotic onlookers for the Grand Independence Day parade in Eastport. https://t.co/vUZm9g3Hb0"]["See my statement in honor of Independence Day below #FourthofJuly #mepolitics: https://t.co/kPg1gVz05a"]["Looking forward to marching in the Grand Independence Day Parade in Eastport today! Happy #FourthofJuly and God Bless America 🇺🇸🇺🇸🇺🇸"]["This exciting announcement will help bolster Saddleback’s place in the region &amp; strengthen the economy @wlbz2 https://t.co/aijzZy5QnF"]["Saddleback has long been an impt pillar of Rangeley Lakes Region, attracting outdoor enthusiasts &amp; families &amp; helping grow the local economy"]["Important hearing yesterday in Intel Committee about Russian attempts to influence elections in Europe and what we can learn in the US: https://t.co/zEPymtgpvV"][".@nytimes The Daily Podcast spoke w/ @HFHC_Maine of Harrington abt what the health bill means for Maine. LISTEN: https://t.co/CGlFJg6GAJ"]["You can consider this retweet an endorsement. https://t.co/FvU0dTyHdR"]["Great story from @DeptofDefense on Maine National Guard's work to help the Raymond community #mepolitics: https://t.co/NlUALweULP"]["@AARPMaine Over 10k ppl dialed into @AARPMaine tele town hall. This is a serious issue &amp; we need serious community engagement to address it #mepolitics"]["@AARPMaine Allowing Medicare to negotiate the price of drugs would save $25 B a year. Fixing this would save taxpayers money and save seniors money: https://t.co/p3WI3qnNYs"]["@AARPMaine I've visited w/ rural hospitals throughout our state. This bill will deal a blow to these hospitals and Maine's rural economy #mepolitics https://t.co/plmVLbhcCD"]["@AARPMaine Maine is the oldest state in the country. We cannot let a bill like this hurt our seniors @AARPMaine https://t.co/2erRcuh9Iz"]["Hosting a tele town hall with @aarpmaine on health care proposal. Listen to some of my thoughts #mepolitics: https://t.co/Vdz3Y4dCHW"]["On this month's podcast, I discuss summer outdoor activities in ME. Listen to some tips from the pros @mainehuts: https://t.co/tEfZ7VdC6R https://t.co/8JHa4M8CSU"]["@WIRED That's why @SenatorRisch &amp; I introed bill that would use retro approach 2 safeguard against cyberattacks. More HERE: https://t.co/UTgh2EGgK0"]["Fun to join @SenatorCollins today to speak with over 300 @girlscouts from around Maine on the steps of the Capitol Building. https://t.co/X5K1MKFoQL"]["All this week we’ve hunted around here for the health care bill. This morning we found it &amp; I’m kind of sorry we did because it’s pretty bad https://t.co/AT08MvQx7Z"]["ICYMI: I spoke recently w/ @AlHuntDC about my work on the Intel Committee. Check out the Q&amp;A @bv https://t.co/vD05RmtUml"]["When the it was founded, Glacier National Park had 150 glaciers. Today it has 26. 🤔🤔 https://t.co/j3K9vrI0JO"]["3/ I am grateful to all who serve &amp; offer deepest condolences to the families, friends &amp; teammates of those who made the ultimate sacrifice."]["2/ are a sobering reminder of the sacrifices our servicemembers and their families make to defend our country."]["1/ Recent US casualties, including servicemembers killed in Iraq, Somalia, Syria &amp; Afghanistan, and the 7 sailors lost on the USS Fitzgerald"]["Let us recommit ourselves to assisting the seniors in our community and help them live with the distinction and dignity they deserve. https://t.co/bViiwk1Djo"]["we must be increasingly aware of potential elder abuse, whether it be physically or through financial manipulation like phone scams."]["Today is World #ElderAbuse Awareness Day. Maine has the oldest population in the country – and with an aging population –"]["@USArmy General Allyn served the country with integrity and courage, and his leadership in the @USArmy will be missed. https://t.co/oIpFeZ5SvW"]["Honored to present General Allyn, a Berwick native, w/ an American flag flown over the Capitol ahead of his retirement from the @USArmy https://t.co/i6zAVpqdrw"]["Great to join @CNN @NewDay this morning to discuss my thoughts on yesterday’s #SessionsHearing: https://t.co/UgAh5QcXHX"]["Encouraged @POTUS has renominated @JRosenworcel as FCC Commissioner. Her leadership has helped address #HomeworkGap and digital equity."]["Read my op-ed in the @bangordailynews abt economic impact of Katahdin Woods &amp; Waters Nat’l monument for the region: https://t.co/fbI9wEZAdp"]["Praying for my colleagues, Capitol Police, staff and all those at the Congressional baseball practice this morning."]["WATCH my questions for Attorney General Sessions during today’s Senate Intelligence Committee hearing: https://t.co/inRgqYWvS9"]["Joined @RepPoliquin to commend the brave men &amp; women of Maine @VFWHQ at their convention in Bangor. TY for all you have done for our country https://t.co/rGxyfeFDbr"]["WATCH more of my questions from the #ComeyHearing HERE: https://t.co/7lhDJIfhIe"]["ICYMI: Watch my remarks from yesterday’s #ComeyHearing. I don’t think Putin is a Republican or a Democrat. He is an opportunist. https://t.co/tawH6xQLY6"]["Great to meet with Maine Boren Scholarship winners Kathleen Donovan and Isabel Udell! https://t.co/OfkOJNMj71"]["ICYMI: Heartbreaking @nytimes story on impact of drug crisis. We must do all we can to support our communities: https://t.co/amsEGyXqov"]["Humbled to join w/ ppl in France and US to honor Charles, his Native American comrades, &amp; all those who advanced in defense of freedom #DDay"]["Charles, a medic during the war, is a member of the Penobscot Nation from Indian Island."]["In France today, Charles Shay Indian Park, overlooking Omaha Beach, will be dedicated as a lasting tribute to Native American soldiers. https://t.co/2XC5ljBgZK"]["These many years later we remember the lives lost and honor the immense bravery and courage on the beaches of France that day."]["73 yrs ago today, the Allied Forces stormed the beaches at Normandy &amp; began the liberation of Western Europe during Operation Overlord #DDay https://t.co/JHZ6JndjRF"]["On the anniversary of Robert Kennedy’s death, I am reminded of my favorite speech of his, delivered in South Africa in 1966 #RememberingRFK https://t.co/le3W3usyvO"]["HAPPENING SOON: Hosting my Inside Maine Podcast on @WGANNews about importance of H-2B visas for ME economy. Tune in: https://t.co/4FPZupAc2B"]["Great to make a surprise visit to Longfellow’s Greenhouse in Manchester to celebrate the family business’ 40th anniversary. https://t.co/9xBrZRmm07"]["@DeptVetAffairs …to those who helped clean up Enewetok Atoll and other sites on the Marshall Islands. #mepolitics: https://t.co/pVsG0ottu3"]["To underscore my support for Paul &amp; 100’s of vets like him, I announced support for bill to extend key @DeptVetAffairs health benefits…"]["Honored to present veteran Paul Laird w/ Humanitarian Service Medal in my Augusta office to honor his work at Enewetak Atoll nuclear site. https://t.co/neWULnLHgx"]["Helping seniors age safely at home is a critical part of the health care debate @SenBrianSchatz @SenatorCollins: https://t.co/iNqGjyNkd4"]["Please see my statement on the @USCBO score on the #AHCA: https://t.co/06BEOMSL0A"]["Pre-existing conditions can happen to anyone, which is why we’ve got to address this terrible bill that passed in the House #mepolitics https://t.co/81guUed21f"]["@ 12:30 I’ll join @SenatorDurbin, @SenBrianSchatz &amp; cancer survivors to discuss impact of #AHCA on people with pre-existing conditions"]["In the last yr, ME took back 27,140 lbs of drugs. Thx to law enforcement &amp; communities for critical accomplishment in fight against opioids"][".@DeptVetAffairs has awarded $479,155.51 to Maine Veterans’ Homes to provide veterans w/ the high-quality care and support they deserve"]["Tune at 6 pm on @WCSH6 and @WLBZ2 to hear @SenatorCollins and I discuss our work in the Senate #mepolitics https://t.co/BcZ1ceym8X"]["WATCH LIVE: A discussion with @AARPMaine @bangorlibrary about how #AHCA will affect older, rural Maine people: https://t.co/bu4eth0K0h"]["@Interior Let @Interior know your opinion on the review HERE https://t.co/ykO3oKl4jS \n\nIf you have trouble submitting your opinion CALL 1-877-378-5457"]["I questioned nominee for Deputy Secretary of @Interior about review of Katahdin Woods and Waters National Monument #mepolitics https://t.co/ri0MMGLIat"]["Proud to join my colleagues to honor law enforcement across the US with National Police Week Resolution #PoliceWeek #PoliceWeek17"]["Please see my statement on former FBI Director Robert Mueller's appointment as special counsel to oversee Russia investigation: https://t.co/WCkXMfI2Mz"]["3/ What happens to Lidia? What happens to Dan? Who will speak for them? I will – and I hope this body will. https://t.co/bRnByenV1Y"]["2/ I took to the Senate floor to share their stories with the nation and speak out against the House-passed health care bill"]["1/ After hearing from the mothers of Daniel Humphrey of Lewiston and Lidia Woofenden of Bowdoinham, two young adults with disabilities"]["Funding for @jacksonlab will help to better understand Alzheimer’s &amp; develop strategies that will help find a cure: https://t.co/qyuxLBuwem"]["This bill would help law enforcement stop illegal drugs from entering US &amp; fight off the grip of addiction before it begins. #mepolitics"]["I view this as a very serious matter, and it is my intention to obtain the facts before arriving at any conclusions. https://t.co/rdJGq6GYVu"]["HAPPENING SOON: I'll join @wolfblitzer in the @CNNSitRoom. Hope you can tune in!"]["(3/3) Furthermore, it could result in the loss of important intelligence sources and the cooperation of partners."]["(2/3) Jeopardizing the sources and methods that support our intelligence gathering apparatus or those of an ally, are of grave concern."]["(1/3) If true, this report is very troubling."]["Great to meet with members of the Maine Warden Service, who were in town for National Peace Officers Memorial Day https://t.co/4PtxN1Gnn9"]["Funding for @islandinstitute critical to address threats resulting from climate change #mepolitics @PenBayPilot: https://t.co/INrCEbjocu"]["Worldwide cyber-attacks underscore need for U.S. to develop comprehensive cyber strategy to strengthen our national security"][".@Interior is accepting comments for its review of the Katahdin Woods &amp; Waters National Monument. Be heard here: https://t.co/Pm0EKKSrFZ"]["WATCH my full remarks from Intel hearing w/ Acting FBI Director, DNI, CIA Director &amp; Director of the NSA: https://t.co/jo2TPD5owk"]["#AHCA is a foolishly misnamed bill that would hurt people across Maine. @sunjournal #mepolitics: https://t.co/s0a8iWcDcQ"]["I joined @MSNBC’s @Morning_Joe to discuss the President’s firing of Director Comey and the ongoing Intel Committee investigation: https://t.co/hDQGsIzLr1"]["Watch my remarks on #AHCA’s impact on the opioid crisis. This bill is ill-conceived, damaging, and downright cruel: https://t.co/MFO1XNc6YV"]["On Senate floor today: Proposed cuts to ONDCP like abolishing DOD in in the middle of World War II #mepolitics"]["WATCH LIVE HERE: https://t.co/jzZHAhz5i0"]["HEADS UP: Speaking on the Senate Floor abt 12 pm to discuss consequences of #AHCA for drug epidemic and proposed cuts to #ONDCP #mepolitics"]["Please see my statement on the President's firing of FBI Director James Comey: https://t.co/41UkM3vRC3"]["I'll be on @npratc tonight to discuss breaking news on FBI Director Comey"][".@MainePublic If we can check a paper trail, we can secure the integrity of our elections."]["Letter is in response to Russian hackers probing state elections systems during 2016 election @MainePublic: https://t.co/SXCSkaSq3u"]["Today, I wrote to Senate Approps urging them to help local &amp; state gov’ts safeguard against attempts to alter election results"]["Please see my statement on @Interior's announcement today that it will review Katahdin Woods and Waters National Monument #mepolitics: https://t.co/FAscZHhrvq"][".@CBSNews Over 360 Maine people died due to a drug overdose in 2016. This crisis affects everyone. #ONDCP must remain fully funded."][".@CBSNews About 1 in 12 babies in Maine are born with drugs or alcohol in their systems, this is not the time to make cuts to the #ONDCP budget."]["#ONDCP is critical to combat the opioid epidemic &amp; save lives in ME communities @CBSNews: https://t.co/YjEhRfHxPX"]["Administration’s proposal to slash Office of Nat’l Drug Control Policy by nearly 95% is misguided and dangerous #mepolitics"]["Read more about the two bipartisan bills I introduced today to support hydropower HERE: https://t.co/3KnD4KzDju"]["In Maine, nearly a quarter of the total power we produce is hydropower – a renewable, clean, and homegrown form of energy. #mepolitics"]["That’s why @SenatorCollins and I urge Senate Approps to support robust funding for State Veterans’ Homes: https://t.co/XbNB0ELvF3"]["State Veterans’ Homes have a long history of helping ensure that disabled veterans receive the respect and dignity they have earned"]["Live look at the House health care bill: https://t.co/C3eKBFXBSc"]["#Tbt to my #StarWars reference on @Morning_Joe. #StarWarsDay #MayTheFourthBeWithYou #Thesearentthedroidsyourelookingfor https://t.co/uyeR1aTyHB"]["The bottom line is the House health care bill is a shift and shaft and it's going to cost Maine people their health insurance #mepolitics https://t.co/7v6L3ZeMDD"]["Fun to read Blueberries for Sal for the digital collection at Skidompha Library in Damariscotta #mepolitics https://t.co/cZT941vd1o"]["Spoke on Senate floor abt @usedgov division on @UMPIowls FY2017 grant app for Upward Bound. Watch via @MainePublic: https://t.co/EwxcFj8kxv"]["WATCH LIVE: Speaking on the Senate floor around 12 pm about @usedgov line spacing decision that harms ME students: https://t.co/STApEnc1t1"]["Met a brave young boy today, Kellan Tilton of Detroit, ME. Kellan is a cancer survivor in DC to raise awareness for childhood cancer. https://t.co/pTY5C8sgoo"][".@MeetThePress You can watch my full interview with @SenatorCollins on @MeetThePress HERE: https://t.co/Pq9TPTu4A6"]["On @MeetThePress yesterday, I discussed an often overlooked problem with the gridlock in Congress. WATCH: https://t.co/wsSH0vEpM7"]["On this month’s Inside Maine Podcast, I discuss investing in manufacturing communities to help grow ME’s economy: https://t.co/UB9XYBonkN"][".@MeetThePress .@SenatorCollins and I will be LIVE in studio on @MeetThePress w/ @chucktodd around 9:20 am https://t.co/plfnhMWB7t"][".@MeetThePress ...There's a punchline in there somewhere #mepolitics"]["Two Maine Senators walk into the @MeetThePress studio..."][".@usedgov Then let's start by allowing for consideration of UMPI app now. ME students deserve better &amp; I'll keep fighting to be sure they can succeed"][".@usedgov In fact, if @usedgov really believes \"needless red-tape should never interfere with helping students\"..."]["It's clear from the @usedgov statement that Sec. DeVos can fix this problem immediately. https://t.co/2HYCX54K5I"][".@bangordailynews Ed Board underscores ridiculous bureaucracy that jeopardizes opportunities for ME HS students: https://t.co/J8VsH5s9oB"]["Look forward to joining @SenatorCollins on @MeetThePress! https://t.co/q0ijoRR1H4"]["Last days for the spring interns! All congressional offices have interns, but mine are always the coolest, as you can plainly see. https://t.co/FjwoNZltbt"]["It is essential that the US continue to press China to recognize that a nuclear armed NK is not in their interest: https://t.co/B5ZkXzJnZt"]["I believe it is critical that there be an increase in diplomatic &amp; economic pressure – particularly from China – to help address this threat"]["Spoke with Lake Region High School World Quest Team today &amp; @SenJohnMcCain was kind enough to visit with them as well #mepolitics https://t.co/iuZqt1Q9CT"]["I joined @wolfblizter in the @CNNSitRoom to discuss the situation in North Korea. WATCH HERE: https://t.co/RXSvnfKj4B"]["Encouraged that, in conjunction w/ #LabWeek, Senate HELP Committee unanimously approved #SMASH Act, bill I authored to combat #Zika"]["Look forward to talking to you at 6 pm @wolfblitzer https://t.co/5a0LTy9MXf"]["Issue w/ @UMPIowls grant app for Upward Bound Program is what people hate about government. We need to get it fixed. #mepolitics https://t.co/BYJ63X7jVC"][".@UMPIowls @usedgov We strongly urge @usedgov to reconsider its decision &amp; allow UMPI’s application to be read and scored. More HERE: https://t.co/ofRGAkQmj2"][".@UMPIowls @usedgov …over the next five years, denying 960 disadvantaged high school students the chance to fulfill their academic potentials. #mepolitics"][".@UMPIowls @usedgov This is a minor formatting oversight, and @usedgov decision risks…"][".@UMPIowls .@usedgov determined the grant apps are ineligible b/c two infographics in @UMPIowls proposal R depicted w/ 1.5 line spacing instead of 2.0"]["Along w/ the entire Maine Delegation, I wrote to Secretary DeVos in support of @UMPIowls grant applications for the Upward Bound Program"]["Joined @CNN to discuss ongoing investigation on Russian’s role in US election &amp; upcoming briefing on North Korea: https://t.co/rYCNsOShZ3"]["I'll join @CNN @NewDay around 7:30 this morning. Hope you can tune in!"]["Happy #nationalhighfiveday! https://t.co/VzIu3QyHxk"]["Last night I discussed US foreign policy &amp; the lessons I’ve learned on #SASC and #Intel Committees @OnlineSentinel: https://t.co/Pe2xoDvGdL"]["Looking forward to the George Mitchell Distinguished International Lecture at @ColbyCollege tonight at 7 to discuss US foreign policy"]["Joined @ColbyCollege President David Greene in downtown Waterville to survey Colby’s economic revitalization work w/ community partners https://t.co/4ykQQvFUdf"]["That’s why I’ve joined w/ @SenatorBurr to re-introduce the PACE Act to update the Child &amp; Dependent Care Tax Credit: https://t.co/eb6rHgmrku"]["While I was there, I spoke with parents and childcare professionals about the importance of affordable childcare #mepolitics"][".@AmericanLegion @DeptVetAffairs As I said when the bill was first introduced, justice delayed is justice denied. #supportourveterans: https://t.co/yAHDn38hJy"]["I joined veterans at the @AmericanLegion post in Auburn to call on Congress to pass the @DeptVetAffairs Appeals Modernization Act https://t.co/uCykpY0QTz"]["It was great to speak w/ students from Wiscasset Middle High School via Skype for my Capitol Class! @MidcoastNews: https://t.co/g54MSuM7LD"]["100 years later, we commemorate this solemn occasion &amp; memorialize the servicemembers who laid their lives on the line so we may live free."]["On April 6, 1917, the US entered the First World War. Over 32,000 Maine people served, and more than 1,000 paid the ultimate sacrifice."]["Thank you @SenatorBaldwin for your leadership on the #DairyPride Act https://t.co/fFeSykSO9S"]["Joined with @SenatorShaheen to introduce #SAFEBridges Act to upgrade bridges &amp; help support jobs in ME: https://t.co/YkfmvxyWVo"]["Met w/ members of the Maine Motor Transport Assoc to discuss strategies to build the workforce &amp; invest in our roads and bridges #mepolitics https://t.co/UUCKTCFAfv"]["Great to join @SenatorRisch to advance the interests of forest workers and strengthen rural communities #workingforestscaucus #mepolitics https://t.co/VWfiEqRnWL"]["Please see my statement on the reported chemical weapon attack in Syria: https://t.co/jDJSkUlKlk"]["Invest in Rural America Act will support Maine's forest products sector and help train the next generation of loggers #mepolitics https://t.co/IFMOrqhAv2"]["In conjunction with my plan, I announced a bill proposal, the Invest in Rural America Act, to grow Maine’s workforce https://t.co/q6ak17N6JS"]["This morning in Mexico, I outlined my economic agenda “You Can Get There From Here: Growing Maine’s Rural Economy”: https://t.co/0Tfso9JmFa"][".@SenatorCollins Bipartisan bill makes permanent the Investing in Manufacturing Communities Partnership: https://t.co/DPTbSv10lY"]["Joined w/ @SenatorCollins to introduce the Make it in America Manufacturing Communities Act #mepolitics"]["Thanks for your hard work on behalf of the American people @SenatorLankford! https://t.co/CLZ1SklEqv"][".@SenThomTillis Bureaucratic failures w/ H-2B are standing in the way of ME businesses succeeding or even keeping their doors open: https://t.co/aNacEOeqSv"]["Joined @SenatorLankford on @Morning_Joe to discuss importance of Senate Intel conducting non-partisan investigation: https://t.co/XdrI9ZVH8c"]["Proud to have @RepJoeBarton &amp; @repjohnlewis introduce the DELIVER Act in the House today! CC: @JohnCornyn, @_MealsOnWheels #mepolitics"]["Maine @USNationalGuard critical in preparing Montenegro for accession to @NATO #mepolitics: https://t.co/4HrogIq9GN"]["Discussed importance of transparent Senate Intel investigation on Russian influence in election w/ @MSNBC. WATCH: https://t.co/1ghV5KYU4l"]["Joined w/ @CoryBooker to reintroduce bill to preserve &amp; protect rights of cities &amp; towns to invest in local broadband infrastructure"]["Looking forward to joining @11thHour tonight to discuss Senate Intel Cmte's investigation into Russia &amp; our election. Hope you can tune in!"]["HAPPENING NOW: Hosting Inside Maine podcast on @WGANNews abt importance of open &amp; transparent gov't. Listen LIVE: https://t.co/OJGFVzsMUw"]["You can watch the discussion LIVE on my Facebook page at 1:30 pm HERE: https://t.co/10KHd9PF71"]["HEADS UP: Hosting a discussion at a hospital in Skowhegan on how #ACA replacement bill will set back the battle against the opioid epidemic"]["Scott &amp; Sarah from my staff packed @_MealsonWheels for homebound Lincoln County in Damariscotta yesterday! #mepolitics https://t.co/REhixAjBr2"]["Introduced bill w/ @JohnCornyn to promote volunteerism within meal delivery programs &amp; help provide meals to more seniors #mepolitics https://t.co/kZd2ZC1X0k"]["Questioned Gen. Scaparrotti, @US_EUCOM Commander, abt Russian overreach &amp; importance of comprehensive cyber strategy https://t.co/pZnLbgfgCy"]["Met w/ students from Cape Elizabeth HS &amp; Telstar HS in Bethel yesterday. Great to see young people engaged in our legislative process! https://t.co/CBezVIsnvB"]["Retreating from global economy is not an option when other developed countries press forward w/o us @PressHerald: https://t.co/dqthGoscjk"]["The trade agreement between Canada &amp; EU is extremely problematic for Maine’s lobster dealers, processors, and commercial fishermen."]["Met with Dayna McCrum &amp; Natalie Hodgman who were in DC talking about the future of Maine agriculture during @agday #mepolitics #AgDay https://t.co/avsjVTX6c7"]["Read my full letter outlining trade priorities HERE: https://t.co/ZAKhuAgclr"]["Last week, I wrote a letter to @POTUS outlining several trade priorities that must be addressed to support Maine people and industries."]["Flight Deck Brewing ribbon cutting yesterday underscores powerful economic potential for Maine’s craft brewing industry #mepolitics https://t.co/c5kMg3v4mz"]["Spoke w/ Oxford Hill Chamber of Commerce abt rural development in Maine’s communities. More from the @SunJournal: https://t.co/ENSsaKYgr3"]["Congrats to Cape Elizabeth High School for advancing to the National Science Bowl Finals this April! @ENERGY @DOE_SC_NSB #STEM #mepolitics"]["Honored to join @SenTomCotton yesterday for my inaugural hearing as Ranking Member of #SASC Airland Subcomittee. WATCH: https://t.co/NZMD1FIh5d"]["You can WATCH LIVE HERE: https://t.co/WTSW1Dhbdy"]["HAPPENING SOON: I’ll be LIVE on FB at People Plus to discuss the impact ACA replacement bill will have on older Mainers"]["Great calling in yesterday during your #bipartisanroadtrip. Look forward to working w/ you to move this through Congress @BetoORourke. https://t.co/g0ggwRFZMz"]["Ban hurts national security, risks pushing more recruits to ISIS &amp; is not needed 4 better vetting. Indy judges one of Framers best ideas."]["Bill was introduced in conjunction w/ #SunshineWeek – an initiative led by @NewsEditors to emphasize an open government #mepolitics"]["Reintroduced bill to increase transparency in campaign contributions &amp; help voters know who is funding candidates: https://t.co/r041iRSpjK"]["Joined @CNN last night to discuss #ACA replacement bill &amp; the recently released @USCBO score #shiftandshaft: https://t.co/jC1Y1PaG9I"]["Happy 197th Birthday to the greatest state in the Union! #mepolitics #PineTreeState #Dirigo https://t.co/R7zCHiPbbV"]["WATCH LIVE TOWN HALL: Calling @BetoORourke &amp; @HurdontheHill to discuss bill to increase transparency in campaigns: https://t.co/XhMBoykSO2"]["HEADS UP: I'll join @wolfblitzer in the @CNNSitRoom around 6 pm. Hope you can tune in!"]["Stay safe and drive with caution if you’re on the roads! #StellaBlizzard https://t.co/xin6G0ZdYH"]["HAPPENING SOON: I'll join @msnbc to discuss the #ACA Replacement and the recently released CBO score"]["Read Bill's op-ed in the @PressHerald HERE: https://t.co/HjYrqRjuiO"]["It is specific stories like this from our fishermen and farmers that can affect change in Washington. @EPA"]["Thanks to Bill Mook of @MookSeaFarm for highlighting the impact of climate change on Maine aquaculture #mepolitics"]["Great to meet with Lily Tedford of South Portland and Katie Waeldner of Yarmouth, Maine’s 2017 delegates to the @SenateYouth Program! #USSYP https://t.co/Or961lIDYg"]["Joined @Greta last night to discuss continued investigation into Russia’s role in the 2016 election. Watch HERE: https://t.co/WVWgmGSLpE"]["HAPPENING SOON: I'll join @greta on @MSNBC around 6 pm. Hope you can tune in!"]["On #ACA Replacement: The pattern is shift &amp; shaft. Shift the cost &amp; shaft the people who need coverage. Watch HERE: https://t.co/cAkcsU8xdz"]["HEADS UP: I’ll be speaking on the Senate floor around 11:45 re: recently released proposal to replace the Affordable Care Act #mepolitics"]["Maine @VFWHQ members stopped by my office last week to underscore issues critical to Maine #veterans. TY for your service! #mepolitics https://t.co/wsAC8TqGGG"]["Last night's event on #SCOTUS nominee Judge Gorsuch is what democracy should look like. More from @WCSH6: https://t.co/gBsLODE08I"]["Thanks to @NPR @MorningEdition and @NPRInskeep for having me on today! https://t.co/7A45xsthaN"]["Thanks to Maine @AmericanLegion members for all you do for veterans in Maine and across our country #supportourveterans https://t.co/eDq0rLNAoW"]["TY to all those who came out tonight! If you'd like to share your thoughts &amp; opinions please be in touch #mepolitics https://t.co/rM1XfTy9JT"]["I hope to see you there for this critical discussion. If you are unable to attend the event, watch it live HERE: https://t.co/TpqR7r8YGR"]["It will be held in Hannaford Hall in the Abromson Community Education Center on the USM campus from 5 pm to 7 pm: https://t.co/jtqHD38cvw"]["The session is sponsored by @UMaineLaw &amp; @USouthernMaine"]["I look forward to hearing directly from Maine people tonight at my listening session on #SCOTUS nominee Judge Neil Gorsuch #mepolitics"]["Great to meet with members of the Maine @DAVHQ to discuss issues important to Maine disabled #veterans #mepolitics https://t.co/6B98fqheUi"]["My statement in response to reports concerning Attorney General Jeff Sessions’ meetings with the Russian Ambassador: https://t.co/75TFqIfnig"]["But it’s a crisis that can be avoided too, &amp; that’s why this legislation is so impt. More from @bangordailynews: https://t.co/q9SkUHVi8F"]["…and it’s one that people in Maine confront every day when they walk into a drug store or when they get their bill."]["The rising costs of prescription drugs in this country is a crisis –"]["I joined w/ colleagues in the Senate &amp; House to introduce a bill to allow the safe importation of prescription drugs into the United States"]["Thanks to @BillMaher &amp; @RealTimers for having me on the show last week! https://t.co/gc2ijtKhh5"]["You can watch tonight's #JointSession LIVE HERE: https://t.co/nPkkK7W43y"]["Sat down w/ Kevin Lewis of ME Community Health Options who is my guest for the #JointSession. Honored to have him here tonight! #mepolitics https://t.co/e8qsIJ3HHD"]["You can vote for finalists in the #Doodle4Google competition HERE: https://t.co/6DqnEa1bRj"]["Congrats to Ruth Havener of Medomak Middle School for qualifying as a finalist in the #Doodle4Google contest. You make Maine proud! https://t.co/HwiiQlIIXx"]["Thanks to @CNN @NewDay for having me on this morning. https://t.co/09uSdR2Yh0"]["Join me LIVE w/ @SenSanders @ 12:30 to discuss new bill to allow safe importation of prescription drugs into the US: https://t.co/AqfnszM2N3"]["Listen LIVE to Inside Maine radio show with Dana Doran of PLC of Maine &amp; Sean DeWitt of @OurKatahdin HERE: https://t.co/4FPZupAc2B"]["HEADS UP: Tune in to Inside Maine on @WGANNews in the 10 am hour to hear more about the importance of ME’s rural economy #mepolitics"]["Look forward to joining @billmaher tonight on @HBO! https://t.co/NXFQzIq3u4"]["“We must disenthrall ourselves, and then we shall save our country.”"]["“The occasion is piled high with difficulty, and we must rise with the occasion. As our case is new, so we must think anew, and act anew…"]["Lincoln said, “The dogmas of the quiet past, are inadequate to the stormy present…"]["In the process he spoke what I think is the most eloquent, concise and best advice to any of us dealing with the challenge of change."]["On this #PresidentsDay, one of the most profound quotes from President Abraham Lincoln comes to mind."]["Thanks to @HardballChris for having me on this evening https://t.co/kOWscX2NgF"]["HEADS UP: I’ll be on @MSNBC’s @Hardball around 7:15 pm. Hope you can tune in!"]["Strengthening rural high speed broadband will support Maine economy &amp; bring good jobs to our state #mepolitics https://t.co/wQhxXE8aaf"]["…with our friends and trading partners across our northern border. #mepolitics More from @Mainebiz: https://t.co/3GC2svzGYf"]["All trade rules must be properly adhered to so that we can continue our healthy and beneficial relationship…"]["Joined ME delegation to write to USTR re: reports of subsidies that may have been illegally offered to company in Quebec"][".@WCSH6 last year reported on the Brennen family whose tragic story inspired this bill. I hope we can act for them: https://t.co/oVHY1Mx3TG"]["No one in America should have to endure the pain or financial hardship caused by such a senseless policy. This bill is the right thing to do"]["Inspired by a Maine family, our bill would end a student loan tax penalty levied on parents after a child's death or permanent disability."]["Joined @SenRobPortman &amp; @ChrisCoons today to reintro the bipartisan Stop Taxing Death and Disability Act: https://t.co/s483pvRD8a"]["Thanks to @MaineCalling for a great discussion earlier! ICYMI, you can listen here: https://t.co/yoQ8KONAUF #mepolitics"]["Interested in connecting with me on @MaineCalling today at 1pm? Visit here to find out more: https://t.co/yds3TUYIQP #mepolitics"]["Excited to join @MaineCalling today at 1 pm. Hope you can listen-in &amp; be in touch with your Qs. Look forward to hearing from you #mepolitics"]["2017 James Beard Semifinalists show how strong Maine’s food industry is! Check them out here: #mepolitics: https://t.co/7lHRIN5xey"]["Thanks to @NPRinskeep for having me on Morning Edition this AM. Listen HERE: https://t.co/EzXwVGNcL4"]["I urge @POTUS to work w/ Congress to pass the Medicare Prescription Drug Price Negotiation Act as soon as possible: https://t.co/0syQn19yGV"]["HEADS UP: I’ll join @KatyTurNBC on @MSNBC around 2:15. Hope you can tune in!"]["Great to see a genuine outpouring from Mainers contacting my office. Please continue to be engaged. @SunJournal: https://t.co/AGE4rN2CHG"]["HEADS UP: I'll be on @MSNBC's @Morning_Joe around 7. Hope you can tune in!"][".@CharlesPPierce on my speech late last night on the Senate floor voicing my concern abt Tom Price heading @HHSGov: https://t.co/0V3ofHi1Vk"]["We need to increase access to this life-saving drug, not make it harder to get #mepolitics @WLBZ2: https://t.co/0o41G1DYp0"]["Naloxone is a critical tool in the fight against opioid deaths. That’s why the approx 500% price hike on the Evzio injector is so dangerous."]["It was great to see ppl from all over Maine in my office! If you’re ever in DC, come by @ 9 am on Wednesdays for coffee &amp; blueberry bread https://t.co/Rjrz8Z6aWJ"]["Thanks to @mainecalling for letting me call in this afternoon @MainePublic #mepolitics"]["UP NEXT: I'll be on @hardball on @MSNBC"]["HAPPENING NOW: I'm speaking with @ErinBurnett on @OutFrontCNN. Hope you can tune in!"]["Pitched in on the phones this morning. We’re listening! Keep engaged, keep involved, keep in touch #mepolitics https://t.co/CObAnovGz7"]["Sappi’s investment in Skowhegan will continue to help the forest industry be a source of good jobs in ME. @Mainebiz: https://t.co/U2I75yjWT4"]["Improving Rural Call Quality &amp; Reliability Act will improve telecommunications &amp; help rural Maine communities grow: https://t.co/sojyPCDlEc"]["In an ever-interconnected world, reliable, quality phone service is a necessity for families and businesses in rural Maine #mepolitics"]["HAPPENING SOON: I'll speak with @greta on @MSNBC. Hope you can tune in!"]["Mary teamed up with my staff in Maine today to answer calls. Thankful to have such a wonderful partner dedicated to helping Maine people! https://t.co/EdduGxmutA"]["…and that Maine students will be guaranteed an equal opportunity to a quality education #mepolitics"]["...Maine public schools will be provided adequate and appropriate funding…"]["I continue to harbor those concerns, and in light of her confirmation, now consider it my responsibility to fight to ensure that…"]["…and indeed, that she was hostile to the fundamental mission of the Department"]["After following her confirmation hearing closely &amp; after a great deal of consideration, last month I concluded I could not support Ms. DeVos"]["DoD 2016 Arctic strategy is an important &amp; necessary step forward in defining our national security interests in the Arctic @SenDanSullivan https://t.co/N9HLFRcM21"]["Congrats to Tom Brady and the @Patriots for a comeback win for the history books! #oneforthethumb #SuperBowl #Champions https://t.co/LIYnGKTX8B"]["My grandson sending a message to Houston! #Patriots #SuperBowl #SuperBowl51 https://t.co/cAHPqxJb3j"]["Great to visit Irving Sawmill in Dixfield, the 4th largest sawmill in Maine -- employing 280 hardworking men and women #mepolitics https://t.co/lamtCAoMeL"]["Pleased @DeptofDefense has exempted most civilian employees at #PNSY in Kittery from recently announced federal civilian hiring freeze."]["Because when we talk about stats, we’re talking about people. We’re talking about their families. About our neighbors &amp; our communities."]["The fight against the drug epidemic is far from over, &amp; the Senate cannot lose sight of the work left to do to help those who need it."]["&amp; it should be a wake-up call to those in Congress who simply thought they could pass a bill, move along, and this crisis would solve itself"]["In Maine, more than one person a day died from a drug-related overdose last year. That’s a troubling, staggering figure –"][".@SenatorHeitkamp just launched her new podcast “The Hotdish”! A hardworking friend and colleague. Listen HERE: https://t.co/uWnbhMDS4J"]["Great to co-host the bicameral, bipartisan caucus discussion on 2017 broadband infrastructure priorities #ruraleconomy #jobs #mepolitics https://t.co/bN4qwj9Hkd"]["HAPPENING SOON: I'll be joining @wolfblitzer in the @CNNSitRoom around 6 pm. Hope you can tune in!"]["Watch LIVE: 2017 Broadband Infrastructure Priorities w/ members of Senate Broadband Caucus &amp; industry leaders: https://t.co/YploJNqWGT"]["A great story of hard work and determination from a Maine small business. @CEIMaine #DoveTailBats #ruraleconomy #MadeinMaine https://t.co/L3qFfBJWbu"]["Joined @CNN @NewDay this morning to discuss my opposition to @POTUS’s Executive Order on Immigration: https://t.co/1ujU5SlnWY"]["ICYMI: @FoxABCMaine discusses my Jan Inside Maine Podcast: https://t.co/xLPVDROgZb. Listen to the full podcast here: https://t.co/HiJuqQJZC1"]["Honored to be named Ranking Member of Energy and Natural Resources Subcommittee on Water &amp; Power #mepolitics"]["Your input is an essential part of our democratic process #mepolitics"]["If you’d like to be in touch with my office, please follow this link: https://t.co/rM1XfTy9JT"]["Thank you to the thousands of people across Maine reaching out to share your opinions, thoughts and concerns w/ me &amp; my office #mepolitics"]["Unfortunately, President Trump has taken the bait – and the fight against ISIS just got a lot harder."]["...to bait us into converting our opposition to their isolated brand of radical terrorism into a war of America against the Muslim world."]["Worse this order focuses exclusively upon majority Muslim countries, &amp; plays right into the hands of ISIS which has been trying for years…"]["It is inconsistent with who we are as a country."]["They only isolate America frm our allies, marginalize US Muslim population who are often the source for info that helps prevent terrorism."]["The latest actions taken by this Administration, however, don't protect us, but actually compromise our nation's security."]["…which is why I voted for the extensive border security provisions in comprehensive immigration reform bill passed by the Senate in 2013."]["I believe we must pursue solutions that will actually protect our homeland..."]["No ME harvester should be denied access to resources that have supported their livelihoods &amp; families 4 generations: https://t.co/hF7pkNlsJ9"][".@RepPoliquin and I are committed to ensuring that these longstanding local rights are respected by the federal government"]["That tradition has allowed ME harvesters to work the flats of the intertidal zone at Acadia for nearly 100 yrs."]["In Maine there is a time-honored tradition of open access to tidal land #mepolitics"]["Listen live on Inside Maine HERE: https://t.co/4FPZupAc2B"]["HEADS UP: I'll be on @WGANNews in the 10 am hour to discuss impact of #ACA on small businesses, rural hospitals and ME people #mepolitics"]["…Executive Branch officials involved in the formation of detention and interrogation policy review the full Committee Study."]["I joined my Intel Committee colleagues to urge @POTUS to read classified version of Committee’s 2014 torture report: https://t.co/QuMqxQXVU9"][".@UMaine &amp; @ORNL are world-class research institutions, &amp; this partnership will attract biobased industries and support rural ME communities"]["Impt first step in implementing the recommendations from the EDAT @SenatorCollins &amp; I requested last march to support ME forest industry"]["Today @UMaine and @ORNL launched an innovative partnership to grow Maine’s forest economy #mepolitics https://t.co/743FmDWwcu"]["Fun visit w/ Madawaska High Band who were in DC to play at Inauguration. Here they are crammed into my office for my civics 101 lecture #tbt https://t.co/hBaJ52xtdM"]["Bill Mook of @MookSeaFarm in Walpole is addressing ocean acidification head on with a “black box” #mepolitics: https://t.co/92iPJYl529"]["After a disabling injury, no veteran should return home &amp; have to pay back a federal student loan #mepolitics: https://t.co/0bJgLsQx8T"]["Glad @DeptVetAffairs &amp; @usedgov have taken important steps to help qualified disabled vets pay back federal student loans #mepolitics"]["Met w/ Educare Central Maine Parent Ambassadors to discuss importance of @NatlHeadStart. Great to see Mainers in DC for such a worthy cause! https://t.co/TyEK6vUdyL"]["That’s why I oppose the nomination of Betsy Devos to lead @usedgov. Read more from the @PressHerald #mepolitics: https://t.co/DqokiGqeFB"]["My dad used to say that public schools are the idea at the heart of democracy. #mepolitics"]["I’m a product of public schools. My parents went to public schools. My kids went to public schools."]["Wintah weathah today in Maine. Please drive safely! https://t.co/pFXByyOliF"]["PACE Act w/ @SenatorBurr will support children, working families, and the Maine economy #mepolitics: https://t.co/pc16TIOnjF"]["Maine’s forest products industry is an integral part of our state’s heritage &amp; essential to our economic future: https://t.co/r9cEyNDjz0"]["I believe Gen. Mattis and Gen. Kelly will serve the country well, and, importantly, speak truth to power: https://t.co/zEYBzMP288"]["…restore confidence in our government, and deliver positive results for the American people."]["As we undertake the important task of governing, I hope President Trump and Congress can work together to heal the divisions in America…"]["In the Senate, I will continue to fight for Maine’s interests – to expand access to broadband, combat the opioid crisis…"]["As President Trump begins his new Administration, I wish him the best, because if he succeeds, then our country succeeds."]["Today, we witnessed a hallmark of American democracy: the peaceful transition of power from one Administration to the next."]["Joined @mainepublic to discuss my take on Scott Pruitt to head the @EPA. No evidence enforce enviro laws #mepolitics https://t.co/OaWSMmVDGQ"]["The beginning of wisdom is to know what you don’t know and learn it. Thanks to @CNN @NewDay for having me on today: https://t.co/E1tzMuwAcV"]["Honored to be named Ranking Member of #SASC Airland Subcommittee. I look forward to working w/ @SenTomCotton to support our servicemembers"]["Wishing the best to @GeorgeHWBush &amp; Barbara. You inspire us all through your dedication to our country &amp; the world."]["…due to illegally subsidized and dumped Chinese imports, then I believe China essentially stole those jobs from Maine #mepolitics"]["If the Commission makes an affirmative final determination of material injury to Auburn Manufacturing…"]["When our trading partners violate rules, placing US businesses at an unfair competitive disadvantage, we must respond swiftly and decisively"]["Small businesses that play by the rules and work hard to keep good-paying jobs in US ought to be supported by our trade enforcement agencies"]["I testified at #USITC in support of Auburn Manufacturing, its employees, &amp; a robust trade enforcement system that works for all US companies https://t.co/w9Q32IV1Lz"]["Auburn Manufacturing employs hardworking Maine people &amp; should not be disadvantaged by unfair imports from China #mepolitics"]["I look forward to testifying on behalf of Auburn Manufacturing &amp; #MadeInUSA textiles and products at the #USITC this morning #mepolitics"]["Campobello is the only park in the world owned by two countries &amp; administered by a commission w/ reps from each country #mepolitics"]["It was an honor to be appointed to the Roosevelt Campobello International Park Commission by @POTUS today! #mepolitics https://t.co/pv5Livlr9J"]["I joined @ABC’s Powerhouse Politics Podcast and discussed the hardworking Mainers @LLBean employs. Listen HERE: https://t.co/EUAcEwyZ2P https://t.co/fIcNbJlVpJ"][".@OurKatahdin's purchase of Great Northern Paper Mill will allow innovators to build a bright future for the region: https://t.co/kfVO825sW5"]["WATCH LIVE: On my FB page at Bridgton Hospital to discuss impact of #ACA repeal on rural hospitals #mepolitics: https://t.co/WTSW1Dhbdy"]["Disappointed the Senate did not pass my amendment to protect Mainers working in higher risk, often rural jobs #mepolitics"]["Great to hear testimony from former Maine Senator &amp; DefSec Bill Cohen today in #SASC hearing on Gen. Mattis. TY for your service #mepolitics"]["Going to be a late one tonight! The Senate will be voting into the early hours of the morning on amendments to the annual budget resolution."]["I'll continue 2 do everything within my power 2 preserve impt ACA protections. Every person in Maine deserves quality affordable health care"]["It’s a blow to people who work in rural communities across Maine – our forestry workers, our fishermen, and our farmers, to name a few."]["I’m disappointed that the Senate failed to pass my amendment protecting health insurance for rural Maine workers."][".@SenatorCollins and I have written to PE Trump urging him to exempt @DeptVetAffairs from federal hiring freeze: https://t.co/UYHbfHjdUu"]["Congratulations to Jon Brockway of Westbrook for being named to the @TRUCKINGdotORG America’s Road Team! #mepolitics https://t.co/T4flx8b18b"]["Impt we pass Securing Energy Infrastructure Act to stop #cyberattacks like those in Ukraine. @EENewsUpdates: https://t.co/1QcMbYxWkw"]["Important to hear testimony firsthand https://t.co/lE6sqZULQA"]["That’s life on live television after a busy day on Capitol Hill! Look forward to catching you next time @wolfblitzer"]["HEADS UP: Joining @wolfblitzer in @CNNSitRoom soon to discuss Russian hacking &amp; protecting US national security"]["\"Without the #ACA and its protections, even our screening costs would eat away at our financial stability.”"]["\"That's 4 instances of cancer just between my parents. 1 of my grandparents died from cancer. Cancer is a very high risk for my sisters &amp; I\""]["\"My father was just treated for colo-rectal cancer. He can afford treatment because cancer is no longer considered a pre-existing condition\""]["Spencer from Ellsworth: \"My sisters &amp; I watched my mom die..Before the #ACA, most of her illnesses were considered pre-existing conditions.\""]["\"We were fortunate to obtain coverage for her through the Affordable Care Act.\" #ACA #mepolitics"]["\"Because of these heath issues she had to reduce her work hours. Consequently, her employer dropped her heath care coverage.\""]["\"With the #ACA &amp; the tax credit, I could afford a silver plan, I could get dental for my teeth, could go to the doctor again, get flu shots\""]["\"Before the #ACA we worked dangerous outdoor jobs that only provided minimum worker’s comp...\""]["Whitney from Smithfield, ME: \"I graduated from the University of Maine in 2013 with a degree in wildlife ecology.\""]["HAPPENING SOON: I’ll speak on Senate floor to share individual stories &amp; highlight how the #ACA has helped save lives in Maine #mepolitics"]["Watch my full remarks abt how my health insurance saved my life as a young Senate staffer 43 years ago #mepolitics: https://t.co/HMPS3cWBiP"][".@SenatorRisch &amp; I renewed our call to protect US energy infrastructure from potentially catastrophic cyber-attacks: https://t.co/eSkN2IlbJW"]["TUNE IN at 1 pm for open Intel hearing on Russian hacking in US election w/ heads of DNI, CIA, NSA &amp; FBI HERE: https://t.co/SCJkhtUikC"]["Look forward to continuing this conversation on Senate floor tomorrow &amp; sharing stories of how the #ACA has helped people in ME #mepolitics"]["Watch my remarks on the #ACA and health insurance coverage live HERE: https://t.co/fsYTrHZwn1"]["Speaking on the Senate floor abt how having health insurance saved my life when I was younger &amp; the importance of being covered #mepolitics"]["I joined @CNN @NewDay this morning to discuss our country’s cyber-security, border security &amp; the #ACA. Watch HERE: https://t.co/1bCrx88xe9"]["Watch my remarks from #SASC hearing on Russia &amp; US election w/ James Clapper, Marcel Lettre &amp; Adm Michael Rogers: https://t.co/NlUoXAfCfO"]["The people of ME deserve to know the facts, which is why the #SASC public hearing today on Russia’s role in the US election was so important"]["May we all renew our commitment to the brave men and women serving in our military and work to support them as they have supported us. https://t.co/uqB2uBUmJ9"]["It was an honor to receive the Navy’s Distinguished Public Service Award from Admiral Faller today in my office #mepolitics https://t.co/rartdoZpVx"]["Thanks for letting me join you to speak on this critical issue. https://t.co/oYzI40l51w"]["Proud to nominate an impressive group of ME students to our nation’s distinguished service academies #mepolitics: https://t.co/EsNF8U3zB2"]["Looks like a great time at @fenwaypark! And good luck to the @UMaine men’s hockey team &amp; @GoUBears women who will skate there next week! https://t.co/4xmdea4qmY"]["US must consider \"retro\" approach to protect electric grid from cyber attacks. In Jan. I will reintro bill to do so: https://t.co/6fN31zDtq1 https://t.co/RtpKHpxZwu"]["Happy holidays from my family to yours! https://t.co/guZJPtLfXs"]["Pleased to announce the @USNavy has awarded Cianbro $27M for construction &amp; dock repairs at PNSY #mepolitics: https://t.co/AEAG6lhLtd"]["That's why I urge new Congress to pass my bipartisan bill to bolster cyber defenses &amp; protect infrastructure https://t.co/6fN31zDtq1 (3/3)"]["Congress should learn from what happened in Ukraine &amp; take action to prevent it from happening here in the U.S. (2/3)"]["Today is the one year anniversary of a dangerous cyber attack in Ukraine that cut electricity to hundreds of thousands of people (1/3)"]["Northern Maine Veterans Cemetery Corp. in Caribou has done incredible work to honor Aroostook County veterans #supportourveterans #tbt https://t.co/f4zoz3AQF7"]["In Maine, preserving our environment &amp; building our economy go hand-in-hand. More from the @PressHerald #mepolitics: https://t.co/avMD1O9mAp"]["I love Gronk, but there’s no tougher teammate than @SenatorCollins. Wishing her a speedy recovery! https://t.co/fpq6ivnK6d"]["Serenity House in Portland is doing important work to help Maine people struggling with substance abuse and addiction #mepolitics https://t.co/WKJKR34YAj"]["Proud of my staff for all their wonderful work on behalf of Maine! If you’re in The County &amp; need help w/ a federal issue call (207)764-5124 https://t.co/mXpNxoVIsa"]["Harrigan Learning Center and Museum in Milo is a great way to bring visitors to Piscataquis County and educate local youth! https://t.co/0KEecS2zbV"]["We should learn from Milo PD &amp; work to inform our communities &amp; help those struggling with addiction get the help they need #mepolitics"]["Milo Police Dept is working to combat the heroin and opioid crisis by exploring innovative ways to tackle this epidemic #mepolitics"]["Congrats to BIW for $126M contract modification to ensure ME continues to manufacture the most-advanced destroyers in our Navy #mepolitics"]["Great to be with the wonderful staff at @govsrestaurant in Presque Isle this weekend. Thanks for the warm company! https://t.co/5D7BIK8P0P"]["Encouraged @SocialSecurity Admin has incorporated my proposals to support people in Maine living w/ disabilities: https://t.co/DBnUViQkvc"]["A big thanks to the faculty, staff and students at Mt. Blue and Mt. Abram for letting me join them to speak about my work in the Senate. https://t.co/lblwyiojrJ"]["The Be a Santa to a Senior program is a wonderful way to show your love for community! Learn more HERE: https://t.co/hXHFY84DKI"]["Agree w/ @PressHerald Editorial Board that expanding broadband in rural Maine is critical to growing our economy: https://t.co/UZhwR0ytdP"]["I will continue to work w/ ME law enforcement, federal partners, &amp; other border community members to keep Maine safe and secure #mepolitics"]["Pleased the President has signed Northern Border Security Review Act into law. This will help combat drug &amp; human trafficking #mepolitics"]["W/ Made-in-USA provision included in the NDAA, we have secured a concrete victory for American-made athletic shoe manufacturers #mepolitics https://t.co/aWVLWyfnzh"]["Joined w/ @SenatorCollins @RepPoliquin for an exciting visit to the New Balance factory in Skowhegan today #MaineMade #mepolitics https://t.co/ibWqe43i2V"]["Thank you to staff at the Sanford Vet Center for hosting today’s Holiday Luncheon (and #UglySweater competition)! https://t.co/9Bt92VLacr"]["BIW has been awarded nearly $11M in funding. Welcome news for the highly-skilled men &amp; women in Bath #mepolitics: https://t.co/fKkV0IQubB"]["Pleased $500M has been devoted to combat opioid crisis &amp; help save lives. It is imperative that HHS work quickly to implement this funding"]["Honored to join w/ @SenatorCollins to announce the Senate has designated Dec 17, 2016 as Wreaths Across America Day. #remember #honor #teach https://t.co/JWclWl5kdW"]["Thanks to @CNN @NewDay for inviting me to speak on this critical issue. https://t.co/QSY4ZmdnxU"]["Congrats to Norm Higgins for your recognition by PCEDC. Let's work together to expand broadband &amp; create opportunity for Piscataquis County. https://t.co/LH7azrAGtF"]["HAPPENING NOW: I’m joining @wolfblitzer in @CNNSitRoom to discuss POTUS order to review Russia’s involvement in U.S. elections #mepolitics"]["Great to visit with my longtime friend Bob Jorgensen and other veterans in Augusta #MaineVeterans #SupportOurVeterans #SupportOurTroops https://t.co/W88WYirMN2"]["Maine’s papermakers can compete with anyone on a level playing field @SenatorCollins @MainePublic #mepolitics https://t.co/vmZ07Pn06y"]["Welcome news for the hardworking men and women of Bath Iron Works who deliver the highest-quality ships to our Navy! https://t.co/9cPucgYmZR"][".@AP reports on my bill providing a pathway to public sector for tech innovators via Presidential Innovation Fellows https://t.co/8l1OtKNkbP"]["Today, our country lost a pioneer in space exploration and a true American hero. You will be missed. https://t.co/oxlu2GerwY"]["Made-in-USA shoe provision not possible without @SenatorCollins &amp; @RepPoliquin. Thanks to my colleagues in Maine Congressional delegation."]["I urge the President to sign the 2017 NDAA into law quickly and will track its implementation closely #mepolitics: https://t.co/YxcyPI5uNp"]["I’m thrilled this bill will reward American companies that prioritize keeping good-paying jobs here in the United States #mepolitics https://t.co/buQlD7ntnp"]["In my @newbalance shoes for final passage of NDAA! This hard-fought measure is a landmark victory for American shoe manufacturers. https://t.co/yjTKxWYSG0"]["On Dec 7, 1941 the Pearl Harbor attack shook our country. May we never forget those lives lost &amp; uphold the freedoms they fought to protect https://t.co/Oish4G7UFB"]["3/3 This is about saving peoples’ lives. #CuresNow #mepolitics"]["2/3 Congress had for too long failed to meet its obligation to provide this desperately-needed money. This is welcome step forward #CuresNow"]["1/3 I am encouraged #CuresAct includes significant funding that will help the fight drug epidemic in communities across Maine #mepolitics"]["Proud to support 21st Century Cures Act! This historic bill helps fight opioid crisis &amp; mental health &amp; bolsters medical research #CuresNow"]["Thanks to Sebastian Bell of Maine Aquaculture Assoc for an impt discussion on economic diversity for our coastal communities #mepolitics https://t.co/HxuPzgNS3F"]["Great morning at @BuildingMuseum Timber City exhibit on CLTs. Lets build a robust &amp; enduring economy for rural Maine communities #mepolitics https://t.co/hFGbDDFYWe"]["Congrats @StMarysMaine in Lewiston &amp; Stephens Memorial Hospital in Norway for 2016 @LeapfrogGroup awards! TY to our health professionals! https://t.co/uXoK1DiCAa"]["Thanks again to @GW_CVN73 for having me aboard this weekend. Proud of our servicemembers! #USNavy #F18 #TakeThatTomCruise #mepolitics https://t.co/mi9GSmnGMv"]["A great shot of an F/A-18 landing aboard the #USSGW. Be sure and watch this with sound #carrierlanding #tailhook https://t.co/xfwSeE1AC6"]["Impressed by the pride &amp; professionalism of the sailors aboard @GW_CVN73. We are so lucky to have these great people looking after us. https://t.co/JRMhE1Oovg"][".@USouthernMaine has an experienced leader in President Glenn Cummings! Congrats to Glenn, his family &amp; the USM community! #mepolitics https://t.co/DPY8Ch72se"]["Maine is blessed w/ bountiful fiber &amp; thx to @UMaine ASCC, ME can strengthen forest product sector &amp; support our rich traditions #mepolitics https://t.co/EK52D7YDeR"]["Great to join @MEFoodStrategy for #MFNG2016. We're sitting in one of the world's great brands: It's called Maine. https://t.co/r6LZ54O6oz"]["Excited to join the 2016 Maine Food Network Gathering @UMaine to discuss ME’s thriving local food movement #buylocal #eatlocal #mepolitics"]["More big news for Maine! Several NDAA provisions will support ME economy &amp; help keep us safe. More HERE: https://t.co/UwV9syoYYc #mepolitics"]["In ‘14, Maine surpassed the nat’l goal for linking ppl newly dx’d w/ HIV to care. Goal = 85%; ME = 96.4% #WAD2016  https://t.co/UbchCIuCsI"]["Let us stand in solidarity w/ all those across the globe living w/ HIV/AIDS &amp; may we recommit ourselves to an AIDS-free world #WorldAIDSDay"]["Thanks to @NextCentCit for inviting me to speak on the importance of rural broadband and closing the #digitaldivide #mepolitics https://t.co/gAmVCH0BKs"]["Proud to join my Maine colleagues in standing up for Sanford company in trade appeal: More HERE: https://t.co/10Pv26GY03 #mepolitics"]["Sat down with Amb. to Saudi Arabia Joseph Westphal about how we must work closely w/ our regional partners to create a more stable region. https://t.co/9NbxfYvJlP"]["Stay connected w/ family when deployed &amp; download @RedCross Hero Care App for emergency &amp; non-emergency Red Cross services #SupportOurTroops"]["Often times during the holidays our military personnel are in distant places – far from their loved ones &amp; the comfort of home #HolidayMail https://t.co/SAvxOSzFYO"]["It was an honor to join w/ @SenatorCollins to write to US servicemembers in Kuwait through the @RedCross #HolidayMail for Heroes Program! https://t.co/fOLI9HITfJ"]["Proud to launch the @USNavy Caucus with @CNORichardson! Our battle fleet is the most advanced in the world thx to men &amp; women at BIW &amp; PNSY https://t.co/s41wZRK4UE"]["Congratulations again! https://t.co/NcuZK9bOHK"]["Impt @nytimes editorial on use of hackers to strengthen cyberdefense @MartinHeinrich &amp; I called for prgm expansion: https://t.co/IYXOTc2OuQ"]["Thanks @chuckigo @Rewind_1009 @PrebleStreet for working to Stuff the Bus and support Maine families in need https://t.co/nW1VqywkCb"]["Great time w/ local folks, Amtrak officials &amp; state business leaders celebrating new Downeaster schedule today @RideRail https://t.co/ZIyvKAxJBJ"]["Maine veteran Bill Marinelli took his powerful story to the @WhiteHouse. More from @KJ_Online @OnlineSentinel: https://t.co/iG6iF7DEv6"]["My letter to leadership blasting potential CR as abdication of one of our most fundamental responsibilities: https://t.co/qhQWYUraNV"]["Today is #RuralHealthDay, a reminder of the invaluable services from rural health providers in Maine and across America"]["My letter to @POTUS urging him to support efforts to help employers and phase in overtime rule over several years: https://t.co/g73YSvOznR"]["My letter with @SenatorLankford urging President-elect Trump to quickly nominate an experienced DNI: https://t.co/vCoaUs903e"]["I’d like to see Maine families enjoy the health care services provided by IAH Demonstration prgrm.  @PenBayPilot: https://t.co/0AlRpOzx7U"]["Below is my statement on President-elect Trump's appointment of Stephen Bannon as Chief Strategist: https://t.co/Huse48FhCl"]["Today we honor the selfless service of our Veterans and recognize the eternal debt we owe them and their families https://t.co/iTKBJNx8mE"]["Hopeful that President-elect &amp; Congress can work together to write new chapter in American history. My full statement: https://t.co/LqrJZxrz4u"]["Important discussion with Bucksport officials about redevelopment of the former Verso mill https://t.co/7F6gf10App"]["Belfast’s Surge Hydro is 1 of 4 regional winners of the @CleantechOpenNE. Best of luck in Feb during national competition"]["In Belfast learning about Surge Hydro’s innovative approach to an important source of clean energy in Maine https://t.co/QbiyQLWRDN"]["Thanks Robbins Lumber family for meeting to discuss steps being taken to strengthen the forest industry https://t.co/KC6T3tllxv"]["Fantastic Q &amp; A with impressive students from Boothbay Region High School today about civility in American politics https://t.co/Z25qM19z12"]["The Darling Marine Center is doing critical work to understand effects of climate change in Gulf of Maine @UMaineNews https://t.co/WESJgy0dnp"]["Thanks to the Linkletters for yesterday’s great tour at Maine Woods Pellet Company in Athens! https://t.co/8LxzFJcGFd"]["Great visit to Cousineau Wood Products in N. Anson yesterday where they make impressive wooden gun stocks https://t.co/IevGcZCn2F"]["Maine Stitching Specialties also makes pet visibility vests for @LLBean. Max here makes a pretty good mascot https://t.co/JWqaWpifct"]["Fantastic team @ Maine Stitching Specialties in Skowhegan makes draperies, window treatments, flags &amp; other textiles https://t.co/RAhXy3Q4j1"]["With David Emery at @TLG_Leather yesterday in Hartland. Great visit! https://t.co/LWyb46N3n1"]["Thank you to Alice Tasman, Glenn Coxon &amp; everyone at @TLG_Leather for yesterday’s tour in Hartland https://t.co/GhGYUEAEr8"]["Congratulations to @wellsreserve Director Paul Dest for winning @NOAA conservation award! Well-deserved recognition for your important work"]["Honored to join @SenatorCollins, Bill Cohen, George Mitchell, and Olympia Snowe in Bangor last night @MaineChamber https://t.co/KB8YzcLADF"]["Congrats to Maine’s Robin Alden for being named a Champion of Change by @WhiteHouse for work on sustainable seafood: https://t.co/Y5Jn9GoYea"]["Had a wicked good talk with @growsmartmaine recently: https://t.co/SKFz5VQMEI"]["Great to join Maine-Arctic Forum events at @USouthernMaine today as we welcome Arctic Council to Maine https://t.co/GRIy93hK9D"]["#CARA funding in CR is welcome 1st step forward in effort to finally put our money where our mouths are when it comes to fighting addiction"]["Congrats to Maine company Unitel for being recognized as 1 of 12 @NTCAconnect Smart Rural Community Showcase award winners across the US"]["Good news for Maine forest products and @UMaineNews @USouthernMaine from @US_EDA: https://t.co/PLFQPH57gV"]["Thanks to Dr. Bob Corell and Bill DeLong from @DHSGov for today’s discussion on the impacts of #ClimateChange https://t.co/QXzzOXcI9h"]["Thanks to everyone who came to Capitol Coffee the last two weeks! https://t.co/Z2AVOwciQE"]["Joining me on @WGANNews tomorrow AM will be climate scientist Dr. Bob Corell and Bill DeLong from @DHSGov"]["I’ll be on @WGANNews tomorrow morning to discuss my recent trip to Greenland, #climatechange and how it will impact Maine"]["Thank you @BPC_Bipartisan for hosting today’s senior health and housing forum. An important issue for Maine. https://t.co/O0wUtbEx9b"]["Report from @PressHerald on my bill with @SenatorCollins to approve VA leases in ME and across US: https://t.co/zxCtruYQ1O"]["Important discussion in today’s Senate Broadband Caucus event about connecting rural communities to info and opportunity https://t.co/vEXljmgLjB"]["My full #POWMIARecognitionDay statement: https://t.co/0oksEM6is8"]["Today I joined with @ChelliePingree @RepPoliquin and others to speak out against proposed EU lobster ban https://t.co/DS4c2zyyPW"]["Great questions from Presque Isle High School students during today’s Capitol Class! https://t.co/BhDUKRoMkc"]["Pete Miesburger from the Maine VFW is a trusted adviser on issues facing Maine veterans https://t.co/XBWBsmWC6n"]["Honored to join w/ @AmericanLegion and others to push to improve the benefits appeals process for our veterans https://t.co/WvfF5c5IIg"]["Joining @AmericanLegion at 2pm to call for end to the backlog of veterans’ appeals for benefits. Watch live here: https://t.co/R36kLuBJM0"]["Thanks to the Maine Hospital Association for work to keep people healthy across the state https://t.co/znU3RQIfoH"]["I had fun playing tour guide in the Capitol with patriotic members of the Farmington Emblem Club last week! https://t.co/jOB0KBnzfF"]["My @thehill op-ed with @SenatorRisch about securing our critical infrastructure from cyber-attacks: https://t.co/2uCOr9U6pA"]["Thanks to members of @mainerestaurant for all you do to power the Maine economy https://t.co/fMR0dg6cCG"]["My #September11 statement: https://t.co/sHO3vtm4z3"]["A good day on the Harley for a great event celebrating work in Maine to tackle addiction #NationalRecoveryMonth https://t.co/hcoqLKvsw8"]["High five! The power of a positive learning environment on display in Biddeford https://t.co/MpsIXZs927"]["We can make childcare more affordable for working parents. That’s why I’ve introduced the PACE Act with @SenatorBurr https://t.co/FjRRgADooO"]["A fun and informative visit to the St. Louis Child Development Center in Biddeford today https://t.co/cCSrGEIYzA"]["More from @AP @sunjournal on my push for funds to fight the drug epidemic: https://t.co/nde1qS4K6o"]["Let’s deal with this terrible problem that is taking lives, tearing families apart, and deeply wounding the heart of America."]["In March, the Senate passed CARA  – the Comprehensive Addiction and Recovery Act. Unfortunately, at the same time, we didn’t fund it"]["These are real people. These are regular, ordinary Americans that are being affected by the drug epidemic."]["Since we passed CARA and failed to fund it, 15,000 people have died – 78 a day, 3 an hour -- because we haven’t acted on funding"]["I’ve sent a letter to @POTUS &amp; Senate Appropriations leaders calling for funds to fight drug epidemic: https://t.co/vPL8acc5Rf"]["I’ll be speaking on the Senate floor at 1:30 to call for funding to fight the drug epidemic. You can watch here: https://t.co/DEpxO4jHKt"][".@PLOvertonPPH reports on Maine delegation pushback against proposed EU lobster ban: https://t.co/rw92hXUv27 @PressHerald"]["Report from @MattByrnePPH @PressHerald on funding for community coalitions in Maine working to prevent addiction: https://t.co/IQFt4dPWlg"]["Great tunes and even better people at the Windsor Fair today! https://t.co/XFvH9s21NC"]["Honored to join the veterans appreciation ceremony at the Windsor Fair today https://t.co/6cO4AN32cV"]["Great to celebrate the opening of St. Croix Tissue in Baileyville today with @SenatorCollins and @RepPoliquin https://t.co/MY4G1zP5fN"]["Celebrating the @AcadiaNPS Centennial today with @SenatorCollins @ChelliePingree @RepPoliquin https://t.co/1enRG1WlEc"]["Thanks to IFPTE Local 4 for the great Lobsterfest at Portsmouth Naval Shipyard this past Sunday! https://t.co/LmRIBvBCPa"]["Wrapping up a three day fact-finding mission in Greenland with @USCG https://t.co/vKo6VYXXXY"]["On Monday, we surveyed the Jacobshavn Glacier, Greenland’s largest and fastest moving glacier https://t.co/EDzeNwDoX9"][".@BBRegister reports on my aquaculture tour last week on the Damariscotta River: https://t.co/gU4XzocDyw"]["Great day on the Damariscotta River last week touring local aquaculture businesses! https://t.co/yMBRgsD5xV"]["#TBT two weeks ago in Aroostook County when I stopped by the Maine School of Science and Mathematics in Limestone https://t.co/p4D4TN0hc8"]["Exciting things @jacksonlab new Ellsworth Vivarium! 230 jobs and a new facility to advance research #mepolitics https://t.co/manNHsUrTW"]["Great to join @SenatorCollins @RepPoliquin at ribbon-cutting for the Union River Center for Innovation! #mepolitics https://t.co/UABvE7K9Z4"]["Thanks to @MDIBL staff for showing me around this afternoon! https://t.co/0l1zCaet5z"]["Great tour of the @AbbeMuseum today on MDI! https://t.co/QmsXaRxOUG"]["A few photos from today’s groundbreaking for Bar Harbor’s new community solar farm https://t.co/Iv9zCN8KBT"]["Yesterday, I joined citizen-led group A Climate to Thrive at MDI High School to discuss threat of climate change https://t.co/maUlY3PWR1"]["Great news for our forest products industry! Several federal grants &amp; more work to come frm @Commercegov EDAT team https://t.co/cR6CKCphFr"]["Looking fwd to today’s EDAT press conference with @SenatorCollins @RepPoliquin @UMaineNews and Maine’s forest industry leaders"]["Louisiana Pacific is a global leader in engineered wood products. Nice to tour their New Limerick facility today https://t.co/hnqxpUXWME"]["Thanks to the 185th Engineer Support Company of the Maine National Guard for all that they do! https://t.co/mD4iOfaoiU"]["The Maine Malt House at Buck Farms in Mapleton is part of exciting craft brew growth focusing on local ingredients https://t.co/GNhvZGBMmI"]["Thanks to the Caribou Rotary Club for letting me crash their lunch today! https://t.co/AnhkPylBeh"]["Chase Organic Dairy Farm started in 1935. Current owners Vaughn and Laura Chase carry on proud family tradition https://t.co/9K2Ccpv1YR"]["Aroostook Hops Farm has “hopped” on the Maine craft brew scene, providing locally grown ingredients to our brewers https://t.co/EHeZfWJmk8"]["Smith’s Farm in Westfield is a sixth-generation family operation #BountyInTheCounty https://t.co/utQwiTtYbD"]["With Darrell McCrum at County Super Spud in Mars Hill #BountyInTheCounty https://t.co/MX0V4sgSZZ"]["Nurse practitioners joined me in Bangor today for 5th roundtable discussion on opioid epidemic #mepolitics https://t.co/HlRumVLrcX"]["Still much to learn, but safety &amp; security of German ppl is on my mind tonight."]["Maine’s veterans deserve best care. Imprtnt for @DeptVetAffairs Sec. McDonald to visit &amp; hear directly frm our vets https://t.co/yi7gcnP3oD"]["Celebrating one of Maine’s finest, George Mitchell, in Bangor today https://t.co/eqdAKVDKfz"]["At Stewart Adult Day Center in Falmouth today. Important discussion abt supporting our seniors &amp; caregivers. @WGME: https://t.co/9mWYive2d3"]["The amazing story of Medal of Honor recipient Lt. Colonel Charles Kettles: https://t.co/eS88JuE87E @USArmy #MedalOfHonor"]["Troubled by the news out of Baton Rouge &amp; hoping we can unite to put an end to this senseless violence."]["ICYMI: The Senate unanimously passed a resolution this week designating Sept 25, 2016 as National Lobster Day: https://t.co/q79kwBN5g9"]["The Potato Blossom Festival is in full bloom up in Aroostook County! A fantastic celebration of iconic Maine crop https://t.co/vKVrSYMezO"]["Saddened by the horrific attack in Nice. My thoughts are with the people of France tonight. The United States stands with you."]["I’ve joined forces with @SenatorBurr on the PACE Act to promote affordable childcare for American families"][".@KellyAyotte and I have introduced legislation to help seniors safely age at home #mepolitics"]["A powerful speech today by my friend @SenatorTimScott on the Senate floor. Thank you. https://t.co/BeXrjZEEcs"]["91 year old Maine veteran William Schnorr of Dixfield finally received long-overdue Victory Medal he earned in WWII https://t.co/bIQ7KBt5rh"]["I’ve introduced two more bills today to help improve anti-poverty programs: https://t.co/Jne8FTkwd7 #mepolitics"]["Thank you @SenatorRisch for holding a hearing today on our grid security bill https://t.co/j5O9vso5nd"]["Proud to join @MartinHeinrich and others on bill to promote advancements in energy storage: https://t.co/x0p8lGfCiG"]["The Senate Broadband Caucus recognizes that high-speed internet is no longer a luxury in today’s digital world https://t.co/W8tKVIxzXH"]["Tune in here for launch of the Senate Broadband Caucus: https://t.co/QRWPD3iG9H #mepolitics https://t.co/FvyHQ4AIcY"]["I joined @NECouncil today to discuss important issues facing New England, including the opioid epidemic https://t.co/huznecJuTE"]["Congress needs to step up to SMASH Zika. You can read my @thehill op-ed w @SenatorBurr @SenBillNelson here: https://t.co/9iO7EKJyus"]["Heartsick over tragedies in TX, MN and LA. My thoughts and prayers are with the families. We must meet hatred and violence with love."]["ICYMI: the @bangordailynews wrote an editorial in support of my anti-poverty proposal: https://t.co/HoHX6QoJFW #mepolitics"]["Today, I sent a letter to @SocialSecurity urging them to improve SSDI to help people enter workforce #mepolitics https://t.co/vRhMUIHrsp"]["Maine will receive nearly $200,000 to fight Zika. An investment in safety of Maine families @SenatorCollins https://t.co/9DzuHEZgYt"]["Nearly $8 million grant for Port of Portland is welcome news for Maine. More from @bangordailynews @darrenfishell: https://t.co/Wkm0zuKuYN"]["Happy 100th birthday to Maine veteran Thomas Ewing! Congrats on your milestone &amp; thank you for your service! https://t.co/DyolyJ0KZY"]["Today, in the company of our family &amp; friends, may we reflect on the values of our great country &amp; thank those who fought to preserve them."]["Happy 4th of July from the Bath Heritage Days Parade! https://t.co/VvQj4JsMpk"]["I’ve joined w/ @SenatorCollins &amp; others to intro resolution designating Sept 25 as National Lobster Day #mepolitics https://t.co/EQ1JAP00aR"]["ICYMI: I joined @ChrisCuomo this morning on @NewDay to discuss #Instanbulattack. Watch here: https://t.co/iKkvfkPpF8"]["Always a pleasure to join @ChrisCuomo on @CNN @NewDay. Thanks for the discussion on #Instanbulattack and keeping America safe"]["Thanks @brikeilarcnn for the engaging @CNNSitRoom interview. Appreciate the important discussion about #Istanbulattack"]["A pleasure to meet Alisa Pelkey of Eddington, who was named Maine’s 2016-2017 Champion Child by @CMNHospitals https://t.co/QFBy0zbSMn"]["Great #TechHire news for Maine! $4 million grant for IT job training: https://t.co/P4qCnSgYtq @SenatorCollins @bangordailynews #mepolitics"][".@MaineBiz reports on news that @NOAA will help reimburse Maine fishermen for at-sea monitoring costs https://t.co/qGgTdFVFZR"]["Led bipartisan letter to @ErnestMoniz supporting use of sustainably-harvested wood products in gov construction https://t.co/QnAVS8u2tW"]["Thanks to @MaineChamber @TXInstruments for hosting today’s important discussion. https://t.co/YnP71NQ7Ow"]["Great to meet with Maine members of the Associated Builders and Contractors this week! https://t.co/XQFMv2faAo"]["After meeting with members of the Marshall family from York, I’m proud to join the Cystic Fibrosis Caucus https://t.co/as3hQSTZt4"]["A few photos from this week’s Capitol Coffee https://t.co/b8H1YvP5Wh"]["Thanks to Leigh Hallett from @FarmersMkts4ME and Jessie Dowling from Fuzzy Udder Creamery for joining my podcast this month!"]["Maine agriculture is a real bright spot in our economy. More from this month’s Inside Maine Podcast: https://t.co/QXzzOXcI9h"]["Keeping guns from terrorists is just common sense. We need to address this pressing issue https://t.co/Yl3Jygw5IB #mepolitics"]["More on my efforts to fix anti-poverty programs #mepolitics https://t.co/2PwOxgwE1X"][".@SpeakerRyan’s focus on poverty is important. That’s why I’m proposing 3 fixes to our anti-poverty programs."]["I’m speaking on Senate floor momentarily about my effort with @SenatorCollins to help keep guns from terrorists: https://t.co/vRCnDNN2vg"]["Recent Greely HS grad Matt Pisini came by today with his Presidential Scholar medallion (and a very proud family!) https://t.co/auhp93Ajph"]["Great talking with Troy Howard Middle School students about their STEM education project today! https://t.co/chGxgxcDw8"]