["\"As President Reagan would say, ‘It’s a new day in America.’ Whether it’s fighting to give our troops the largest pay raise in 8 yrs, or working to make it easier for service members to transition back to civilian life, the @VP &amp; @POTUS are your champions\" https://t.co/MCczhwkVYW https://t.co/YCwzvKa7tI"]["It was an honor to introduce @VP at @NellisAFB. @POTUS and @VP are true champions for our service members. https://t.co/aYw4alZdIb"]["Humbled to attend the grand opening of @AFWERX Vegas with @VP and @SecAFOfficial. Through AFwerX, the @USAirForce will continue to pursue innovative projects that bring together leaders across all different sectors of our workforce to support the best military in the world. https://t.co/WPtAPH4CQP"]["Honored to join @VP and @SecAFOfficial at @NellisAFB and AFwerX Vegas this afternoon. Watch the event live here: https://t.co/S6qyf0LpM7"]["On #HumanTraffickingAwarenessDay let us not forget that this heinous crime is all too often hidden in plain sight. That’s why we must work together at the local, state, and federal level to combat human trafficking in #Nevada and across the country. @DHSBlueCampaign"]["Wow, this will have a big impact in #Nevada. Roughly 14,200 #Nevadans are employed by @Walmart. #TaxCutsandJobsAct #RealResults https://t.co/1PFNsgAFsh"]["Proud that @POTUS signed into law our bipartisan bill that will help #Nevada law enforcement in their efforts to cut down on the backlog of untested rape kits and ensure that critical evidence isn’t left collecting dust. https://t.co/MAKBEEg8it"]["Met with #Nevada’s Jason Steffen today to discuss the importance of scientific research and its impact on the higher education system. https://t.co/4dQpI3nZE0"]["The No Human Trafficking on Our Roads Act, a bipartisan bill I cosponsored in the Senate, was signed into law by President Trump this week. Read about how this legislation gets us closer to ending human trafficking in #Nevada and across the country here: https://t.co/5ZBsGZQfms"]["It has been a great start to 2018 and I look forward to seeing the positive impact that announcements like these will have on #Nevada’s workers and middle-class families. (10/10)"][".@CharterNewsroom, which already employs more than 400 #Nevadans, announced it would bring 20,000 jobs back to the United States. (9/10)"]["Additionally, @WellsFargo, which has over 100 banks in #Nevada, said it will raise its company-wide minimum wage and give 75% of its employees a raise. (8/10)"][".@SouthwestAir, which claims #LasVegas as its 2nd top airport for departures, committed to giving full- and part-time employees a $1,000 bonus. (7/10)"][".@BankofAmerica, which has 62 financial centers in #Nevada, announced it would give 145,000 employees a $1,000 bonus because of tax reform. (6/10)"]["Several major U.S. companies that employ #Nevadans continue to announce special bonuses because of the tax bill. (4/10)"]["This news comes after the once-stalled casino development in #LasVegas, Fontainebleau, announced it will revive construction on the project thanks to tax reform. The developers committed to creating over 10,000 jobs in #SouthernNevada. (3/10)"]["In #Nevada, @southpointlv recently announced it will be DOUBLING its 2,300 full-time workers’ bonuses as a result of the tax relief bill. More on that here: https://t.co/U3dR0CQbJE (2/10)"]["The #TheTaxCutsandJobsAct is already producing real results for #Nevadans and hardworking taxpayers across the country. In fact, it’s estimated one million Americans are getting raises or bonuses since our bill became law. Let’s take a look at some specific examples. (1/10)"]["We are grateful &amp; forever indebted to our nation's heroes &amp; that's we must never forget their service in defending this country. I applaud @POTUS for taking action today to help ensure that #veterans can access the care they need for their invisible wounds https://t.co/3ulpfzb2yt"]["Congress needs to take action on the Resident Physician Shortage Reduction Act to help close the doctor shortage gap in #Nevada and across the country. Proud to partner w/@SenBillNelson on this bipartisan bill. https://t.co/RXWjhloQlg"]["As we celebrate #LawEnforcementAppreciationDay I want to express my sincerest gratitude to #Nevada's law enforcement officers. Your selfless work to protect our communities, keep our loved ones safe, &amp; respond to danger does not go unnoticed. Thank you #BackTheBlue"]["I welcome @POTUS's push to cut Washington red tape that serves as a significant barrier to #broadband buildout and rural connectivity in #Nevada. Read more here: https://t.co/BQXw9SFSZ8"]["Great news - @unlv climbed 4 spots in @usnews's annual ranking of best online graduate nursing programs. Ranked #16 out of 115 programs. Congratulations to @unlv students &amp; instructors! https://t.co/hSEZcGa6Lu"]["As the author of a bill to reduce regulatory barriers for #broadband in #Nevada, I thank @POTUS for his actions to help encourage investment in reliable, high-speed internet services in rural America. I look forward to working w/my colleagues &amp; the Admin on this initiative."]["Congratulations to the 2017 recipients of the Airmen of the Year Award from the Nevada Air National Guard! Glenna from my staff was in attendance to celebrate their outstanding service and hard work to our community, state, and nation. https://t.co/v4VkAr5WnY"]["Proud to partner w/my Senate Veterans’ Affairs Committee colleague @SenatorTester in introducing bipartisan legislation to ensure #veterans can be respectfully laid to rest alongside their spouses &amp; children. Read more here: https://t.co/30Hx3a3jsl https://t.co/BIYLZTLQhB"]["This is what the #TaxCutsAndJobsAct is all about – making sure hardworking individuals and families in #Nevada get the much-needed break that they deserve. Read more here: https://t.co/U3dR0CQbJE https://t.co/xYSKDESwI4"]["Congrats to the @NVNationalGuard's State Family Programs office for becoming nationally accredited! The @NevadaAppeal reports the accreditation means the programs office meets the same standards as those existing at active duty DOD installations https://t.co/OtqsE4Y7l1"]["I applaud @POTUS for signing into law the Combating Human Trafficking in Commercial Vehicles Act, a bill I cosponsored to help bolster federal efforts in the ongoing fight to end #humantrafficking. https://t.co/KN7zyO6DTx"]["In case you missed it, in 2017 President Trump signed into law 15 of my bills to help #Nevadans and Americans all across the country via @ElkoDaily: https://t.co/yEXahw1sA0"]["As a strong supporter of fighting #humantrafficking, I’m pleased @POTUS has designated January as National Slavery and Human Trafficking Prevention Month. We should be doing everything in our power to prevent and stop this vile crime."]["I'm proud to call @senorrinhatch a friend &amp; mentor, and it's a privilege to serve under his leadership of the @GOPSenFinance Committee. His energy, wisdom, and work ethic will truly be missed once he retires. Lynne and I wish him and his family the very best."]["Thank you @LVMPD, @NVNationalGuard, and @FBILasVegas for keeping #LasVegas safe on New Year's Eve. We are grateful to have such hard-working law enforcement officers in #Nevada. #VegasStrong https://t.co/cc5HSDoviN"]["Congrats to #NV's Gary Griffith, Vietnam veteran &amp; now-retired helicopter pilot who was awarded the Wright Brothers Master Pilot Award. Griffith spent over 50 yrs in the air w/ the last 15 yrs transporting patients across #NV to hospitals in Las Vegas. https://t.co/B4SBuzzUru"]["In case you missed it - my piece in the @reviewjournal reflects on a year of significant progress and why Nevadans are better off because of it. https://t.co/JoxBGS2Mgh"]["My staff was honored to attend yesterday’s ceremony at the Clark County Armory where Pvt. William Grant was awarded the Bronze Star for meritorious service during World War II. Grant served in Europe &amp; was in numerous combat operations including the beach landings in Normandy. https://t.co/7f0mLBbTMW"]["This is exactly what the American people sent us to do – to deliver results – and that’s why I look forward to working with my colleagues in the New Year to maintain this pace and fill the numerous judicial vacancies. (2/2) Read more: https://t.co/Y56bQt7pyX"]["Under the leadership of @potus and the @senjudiciary, this year the Senate confirmed a remarkable number of well-qualified conservative judges to the federal bench. As a strong believer in the U.S. Constitution, I know that it matters who serves on these courts. (1/2)"]["#VegasBorn https://t.co/vzAzDIM8al"]["From legislation that holds the #VA accountable to a bill that encourages women entrepreneurship, I’m proud that the President signed more than a dozen bills that I helped introduce &amp; pass. Read more about these 15 measures to help #Nevadans here: https://t.co/fKZqSVKnuZ"]["I’ve always said that we need less of Washington in NV, and that’s why I've fought to cut bureaucratic red tape that inhibits our job creators &amp; the success of our communities. Read more here: https://t.co/zQVQIB6aFI https://t.co/2mKuxuWon0"]["Wishing you and your family and loved ones a very Merry Christmas!"]["For years, I've said we need to cut regulatory #redtape that inhibits mineral exploration &amp; mine development projects in #NV, &amp; @SecretaryZinke's action yesterday puts us on a path to do that. @garymartindc w/@reviewjournal reports on event at @Interior. https://t.co/Yuzv8XzeSA"]["Headed to @POTUS desk: A bipartisan bill I helped introduce w/@JohnCornyn to give NV law enforcement more tools to reduce the backlog of untested rape kits, ensure critical evidence isn’t left uncovered &amp; deliver swift justice to victims of sexual assault. https://t.co/xHiiYFdMxl"]["I applaud @POTUS for acting swiftly to sign our #taxrelief bill b/c Nevadans can’t wait any longer for #taxcuts. We've already seen its positive impact w/companies announcing bonuses &amp; wage increases. Today is a good day for Nevadans &amp; Americans everywhere https://t.co/UIkgvAogZk"]["From bringing @stevenmnuchin1 to #NV to hear directly from my constituents to working w/@IvankaTrump to increase the #childtaxcredit, I made sure that Nevadans voices were heard by the Administration &amp; my colleagues as we worked to put together &amp; pass this #taxrelief bill."]["This is particularly important at a time when nearly 8 in 10 Americans who work full-time live paycheck to paycheck. Nevadans have been waiting for a break, and this is it. For example, this #taxrelief bill includes my and @SenatorTimScott provision to double the #childtaxcredit."]["I encourage all #Nevadans to compare your paychecks today to the ones you'll receive in February; they're going to be bigger because our bill allows you to keep more of your hard-earned money."]["I applaud @SecretaryZinke for initiating a review of the outdated, job-crushing policies that inhibit our ability to utilize our own mineral resources. Read more about the secretarial order here: https://t.co/aEUpMSNE6a https://t.co/5IvF5EbZYU"]["Proud to be a supporter and co-sponsor of @JohnBoozman's bill, S.2105, legislation that would allow Vietnam War-era #veterans who served in Thailand and were exposed to toxic chemicals finally claim their rightful benefits from @DeptVetAffairs"]["Caught up w/@SecretaryZinke &amp; my colleague @LisaMurkowski at the @Interior ahead of the official signing of the secretarial order to break our nation’s dependence on foreign minerals - an important issue for #Nevadans. In #NV mining contributes to more than 13,500 jobs alone. https://t.co/tDRNDzBvWh"]["Thanks @thedanmasonshow for talking w/me about the #TaxCutsandJobsAct, giving Nevadans a much-needed break &amp; the event at the White House. #TaxRelief &amp; #taxcuts will help spur economic growth &amp; make our businesses competitive again. Looking forward to @POTUS signing this bill."]["It was an honor to join @POTUS, @VP &amp; my colleagues today at the White House to highlight this once-in-a-generation #taxrelief bill that will give hardworking families in #Nevada the #taxcuts that they’ve been waiting for. Read more: https://t.co/q6J7LG0192"]["The U.S. House just voted to send the #TaxCutsandJobsAct to @POTUS’s desk. I look forward to joining the President and my colleagues at the White House this afternoon. Read more about the legislation and how it helps #Nevada here: https://t.co/GsKzRzEXzU"]["In Case You Missed It: I joined my colleagues on @GOPSenFinance following Senate passage of the historic #TaxCutsandJobsAct, a once-in-a-generation bill that will deliver #taxrelief for hardworking Nevadans. Watch here: https://t.co/U09sgnSGgp"]["This bill is about empowering middle-class families and restoring their faith in the American dream, and I look forward to seeing this legislation sent to the President’s desk later this week. https://t.co/bYhNoFxtYo"]["As a member of the tax-writing @GOPSenFinance Committee, I thank Chairman @senorrinhatch for his leadership and I’m incredibly proud of our work to move tax reform legislation for the first time in more than 30 years."]["From doubling the child tax credit to lowering rates on middle-class families, our legislation finally gives Nevadans the break that they deserve by allowing them to keep more of their paychecks. https://t.co/bYhNoFxtYo"]["Whether it’s the single mother in Gardnerville who works full-time or the ambitious entrepreneur in Reno who started a business while going to school, Nevadans throughout the state will benefit from the passage of this historic legislation. https://t.co/bYhNoFxtYo"]["I know how important it is for #Nevadans to be able to keep more of their paychecks. That’s why I have been fighting - and will continue to fight - to get this bill to the President’s desk."]["If you're against this bill, you're against #taxcuts for the middle class because that's what this bill is all about. And if you know that nearly 1/3 of Americans don’t have $500 to cover an emergency expense, then you know how important a few hundred extra dollars are to them."]["If you're against this bill, you're against giving #smallbiz the chance to actually get off the ground and hire workers. You’re against giving them a better opportunity to expand, invest, increase wages, and do what they do best: create jobs."]["If you're against this bill, you're satisfied with the anemic 2% growth ushered in by the Obama Administration &amp; accept it as the new normal. But I'll never accept it because I know we can do better. We already have seen our economy improve since @POTUS took office."]["We are now at a crossroads. We have a chance to change course. We have the opportunity to pass meaningful #taxcuts that will lift middle-class families, our communities, and our economy. Watch my speech on the #TaxCutsandJobsAct here: https://t.co/KR4mznpADW"]["Under the failed economic policies of the Obama Administration, #Nevadans suffered through 8 years of historically low economic growth. Think about this: in those 8 years, the average economic growth was less than 2 percent. As a result, wages and workers suffered."]["Given rising housing and childcare expenses alone, middle-class families in #Nevada and around this country are having a hard time covering day-to-day expenses and planning for their futures. So it’s fair to say that -- in Nevada at least -- the recession has never really ended."]["In #NV, real median household income is $7,000 lower today than it was in 2007. At the same time, childcare expenses have skyrocketed. In this country, the average cost for an infant in center-based care can be as high as $17,082 per year. That’s more than a semester at UNLV!"]["The majority of Americans are not only struggling to get ahead, they’re struggling to just get by. Nearly 8 in 10 Americans who work full-time live paycheck to paycheck. If you live in #NV, you’re more likely to be living paycheck to paycheck than Americans living elsewhere."]["TUNE IN: About to speak on the U.S. Senate floor about how critical middle-class #taxrelief is for the people of #NV. Watch live here: https://t.co/HWFMDdgxNa"]["This is great news – when #Nevada’s students succeed, we all succeed. ✏️https://t.co/fUNdqFULGq"]["Good news for #LasVegas: starting in June, @LASairport will offer non-stop flights to Brazil. https://t.co/GeNUDHGWEq"]["I’m traveling to Washington, D.C. to vote tonight, but Eduardo from my office was able to attend @RenoAirport’s event celebrating their new passenger lounge. Look forward to checking it out. https://t.co/TcH1h1vQB3"]["Very proud of the work @LASairport is doing to combat #humantrafficking. This is a vile crime that all airports must help fight against. Read more about @LASairport’s efforts here via @wsj https://t.co/UlH11JxOAf"]["Thank you to the Reno VA, Reno Vet Center, Renown Health, CereCare, the Nevada Military Support Alliance, &amp; Northern #NV community members for joining me for a productive discussion about ways to reduce suicide among veterans and improve mental health care for them. https://t.co/4ufQG44jkg"]["I'm going to continue fighting on behalf of #NV's middle-class families and pushing my colleagues to work 24/7 until we send this #taxrelief bill to the President's desk for his signature."]["According to the independent Tax Foundation, a middle-class family of 4 living in #NV is likely to see their tax liability reduced by approximately $2,180, or about 22%, under this bill. This bill is also expected to create more than 8,000 jobs in #NV. https://t.co/1fgnUWDFAP"]["Proud that the conference report includes @SenatorTimScott and my provision to increase the child tax credit from $1,000 to $2,000, or double it from current law. This is a win for #NV families and Americans throughout the country."]["The conference committee’s report on the Tax Cuts and Jobs Act is a win for #NV's middle-class families. It will help create jobs, increase wages, drive growth in our communities, &amp; provide hard-working Americans with the relief they desperately need. https://t.co/1fgnUWDFAP"]["Proud that the U.S. Senate voted to confirm yet another conservative judge. I’m hopeful that we’ll continue to fill the numerous judicial vacancies &amp; bring #taxrelief to hardworking Americans. We need to work around the clock until we get the job done. https://t.co/NHHMAn8Zt7 https://t.co/QZGC49um40"]["Honored to be presented with the Freedom to Fly Award by @AOPA. #Nevada’s - and our nation’s - general aviation community is critical to tourism and our local economies, and I’ll continue to support our general aviation airports and pilots. https://t.co/jDEWngxvTd"]["In case you missed it my #CHIP Stability Act was signed into law on Friday: https://t.co/9eGa25cMv6"]["Devyn, a member of my staff, presented the emergency manager for the @cityofhenderson with a senatorial certificate at the grand opening of the new Emergency Operations Center for the City of Henderson. https://t.co/pPqNPbPTjq"]["Wishing families in #Nevada and across the country a very Happy #Hanukkah. https://t.co/64bLq5qFgb"]["Congratulations to all of the newly commissioned @USArmy Second Lieutenants from the @unevadareno ROTC Program! Here are two new 2LTs with their military professor. https://t.co/iUxgv4v2Hh"]["Had a productive roundtable discussion with leaders in the Asian community today. https://t.co/y2YZbBPOJy"]["Great news – @POTUS signed into law today the CHIP Stability Act, legislation I introduced that ensures there is no gap in funding for the Children’s Health Insurance Program (#CHIP). Read more here: https://t.co/OvCSFG6d9o https://t.co/pD1cllWadt"]["Praying for all those impacted by the devastating California wildfires, and for the many #Nevada firefighters helping battle the blazes. https://t.co/VEknDn95vU"]["A date which will live in infamy.\n\nToday, on the 76th anniversary of the #PearlHarbor attack, we remember the 2,403 American service members and civilians killed in a tragedy that spurred a generation of heroes to answer our nation’s call to serve in World War II. https://t.co/RNnfcF7pah"]["Great meeting with @UNLV today to talk about campus safety and reauthorizing the Higher Education Act. https://t.co/VRv2mAxYNj"]["My staff was honored to attend the new Churchill County Law Enforcement Center dedication ceremony today in Fallon. Pictured here are Churchill County Sheriff Ben Trotter and County Commissioner Pete Olsen. https://t.co/Y97aUmAsHZ"]["Received an update from @TMCCNevada’s @jkdalpe on how the college is working to train the emerging workforce in #NorthernNevada, including a partnership with @PanasonicUSA to hire Nevadans. https://t.co/PgWcxaTHaK"]["I applaud @POTUS for his decision to recognize Jerusalem as the capital of Israel and commitment to relocate the U.S. Embassy to Jerusalem, action that I have pushed for by authoring the Jerusalem Embassy and Recognition Act. More here: https://t.co/9pnTEYdYK8"][".@SecretaryZinke’s recommended action on Gold Butte is welcome news for #Nevada as it allows the Valley Water District to access their water rights that were lost under the previous administration. Read more here: https://t.co/DF9gR4cxET"]["This bill is supported by more than 165 groups, including many sportsmen, recreation, conservation, &amp; historic preservation groups, such as @ConservationFnd, @tpl_org, @RMEF, @TheTRCP, New Mexico Wildlife Federation &amp; Nevada Land Trust. Read more here: https://t.co/UeeIk1LiN1 https://t.co/AnbljP4eLn"]["Today I intro'd a bill w/@MartinHeinrich to reauthorize the Federal Land Transaction Facilitation Act. This bipartisan program provides a fiscally responsible way to protect &amp; manage important public lands in #Nevada &amp; throughout the West. More here: https://t.co/wcVI0Ow8H9"]["So grateful for the @NVNationalGuard &amp; all they do to protect and serve Americans in #Nevada and across the country. This year, they’ve activated more personnel for stateside response missions than any other year in history. https://t.co/g5I7McP1eK"]["In case you missed it, the recently-passed Senate #taxrelief bill includes my amendment to double the child tax credit to $2,000. Read about why this is so needed, especially for families in #Nevada, here: https://t.co/PfqnH7xFjx"]["BREAKING: The U.S. Senate just passed legislation that will deliver #taxrelief for hardworking Nevadans, boost middle class income by nearly $2,000, and add more than 8,300 jobs in #NV. Proud to vote to give Nevadans the break they deserve. https://t.co/aG8YuVwO7u"]["@EPA decision to eliminate an overreaching Obama-era rule is a win for Nevada’s mining industry, which helps employ nearly 25,000 workers in our state alone. Proud to have led the congressional effort against this harmful rule. https://t.co/JmYPHw4udf"]["Moments ago I introduced the #CHIP Stability Act, legislation that will provide much-needed reassurances and federal funding to #Nevada and other states for the Children’s Health Insurance Program. Read more about my bill here: https://t.co/mawIZYo4xH https://t.co/8YwqdTkmqB"]["https://t.co/UyzkswbDqj"]["The Senate’s #taxrelief bill has cleared a critical hurdle and we are now one step closer to providing tax cuts to middle class families in #Nevada and around the country. Read my statement here: https://t.co/wsUy310v80"]["Nevada’s 300,000 #veterans deserve the world-class medical care &amp; support that they have rightfully earned, and that’s why I’m pleased @VAChair today passed the Caring for Our Veterans Act, which includes 3 provisions I introduced. Read more: https://t.co/VVbyj4JJHt"]["The Senate is at a pivotal point. Now is the time to deliver #taxrelief to hardworking American families &amp; small businesses. Watch my remarks here: https://t.co/PbFvW3mTIB https://t.co/LBoMR9O8Qi"]["LIVESTREAM: About to kick off a tax event with @sendavidperdue @SenThomTillis @AFPhq &amp; #taxrelief advocates. Watch here: https://t.co/anYCS02yLU"]["Look forward to joining @sendavidperdue @SenThomTillis @Marcshort45 @AFPhq  &amp; #taxrelief advocates at a tax event at 7:15 a.m. PT/10:15 a.m. ET.  More info here:  https://t.co/SmdNI89Ybi"]["Deeply saddened to learn former @unevadareno president Joe Crowley has passed away. My family &amp; I send our sincerest condolences to his wife &amp; children. Mr. Crowley did so much for Northern #NV &amp; under his stewardship he helped make @unevadareno the leading university it is today"]["Honored to meet w/the @FilVetsREP, Major General Antonio Taguba &amp; more today about my efforts to recognize Filipino &amp; Filipino-American military #veterans. I was also humbled to receive a bronze replica of the Congressional Gold Medal from the organization. Thank you @FilVetsREP! https://t.co/yorHoKWbcy"]["The @USGAO’s findings are shocking, worrisome &amp; reprehensible. Congress must pass the VA Provider Accountability Act, a bill I intro'd w/@Sen_JoeManchin, to help ensure that #veterans are not at risk of receiving unsafe care from poor-performing providers. https://t.co/JstqA3plHl"]["Just finished meeting with @POTUS and my Senate colleagues about delivering #taxrelief for hardworking Americans. The Senate must pass the #TaxCutsandJobsAct, a pro-family, pro-small business bill, and keep working 24/7 until we get the job done."]["Congrats @RenoAirport! Keep up the momentum! https://t.co/4dyyDFAIBz"]["In Case You Missed It: the Senate's #TaxCutsandJobsAct Bill Delivers Tax Relief for Nevadans via @rgj https://t.co/1lAwMbLPDX"]["Today is #NativeAmericanHeritageDay, a day to pause, reflect, and celebrate America's first people. #NV's rich history is intertwined w/the significant contributions of Native Americans. https://t.co/ypo9QGZDCv"]["Whether it's our service members fighting to defend our freedoms or our law enforcement officers who work tirelessly to protect our communities, there is so much to be thankful for this Thanksgiving. From my family to yours, I wish you a happy, safe, and peaceful Thanksgiving. https://t.co/x3DroXdS4K"]["The Senate's #taxrelief bill is good for Nevada's middle-class families. Why? Read my piece in the Reno Gazette Journal. https://t.co/PfqnH7xFjx"]["Congrats @RenoAirport! https://t.co/cvNaZWDC0p"]["Great news: The appropriations bill for @Interior, @EPA &amp; related agencies includes critical federal funding that I requested to help protect Lake Tahoe and detect wildfires in the region. More here: https://t.co/oNcQTQVHWz"]["Congrats @LASairport! What an incredible feat #VegasStrong https://t.co/iDFY8wX6U4"]["Pleased @POTUS has announced the U.S. will designate #NorthKorea as a state sponsor of terrorism, a move I support as I cosponsored S. 672. This marks a positive step toward stopping this evil, rogue regime."]["Thank you to members of my Northern and Southern Nevada US Services Academy Board. I appreciate them volunteering their time to interview so many impressive young Nevadans who are interested in attending a service academy. https://t.co/tVN6eIprlV"]["Great news for Lovelock: @USDA providing Pershing General Hospital a $2.9 million low-interest loan for renovations. More here: https://t.co/6oNJwPfe1S"]["Thank you @PVA1946 for supporting the VA Provider Accountability Act, S. 2107, my &amp; @Sen_JoeManchin's bipartisan legislation that stops the U.S. Department of Veterans Affairs  from hiding medical mistakes made by providers."]["My family and I are praying for Joe Crowley, former @unevadareno president, as he battles pneumonia. Please send your well wishes to him for a full and speedy recovery."]["@GOPSenFinance just passed our #taxrelief bill, which includes my amendment to double the child tax credit from current law. Still have a lot of work to do, but this represents a big step toward giving middle class families the tax cuts they deserve: https://t.co/dBTZeWEhoj"]["In Case You Missed It: My and @SenatorTimScott's amendment to the Senate's #taxrelief bill helps hardworking American families by doubling the #childtaxcredit from $1,000 to $2,000. Read more here: https://t.co/etNZNsaIWT"]["My staff was honored to be at the graduation ceremony for the POST Academy Class 2017-02 in Carson City. Congratulations to our newest peace officers throughout #Nevada! https://t.co/N7jTSbZ1zA"]["Intro’d the Fix NICS Act today w/several colleagues to encourage federal agencies to fully enforce current gun laws related to reporting criminal history. This bill is endorsed by the NRA, National Shooting Sports Foundation, &amp; Fraternal Order of Police. https://t.co/qUGf4mk3vs"]["The Senate #TaxCutsandJobsAct, which includes my amendment to double the #childtaxcredit to $2,000, will give a much-needed boost to #Nevada families. Read more here: https://t.co/XjT50488fE https://t.co/XFuOgi5guR"]["Congratulations to Pilar Biller, an art teacher with @DamonteRanchHS, for being named #Nevada’s 2018 teacher of the year by @NevadaReady! https://t.co/nnBHAICZGH"]["The Senate #TaxCutsAndJobsAct doubles the deduction teachers across the country, including those in #Nevada, can take for buying classroom supplies from $250 to $500. @GOPSenFinance 👩‍🏫👨‍🏫 https://t.co/r4ddHzXpGy"]["In addition to my amendment to double the current child tax credit, the Senate's #taxrelief bill now includes my provision that makes it easier for startups to give their workers a stake in the company: https://t.co/S2QKwwMhMp"]["Thank you @IvankaTrump for your leadership on enhancing the child tax credit. The Senate #taxrelief bill now includes my amendment to double the child tax credit from current law. This will give middle class families the relief they desperately need: https://t.co/Js4sq3UPZP"]["An enhanced child tax credit, which I have been fighting for along w/@SenatorTimScott @MarcoRubio &amp; @SenMikeLee, will quite literally put thousands of dollars back into Americans' pockets &amp; represents another step toward making the American dream possible again for so many people"]["BIG NEWS: Updated Senate #taxrelief bill includes my and @SenatorTimScott amendment that increases the child tax credit to $2,000 - that's 1,000 more than current law. Great news for hardworking #NV families and Americans everywhere: https://t.co/Js4sq3UPZP"]["A recent analysis found that the Senate’s #taxrelief bill would add more than 8,000 jobs in our state and boost middle class income by nearly $2,500 in #Nevada. That’s more money for things like groceries, diapers, and school supplies. https://t.co/RW8UC1CBIG"]["Introduced w/@SenCoryGardner &amp; @Sen_BennetCO today the Ensuring Access to Air Ambulance Services Act, a bipartisan bill that will improve access to emergency air medical services. Read more here: https://t.co/ybw0ZCeJLd"]["Thank you @USDOT Secretary Chao for directing $3 million in disaster relief to #NV. @USDOT \"stands ready to offer not only funds, but technical assistance, to help state &amp; local officials as they work to restore &amp; reconnect their communities,” said Chao. https://t.co/bdCZvdzHiC"]["Spoke with @ProvostCarman, @HeidiGansert &amp; @unevadareno officials this morning about the university's ongoing research and innovation efforts as well as its plans for the future. https://t.co/nRFVwldh47"]["Pleased the Trump administration’s @USDOT is providing $3 million in emergency relief funds to help #Nevada recover from flooding damage. Read more here: https://t.co/bdCZvdzHiC"]["In case you missed it, @politico: “Middle Class Biggest Winners in Senate Tax Plan, Study Says” https://t.co/ukJF2u8iI7"]["It is our responsibility to stand up for those who put their lives on the line for this country and provide them with the world class medical care they expect and deserve. Read about my bill to boost accountability for VA providers here: https://t.co/s3akXMjPkh"]["Today @GOPSenFinance kicked off the discussion about the Senate's #taxrelief bill. Watch my opening statement urging the Senate to deliver here: https://t.co/ipPK4tYBsp"]["Thanks to Nevada Honor Flight, #NV veterans spent Veterans Day in Washington, D.C.  My staff was thrilled to be at the Reno/Sparks Airport to welcome the Nevada Honor Flight home. https://t.co/8G3nkjp6Wq"]["Blue Star Mothers in the Reno Veterans Day Parade, celebrating their sons &amp; daughters who have served and continue to bravely serve our country. https://t.co/NQE27aPl6Z"]["Humbled to be a part of the Veterans Day Ceremony at Woodlawn Cemetery in #LasVegas. The memorial bench unveiled today serves as a reminder of the service, sacrifice, and unwavering commitment of our nation's heroes. https://t.co/tnQMRSSEfq"]["Great time at the Veterans Day parade in Las Vegas. https://t.co/SuhQDBiuny"]["My staff enjoyed the #Reno Veterans Day parade. Here's Grand Marshal Col. Kat Miller and more from the #Reno Veterans Day Parade. https://t.co/5bVZNIZbUI"]["The original G.I. Bill was one of our country's greatest successes, and it's why I've worked to improve it for today's and tomorrow's generation of heroes.https://t.co/Nqll88XR3S"]["Today we honor the many brave men &amp; women who sacrificed so much to defend our nation and uphold our values of freedom and democracy. I am sincerely grateful for #Nevada veterans' selfless service, sacrifice, and love of country. Thank you #VeteransDay https://t.co/3z4H68tvEV"]["To the 300,000 veterans living in #NV &amp; all who have served - thank you. We owe  you a debt that cannot be repaid. https://t.co/OAxukqrtMV"]["Nevadans deserve a break, and that’s why I've been fighting to give middle-class families the biggest tax cut possible. The Senate tax relief bill is a positive step toward providing families with the tax relief they desperately need and deserve: https://t.co/jUQltXiFto"]["In #NV, real median household income is down $7,000 from 10 years ago, childcare expenses are skyrocketing, and families are more likely to be living paycheck to paycheck in Nevada than almost anywhere else in the country."]["My mom was a school cook and my dad was an auto mechanic, and they told their kids that if they work hard then they too can achieve the American dream. However, too many Nevadans tell me that they think it’s out of reach."]["ICYMI: I wrote in today’s @TheHill about the critical steps Congress &amp; @VAChair have taken to fix the @DeptVetAffairs and restore our commitment to American #veterans https://t.co/OWZT9Z6VzG"]["Discussed student health issues and health care for young adults with @ACHA_Tweets &amp; #LasVegas resident Jamie Davidson, the associate vice president for student wellness at @unlv. https://t.co/esTq5My8qr"]["Today I introduced The VA Provider Accountability Act, a bill that demands transparency and accountability from the VA and puts a stop to concealing serious medical errors through settlements with fired or dismissed VA employees. Read more here: https://t.co/BJSzQbBxlq"]["Proud to partner with @Sen_JoeManchin in introducing a bipartisan bill to bring more accountability to @DeptVetAffairs’ providers &amp; help protect #Nevada veterans who are seeking medical care. https://t.co/9XVvGJXJAX"]["I applaud the U.S. House for approving legislation that ensures America’s #veterans have access to life-saving transplants. Not one #NV veteran should be forced to wait for another transplant if there is one readily available from a live donor. Read more: https://t.co/Nqo8KhbhW8"]["My staff was honored to be at the Sun Valley General Improvement District Annual Veterans Appreciation Breakfast to pay tribute to some of #Nevada's heroes and thank them for their service to our great country. https://t.co/GpI5KYVj32"]["Great meeting with Nevada Center of Excellence in Disabilities (NCED) to learn about the programs they offer to #Nevadans. https://t.co/AN3fTFRfRY"]["Congrats to WWII veteran &amp; #LasVegas resident Ed Hall for receiving your high school diploma! #94YearsYoung https://t.co/jDy5tPy9ph"]["Proud to introduce a bipartisan bill with my colleagues to empower #Nevada's students &amp; Americans across the U.S. with the tools needed to make well-informed, sound financial decisions related to their college and education. Read more here: https://t.co/AtXQHPtBpt"]["Thanks @thedanmasonshow for talking w/me about giving Nevadans a break. #TaxRelief &amp; tax cuts will help spur economic growth &amp; make American businesses competitive again."]["My wife, Lynne, is singing the National Anthem at the Vietnam Veterans Memorial. Proud of her! You can watch here: https://t.co/Q3U3fOt8P7"]["Senate needs to do whatever it takes to pass #taxrelief for #NV families. Shouldn't go home until the job is done https://t.co/gg6odYyP9z"]["VIDEO: I stood w/Trump Administration officials, @GroverNorquist to highlight importance of tax cuts for NV families https://t.co/gg6odYyP9z"]["It’s time for #TaxRelief &amp; real tax cuts. The American people are counting on us, &amp; we shouldn’t go home until we get the job done for them. https://t.co/OPpSNNc28c"]["Always great to speak with @taxreformer’s @GroverNorquist, a true advocate for #TaxRelief for #NV’s small biz owners and families. https://t.co/XLTh0ORVdM"]["I'm fighting w/@stevenmnuchin1 &amp; the Trump administration to deliver #TaxRelief for Nevadans. https://t.co/jLJReHBnYr"]["8am PT today joining @stevenmnuchin1 @KellyannePolls @SenTedCruz &amp; more to discuss how #TaxRelief will help families https://t.co/GB72HoHaIi"]["November is #MilitaryFamilyAppreciationMonth. Thank you to all #NV families &amp; loved ones for carrying the load and supporting our troops. https://t.co/jXBd9eXTfb"]["The news out of Sutherland Springs, TX is devastating. Praying for the victims and all who have been impacted by this act of pure evil."]["Caught up yesterday with Dan Schinhofen, Chair of Nye County Commission. https://t.co/Bo2fXtnF4P"]["Great meeting w/Douglas County Commissioners Larry Walsh and Nancy McDermid today to talk about public lands. https://t.co/5DlVi5u91R"]["I applaud @POTUS for signing into law our bipartisan bill to help protect children from online predators. Read more: https://t.co/XrDaruZWeY"]["NEWS: I introduced a bill w/@SenToddYoung, @SenBennetCO &amp; @SenBillNelson to advance treatment for dialysis patients https://t.co/WNgtUOrGyX"]["Hardworking Americans don’t go home until their work is complete &amp; neither should the Senate. It’s time to work 24/7 https://t.co/4vqG565F3v"]["Met with primary care professionals from #NV. We talked about ways to improve health care delivery to help patients &amp; bring down costs https://t.co/bEGgNUSRq4"]["I'll be on the floor shortly urging my colleagues to work 24/7 to confirm judges &amp; deliver #taxrelief for #NV https://t.co/g1fr4vjBwq"]["Headed to vote to confirm Stephanos Bibas, who will be the 4th judge we've confirmed to the U.S. Circuit Court this week. Need to keep it up"]["WOW @SenateDems get 4 Pinocchios from @washingtonpost for claiming #TaxRelief raises taxes on working-class families https://t.co/9Uh7eKehln"]["#NV's rich history is intertwined w/the significant contributions of Native Americans https://t.co/V4ftK8px4R #NativeAmericanHeritageMonth"]["Thank you @thedanmasonshow for having me on to talk about bringing #taxrelief to Nevada’s hardworking families. Congress must get it done!"]["As we continue to grieve together, we also continue to show the world that we're #VegasStrong. (2/2) https://t.co/IRvc4zfNpq"]["One month after the #LasVegasShooting our hearts still hurt for the victims and their families, as well as the wounded. (1/2)"]["Just voted to confirm the 3rd of 5 judges the U.S. Senate plans to vote on this week. We need to work around the clock to confirm all noms"]["Met with Nevadans from #LasVegas with the American College of Emergency Physicians and talked about the value of emergency medicine. https://t.co/qLgstGqxph"]["Congrats to Sgt. Grant Reimers, who placed 2nd in the All-Army Best Warrior Competition @NVNationalGuard #BattleBorn https://t.co/dYxLJclAXN"]["Tragic news out of Marigold Mine. My staff and I are closely monitoring the situation."]["God bless the victims &amp; all impacted by the horrific NYC attack. Evil will not prevail; this city has our support &amp; they will remain strong."]["#HappyHalloween Before trick-or-treating starts, #Nevada families should check out some safety tips via @KRNV https://t.co/YZ6uXGBuct https://t.co/mC5nzASPIf"]["This week, the Senate's entire focus is confirming judges. We need to work every day until we fill all vacancies: https://t.co/1SY3Bch8e4"]["On this day in 1864, #Nevada was admitted to the U.S. as the 36th state #BattleBorn https://t.co/yYEeh4dpcL"]["Are you a Nevadan interested in attending a U.S. Service Academy? Deadline to apply for a nomination is TOMORROW: https://t.co/6MUyTqZqNd"]["MUST READ: Why the Pet &amp; Women Safety Act (#PAWSAct), a bipartisan bill I intro'd with @SenGaryPeters, is needed: https://t.co/JCfmV8ocEN"]["In case you missed it, I'm pushing to deliver #taxrelief for #Nevada's hardworking families. Read more via @pvtimes: https://t.co/GFNAkQm7Uw"]["The Good Samaritan Search &amp; Recovery Act deserves swift bipartisan approval by Congress. More on my bill here: https://t.co/L3NSfNqEBi"]["Happy #NevadaDay! Check out some activities and celebrations across the state here: https://t.co/03hVcq0Ax2 https://t.co/eZhKrWwwXN"]["IN CASE YOU MISSED IT: I was humbled to honor WWII Filipino #veterans at the Congressional Gold Medal Ceremony https://t.co/7tFQArLvI8"]["VIDEO: At yesterday's ceremony I spoke about why the Congressional Gold Medal honoring Filipino vets is long overdue https://t.co/RPfQTUO81B"]["I joined @SenFeinstein to introduce a bill to improve breast cancer detection. Read more https://t.co/yZNpmUyBZq #BreastCancerAwarenessMonth https://t.co/2fhT8tMfhS"]["Always great to meet up w/@alzassociation to discuss progress that's happening at the state and chapter levels regarding research and care. https://t.co/oKmNVLYH0n"]["We need to work day and night to confirm those judges that have moved out of @senjudiciary. Watch my remarks here: https://t.co/1SY3Bch8e4"]["TUNE IN: About to speak on the Senate floor about why we should be working 24/7 to confirm 50+ judges. Watch here: https://t.co/0RnrYzoEPV"]["The House's approval of the Senate-passed budget brings us one step closer to delivering #taxrelief for #NV families."]["Pleased the Senate passed a bill I cosponsored that makes sure #NV #veterans receive a cost-of-living increase for their disability benefits"]["Honored to recognize Sgt Baldonado of #LasVegas at the Congressional Gold Medal Ceremony for Filipino-American Vets: https://t.co/9U3h0dAJhh https://t.co/L26vGJ2eBw"]["ICYMI: I'm urging Congress to deliver a bigger child tax credit for #Nevada’s hardworking families. Read more here: https://t.co/18LA0Qt9k9"]["Fighting for #taxrelief for NV’s hardworking families who could benefit from thousands of dollars to purchase diapers, groceries, &amp; more. https://t.co/QEc6kN6wBq"]["Shared stories from #NV families during discussion with @IvankaTrump and my colleagues on the child tax credit. https://t.co/ojp9d1BNqO"]["TUNE IN: I'll be speaking momentarily about bringing #taxrelief to NV families through a child tax credit. Watch: https://t.co/eY1Sr1KO2Y"]["Had a nice time talking about education and job-training w/ @ATeamNV1. Also got some great business cards from this year's group! https://t.co/cRMB3V09uQ"]["AT 11:30 a.m. PT I'll join Ivanka Trump &amp; my colleagues to discuss how a child tax credit will help #NV families https://t.co/3w5SmLNMri"]["Ahead of today's Filipino Veterans WWII Congressional Gold Medal Ceremony, I had the honor of visiting with #NV's Sergeant Baldonado. https://t.co/PRafvjqzRc"]["Humbled to be at the Congressional Gold Medal Ceremony honoring Filipino veterans of World War II. History will not forget your service. https://t.co/QT90cKrunW"]["Great talking with @AmericanLegion Rider and #LasVegas veteran Vic \"Doc\" Moss &amp; Maria Moss today about supporting #Nevada veterans https://t.co/Z0WpKd9L3v"]["The #VegasStrong Resiliency Center is open at the Lied Ambulatory Care Center, 1524 Pinto Lane 10am-7pm, Mon- Fri https://t.co/v08PsnpiYb"]["This Oct. 23, we remember the 241 U.S. service members killed in the #Beirut Marine barracks bombing. We will not forget this act of terror. https://t.co/R9PhIFqbkG"]["Can’t wait to watch #NV's own @haileys_hand throw out the first pitch at the #WorldSeries https://t.co/FoLiJlj8F7"]["My staff was thrilled to be at @RenoAirport to welcome home WWII, Korean, &amp; Vietnam #Veterans on the #NV Honor Flight. https://t.co/QqcE6celO0"]["As someone w/a family history of breast cancer, I know that early detection saves lives. This #NationalMammographyDay schedule a screening. https://t.co/TeBMftu29K"]["Just voted to pave the way for #taxrelief for #NV families. We have a long road ahead, but I'm eager to get to work: https://t.co/ofoILcH71L"]["Family caregivers make enormous sacrifices every day. I’m pleased to see the Senate pass this bipartisan bill to help support them. https://t.co/Rddx5sgSJA"][".@DeptVetAffairs must take immediate steps to retain &amp; recruit the best doctors for our nation’s #veterans. https://t.co/PsBsHhCycd"]["Are you a Nevadan interested in attending a U.S. Service Academy? Apply for a nomination by the 10/31 deadline: https://t.co/6MUyTqZqNd https://t.co/sZ2P5KNatq"]["The Senate shouldn't go home until we get things done for #NV. I'm fighting for the Senate to work around the clock: https://t.co/lWq0oENbYt"]["Joined a bipartisan group of senators in asking @DeptVetAffairs for its plan to address high veteran suicide rates: https://t.co/XIgyxdgH4g"]["A new #LasVegas has risen after the 10/1 shooting. Watch my speech memorializing the victims &amp; heroes https://t.co/z1RQbYubTR #VegasStrong"]["MOMENTARILY: I’ll be speaking on the Senate floor to memorialize the victims of the Las Vegas shooting &amp; honor the many heroes #VegasStrong."]["Pleased the U.S. Senate passed my amendment to provide #taxrelief for hardworking #Nevadans. Watch my speech here: https://t.co/eofmmJqEOG"]["WATCH NOW: I’m speaking about my amendment to provide #taxrelief to hardworking Nevadans https://t.co/BnLNBafh9v"]["TODAY AT 2:30 pm PT: I'll be delivering a speech honoring victims &amp; heroes of the Las Vegas shooting. Read more: https://t.co/1BbJ34pW6N"]["Joined @SenCortezMasto in asking @SocialSecurity how it will assist the victims &amp; families of the Las Vegas attack: https://t.co/ptxlBeDspR"]["My office was present when Nye County commissioners designated Pahrump as a Purple Heart Town and Nye as #NV's first Purple Heart County. https://t.co/UOA3seaqPa"]["This is a big score for #LasVegas. Welcome to Nevada, @WNBA &amp; @SAStars! https://t.co/vc6Xvyzzo5"]["Moments ago I intro'd a resolution w/@SenCortezMasto memorializing the victims of the Las Vegas shooting. Read more: https://t.co/ilSkZtM4Il"]["JUST NOW: I sent a letter to my Senate colleagues urging action on my bill to help prevent #wildfires in #NV &amp; U.S. https://t.co/66632pMbu7 https://t.co/iyPrDR5pKX"]["Thank you @RAIDERS for honoring these heroes! #VegasStrong https://t.co/OqHHIlmHua"]["Happy our office was able to attend the grand opening ceremony for @UFCGYM in #Reno! https://t.co/XXZfP0qjFY"]["Earlier this week I joined 58 Senators in urging reauthorization of the Perkins Career &amp; Technical Education Act https://t.co/oBynBMqkMu"]["Luis from my office welcomed @the_USO to Creech Air Force Base today. Grateful for the support USO provides to our service members in #NV. https://t.co/340ialrQXV"]["My office was honored to be at the ribbon-cutting ceremony for @tmccnevada’s new Diversity and International Student Center and Office. https://t.co/ftcb6v7DAY"]["Allowing insurance to be sold across state lines will help drive down costs, expand choices, &amp; increase competition. https://t.co/XrRLLNorAd"]["Thank you @RenoFireDept, @TMFPD, &amp; all #Nevada fire crews who are helping fight the multiple wildfires across California. #BattleBorn"]["Grateful @TheJusticeDept is directing $ to #LasVegas to help cover costs associated w/law enforcement's response https://t.co/LJG3v737rS"]["Blood bank locations near #LasVegas, or across Nevada, can be found here: https://t.co/0AZwHnNjK4 https://t.co/tCGqMImrnE"]["Last night’s ceremony by the @GoldenKnights was a moving tribute to the community and all who helped #VegasStrong https://t.co/y9RqEFiGQ7"]["Today I urged @DeptVetAffairs to protect America's #veterans from predatory home lending practices. Read more here: https://t.co/qOZOAfSrqN https://t.co/dbctU5e85Q"][".@interior's decision to reopen 10 million acres of federal lands, including in #NV, is a win for the Silver State. https://t.co/7NyIi5dedd"]["ICYMI @POTUS signed my bill to help Nevadans better understand the benefits &amp; risks before investing their money https://t.co/ZBUEiHmn0p"]["This will be an amazing moment &amp; tribute #VegasStrong https://t.co/01MZiGA9fS"]["I appreciate @VP and his wife, Karen, for being in #LasVegas with us today to show their support."]["Thank you for your kind words @VP, and for being with us today https://t.co/OPi9EnIc26"]["BREAKING: I sent a letter to @ATFHQ urging them to review legality of bump stocks following the Las Vegas tragedy. https://t.co/a668QT0BQx https://t.co/eC5rQrmZnh"]["We are all on the same team tonight. #VegasStrong https://t.co/cyXQNiS3vu"]["Tonight was a testament to the #LasVegas community's love for Charleston Hartfield and the impact he's had on lives of those who knew him. https://t.co/80ENE0kTvH"]["Honored to meet the nurses, doctors, and staff @SunriseLasVegas who are providing top care to the wounded &amp; injured #VegasStrong https://t.co/yLx8LgkThK"]["Like a lot of Nevadans earlier this week I gave blood, but there’s still a need. Make an appointment here https://t.co/Jt6IdQ8d1R https://t.co/FEvUbAUkJC"]["There was no shortage of heroes and helpers on Sunday night #VegasStrong https://t.co/1vhYrsr0G4"]["#ClarkCounty Fire Chief Cassell &amp; team were among the first on the scene. These heroes saved many lives &amp; exemplify #VegasStrong. Thank you. https://t.co/gKQL5Gh5Oz"]["It meant a lot to so many to see @POTUS and feel his compassion in person. United, as a nation and state, we are #VegasStrong https://t.co/NkA8kHZwS1"][".@VegasPBS has shared helpful resources for families &amp; children to cope following Sunday’s tragedy https://t.co/XXo5RWdNNl"]["We will not forget. Thank you @POTUS for helping us heal. #LasVegasStrong https://t.co/7vKkWGlLP3"]["Nevadans – and Americans - stand united #VegasStrong https://t.co/ziNCZVcDci"]["“You showed what professionalism is all about” @POTUS when talking about first-responders. I couldn’t agree more. Their actions saved lives."]["Lynne &amp; I are saddened to learn Don Carano has passed away. He made Northern Nevada a better place to live and work &amp; will be truly missed."]["So proud of the work that @UMCSN nurses, doctors &amp; medical staff are doing. Many of these professionals have been working around-the-clock. https://t.co/FviPORrtlo"]["BREAKING: @SenCortezMasto &amp; I are urging airlines to aid Las Vegas massacre victims, families https://t.co/vwhLfQ1Lny https://t.co/E4WWeplE6k"]["The Office for Victims of Crime, @OJPOVC, has listed resources for Las Vegas shooting victims &amp; their families https://t.co/rj6AGltkIr"]["Stephanie is a physician in the Air Force program at @UMCSN. She said that trauma care has improved as a result of military experience. https://t.co/rnl27pNqf7"]["Thankful for Dr. Fildes and all of the providers at @UMCSN for their hard work around the clock to take care of the wounded. #LasVegasStrong https://t.co/68s9XiCQ4g"]["Humbled by Nevadans coming out in droves to support those in need https://t.co/IM1qCZKbeb"]["If you are looking for your loved ones the Red Cross &amp; VA command posts are set up at the LV Convention Center and ready to assist."]["Proud of Nevadans lining up block after block to give blood following the Las Vegas shooting. https://t.co/wTGDJKKtqC"]["Thank you @POTUS for the moment of silence and your remarks on this harrowing tragedy. https://t.co/7Q35xrjgOi"]["I appreciate my colleagues showing their support for Nevada during this extremely difficult time for our community. https://t.co/HvI2G8pFnY"]["Such a great idea. In the face of tragedy, Nevadans are pulling together. https://t.co/20NskQ3bL2"]["If you’re in #LasVegas, please consider donating blood. https://t.co/Fq5XzBh90m"]["Spoke with Gov. Sandoval and Attorney General Laxalt and will continue to monitor the situation."]["Thankful for police and first-responders on the scene."]["Senseless, horrifying act of violence in Las Vegas tonight. Praying for all the victims &amp; those impacted by the tragedy."]["Good to have Rev. Juan Almanza and Pastor Rocio Canas from #LasVegas in my office to discuss conservation efforts in #NV https://t.co/gbE3evv2TU"]["Discussed security concerns w/#LasVegas officials. I continue to urge @DHSgov to help our city fight terror threats: https://t.co/dtgE0CZNAB https://t.co/LOHUCWqteI"]["Congrats Shirley &amp; Bill Wallin, Thompson, &amp; Pinon Hills ES for being named National Blue Ribbon Schools! #nbrs2017 https://t.co/RgHPHGJTYg"]["Lynn from Henderson is with the Lung Cancer Alliance. We spoke about ways to improve research, care &amp; outcomes for the lung cancer community https://t.co/3F6fAUMwhk"]["Spoke to @lvchamber about what I'm doing to help boost tourism in #NV, reduce burdensome regs, &amp; make it easier for our job creators to hire https://t.co/kI82VuUQmq"]["Thankful to learn my friend @SteveScalise returned to Congress today. My family continues to pray for him on his road to a full recovery."]["This is great news for #NV &amp; w/#taxrelief our economy will continue to grow, creating more jobs for Americans. https://t.co/p4rWvimn37"]["Good discussion with #Nevadans in #Washoe County during tonight's telephone town hall. Thank you for participating."]["The U.S. House just passed my bill to help Nevadans better understand complicated financial investments. Read here: https://t.co/lleDYHmDJ2"]["Our framework is a positive step toward achieving #taxrelief for #NV families &amp; Americans, &amp; now Congress must act: https://t.co/4bVADDfF4A"]["Joining my colleagues on the tax-writing committees in unveiling framework to bring #taxrelief to #NV. Watch here: https://t.co/3mOrIWMKCQ"]["ICYMI: I spoke during @VAChair hearing this a.m. about the need to reduce #NV's #veteran suicide rate #BeThere https://t.co/Cm0LMyX4HJ"]["Critical industries in #NV – ranging from hospitality to tourism to healthcare – will be able to better compete. @GOPSenFinance"]["Tax relief will provide a big lift for #NV's middle-class families &amp; small biz owners. @GOPSenFinance"][".@POTUS, U.S. Senate, &amp; U.S. House are committed to enacting #taxrelief for hardworking Americans. @GOPSenFinance"]["My position remains clear: #YuccaMountain is dead. Read more about my testimony from @KTVN: https://t.co/XbBHCZ0oxF"]["Good to catch up w/Nevadans from #Reno &amp; #LasVegas w/ the Associated General Contractors of America. Discussed #infrastructure, #taxrelief. https://t.co/Pool8mMb1m"]["I'm cosponsoring the KIDS Act, bipartisan bill to ensure stability for #NV's vulnerable children by extending CHIP: https://t.co/w28evb14mo"]["Great to have #ClarkCounty Commissioner Larry Brown and County Manager Yolanda King in Washington, D.C. this morning. https://t.co/FOaMtTMJ9M"]["Nice to have President Len Jessup w/@unlv in D.C. Got an update on exciting projects, including the medical school and the stadium. https://t.co/pPcvFpYAIK"]["#YuccaMountain is not the solution to our country’s nuclear waste problem. Read my testimony to @GOPoversight https://t.co/l8NnCYDBPu"]["Met with members of the #NV Credit Union League to talk #taxrelief and regulatory reform. https://t.co/sZSAUopN0L"]["Congratulations to Principal Pendleton of Ed W. Clark High School in #LasVegas on her recognition as @NASSP State Principal of the Year! https://t.co/VDIenHlPGG"]["Met with @SkillsUSA this morning and discussed the importance of career and technical training to help #Nevadans secure good-paying jobs. https://t.co/ITUh3yll5r"]["The status quo isn’t working. Graham-Cassidy-Heller-Johnson gives #NV the flexibility &amp; funding it needs: https://t.co/qeFsh5Husp"]["The U.S. Senate just confirmed William J. Emanuel to the @NLRB. Read my statement here: https://t.co/7J4nwG0OkT"]["Had a great time at the #NV Hispanic Heritage dinner last night! https://t.co/akdEEFwwPp"]["Another reason to visit Nevada! Congrats @LASAirport! https://t.co/RZSJYELqPy"]["Community health centers are critical in states like #NV. Congress must take action to extend funding. Read more: https://t.co/1IwZVQeoQ5"]["#NV's #opioid crisis demands attention &amp; that's why I welcome @ONDCP’s grant to fight youth drug abuse https://t.co/XGk5OKzPyf"]["I wrote to #Equifax CEO w/@SenDonnelly asking what actions are being taken to protect servicemembers https://t.co/cYVFSechmZ"]["Met with representatives from @NevadaHOSA &amp; heard first-hand how technical training in high school benefits students later in their careers. https://t.co/AxK4ketpSw"]["Good to meet with Dr. Reinke from @UNLV School of Dental Medicine and discuss funding for research that could help diagnose disease. https://t.co/HO79U9O2xK"]["What They’re Saying: Graham-Cassidy-Heller-Johnson Health Care Reform Bill “A Triumph of Federalism:” https://t.co/vD34hHU5Yr"]["Graham-Cassidy-Heller-Johnson is the best solution to repeal and replace Obamacare. https://t.co/gng5Us7QCX"]["ICYMI: #Henderson gets @HUDgov grant to help homeless, low income families via @FOX5Vegas https://t.co/DsQ5LgLmN4"]["BREAKING: #NV to receive $5.5 million in grants from @HUDgov to fight homelessness, build communities https://t.co/cVmR6Lce33"]["Happy bday @USAirForce! Thankful for the men &amp; women who serve our country, including airmen at @Creech_AFB @NellisAFB &amp; in @NVNationalGuard https://t.co/jcIqBCXuph"]["Read my statement on @SecretaryZinke's recommendations related to Gold Butte: https://t.co/rXR6IgO8eA"]["The @DeptVetAffairs report today underscores the need for increased efforts to fight veteran suicide in #NV https://t.co/cSk8m3YsT3 https://t.co/3ZZAjJ17fj"]["Today we recognize and honor all American POWs &amp; MIAs. You are not forgotten. https://t.co/3aJLeUMyiN"]["Pleased the Senate took action on 2 bills I cosponsored to stop #humantrafficking in #NV &amp; across the U.S. https://t.co/P5jknBpdav"]["Last night the Senate passed two bipartisan resolutions I supported celebrating #HispanicHeritageMonth https://t.co/x2OryZfroe"]["At @GOPSenFinance hearing on #taxrelief today, I spoke about how fixing our outdated &amp; unfair tax code will help #NV https://t.co/ZSral8xScW"]["#NV produces impressive Americans. #Elko native helps protects the U.S. from cyberthreats as a member of @USNavy https://t.co/L9HEoB2XlK"]["Leanna heads @AWBC_USA NV program, which helps women #biz owners in #NV succeed. Great to learn more about her work &amp; how it impacts #NV https://t.co/McOh4hlnnm"]["Heading to @SenateFinance to kick off our first hearing on #taxrelief for #NV &amp; Americans everywhere. Tune in here: https://t.co/lwoypRMtsk"]["Thanks to Gil for his work to help NV's Veterans of Foreign Wars. As a member of the Veterans' Committee, I'll continue to fight for NV vets https://t.co/ePH5MgP4So"]["Joined @lindseygrahamSC @SenatorCassidy @SenRonJohnson @RickSantorum in releasing our health care proposal. Details: https://t.co/dceJ5soL2B https://t.co/d5GHK6Fx81"]["ICYMI: The Senate passed my bill aiding disabled veterans to fight cybercrime via @KTVN https://t.co/TtLAaFmZAK"]["This is great news, &amp; with #taxrelief we will see more jobs &amp; families can keep more of their $. https://t.co/KiVyLEAIVw"]["I joined a bipartisan letter asking @TheJusticeDept, @FEC &amp; @SEC_News to investigate #Equifax. More here: https://t.co/xjYedCm1AC https://t.co/ioh30hyvev"]["Enjoyed taking questions from Nevadans in #Clark County during tonight's telephone town hall. https://t.co/6IsOczu6k8"]["Met with Nevadans from the #Reno Housing Authority to discuss affordable housing in Northern #NV. https://t.co/5xrHfeqIdI"]["Good update from @nvvolunteers on the success of their community service programs across #NV. Keep up the good work! https://t.co/yxg7siSw7Q"]["Pleased several #NV orgs will receive @DeptVetAffairs grant $ to help homeless veterans. https://t.co/u7AdEdUH1b"]["BREAKING: The Senate has passed 3 of my bills to aid #NV's\nsmall businesses, investors &amp; taxpayers https://t.co/mBO3FH5HZz"]["On #September11th, we honor the thousands of lives lost and we're reminded that more unites us than divides us: https://t.co/pfVyQxNFDM"]["Great news -&gt; White Pine County will receive @USDA funds to assist w/construction of a new justice center in Ely https://t.co/P33RaZXt2Z"]["Highlight of today was talking to students from @TMSmustangs in LasVegas. Always great to see young Nevadans engaged &amp; asking good questions https://t.co/K3fNbpGFeq"]["Met with members of the Nevada Trucking Association from Reno, #LasVegas, and Sparks to talk infrastructure, #TaxRelief, &amp; new technologies. https://t.co/SFI8VG3KL3"]["Great to have Commissioner Jim French of Humboldt County in D.C. We both know how important the #PILT program is to #NV communities. https://t.co/0AcAkwkd2L"]["The 36th annual Great #RenoBalloonRace starts Friday. Read more about this awesome #NV tradition: https://t.co/nZABlvFGKo HomeMeansNV"]["Enjoyed taking questions from constituents in #Carson City and across rural #NV during tonight's telephone town hall."]["Humbled to meet with Mr. John Reed, a #veteran from #NV. We spoke about veterans w/cancer &amp; the importance of the VA providing quality care. https://t.co/rTWoEnKnNl"]["BREAKING: I just intro'd bipartisan legislation to help reduce the national rape kit backlog https://t.co/Em8twqmWox"]["It was an honor to attend the recent change of command ceremony. #NV is in good hands with Brig. Gen. Zachary Doser: https://t.co/qjmOIu9DWM"]["Today's news that a federal judge struck down the overtime rule is a relief for countless NV businesses &amp; employers https://t.co/bwpz7bIHGZ"]["This is what it means to be #BattleBorn: https://t.co/DNwzwxWROn"]["Dave and Pam are good friends, amazing people, and their new facility will benefit #NV. https://t.co/KKHM9tDMeX"]["#TaxReform in NV = a stronger economy, more jobs &amp; higher wages. That's why I’m encouraged by @POTUS comments today https://t.co/Qh1I37UUyE"]["Nevadans have been waiting for #taxreform and Congress is ready to make that happen https://t.co/Qh1I37UUyE"]["This is great news for NV and why Congress must swiftly tackle tax reform - our country will only continue to build on this growth. https://t.co/MSMkL7pXnZ"]["My office was grateful to attend @nevadadot ribbon cutting for the USA Parkway Extension - an important development for #NV transportation. https://t.co/SHm3a70O5V"]["ICYMI: yesterday I held a listening session w/@stevenmnuchin1 to talk about tax reform &amp; job growth for Nevada https://t.co/xQ4kN2tpWP"]["Congrats to @LASairport for setting a passenger record in July! When tourism succeeds, NV succeeds https://t.co/WHV5vWsvcv"][".@stevenmnuchin1 is critical in our tax reform efforts. I thank him for coming to NV to hear from our state’s job creators https://t.co/8Luyj0IJ5c"]["Honored to have @stevenmnuchin1 in Las Vegas today to talk #taxreform w/some of NV’s top business leaders https://t.co/bpPCCe7N9k"]["Spoke to @BOYDFRCSTSUMMIT today about how #NV’s airports boost tourism and strengthen our economy. Aviation in #NV has a bright future. https://t.co/zUyKPLYiZJ"]["Thankful for the leadership &amp; selflessness of Nevada Task Force-1, 18 members deploying to assist w/Hurricane Harvey https://t.co/b2LE6afYYr"]["Great to see @SecretaryZinke recognizes the important role @BLMNational plays out West &amp; agrees w/ relocating its HQ https://t.co/89QVNnUah8"]["ICYMI: @pvtimes reports on a bill I supported, &amp; just signed by @POTUS, that will help #NV vets https://t.co/kHjCYwUpJ3"]["Great News: @Allegiant adding additional nonstop flights at @LASairport. Good for #NV tourism. https://t.co/zrJ6cKh67N"]["It was good to have @POTUS in #Reno yesterday to talk w/ veterans &amp; sign legislation I cosponsored to reform the #VA https://t.co/XD7yWkEi7E"]["Glad @POTUS chose Reno to sign our bill to give vets more options in VA appeal process. Result of hard work &amp; always putting #VeteransFirst"]["Great day for #NV vets. @POTUS and Congress worked together to overhaul @DeptVetAffairs appeals process to put #VeteransFirst."]["Good questions and discussion at the Hispanics in Politics meeting this morning. Thanks to Fernando for putting together a great event. https://t.co/lRyPd1Fgxb"]["Kicking off the Hispanics in Politics breakfast in Las Vegas. https://t.co/OmuNM9IDJR"]["Great to have @SecShulkin at the VA hospital in Reno as I sign a declaration reaffirming our commitment to preventing suicide among NV vets https://t.co/zZpttYL3y9"]["Great to be in #LakeTahoe for the Annual Summit to discuss the importance of protecting the Jewel of the Sierra for generations to come. https://t.co/wL9Pxa4Pcv"]["Pleased to see @DeptVetAffairs is taking steps to reform a critical program &amp; help #NV veterans in rural communities https://t.co/7xJr73upXN"]["#JerryLewis, who called #LasVegas home, brought the best out of ppl by making them laugh &amp; encouraging them to give back. He will be missed."]["Praying for the victims - and their loved ones - of the horrific terror attack in #Barcelona."]["BREAKING: @POTUS signs #ForeverGIBill into law, a bill I supported to expand education benefits for #NV vets. More: https://t.co/Njn4i4CQHF"]["There is no defense or justification for evil in the form of white supremacists and Nazis. None."]["Just had a great talk w/leaders from the Latin, Asian, Urban &amp; Henderson Chambers on topics ranging from immigration to tax reform https://t.co/n5gEsbBy2K"]["Stopped to talk to a few Nevadans who were outside my Las Vegas office this morning. https://t.co/MrHmvSmC1W"]["I welcome @Centene’s pledge to offer health plans in Nevada’s bare counties. Read more here: https://t.co/fwGKR7qLYI"]["Good to join Sun City Anthem Men's Breakfast Group in Las Vegas to talk health care, tax reform, and #YuccaMountain. https://t.co/pKYV67CjvM"]["Always great to join Dan Mason with @NewsTalk780KOH. Thanks for having me on. https://t.co/pnTbMk3zLL"]["Today I visited the Reno VA hospital to discuss the unique needs of Nevada’s #veterans. https://t.co/kZG1vVXxFz https://t.co/eOVIc6C3S2"]["BREAKING: @potus just signed my bill ensuring NV veterans can continue accessing care close to home. https://t.co/MtPuq36MFy"]["Racism, hatred, and violence as a means to an end is unacceptable and shameful. There's no room for it in this country. #Charlottesville"]["Proud of the work Congress is doing to reform and improve VA appeals process. Hope to see quick action by @POTUS: https://t.co/3BSlYVMot2"]["Honored to recognize 100 yr. old WWII Army Air Corps vet LTC Robert Schratz in Reno. Bob flew in 168 missions, including the Berlin Airlift. https://t.co/hKRQWwUY5s"][".@NRCgov’s efforts to revive #YuccaMountain is yet another waste of taxpayer money on a failed project #NV rejects: https://t.co/VWuqsPTTyd"]["Leading the #NV delegation in urging @ENERGY to choose Fallon, #NV for geothermal lab: https://t.co/zFaAxHLj3R"][".@KTVN discussed a bill I introduced last week to help prevent wildfires in #NV - learn more here: https://t.co/YOix4cveQU"]["On #PurpleHeartDay, we honor &amp; thank the men and women who selflessly sacrificed to defend our nation from tyranny, oppression, &amp; injustice"]["The @DeptVetAffairs must update their funding formula to support new veterans home in Northern #NV. More: https://t.co/glNmVFyno2"]["Introduced legislation to help reduce #wildfires in #NV by speeding up review process for prevention projects: https://t.co/3AELzusGmB"]["Larissa goes to @unevadareno and is one of our summer interns. Excited to have her here and believe she has a bright future ahead! https://t.co/xMLLkBQGQa"]["Busy day in the Capitol, but appreciate @RepKihuen’s interns for taking the time to talk to me about their interest in public service. https://t.co/ZcCxn4MTjk"][".@POTUS's &amp; @DeptVetAffairs initiative will give #NV vets greater flexibility through a mobile app to schedule appts and consult physicians"][".@Interbike’s Trade Show is coming to Reno-Tahoe. Always great when ppl recognize what #NV has to offer &amp; choose us: https://t.co/wwUsBRfMNI"]["Proud to work with @SenRonJohnson to pass his legislation to give seriously ill patients a #RightToTry experimental medicines."]["Senate passed comprehensive #ForeverGIBill w/ my provisions to expand G.I. Bill benefits for many #NV veterans https://t.co/gyCaICf6V3"]["Voted to confirm Marvin Kaplan, confident he will put forward policies that help create jobs in #NV https://t.co/1Uks90r8vQ"]["Great to meet Tom Bowman, Deputy Secretary Nominee for @DeptVetAffairs &amp; discuss efforts ensure #NV’s veterans receive the care they deserve https://t.co/gttSowXXka"]["Paul Laxalt was not only a mentor to me, but a Governor &amp; Senator who blazed a trail for the #NV conservative movement. Happy 95th Birthday!"]["Worked w/ my colleagues in the Senate to strengthen veterans’ rights in important overhaul of the VA appeals process https://t.co/3BXU4znq8m"]["Incredibly proud to help move #VAChoice funding across the finish line in the Senate, huge victory for #NV veterans: https://t.co/b2X23irMIQ"]["Spent some time this AM speaking w/ @MarkAmodeiNV2’s summer interns. Great to see young #Nevadans who want learn about public service. https://t.co/GWMrHKfgNu"]["Great news! @wallethub lists Las Vegas as one of the most 'livable cities' in U.S. https://t.co/kngVqCmUC1"]["My front office just got an upgrade - check it out. Best of luck to the @GoldenKnights this season. https://t.co/8PQeFc3aOy"]["Today the House passed my bill to fund VA Choice Program &amp; help ensure veterans have access to the care they need: https://t.co/e7Spp93hog"]["Proud to see the Senate pass my amendment to permanently repeal the Cadillac Tax with bipartisan support: https://t.co/Za2vQCRlPj"]["I just spoke on the #Senate floor about the need to permanently repeal the #CadillacTax. WATCH: https://t.co/xAJKiCQQtV"]["Joining w/ @BillCassidy and @LindseyGrahamSC to propose a conservative, workable alternative to Obamacare: https://t.co/g9oIPl4oXk"]["Pleased to see important lands legislation pass @NatResources, hope to see additional action in the House &amp; Senate: https://t.co/3xoqameefI"]["Really good news today, @SteveScalise has been discharged from the hospital. Wishing him a healthy, full recovery and the best to his family"]["My statement on why I'll vote to move forward and give us the chance to address the unworkable aspects of Obamacare: https://t.co/anpYBJ2ZFs"]["I welcome @fema's announcement of disaster relief for #Douglas County to help recover from wildfire damage: https://t.co/MnVMGawnhk"]["Proud to introduce comprehensive GI Bill legislation w/ @VAChair to benefit #NV’s veteran &amp; military community: https://t.co/Xtd3AxoMT6"]["In another positive step, the Senate Appropriations Committee advances spending bill without #YuccaMountain funding. https://t.co/qJjtXIVkcu"][".@SenJohnMcCain is a man of principle, integrity, and the father to a loving family. The entire country is with him in this fight."]["In an op-ed to @ElkoDaily, I discuss a bill signed into law to bring accountability to the VA for #NV’s veterans: https://t.co/luj4p4QpAD"]["At a @GOPSenFinance hearing, I spoke about the need for comprehensive #taxreform – more here: https://t.co/i5rnMXqvDB"]["Met w/ Ronald Smith an owner of 13 #NV @McDonalds franchises to discuss #taxreform that allows all businesses to expand, invest, and hire. https://t.co/iebhvOjj9L"]["Pleased a key Senate panel excluded #YuccaMountain funding from bill. A positive first step in a long fight: https://t.co/NIscbY7jqh"]["Welcome @fema's announcement of disaster relief for #Elko County due to wildfire damage: https://t.co/MU4Fded0Na"]["Honored to be in Sparks for this important day for vets &amp; to have worked w/ @GovSandoval &amp; the community to advance the N. #NV Veterans Home https://t.co/9r7IxmS4oF"]["Can't think of a better way to spend a Monday morning. I'm always humbled to spend time with Nevada's - and our country's - heroes. https://t.co/tTdjG25HH0"]["Presented @NVDeptVetSvcs's Wendy Simons a certificate recognizing her work making today's groundbreaking for a new veterans home a reality. https://t.co/bIw1sggXjk"]["(2/2) I also want to thank the federal, state, and local officials for their work to keep these communities in Northern #NV safe."]["(1/2) To our emergency responders in Northern #NV who time and again run to - not away from - danger, thank you."]["Headed out of @USTreasury after breakfast with Secretary Mnuchin. Great discussion about #taxreform to help #NV families &amp; businesses. https://t.co/Tg0eL5Tq5H"]["Always great to sit down with young #NV entrepreneurs from @NevadaDECA. Aria from Vegas gave me his business card, he’s networking already! https://t.co/OBN1sJaIak"]["Had a great meeting in Las Vegas last week w/ leaders in the healthcare community. I remain committed to finding solutions that work for #NV https://t.co/O4N7EDYLWx"]["Just finished another telephone town hall w/ #Washoe County constituents. Always appreciate everyone for coming on and providing feedback."]["Met w/ #NV representatives from @_ALLRISE_ to discuss their efforts to fight drug addiction across the country. https://t.co/93kuyenteu"]["Met w/ Washoe, Humboldt, &amp; Elko school administrators, discussed how we can best help kids in #NV classrooms &amp; thanked them for their work. https://t.co/Ga5R89GerI"]["Another reason to love #NV, no state income tax: https://t.co/YIxEfzL5Vq"]["Welcome home soldier and thank you for your service! https://t.co/ZKYHQ5q2jf"]["Congratulating Bernadette's mom, Liberty, on her retirement. Bernadette is a fellow USC alum - Go Trojans! https://t.co/d7vgMYUH2f"]["Another heat wave hitting the Vegas Valley this weekend. Stay safe and stay hydrated: https://t.co/FZm7cZzx5g"]["Thanks to all veterans who participated in today's roundtable in Reno. Bringing feedback back to DC to find solutions to help #NV's veterans https://t.co/1nc876hd9w"]["W/ my dog Noble in #Reno for Noah's Animal House Groundbreaking. I am proud that #NV is leading the way to help domestic violence victims. https://t.co/au38D670Y1"]["Monitoring the #NV wildfires closely. Grateful for our emergency responders who are working hard to mitigate damage. https://t.co/YvJuxwzMNS"]["Happy #FourthofJuly! Reminded of the sacrifices of our founders and proud to celebrate the greatest country on Earth. https://t.co/STQDbusGn8"]["Joining with my colleagues and asking @DHSgov to halt implementation of an Obama-era regulation: https://t.co/uwLnbVQXLN"]["Re-introduced legislation with @SenatorHeitkamp to name June National Post-Traumatic Stress Awareness Month https://t.co/qnp8pGSQrU"]["Introduced legislation that will protect education benefits #veterans receive for their service to our nation. More: https://t.co/UlIVZnPqpH"]["Worked w/ my colleagues to introduce commonsense legislation to encourage responsible water use https://t.co/DKqlYTioOB"]["Congratulations to Renown Health's Dr. Anthony Slonim on receiving the prestigious 2017 Secretary of Defense Employer Support Freedom Award! https://t.co/ikvmTB1PiQ"][".@SenateCommerce voted to advance @FAANews funding that has 12 of my proposals included to benefit #NV https://t.co/lWNtDAtZ9P"]["Spoke w/ the #NV Music Educators Assoc. about their goals for Nevada students &amp; how the Every Student Succeeds Act helps achieve them. https://t.co/ETpplzZdJU"]["Met w/ #NV representatives from @NAMICommunicate to discuss specific efforts to help Nevada individuals, families living with mental illness https://t.co/PoQkglHBqO"]["For #EnergyWeek I am touting my bill to simplify the permitting process for clean energy development on public lands https://t.co/tt00BZLCxT"]["#TBT @SEIA awarded me a Solar Champion Award for my work to bolster clean energy. Fighting to keep #NV a solar leader. #EnergyWeek https://t.co/eXAP4Otjvs"]["#NV remains a national leader in clean energy, producing over 23 percent of our energy from solar, wind, and geothermal. #EnergyWeek"]["Legislation passed by @HouseCommerce to revive #YuccaMountain is dead on arrival in the U.S. Senate. https://t.co/X8JLMR7T7U"]["Just finished another telephone town hall w/ constituents in #Clark County. Great discussion, appreciate feedback on critical issues at hand"]["Met with #NV members of @AmericanCancer to discuss health care reform, and to thank them for their mission to “free the world from cancer.” https://t.co/oEEVndaypA"]["A bill @MarkAmodeiNV and I introduced to improve economic development in #Pershing County is closer to becoming law https://t.co/ZgkU7PrLSj"]["I welcome @SecretaryZinke to #NV &amp; thank @Interior for record investment in PILT program, which is critical to NV: https://t.co/Ewz1uQLOXq"]["Applaud @POTUS for signing our important bipartisan bill to bring more #accountability to the #VA: https://t.co/VnnaAdlisP https://t.co/BLSSQ0QX0W"][".@DHSgov is providing @LVMPD w/ resources to combat terror threats. Appreciate #LVMPD for keeping Nevadans safe: https://t.co/lsvf8RAA1J"]["Legislation introduced today to reauthorize @FAANews funding has several of my proposals included to benefit #NV https://t.co/NjpY70dM36"]["With @SecretaryPerry testifying before @EnergyGOP, I am reiterating #NV’s strong opposition to #YuccaMountain https://t.co/pcoiXEOosE"]["Met with @ABCNevada to discuss their efforts in #NV for workforce development, job training, new construction, and economic development. https://t.co/mYTeBffYDy"]["Reading the health care bill. I encourage all Nevadans to do the same - you can find the bill's text here: https://t.co/dDWt5f8frp https://t.co/saBgJqaX9D"]["My statement on the U.S. Senate's draft health care reform bill: https://t.co/YiQLfRJutB"]["Just finished tonight's telephone town hall w/ constituents in #Carson City &amp; across rural #NV. Looking forward to doing more."]["I joined w/ several of my colleagues to demand answers from the VA about the Choice Program funding shortfall: https://t.co/JvlFyWaBHh"]["Restated my strong opposition to #YuccaMountain ahead of @SecretaryPerry’s testimony before a key Senate panel https://t.co/a4bXXiwmkB"]["Met Gloria, George &amp; Irma, @SEIU health care workers in Las Vegas to discuss health care reform. Grateful for their service to our community https://t.co/3P3EWtMcn8"]["Looking forward to getting my official @GoldenKnights gear at The Armory: https://t.co/qgXMHP7INe"]["Stay safe out there Nevada. Here are some tips from the @RedCross on Heat Wave Safety: https://t.co/BUARK9IwAh"]["I stand with #NV against #YuccaMountain and any idea that would store nuclear waste in our state: https://t.co/h528zDUZnY"]["Met with @tim_cook and talked #NV's tech boom and how we can promote American innovation &amp; competitiveness https://t.co/ks2S9vwrb4"]["Great meeting with @CoxComm to discuss how we can reduce barriers and expand access to rural broadband in #NV. https://t.co/PhGm4OopJe"]["Looking forward to Allegiant Air playing a larger role in #NV’s tourism and travel economy https://t.co/N5d2ybRhXC"]["Important News: @USDOL issues grant to #NV veterans organization that helps homeless veterans https://t.co/Cmkm9wFSBb"]["Sean Randles of Las Vegas was posthumously awarded the Carnegie Medal after he died trying to rescue a fellow hiker. https://t.co/JCOnwWaKH2"]["I am leading an effort to address doctor shortages in order to improve quality care for rural #NV communities https://t.co/bgjHlTaPfH"]["Horrified by the USS Fitzgerald tragedy. My heart goes out to those who lost loved ones - their bravery &amp; sacrifice will not be forgotten."]["I join #NV in mourning the loss of Bill Anton - a hero and champion for #veterans. Proud to have worked with him: https://t.co/plNKjrmGN8"]["The Senate passed legislation I supported to give local law enforcement the ability to protect our kids online: https://t.co/NjVS7TcbWy"]["I am leading a bipartisan effort to expand access to broadband internet for #NV’s rural communities https://t.co/I9LsjiQZkl"]["Tonight’s #CongressionalBaseballGame remains a symbol of how much more unites us as a nation than will ever divide us."]["#TBT to my floor speech highlighting how #YuccaMountain puts taxpayers on the hook: https://t.co/GqHfOfGajl"]["I reiterated to @HouseCommerce that #YuccaMountain is dead and I’ll continue to lead the fight to make sure of it: https://t.co/44dtWvY1ot"]["Congratulations to @Switch for opening a new data center in Las Vegas &amp; for their contributions to NV’s #tech sector https://t.co/wRFjRdLSM2"]["Great meeting w/ @NVHBA to talk about #TaxReform, flood insurance, and other important issues that affect the #NV housing market. https://t.co/AJSP7C7PoQ"]["Enjoyed answering questions from #NV students with @NRECANews about my work on energy &amp; bipartisan ways to help rural NV communities thrive https://t.co/NMPW3SzQBg"]["Met w/ #NV representatives from @USGLC to discuss national security and promoting America’s values on the global stage. https://t.co/BiQn0qjcmU"]["Thanks to Carrie from Pinecrest Academy in Henderson #NV for coming in to discuss Pinecrest's approach to ensuring student success https://t.co/TVqjeouqe6"]["As the @DeptVetAffairs considers cuts to a critical program, I am speaking out on behalf of #NV veterans. Watch: https://t.co/LPx8ORFtWD"][".@Sen_JoeManchin and I introduced legislation that will expand broadband access for rural communities in #NV. More: https://t.co/RIaIL77ibY"]["Praying for my friend @SteveScalise, Capitol Police, and staffers."]["House of Reps. passes bill I cosponsored to encourage #VAAccountability. It's now one step closer to becoming law: https://t.co/6pdJ6Zdxi5"]["I want to thank the Virga family for stopping by my office today during their visit to Washington, D.C. https://t.co/Vypa231SNH"]["Discussed the importance of renewable energy &amp; the role Nevada will continue to play in diversifying our energy portfolio w/ #Reno residents https://t.co/PWjrbXcwec"][".@SenCortezMasto and I raised concerns to @EPWGOP about @NRCgov noms who support #YuccaMountain. More: https://t.co/UQRzTIpHkD"]["I look forward to continue working w/Director Stovall on ways @DeptVetAffairs can better serve #NV #veterans: https://t.co/UVN6oqy2bZ"]["We must do even more to promote a level playing field so #NV can continue to be a leader in solar energy: https://t.co/ByYLXRXXE9"]["I am working to strengthen bipartisan legislation that will sanction Iran and hold the regime accountable. https://t.co/6SZ8fCMrsn"]["I am working with @DHSgov to ensure Las Vegas has the resources it needs to protect itself and the #NV economy https://t.co/oYoq6C90ci"]["I spoke with @SecPriceMD about the effects health care reform could have on the state of Nevada. Watch here: https://t.co/N849Ts0f2e"]["Last year, I recognized Donna’s outstanding work providing dependable health care to the state of Nevada. Great to see her again today. https://t.co/nprihddLyP"]["Met w/ #NV nurses representing @ANANursingWorld to discuss ways to increase access to quality care in rural &amp; under-served areas https://t.co/KWO7DCi6oL"][".@senjudiciary passed a bill I introduced with @JohnCornyn &amp; @SenBlumenthal to combat Internet crimes against kids: https://t.co/h40cGGmkPc"]["Good to see @SecretaryZinke is giving #NV a seat at the table as sage-grouse policy is reviewed: https://t.co/Z1L4RI6oha"][".@SenBillNelson and I introduced two pieces of legislation that will work to address doctor shortages in our states: https://t.co/WxvB9BCRtp"]["I along with @SenCortezMasto asked @SecElaineChao to visit #NV and see transportation projects, needs first-hand: https://t.co/cVFBuEL3q9"]["Just introduced a bipartisan bill w/@clairecmc &amp; @SenJoniErnst to better protect service members from exploitation: https://t.co/21TvIFtHct"]["Good meeting with Jim and Joe to discuss what we can do in Washington to remove barriers to help #NV businesses expand and hire. https://t.co/0JzuPs0uBY"]["#NV Cattleman Association met w/ me today to discuss issues affecting rural Nevada. I appreciate the industry &amp; what they do for our state. https://t.co/NrOghk2wvz"]["Just finished tonight's telephone town hall w/ constituents in #Washoe County. Great discussion as always, &amp; looking forward to doing more."]["Proud to see the Senate pass a bill that I cosponsored to provide more accountability to the VA: https://t.co/zjNpjFCw4W"][".@United to begin non-stop flights from @RenoAirport to @fly2ohare. Huge news for #NV travelers, tourism industry: https://t.co/CFCAN6IPQK"]["Pleased to see #nvleg approve resources for Northern NV State Veterans Home, keeping a promise to care for #veterans https://t.co/RfhX8RDjkF"]["Congratulations to Emily from Las Vegas #NV for receiving a @BorenAwards scholarship! I wish her the best of luck with her studies in Japan. https://t.co/XMVV9fxR3l"]["Met with @VAREPNational of Las Vegas #NV today to discuss home ownership &amp; economic opportunities for the military and veteran community. https://t.co/M5Cug26LKn"]["Always appreciate the opportunity to hear from Nevadans. Thanks to Helen from Las Vegas for your input on Yucca Mountain #NV https://t.co/s8YnBoxw2h"]["As the Administration talks #Infrastructure, high priority corridors like Interstate-11 will boost commerce &amp; trade and should be a priority"]["I am seeking answers for #NV on #YuccaMountain from the Dept. of @ENERGY deputy secretary nominee: https://t.co/ERc6tfyBti"]["I was humbled to travel to Normandy for #DDay’s 70th Anniversary. Today, we again reflect on the bravery &amp; sacrifices of those who fought. https://t.co/76RuVcCrfH"]["It’s time for the U.S. to fulfill its critical commitment &amp; move our embassy to Jerusalem #StandWithIsrael: https://t.co/RvGQn2wALU"]["I applaud the VA's move to update its Electronic Health Records system. A step toward more timely care for veterans https://t.co/3n8voayBOa"]["Proud to work with @JohnCornyn to get important legislation signed into law to prioritize hiring veterans into law enforcement."]["Congratulations to Devon Payne for receiving the national Goldwater Scholarship - 1st @UNLV recipient in 7 years: https://t.co/8s2xDCpvv3"]["#NV was one of the hardest hit by the housing crisis, so this is encouraging news: https://t.co/XlMDpy9Hdc"]["Too many veterans face homelessness &amp; that’s why I’m defending programs that help those who have taken care of us: https://t.co/HzAZZUHi5o"]["Always great to talk to NV WW2 veterans like 1st Sgt. Miller, a decorated veteran and Reno High School grad. Grateful for his service. https://t.co/yX0PE38NwG"]["Was humbled to be here at today's ceremony in Fernley to honor Bill. He was joined by his daughter &amp; grandson who are also proud #veterans. https://t.co/gGHbXmhMmT"]["Speaking at the Northern Nevada Veterans Memorial Cemetery honoring #MemorialDay https://t.co/IJZFIlPIWN"]["Honoring our fallen heroes at the Grand Army of the Republic Memorial Day Ceremony in Reno. https://t.co/MQBj5ZeoT8"]["This Memorial Day, we’re all reminded that we owe a debt that can never fully be repaid. https://t.co/Tdv8heK17L"]["My legislation paved the way for @RenoAirport to apply for public-private partnership:\nhttps://t.co/cn7D3qjiIL"]["The GAO’s report confirms what we in #NV already know: any effort to revive #YuccaMountain will be lengthy &amp; costly: https://t.co/EvINDD3dD9"]["NEWS: Important legislation clears Senate. Our bill will increase accountability at the @DeptVetAffairs. Release: https://t.co/oGXGqbbMQl"]["Heartwarming story about Nevadans honoring veterans who deserve love, recognition, and to never be forgotten https://t.co/wzXoYsHESb"]["I continue to fight in defense of critical #NV public land programs: https://t.co/6JpiWAH2Tm"]["#YuccaMountain puts taxpayers on the hook for billions of dollars: https://t.co/GqHfOfGajl"]["Great talking to Michael White, a #NV Pop Warner Scholar who balances good grades, community service, &amp; football. He makes it look easy. https://t.co/Rs6av6kyMa"]["I agree. Proud of what these young athletes are doing to make our community stronger: https://t.co/fjFsWNNAQ4"]["Just finished tonight's telephone town hall w/ constituents in #Clark County. Looking forward to doing more in the future."]["Proud that our legislation to demand accountability at the @DeptVetAffairs is closer to becoming law. Release: https://t.co/02Bysb1QyV"]["I want to thank Jennifer w/ @YouthBuildUSA Las Vegas for coming in to talk about her efforts to rebuild #NV communities through job training https://t.co/huXeCB678U"]["Met w/ #NV representatives of @HARDInews to discuss #taxreform and how to strengthen small businesses to help them grow and hire in NV https://t.co/G3V9RqrmA4"]["Great meeting with #NV Radiological Society to discuss important #healthcare legislation and their work to fight cancer in our state. https://t.co/ts0pp0n36A"]["Congratulations to the @ccsd_ell Student Success Advocates who are being recognized today for going above &amp; beyond to promote learning in NV"]["Positive step for Pershing County development bill. Will continue working w/@MarkAmodeiNV2 &amp; NV House members on it: https://t.co/hFsC81jgJr"]["The Administration’s budget is anti-Nevada; it revives #YuccaMountain &amp; cuts funding for critical #NV programs: https://t.co/NEh8rhFm3H"]["I want to thank #NV doctors w/ @aafp for coming in to discuss family medicine &amp; their efforts to keep Nevadans healthy. https://t.co/qMmGN0kJT2"]["Was honored to nominate Nevadan 1st Lt. Dylan Kay to @USAirForce Academy in '10. Proud to learn of his success w/ the 394th at Whiteman AFB https://t.co/V73COS7GL8"]["Congratulations Nevada Commission on POST, Academy Class 2017-01! Ceremony was in Carson City yesterday. https://t.co/2fbJrwUUte"]["Introduced a bill w/ @MarkWarner to help families track down a missing loved one: https://t.co/NEdhvDcBdE"]["Tourism is the backbone of #NV’s economy, and that’s why I fight for solutions for safe, efficient airports &amp; roads. https://t.co/seHnn9KRt7"]["Leaving briefing on Russia investigation with Deputy AG Rosenstein. It's important Nevadans get the answers they expect and deserve. https://t.co/lee3hir4Hp"]["Met w/ Marci, Acting #NV BLM Director and BLM Dep Director of Ops John Ruhs to discuss public lands concerns from people across the state. https://t.co/COJAD45FyN"]["Met with @NVARnevada today &amp; discussed how we can promote a healthy housing market in our state. Great group, thanks for having me. https://t.co/8Ngy5QLyNR"]["Storing nuclear waste in #YuccaMountain would endanger the entire country. Here’s why: https://t.co/JvxWwhQGWF"]["Congratulations on the grand opening of the Boys &amp; Girls Club of Winnemucca! https://t.co/vLK1r313xL"]["VIDEO: Today I spoke at a @VAChair hearing about ways to help the VA work better for #NV veterans. https://t.co/oGs1UTApNa"]["Proud to introduce the Back the Blue Act in support of #NV law enforcement. RELEASE: https://t.co/LULhV3crHG"]["It’s time to move the U.S. Embassy from Tel Aviv to #Israel’s Capital, Jerusalem. MORE: https://t.co/eAMT0OtwUG"]["Very glad to hear that my friend Senator Tillis is doing better. https://t.co/893SD0Bs2l"]["Met w/ NV representatives of @alsassociation to discuss research funding, rehab technologies, &amp; home health initiatives. https://t.co/4NnI5NpK9a"]["In honor of #PoliceWeek, I spoke on the Senate floor about Nevada's loss of North Las Vegas Detective Chad Parque: https://t.co/9wk0afjn0P"]["Met w/ Vinton Hawley from Pyramid Lake Paiute Tribe to discuss the #NV tribal community's concerns with the debate over health care reform. https://t.co/7cMbzCUrY4"]["I want to thank Rodney Mike from the Duckwater Shoshone Tribe for speaking with me to discuss infrastructure improvements for #NV roads. https://t.co/PMN3SYbZ1s"]["It’s time for action on #NoBudgetNoPay. RELEASE: https://t.co/4N3SnFoPPK"]["This #PoliceWeek, we pay tribute to those who lost their lives in the line of duty and are reminded of #NV law enforcement's many sacrifices https://t.co/Qb3qe4977c"]["I reintroduced bipartisan legislation to protect pregnant workers from workplace discrimination: https://t.co/5qfXnJrqW8"]["I introduced legislation to promote #accountability at the @DeptVetAffairs. #NV veterans deserve more: https://t.co/3pv4AedpwZ"]["Great to see Tommy at the Latin Chamber event today. Not surprised by his generosity to soon-to-be-college grads - what a gift. https://t.co/BB7wKlhqBM"]["ICYMI: The tunnel collapse in Washington State is a reminder that #NV cannot be the nation’s nuclear waste dump. https://t.co/Pd65e6g9Oy"]["#NV rheumatologists from @ACRheum met w/ me to discuss medical research &amp; the healthcare workforce. Appreciate their work for our state. https://t.co/KdTSCkVMuF"]["Met w/ #NV #outdoorsmen from @SafariClubIntl to discuss safe, fair, and efficient management of our state’s lands. https://t.co/l24i8ojE1d"]["Great News: @Apple is expanding its data center in #Reno which will create hundreds of jobs. https://t.co/EINN3hL9Y9"]["Tourism contributed $2.1 billion to the Southern #NV economy in 2016. It’s why I keep fighting to support NV tourism https://t.co/Tr14scnSLQ"]["My good friend @senorrinhatch stopped by today to celebrate my birthday. Thanks for the cake Senator! https://t.co/vcbXXBMXjq"]["Thanks to @CloseUp_DC for bringing #NV students from Pyramid Lake High School to meet w/ me in DC. Great discussion about education in #NV. https://t.co/LGruu9R7ig"]["VIDEO: Today on the Senate floor I discussed why #YuccaMountain could threaten the Las Vegas economy. https://t.co/vpYE72epaX"]["Met w/ #NV representatives from @ADL_National and discussed our shared goal of combating hate across this country. https://t.co/ixHis3hocG"]["Veterans in #Ely #NV received positive news yesterday, but we have work to do to ensure a permanent solution. More: https://t.co/PTeF7wITXW"]["Spoke at the @APTA_info Conference in Reno, #NV. Appreciate all of their work to ensure our transit system keeps pace with Nevada's growth. https://t.co/ZNEYggfQwk"]["Working w/ @SenCortezMasto &amp; local #NV officials on legislation to bolster conservation &amp; economic development https://t.co/DDNzoyigj0"]["Grateful to again attend the James Hoff Memorial honoring the heroism of #NV law enforcement &amp; all of those who made the ultimate sacrifice. https://t.co/dbVySSvo2p"]["Great to see @TeslaMotors on Capitol Hill today. Look forward to seeing more from them, especially in #NV. https://t.co/3aDp0rDkVr"]["Met w/ @NatUrbanLeague’s Clark County organization to discuss #jobs, #infrastructure, #education, and how we can support all Nevadans. https://t.co/ulADLrKlj1"]["My statement on why I voted no on the spending deal: https://t.co/SQ8tnlDIYc #NoBudgetNoPay"]["Just filed #NoBudgetNoPay as an amendment to spending bill. If Congress doesn’t do its job, we shouldn’t be paid. https://t.co/IZDGwXoelc"]["Met w/ @unevadareno President Marc Johnson to discuss their efforts to bolster #NV's competitiveness. Appreciate everything they do for #NV. https://t.co/VoCE1ZvI9f"]["Small businesses are a pillar of #NV's economy &amp; support 450,000+ jobs in our state. Their success makes #NV stronger. #SmallBusinessWeek https://t.co/qkXFhGOLGY"]["Met w/Jaimie from #Reno and discussed my efforts to protect pregnant workers from workplace discrimination &amp; address postpartum depression. https://t.co/qlNZah9Z4K"]["Former Sen. Mike McGinness and the late Sen. Debbie Smith were inducted into the #NV Senate Hall of Fame. Grateful for their service. #nvleg https://t.co/mGQUZ5ANV7"]["Met w/ @BreakthruVegas today to discuss #TaxReform and how we can limit DC intrusion so they can grow and hire. https://t.co/uRHNrSpsvi"]["Met w/ Women's Mining Coalition of #NV. We discussed permitting delays, public lands issues, &amp; regulatory burdens that limit their success. https://t.co/NeKdKVnVFx"]["Heard from @NVArchiveRecord and the role they play in certifications for #manufacturing &amp; closing the skills gap for 21st century jobs. https://t.co/13pyin0XJ7"]["I’m fighting to permanently authorize #PILT, a critical public lands program that helps local governments across NV: https://t.co/2W9B2RvLbe"]["Congratulations to Rob Lugg and Ramona Sanchez for grabbing 1st place at the @RenoRiverRun\nhttps://t.co/bzZBUUAg28 #HomeMeansNevada"]["We will never forget Robert's passion, personality, &amp; service to #NV. My thoughts and prayers go out to his family. https://t.co/hmCX5Dj0YE"]["#NV’s mining industry is a critical part of our economy. I will continue to defend it. RELEASE: https://t.co/zahdDtNr4x"]["Wishing new @UNLVathletics Director Desiree Reed-Francois the best of luck at @UNLV! https://t.co/rFia5PMXmd #HomeMeansNevada"][".@POTUS opening Office of Accountability and Whistleblower Protection at the @DeptVetAffairs is a positive step forward for #NV #veterans"]["Met w/ the #NV Orthopedic Society about important reforms to promote access to care and support medical professionals. https://t.co/AYQ1tQNKAo"]["Great meeting w/ Fran Ford Jr. whose business is based out of #Sparks #NV. We talked about tax reform and how we can help grow jobs. https://t.co/m7jG71ione"]["I am telling @SecretaryPerry that #NV will not be our nation’s nuclear waste dump: https://t.co/CSss4l9EV4 https://t.co/5TRE80zHeH"]["Job well done to @CimarrOnSpartan for placing 3rd overall in the Robotics World Championship. Nevada is proud of their success!"]["Definitely a must read if you are visiting the @CityofReno anytime soon: https://t.co/9gckW9f1p5"]["Met w/ Gina from @impact360sports. We discussed important topics to #NV's sports &amp; wellness industries and promoting a healthier state. https://t.co/y3bf2AbXWA"]["Great to hear from Dale and Russell w/ @UNLV. We discussed American innovation, manufacturing for optical science, and infrastructure. https://t.co/UMMiZxyXZK"]["Proud of this #NV couple &amp; their selfless act to honor our veterans through @HonorFlightNV. Please read/watch &amp; RT: https://t.co/lQmL7rUGTA"]["WATCH: I testified today on behalf of Nevadans who reject #Yucca Mountain. I’m leading their fight. https://t.co/sdJDoYfPFT"]["I am about to testify against a failed proposal to revive #Yucca Mountain. I will continue to tell those in DC that #NV remains a \"NO.\""][".@RTCWashoe explains why the @CityofReno is the place to be for APTA’s Bus &amp; Paratransit Conference &amp; Roadeo: https://t.co/4rJLCJzGC2"]["I am working w/ @RandPaul on legislation to limit DC intrusion &amp; further empower #NV to protect its own ecosystem https://t.co/dSGjYRUZJP"]["I want to thank @NAEMT_ , @REMSAEMS as well as the @CityofReno Fire Dept. for meeting with me today &amp; all they do 24/7 to keep #NV safe! https://t.co/jHsgQmRGCE"]["In order to promote jobs &amp; travel across #NV, I am leaning on @USDOT to include #I11 in any infrastructure package: https://t.co/0z9ihWme1N"]["Met w/ @USDOL nominee Alexander Acosta. Great discussion on addressing burdensome overtime rule &amp; creating a true 21st century workforce. https://t.co/jjaFxrx5nR"]["Met w/ #NV Rural Electric Assoc. to discuss energy policies &amp; environmental regulations that impact our state's rural electric utilities. https://t.co/P0esYjiTcJ"]["Joining w/ #Israel in honoring #HolocaustRemembranceDay. We must never forget the millions of Jewish lives lost during the Holocaust."]["ICYMI: @GovSandoval and I want alternatives to #Yucca that work for #NV https://t.co/olRPsxhLcC"]["It’s not just the @Raiders. Great read about the possibility that #NV hosts a @MLB team! https://t.co/wYxaj1pru0"]["Appreciated the opportunity to speak and do Q&amp;A at @Valley_Electric's annual meeting. Discussed energy and broadband access. https://t.co/NZqqa50ifI"]["Interested in attending a U.S. Service Academy? Applications for Nevadans seeking a nomination now available here: https://t.co/GZAM3VV3h4"]["Great to visit with people in Pahrump, #NV and talk issues - like telemedicine and broadband access - that are important to the community. https://t.co/nctIvIBZyw"]["Had the chance to visit with so many #NV heroes today. #BattleBorn https://t.co/zqNh5s5wxt"]["Thanks to Desert View Hospital for the invitation to a ribbon cutting and all they do to improve #NV's tele-health services. https://t.co/7tGtPgxpP2"]["Touring @Valley_Electric in #Pahrump #NV, learning about their important work to bolster cyber security and protect our electric grid. https://t.co/pJNrZY8pgo"]["Interested in attending a U.S. Service Academy? Applications for Nevadans seeking a nomination now available here: https://t.co/GZAM3VDrSu"]["As Nevadans file on #TaxDay, it's a reminder that we need a fairer, simpler tax code for families &amp; small businesses. Time for #TaxReform!"]["First Tesla now @Google. #NV continues to show the country we are a place for tech sector and job growth! https://t.co/LdG6ZbfGYj"]["Whether it's fighting for NV vets, opposing #Yucca, or defending important public lands programs, I'm making sure #NV voices are heard (2/2)"]["Honored to address the #NV Legislature today and talk about my efforts to fight on behalf of Nevadans. (1/2) https://t.co/yX1oBdYyQj"]["Have a Happy and blessed Easter! https://t.co/oPU3zlFcyB"]["@GovSandoval and @NevadaAG have my support in the fight against #YuccaMountain. https://t.co/ZNGlSH9gsP"][".@United Airlines rightfully apologized, but we need to know more. I’m calling for answers to protect consumers. https://t.co/OgcmGPqAcj"]["I am asking my colleagues to abandon #Yucca proposal in favor of long-term solutions: https://t.co/pqeZjYjb3N"]["Good luck to the @Aces in tonight’s home opener! https://t.co/sCgTXkGBl9"]["Judge Neil Gorsuch has been sworn in as a #SCOTUS justice. Proud to see a fellow Westerner join the nation's highest court. https://t.co/uQy8oTTlRv"]["Today, I voted to #ConfirmGorsuch to #SCOTUS. My statement: https://t.co/lOip0gfR1K"]["Our delegation is asking the @NCAA: Why not #NV? https://t.co/XvkhWXxohw"]["Don Rickles took comedy to a different level - making Nevadans and people everywhere laugh for more than half a century. He'll be missed."]["Met w/ #NV job creators from @AEDSocial to discuss tax reform, #infrastructure, &amp; what we can do to close the skills gap in the industry. https://t.co/84xMQslj2F"]["ICYMI: Why I am voting to #ConfirmGorsuch this week: https://t.co/Dy6LzPlp79"]["Proud to meet w/ these #NV heroes from @MilitaryOfficers to discuss important issues such as the elimination of the #WidowsTax. https://t.co/v4XxauNnsh"]["Talked w/ Operating Engineers Local 3, discussed importance of infrastructure investment like #I11 &amp; their work building safe roads for #NV https://t.co/xGjkI5r826"]["Pleasure to meet w/ #NV representatives from @LungAssociation. Inspired by June’s story about being a 4 time cancer survivor. https://t.co/NsR0czuYBR"]["Great to have @UNevadaReno's School of Community Health Sciences in today. Thanks for coming in! https://t.co/NPfoVrdNyc"]["Met w/ #NV’s Dr. Paul Tomasic. We discussed legislation to address diabetes &amp; other initiatives to improve the health of Nevadans. @TheAACE https://t.co/oy3vdyuUpa"]["I am working to defend an important #NV public lands program &amp; the economic development it provides for our state: https://t.co/ZLDpVaVVCl"]["Discussed the importance of tourism w/ @renotahoe and all #RenoTahoe has to offer as an outdoor destination with activities for every season https://t.co/XrjAD4arvl"]["On #EqualPayDay I restate support for a fair workplace, equal pay &amp; my bill to protect employees from discrimination https://t.co/qYCBN9YKSJ"]["Met w/ #NV representatives from @SchoolLunch to discuss lunch and breakfast programs as well as healthy eating for kids in our schools. https://t.co/OmZZQ2o2eM"]["We’re excited for the #Raiders move to #LasVegas. If only I can get my hands on a @GoldenKnights banner. https://t.co/IudXjTHAYH"]["(2/2) My office remains in close contact w/ the VA &amp; stands ready to assist veterans any way we can. Contact us at https://t.co/C2qgPC4oj9"]["(1/2) Thanks to the many #NV veterans who attended the VA forum in Ely, and thanks to Director Stoval and her staff for answering questions https://t.co/vADCyeeiWU"]["Working with Democrats and Republicans to get results for #NV’s veterans. Read more here: https://t.co/YT1TUE2o2S"]["I am teaming up w/ @PattyMurray on legislation to strengthen health care access &amp; quality for #NV's women veterans https://t.co/CQ8sZXVKwe"]["Heard John Ruhs will become @BLMNational Deputy Dir. Tough to lose him @blmnv but pleased some1 w/ #NV exp. will serve in this important job"]["Had a busy week meeting with many Nevadans that make our state a great place to live &amp; work. Grateful for the discussions &amp; focus on #NV. https://t.co/XC8NaOqxqb"]["Proud to work w/ colleagues and lead #bipartisan effort to protect #NV children who use the Internet. More: https://t.co/c2ETHUpA6N"]["ICYMI: My floor speech from earlier this week on why I’ll fight the #Yucca Mountain proposal: https://t.co/ffV69FaADg"]["I am asking @DHSgov to strengthen travel security, not weaken it, because #NV tourism depends on safe travel. More: https://t.co/ET3s0ngZL6"]["Met with the @AmDiabetesAssn today and discussed critical issues such as funding, research, and prevention efforts for diabetes. https://t.co/P03MsUkIPt"]["Just finished tonight's telephone town hall w/ constituents in #Washoe County. Looking forward to doing more in the future."]["Great to sit down w/ @UNRExtension &amp; hear about how they are getting involved, what they're raising, &amp; how they give back to their community https://t.co/zMUbmNYfos"]["Met w/ #NV ranchers to discuss important #rural topics such sage grouse, wild horses, the cattle market &amp; public lands. https://t.co/UzAfFJocTJ"]["Today I spoke on the Senate floor about why Nevadans reject the failed #Yucca strategy &amp; my work to fight it. WATCH: https://t.co/ffV69FaADg"]["Met w/ the @Nevada_RA and discussed issues affecting their industry. #NV’s restaurants provide jobs &amp; are critical to our state's economy. https://t.co/2j1Ng9WnUn"]["Great discussing the @Raiders, travel security, &amp; tourism w/ leaders from @LVCVA, @LASairport, @NVTourism, &amp; @CaesarsEnt. https://t.co/0fTgP3Pp5c"]["Always great meeting w/ #NV Elementary Schools Principal Association. I appreciate their work in helping our kids succeed. https://t.co/DWOHSu4QPr"]["Met w/ #NV @AIPAC members about a strong US-Israel partnership, standing up to an emboldened Iran, &amp; fighting anti-Israel actions at the UN. https://t.co/vaaF00KyV7"]["Was able talk w/ Bart Patterson, Pres. of @NevadaState. Discussed importance of workforce development &amp; what it means for #NV’s future. https://t.co/XcC7ZaTqo4"]["Good to meet with @EpilepsyFdn of #NV and talk about the importance of raising awareness and ensuring patients’ health care needs are met https://t.co/kw3Fci5OWi"]["It was nice to catch up with Dan Hamilton, Dean of @UNLVLaw. They recently moved up 16 spots in U.S. News &amp; World Report Ranking. Congrats! https://t.co/SXuT4RtHc5"]["Heard from #NV representatives of @AHIMAResources. We discussed health information management and the importance of improving patient care. https://t.co/GLx3JTRd1F"][".@SenCortezMasto and myself announced new disaster relief funds for #NV in response to Feb. storms. RELEASE: https://t.co/nOK3OcHyD7"]["My statement on @SecretaryPerry’s visit to #Yucca Mountain and my opposition to their new proposal: https://t.co/il8z2dlso9"]["NEWS: Pleased to hear the #Raiders are coming to @CityOfLasVegas. This is a great opportunity for economic development &amp; to show off #NV."]["After years of delay and bipartisan support, the Keystone pipeline, a project that promotes energy security, can finally move forward."]["(2/2) I am hopeful we can see action on my legislation to move the U.S. Embassy to #Jerusalem"]["(1/2) Voted to confirm David Friedman as U.S. Ambassador to #Israel. Look forward to working together to protect one of our strongest allies"]["We can reduce barriers to airport &amp; infrastructure construction. Together, we can promote #NV #tourism. VIDEO: https://t.co/izKe0fdG2z"]["Met w/ #NV Water Works Association to discuss rural water infrastructure &amp; the impact of recent Northern Nevada weather on the water supply. https://t.co/F2VU4SrbI4"]["Spoke w/ #NV high school students participating in @UNLVUpwardBound about the important role higher ed. plays in our state’s future. https://t.co/KSASbavuyw"]["Discussed health care reform w/ @Russell_Lehmann, an advocate for those w/ disabilities. Great to see his dedication to the community. https://t.co/ztIbk0RBHN"]["VIDEO: I spoke up for #NV veterans in Ely &amp; Pahrump &amp; #BlueWaterNavy vets. We must make good on our promises to them https://t.co/fhjHsXphXC"]["Great discussing airport infrastructure, drones, &amp; exciting @renotahoe economic development opportunities w/ @RenoAirport’s Marily &amp; Dean. https://t.co/69kS5hqcw7"]["Just finished tonight's telephone town hall w/ constituents in #CarsonCity and rural #NV. Looking forward to doing more in the future."]["Was able to hear from Barbara with @TahoeRCD. We discussed #LakeTahoe restoration and the ongoing issue of health care reform. https://t.co/dM5cXYGD9A"]["Enjoyed hearing from the Cultural Alliance of #NV about the arts as well as the rich cultural diversity of our great state. https://t.co/3eZlrS9kPV"]["Met w/ @e2org business leaders to talk about developing clean energy &amp; the jobs it can produce for #NV. https://t.co/BBQRdpu7Gs"]["Great discussion w/ Charlene, CEO of Montevista Hospital in #LasVegas. We discussed addressing mental health needs in #NV. https://t.co/Tuw2EzTcDZ"]["After harassment reports, I called on the VA to ensure female vets &amp; service members can access care at Vet Centers: https://t.co/6xVS6QFczE"]["ICYMI: I will fight new #Yucca proposal until the bitter end https://t.co/icEGoiV8Ep"]["My letter w/ @SenCortezMasto stating our opposition to new #Yucca Mountain proposal: https://t.co/eIDGxFlvhU"]["My statement on reckless #Yucca Mountain proposal: \nhttps://t.co/FFwRGU360l"]["Glad I was able to get a photo with these great #NV high school students participating in @AVID4College. Hope they enjoy their time in D.C. https://t.co/AeKQWoYOzF"]["Just finished tonight's telephone town hall with #ClarkCounty #NV constituents. Looking forward to doing more in the future."]["Good discussion w/ #NV doctors from American College of Obstetricians &amp; Gynecologists about protecting women’s access to health care. https://t.co/w9S5i4ikxr"]["Happy to meet with Dr. Kim Metcalf, the Dean of @unlvcoe. Grateful for all our education faculty who strive to make #NV better. https://t.co/7JlqJC8v0M"]["Good discussion earlier today w/ #NV League of Cities &amp; Municipalities, talking about critical issues such as I-11 &amp; economic development. https://t.co/JdFE1J9C8Y"]["VIDEO: My discussion w/ @fema about #NV flooding &amp; the importance of our state getting the help it needs. https://t.co/phGieB5iI9"]["Great to sit down w/ @NevadaACTE &amp; discuss their important work to create a skilled workforce to benefit #NV for years to come. https://t.co/Cqh3BCQg8J"]["Teamed up w/ @SenCortezMasto to have @POTUS &amp; @USACEHQ ensure #NV sees disaster relief: https://t.co/YLRV8sAIP3"]["Honored to receive the @AEEnet Advanced Energy Champion award for my work to promote #cleanenergy and innovative transportation solutions. https://t.co/26aK48VkU8"]["Three of my #bipartisan bills that help #NV small businesses, investors &amp; taxpayers made it through committee: https://t.co/5IRQVeImau"]["Great discussing advanced manufacturing w/ my friend from Carson City Sandy Haslem. @NevadaIE is doing great work to support #NV small biz https://t.co/9eBMCmryLq"]["Today I sat down w/ #NV representatives from @HRC. We talked about my commitment to stopping discrimination &amp; standing up for all Americans. https://t.co/5mDN6SOEe7"]["Today I talked about a critical rural #NV issue: expanding access to broadband internet. Watch the video here: https://t.co/rJB11Skblx"]["Great meeting two of our own from #NV, Emmanuel Berrelleza and Lauren Lim, participating in the @SenateYouth program. #USSYP2017 https://t.co/FSYxD52i49"]["Heard from Deirdre Flood with the Washoe Tribe of #NV and California. We discussed how economic development is critical for #NV’s Tribes. https://t.co/HN0hEQgRED"]["My staff in #Reno recently sat down w/ @SafeEmbrace. We discussed my support for #VAWA &amp; how we can better help victims of domestic violence https://t.co/0YZuEpgngo"]["Glad to sit down w/ @TUNAdmissions Dean John Dougherty about the need for a strong health care workforce. https://t.co/W4lGRWpwni"]["Re-introduced flood insurance legislation w/ @SenatorTester to protect #NV consumers &amp; develop private market. More: https://t.co/weqpQXeQiv"]["Honored to speak w/ these heroes from #NV’s @PVA1946 Chapter. Our veterans deserve greater access to care &amp; accountability from the #VA. https://t.co/ekHTu92gKW"]["Met w/ the Professional Fire Fighters of #NV today. We discussed the critical work they do in the state to keep Nevadans safe. https://t.co/jvWhccMAR4"]["Prices in southern #NV’s housing market are looking up: https://t.co/LTZie2R3hc"]["The Vegas @GoldenKnights signed their first player. Great news for #NV and #NHL’s newest franchise. https://t.co/FoeJ89zMNg"]["My letter w/ @MartinHeinrich calling for hearings on all threats and attacks to faith-based community centers: https://t.co/397zLtdk4m"]["Always great to talk to the @ufc.  Can’t wait for the next fight! https://t.co/VlaiT7qeAG"]["Was able to sit down with folks from Storey County, #NV today. We talked about local issues and how we can help! https://t.co/aMYI9JFaUK"]["Was able to hear from #NV Association of Counties. Discussed important issues like health care, public lands, and protecting local gov’t. https://t.co/TBMyeH6pV6"]["Met w/ @NVFarmBureau &amp; talked about the importance of public input on public lands bills. Glad to stand with #NV farmers! https://t.co/gfu0UF1Kto"]["My letter to @POTUS asking him to support programs authorized by the Violence Against Women Act in next budget: https://t.co/HaGmL79wWY"]["Sat down w/ @POTUS’s pick for ambassador to our key ally #Israel, David Friedman. Talked about my bill to move embassy to #Jerusalem. https://t.co/I0ZqGL9eD4"]["Recently, I teamed up w/ @MartinHeinrich on legislation to protect Faith-Based Community Centers. https://t.co/ZT20Mfgr8t"]["ICYMI: My statement on last night’s @POTUS Address to Congress: https://t.co/6NWaasvvWQ"]["Grabbing dinner with @GovSandoval before President Trump's first #jointsession address to #Congress. https://t.co/y6lSmwAkEP"][".@POTUS sent the @EPA back to the drawing board on the overbearing #WOTUS rule. Big step towards common-sense regulation &amp; #NV water rights."][".@POTUS signed my bipartisan legislation helping women with opportunities in #science, #tech, #engineering, &amp; #math: https://t.co/RiaLS2TE2d"]["My letter demanding timely and quality access to care for Ely #Veterans: https://t.co/3jePzdfvnJ"]["Great to strategize w/new County Commissioner Robert McDougal on their land bill to create #NV jobs and improve conservation efforts https://t.co/etr0k0f5gg"]["Proud to have sponsored this bill in the #Senate https://t.co/DOpQhAs2RA"]["My staff will be hosting mobile office hours tomorrow at the East Las Vegas Community Center from 2pm-5pm. Come by to see how we can help!"]["Great News: @RenoAirport now offering non-stop flights to Chicago w/ @united. Big development for #NV tourism &amp; travel. #BattleBorn"][".@EPA made right decision to extend time for #NV utility &amp; mining companies to review new rule before taking effect: https://t.co/7wgxhw5Ozd"]["ICYMI: Earlier this week, I toured the southern border, met with border agents &amp; discussed border security. More: https://t.co/952Gn9LRFj"]["Getting a bird's eye view of our nation’s southern border. Ensuring a safe and secure border has always been a priority of mine. https://t.co/TFQnp1jQFN"]["Took a trip to our southern border w/ Sen. @JohnCornyn. Great opportunity to hear from border agents &amp; discuss border security. https://t.co/7tGaBttrtJ"]["Fantastic news that @POTUS made @fema flooding funds available for #NV."]["Teamed up w/ @amyklobuchar to pass bills helping women with opportunities in #science, #tech, #engineering, &amp; #math. https://t.co/uRK3Tuda15"]["Recently re-introduced legislation to help #Pershing promote conservation, economic development &amp; defend outdoorsmen https://t.co/4AmyZassY1"]["VIDEO: At @GOPSenFinance, discussed protections for #NV’s seniors &amp; low-income families as we work to #ConfirmVerma: https://t.co/C9kHdVW37x"]["Great to see Apex in @CNLV emerging as a hub for R&amp;D/manufacturing of innovative mobility &amp; transportation systems https://t.co/4md4nkSyVG"]["Today, the world's largest data center building opened in northern #NV. Welcome online Tahoe Reno 1. cc: @SUPERNAP. https://t.co/8pfam6jm7A"]["Welcome back Israeli PM @Netanyahu. Looking forward to improving US-Israel relations with my Jerusalem embassy bill. https://t.co/XAXJaFM2WK"]["Proud to receive the @SEIA Solar Champion Award for my work to bolster clean energy development. Fighting to keep #NV a solar leader. https://t.co/K7CYHWSfND"]["Spoke w/ the Energy Storage Policy Forum, praised #NV’s commitment to leading in clean energy and what that means for our economy. https://t.co/D9hgqtykA3"]["VIDEO: Spoke to @federalreserve Chair Yellen about impact possible rate hikes will have on #NV’s economy: https://t.co/MGIIX61uWy"]["Today, I met with the Fallon Paiute Shoshone Tribe. We talked about the importance of human services funding from @USIndianAffairs https://t.co/NyUlskaqev"]["My letter w/ @SenCortezMasto &amp; @MarkAmodeiNV2 asking @POTUS to quickly honor State of Emergency, get help to #NV: https://t.co/rr71L5iqLw"]["Congratulations to #Reno, #NV’s Davidson Academy on their win in the Regional Science Bowl, now heading to DC for national finals."]["Was able to attend a meeting with local officials to receive the latest updates on the Elko County flood. https://t.co/10RCQhtWc7"]["The #tourism industry is critical to #NV’s economy. I look forward to being a Co-chair for the Senate Tourism Caucus https://t.co/2O6qzqPGIl"]["We are monitoring the situation in #Elko, #NV. I continue to receive updates &amp; will be in touch with local officials throughout the day."]["Heard from @unitehere’s D Taylor today. We discussed repeal of the #CadillacTax &amp; protecting healthcare for all Nevadans. https://t.co/imD8xqxkGn"]["With a new Secretary at the @usedgov, I sat down w/ @NEA members to discuss crucial education initiatives that put #NV students first. https://t.co/UPzOGQMS1W"]["Enjoyed hosting a town hall by telephone tonight with constituents from #ClarkCounty #NV. Looking forward to completing more in the future."]["Met w/ fellow westerner Judge Gorsuch. Talked #Constitution as well as protecting our freedom &amp; values. #SCOTUS https://t.co/eKQCtRM1La"]["Check out my #CadillacTax speech on the #Senate floor today. It must be repealed to help #NV's middle-class. WATCH: https://t.co/u3nYVBBNwi"]["I re-introduced #bipartisan P3 legislation promoting #NV infrastructure improvements for our public buildings. More: https://t.co/T0K7AfNxlz"]["Today on the Senate floor, I will be talking about repealing the #CadillacTax. RT if you agree that affordable care starts with lower taxes. https://t.co/6EbbI2slU3"]["Good luck to both the Pack and Runnin’ Rebels in tonight’s #NV showdown. #PackPride  #UNLVmbb https://t.co/dM6VLnWN67"]["It was important to hear from so many Nevadans today about what we can do to help &amp; improve #NV! #infrastructure #safety #healthcare https://t.co/bKhKtD5sYV"]["Pleased the House passed bill HJRES 44 to roll back BLM rule restricting local #NV input in federal land planning. I will push it in Senate."]["Just spoke on the importance of rural health care access. Heard from these Nevadans about issues in #NV &amp; how we can help all in our state: https://t.co/iDw8cy2d0N"]["Great hearing about N. #NV transportation w/ @RTCWashoe @BobLuceyNV - Excited about the recent 4th St/Prater Way BRT groundbreaking https://t.co/3xneZz5t1N"]["Today I sat down w/ @LVMPD’s Sheriff Joe Lombardo &amp; listened to his concerns on #NV law enforcement &amp; public safety. Our cops do great work! https://t.co/Z8cntd6VQv"]["Great article about @gbcnevada &amp; its nursing program. Students, faculty, &amp; community producing results for #NV. https://t.co/q6UX9Vjl4o"]["Proud to lead @GOPSenFinance subcommittee to focus on #NV infrastructure, mineral production, energy-tech job growth https://t.co/ACqgmpjXKL"]["I believe #NV should choose how to improve its sage-grouse population while protecting economic stability. MORE: https://t.co/ZM8c7VAG3r"]["My office has asked the Senate SAA to look into this matter further."]["My office has received confirmation from the SAA this is the only authentic voicemail message you should hear when calling my DC office."]["Despite reports, here’s the voicemail message you should receive when you call my DC office after-hours: https://t.co/I1x14k9moF."]["Senate Sergeant at Arms still working to address issues through the entire Senate voicemail system. https://t.co/t70acpBC2s"]["Ever lose service in #NV? You'll like our ltr w/ @SenatorWicker &amp; @Sen_JoeManchin to @FCC on rural mobile broadband https://t.co/g7VXZljRk4"]["Sat down with Labor Department nom. @AndyPuzder &amp; talked about what we can do to further grow #NV economy w/ good-paying jobs for families. https://t.co/0hYnQU3jD5"]["If you have a #vets, social security, immig. or any other case work issue, you can also email our office here: https://t.co/63hNAdZMaf"]["We are experiencing heavy call volumes in all our offices. Staff is answering as many as possible. Please continue calling to get through."]["This AM, I had a positive meeting w/ @Linda_McMahon to discuss ways to ensure Latinos &amp; women play a bigger role in #NV small businesses. https://t.co/1UoXQXp7Pj"]["ICYMI: Heller Discusses Expanded Care &amp; Accountability for #NV Vets w/ @DeptVetAffairs nom. Dr. Shulkin https://t.co/fXRXd9v67o"]["My statement on DeVos: https://t.co/UoEjAT8UgH"]["Today, I met w/ Ed. Sec. nom @BetsyDeVos. Discussed improving #NV’s school system for all students and increasing parental engagement. https://t.co/9hUCRulGzm"]["It was great to introduce @UNLV’s Dr. Paul Oh to @usedgov nom. @BetsyDeVos in my office this morning. https://t.co/o9ACY7s6Xv"]["Great to discuss Colorado River issues and the #LV Valley’s water security with @SNWA_H20 GM John Entsminger https://t.co/2l25h3yrzL"]["Yesterday, I met w/ several #NV @NFB_voice members to discuss educational &amp; economic opportunities for the blind. Thanks for stopping by! https://t.co/hGsWdL9IMS"]["My statement on @POTUS’s #SCOTUS Nominee: https://t.co/iqik5mZ60g"]["Met w/ @DeptVetAffairs Nom to discuss #NV #Vets, rural care, Choice Act, &amp; VA disability claims backlog #keepthepromise https://t.co/myPCdagav4"]["Signed ltr to @POTUS saying any infrastructure plan should include better broadband access for rural states like #NV https://t.co/43tI2D1puD"]["Glad to have met w/ OMB nominee @RepMickMulvaney today about the need to cut excessive red tape &amp; wasteful spending coming from DC. https://t.co/Nz9OG5M43J"]["Happy to hear @GeorgeHWBush has been discharged from the hospital. Wishing him a quick recovery surrounded by his family &amp; loved ones! #USA"]["religious ban. The use of an overly broad executive order is not the way to strengthen national security. (3/4)"]["That's why I support the thorough vetting of individuals entering our country. However, I am deeply troubled by the appearance of (2/4)"]["I share the President's desire to protect our nation from harm.I agree that better vetting and border protection measures are necessary(1/4)"]["This week, I again met with @stevenmnuchin1 to discuss #NV foreclosures. Pleased to receive the answers I was searching for to my questions. https://t.co/XmcMq5AZol"][".@AaronDFordNV took your @JasonFrierson &amp; @GovSandoval concerns directly to @HHSGov nom. Let's work together for NV: https://t.co/DfSuWfy1bD"]["My @FCC bill w/@SenBrianSchatz creates one comprehensive communications report &amp; is a step closer to a final vote: https://t.co/UY7HvesFyz"]["Today, @GovSandoval &amp; I spent some time in Washington highlighting #NV issues that need our attention most. #BattleBorn https://t.co/eHLBNMefw9"]["Repealing the #CadillacTax will bring relief to 1.3M Nevadans. View the Qs I asked @HHSgov nom. Tom Price today: https://t.co/fzCxdAEupI"]["Looking forward to today's follow up meeting with Treasury Secretary nominee Mnuchin to discuss the issue of #NV foreclosures."]["Excited to work w/ @AjitPaiFCC as Chairman to improve rural broadband, bring accountability to FCC, and ensure innovation thrives in #NV."]["Today, I sat down w/ @StateDept nom. Rex Tillerson to discuss the Iran nuke deal &amp; relocating the US embassy from Tel Aviv to #Jerusalem. https://t.co/BErrLOOTX3"]["I received Treas. Nom. Mnuchin’s commitment to help repeal the #CadillacTax and provide relief to Nevadans: https://t.co/unREXUrbvm"]["#NV was hit hard by the housing crisis. I need answers from Treasury Nom. Mnuchin on these critical Qs: https://t.co/kPy0oGT9cJ"]["Recently, I met with Hispanic leaders from #NV. We talked about promoting a robust economy through job creation and tax reform. https://t.co/Q2LoLMLxad"]["Met w/@GovernorPerry to discuss the potential for #renewables, the impt role of the #NV security test site, and my concerns w/ #YuccaMtn. https://t.co/LGyzY8V71W"]["Had the pleasure of meeting w/@mayoroflasvegas, Carolyn Goodman, today to talk about issues facing #lasvegas. Thanks for stopping by! https://t.co/fqvldUT5W3"]["During today’s @SenateCommerce hearing, I asked nom. Ross how he plans to increase economic growth in #NV &amp; the U.S. https://t.co/uYDv7cXfXw"]["Earlier today, I talked w/ @Interior nom. @RepRyanZinke about sage-grouse, hunting, and ways to boost rural #NV’s economy. https://t.co/7keF1ba0gY"]["Looking forward to welcoming many from #NV who will be in DC for #Inauguration2017. I'll be in attendance w/ family: https://t.co/teT0ZQlKgL"]["As Chairman of this #Senate Banking subcommittee, I plan to bolster #NV's economy &amp; increase job creation. MORE: https://t.co/VS7sTL6Fj4"]["Our Mortgage Forgiveness Debt Relief Act will help #NV homeowners who remain underwater on their home mortgages: https://t.co/7XZK3Qpn5s"][".@MarkAmodeiNV2 &amp; I intro'd leg. to efficiently use &amp; secure important minerals while increasing job growth in #NV. https://t.co/eWxwPLjkUD"]["Today, I met w/@DHSgov nom. Gen. Kelly. We discussed ways to ensure Nevada is equipped to combat #terrorism. https://t.co/gdXQvMRnyu"]["I heard a lot from rural Nevadans this weekend on @Interior nominee @RepRyanZinke. Watch his @EnergyGOP hearing now: https://t.co/sr1HKxtxux"]["Today, we remember #MLK for his remarkable leadership and courage and his unwavering dedication to equality for all."]["Whether improving services at the #VA or helping those transitioning into civilian life, we must care for our #vets: https://t.co/G3b0zGgQXP"]["Glad to see @LVMPD being granted resources by @DHSgov to protect against violent extremism: https://t.co/1fwjpPfOQG"]["During the @HUDgov conf. hearing, I asked @RealBenCarson how he plans to fix the high rate of homeless #vets in #NV: https://t.co/vj7f7nNfHT"]["Tomorrow, from 10AM - 1PM , I'll be hosting mobile office hours at Heritage Park Senior Facility in @cityofhenderson. Feel free to stop by!"]["#YuccaMtn isn't the answer. W/ help from other #NV delegation members, we intro'd leg. to ensure our voice is heard. https://t.co/e9tU9mMMsY"]["During the #Commerce conf. hearing of @ElaineChao, I stressed the importance of I-11 &amp; #NV's growing tourism rates. https://t.co/VdEEuYbNM0"]["It was an honor to meet several #NV Purple Heart recipients today in Washington D.C. Thank you all for your honorable service.Cc:@ColeAzare https://t.co/EVDAcdFAKr"]["Pleasure working w/ @SenatorTester on this bill to ensure #vets receive their full pensions &amp; disability benefits: https://t.co/XcrABKfpp8"]["Today, @MartinHeinrich and I discussed our #bipartisan plan to fully repeal #Obamacare’s #CadillacTax: https://t.co/P21FsEQb5K"]["Today, I met w/ Deputy #Commerce Sec. nominee Todd Ricketts to discuss economic development priorities &amp; infrastructure issues facing #NV. https://t.co/GV1gRLpeZK"]["Today, join me in honoring those who have dedicated themselves to protecting #NV and our entire nation. #LawEnforcementAppreciationDay"]["I encourage all Nevadans in @washoecounty &amp; surrounding areas to stay clear of flooded areas while conditions remain dangerous. #RenoFlood"]["I'm proud to partner with @RepComstock on legislation that would boost female presence in #STEM careers! https://t.co/28chGSlCle"]["I will continue working with #NV &amp; fed officials to ensure we are receiving the necessary resources to respond to an emergency. #nvflood17"]["Yesterday, I had the pleasure to sit down with a couple of @unevadareno Wolf Pack students in my Washington D.C. office. https://t.co/7hAJ9h1Z1J"]