["Thank you to the Michigan #Dreamers who are making their voices heard in Washington, I stand with you. Congress needs to pass the DREAM Act and #ProtectDreamers https://t.co/nzy8Hjwp2f"]["Congratulations to Macomb County on your bicentennial. I look forward to your continued growth and prosperity for many years to come https://t.co/pFW4sjcRkL"]["In Michigan we grow the best apples, cherries, and beards https://t.co/iqDEIx476x"]["T/y to @SenatorCollins for your work in helping to pass this provision that allows fire departments to use their limited resources to hire the best first responders for their communities https://t.co/G1Ar46Y6XC"]["FCC vote to repeal #NetNeutrality protections boosts big corporations who can buy ticket to internet fastlane. Senate should vote on @SenMarkey’s bill to reverse the FCC decision and reinstate these protections"]["I support #NetNeutrality b/c I stand w small businesses and MI consumers who rely on the internet to sell goods, keep in touch with loved ones or further their education"]["Thank you to all the dedicated law enforcement officers who serve and protect our communities every day #LawEnforcementAppreciationDay https://t.co/PkNFPVM6OC"]["9 million kids who rely on CHIP are at risk of losing their health care, but Congress has yet to act and the clock is ticking. This should be a no-brainer. #ExtendCHIP so millions of children are not left w/o health care https://t.co/5Vnd5x0vvM"]["MI has always been leader in auto manufacturing &amp; now our suppliers are finding new and exciting applications for their technology. Visited Viconic Defense in Taylor today for look at their work to help protect U.S. servicemembers from injury during vehicle crash or explosion https://t.co/0HpHDy8BtJ"]["Our country faces cyber threats from adversaries across the globe. Today’s activation of new @MINationalGuard cyber squadron at Battle Creek ANGB cements MI’s role as leader in cyber defense &amp; national security. T/y to these airmen for your service https://t.co/CmeLGnV2Nt"]["Heavy ice on the Great Lakes disrupts vital shipping lanes - making it harder to transport goods to consumers. That’s why I’m working to bring another @USCG icebreaker to the Great Lakes and keep our economy humming all year round. https://t.co/3M7UwpXije"]["Piper was not just a team member of @TraverseCity airport - he was a cherished member of the community &amp; had two and four-legged pals from all corners of Michigan. RIP Piper: you will be missed. #airportk9 https://t.co/PCUXliuvN4"]["Proud to work with @SenatorCollins to pass this bill which will benefit local fire departments across the nation &amp; use taxpayer $ more efficiently"]["I’m pleased that President signed into law my provision that gives local fire departments the flexibility to use their limited resources for promoting trained &amp; experienced part-time firefighters to full-time https://t.co/BdcNZRKFkq https://t.co/xOiUwANup1"]["In Michigan we call this spring https://t.co/ZpZUhrwvKk"]["Glad to welcome new Senators Doug Jones and Tina Smith to the Senate! I look forward to working with you both https://t.co/QxxzCy2Yer"]["CHIP has been reauthorized on a bipartisan basis since its inception because it works. Congress must once again come together to #ExtendCHIP so 100,000 MI children of working families do not have health care ripped away"]["From my family to yours, #MerryChristmas https://t.co/5R5mvj4BrL"]["Happy Holidays Michigan! Best wishes for a peaceful holiday season and a joyful New Year. https://t.co/WYdbmnHAR6"]["Hope you can rest up and get well soon! https://t.co/pok0buYU3v"]["State of MI just informed my office that next month, they’ll start notifying MI families w/ kids on CHIP that their children may lose their health care if we don’t #ExtendCHIP. Meanwhile, Congressional Rs are boarding charter buses to celebrate tax cuts for corporations &amp; CEO’s https://t.co/UfxEZYMLd1"]["Republicans are saying corporate tax cuts will raise wages. Here’s why that’s not true. https://t.co/bLrAa2jcSm"]["In 1986, our last major tax reform bill passed Senate 97-3 after 36 days of public hearings over 10 months. \n \nThis time? The bill was written completely behind closed doors, no input from Democrats, and is being rushed to meet an artificial, self-imposed deadline. (5/5)"]["GOP tax bill blows $1.4 trillion hole in our deficit, leaving our children and grandchildren to foot the bill while hamstringing long-term funding for our military, Medicare &amp; Social Security (4/5)"]["Health care costs for middle class families will go up &amp; number of insured will increase by 13 million. For the sickest Americans, health insurance costs could make coverage simply unattainable (3/5)"]["This bill overwhelmingly favors the wealthy &amp; corporations with permanent tax cuts that CEO’s admit will go to shareholders  -  not passed down to workers. Since the Senate passed its version, $70 billion of stock buybacks have already been announced. (2/5)"]["THREAD: The Senate is set to vote on the Republican tax bill tonight. I can’t support this plan b/c it’s not a good deal for Michigan middle class families (1/5)"]["No stamp can do justice to the beauty of  @SleepingBearNPS, but glad people across the country will be able to enjoy even a small part of this Michigan treasure https://t.co/WHOsSZKrov"]["Proud to join my colleagues in introducing a resolution to restore #NetNeutrality protections and fight against the FCC’s decision that harms MI families and small businesses who rely on open internet access https://t.co/v21K476e5O"]["The Senate has had 3 bipartisan hearings on fish &amp; Magnuson-Stevens Act reauthorization. But we’ve had zero hearings on the Republican tax bill. Fisheries are important, but c’mon folks..."]["It would be unconscionable to rip health care away from children during the most formative years of their life &amp; increase costs for working families trying to keep their kids healthy. #ExtendCHIP https://t.co/cdNX4OOwab"]["Universities &amp; companies across MI are creating new jobs &amp; developing the next big thing in transportation. Once self-driving cars can operate in Michigan snow &amp; ice, then we’ll know they are truly ready for anything! https://t.co/YzoJ2YHlht"]["I completely oppose the FCC’s vote to scrap #NetNeutrality and stand with the thousands of Michiganders who called my office opposing this anti-consumer decision https://t.co/GwsF1yqSzx"]["@jbarro FYI, I'm the one with the beard https://t.co/MOS2HP7gAa"]["Let me be clear – repealing #NetNeutrality is…\n \n❌ Anti-innovation\n \n❌ Anti- competition\n \n❌ Anti- consumer https://t.co/tZyG1g5z2S"]["MI is taking another step forward as the world leader in auto innovation with the opening of @acmwillowrun! Companies &amp; researchers from around the world will test self-driving cars here in MI to get them ready for our roads https://t.co/YNRlZYe3R4"]["If #NetNeutrality is rolled back, large corporations that can pay for internet fast lanes will have unfair advantages over small businesses and startups that are the backbone of American economy https://t.co/epygdjKLB1"]["Wishing my friends in the Michigan Jewish community a #HappyHanukkah May these nights be filled with light and celebration"]["Enough is enough - Congress needs to #ExtendCHIP now &amp; ensure that more than 100,000 children of Michigan’s working families will still have health care next year. https://t.co/tBjhqnYIQd"]["The wait was far too long, but the award is much deserved. Congratulations to @tigers legends Alan Trammell and Jack Morris on being selected to the @baseballhall! Hopefully Lou Whitaker will also soon be recognized for his play https://t.co/hmSAZ7Il9U"]["On #PearlHarborRemembranceDay we honor those who gave their lives defending our nation during the attack on Pearl Harbor 76 years ago today https://t.co/OPIWIGc4An"]["#TBT to Colleen, Gary, Jr and me at the Silverdome circa 1996.  Can’t remember who won or lost, but one thing is certain - the 90s sweater game was definitely strong. While the Silverdome might be gone, I’m holding onto that sweater for when it comes back in style. https://t.co/P6Nipoj6WB"]["@SenCapito Pleased our provision advanced in the Senate, putting us one step closer to helping students who invested in their education repair their credit and secure a stronger financial footing"]["A bad credit report from a default can negatively impact students’ long-term financial success. That’s why @SenCapito &amp; I have teamed up to make sure private student loan borrowers have the same opportunity as federal loan borrowers to remove a default from their credit report https://t.co/Bucwkynm8b"]["I think the time has come for Senator Franken to step down"]["@usairforce I had the opportunity to speak with these brave men and women remotely while I was in Afghanistan last month &amp; see some of their incredible work up close. Congrats to the 110th Attack Wing and thank you for all you do to keep us safe."]["Did you know: the 110th Attack Wing in Battle Creek operates remotely piloted aircraft missions all across the world? Their dedication &amp; skill is unmatched, and they couldn’t be more deserving of the @USAirForce’s Outstanding Unit Award: https://t.co/zmRiXwYksG"]["Glad to see at least someone is getting tough on Russia https://t.co/iirswz27Hs"]["@CFPB I joined @SenSherrodBrown in leading colleagues to call on President Trump to quickly nominate a strong advocate for consumers and the middle class to lead this extremely important agency. https://t.co/MyfIRetjZk"][".@CFPB has helped 29 million consumers who were cheated by financial companies, but Mick Mulvaney believes their mission is a “joke.”"]["Happy birthday to the @AFLCIO! For over 60 years, you’ve battled on the frontlines to protect workers’ rights, improve workplace safety, and help all Americans access health care and retire with dignity. T/y for all that you have done"]["Because of that, my colleagues and I are calling on the FCC to delay its 12/14 vote to eliminate these crucial protections. Something as important as #NetNeutrality should not be dismantled through a flawed, compromised process. https://t.co/7fqZWg6nNw"]["You can’t make this up: fake comments from bots may be drowning out voices of real consumers calling for #NetNeutrality protections, and thousands of complaints seemingly disappeared from the FCC’s record. https://t.co/HHvhmd4HjX"]["Sandy Levin has been a mentor &amp; role model for me, his dedication to public service will be missed in Congress &amp; SE Michigan. Sandy’s lasting legacy will be his commitment to improving the lives of working people. My full statement on his retirement: https://t.co/ai4P1suuFO"]["The Senate had an opportunity to craft bipartisan tax reform that truly focused on middle class families &amp; helped to raise wages. Instead, the GOP rammed through a bill written behind closed doors that will force our children to foot the bill for their financially reckless plan"]["Our tax code should be fairer, simpler &amp; fiscally responsible. Unfortunately the bill passed this morning adds over $1 trillion to nat’l debt to pay for permanent corporate cuts that benefit wealthy shareholders- w/ middle class families only receiving small, temporary tax breaks"]["@UM_DCOffice Thank you"]["Even under the rosiest projections, the #GOPTaxPlan would still add over $1 trillion to the national Debt. That is not fiscally conservative, it’s fiscally irresponsible."]["For many working families, the #GOPTaxPlan means a change of less than $100 per year – that is not a middle class tax cut. https://t.co/38ecClFmX8"]["CEO’s and the @federalreserve chair agree: #GOPTaxPlan will boost corporate shareholders, not workers’ wages. https://t.co/w0LBIDTwGC https://t.co/oH2ImcCrcn"]["Headed to the floor right now to speak out for tax reform that is fair, simple and fiscally responsible. Tune in! https://t.co/tmWY3yJfKl"]["Proud to meet with Michigan members of @AIPAC and celebrate the 70th anniversary of the @UN vote to create a Jewish state.  #Israel70 https://t.co/d0I0726y6s"]["The #GOPTaxPlan would add over $1 trillion to our already ballooning deficit and stick our children with the tab https://t.co/jJWaXC6HBE"]["It is unacceptable for the President to give a platform to dangerous and hateful rhetoric and groups. I’m proud to represent strong Muslim and Arab American communities in Michigan, and I stand with them against this kind of bigotry and hate."]["Thank you to the Albanian students who took the time to meet with me during their visit to @uscapitol in honor of Albania’s Independence Day. Wishing them and all Albanians around the world a Happy Independence Day! Gezuar! https://t.co/sgYkVr2cXZ"]["When it comes to tax policy, Congress should do what’s best for the American people - not the Republican or Democratic Party. I stand ready to work w/ my colleagues on bipartisan, fiscally responsible tax reform that strengthens the middle class https://t.co/7FOzbZcyCU"]["At 11 AM, I will join Democratic Senate colleagues to call for bipartisan, fiscally responsible tax reform that boosts our economy and strengthens the middle class. Tune in! https://t.co/VWD4nusZjw"]["Michigan credit unions provide entrepreneurs capital to start businesses &amp; help families with loans to pay for college or buy a car or home. Great to join @Genisyscu to open a new branch in Clinton Township so they can continue serving Michigan families in their community https://t.co/kzsxD4jLys"]["T/y to @CandiceMiller @MarkHackel &amp; @RobertJCannon for joining me to recognize the importance of GLRI funding that protects the Great Lakes for future generations"]["Visited Gloede Drain in Clinton Township, a great example of how Great Lakes Restoration Initiative investments help clean up local waterways &amp; preserve the Great Lakes as a vital drinking water source https://t.co/69Wi2qVcHt"]["Mick Mulvaney’s record of opposing @CFPB mission to protect consumers makes him unfit to serve as head of this important agency. #CFPB needs a director who will stand up for Michigan families over Wall Street &amp; big banks https://t.co/UoCB0FkfBg"]["Small businesses create two out of every three jobs across the country. Today is #SmallBizSat, so remember to #ShopSmall and support your neighborhood shops, restaurants, breweries and other small businesses. https://t.co/nJ0rFn5XS7"]["From my family to yours, happy Thanksgiving! I hope everyone enjoyed their time with family and friends https://t.co/9MzFa04JGY"]["Great to spend Thanksgiving with my brother-in-law – even if he is a @Vikings fan. But I guess nobody is perfect. Go @Lions! https://t.co/n4Az3QXNaG"]["Wishing all Michiganders a happy and safe #Thanksgiving! https://t.co/Moh7PjOdrw"]["It was my privilege to meet with &amp; thank MI servicemembers serving in Iraq &amp; Afghanistan this Thanksgiving. During #MilitaryFamilyAppreciationMonth, we also send a special thank you to family members whose loved ones are deployed. Your sacrifice is too often overlooked. https://t.co/e0j4kKGsx2"]["Congratulations to Clara Lapard of @michiganstateu and Nadine Jawad of @UMich on being named Rhodes scholars! This is a testament to the amazing research being done by Michigan’s students and universities https://t.co/RLQ1RGRwHT"]["At a time when many middle class families are struggling to make ends meet, the #GOPTaxPlan gives huge tax breaks to the wealthiest CEOs &amp; biggest corporations. That’s not a fair system. https://t.co/NqZDbJB249"]["Tax reform should make our tax code fairer, simpler, and fiscally responsible. The #GOPTaxPlan fails at all three https://t.co/iaYB1bIixI"]["I stand w/ millions of Americans in opposition to FCC plan to gut #NetNeutrality rules that preserve a free and open internet. Internet providers should not be able to block or slow down what consumers can access online https://t.co/lxFEZUW9mE"]["#GOPTaxPlan raises costs on middle class families and drives up our nation’s deficit to line the pockets of the wealthy and big corporations https://t.co/E0JGPZsFUx"]["Michigan entrepreneurs are using their innovative ideas to solve the toughest challenges we face. Their hard work not only creates new jobs &amp; grows our economy—it also helps make our world a better place. Proud to support MI’s entrepreneurs &amp; enterprising spirit during #GEW2017"]["After the financial crisis, @CFPB was created to protect consumers from predatory financial practices. Mulvaney called it a “sick, sad” joke. We can’t put middle class financial security in the hands of a man who thinks protecting consumers isn't serious https://t.co/ZMkXNfaYGQ"]["My statement on Senator Franken https://t.co/ikJ1si40MS"]["The #GOPTaxPlan will inflate our national debt by over a trillion dollars! This is wildly irresponsible – our children &amp; grandchildren should not be burdened w/ this kind of debt in order to cut the taxes for millionaires, billionaires &amp; big corporations https://t.co/DKzl7zufgN"]["Today on #WPCD we raise awareness for #pancreaticcancer that robs too many Americans of their loved ones. Early detection is critical with this deadly disease. Know the symptoms and learn what to do if you’re concerned you may have it: https://t.co/VsArC8K8jl"][".@CFPB helps enforce consumer protections, shields Americans from predatory financial practices &amp; holds bad actors accountable. Its next director must continue CFPB’s mission &amp; stand up for the middle class over special interests. https://t.co/bJvTNFe6Qg"]["Congress should be working together to provide middle class tax relief, but this latest attack on health care is the final nail in the coffin for any hope of bipartisan tax reform"]["Doctors and hospitals agree, injecting health care repeal into this tax bill is a bad idea https://t.co/TiLNG0wcpw"]["It’s bad enough that the Republican tax plan would blow a hole in the deficit to pay for tax breaks that disproportionately benefit millionaires &amp; billionaires. Now they want to raise health care costs for the middle class &amp; increase number of Michiganders w/o health insurance"]["Tax reform should help boost Michigan’s middle class families, not line the pockets of wealthy CEOs and shareholders https://t.co/Ck5nHcpqCe"]["Great talking w/ @WBKB11 in Alpena about my bill that would help get life-saving medication to Michigan kids suffering from opioid addiction. T/y for raising awareness about this important issue. https://t.co/nEAm0rn5yH"]["Michigan families face skyrocketing prescription drug prices. The nomination of a big pharmaceutical company exec for HHS Secretary raises serious questions about whether Michiganders can trust him to be on their side https://t.co/KATbdoP1qv"]["Congrats to @DetroitBikes on receiving an Israel-U.S. BIRD Foundation grant to develop an energy efficient, low maintenance, high performance bicycle. This promises to be a great collaboration"]["Great column from @freep on employee ownership plans that help keep businesses going for their employees long after owners retire https://t.co/fpCIL9VwFt"]["This was not a sophisticated hack – #Equifax’s failure to patch their system allowed the bad guys to come right in. A clear case of gross negligence. https://t.co/MyVEZU0rDA"]["From the Halls of Montezuma to the shores of Tripoli and whether by air, land or sea for the last 242 years the @USMC have fought our battles, protected our nation &amp; defended freedom around the world. Oohrah! Happy Birthday Marine Corps! https://t.co/UEoWijj5Hs"]["Experts say victims of #Equifax’s data breach are in danger of identity theft for the rest of their lives. So why is Equifax only paying for a year of protection? https://t.co/ZbernXzWLP"]["T/y @USChamber for your support of #AVSTART bill I intro’d w @SenJohnThune. Self-driving cars will transform how we get around while creating new development opportunities for American businesses. Working on getting it signed into law https://t.co/j5PxxLPnnY"][".@ThunderBayNMS generates over $100 million in economic activity &amp; supports over 1,700 jobs in the region. Proud to stand w/ @SenStabenow to protect the only freshwater National Marine Sanctuary in U.S. https://t.co/3dtJ79Y5bq"]["@LCCStars With the training and certifications students receive at @LCCStars they are prepared to hit the ground running in the aviation field as experts in aircraft maintenance &amp; repair"]["T/y to @LCCStars for giving me a firsthand look at their unique aviation maintenance tech program https://t.co/8jubnuX0We"]["My AV Start Act builds on work at research centers - like @michigantech in the UP - to safely test self-driving tech on a wider scale &amp; get it ready for our roads. Read more from @TheDMG: https://t.co/7mUmgCqmld"]["MI is home to research centers, testing facilities, universities and talented workforce that will usher in the next big leap in automotive innovation - self-driving cars"]["@SenStabenow We’re also requesting a federal investigation into Enbridge’s reporting failures, as well as the integrity &amp; safety of Line 5. The Great Lakes are too important to risk a disastrous pipeline break https://t.co/zwoM6vMyYI"]["It’s outrageous that Enbridge hid information on the safety of Line 5 in the Straits of Mackinac. @SenStabenow &amp; I are demanding answers &amp; transparency so any future damage to Line 5 is quickly released to the public &amp; rapidly repaired https://t.co/qmZzYSJj5c"]["ICYMI via @nbc25fox66: “Peters Calls on the Trump Administration to Hold Drug Companies Accountable” https://t.co/KDUXVEc348"]["Medal of Honor recipient James McCloughan is an American hero who risked his life to save his fellow soldiers as medic during the Vietnam War. Honored to celebrate him &amp; all veterans who have sacrificed for our country https://t.co/NQUad7I0ul"]["Horrified by the heartbreaking news coming from Sutherland Springs, TX. Devastating that this terrible attack happened as people were gathered to peacefully worship."]["Joined hundreds of riders to honor the sacrifice &amp; valor of our veterans at the Metro Detroit Veterans Coalition Veterans Day parade. Thankful to all our men &amp; women who have served our nation https://t.co/XBhFJRiEPj"]["Joined @SenCapito to introduce a bipartisan bill that will help get lifesaving addiction treatment to teens &amp; set them on a path towards recovery https://t.co/06Q0rtnD4r https://t.co/wpmXAe69Ov"]["The opioid epidemic has tragically impacted nearly 276,000 young people who are struggling to get treatment for this crushing addiction"]["Was this even a contest? Michigander is the clear winner! https://t.co/ZwepCQpFAB"]["Janus v. @AFSCME case could undermine collective bargaining rights. Today and every day, we must #StandWithWorkers https://t.co/gb37ITS2YF"]["Incredibly special to meet WWII veteran David Levy from Southfield at the #EisenhowerMemorial groundbreaking today. Servicemembers like Mr. Levy &amp; my father, Herb, are part of the #GreatestGeneration who liberated Europe &amp; defeated tyranny under Gen. Eisenhower’s command https://t.co/JlbGoCfWFD"]["When unions succeed, workers succeed &amp; when workers succeed, our economy succeeds. #StandWithWorkers https://t.co/Aw5mtNuVnU"]["Happy 150th birthday to Big Sable Point Lighthouse!  Michiganders visiting DC should stop by my office to check out a beautiful photo of this historic spot  hanging in the lobby https://t.co/9XP1kSNd1T"]["ACA open enrollment starts TODAY! You have until Dec. 15 to apply for health care coverage. To learn more and #GetCovered visit: https://t.co/q6uvACKt0Q https://t.co/1qlxQqO3Jn"]["Michigan is on cusp of new revolution in auto manufacturing that will be as transformative as 1st Model T that rolled off the assembly line. Read my @AutomationAlley blog post https://t.co/RdtaS7xSCe"]["Still awaiting more details about what happened in NYC, but my heart goes out to the victims and their loved ones. Thank you to law enforcement &amp; first responders on the scene."]["Respectfully disagree. American people deserve a full debate in Congress about U.S. military engagement across the world https://t.co/gaKWM773ZN"]["Important read from @ASPCA on #PAWSAct I intro’d w @SenDeanHeller to protect domestic violence victims and their pets #DomesticViolenceAwarenessMonth https://t.co/vnhQsq73Ya"]["ICYMI via @FOX17: “Peters Presents Medals &amp; Honors to Family of West Michigan WWII Army Private” https://t.co/F9t7hVL3j5"]["Thinking of you and your husband and wishing him a speedy recovery. Glad he has a tough and strong partner like you supporting him https://t.co/fM0Yi7sK6E"]["My statement on today’s indictments in FBI Special Counsel Bob Mueller’s Russia investigation. https://t.co/WdGQYsH43z https://t.co/wcW3rd5Eqj"]["One of my greatest honors as US Senator is recognizing service of veterans like @USArmy Private Frederick Ash, who fought in Europe in WWII https://t.co/GuaESlyGFC"]["Deeply alarming that Enbridge hid full extent of damage to Line 5. It’s more evidence we need increased oversight and stricter safety standards to prevent a catastrophic oil pipeline break in the Straits of Mackinac https://t.co/2usTDGKqJf"]["President Trump talks about lowering drug prices, but his Administration is dragging their feet on holding drug companies accountable. Today I called on Trump’s HHS to punish pharmaceutical companies that overcharge for prescriptions https://t.co/6VW2EbZ42p"]["Congratulations to @UMich on your bicentennial https://t.co/CFM1IB1TX2"]["Thank you to our servicemembers who are deployed around the world &amp; the families who support them back home. #NationalDayoftheDeployed https://t.co/6F8ZCbZsuG"]["In a few minutes I’ll join @AliVelshi on @MSNBC to discuss Niger investigation"]["#Detroit keeps rolling on w/ their comeback! Congratulations on being named the number 2 city to visit in the world by @lonelyplanet https://t.co/ekFTxFolvk"]["America faces troubling economic trend – far too many workers cannot afford to save for a secure retirement https://t.co/Ow7gOteE8s"]["Great to welcome Dr. Michael Jones of @michiganstateu to our subcommittee hearing on fisheries. T/y for sharing how lessons from successful Great Lakes fisheries science can improve fisheries in our oceans https://t.co/523tzCxNRE"]["The incident in Niger is a fresh reminder that Congress needs to examine the current AUMF. We cannot continue to provide a blank check w/o a full debate on how we address the current &amp; emerging security threats https://t.co/Nt0knnYa7N"]["@ThunderBayNMS Read my op-ed w/ @SenStabenow in @freep @ABetterMI on the importance of protecting @ThunderBayNMS from a Trump Admin review that threatens to cut back or eliminate marine sanctuaries https://t.co/WjtjutAVCc"][".@ThunderBayNMS &amp; marine sanctuaries were created not to keep people out of these pristine areas, but for all Americans to access &amp; enjoy for generations to come"]["Joining @NewDay soon to discuss the tragic attack in Niger &amp; need for more info from Trump Admin about deaths of 4 soldiers, U.S. military mission there. Tune in"]["@ThunderBayNMS We must #ProtectThunderBay &amp; devote resources to these special places so visitors can continue to enjoy them and researchers &amp; scientists can continue their important work"][".@ThunderBayNMS is treasured part of our state’s cultural landscape &amp; a huge economic driver, bringing nearly 100,000 annual visitors to Northeast Michigan https://t.co/FAg0yKWFYQ"]["@facebook @GrandCircusCo By the end of the decade close to 77% of jobs will require tech skills. Digital skills offered by this collaboration are critical to ensuring MI’s future economic success"]["Excited to help kick off new @Facebook &amp; @GrandCircusCo effort to train more Michigan workers in coding &amp; other in-demand digital skills https://t.co/3vvhUefx30"]["ICYMI via @WLNS: “Peters Highlights Need to Protect U.S. Businesses &amp; Consumers from Equifax Style Cyber-attacks” https://t.co/xTGBFWe2zO"]["@SenJohnMcCain Trump Administration also needs to present a clear plan to fight ISIS – including explanation of US military presence in Niger"]["As member of Senate Armed Services Committee, agree w/ Chairman @SenJohnMcCain that Congress needs to know what led to tragic loss of 4 soldiers in Niger https://t.co/dqwdqEENLG"]["It’s #NationalMammographyDay! Reminder to #getchecked b/c early detection is key to beating breast cancer &amp; saving lives https://t.co/BteoGcpUl9"]["Passing this budget is only an excuse to pass a tax bill w/ as few votes as possible &amp; no bipartisan input or buy-in https://t.co/CsZVMj69KW"]["Our budget &amp; tax priorities should be reducing the tax burden on the middle class families so they can save for retirement &amp; increase their take-home pay. Disappointed to see GOP budget fails on all counts. https://t.co/71dbDrrhXB"]["SOON: I’ll be speaking on the Senate floor about my opposition to the GOP budget &amp; the need to reach a bipartisan agreement on tax reform that benefits middle class families w/o raising the deficit. Watch Live: https://t.co/W59czFy6X0 https://t.co/iT8C3QbGvJ"]["Wonderful to see all the incredible work happening at MI colleges &amp; universities. Read how our students are leading the way in developing self-driving tech: https://t.co/2Nnkh9f90X"]["With GOP budget, Michigan seniors take a hit so that millionaires &amp; billionaires can make more https://t.co/UXEIRag3ab"]["The GOP budget &amp; tax plan sends America’s budget deficit skyrocketing while leaving our children &amp; grandchildren to foot the bill https://t.co/4c8ePuWirY"]["Happy #242NavyBday! T/y to those who have served to protect America the world over. Anchors aweigh for the next 242 years! https://t.co/YzQrfRZ08G"]["President Trump’s move will devastate middle class families and sick Americans who need care the most"]["Michiganders shouldn’t have to choose b/n going to the doctor or putting food on the table or facing financial ruin if they get sick"]["Trump is playing politics w/ health care, sabotaging markets &amp; sending premiums skyrocketing for working families https://t.co/vDplM6pGIj"]["Happy #NationalFarmersDay to MI’s farmers, who work sunrise to sunset growing our food and our economy https://t.co/ZKdhqbNURi"]["ICYMI via @HollandSentinel: “Legislation to protect Great Lakes from Algae bloom passes U.S. Senate” https://t.co/AeMEVzMV3j"]["Great to get a firsthand look at how @MINationalGuard is supporting Liberian military &amp; increasing security in the region. T/y for your service https://t.co/GMin9D03DY"]["@Space_Station Events like this help Michigan students build a passion for space and science education"]["Students from St. Mary Cathedral School in Gaylord were treated to an out of this world video chat w/ astronauts on the @Space_Station https://t.co/7LnZlmYcHI"]["Proud to celebrate MI’s remarkable manufacturing industry on #MFGDAY17. Making things is in our DNA &amp; we must inspire future generations to explore careers in manufacturing https://t.co/TyEzqBCOy2"]["Wonderful to visit with President Garibaldi and other fellow alumni at last night’s @UDMDetroit Alumni Gathering in Washington https://t.co/Vpi3tnWSjN"]["We should not wait any longer to provide certainty to the millions of children who depend on CHIP &amp; to the Americans who will lose access to care if their Community Health Center closes https://t.co/P4JLsl5flb"]["Outrageous that IRS would spend tax dollars on Equifax contract to protect the identities of taxpayers after company’s breach exposed personal info of 145 million Americans https://t.co/fWP7yIqdjF"]["Today the Senate Commerce Committee unanimously passed my bipartisan bill to help ensure MI will lead the world in self-driving vehicle tech https://t.co/kGFeSgCL3U"]["Congratulations to my friend @JocelynBenson on being named one of @crainsdetroit #40under40 for her great work as @_WayneLaw Dean &amp; fierce advocacy for voting rights through @RISEtoWIN https://t.co/od2G7aJ4z0"]["@GrantMeHope1 T/y Helen for your dedication to MI’s foster children, I was proud to nominate you as my @CCAInstitute Angel in Adoption"]["Truly moved by the wonderful work West MI native Helen Zeerip is doing to help older foster children find homes through @GrantMeHope1 https://t.co/8dgjy6CWtT https://t.co/R0CNafGuBL"]["Horrified and saddened by the violence in #LasVegas, my heart goes out to the victims and their families of this horrific attack."]["Sec. Price may have resigned, but the American people deserve to know just how much of their tax dollars he and other Cabinet officials are wasting on excessive travel &amp; perks https://t.co/vcK8KsVHEk"]["Trump Admin Cabinet officials have abused taxpayer dollars &amp; displayed a culture of wasteful spending. https://t.co/yqWYbA1zEi"]["I’m working to help companies transition to ESOP models. ESOP are often more productive, grow faster, have less employee turnover &amp; help loyal employees share in the company's profits"]["Toured Cambron Engineering in Bay City, a wonderful example of a company that is 100% employee-owned through an Employee Stock Ownership Plan (ESOP) https://t.co/0LIJ47fayN"]["Funding for Children’s Health Insurance Program &amp; Community Health Centers runs out this weekend. We must protect these critical programs https://t.co/MJX4bj1iZJ"]["Pleased to partner w/ @SenStabenow to intro a bill that will help small businesses and startups get the resources they need to launch &amp; grow https://t.co/4qr1wrM4zH"]["MI is home to more than 856,000 small businesses that rely on access to capital to help them compete, grow &amp; create new jobs"][".@SenJohnThune &amp; I introduced bipartisan legislation that will help ensure Michigan &amp; the US continue to lead the world in self-driving vehicle innovation https://t.co/6bLccnnXFw"]["Self-driving vehicles will completely transform the way we get around &amp; it's vital that public policy keep up w/ this rapidly developing tech"]["Proud the Senate passed bipartisan bill I helped introduce to protect the Great Lakes from harmful algae blooms https://t.co/VDpADWDvig"]["Glad to have you back https://t.co/SHdSYJfgDA"]["Joined colleagues in a letter urging POTUS to issue a full disaster declaration &amp; allocate resources to quickly restore power to Puerto Rico https://t.co/ogVRtGHXKx"]["As Ranking Member of the Subcommittee that oversees FEMA, I'm extremely concerned by the impact Hurricane Maria has had on Puerto Rico"]["Had the pleasure of meeting with @NASSP MI Principal of the Year Lisa Phillips from Cass Tech HS. Congrats on this well-deserved honor! https://t.co/qj04LzrSPu"]["@CoachJim4UM Want a flag flown over the Capitol like the one @CoachJim4UM got? Find more info &amp; place an order from my website: https://t.co/e41y2CKtuM"]["You’re welcome @CoachJim4UM glad I could honor the occasion! #GoBlue https://t.co/EtD1BkJNt0"]["To protect taxpayer dollars, I'm looking into extraordinary &amp; excessive travel expenses by Cabinet officials &amp; urged OMB to investigate"]["Every day brings to light new info on Trump Admin abusing taxpayer money w/ private planes &amp; other travel expenses https://t.co/I5Y1hip6CJ"]["Congrats to Marines graduating as new infantry officers! Incredible to see 1st female graduate, your hard work will inspire countless women https://t.co/QbpXW2TLEr"]["Thanks to your hard work the latest GOP health care repeal effort is on hold for now! https://t.co/9vfMGl5eXG"]["No one in this great country of ours should ever go bankrupt because they get sick https://t.co/nHPGDifbrn"]["ICYMI via @freep: “Selfridge pitch for F-35 jets could get boost from Sen. Peters' proposal” https://t.co/UoaLmXPBP5"]["Headed to the floor to speak against #GrahamCassidy repeal bill that rips away health care from MI families. Watch: https://t.co/cwtUWBOQd1 https://t.co/8IJG0kpKod"]["#GrahamCassidy would allow lifetime caps on coverage and force families to  choose between going w/o health care or huge out of pocket costs"]["Nobody should go bankrupt because they get sick – must protect families like the Pietrowsksys whose 2 yr old suffers from a heart defect https://t.co/DDO1KtOtL5"]["Great day for Ann Arbor &amp; the entire state as @Google opens new Michigan facility that boosts innovation &amp; economic growth https://t.co/OCRsh1rJMj"]["As Ranking Member of Federal Spending Oversight, I’m urging OMB to explain why taxpayers foot the bill for private planes &amp; excessive trips https://t.co/4YX25oV6XI"]["Reports of Sec Price &amp; Trump Cabinet officials abusing taxpayer-funded travel are troubling, signal culture of waste https://t.co/y8GdEVvsSr"]["NOW:@SenStabenow &amp; I are fighting to stop #GrahamCassidy that will make MI families pay more $ for less care. Watch: https://t.co/yfTOUWyPdR"]["Great to meet with the many Michigan advocates visiting Washington for #CBCFALC17 this week! Thanks for your hard work on behalf of MI https://t.co/XRctC5tbVO"]["Proud to help honor @UMich bicentennial by flying an American flag over @uscapitol for @CoachJim4UM #GoBlue https://t.co/sZBsGkOkzb"]["Today marks the beginning of @ArtPrize 9! Hope you enjoy this great way to experience incredible art in West MI https://t.co/EIUzGz8uER"]["#GrahamCassidy will cut Medicaid funding for the elderly &amp; raise coverage costs for seniors &amp; those w/ pre-existing conditions"]["Senate Republicans are rushing to vote on #GrahamCassidy next week to rip health care away from 800,000 Michiganders https://t.co/usVhsqStQ8"]["L’Shanah Tovah to Michigan families celebrating #RoshHashanah May the coming year be sweet and filled with joy"]["Happy birthday to the love of my life, Colleen. 24 years ago you said yes to marrying me &amp; while I may look older you haven’t changed at all https://t.co/hBF3kRVbYG"]["Proud the Senate passed #NDAA with my provisions to bolster Michigan’s role in our national defense https://t.co/QqC1SzyhlP"]["@SenWarren @SenatorTomUdall HOTEL Act bars taxpayer dollars for exec branch employee travel from being used at properties owned by POTUS, cabinet members &amp; families"]["Travel decisions of executive branch employees should not be influenced by potential profit for the President or cabinet members"]["Honored to be a part of the promotion ceremony for my defense fellow, Rob, who has served @USArmy for 20 years &amp; today was promoted to major https://t.co/pxpIOiCyVD"]["GOP is trying yet again to rip away your health care w/ #GrahamCassidy. Make your voice heard &amp; help stop this bill https://t.co/m61MNh4oif"]["Today @CassiniSaturn ended its 20-year mission studying Saturn. Thanks for fascinating look at this different world https://t.co/V91zuiWVsk"]["Pleased to share this #POWMIARecognitionDay story of one MI WWII airman whose remains will finally return home https://t.co/rei0K6y2AT"]["This #POWMIARecognitionDay we honor the brave men &amp; women taken prisoner or missing in action while serving our nation #YouAreNotForgotten https://t.co/kmlDHCzeoH"]["Congrats @MonaHannaA: a true hero for Flint families! Proud to partner with you to stand up for Flint https://t.co/5xvgl9QCls"]["Pleased to see @FTC will be taking action &amp; investigating #Equifax following my request https://t.co/CgH3VO7Uav https://t.co/GiDs9nXM0x"]["MI has something for everyone, no matter your interests! Check out this @NatGeo article w/ great places to visit  https://t.co/bpXksR6Kqk"]["Excited @BlackGirlsCode received $255k from @GM to launch in Detroit &amp; encourage young women to pursue STEM fields https://t.co/U9x9I7IgVZ"]["Happy 70th birthday to @usairforce! I was honored to join in the celebration and have the opportunity to speak with airmen from MI https://t.co/nizW7jfEal"]["Find out if you were impacted by #Equifax breach &amp; steps you should take to protect your info w/ this @FTC resource: https://t.co/f7IPDECHT2"]["#Equifax’s data breach exposed personal info of millions of Americans. I’m urging @FTC to investigate &amp; help protect consumers in the future https://t.co/voojR2Wzbx"]["When you entrust your personal info to a company, you expect them to take every necessary step to secure &amp; protect your data"]["If your friends &amp; family are in the path of #Irma, this @fema app has resources &amp; safety info that can help https://t.co/jQAzWi54e7"]["September 11th is a day that changed our nation - and our lives – forever, but America arose a stronger &amp; more united nation https://t.co/xVUnfrNyJ7"]["At Detroit #MarineWeek, humbled to honor memories of those who lost their lives on 9/11 &amp; all who answered the call of duty after attacks https://t.co/cZohth0DqZ"]["Protecting survivors of campus sexual assault should be the priority. DeVos' decision only makes students less safe https://t.co/p4QPk79wAX"]["@USMC Hope you’ll attend one of over 80 free community events @USMC is hosting in the Detroit metro area https://t.co/24WS3MA5tI"]["You can register for @fema or @SBAgov assistance online at https://t.co/b4lGw67ojo or by phone at 800-621-3362"]["If your Mid-Michigan home or business was damaged by severe flooding in June, you have until Oct 2 to register for disaster assistance https://t.co/ofn4JUsVlc"][".@LCA_Detroit brings another new attraction to boost downtown #Detroit revitalization. Glad to be a part of this exciting event https://t.co/BIrYsMJOlK"]["It's time for Congress to lead and pass comprehensive immigration reform. Read my full statement: https://t.co/KqjD6RX4bH"]["Immigrants are essential to the fabric of our nation. I strongly disagree with President Trump’s decision to rescind #DACA. https://t.co/JqR01lOehV"]["Wishing everyone a safe &amp; happy holiday, I hope you will join me to honor the legacy &amp; future of MI workers"]["Labor Day celebrates the heritage of MI workers who created the middle class &amp; led the fight for workers' rights https://t.co/lY2ARTRLl2"]["ICYMI via @UPABC10 : “Peters visits Ford Airport to highlight Essential Air Services program” https://t.co/CGovDV01B8"]["Eid Mubarak to Muslims in Michigan and across the country celebrating Eid al-Adha today!"]["Harmful algal blooms endanger the Great Lakes, this bill ensures @usioosgov has the tools to combat these threats https://t.co/IgyUWMCC7G https://t.co/WlcWNpFGo8"]["The right to vote is the core of our democracy, proud to help ensure every American is heard at the ballot box https://t.co/Iv82nlDaoD https://t.co/Vcs0Fu6811"]["You can make your voice heard on @USACEHQ plan to block Asian carp from invading the Great Lakes by commenting here: https://t.co/NoGIra6jxw https://t.co/93xM441wxV"]["@SBAgov Small businesses are the heart of rural communities, proud to help ensure they can keep benefiting from this aid https://t.co/webZW1ofit https://t.co/2E5VC2DnrR"][".@SBAgov HUBZone program helps small businesses in rural &amp; economically struggling areas in Northern MI &amp; UP win contracts to sell products"]["Jud Heathcote was a @MSU_Basketball legend- condolences to his family &amp; MSU community who cherish his lasting impact https://t.co/MvX5AlMvjU"]["I was proud to help pass the bill that renamed the clinic &amp; honor the sacrifice of this great Michigan hero https://t.co/LOy2qPwf3G"]["This weekend Traverse City honored Medal of Honor recipient &amp; Northern Michigan native Col. Demas T. Craw by naming a VA Clinic after him"]["Thankful to MI @USCG personnel heading to TX to assist in #Harvey rescue operations https://t.co/hgpIDuad0s"]["@fema As Ranking Member of the subcommittee that oversees @fema, I will continue to follow rescue &amp; recovery efforts in the wake of this storm"][".@fema is working around the clock to provide critical emergency response services to the region impacted by #Harvey"]["Happy 200th birthday @UMich! Proud to honor the grand history of this great university on its bicentennial. #GoBlue https://t.co/yj0cAD4JwR"]["Instead of divisive actions like the pardon &amp; banning transgender servicemembers POTUS should unify country &amp; address crises like #Harvey"]["This is yet another action by POTUS backing racist ideologies &amp; driving our country further apart in the face of serious, immediate threats"]["POTUS decision to pardon sheriff who used despicable &amp; racist policies undermines rule of law and faith in justice system"]["Happy Birthday to @NatlParkService! For the last 101 years they have managed &amp; preserved some of MI’s &amp; America's most beautiful landmarks https://t.co/gMTMzHZDau"]["As #Harvey approaches the US, remember to follow @FEMA for important safety updates &amp; emergency information https://t.co/ZzIwAoA0FE"]["My heart goes out to the loved ones of @USNavy sailor Kenneth Smith. His service to our nation will not be forgotten https://t.co/wPqoHjsLqa"]["@StoryCorps @NolanFinleyDN @SHendersonFreep Refreshing to hear these writers from opposite sides of the political spectrum come together &amp; show we have more in common than we think"]["Check out a great @StoryCorps discussion between @NolanFinleyDN &amp; @SHendersonFreep https://t.co/QmcCtCyl4k"][".@LGUS plans to invest $25 million into a new plant in Troy &amp; more Michigan jobs is great news! https://t.co/ur8qFzcHO0"]["Proud to cosponsor legislation that will expand support services for victims of human trafficking. https://t.co/WwEfT8SswD https://t.co/LIhBeNpXnd"]["ICYMI via @wluctv6: “Peters honors Vietnam Veterans in Marquette with Commemorative Lapel Pins” https://t.co/qmE41cEpaQ"]["Excited for today’s historic solar eclipse! I hope you get a chance to see this rare event, remember to be safe. https://t.co/XxssAqSdDG"]["Devastating to see another tragedy w/ @USNavy. My heart goes out to the families &amp; friends of the sailors of the USS McCain."]["@AirNatlGuard Selfridge is home to @127Wing who have answered the call time &amp; time again, only adding to Selfridge's proud 100-year history"]["Congratulations to the entire Selfridge @AirNatlGuard Base community on your 100th birthday! https://t.co/BBBmOmT2AN"][".@OfficialWDC celebrates Michigan’s wonderful automotive heritage. What is your favorite classic car? https://t.co/XqlnWPMD3Y"]["Thanks for following my #RideMI Tour! Had a great week meeting w/ Michiganders &amp; riding my @harleydavidson across our beautiful state https://t.co/uuNIfaiwRf"]["In Oceana Co to see how Herrygers’ Farm is growing corn, peaches, cherries &amp; asparagus on the final stop of this year’s #RideMI Tour https://t.co/Vp9X9YP1bG"]["@BoschGlobal Yesterday I finished the UP part of my #RideMI Tour by crossing the mighty Mackinac Bridge on my way to west Michigan https://t.co/sqvumA4aqe"]["Rolling out for last day of my #RideMI Tour! Glad to have fellow riders – including some from @BoschGlobal MI – brave the rain w/ me https://t.co/NWaWRfejiX"]["Rural airports play a critical role in connecting Michiganders to businesses &amp; travel opportunities around the world"]["Day 4 of #RideMI Tour, I visited Ford Airport in Dickinson Co to discuss the importance of Essential Air Services funding to rural airports https://t.co/lQlskxVx2d"]["Saddened by the horrible terror attack in #Barcelona. My thoughts are with the victims and the people of this great city."]["Thank you to the members of American Legion Reino Post 21 who joined me yesterday on my #RideMI Motorcycle Tour on the way to Iron River https://t.co/eyT2UEuW2w"]["Vern Ehlers was well respected &amp; I was proud to call him my colleague. His public service was exemplary, an example for all of us to live by https://t.co/EpuKVSyIyh"]["@niupnorth @StormyKromer Proud to say Michigan’s defense sector is helping expand &amp; strengthen our state’s tradition of building great things"]["@niupnorth @StormyKromer Met w/ employees of Lake Shore Systems to discuss the importance of creating jobs &amp; growing local economies through manufacturing https://t.co/jaharkozyB"]["@niupnorth @StormyKromer Great to get an inside look at Lake Shore Systems, producer of specialized systems for our nation’s military https://t.co/QyzmRyua6a"]["@niupnorth @StormyKromer Next on my #RideMI Tour I headed to a second manufacturer, Lake Shore Systems in Iron River https://t.co/LrLmU67NRJ"]["@niupnorth @StormyKromer From paper products and clothing to electronics and autos, Michigan’s manufacturers are the lifeblood of our economy"]["Joined @niupnorth Thanks a Million event w/ Jacquart Fabrics home of @StormyKromer to celebrate $1 million invested in Gogebic Co small biz https://t.co/IiX2MDyxDF"]["On day 3 of my #RideMI Tour I visited two western UP manufacturers in Gogebic &amp; Iron Counties https://t.co/4NUWmVRdHA"]["This includes a new emergency dept &amp; telehealth services that help Michiganders save time &amp; money by making follow up visits remotely"]["Toured Aspirus Ontonagon Hospital to get a firsthand look at the innovative ways they are treating patients in rural areas #RideMI https://t.co/AlwXrBPniP"]["The President blames 'many sides' but he should know that white supremacists &amp; neo-nazis sow hate &amp; violence and are wrong. It's that simple"]["Great to be in L’Anse to meet w/ employees of @CertainTeed, a producer of ceiling tiles &amp; Baraga County’s largest employer. #RideMI https://t.co/O5qi1SCMtg"]["Enjoyed meeting &amp; getting a chance to go trap &amp; target shooting w/ Ottawa Sports Club members as part of my #RideMI tour in Baraga Co https://t.co/TVU0GB4TOQ"]["Kicked off Day 1 of my #RideMI Motorcycle Tour! Met with Vietnam veterans in Marquette County &amp; heading to Baraga County next https://t.co/yGHz5RHomr"]["If you are a MI resident who served on active duty during the Vietnam War &amp; want to request a lapel pin click here https://t.co/EGxpBkA2Nh"]["Proud to recognize the service of UP Vietnam veterans w/ special lapel pins honoring their service &amp; 50th anniversary of the Vietnam War https://t.co/b7r7kXG9IK"]["Thanks to Mike &amp; Walt for having me on the Sunny Morning Show to discuss my #RideMI Motorcycle Tour taking place across the UP this week! https://t.co/4qD5MC5KGb"]["Marquette Harbor Lighthouse is an icon of the city. I enjoyed touring the lighthouse and meeting with @USCG who help maintain it https://t.co/iStkeCYCFq"]["Racism &amp; hatred displayed in Charlottesville go against our nation's values. We must stand together to condemn these hateful actions"]["Congrats to Grosse Pointe Woods-Shores Little League team for making it this far &amp; good luck advancing to #LLWS https://t.co/NUUHdTngn2"]["@VVAmerica Humbled and honored to be recognized by @VVAmerica as a Legislator of the Year https://t.co/0K72nphv3b"]["Proud to work w/ @VVAmerica to pass #Fairness4Vets to help support our servicemembers suffering from invisible wounds of war"]["The lasting legacy of Vietnam veterans has been their steadfast commitment and service to our country and to their fellow veterans"]["Congrats to Lake Linden High School’s eCYBERMISSION team for taking home the national championship! https://t.co/5iFhkzJQm4"]["I’ll be presenting UP Vietnam veterans w/ 50th anniversary commemorative lapel pins as well as visiting small businesses &amp; community leaders"]["Excited to announce my 2017 #RideMI Motorcycle Tour that will take me across the UP &amp; West Michigan https://t.co/oIbPNxl1Yq https://t.co/4MnY6zG6K9"]["ICYMI via @wluctv6: \"Peters visits UP Paper highlighting support for local manufacturers\" https://t.co/LJ9EdbgLdR"]["From cherries and corn to soybeans and milk, MI agriculture sector is a vital part of our economy employing roughly 1 out of every 4 workers"]["Visited MSU UP Extension &amp; Research Center that provides opportunities for beginning farmers to learn about starting their own business https://t.co/2uYfHCnxEa"]["Toured UP Paper, a great example of how investing in manufacturing can lead to good-paying jobs in MI https://t.co/K2tgBdTO4m"]["Pictured Rocks draws thousands of visitors to Alger County &amp; bolsters the economy including local small businesses"]["Great visit to Pictured Rocks National Lakeshore to check out the breathtaking sights of this wonderful UP treasure. #FindYourPark https://t.co/vc1s0ZXmew"]["Americans of all faiths should feel safe to worship in peace.\nThankful no one was hurt in this violent attack. https://t.co/2UXh0saOkP"]["Stopped by @ThunderBayNMS to get firsthand look at their efforts to preserve &amp; share the maritime history of the Great Lakes https://t.co/Nbwyko2ZGB"]["Can’t wait to start my #RideMI motorcycle tour this summer! Stay tuned for details on where I’ll be headed soon https://t.co/ZRCk0WQgKl"]["This will help fire departments save taxpayer dollars by promoting experienced part-time firefighters to full-time positions"]["Glad to see my commonsense provision helping fire departments streamline hiring process passed the Senate https://t.co/BfNLLTlZbY"]["Happy 227th birthday @USCG! Thank you to the brave Coast Guard men &amp; women who serve &amp; protect our waterways. Semper Paratus! #CG227 https://t.co/d4xSMw4tNA"]["ICYMI via @WBKB11: There’s still time to share your thoughts on protecting sanctuaries like @ThunderBayNMS online at https://t.co/tYPYHBy2C2 https://t.co/iuBENb2nrm"]["Proud Commerce Committee passed my bipartisan bill to modernize these critical maps &amp; keep Great Lakes clean for future generations"]["Protecting our Great Lakes means having accurate maps of coastal resources that could be impacted by an oil spill or disaster https://t.co/4oEkYdXSbP"]["Great to spend some time w/ @usmayors discussing issues that impact our cities. Congrats Rochester Hills @MayorBarnett on election as 2nd VP https://t.co/Fdos14tAyp"]["FEMA &amp; SBA aid will be available to help mid-Michigan families &amp; businesses hurt by recent flooding. Apply online: https://t.co/mzkfEpwQnJ"]["Thank you @SalineSchools student Melinda McCabe for your hard work as a Senate Page representing Michigan https://t.co/BCs6sXpzrn"]["Honored to join ceremony inducting Medal of Honor recipient James McCloughan into Pentagon’s Hall of Heroes. A great tribute to his service! https://t.co/G1WPGIOHDb"]["Michigan #startups are at the forefront of innovation &amp; job creation in industries from food &amp; retail to tech &amp; health care #StartupDay https://t.co/YESX6vtO9W"]["Today is #StartupDay which celebrates the ingenuity of the startups and entrepreneurs driving America’s future https://t.co/h0mFMDRSHc"]["McCloughan risked his life to save his fellow soldiers. T/y for your service &amp; congratulations on receiving our nation’s highest honor"]["Today South Haven’s James McCloughan received the Medal of Honor for his services during the Vietnam War https://t.co/aXhcT8BG6i"]["There’s still a chance to make your voice heard in the fight to protect &amp; preserve sanctuaries like @ThunderBayNMS https://t.co/U9YrOypR1Q https://t.co/0i16kphKzn"]["Glad to report the public comment period on Trump’s EO that could rollback or eliminate 11 marine sanctuaries &amp; monuments has been extended"]["Proud to stand up for MI families &amp; cast my “NO” vote against the GOP health care bill alongside @SenJohnMcCain &amp; his deciding vote https://t.co/MuvUao7CXS"]["Thanks to the hard work of Michiganders and people across the country, GOP efforts to pass their health care bill failed last night https://t.co/gZT4bAQ63A"]["I urge GOP colleagues to think about people who will be hurt by repealing ACA &amp; urge them to work w/ Dems on a bipartisan health care bill https://t.co/EZHDj4sNIw"]["Watch video students from Ella M. White Elementary in Alpena made on the dangers of plastics in our Great Lakes https://t.co/U8MIeJl61X"]["In Lake Michigan alone, yearly plastic pollution is equivalent to 100 Olympic sized swimming pools filled w/ plastic bottles"]["The Great Lakes are in serious danger from marine debris &amp; plastics that harm ecosystems &amp; disrupt commerce https://t.co/evpEjBfLbW"]["There is no room for discrimination in our military. President should focus on plans to address threats from N. Korea &amp; Russian aggression"]["We should support every patriotic, qualified &amp; capable person volunteering to serve our country in uniform https://t.co/3A5a2SNAtM"]["SOON: Voting against GOP repeal of ACA. Would be devastating to Michiganders, putting affordable health care out of reach for thousands https://t.co/WrMy9bTmkh"]["GOP already trying to make their health care bill worse, now trying to pass provision that rips coverage away from Michiganders who need it https://t.co/sVFp07oOci"]["@M_Foresight Manufacturing is key to America’s economic future &amp; I’m working to ensure this high tech industry remains internationally competitive"]["Honored to share my thoughts about the future of manufacturing at the @M_Foresight 2017 National Summit https://t.co/EImgqQGL4g"]["Today Senate GOP voted to set us on a path towards unraveling the American health care system, w/ no plan to put it back together"]["SOON: Senate will vote on health care repeal that impacts the lives of millions of Americans w/o even knowing what the bill says https://t.co/av4foYIMZe"]["Honored to join my colleagues in updating G.I. Bill to help veterans access vital educational benefits https://t.co/eI3mH3X8Ri https://t.co/JWnruANEbP"]["Happy 316th birthday to the Motor City! https://t.co/mD8VFUczlA"]["USS Ford is a wonderful way to honor President Ford’s service as not just President but also an officer in the @USNavy https://t.co/w19dagOZoR"]["ICYMI: Joined @SenJohnThune on @CBSEveningNews to discuss our bipartisan effort to address the future of self-driving cars https://t.co/TmqlIpnm5j"]["#NetNeutrality helps small businesses compete w/ large corporations on a level playing field https://t.co/YcvTKodSyD"]["Proud to intro BRAVE Act w/ @marcorubio. Bill honors our nation’s heroes by updating veterans’ funeral benefits\nhttps://t.co/SjklpqPwaz https://t.co/iJIqQdj8zF"]["Totally agree! Give American companies a level playing field &amp; they will make the best products every time https://t.co/EVlresWgiD"]["While US believes humans must make battlefield decisions, we must prepare for adversaries who use autonomous weapons https://t.co/eqJeOBKAq8"]["Thinking of colleague &amp; @SASCMajority chairman @SenJohnMcCain &amp; family.  Hoping to see you back in the Senate soon. https://t.co/AwM91a8CoE"]["Repealing the ACA w/o a replacement would be an outright disaster: 32 million will lose care in next 10 yrs &amp; premiums spike 25% in first yr https://t.co/9Jv52FfN6y"]["Closing @StateDept cyber office weakens our ability to strengthen US cybersecurity &amp; resolve conflicts in cyberspace https://t.co/sLnY7Zcmls"]["Marine sanctuaries like @ThunderBayNMS drive local economies. Proud to lead a letter urging protection of these critical underwater parks https://t.co/TJLztzy5Hf"]["Thrilled to be a part of @astrosociety @ISS_CASIS conference discussing investments in space, science &amp; technology https://t.co/NLEP6zfZXB"]["We should focus on bipartisan solutions to stabilize market, lower costs &amp; provide Americans w/ affordable care"]["Repeal w/o replacement would devastate MI families, risking coverage &amp; skyrocketing premiums https://t.co/3hF1enSFC8"]["Time for GOP to work w/ Democrats to find substantive policies that improve health care &amp; reduce costs for all Americans https://t.co/TldDYxPw6e"]["Looser insurance requirements &amp; less financial assistance for patients in #Trumpcare will put health plans out of reach for many https://t.co/V9X8MYL935"]["W/ #Trumpcare vote delayed, GOP should take this time to hold public hearings and get real input from experts &amp; Americans https://t.co/9gQKZx9VZu"]["T/y for having me @AutomationAlley - great discussion on the critical role MI is playing in the future of auto tech &amp; manufacturing https://t.co/9YyuXuFBDy"]["Michiganders have a chance to see a space weather event tonight, w/ Northern Lights visible as far south as Detroit! https://t.co/AwmQZVybfw"]["Congrats to Midwest Regional @uspto on reaching 5 yrs of supporting small biz &amp; entrepreneurs in metro Detroit https://t.co/jCjC4DUnb3"]["Drug overdoses have increased by 18% in MI &amp; most were related to opioids. https://t.co/gDTzzTFv8g"]["T/y for stopping by &amp; fighting for clean air for Michigan children! https://t.co/PgxOGRSlWk"]["Dr. Gilson tells me that cutting Medicaid will not help those suffering from opioid addiction. Watch the full video: https://t.co/iDHvXDFXcH https://t.co/8ztLM5o8fq"]["Medicaid helped Susan get life-saving cancer treatment. We should ensure others have the same option in similar difficult situations https://t.co/jZSFmuPIWl"]["T/y @Microsoft for helping to extend broadband service in rural MI. Creative ideas like this will help to close the rural broadband gap! https://t.co/QiI7DlPPc5"]["Electric fuel cell powered @chevrolet Colorado is a great example of innovation coming from MI auto &amp; defense industry partnership https://t.co/hRzqVFu44O"]["We should be working on legislation that will truly improve our health care system by increasing insurance coverage and bringing down costs https://t.co/UeYBYT5OGj"]["@SenatorRisch Research shows that Employee Stock Ownership Plan businesses are more productive, grow faster, have higher wages &amp; less employee turnover"]["Intro’d bill w/ @SenatorRisch that will help more businesses take advantage of Employee Stock Ownership Plans https://t.co/zFNKjcSysi"]["Police Chief Synan warns me #Trumpcare Medicaid cuts will limit tools to fight opioid addiction. Watch more: https://t.co/iDHvXDFXcH https://t.co/ntYmV660zo"]["W/o a free &amp; open internet it will be harder for small businesses &amp; innovative start-ups to share their ideas w/ the world. #NetNeutrality"]["Proud to join the day of action to protect #NetNeutrality for small businesses, startups &amp; consumers &amp; keep the internet free &amp; open https://t.co/mFN4EqJfTy"]["Glad @JoeBiden could join us in the Senate for a critical discussion on the importance of federal investments to promote science &amp; research https://t.co/gWhXLkbmis"]["Hospital &amp; Health Provider CEOs: #Trumpcare will cause premiums to \"increase for those that need coverage the most” https://t.co/yoQPP3qBKl"]["My heart goes out to the families &amp; friends of the 16 Marines who lost their lives in this tragic Mississippi plane crash"][".@GrandHotelMI is a Mackinac landmark that my family &amp; I always enjoy visiting. Congrats on 130 years of memories!  https://t.co/0cB0EzebyN"]["Under #Trumpcare health care premiums will rise for most families &amp; some older Americans could see their costs rise by more than $13,000 https://t.co/qMKNZCZPIQ"]["@MINationalGuard Shared my experiences from my recent visit to Latvia &amp; Lithuania w/ MI Estonian, Polish, Lithuanian &amp; Latvian community leaders https://t.co/Y820t6ZoEM"]["Last month I traveled to Latvia and Lithuania to meet w/ @MINationalGuard units &amp; observe anti-Russian aggression training exercise"]["Proud to see Michigander Col. Kennedy &amp; his family honored for serving our country with valor https://t.co/DXUuTf36mC"]["My office can work with federal agencies to help seniors receive Medicare benefits - call my office toll free at (844) 506-7420 https://t.co/jQ3hPucAhJ"]["#Trumpcare will have a major impact on Michiganders w/ pre-existing conditions like Amy. Read her story https://t.co/VjTFBmsIjY"]["#Trumpcare cuts Medicaid by $772 billion, dismantling school telemedicine programs that kids in rural MI depend on https://t.co/OvYaRZWf3L"]["Had a great time celebrating #FourthofJuly at Traverse City’s @cherryfestival &amp; taking part in @ConsumersEnergy Heritage Parade https://t.co/sQINRNF1zx"]["Amazing celebration of Northern Michigan’s heritage &amp; history at today’s Grand Traverse Band of Ottawa &amp; Chippewa Indians pow-wow https://t.co/n1Xs4pVLOh"]["Today America celebrates its independence &amp; the birth of our great country. Hope everyone has a safe &amp; fun #FourthofJuly w/ friends &amp; family https://t.co/Oo4juok9Z5"]["Met w/ realtors from Northern Michigan for an important discussion on how to help more Michiganders become homeowners https://t.co/UK5hn9BGXy"]["#Trumpcare will have a major impact on Michigan children like Erin who need Medicaid to afford care. Grateful I can share her story https://t.co/MwawWAEn6l"]["Proud my amendments to strengthen security &amp; protect travelers outside of TSA-screened areas in local airports passed out of committee https://t.co/ajnQzRGbOi"]["Michiganders are sharing their health care stories w/ me &amp; telling me they are fearful that #Trumpcare could jeopardize their coverage https://t.co/Ne2SFQ1svo"]["#Trumpcare will have a major impact on Michiganders like Stefanie who need affordable health insurance. Proud to share her story https://t.co/FLym1dAkt2"]["No one should ever go bankrupt because they are sick and no one should ever die because they can’t afford quality insurance https://t.co/wjyo1Kr3AX"]["Headed to the floor to talk about the many Michiganders impacted by the GOP health care bill - tune in! https://t.co/CzZLJAGoVq https://t.co/KR8f1mmdcF"]["This #PTSDAwarenessDay join me in learning more about how PTSD impacts lives. Find resources &amp; learn more: https://t.co/FDm1HXzbKQ"]["These provisions will allow airports to use FAA funds to protect against incidents outside of TSA-screened areas"]["Airports remain a common target &amp; I have intro’d provisions to strengthen security to protect travelers &amp; visitors https://t.co/peegWaRhxO https://t.co/pXPFeAz1Vk"]["It’s time to come together &amp; do what is best for the American people - make quality health care affordable for all Americans"]["Instead of buying time to twist arms &amp; secure votes, Senate GOP should start over &amp; work w/ Democrats on bipartisan solutions"]["On 2nd anniversary of the SCOTUS decision to recognize same-sex marriages, I’m proud to celebrate their victory for #LGBT equality https://t.co/fNAXu7nWrB"]["April &amp; Jayne of MI wanted to raise their children w/o fear of their family being torn apart if something happened to one of them"]["60% of MI seniors living in nursing homes rely on Medicaid, #Trumpcare cuts could force retirees out on the streets. https://t.co/TvVv5hpHmt"]["Proud to join @101wrif &amp; @ABC_Harley to honor veterans &amp; thank them for their service by taking part in the Harley's Heroes motorcycle ride https://t.co/z1HAYX749h"]["Warmest wishes to Muslims across Michigan and America on the joyous holiday of Eid al-Fitr! #EidMubarak"]["Happy 78th birthday @USCGAux &amp; thank you for helping to keep the Great Lakes &amp; the rest of America’s waterways safe https://t.co/AaBBRqSBDS"]["It’s outrageous GOP is jamming their health care bill through the Senate! I agree w/ @AARPMichigan, there should be hearings &amp; public input https://t.co/XpgVyJ31ZE"]["This reaffirms urgent need to act &amp; prevent Asian carp from reaching the Great Lakes basin https://t.co/Sv0VvpMLSb"]["Planning to visit DC? My office can assist Michiganders interested in touring national landmarks. For more info: https://t.co/833tEYUzkC https://t.co/WpTAv4shoS"]["Great to talk with &amp; congratulate @int_acad students on placing in the top 10 of @SIFMAFoundation Stock Market Game Capitol Hill Challenge! https://t.co/tFQ5Y1nvli"]["Congrats to the Michigan winners of the Congressional Award Gold Medal! Honored to recognize your incredible hard work! https://t.co/ygrp4svvB5"]["Senate GOP wrote a health care bill in secret &amp; w/o input from the public, now they are rushing a vote w/o hearings or input from others https://t.co/DCCNqoWyqN"]["This is not about if or how the GOP can count to 51 votes. This is about people’s lives &amp; Americans deserve answers on #Trumpcare https://t.co/HWUn2W5PAF"]["As a lifelong motorcycle lover, I'm proud to join my co-chair @SenJoniErnst &amp; @harleydavidson to launch our first Motorcycle Caucus event! https://t.co/HwNJmsCLYq"]["I’m happy to attend any meeting on the secret #Trumpcare bill, just waiting on Republicans to give us a time and place https://t.co/2yGnD7IgZK"]["Thoughts are w/ injured officer &amp; family in Flint, I wish him a speedy recovery &amp; will monitor the situation closely https://t.co/W3UennCPXL"]["Expanded Medicaid helped save the lives of many Michiganders battling opioid addiction. #Trumpcare could end that https://t.co/EBFDW9SBoZ"]["Excellent to observe @NATO &amp; @USArmy exercise Saber Strike in Lithuania that is essential to supporting our allies in Eastern Europe https://t.co/tVocl1wlIu"]["Veterans had our back—now we must have theirs. My office can help w/ disability benefits, access to VA care, military records &amp; more https://t.co/h76KelSKh8"]["#Trumpcare could skyrocket coverage costs for countless MI seniors, yet Senate GOP refuses to hold public hearings https://t.co/rDJK2sNvOA"]["#Juneteenth reminds us how far we've come toward healing the wounds of slavery over the last 150 yrs, but the struggle for equality persists https://t.co/AtaugjIESd"]["Saddened by deaths of 7 @USNavy sailors of USS Fitzgerald. My thoughts go out to families, friends &amp; fellow sailors dealing w tragic loss"]["#OTD Sally Ride became 1st American woman in space! She continues to be an inspiration for women &amp; girls to pursue science &amp; engineering https://t.co/U9Rnnbff2s"]["Happy #FathersDay to all our Dads! Today I’m honored to celebrate the memory of my dad &amp; thankful to be a father to my 3 wonderful children https://t.co/xqTiWXq1OT"]["Medicaid covers 3 in 10 Americans battling opioid addiction, #Trumpcare slashes substance abuse assistance &amp; puts millions at risk https://t.co/8mLArxsMqJ"]["Proud to stand w/ @AARPMichigan against #AHCA which will force Michigan seniors to pay thousands more for health care coverage https://t.co/q5xdm0ionW"]["Congrats to students from @BerkleySchools for placing 4th at World Robofest w/ a robot that fixes potholes! https://t.co/oYapICb9kK"]["Senate came together w near unanimous vote for Iran &amp; Russia sanctions - clear message to bad actors who sow instability, threaten US allies https://t.co/Kv8BDBD50l"]["If you’re a Michigander needing help accessing your Social Security benefits, call my office toll free (844) 506-7420 so we can assist you https://t.co/FFGKjjSSI0"]["W/ Great Lakes funding &amp; environmental protections under attack, groups like @MichiganLCV are vital in the fight for #cleanair &amp; #cleanwater https://t.co/JjlpdDCuGu"]["#OTD in 1775 the Continental Army was formed. Proud to celebrate @USArmy on this 242nd #ArmyBDay w/ a hooah to our soldiers https://t.co/j8O8pke6ef"]["@SenateCommerce ACM’s groundbreaking research &amp; expertise will help ensure this lifesaving tech will be safely and swiftly deployed on our roads"]["@SenateCommerce MI is leading development &amp; testing of self-driving vehicles that will keep U.S. a leader in innovation &amp; create jobs"]["Honored to have John Maddox represent Michigan’s American Center for Mobility at today’s @SenateCommerce hearing on self-driving cars https://t.co/cYp9liojMh"]["Shocked by attack on GOP members of Congress, staff. Prayers for my colleagues, others who are injured &amp; thankful for USCP, first responders"]["Congrats to @griffinshockey on winning their second Calder Cup! #GoGRG"]["Great meeting w/ Steve Kroll @ThunderBayNMS about their work to preserve historic shipwrecks in the Bay and protect our Great Lakes https://t.co/CZXCnDajG9"]["Congratulations to South Haven’s James McCloughan on receiving the Medal of Honor! https://t.co/EOJ9DG5oZM"]["Honored to receive Detroit Veterans Tribute Award from @voami. Thank you to VOA for your incredible advocacy on behalf of Michigan veterans https://t.co/1jiTBKVuhJ"]["Behind closed doors, GOP is drafting a health care bill that looks a lot like the bad version passed by the House https://t.co/3CmDobeP3T"]["Joined @SenStabenow, @CoryBooker at @techtowndetroit to talk with local small businesses that are leading innovation in countless fields https://t.co/1LnQJN8Tir"]["Honored to be a part of @michigansierra 50th anniversary celebration, thank you for your committed service to protect MI's natural resources https://t.co/oituDktJsj"]["It's time to invest in our country &amp; ensure economic security for future generations by upgrading the Soo Locks. https://t.co/M16eTUHXRv"]["Thanks for having me in the studio in Ann Arbor https://t.co/xLrqHaz4iD"]["ICYMI via @NBC24WNWO: “Peters Talks Trade and American Manufacturing in Monroe” https://t.co/yh3Lvsu4uG"]["Proud to celebrate #WorldOceansDay &amp; thank the @USCG for the important role they play protecting our oceans &amp; security"]["We cannot continue to rely on infrastructure investments made by our grandparents and great-grandparents. We must upgrade the Soo Locks. https://t.co/tprUgMABtd"]["Americans deserve to know the truth about Russia’s efforts to undermine our democracy, this investigation is too important to be stymied"]["Today's #ComeyHearing is even further evidence that we must get to the bottom of the facts behind Russian interference in our elections https://t.co/VLx6I4EVT3"]["Thank you @AARPMichigan for opposing #AHCA &amp; pounding the pavement on Capitol Hill in defense of Michigan seniors &amp; their families https://t.co/2l4mfnouH3"]["@SenCapito Investing in preventative care for diabetes will save taxpayer $ by reducing Medicare costs &amp; help seniors live healthier, longer lives"]["My new bill w @SenCapito expands Medicare’s nutritional programs to help prevent costly, chronic condition of diabetes in more seniors https://t.co/t7QOtohg3L"]["Honored to join @CoastGuardFound for a Tribute to @USCG. Thank you for keeping the Great Lakes &amp; our coast safe &amp; secure. https://t.co/fHQxUYHj3d"]["Trump &amp; Betsy DeVos want to slash @usedgov budget, inflicting painful cuts in after school programs for MI kids &amp; training for MI teachers https://t.co/A0lEa7EsPa"]["Today we honor the members of the Allied Forces who stormed the beaches of Normandy &amp; began the liberation of Nazi-occupied Europe. #DDay https://t.co/bupq6omAhN"]["@VENTOWER I'll always stand up for Michigan workers &amp; fight for level playing field to help US manufacturers compete fairly-no matter who is in the WH"]["@VENTOWER We also discussed unfair trade practices - like Chinese steel dumping - that harm Michigan manufacturers, make it harder for them to compete"]["Enjoyed visiting @Ventower - Michigan’s first wind tower manufacturing facility - meeting w employees &amp; seeing firsthand their quality work https://t.co/TKMM8CbHKr"]["Thinking of London &amp; all those injured or killed in tonight's horrific attacks. US stands w the United Kingdom in the face of this tragedy"]["As the Ranking Member of the subcommittee that oversees federal spending, it's hard to save taxpayers money if Trump won’t provide info"]["By ignoring lawmakers' oversight requests, Trump Administration is ignoring the concerns of millions of Michiganders https://t.co/BqNqEoppbu"]["Great visit w the @USCG in Sault St. Marie! I’m proud to work with the Coast Guard to advance commercial shipping &amp; protect the Great Lakes https://t.co/iRRjhisoO5"]["Thanks @AmeriCorps for supporting Michigan &amp; helping to make a difference for countless Michiganders https://t.co/FDaIRv7ouF"]["Proud to celebrate #Pride2017 to support, honor &amp; celebrate the #LGBTQ community! https://t.co/rI6LMFAtrl"]["The Soo Locks need an upgrade to support the needs of the 21st century, we cannot build our future on the investments our grandparents made https://t.co/lVPxG8ZIi0"]["MI’s unique combination of defense &amp; automotive manufacturers have allowed @TARDEC_PAO &amp; MI to lead the way in self-driving vehicle tech https://t.co/cAcbItCaDc"]["Proud to join @SenStabenow &amp; MI delegation in intro’ing a bill to help advance the process of upgrading the Soo Locks https://t.co/9jQ6rBjieR"]["Trump’s decision to leave #ParisAgreement means America loses economic opportunities to foreign businesses, countries focused on the future"]["Glad to join @GLBN_L5 to discuss how we can work together to protect the Great Lakes for future generations https://t.co/auIxCuVXMq"]["I strongly support Selfridge as a host for the F-35 mission, &amp; I'm working to build support for the base &amp; the servicemembers who work there"]["Selfridge Air National Guard Base has the talent &amp; support of MI's defense manufacturing industry needed to host the F-35 mission https://t.co/Fhrv273p1s"]["America should be global leader in tackling climate change for good of our environment, our economy &amp; our national security #ParisAgreement"]["Nearly 200 nations &amp; global business community see the need to address climate change through #ParisAgreement - why can’t President Trump?"]["A new missile defense site at Fort Custer in Battle Creek would help protect homeland &amp; create new job opportunities https://t.co/tkeGRQA6bT"]["Honored to join Michigan Veterans Foundation to show my respect for those who died protecting our nation. #MemorialDay17 https://t.co/TjCA31lXPO"]["Today we pay tribute to our fallen servicermembers. We owe them &amp; their families debt of gratitude that can never be repaid, #MemorialDay17 https://t.co/cansXHqkuE"]["Rode along Lake Huron shoreline today - stopped in Lexington and enjoyed the views. A great ride usually includes a Great Lake! https://t.co/Flk5iPuS1Z"]["#RamadanMubarak as Muslims in Michigan and across the country begin a special time of reflection and prayer during the Holy Month of Ramadan"]["Thank you to all our soldiers, sailors, airmen &amp; Marines for your service &amp; to the families who support them. #MilitaryAppreciationMonth https://t.co/d2CC4nEyKu"]["Honored to receive the Spirit of Service Award from the @gpwarmemorial &amp; congrats to @JustinVerlander for also being recognized https://t.co/91OA4LThEm"]["ICYMI via @WLNS: “Peters, Stabenow introduce bills to protect the Great Lakes from pipeline oil spills” https://t.co/j7DWegKmyB"]["Proud to celebrate &amp; honor the enormous impact of #JewishAmericans on U.S. history, culture &amp; society during Jewish American Heritage Month"]["Agree w @LSJNews - cuts to FRIB doesn't just harm the local economy, it also stifles U.S. scientific discovery. https://t.co/FhQweqQEkJ"]["#TrumpCare will raise premiums on many older Michiganders and out of pocket cost for others  https://t.co/Q3T0CPynw7"]["These bills will help to ensure both the environmental and economic health of the Great Lakes. https://t.co/YBueY9Kqnh"]["@SenStabenow &amp; I are intro’ing bills to ensure pipeline regulations &amp; oversight take into account unique needs of the Great Lakes"]["The Great Lakes ecosystem is unlike any other in the world &amp; must be protected from the possibility of devastating oil spills from pipeline"]["The numbers don’t lie, this is a bad bill for Michiganders!"]["Now we know now the true impact of #TrumpCare &amp; it’s enormous! 14 million people will be w/o coverage in 2018 &amp; 23 million by 2026"]["House Republicans pushed through a bad health care bill before knowing how many\npeople would be without health coverage"]["FBI &amp; America’s intel agencies should be free from political interference. Trump either doesn’t know or doesn’t care https://t.co/5w89P511Ml"]["We should invest in manufacturing, small businesses &amp; education, but this budget only offers cuts that would stifle economic growth"]["Trump’s proposed budget makes significant cuts to critical programs that boost Michigan’s working families"]["Thrilled to be at the grand opening of @mi_sci 4D Theater, which will help to inspire young innovators to use their talent in MI https://t.co/XSR2fzJzxR"]["Health insurers agree - Trump is sabotaging the individual markets, not #ACA. https://t.co/pkkj0LYJ14"]["Joined @GM &amp; @NextEnergyMi for great chat on the future of mobility &amp; how it is creating new opportunities for local entrepreneurs #DETSW17 https://t.co/q8WmBJbMUv"]["Thank you to @IndivisibleMich for putting on this great event &amp; helping to ignite this unprecedented grassroots engagement!"]["With your help we can make good-paying jobs, affordable health care, quality education, &amp; secure retirements a reality for all Michiganders"]["Great speaking w energized crowd at #IndivisibleFair &amp; encouraging them to continue to fight to make their voices heard! https://t.co/xPFI9I1wW3"]["Honored to celebrate the legacy of David DiChiera, thanks for using your passion for opera to help revitalize Detroit https://t.co/GmUpdVHveM"]["ICYMI via @WZZM13: “Peters introduces bill to make it easier to promote part-time firefighters &amp; save fire departments money.” https://t.co/M7DYt3dM1z"]["Cosponsored a bill that uses revenue raised on public land &amp; water to preserve MI &amp; US natural treasures. https://t.co/GMEntCOky7"]["Enjoyed meeting w Michigan realtors from @nardotrealtor to discuss how we can help more Michiganders become homeowners. https://t.co/O7h2bnZLqD"]["Special counsel investigation &amp; Senate oversight are about 1 thing: our nat’l security. Watch my @MSNBC interview on Russian meddling https://t.co/zfuxhPMtbB"]["Proud to support Michigan’s booming beer industry! https://t.co/oB9gXuyXxF"]["Happy 100th Anniversary to @AmericanConey – a Detroit original! https://t.co/k79gejcioH"]["@SenStabenow @SenAlexander Proud to say MI &amp; the U.S. are leading the way in development of automotive tech &amp; Vehicle Innovation Act will help keep us on that path"]["Intro’d bill w @SenStabenow &amp; @SenAlexander to support R&amp;D for advanced, clean vehicle tech  https://t.co/cPBV0ENoGx"]["Congratulations to our Detroit chess teams for winning big at the national championships! https://t.co/DNQwWmyHEy"]["Appointment of special counsel is a good first step toward a non-political, fact-driven Russia investigation https://t.co/ARRdxX2OYx https://t.co/XpOdqzebK0"]["The American people deserve to know the facts about Russian interference &amp; we must ensure the FBI remains free from political interference https://t.co/9l1JUzMvVn"]["Proud to welcome Michigan police officers to Washington for #NationalPoliceWeek. Thank you for protecting and serving our communities. https://t.co/QiRJgZIUVc"]["Proud to support the Helping Veterans Exposed to Burn Pits Act so VA can develop better treatment for Post-9/11 vets https://t.co/Alp1ZisgW4 https://t.co/H9L9wYKW0G"]["When U.S. servicemembers suffer from exposure to toxic burn pits in Iraq &amp; Afghanistan, we must be prepared to treat them"]["Glad to hear that @SenThomTillis is feeling better. Look forward to seeing you back at the Capitol soon! https://t.co/WaNoBLTMmM"]["This is further evidence of need for DOJ Inspector General to look into political interference of FBI Russian investigation. Read my letter https://t.co/xK9bp7GSKs"]["If Trump asked FBI to end Flynn, Russia investigation, that undermines our independent system of justice https://t.co/jblTYkG84f"]["Intro’d bill w @SenatorCollins to help fire departments save money &amp; retain skilled first responders. Read more: https://t.co/tpIlYnMr3Z https://t.co/tfTvYUXXF3"]["Great news that TEALS program will be adding 11 MI schools next school year to help increase computer &amp; technology skills in our state! https://t.co/W05uGJcR4f"]["Wonderful lunch discussion w student leaders from my alma mater @almacollege about our shared experiences &amp; leadership lessons from Alma https://t.co/2b2exNKrdT"]["Russia is not our friend. It’s alarming if President Trump is exposing highly sensitive classified info to adversary https://t.co/0R1G6JYx5C"]["A heartfelt thank you to all fallen &amp; injured peace officers who sacrificed to protect their communities #NationalPeaceOfficersMemorialDay https://t.co/HOiD05KqaC"]["Happy Mother’s Day to all our wonderful MI mothers! Glad to be w 3 great mothers in my life - my mother, my wife &amp; my mother-in-law https://t.co/7maeQv77qu"]["ICYMI via @wzzm13: “Peters calls for a special prosecutor to investigate Trump’s Russia ties &amp; asks Senators to put country ahead of party” https://t.co/gT9EGCz7df"]["Tune in to @smerconish on @CNN this morning where I’ll discuss Trump's firing of Comey &amp; need for independent investigation"]["\"People are asking a lot tougher questions about trade deals.\" Read more about my views on trade via @washingtonpost https://t.co/1eOVPPugh8"]["Joined @SenatorCarper @SenKamalaHarris @SenatorHassan to request DOJ IG look into political interference w FBI probe https://t.co/vRlkbyS35N"]["Congrats to Sarah and Ewan, MI’s @PruSpirit youth volunteer award winners! Thanks for your commitment to helping others in your community https://t.co/hvCPXV5opE"]["Proud to support Michigan family farmers by leading the charge for strong @usdafsa loan program funding. https://t.co/RdisF6JiCC https://t.co/UzKoyQJvrs"]["Detroit #QLINE shows power of what can be accomplished when we come together to make investments that benefit our entire community &amp; region https://t.co/KUQRkBLE4h"]["The questions keep mounting on Trump’s ties to Russia &amp; the American people deserve transparency &amp; answers on Russia &amp; our elections https://t.co/UnjWrsiRQq"]["Glad to join @Microsoft this morning to discuss how we can foster self-driving car innovation &amp; development. https://t.co/qYnyJQGDG1"]["Happy birthday @NSF! Thanks for promoting scientific research to advance our economy, enhance our security &amp; sustain our global leadership."]["Trump’s Russian ties are festering, foreign infection &amp; could weaken our democratic system. Special prosecutor is needed to address it. https://t.co/Vwvp3Anok0"]["Happening soon: I’ll speak on Senate Floor re: Comey’s firing &amp; Trump’s gross conflict of interest appointing next FBI Director https://t.co/dKMMqRkF4A"]["Trump meeting w Russian diplomats a day after firing Jim Comey only raises more question about his ties to Russia https://t.co/InTTuhr1Yq"]["Trump can now hand pick the person charged w leading investigation into his campaign ties w Russia. No chance of impartiality, transparency https://t.co/8RdhrjcsAm"]["Trump firing FBI Director investigating his ties to Russia is just latest in long list of reasons why we need special prosecutor re: Russia"]["#Trumpcare would strip away tax credits 8 million veterans rely on for affordable care. We should #CareForVets not give them a tax hike"]["Teachers play an integral role in preparing our children for the future. Proud to celebrate &amp; thank you for your work. #NationalTeachersDay https://t.co/f8wU9yXWMH"]["Thank you @RFKChildren &amp; @NCYL_FosterEd for your support of the #CONNECTAct"]["A key to America’s economic success in the future is critical investments in scientific research now. Read more in my @APSPhysicsDC op-ed https://t.co/1axIFaEqvQ"]["Looking forward to joining @MildredGaddis on @am1200wchb soon to discuss my bill to help at-risk children in Michigan &amp; across the country."]["Thank you to all WWII veterans, including my father Herb, who served in Europe &amp; helped carry the Allies to victory a/g tyranny #VEday https://t.co/lqyNQa01IN"]["Proud to join members of the metro Detroit community &amp; @walkforisrael in celebrating the establishment of the modern Jewish State. https://t.co/DHnuCvmeQi"]["Visited Detroit International Academy to check out their great computer education program &amp; their upcoming partnership w @Microsoft https://t.co/uBpwzFYohV"]["Honored to attend the @NatUrbanLeague Leadership Breakfast &amp; catch up with MI leaders Joseph Jones &amp; N. Charles Anderson https://t.co/G3ZOwvjIrH"]["#AHCA will cause more than 20 million Americans to lose coverage. Even in its latest form, this is still a bad bill! https://t.co/nO4G2L4m3U"]["Even with the additional subsidy, Americans w preexisting conditions are likely to face higher cost plans &amp; less coverage options."]["The latest version of #Trumpcare #AHCA doesn’t guarantee care for Americans who need it most https://t.co/7DMApjUmxm"]["Pleased the Senate approved my bill to predict space weather that could cripple infrastructure &amp; disrupt daily life https://t.co/UAGKpRVlC2"]["One piece of the American Dream is the ability to retire w dignity &amp; save enough to pass something along to the next generation. https://t.co/QSBZDhOfny"]["Women deserve equal pay for equal work. Proud to cosponsor the Paycheck Fairness Act &amp; support the fight for #EqualPay Retweet if you agree! https://t.co/xtU2Q0dDQ9"]["GOPs disastrous #Trumpcare #AHCA bill would jeopardize care for people w preexisting conditions &amp; cut essential benefits like mental health"]["Glad to see the GLRI will get the funding it needs in government spending deal, but the fight to protect Great Lakes funding is not over. https://t.co/5r44Mivb0i"]["Proud of Andrew Gikas who I nominated to @AF_Academy. Although I am a Navy fan, I'm glad to see he's enjoying so much success with his team! https://t.co/thuZhkLM1W"]["Small businesses are driving our economy &amp; employing millions of Americans. Proud to celebrate small businesses during #SmallBusinessWeek. https://t.co/H0b4TO5f68"]["This is great news for the Great Lakes, but we must continue to fight against Trump’s proposed cuts &amp; protect Great Lakes funding"]["Glad to see funding to protect the Great Lakes is included in the bipartisan agreement to fund the government."]["Congrats to all the 2017 @UMich grads - especially my daughter Madeleine. We love you and couldn't be prouder of you! https://t.co/iqeHQlZK36"]["Trump promised a lot to American workers, but after #100DaysOfTrump we still have no plan to boost manufacturing &amp; exports #BrokenPromises https://t.co/XdopILeccP"]["Happy Birthday to my good friend &amp; partner in the U.S. Senate @SenStabenow"]["Trump promised to name China a currency manipulator his first day in office. It's day 99 &amp; he hasn’t kept his word #BrokenPromises https://t.co/5arziBPXNC"]["Proud to return to my alma mater @_WayneLaw to receive the Distinguished Alumni Award. Thank you for this wonderful honor! https://t.co/SPTMMuSfGR"]["Pres. Trump promised to #DraintheSwamp, then appointed big oil ally Scott Pruitt as head of the EPA. https://t.co/gtl9XQwJsk"]["Pres Trump’s Ed Sec Betsy DeVos is putting loan debt collectors ahead of students. So much for #DrainTheSwamp. https://t.co/7gCMQwbEYw"]["I may root for the Spartans but @CoachJim4UM and I stand together in support of the Legal Services Corp. https://t.co/zP8FL8ZTXE"]["Two new members of #TeamPeters helped us out today, my staffer Chris’ sons. Great to have them in the office for #takeyourchildtoworkday https://t.co/SHAgZR7EE1"][".@HistoricVehicle Thanks @senrobportman for joining me in supporting this bill that helps preserve American auto history &amp; innovation for future generations"][".@HistoricVehicle I’m honoring the cultural &amp; economic impact cars have had on America by introducing the bipartisan National Historic Vehicle Register Act"]["Stopped by @HistoricVehicle #CarsAtTheCapital to take a look at American auto history like the McGee Roadster 1932 Ford V8. #drivehistory https://t.co/RPqZD1hw9A"]["This bipartisan bill would require federal agencies to preserve public access to datasets &amp; prevent the removal of existing open datasets"]["That is why @SenCoryGardner &amp; I have intro’d the Preserving Data in Government Act to protect taxpayer-funded research"]["Scientists, farmers and small business owners rely on this data for everything from long-term planning to innovative product development"]["Research data that has been collected using taxpayer dollars should be publicly accessible and easily searchable"]["Pres @jeffabernathy of my alma mater @almacollege is working w colleges in MI to support veterans seeking degrees, great to hear his ideas https://t.co/Buuxl0XClv"]["Today is World IP Day- Proud to join @SenatorRisch in protecting small business IP with our Small Business Innovation Protection Act. https://t.co/Wgnq5h7SLZ"][".@SETCVD_WG Commitment to science is especially critical now as Trump Administration rolls back science based policy &amp; cuts $ for fed’l science programs"]["Honored to receive the @SETCVD_WG George E. Brown Science Award for my work to advance science &amp; research in the U.S. Senate. https://t.co/tEtmBGyWaA"]["Met w @WWP to discuss improving veterans’ access to care. Thank you for your service &amp; for continuing to fight for your fellow veterans. https://t.co/X63reHxbAJ"]["Congrats to Jadal &amp; Taimor @a2HuronHigh @PTOCouncil for your academic success! Thx for representing MI so well. https://t.co/5uL1k65rVS"]["President Trump said he'd “Buy American, Hire American” but he isn't leading by example  #BrokenPromises https://t.co/vv2ygU0DK8"]["Great meeting with @michiganstateu Education Policy Fellows who are working to shape the future of education &amp; prep our youth for success https://t.co/3RfMhdttQ0"]["Had a lively discussion on politics &amp; policy w @CMUniversity students tonight. Future is in good hands w these soon to be graduates! https://t.co/Vr3UDPJ3SD"]["Today we remember the 1.5 million Armenians who were murdered or marched to their death 102 years ago during the Armenian Genocide."]["Great discussion w @MichiganIsrael defense trade mission. MI &amp; Israel defense sectors are working together to keep both our countries safe. https://t.co/6V2lnEhc2E"]["Today on Yom HaShoah we remember the six millions Jews &amp; millions more murdered by the Nazis in the Holocaust. #NeverForget &amp; #NeverAgain"]["Great to welcome my friend &amp; colleague @SenWarren to MI for @DETROITNAACP Fight for Freedom Fund Dinner! https://t.co/pcxAj6IYBR"]["Proud to celebrate #EarthDay by fighting for the Great Lakes &amp; standing with the countless Americans who march for science https://t.co/mWhgJGi6P0"]["3,500 MI patients are waiting for an organ transplant. You can help by joining the donor registry, visit @GiftofLifeMich to learn more. https://t.co/zDV77SeJQx"]["ICYMI via 9&amp;10 News: “Peters visits Gladwin County dairy farm to better understand the challenges Michigan farms face” https://t.co/PjYTAlVRpJ"]["Proud to cosponsor bill creating nat’l registry for firefighters suffering from cancer. Data will help ID preventive techniques &amp; treatment https://t.co/8kW3RVEcda"]["Eliminating the Essential Air Service would have disastrous economic effects on rural communities throughout Michigan. https://t.co/CONCMHZDFF"]["Airports are critical economic lifelines for rural communities, boosting tourism &amp; allowing people to sell goods &amp; services in more markets"]["Congratulations to @MichStatePolice on 100 years of service to our state. Thank you for protecting our communities with courage &amp; honor. https://t.co/TozTneP9tZ"]["Proud to cosponsor bill requiring the VA to provide better access to services for women veterans like maternity &amp; newborn care. https://t.co/rRBe1OnYvw"]["More women than ever are serving our nation in combat, but the VA is behind in providing services to meet the needs of women veterans."]["ICYMI via @wwmtnews: “Peters visits Kalamazoo YWCA to highlight bill protecting woman and pets from domestic violence” https://t.co/5JvBLpQ4Eo"]["Trump’s proposed budget includes dangerous cuts to key water infrastructure programs that Michiganders rely on for clean drinking water https://t.co/awHO5HBOCY"]["Great taking part in @CMUniversity Griffin Policy forum, discussing how to address the challenges we're facing - locally &amp; globally. https://t.co/il3VNMYzCM"]["Congratulations to @PAKymWorthy https://t.co/wjFVxC9s7m"]["I’m working to ensure farmers have access to capital through affordable loan options like the Farm Service Agency’s loan program https://t.co/eEsNvUWI1t"]["It was great to be at the Iciek Dairy Farm in Gladwin to see firsthand this family-owned dairy operation that helps drive the local economy. https://t.co/r4FuwzLUIS"]["I'm committed to fighting a/g closure of EPA Region 5 office, which would threaten Great Lakes &amp; public health in MI https://t.co/N8IjtOy07Q"]["Happy Easter! Hope all those celebrating are enjoying blessed and special time with family and friends."]["Americans' health care should never be used as a political bargaining chip! https://t.co/hmxZeP0AVm"]["On this historically significant day for Sikhs, I’m wishing our Sikh American friends &amp; neighbors a happy #Vaisakhi"]["It's #NationalParksWeek! Isle Royale is one of the most treasured places in MI. What’s your favorite Isle Royale memory? #FindYourPark https://t.co/9P67CEImgK"]["Enjoyed seeing MI students' hard work at the @FIRSTweets Robotics State Championships! Great to see young minds interested in engineering. https://t.co/HRXmntQcYw"]["Had the chance to thank and honor some Flint area Vietnam veterans today. Thank you all for your service and sacrifice. https://t.co/2iqrAc5YTE"]["Trump’s refusal to label China a currency manipulator shows he is unwilling to side with American workers against unfair trade abuses. https://t.co/37qemZqw0Y"]["From corn to soybeans to cherries, MI’s ag sector generates $100b in economic activity. Great to visit McManus Farms w @MI_Corn yesterday https://t.co/6HlnM09tbd"]["MI small businesses provide fed’l gov't w/ wide variety of goods &amp; services. My bill helps protect them from scammers, grow their businesses"]["Visited @mmexperiences in Lansing to announce my new bill that helps small businesses compete &amp; win fed'l contracts w/o draining resources https://t.co/gBk36x9hUG"]["Piping water from the Great Lakes to the Southwest is a misguided idea &amp; should be completely taken off the table! https://t.co/Dd6kCu66gc"]["MI's defense manufacturers – like General Dynamics – are developing tech to keep our servicemembers safe &amp; creating jobs for Michiganders. https://t.co/qJUABE05LX"][".@YWCAKalamazoo provides a safe haven for domestic violence victims, children &amp; pets. PAWS act will allow more shelters to do the same. https://t.co/AgLgvcp9ZA"]["Took part in @GM’s handoff of Chevrolet Colorado ZH2 fuel cell to @TARDEC_PAO – great example of how MI is creating innovative tech. https://t.co/MvfJ3t8V08"]["To Jewish families in Michigan &amp; everywhere else gathering around the Seder table tonight, best wishes for a Happy Passover. Chag Sameach!"]["We must preserve and strengthen Social Security, and I will fight for that everyday I am in the Senate. #RetirementWeek https://t.co/41LAMedcmI"]["Too many Americans don't have access to pensions or retirement plans. A secure retirement cannot become a relic of the past. #RetirementWeek https://t.co/sqCYtVXGvL"]["Honored to be recognized by @HumaneSociety &amp; proud to partner with them on important animal protection issues. https://t.co/FSWgb9dlwf"]["Proud to stand w MI firefighters against Trump's proposed cuts to FEMA grants, so they can continue to save lives &amp; protect our communities. https://t.co/mRhheWD53c"]["I am disheartened that Judge Gorsuch often fails to take into account the human face behind each case. https://t.co/hE6fRMzfq7"]["I find it disheartening that Judge Gorsuch has regularly sided against everyday Americans’ rights https://t.co/i8imWEtVjO"]["@ChelseaClinton @NYPD After 29 days we haven't received an answer from DHS, DOJ or FBI. I, &amp; 99 other Senators, await their response. DHS apologized for the delay https://t.co/hOAK6acKiC"]["Had a great discussion w @MIBldgTrades workers on how we can build an economy where anyone who puts in hard day’s work can get ahead. https://t.co/AgI3zbiDJE"]["Judge Gorsuch’s previous rulings indicate he believes that corporations have greater rights than individuals. https://t.co/ycWzYh1Q2R"]["Trump can start keeping his campaign promises to Michigan workers by taking a hard line on trade violations w Chinese President Xi. https://t.co/IMGJ4ipNxq"]["Spring interns from my Washington, DC office have worked hard this semester, so it was great to have a chance to thank them over lunch. https://t.co/qb2AvhHuOl"]["#OTD in 1949 the NATO treaty was signed. As Russian aggression grows, NATO remains central to countering Putin &amp; keeping the world safe. https://t.co/DihCv0XeD4"]["Joined @SenatorHeitkamp to call for GAO review of Trump hiring freeze to ensure tax dollars are being spent wisely. https://t.co/JIsIRo83Qs"]["I’ve loved riding motorcycles since I was a kid, so I’m delighted to join @SenJoniErnst in starting bipartisan Senate Motorcycle Caucus. https://t.co/x5Bdf6vhdV"]["In MI women earn 74 cents for every $1 men earn. #GenderPayGap hurts entire families, affecting retirement, healthcare coverage &amp; more https://t.co/ThhpzSo1P4"]["Fun fact: the wood used for the court at tonight's #FinalFour Championship game comes from MI's Upper Peninsula! https://t.co/n4EW620NmX"]["Proud of the members of my DC staff who crushed it at the @CUCB 10 mile run this morning! https://t.co/fLlQFDiTfg"]["180,000 Michiganders are living with Alzheimer’s - I am proud to be part of the fight against this devastating disease. https://t.co/zNjEnZMj96"]["Intro’d bill to support @NOAA Great Lakes debris cleanup that preserves &amp; protects Great Lakes ecosystem. https://t.co/71BelsIK9o https://t.co/UdVxxqfEYE"]["Every woman has a fundamental right to make her own decisions about reproductive health. The gov't has no right to stand in her way. #TitleX https://t.co/iok4jZT7aq"]["Joined @SenCoryGardner to intro telehealth bill that expands access to care for seniors in rural &amp; underserved areas https://t.co/FzshAAjIGa https://t.co/Ghv3ThnvIv"]["Honored to join my friend @SenCoryGardner in receiving @COSSADC Distinguished Service Award for work in promoting science &amp; research https://t.co/khk33eSpNh"]["Excited to join @ChrisCoons @SenCapito &amp; @SteveDaines in starting the Senate Chemistry Caucus to support innovation in American chemistry. https://t.co/ehIoPNthIN"]["Met w @mippadvocates to let them know I #StandWithPP and the 2.5 million who rely on @PPFA for access to preventative care. #PinkOut https://t.co/sM07xPR7KU"]["I will vote NO on Judge Neil Gorsuch's nomination to #SCOTUS. Read my full statement: https://t.co/HK7FGldFYi"]["Hosted @DHSgov Sec Kelly in Detroit today to discuss ways to improve trade and security on the Northern Border https://t.co/vsJSQINzsB"]["I believe that the time has come to create an independent, nonpartisan commission to fully investigate Russian interference in US election. https://t.co/pjPbU1auBZ"]["Happy 24 million people will not lose coverage, but there's still more to do. GOP needs to work w Dems to reduce cost &amp; improve health care."]["Had a great meeting with Secretary @madeleine Albright to discuss national security issues and the pressing threat of Russian aggression. https://t.co/Ea4Qx9yJ7K"]["Soon Republicans will vote to raise Medicare premiums for seniors. That’s unacceptable. #ProtectOurCare"]["The Republican plan will increase Medicare premiums on seniors and make it harder for them to get health care. #ProtectOurCare"]["Thanks to my colleagues @BillCassidy, @JohnBoozman, @SenFranken, @RepJaredPolis &amp; @RepTomReed for supporting #MEAA"]["Dual &amp; concurrent enrollment &amp; early/middle college programs help students save money and improve graduation rates #MEAA https://t.co/FgKvG0vOCr"]["Proud to reintroduce #MEAA bill to make higher education more affordable &amp; accessible for American students. https://t.co/hjnzzmcRvv"]["ICYMI via @wzzm13: “Senator Peters Honors West Michigan Vietnam Veterans at Gerald R. Ford Museum” https://t.co/rfpqadd1fO"][".@SenateGOP wants corporations, not consumers, to control personal information. Join me in standing up to protect #BroadbandPrivacy https://t.co/aXsiU9DGgt"]["#OTD in 1941 Tuskegee Airmen began their service. These pioneers like Alexander Jefferson overcame prejudice to defend our country w honor. https://t.co/zMln2w5Pdx"][".@mibigshow thanks for having me on! Proud that MI is leading the way in the next generation of auto tech - self driving cars."]["Proud to join @SenJoniErnst to relaunch the Albanian Issues Caucus &amp; support the democratic aspirations of Albanians in Balkan countries. https://t.co/RomUgktDhB"]["Thank you to @SenStabenow who fights for MI farmers on #AgDay and every day as @SenateAgDems Ranking Member"]["On #AgDay we celebrate MI’s diverse agriculture sector, which contributes over $100 billion to our economy, employs nearly 25% of MI workers https://t.co/vb6VUUNBUd"]["Glad to announce w @SenStabenow &amp; @RepDanKildee Flint area will receive $5.5 million to expand Early Head Start. https://t.co/vXXDEM6nIV"]["Michiganders’ premiums will skyrocket and many will lose their coverage if the GOP healthcare plan becomes law. https://t.co/VSLgYUiLGO"]["Vietnam vets cont’d serving even after the war by fighting for benefits for all vets. Unacceptable some hurt by Agent Orange are denied care https://t.co/rvVzJYNipa"]["Proud to honor &amp; thank these West Michigan patriots who served U.S. during the Vietnam War as part of the 50th anniversary of the conflict https://t.co/QECLuhnvem"]["Great to announce w @SenStabenow &amp; @RepDanKildee that Flint has been approved for $100 million of federal aid. https://t.co/PBOWudGz2S"]["As if 97% cut to Great Lakes Restoration Initiative weren’t bad enough, Trump now wants to eliminate it entirely. https://t.co/Af0nOfPhX5"]["Elimination of fed’l @NIST_MEP funding hurts 345 small &amp; medium manufacturers in MI who created more than 2,000 jobs in 2016 w help of MEP https://t.co/5EUQiWAOgC"]["Trump budget would eliminate @ARPAE program that @michigantech is using to develop automated vehicle tech &amp; reduce energy consumption. https://t.co/84CeMro5SW"]["Rural airports, inc 5 in MI's Upper Peninsula, hit hard in Trump budget w elimination of Essential Airport Service https://t.co/AEa42oRubQ"]["Trump’s budget would do real damage to Michigan families, small businesses &amp; communities and threaten Great Lakes https://t.co/coEFz3fBtX"]["As former Lt. Commander in @navy_reserve, I’m particularly proud to receive @USNavy seal for my office. T/y to all our sailors for serving! https://t.co/PqpQtpz0x9"]["Slashing @USCG budget would hurt nat'l security. ICYMI @Detroitnews: \"Peters Urges Trump not to cut Coast Guard aid\" https://t.co/xJYRQhjy4K"]["@SenStabenow, @RepDanKildee, &amp; I intro’d resolution urging Trump Admin to work w Canada &amp; keep nuclear waste off shores of Lake Huron. https://t.co/dbuV4rqA4v"]["Canada needs to find alternative solution to nuclear waste site that doesn't jeopardize health of Great Lakes https://t.co/TaDgrkIDgY"]["During WWII, an American G.I. met a young French woman &amp; fell in love. That women is my mom &amp; today is her birthday - Happy birthday Mom! https://t.co/NgycYMwJ4I"]["Also congratulations to Isaac Miller, Paden Neely &amp; Stephen Satarino from Milan HS who also placed 2nd w their film on autonomous vehicles."]["Congratulations to Jarod Clark &amp; Mary Sier from @royaloakschools for winning first and second place in @StudentCam."]["Always great to see @mayorbliss and hear about what is happening on the ground in Grand Rapids. https://t.co/XZ667UgXLd"]["Nonpartisan CBO: 24 million fewer Americans will have coverage under GOP health care plan by 2026, 14m in 2018 alone https://t.co/FvU7UwCy77"]["GOP’s health care plan would decrease access to coverage, increase costs and reduce quality of coverage. https://t.co/UgtfyKqRxY"]["Trump’s plan to slash Great Lakes funding by 97% is appalling! I joined a bipartisan letter to Admin expressing alarm over these reports. https://t.co/jKmfHSDz81"]["GOP health care plan will cut coverage for middle &amp; working class families to deliver a big tax cut to the wealthy. https://t.co/APCfaL04Xg"]["Congratulations to Dale and Prathusha on representing Michigan as delegates at this year’s @SenateYouth Program. https://t.co/ouo1bc5jGV"]["Good luck to @msubasketball and @umichbball in today’s @B1GMBBall tournament games! #B1Gtourney"]["The No Heroes Left Untreated Act will create a VA pilot program to use Magnetic e-Resonance Therapy to help treat veterans with PTSD. https://t.co/U1ItcRjTwS"]["Pleased to join @sendavidperdue in an important bill that could help veterans with PTSD. https://t.co/PS4S0OafYS"]["Cuts to @USCG would have grave effects on the safety, health &amp; security of Great Lakes. I joined bipartisan letter to protect Coast Guard. https://t.co/KxKy1qXLIw"]["Heard from MI Ukrainian community leaders about their concerns w unacceptable Russian aggression in Ukraine. https://t.co/U9dgZg1a1j"]["Great to see @Proudtomfrinmi Mike Coast &amp; @FullertonTool Patrick Curry today. MMTC is partnering w small/medium manufacturers to create jobs https://t.co/VWcQsTvPXr"]["On #IWD2017 we honor women of MI who shaped our country - from Rosie the Riveters to Rosa Parks to female singers of Motown #BeBoldForChange https://t.co/gKH5guRwkt"]["T/y to the wide range of law enforcement &amp; civil rights groups alike who support our National Criminal Justice Commission Act https://t.co/vLficFcv5j"]["Creating the National Criminal Justice Commission is critical step to create fairer criminal justice system, reduce crime &amp; recidivism https://t.co/vLficFcv5j"]["Proud to join @LindseyGrahamSC &amp; @JohnCornyn in introducing the National Criminal Justice Commission Act. https://t.co/QcnteiZNMO"]["I will join @MildredGaddis on @am1200wchb around 11:30 a.m. today to discuss the need for a National Criminal Justice Commission. Tune in!"]["Great to welcome @dstinc1913 from across Michigan today &amp; thank them for their work to support local MI communities. https://t.co/MXO3VWS2jz"]["Republican health care plan defunds @PPFA &amp; hurts women who need #PlannedParenthood for cancer screenings, mammograms &amp; preventative care"]["GOP healthcare plan would increase costs for seniors, women and individuals w disabilities, &amp; leave many w/o coverage. https://t.co/ROQJMIgUtX"][".@POTUS wants to slash funding to protect our Great Lakes &amp; MI’s way of life. Tell me what these dangerous cuts would mean to you https://t.co/iCVuV2bf7f"]["All 100 Senators signed our letter - a clear, bipartisan message that Senate stands a/g hate &amp; supports our Jewish neighbors &amp; communities https://t.co/oJaZQqtVQx"]["T/y to @senrobportman @SenBillNelson @marcorubio who joined me in leading letter urging Trump Admin to protect JCCs. https://t.co/e0IAunILYg"]["This @usairforce seal will be a great addition to my office! Glad to honor service of our airmen serving in Michigan and around the world. https://t.co/23YdEfcS46"]["Exactly why we need independent investigation on Russian interference in election so we can clear the smoke or find the fire. https://t.co/QiglUqDYRF"]["I’ll be on @NewDay @CNN shortly to discuss Russia and threats to our democracy. Tune in!"]["What a fired up crowd at exciting @mtuhky game tonight. Honored to wear the black &amp; gold of MTU! #FollowtheHuskies https://t.co/AFrMFXsnBO"]["I just couldn't pass up the chance to drive a snowmobile down the streets of Calumet at the #CopperDog150 last night! https://t.co/idAkfG96BA"]["Must stand a/g @NOAA funding cuts that would endanger critical climate research &amp; ability to predict severe weather https://t.co/R7RizfK0so"]["If you’re ever in MI’s UP, stop by @keewenawNPS sites to see first hand rich history of Copper Country &amp; Keewenaw Peninsula #FindYourPark https://t.co/QVwTMCqwtc"]["Great to be in Copper Country tonight &amp; visit w so many Yoopers at the #CopperDog150! https://t.co/5V4u5MHzl2"]["There’s nothing like a good Upper Peninsula #SledDog race! Had a blast kicking off the #CopperDog150 in Calumet tonight. https://t.co/zbN3cC7Wh9"]["MI is leading the way in developing emerging vehicle tech. I visited @michigantech to see their research in autonomous &amp; connected vehicles. https://t.co/Wo2xBQZ3VN"]["It was great seeing the amazing work @CalElectronics is doing creating high-velocity, high-performance printed circuit boards. https://t.co/LxCzZONviM"]["Severe cuts to the Great Lakes Restoration fund reported to be in Trump’s budget would have devastating effects. https://t.co/34usclQfmS"]["Sessions’ recusal is first step, but special prosecutor is needed to conduct a full investigation of Russian interference in our election."]["Read my statement on AG Jeff Sessions meeting with the Russian Ambassador: https://t.co/cm5DdC65s7"]["Thank you to @sendavidperdue for joining me in introducing the State and Local Cyber Protection Act. https://t.co/PkMFIPM83h"]["Cyber threats to state &amp; local gov’ts endangers infrastructure &amp; personal data. My bill will help these gov’ts better protect their networks https://t.co/rbGjukypYJ"]["Great to see some of my DC staff giving back &amp; taking the time to speak w undergrads from @UMich who are interested in public service. https://t.co/Gy0vwT2xh9"]["Thx to the Affordable Care Act more Americans than ever before have health care. We need to improve health care, not repeal it #JointAddress https://t.co/1KXBEnREkZ"]["Joining Career &amp; Technical Ed Caucus b/c we must invest in ed &amp; workforce development w increasingly dynamic economy https://t.co/Pa7VybWSK4"]["Happening now: I am Live on Facebook w @TARDEC_PAO Director Dr. Paul Rogers. Tune in: https://t.co/KS6k1cvMAJ"]["We need swift action to protect Great Lakes from spread of Asian carp. Trump Admin should explain delay ASAP &amp; release much-needed plan. https://t.co/daYqhqK86n"]["Join me and Dr. Rogers, Director of @TARDEC_PAO at 7:10PM tonight for a #FacebookLIVE discussion. Link: https://t.co/KS6k1cvMAJ"]["Excited to have Dr. Paul Rogers Director of @TARDEC_PAO as my guest for tonight's Joint Session address. Learn more: https://t.co/8gIS9Ie5jr"]["Visited Onodi Tool &amp; Engineering today, a great example of how Michigan’s defense manufacturing sector is creating jobs for Michiganders. https://t.co/1nVhtWJfuY"]["Great to hear from local community leaders @SWCRC about what is happening on the ground &amp; discuss how we can support MI businesses. https://t.co/vbTB3rPjbA"]["Another bomb threat against a MI JCC - this time in Ann Arbor. Continuation of threats is designed to instill fear &amp; cannot be tolerated."]["Today I’ll join @CStokesWXYZ on @wxyzdetroit's Spotlight on the News. Tune in at 10am! https://t.co/SXBnKWGVAS"]["ICYMI from @saginawnews: \"4 medals, 2 buttons honored to veteran's family by U.S. Senator Gary Peters\" https://t.co/9EInTs2CDP"]["This week is Engineers Week, an opportunity to introduce more young students to engineering. Learn more here: https://t.co/czN15hcKBN"]["With our universities, auto manufactures &amp; testing facilities, MI is the right place to lead the way in development of autonomous vehicles. https://t.co/ZqkboZQmtP"]["MI's defense sector is working with our auto industry to develop future tech that will help protect nat’l security &amp; create jobs in MI. https://t.co/tQLlXQ5vSl"]["MI universities like @michigantech are leading innovation that will shape the future of technology &amp; boost our state's economy."]["ICYMI from @wilxTV: “Senator Peters honors Vietnam veterans” https://t.co/cwFpZVvYIF"]["Had a blast stamping labels &amp; working hard @DetroitDenim today! Their products are handmade in Detroit by Detroiters https://t.co/GxHoH4T5F7"]["All children should have the right to clean air and water! I am proud to earn 100% on #LCVScorecard. https://t.co/96GTuwP9M7"]["MI is home to vibrant defense manufacturing sector. Great to see world-class combat vehicle at @BAESystemsplc &amp; hear from defense suppliers https://t.co/XS9GUsfqeK"]["Great to see Mayor Browning &amp; other Saginaw officials today, and discuss important issues facing the local community. https://t.co/cbOh98K1rg"]["As a son of a WWII veteran, it was particularly special to help the family of U.S. Navy Fireman 1st Class Conrad secure his medals &amp; honors. https://t.co/S5ClRatx4c"]["I visited @MaglineInc to see how small manufacturers are creating jobs for Michiganders and driving local economies. https://t.co/LGLT4VT2Y4"]["Navy Fireman 1st Class Clifford Conrad risked his life in Pearl Harbor attack to protect others. Today in Saginaw, we honored his memory. https://t.co/ZVaanO6D1P"]["Planned Parenthood provides access to preventative healthcare for countless women across Michigan and the nation. That is why I #StandWithPP https://t.co/fz0M3e5Ofn"]["Continued threats, violence against the Jewish community are alarming &amp; have no place in this country. We must stand up to hate &amp; bigotry."]["If you are a MI resident who served on active duty during the Vietnam War &amp; want to request a lapel pin click here: https://t.co/EGxpBkA2Nh"]["Honored to present Lansing area Vietnam veterans special lapel pins to honor their service &amp; 50th anniversary of the Vietnam War. https://t.co/yhUpQFzTw2"]["I will join @DaveAkerlyOnAir on @1320wils around 7:20am. Tune in!"]["Overwhelming number of scientists agree climate change is a scientific fact! The EPA Administrator should know that. #PollutingPruitt https://t.co/y1PyO0HPqv"]["Community colleges are a springboard to a brighter future. Great to meet w MI colleges about the importance of quality affordable education. https://t.co/Hvo2OOjCAp"]["Someone who does not believe in the EPA’s core mission should not be allowed run the EPA. #PollutingPruitt https://t.co/5e2PQ5ggkp"]["I oppose Pruitt as EPA Admin b/c business interests shouldn’t be put ahead of public good. Why do you stand against #PollutingPruitt? https://t.co/fyiW1XI1cX"]["Highlight of my day is opportunity to congratulate MI high school students accepted to one of our Service Academies &amp; thank them for service https://t.co/5pNZiGoIlk"][".@MLive: “Michigan Sens. Peters, Stabenow introduce bills to combat outsourcing” https://t.co/N6phBtaOeY"]["Flynn resignation only raises more questions on Trump ties to Russia. Discussed need for full investigation w @CNN https://t.co/KlMvUEL7Wf"]["Great visit to @NSF_Intl in Ann Arbor today! They’re working hard to protect Great Lakes from algal blooms &amp; invasive species https://t.co/ZdL9BQZjKO"]["Scientific research shouldn’t be guided by ideology. I support bill to shield scientists from political interference https://t.co/Z4jh27ouzF"]["More on our efforts to advance self-driving tech from AP: “Senators try to speed up deployment of self-driving cars” https://t.co/BSo67M3oeV"]["Our efforts will help ensure rapidly changing self-driving tech - which has potential to save lives - is safely tested &amp; deployed. https://t.co/czbae3dQPr"]["Excited to work w @SenJohnThune on joint legislative effort to help advance innovation in self-driving vehicle tech"]["Mike Ilitch's unwavering love for the City of Detroit will be sincerely missed. My condolences to the Ilitch family."]["ICYMI from @upnorthlive: “Advocates back legislation to protect pets of domestic violence survivors” https://t.co/bfxRlKOYOb"]["I’m renewing my efforts to close the rural broadband gap &amp; urging FCC to provide service  to underserved areas. https://t.co/pvoFQTYLy7 https://t.co/fDyKR3Stwc"]["Tom Price wants to fundamentally change Medicare and Medicaid and implement health reforms that will limit care for American families. https://t.co/CuAZXS0gUn"]["In defense of Michigan seniors and working families I will oppose Rep. Price’s nomination for HHS Secretary."]["U.S. Justice Dept should uphold Constitution &amp; rule of law - not President’s personal political interests"]["U.S. Attorney General must protect civil rights of all Americans, but Sessions' record shows disregard for laws that safeguard civil rights"]["Abusers often exploit emotional attachment victims have with their pets, leaving victims to choose b/n their own safety and their pet's https://t.co/BXqpZoBp8I"]["Joined @SenDeanHeller, @RepKClark @RosLehtinen to intro PAWS Act to help domestic violence victims &amp; their pets https://t.co/E3jlgELu8p"]["Thank you @SenWarren for reading #CorettasWords. Sen Sessions’ civil rights record is an important part of his AG nomination. #LetLizSpeak"]["Read my op-ed w @RepFredUpton in @thehill: “Self Driving Cars are the Next Frontier of Innovation and Safety” https://t.co/ulHoOgKozh"]["I voted #NoOnDeVos because our kids need an experienced champion for their schools and public education. I will keep fighting for them."]["Check out @AirForceMag story celebrating 100 years of Selfridge Air National Guard Base, home of @127Wing. https://t.co/5lbrqOfS6T"]["Caught some @umichbball w my daughter Maddy at Delta Gamma Dad's Weekend https://t.co/UkG79XeZBX"]["Tune in to @Flashpointon4 at 10 AM. I will join @DevinScillian to discuss Betsy DeVos' nomination and more. https://t.co/ENQbcpVihZ"]["This month, we honor the stories &amp; legacies of the many African American patriots who have helped shape American history. #BlackHistoryMonth https://t.co/diHYY5pjVV"]["Hear why Tammy, a teacher from Harrison Public Schools in MI, is standing with me against Betsy DeVos https://t.co/Vx5jTNr9pc"]["Time: “Here's a Look at the Education Questions Betsy DeVos Struggled to Answer” https://t.co/MvAwKhqaHr"]["Nothing in Betsy DeVos’ confirmation process gives me reason to think she will bring a successful approach to national education. https://t.co/1sof5nfzER"]["CNN: “Education advocates: DeVos lacks public school experience” https://t.co/HDJzeaafKl"]["Like any employer, the American people should look at Betsy DeVos’ resume. https://t.co/6SMYOovkaX"]["Secretary of State must put the American people first, not his former shareholders and friends in the Exxon boardroom or Vladimir Putin. https://t.co/pq7MzToM9q"]["I cannot support Session's nomination to be our nation’s highest law enforcement officer. Read my full statement: https://t.co/2k4mZMauKX https://t.co/3CNUCURIDF"]["Senator Sessions’ record shows a disregard for laws that safeguard Americans’ fundamental rights."]["As a proud alum of @almacollege, it was great to meet with President @jeffabernathy in my office today! #GoScots https://t.co/BCxb8oqpJy"]["US was once beacon of hope for ppl fleeing persecution. Joined @SenateDems to send message that refugee ban runs counter to our values. https://t.co/xVnNBgS0fx"]["Met w MI Yemeni American leaders, listened to their concerns w Trump’s EO, which is threat to American values &amp; ppl fleeing terror &amp; war https://t.co/YcqyBefvFT"]["Proud to represent strong Muslim &amp; Arab American communities—We should never close our doors to those fleeing brutalities like that of ISIS."]["Extremely alarmed at EO effectively implementing religious test for those seeking to enter US. Read my statement: https://t.co/MJoefdLSyL"]["Bridge Magazine: “Betsy DeVos’s Michigan legacy” \nhttps://t.co/ouuqVaIcm0"]["Betsy DeVos’ Michigan charter school experiment has not lived up to the promises made. https://t.co/qDztOHrOXk"]["Earlier this week, my bill to help the U.S. better prepare for extreme space weather events unanimously passed out of committee. https://t.co/j4ydJO0Nkl"]["ICYMI: @Freep: “Sleeping Bear Dunes named one of world's best beaches” https://t.co/Oz1YG2rrDc"]["DeVos' approach to education has failed the children of MI, she gives me no reason to think she has a more successful approach to our nation"]["DeVos’ resume contains no experience in public education at any level, not as a teacher, administrator, student or parent."]["DeVos lacks experience, qualifications &amp; vision to oversee our education system. I cannot  support her nom &amp; urge my colleagues to oppose. https://t.co/P06cEB17Li"]["Watch my full Speech from the Senate Floor on why I will oppose the nomination of Betsy DeVos: https://t.co/KliIbozCHt"]["At approx 4:20: I will speak on Senate Floor on why I cannot support Betsy DeVos for Education Sec. Watch live here: https://t.co/D4BCvwj8ZB"]["I voted to confirm Elaine Chao @USDOT Sec bc of commitment to work together to support #MI autos and future of connected &amp; self driving cars"]["Had a great discussion this morning about the future of connected and autonomous vehicles at the @washautoshow panel @mobilitytalks https://t.co/llogp0cJMD"]["We need fair trade policies that build a level playing field for American workers. My statement on TPP withdrawal: https://t.co/oHuZex4Hxa"]["Congratulations to the Blue Water Chamber on your 100th year anniversary. Here’s to 100 more! https://t.co/WGKg5Rluhp"]["Looking forward to taking part in @mobilitytalks during @washautoshow tomorrow. More info here: https://t.co/lQACfxSRn2 https://t.co/GJZyPUsCSB"]["Colleen &amp; I were proud to join all the #MI women who came to DC today to make their voices heard &amp; stand united for our values #WomensMarch https://t.co/g2KUbtFVle"]["With Michigan women getting ready to march on Washington! #WomensMarch https://t.co/G9R9C5OE3h"]["Roaring back with record sales. Thank you @POTUS for standing w MIs auto workers! https://t.co/CVVLG90KIM"]["Willow Run built B-24 bombers that won WWII and now the site is solidifying Michigan's leading role in advanced vehicle tech https://t.co/OLDe5ldP8M"]["Thrilled American Center for Mobility Willow Run is now a nationally-designated testing site for automated vehicles! https://t.co/nOep9aIX0M"]["Trade agreements are never fair if we aren't enforcing them. I hope Commerce Sec nominee Wilbur Ross will be proactive w investigations. https://t.co/x07aP8JmE8"]["Trump promised not to touch Medicare during his campaign but nominates a HHS Sec. who has plans to gut it. We must protect Medicare! https://t.co/CMuaTkPCrU"]["Had great time Tuesday visiting one of my alma maters @UDMDetroit Business School &amp; meeting w University President Dr. Garibaldi. https://t.co/8MNOn7SeVQ"]["2018 #FordMustang introduced in spectacular fashion by surprising a wounded veteran with a Mustang of her own. Link: https://t.co/bj7D1OGMTZ"]["Today we celebrate Dr. King's steadfast dedication to the pursuit of justice, equality and tolerance. My Statement: https://t.co/uclkiqm88i https://t.co/Hkce2M3Vlp"]["Asian carp are threatening the Great Lakes &amp; we need to act now to prevent spread of this invasive species https://t.co/SdCNvGKls5"]["On behalf of the 800,000 people in Michigan who will lose their healthcare, I voted NO last night against GOP efforts to repeal the ACA https://t.co/DY4TQYn8DK"]["My statement to those pushing for ACA repeal: “What comes next? Show us your plan!” VIDEO: https://t.co/0VvqvSkhZ5"]["Join me at @mobilitytalks during @washautoshow, to discuss the future of automotive tech. More info here: https://t.co/lQACfxSRn2 https://t.co/oHG0hLfPsw"]["Great to see high-tech R&amp;D from @TARDEC_PAO, a prototype military vehicle powered by fuel cells. #NAIAS2017 https://t.co/O7EMloOhbz"]["About to join @SquawkCNBC to talk cabinet nominations and more. Tune in! https://t.co/5rr0NqMENh"]["Heading to Senate Floor to speak a/g ACA repeal that hurts seniors, middle class. Watch here: https://t.co/VwANqoW9TX #SaveHealthCare"]["Appreciated the opportunity to meet with Sec. Chao &amp; discuss critical issues, incl the importance of connected and automated vehicle tech https://t.co/iMnnJBAWh2"]["So impressed by @michiganstateu work to improve vehicle sensors and cameras. Another example of #MI leading the way on mobility! #NAIAS2017 https://t.co/71CZQLAzHr"]["Also checked out the @Chrysler exhibit to see how advanced car tech is helping families get around. #NAIAS2017 https://t.co/ye3l9v2WX4"]["Americans need to know whether President-elect Trump is acting in the national interest or his own private financial interests"]["I joined Senate colleagues in a bill that would require Trump to disclose any financial conflicts of interest. https://t.co/ZyUqr6QREk"]["At the @Ford exhibit, I got the chance to see their new autonomous car which could be on the roads by 2021! #NAIAS2017 https://t.co/tOiyPbF02e"]["Check out my take on @GM exhibit at #NAIAS2017 https://t.co/HlIPRzOFnp"]["It was great to be on @wjrradio this morning with @PaulWJT &amp; @SenStabenow to discuss #MI auto industry and #NAIAS2017 https://t.co/ceKFC5nau0"]["Research, innovation are the foundation of a strong economy. AICA strengthens STEM education to better train workers &amp; support manufacturers https://t.co/A8ErPc8GPR"]["@POTUS just signed into law the American Innovation and Competitiveness Act (AICA) I introduced w @SenCoryGardner https://t.co/IdvlbKq04s"]["More good news for #Detroit! @nytimes has named the Motor City one of the top 52 places to visit - https://t.co/YXaoGPbdAH"]["Discouraged to see President-elect Trump siding w Putin &amp; Julian Assange over US intelligence professionals VIDEO: https://t.co/iHxWlh525G"]["\"The Russians need to pay a significant price for what they did in our election.” My interview on MSNBC - https://t.co/iHxWlh525G"]["Will be joining @craigmelvin on @MSNBC at 1 PM to discuss Russian hacking activity &amp; foreign cyber threats to America security"]["If the GOP is successful in their plan to #MakeAmericaSickAgain, costs will skyrocket hurting seniors and middle class families https://t.co/tl9Zmp2XPp"]["GOP plan to repeal ACA will rip away health care from 30 million Americans, short change Medicare and #MakeAmericaSickAgain"]["ICYMI:@TheOaklandPress - “Sen. Peters sponsors measure to aid veterans with PTSD; Obama signs into law” https://t.co/487zSInkR9"][".@Ford will be producing the next gen of connected/autonomous vehicles in MI, providing further evidence that we are the leader in auto tech"]["Great news for #Michigan workers, @Ford will be adding 700 new manufacturing jobs https://t.co/YqeOMMlMXx"]["From my family to yours, happy holidays Michigan! It is an honor to serve you. Watch my holiday greeting video: https://t.co/zeqri6Cv8b"]["Tomorrow night is the first night of Hanukkah, enjoy celebrating with friends and family. Happy #Hanukkah"]["Read my op-ed w @SenStabenow in @freep: \"Progress made, but more work to do to help Flint\" https://t.co/hKHWyNLhCs"]["Here is the winner of my Winter FB Photo Cover Contest! See how it looks on my Facebook page here: https://t.co/q737TVgQj0 https://t.co/cxBI58Q9zz"]["Had the opportunity to tour Omega Plastics and sit down with local manufacturers to discuss how my bill will strengthen and improve MEP https://t.co/2z4AicjpdX"]["ICYMI from @michigansthumb: “Sen. Peters pushes dual enrollment opportunities during Thumb visit” https://t.co/09EO4PDHrM"]["Don’t forget to “Like” and \"Share\" your favorite winter photo for my FB photo cover contest, voting ends tomorrow. https://t.co/hEKdnVxTDy"]["I toured the Huron Area Technical Center to see how their dual enrollment partnership with @MMCC_College is making college more affordable https://t.co/OOFQo0zOeS"]["Thank you @SenStabenow! I look forward to con't working w you on behalf of #MI's defense community in my new role as member of @SASCDems"]["As a former Lt. Commander in the U.S. Navy Reserve, I look forward to being a strong voice for Michigan’s military members and partners"]["Check out the finalists for my Winter FB Photo Cover Contest and vote for your favorite by liking the photo https://t.co/hEKdnVxTDy"]["#MI universities continue to lead the way in science and innovation. @NASA has launched @UMich CYGNSS satellites. https://t.co/8cRwMmOxLm"]["Don’t forget, today is the last day to submit your phots to my FB winter cover contest https://t.co/LUKwUVyaRi"]["My bill improving MEP will be signed into law, ensuring businesses like XG Sciences will continue to compete https://t.co/wBEQ97DzfS"]["Toured XG Sciences, an innovative @Proudtomfrinmi company in Lansing to highlight MEP program boosting manufacturers &amp; economic growth https://t.co/JMXa6HUKCW"]["Thrilled that @POTUS has signed legislation to help #Flint replace lead tainted pipes &amp; provide healthcare to those affected"]["Joined @SenStabenow, @RepDanKildee, @karenaboutflint &amp; @MonaHannaA in Flint today to discuss the fed funding package we secured for the city https://t.co/D4Rve2utBL"]["Highly troubling Trump is siding w Russian gov’t over patriotic U.S. nat’l security professionals. See my interview: https://t.co/1QnNBJZIn9"]["I join @JasonCooper922 on @flintsnewstalk at 11 to discuss next step for Flint in their recovery now that we have secured federal funding"]["I will be on @TheLastWord @MSNBC at 10:00pm to discuss Russia’s attack on our democracy w unacceptable interference in U.S. elections"]["Scott Pruitt has spent his career denying the science of climate change. He is a dangerous choice to run the EPA https://t.co/fYMsCIi3Cu"]["Full investigation of Russian interference is not partisan issue. It’s about protecting core principles of US democracy &amp; nat’l security"]["Russian interference in US elections cannot be tolerated &amp; I’m calling for Nat’l Intelligence Estimate from @ODNIgov https://t.co/ThqUFCFIIi"]["Gary, Jr. and I are ready for kickoff! #GoNavyBeatArmy https://t.co/rpwLj8YKqP"]["Thrilled Senate just passed legislation to deliver long overdue aid that will help #FixFlintNow"]["See info on submitting your winter photos of #Michigan to my FB Cover Photo Contest! Submissions are due Fri, Dec 16 https://t.co/LUKwUVyaRi"]["Excited to kick off my next FB Cover Photo Contest! This time, the theme is #Michigan in the #winter https://t.co/LUKwUVyaRi"]["Happy birthday to #Flint hero @MonaHannaA. You are an amazing advocate for the city of Flint and children everywhere!"]["Joined @SenSchumer @CAPAction  &amp; @steelworkers to launch #TrumpOutsourceWatch, hold Donald Trump to his promise to protect American jobs. https://t.co/k3xZuJguFS"]["Thank you to @SteveDaines @SenGillibrand @SenThomTillis @RepMikeCoffman for joining me in fighting for our servicemembers. #Fairness4Vets"]["#Fairness4Vets will help keep America’s promise to our veterans and ensure they have the support needed as they transition to civilian life"]["I am thrilled that my #Fairness4Vets amendment will be signed into law so that all veterans are given the consideration they deserve"]["Our nation’s heroes who honorably served their country deserve access to the benefits that they’ve earned. #Fairness4Vets #NDAA"]["Thank you to @VP Biden for 44 yrs of public service to the U.S. government, 36 of those yrs here in the Senate: https://t.co/enI8uYzJK3"]["A date that will live in infamy - Today we honor memory of those who lost their lives at #PearlHarbor &amp; bravery of the Greatest Generation https://t.co/FVXpZ6jseE"]["Great news for #MI! Selfridge Air National Guard Base is finalist to support the new F-35A fighter jet mission: https://t.co/ddldzxvT90"]["Had a great time reading to kids at the Rochester Hills Public Library’s Polar Express this weekend. https://t.co/XajiML3tjB"]["Programs that encourage women to enter STEM fields are important in keeping America competitive around the globe -  https://t.co/Tp81Lzqq9G"]["Innovation like @GM’s rear seat reminder increases child safety and helps #MI remain the auto capital of the world https://t.co/GJTsuS6ovb"]["Dakota Access pipeline decision shows pipelines that threaten water sources-like Line 5-should find safe alternative https://t.co/iJ8jNlD9yx"]["ICYMI: #MI the top state for photographing fall color https://t.co/KhkDnkkNHb"]["#Flint has been suffering for far too long. It is time for Congress to act and #FixFlintNow"]["#OTD in 1913: Ford assembly line started rolling, beginning #MI’s long history as a leader in innovation. https://t.co/9kqAMF17Zw"]["A continued threat of additional sanctions remains best way to deter Iran’s nuclear ambitions. Watch my speech here: https://t.co/xDHYV0YtCl"]["Great news for #Detroit! @adient announced it will bring 500 jobs to the heart of downtown https://t.co/dry4G8kxFX"]["I am headed to the Senate floor to speak about the Iran Sanctions Act - Watch here: https://t.co/LDJvWH0XJR"]["@SenStabenow Thank you for the birthday wishes. So glad to have you as my partner in the Senate"]["@MikeCrapo Thank you!"]["Air pollution is taking a toll on residents along Detroit River. I’m calling for public health study of full impact https://t.co/nmfkCFsX01"]["Great to grab lunch with the interns in my DC office to thank them for their hard work this semester! https://t.co/Qd6MkgeTXX"]["Thank you to @SteveDaines @SenGillibrand @SenThomTillis for joining me in intro’ing #Fairness4Vets to support our servicemembers #NDAA"]["#Fairness4Vets will help ensure that servicemembers who have mental traumas are given fair consideration in receiving benefits. #NDAA"]["Far too many of America’s servicemembers and veterans are silently coping w/ mental trauma from their military service. #Fairness4Vets #NDAA"]["Glad to see #NDAA includes my #Fairness4Vets provision - I urge Congress to pass this bipartisan legislation."]["ICYMI via @detroitnews: Peters pitches Mich. as self-driving ‘proving ground’ https://t.co/8iN18UPxAZ"]["#CyberMonday is the biggest online shopping day of the yr. Keep your info secure by using these tips from @DHSgov: https://t.co/uIe8jxsVJO"]["Saddened by the senseless act of violence at OSU. Wishing a full recovery for injured and my thought are w/ students, faculty &amp; families."]["Today is #SmallBizSat. Don’t forget to #ShopSmall and support #MI small businesses! https://t.co/IZaASSEuy0"]["Wishing all Michiganders a very Happy Thanksgiving with family and friends! https://t.co/RbKFHYKwnH"]["My deepest sympathies go out to loved ones of Officer Collin Rose and the entire @waynestate community as they mourn this terrible tragedy."]["Thank you to @wzzm13 and @TEGNA for highlighting an issue that impacts so many of our nation’s heroes"]["ICYMI: I spoke with @wzzm13 about my efforts in the Senate to pass legislation to help vets suffering from PTSD https://t.co/4WItXfF5Gk"]["Congratulations to Presidential Medal of Freedom winner @DianaRoss – a Detroit native &amp; iconic voice of Motown! https://t.co/YykgkVl5nI"]["As cofounder of the Senate Smart Transportation Caucus, I’m working to make #Michigan the leader in mobility technology"]["ICYMI via @mlive: “Old bomber factory celebrated as new test site for automated vehicles” https://t.co/27HY05h4hZ"]["Proud to be involved with American Center for Mobility since its conception. This facility will ensure MI leads the world in mobility"]["Today marks a major step forward to make American Center for Mobility the preeminent testing facility for connected &amp; autonomous vehicles https://t.co/zPgDmvbTBk"]["Thank you to @Lions @ChildrenCtr &amp; @CCAInstitute for your efforts help to find every child a loving family. #natladoptionday #adoptiongives https://t.co/nSMqZcy0VN"]["Tomorrow’s #natladoptionday! Let’s raise awareness for the many kids in the US needing to find safe, loving homes! #adoptiongives"]["Congratulations to all the @detroitnews Michiganians of the Year winners-A great representation of Michigan https://t.co/x3jLbLjHxT"]["Looking to make your small business more secure? Join me @washtenawcc to discuss cybersecurity w/@STOPTHNKCONNECT - https://t.co/22skS66csM"]["Congratulations to Detroit’s own @smokey_robinson who received the @librarycongress Gershwin Prize for song writing https://t.co/g0tDbxxyoR"]["#RuralHealthDay is reminder all MI residents deserve access to care. Intro’d bill to help w more telehealth services https://t.co/nTcJ6L18kh"]["Appointment of Steve Bannon is step in wrong direction. Watch my remarks here: https://t.co/YBKnD1VrPj"]["Today I spoke on Senate Floor about need to unite our country after very divisive election. https://t.co/yeICk3mzvK"]["Proud to intro bill to recognize Medal of Honor recipient &amp; Traverse City-area native, Col. Demas Craw by naming VA clinic in his honor https://t.co/fVmL7FGPGe"]["I'm honored to join East Lansing native @GenRobertNeller in celebrating the @USMC 241st Birthday – Thank you to those who have served. https://t.co/arAwFTpoIw"]["Congratulations to my dear friend &amp; colleague @SenStabenow, newly elected chair of DPCC. We’re lucky to have you!"]["Extremely alarmed by Trump's selection of Steve Bannon - We need unity in this country, not divisive, hateful ideas in the White House."]["America’s military families provide the strength and support that allow our servicemen and women to execute their mission. Thank you."]["It’s Military Family Appreciation Month—an opportunity to thank &amp; honor the commitment &amp; sacrifices made by families of our servicemembers. https://t.co/MJ9TIYP04J"]["Visited @MaggardRazors today &amp; saw a true small biz success story. I’m focused on ensuring small biz can access capital needed to grow https://t.co/8dGR0by1ID"]["Great to see @LISDTECHCenter College Now in action. Expanding dual enrollment options helps more #MI students get a head start on higher ed https://t.co/s2tRs6CKmH"]["Enjoyed speaking with the Hillsdale County Chamber about supporting small businesses &amp; strengthening our skilled workforce https://t.co/fNcVC23RLd"]["As son of WWII vet &amp; a French mother who lived under Nazi rule, it was a personal honor to thank them on behalf of my country &amp; my family https://t.co/D9gPnXasmX"]["What a special opportunity to honor WWII vets receiving French Legion of Honor medal for helping to liberate France from Nazi occupation https://t.co/Ri6N99i9Kh"]