["Talking infrastructure, immigration, and government funding on @KTVQ https://t.co/RiTRFcmfSQ"]["And be sure to check out the next guest. They say armadillos eat ants, worms, and fingers. https://t.co/bUmMxxLv5R"]["Great to wake up bright and early with @WakeUpMontana https://t.co/HpYEfHWDZV"]["My new appointment to @SenateCommerce means Montana’s Main Street will be front and center, giving me a new platform to fight for higher paying jobs, transportation infrastructure and rural broadband #mtpol https://t.co/2MZyDAFn9D"]["Sat down with @YellowPubRadio this morning. We covered quite a range of topics. #mtpol\nhttps://t.co/0UDZgVZUJ8"]["Today I joined my colleagues from both sides of the aisle to urge Congress to pass our USA Rights Act, which will protect the privacy of law-abiding of citizens and defend against government surveillance. #mtpol https://t.co/sMi2qCYCBw"]["@SenSherrodBrown @SenatorDurbin @SenStabenow @SenatorHassan @SenateDems The budget deal must uphold our nation’s promise to our veterans by providing them with the care &amp; benefits they have earned. They fought for us, now it’s time to fight for them. https://t.co/JpbHQeziHN"]["We all agree that keeping our country safe is critically important and I think this meeting was a good first step towards that goal. In the meantime, I would like to see a more detailed plan from @DHSgov because we can't just write them a blank check. https://t.co/BzyJkJLfjm"]["https://t.co/asHKcYqa3Z"]["When something breaks down—whether it's in Washington or a wheat field—I fix it. https://t.co/wibMONp0o5"]["On my way to the @WhiteHouse to meet with @POTUS about immigration &amp; border security. Will keep you updated! https://t.co/hQd5bDml1q"]["After the @WellsFargo scandal broke last fall, I made the bank’s current CEO Tim Sloan swear—under oath—that he would not force affected customers into arbitration. Thanks to that testimony, a group of victims will now get their day in court: https://t.co/cqbCljhZrP https://t.co/9W1WVyHOFr"]["I’ve asked that this year’s @USCapitolTree be used to help rebuild another Montana icon, @GlacierNPS' Sperry Chalet. @uscapitol https://t.co/ySGQIv9VKs"][".@zaneraygroup is doing innovative work to promote e-commerce, while using their resources to advocate for better broadband in rural areas. Thanks for taking the time to show me your facilities in Whitefish, play a little foosball &amp; update me on your work! https://t.co/m7Ov3jtC2I"]["I launched my #Montennials tour to hear from the young men and women who will be leading Montana long after we're gone. These face-to-face town halls allow me to get feedback directly from folks and the ground and that's what representing Montana is all about. #mtpol https://t.co/6gUlIhSQcs"]["It's time for folks in Congress to start listening to the next generation. This week I got to field hard-hitting questions from more than a hundred #Montennials &amp; I've got to say, if these are our future leaders, I'm excited for them to take the reins. \nhttps://t.co/EFOX8GcqN2"]["@Lgpguin @jontester https://t.co/ITOvQiqAMZ"]["I will hold the @DeptVetAffairs accountable to ensure this is not a hollow promise. Veterans’ health care is too important to let government bureaucracy get in the way of doctors who need to serve our veterans. @MissoulaCurrent https://t.co/URTAa8eQVg"][".@classpass is coming to Missoula! The company plans to invest $5 million in the city over the next 12 years &amp; create 100-150 new jobs. Why MT? Check out the quote below. Yet another reason to keep our public lands in public hands! #KeepItPublic #EmployMT https://t.co/jY3J8ZWJqS https://t.co/g2tbT2ZL1C"]["Between meeting w/ the @KalispellChambr, fielding some hard-hitting questions from the @GlacierWolfpack &amp; touring the headquarters of the @zaneraygroup, I had quite the day in the Flathead! Thankfully, I got to duck into the #BuffaloCafe for a quick lunch break. #FlattopFriday https://t.co/MUzIXDgFpx"]["Firefighters protect lives &amp; property every day. This new law will ensure they have the training &amp; equipment they need to keep our communities safe. I’m proud to have worked with @SenJohnMcCain to get our bill signed into law.\nhttps://t.co/FUUEd8U3PV"]["#TBT to meeting with Jayson Werth of the @mlb to talk about something we have in common (besides our outstanding athletic achievements), organic farming. #fieldsonfields  @OrganicTrade https://t.co/2WVaTbeN6l"][".@cobrewofficial is an example of Montana innovation at its best. This Missoula-based team has found a way to make a local, eco-friendly beer, so folks can sustainably enjoy a cold one. Thanks to @LoloPeakBrewing for taking the time to show me this innovation in action yesterday! https://t.co/2yYdDxlx7Q"]["The best ideas for how to make Big Sky Country better always come from Montanans—and we had no shortage of ideas this year. Calls, emails &amp; letters to my office increased by more than 400% in 2017 and all that energy helped us get a lot done. Let’s keep it up in 2018! #mtpol https://t.co/bSRQeLkvsX"]["Sat down with small business owners in Missoula yesterday to discuss how new directives from Washington could affect their bottom lines. These folks are the backbone of Main Street Montana and I will fight to make sure they can continue to thrive. #mtpol\nhttps://t.co/RgmFimG4CA"]["As folks from Missoula to Miles City embark on their New Year’s resolutions, I want to let you know what my goals are for the coming year. https://t.co/sikMxTLJrR"]["Proud to have my veterans bills touted by @POTUS. @SenatorIsakson and I have worked hard to put politics aside, and get things done for our veterans. Check out the other bills we got signed into law in 2017 ➡️ https://t.co/myTH8S8nY5 https://t.co/hytL2VQxHh"]["⚡️ “A Year in Review”\nhttps://t.co/E1APaLyhIC"]["#1 - This year Washington politicians passed a hastily-written tax bill that saddles our kids and grandkids with an additional $1.5 trillion in debt. Montana &amp; America deserve better. I promise to keep fighting to provide a better future for the next generation of Montanans. https://t.co/Fq5Pzoeh3v"]["#2 - When @POTUS first got elected I committed to work w/ him to “drain the swamp.” Well, here we are almost a year later &amp; we’ve still got bureaucrats who won’t give a straight answer. Regardlless, I’ll keep working to hold our government accountable &amp; I hope more folks join me. https://t.co/tZGZMhgRfl"]["#3 - One of the most irresponsible decisions this year was when @usedgov refused to fund @umontana's TRIO-Upward Bound program because 1 page of its grant app wasn’t double spaced. Thankfully, we got @BetsyDeVosED  to reverse this decision &amp; fund the program for the next 5 years. https://t.co/CPe3AyPjKL"]["I recently got the chance to chat with Government students at Sidney High School. These kids were sharp as tacks and asked me thoughtful, tough questions on a range of issues. I look forward to seeing what these bright, young Montanans do in the future. #FlattopFriday https://t.co/Hdq4cLziPe"]["I was proud to fight for @umontana's TRIO/Upward Bound program in 2017 and look forward to seeing all the great things the alumni will accomplish in the New Year! https://t.co/VF6FnR31g2"]["#4 - America is great because of our public education system &amp; I know thousands of MTs agree, because when @BetsyDeVosED was nominated to lead the @usedgov I heard from just about all of them. So I spent this year making sure our public schools had every opportunity to succeed. https://t.co/tMfP1swCfD"]["#5 - Even in the most polarized political climates, I can tell you that bipartisanship is not just possible, but productive. And this year we proved it by sending 11 bipartisan bills to @POTUS' desk. Yes, legislating is hard these days but together we delivered for MT. #mtpol https://t.co/uzxDAk8kDl"]["One of the privileges I have as Senator is nominating some of Montana’s best and brightest to our nation's military academies. I look forward to seeing what these young Montanans will go on to do.\nhttps://t.co/T2K81MCbDy"]["#6 - Montana endured a brutal wildfire season this year. As first responders fought off the flames, I worked to make sure MT had the resources needed to recover from the devastation. And over the past few months, it’s been amazing to see Montanans coming together to rebuild. https://t.co/MuN3q1UnNi"]["Writing letters to the brave men and women who are away from home, keeping our country safe. On behalf of all Montanans, Happy Holidays. https://t.co/HJOpRtRJtF"]["This year we kicked off the holiday season by bringing a piece of MT to DC. This year's @USCapitolTree from the Kootenai National Forest has lit up the lawn of the Capitol since 12/6, showing Washington what a real Christmas tree looks like. To all Montanans, Merry Christmas. https://t.co/WPXdIQrJBk"]["#7 - When I became Ranking Member of the Veterans’ Affairs Committee in January I promised to put politics aside and get things done for our veterans. Almost 12 months later, I'm very proud that our committee has become “a case study in Washington working as designed.” https://t.co/fBqXnz5zgc"]["#8 - From the Women’s March to the #MeToo movement, 2017 was a landmark year for women. So it comes as no surprise that this was one of my most popular posts of the year. https://t.co/eAI8jZLdq9"]["#9 - Health care was a defining issue of 2017 &amp; I was proud to help defeat a lot of bad bills written behind closed doors, without public debate, and along strict party lines. Our current health care system is far from perfect, but the only way to fix it is by working together. https://t.co/Lj5rrN2QRv"]["As we wrap up a very busy year, I thought it’d be nice to look back at 2017. So, over the next 10 days I’ll be sharing some of my most liked, shared, and talked about tweets of the year. Kicking it off at #10 is one of my personal favorites: https://t.co/fJJl73ewfm"]["Happy to announce that my bill to recruit, train, and equip firefighters in Montana is headed to @POTUS' desk to become law. Proud to have partnered with @SenJohnMcCain to get this bill across the finish line. #mtpol https://t.co/s1McvzIrzI"]["This is a historic day for the next generation of Montanans. The energy behind this bill truly comes from folks on the ground who want to ensure our kids and grandkids can enjoy the wonders of East Rosebud Creek for years to come. #mtpol\nhttps://t.co/2IsDOZlEtk"]["We need a long-term cure instead of another band-aid fix. The Caring For Our Veterans Act is that cure."]["Our bipartisan Caring for Our Veterans Act will replace the Choice Program with one, easy-to-navigate system that puts the decision of where to seek care in the hands of veterans and their doctors."]["Watch LIVE as @SenatorIsakson and I call on Washington to hold the VA accountable and streamline community care for our veterans. https://t.co/5ipDCufdJv https://t.co/sGH87dQHLP"]["I’ve introduced a bill to defend Montana's hunting heritage and fight the spread of Chronic Wasting Disease before it diminishes our big-game herds &amp; undercuts our outdoor economy. #mtpol\nhttps://t.co/eXEikhOXiP"]["Last night around 1 a.m., the Senate voted to pass the first major tax bill in a generation with support from only one party. The folks who voted yes on this bill did so at the expense of our kids and grandkids. They’re the ones who will be paying this tab long after we are gone."]["I just got done chatting with @chrislhayes about the impact that this tax giveaway will have on the next generation of Montanans. #mtpol https://t.co/JyzAlaNnEk"]["The Senate is hours away from passing a bill that will add more than $1 trillion to the national debt, force cuts to Medicare, and cause health care costs to rise by 10 percent. Watch my speech on the Senate floor:\nhttps://t.co/GRH0akjn4K https://t.co/A2AvFXnHz3"]["And the worst part? This will all be at expense of our kids and grandkids, who will be paying for this $1.5 trillion bill long after we’re gone.\nhttps://t.co/Eyl0EUb3MY"]["This bill also destroys the foundation of our health care system: 13 million Americans will become uninsured and premiums will rise by 10%. And for folks above 65? This bill will force a $25 billion cut to Medicare.\nhttps://t.co/LIRRQ0ydfi"]["The lion’s share of these tax breaks will go to the very wealthy &amp; corporations. And by 2027, the middle-class will actually be paying more in taxes than they do now, while corporate tax breaks remain permanent.\nhttps://t.co/v6qL6jrcgU"]["30 years ago, the Senate passed President Reagan’s tax reform bill 97-3—that could have been the case today, but there was no effort to build a bipartisan consensus around this bill.\nhttps://t.co/WHnnm28ej8"]["Tonight, once again, Congress is proving to the American people that Washington is broken. The tax bill in front of us is the product of dysfunction, partisanship, and political desperation."]["Very happy to have worked with the @MissoulaAirport to help bring in these new flights &amp; secure funding for a new terminal + taxiway this year! These upgrades will help #ConnectMT while creating new jobs and economic opportunities in Missoula. #mtpol\nhttps://t.co/KgiK1G0YVm"]["3 years ago today, the Rocky Mountain Front Heritage &amp; North Fork Protection Acts became law. That day was one of my proudest in the Senate. These landmark laws will keep our public lands in public hands for generations to come. #KeepItPublic https://t.co/dwIv3coRX4"]["Just finished up my Facebook Live Town Hall! Great questions from the folks back home. Check it out here: https://t.co/hEeM5Sg9Qo\n\n#mtpol https://t.co/TMhuMTSvYv"]["I’m calling on Congress to prioritize funding for veterans as we negotiate a year-end budget deal. The budget must give the @DeptVetAffairs the resources it needs to care for our veterans &amp; Congress must hold them accountable for doing just that. \nhttps://t.co/i1ZjmUJvbB"]["“Finally!” Olsen said. “I appreciate Jon Tester’s work to get my records declassified. We’ve finally gotten to the point we should have gotten to 50 years ago. There are a lot of people that will be excited to hear about this.” #mtpol\nhttps://t.co/3L5SEcz9W2"]["Drug-related crime in Billings has more than doubled since 2012. So this week I held a roundtable w/ local law enforcement &amp; addiction specialists to get input from folks on the ground as they work to address these issues of crime and addiction. #mtpol\nhttps://t.co/czJf0Eyxqn"]["Great to be back in Billings this weekend, meeting with folks on the ground about the issues that matter. https://t.co/U3y5i8IASu"]["Stopped by Billings West High School this morning to chat with Ms. Lind’s government students about what going on in the Senate Washington right now. They asked a lot of great questions and, unsurprisingly, they were particularly interested in Net Neutrality. #mtpol https://t.co/isqIy3jHVx"]["I’m demanding the @FCC listen to the thousands of Montanans who have contacted my office, reverse their decision, and preserve our free and open Internet.​ Ending #NetNeutrality ends the Internet as we know it. https://t.co/T7TqGoa22w"]["Had a great time chatting with folks back home tonight. We got ahold of thousands of MTs who asked about everything from tax reform to CHIP funding and more. If you ever have a question, comment, or concern remember that you can always reach me at https://t.co/RuvONaD0KG! #mtpol https://t.co/8yjSAx7uLh"]["This is the reason I fight to make the @DeptVetAffairs better every day. It's far from perfect, but thousands of veterans like Ralph receive exceptional treatment and care through the VA every year.\nhttps://t.co/EnehizHhDN"]["For the first time since 2010, homelessness is on the rise in MT. This is unacceptable. Congress &amp; the Administration must work to ensure folks facing homelessness have the resources they need to get back on their feet. https://t.co/d5OYtePHMH https://t.co/4aWumctmnj"]["Proud to have worked with folks on both sides of the aisle to get this bill signed into law by @POTUS. It will give our troops a pay raise, strengthen our nation’s ICBM fleet, and help veterans get the care and benefits they have earned. https://t.co/pWrWjTO5u1 https://t.co/Jxw1Hc5Ur4"][".@jimmykimmel I’ve been working to reauthorize CHIP since it expired in September. Providing kids with health care is a no-brainer &amp; folks in Washington need to be held accountable for playing political games with our children’s lives. https://t.co/TWsuWfNVpP https://t.co/XfAKKy7dYT"]["Montanans know we need to protect the East Rosebud for our kids and grandkids and now's the time to do it. #mtpol\n@billingsgazette - https://t.co/at5tFxEevd https://t.co/kXC0otF38M"]["Helena has one of the highest populations of veterans in MT, that's why I’ve worked so hard over the last few years to secure a permanent Vets Center in our state’s capital. Very glad it will finally be opening its doors at the end of the month! #mtpol\nhttps://t.co/5fCoOIItGh"]["Earlier this week, we got into the Christmas spirit by bringing a piece of MT to DC. A 79-foot Engelmann Spruce from the @KootenaiNF traveled 3,500 miles to be the @USCapitolTree. I had the honor of selecting the tree lighter, Ridley Brandmayr, a sixth grade student from Bozeman. https://t.co/3Fr0VispMo"]["Honored to sit down with Major General Matthew Quinn this week to discuss the mission of the @MTNGREC and how we can strengthen our national security. Thank you to Major General Quinn &amp; all the brave Montanans who keep us safe every day. #mtpol https://t.co/uLaVWxkWzY"]["Montanans are making their voices heard. I stand with them and will continue to vote against a tax giveaway to the rich that saddles future generations with more crushing debt, while hurting hardworking Montana families. #mtpol https://t.co/Wgmb1v2vKI"]["There is a desperate need for real tax reform in this country, not a tax giveaway to the wealthy. Montanans need tax reform that gives a break to working class families and small businesses, without adding to our debt. #mtpol\nhttps://t.co/0puJFDpQCW"]["Communities across MT rely on volunteer first responders to keep their families &amp; property safe. By ensuring that these folks have access to additional benefits, we can recruit even more folks to serve their communities. #mtpol\nhttps://t.co/HNmiqwgPoX"]["This tree is more than a symbol of the natural resources the Treasure State has to offer – it represents our shared history,  intertwined with our outdoor heritage and our Montana values. (2/2) https://t.co/56MR0nn15x"]["This year's @USCapitolTree has been growing in Montana for decades – enduring brutal fire seasons, and braving harsh winters. It’s reached almost 80 feet tall, nourished by Montana’s rich soil and sustained by clean mountain water.  (1/2) https://t.co/PvXcsW5yBd"]["Watch as Bozeman’s own Ridley Brandmayr lights up the @USCapitolTree! The 79-foot Engelman Spruce hails from the @KootenaiNF and is adorned from top to bottom with a skirt, star, and ornaments all #MadeinMotnana.\nhttps://t.co/zyIfAdXH5G"]["We are moments away from lighting this year’s @USCapitolTree! https://t.co/lJZ0IFEfp1"]["Elected officials must be held to a high standard, Al Franken is no exception. It’s time for him to step down."]["Tonight’s the night! I will be joining Ridley Brandmayr as he lights the @USCapitolTree! Watch the lighting LIVE at 5 p.m. ET/ 3 p.m. MT right here on Twitter.  \nhttps://t.co/8SDd6cw16I"]["We're facing a crisis of consolidation in rural America &amp; one of the only ways to fix it is by tailoring our regulations so that Bear Paw Credit Union doesn’t have to jump through the same hoops as Bank of America. It's just commonsense. https://t.co/GGCpktdrHk"]["My bipartisan reg relief &amp; reform bill will not only help community banks, rural families &amp; small businesses thrive, but also implement stronger consumer protections that are particularly crucial in the wake of the recent @WellsFargo &amp; @Equifax scandals. https://t.co/sWrRNGlZAo https://t.co/9P8s39cN3f"]["Montana’s community banks and credit unions didn’t cause the financial crisis, but they’ve been strained under harsh rules written for Wall Street. Let’s ease the burden for our Main Street banks and credit unions and unleash more capital for small businesses. #mtpol https://t.co/5Mz0XgQALq"]["In the midst of profound partisanship, I’m proud to be one of the folks demonstrating that bipartisanship still exists in Congress. This bill makes small, commonsense changes to help community banks and Main Street businesses thrive.\nhttps://t.co/Z3qQHI9VEJ"]["To learn more about our bipartisan bill, click here: https://t.co/VZYoeKPXVl https://t.co/r19qgiD4gb"]["Today in the Senate Banking Committee, we’re taking up our bipartisan bill to get Montana Main Street businesses the regulatory relief they need to succeed. Let’s break through the Washington gridlock."]["These future leaders of Montana had the initiative, passion, and resolve to enact change. Thanks to Mary and Ella, Missoula will have a school named after the great Jeannette Rankin. I wouldn’t be surprised to see a few schools named after them one day.\nhttps://t.co/WEzK55ZQN4"]["Early Saturday morning Congress passed a 479-page tax reform bill that had been finalized just a few hours earlier. Over the next 48 hours folks began to figure out what was actually in this bill and they’re not happy. Here’s just a few of the thing Montanans have said: #mtpol https://t.co/n81hWXu72j"]["Early Saturday morning Congress passed a 479-page tax reform bill that had been finalized just a few hours earlier. Over the next 48 hours folks began to figure out what was actually in this bill and they’re not happy. Here’s just a few of the thing Montanans have said: #mtpol https://t.co/XWXyH3vppf"]["I was just handed a 479-page tax bill a few hours before the vote. One page literally has hand scribbled policy changes on it that can’t be read. This is Washington, D.C. at its worst.  Montanans deserve so much better. https://t.co/q6lTpXoXS0"]["In addition to the 79-foot @USCapitolTree, the folks at the @KootenaiNF also donated 77 smaller trees to adorn the halls of Congress, the @forestservice &amp; other federal offices across DC. These trees come with handmade skirts &amp; ornaments straight from MT! https://t.co/Pqicj6FFIl https://t.co/7z5ZZOZlRi"]["I can’t support the Senate bill as it stands today because adding $1 trillion+ to the deficit will just hurt future generations. We need a bipartisan solution that prioritizes hard-working MTs, provides relief to small businesses &amp; doesn’t saddle our kids w/ more crushing debt. https://t.co/5Dd8b5Ilkj"]["We just made some folks in Congress 😓 by introducing an amendment to ensure this “tax reform” bill does NOT add $1 trillion to the debt. But it was killed on a party line vote because some folks in Congress are choosing to play politics at the expense of our kids and grandkids. https://t.co/0eSf46Dn4J"]["My amendment with @SenAngusKing will guarantee that the tax reform bill will not increase the deficit.  Proud to defend our kids and grandkids from more debt. #mtpol https://t.co/BuOtGzChqb"]["As the Senate debates the tax reform bill, we must consider its impact on the debt. We can’t continue to saddle future generations with more crushing debt. #mtpol\nhttps://t.co/U47iXHaCEY"]["I’ve been working closely with veterans, VSOs &amp; folks on both sides of the aisle to craft a new bill that eliminates the Veterans Choice Program as we know it and streamlines the VA’s seven community care programs into one, easy-to-navigate system. #mtpol https://t.co/KZ4IjOOGKV https://t.co/M0DVlUeUoq"]["I’ve been working closely with veterans, VSOs &amp; folks on both sides of the aisle to craft a new bill that eliminates the Veterans Choice Program as we know it and streamlines the VA’s seven community care programs into one, easy-to-navigate system. #mtpol https://t.co/KZ4IjOOGKV https://t.co/MzFnJpwUGK"]["Today the @USSupremeCourt is hearing arguments in a landmark case determining whether the government can obtain an individual’s cell phone records from wireless providers without a warrant. My message to the government: It's none of your business. https://t.co/VkIGrohVEA https://t.co/9fgZazGocK"]["84% of Native American women experience some kind of violence in their lifetimes. On some reservations, they are murdered at 10x the national average. I’m standing with advocates, families &amp; Montanans like Ashley to say that these women are #NotInvisible\nhttps://t.co/LJLo1aLeQ7"]["The @FCC's recent proposal would make it possible for corporations to block websites, slow down internet access &amp; interfere w/ web traffic. I'm strongly urging them to reverse course &amp; put the American people’s ability to openly access the internet before corporate bottom lines. https://t.co/J4Mnv3h53D"]["Taxing education benefits to pay for tax cuts for the wealthy is one of the swampiest schemes I’ve ever heard. We need to come up with a bipartisan, fiscally responsible tax plan that doesn’t add to our debt or make it harder for folks looking to get an education. https://t.co/R8jhFzWN39"]["“What irks me the most is—I’ve read a lot of analyses from the Congressional Budget Office—millionaires and billionaires would get a tax break and me, who makes $15,000, would get a tax hike. It seems unfair.” - Will Wright, Grad Student @montanastate https://t.co/uuOtHzuHQw"]["The @USCapitolTree completed it’s 3,500-mile journey from Montana today! T-minus 9 days until we light it up! https://t.co/pdIFYFkdeE"]["ICYMI - 50 yrs ago, the military conducted chemical weapons tests on its own men. John Olsen was one of them. Because these records are still classified, the VA has denied him care. My bill will declassify these records &amp; get Olsen the care he deserves. https://t.co/84edIxiLzG https://t.co/vTPoDUBmXl"]["I introduced the Yellowstone Gateway Protection Act in April, I testified on behalf of the bill back in July. It's time for Congress to vote on this legislation, and I hope the rest of the Montana delegation will help us get that done. #dontmineyellowstone\nhttps://t.co/I6m1aEcxxG"]["From family farms &amp; ranches to local outfitters and guides to cutting-edge tech startups and everything in-between, small businesses are the backbone of Montana's economy. They support us, and we must support them. #SmallBusinessSaturday\nhttps://t.co/n2qIRV3FKW"]["\"Sen. Tester should be commended for ignoring party labels and putting together a piece of legislation...freeing up credit union small business capital that can immediately be reinvested in their community.\" #SmallBusinessSaturday\nhttps://t.co/uIYnwRAMgQ"]["This #Thanksgiving, Sharla &amp; I are thankful to be Montanans who are able to raise our kids and grandkids with the same values we learned growing up on the Hi-Line. 🦃 https://t.co/cbIZgzHclq"][".@Interior has extended the public comment period on its proposal to double entrance fees at 17 national parks, including @GlacierNPS &amp; @YellowstoneNPS. Submit YOUR comment before 12/22 here -&gt; https://t.co/YDJ5Nmaw0p\nhttps://t.co/VJTXo41ACB"]["50 years ago, the military conducted secret chemical weapons tests on its own men. John Olsen was one of them. Because these records are still classified, the VA has denied him care. My bill will declassify these records &amp; get Olsen the care he deserves. https://t.co/84edIxiLzG https://t.co/IdzI5352sl"]["We need an open internet. I'm extremely disappointed to see proposals aimed at rolling back rules that prevent Internet Service Providers from purposely blocking websites or slowing internet speeds. It’s time Congress fix this issue once and for all, especially in rural states."]["Providing kids with health care is a no-brainer. #mtpol\nhttps://t.co/4YiPm7gUwe"]["Folks in Congress have allowed the Children’s Health Insurance Program to expire. CHIP provides care to 24,000+ kids across MT every year &amp; if Congress doesn’t act soon, these kids could lose coverage by the beginning of next year. That is unacceptable. #mtpol @GovernorBullock https://t.co/ozUmAKgMFa"]["Beautiful day for some football. https://t.co/nduNVVK5Jf"]["Stopped by Helena High School this afternoon with @governorbullock to speak with students in Ms. Sampson’s Senior Science Seminar on Leadership and Ethics Class. These are truly the future leaders of Montana! https://t.co/PomWtQ4dkG"]["Got a glimpse of the @USCapitolTree as it passed through Great Falls last night, it’s a beauty. Can’t wait to watch Bozeman’s own Ridley Brandmayr light it up on December 6th! https://t.co/ZPczmjxQUr"]["It doesn’t get much more Montana than this. If you missed the @USCapitolTree in Missoula last night, you have 3 more days to catch a glimpse. Visit https://t.co/TjRxWorD19 for more details!\nhttps://t.co/iKpYi2Fa8K"]["Had a great time chatting with thousands of Montanans tonight during my teletownhall. We got through quite a few questions, but if we didn't get a chance to chat—or if you ever have any questions or concerns—let me know @ https://t.co/RuvONaD0KG https://t.co/2tSqSulz6f"]["Summer might have turned to fall, but folks across our state are still dealing with the aftermath of this year’s historic drought and wildfire season. That’s why I continue to fight for resources to aid these rural communities in their recovery. #mtpol \nhttps://t.co/1ouz8VzIZO https://t.co/M7VRkEB9J1"]["Today I submitted my public comment to @Interior about its foolish proposal to double entrance fees at 17 national parks, including @GlacierNPS &amp; @YellowstoneNPS. When it comes to our public lands, we #HikePeaksNotFees. Submit your comment here ➡️ https://t.co/YDJ5Nmaw0p https://t.co/HteJgDlg8G"]["As Butte continues to get passed over for the new veteran’s home we sorely need, I’ve introduced a bill that gives veterans in Montana and other rural states a fair shake from the @DeptVetAffairs. #mtpol  \nhttps://t.co/DnqEllZEYc"]["District Judge Greg Pinski oversees the Great Falls Veterans Treatment Court, which provides vets with an alternative to jail by connecting them with substance abuse &amp; mental health treatment. #VeteransVoices #VeteransDay\n\nWatch other stories HERE: https://t.co/fZMPhsQdyR https://t.co/MRSvVJxmux"]["There is no doubt that serving our veterans and their families is a cost of war. And the services and benefits that our nation provides mark our nation’s strength, just as much as the military might we show around the world. #VeteransDay\nhttps://t.co/nR4IPp519K"]["Stan Juneau is the son of Edmond “Snackery” Juneau, a decorated WWII Army veteran. He and his brothers reached out to my office when they couldn’t locate their father's Purple Heart after he passed. #VeteransVoices #VeteransDay\nWatch other stories HERE: https://t.co/fZMPhsQdyR https://t.co/DYi9a4SOZH"]["God bless our men and women in uniform, past, present, and future. Today and every day. #VeteransDay #Taps #ThankYou https://t.co/JfhUZgRT1Q"]["Kevin Dede is an #AirForce veteran from Billings who struggled upon his return from deployment. After utilizing resources offered by both the @DeptVetAffairs &amp; @Vol_of_America, he is now thriving. #VeteransVoices #VeteransDay\n\nWatch other stories HERE: https://t.co/fZMPhsQdyR https://t.co/qr1BvXKraO"]["Ron Sims is a Vietnam vet from Billings who earned 2 Bronze Stars w/ Valor &amp; a Purple Heart, among many others. More than 40 years later we helped him receive the medals he earned. #VeteransVoices #VeteransDay\nWatch other stories HERE: https://t.co/fZMPhsQdyR https://t.co/FDIBQf1FHW"]["This #VeteransDay I want to put the spotlight where it belongs—on our veterans. So today I’m launching my #VeteransVoices video series, featuring veterans and their families from across Montana telling their stories of service, struggle and success.\nhttps://t.co/fZMPhsQdyR https://t.co/aw5NHkGxmm"]["It is critically important that the Secretary of @DHSgov understand rural America's unique security threats and is willing to work with both Republicans and Democrats to keep Montana families safe. #mtpol https://t.co/Hwo8Gh9Zm5"]["Despite being put on the VA’s priority list back in 2010, Butte continues to get unfairly passed over for a veteran's home. So today I introduced a bipartisan bill to reform this process to give rural states and cities like a Butte a fair shake. #mtpol\nhttps://t.co/IgcTHvstV6"]["I’m betting the farm on MT’s own Steven Goedert at the World Livestock Auctioneering Contest today! Steven is competing against the cream of the crop to qualify for the world championships next June. Show ‘em how to sell ‘stock—Montana style! #WLAC https://t.co/Jqvja58kh1"]["The @USCapitolTree kicked off its journey in Yaak today! If you missed out, you can still catch a glimpse of the 🎄 as it travels across MT next week. Visit https://t.co/TjRxWorD19 for details! https://t.co/TXLMiVHKDj"]["These sanctions will send a strong message to North Korea and anyone who might turn a blind eye to their threats.\nhttps://t.co/SHd5PDnMyT"]["In the wake of a devastating fire season I'm demanding the @forestservice stop silencing MT wildfire experts #mtpol\nhttps://t.co/SVi12nnDDP"]["As counties face huge clean up costs from wildfire season, @SteveDaines &amp; I are demanding Congress reauthorize funding for rural MT. #mtpol https://t.co/j2VbSMTuJ0"]["Congress should NOT use a procedural loophole that cuts Medicare &amp; Medicaid by millions to pass tax reform. #mtpol\nhttps://t.co/ghfa70d7rI"]["Mark your calendars for 11/7! That’s when the @USCapitolTree kicks off its 2,300-mile journey from Yaak, MT to D.C.\nhttps://t.co/RAoAn1E1zv"]["Today I met with Maya MacGuineas, President of @BudgetHawks &amp; a leading expert on tax reform &amp; the national debt.\nhttps://t.co/UKVJRbgtAj"]["As I take a look at this new tax proposal it’s essential I get feedback from MTs. Please share your thoughts HERE ➡️ https://t.co/wGxehU14kx https://t.co/66BATJr2xh"]["Today I asked Scott Garrett, nominee to head up @EximBankUS, if he would listen to other Bank board members. He refused to answer me. #mtpol https://t.co/xD35fKWVFG"]["This year’s @USCapitolTree hails from MT &amp; I've asked Ridley, a Bozeman sixth-grader to help me light the tree!\nhttps://t.co/EtzK0f1Tv0"]["Today I launched a portal where Montanans can send me their thoughts, ideas &amp; feedback on tax reform -&gt; https://t.co/ytpbPJxEKa #mtpol https://t.co/lz8Bwbh14f"]["Mourning the attack in NYC tonight, thinking of the victims and thankful to all the first responders on the scene. Stay safe, stay strong."]["Check out what I’ve been reading, tweeting &amp; talking about lately w/ the latest edition of #FlattopHeadlines ➡️ https://t.co/IaD7lo81fu https://t.co/Nf7LJhMzOH"]["Gov. Judy Martz shattered the glass ceiling, showing young women all across MT what’s possible if you work hard.\nhttps://t.co/EM5xaATwcV"]["In Montana, we don’t always have to agree with each other to respect one another. #mtpol \nhttps://t.co/hvEXGZmHt7"]["Our National Parks belong to all of us. Tell @Interior that when it comes to our public lands we #HikePeaksNotFees: https://t.co/YDJ5Nmaw0p https://t.co/PXtLSmiGrA"]["Nothing like a Sunday morning sunrise over the 🐻🐾 Mountains. #MontanaMoment #ViewFromTheTractor https://t.co/kOMXlUQPtn"]["Agriculture is the backbone of Montana’s economy and family farmers and ranchers are the backbone of Montana agriculture. #MFU17 #mtpol https://t.co/KYiUiyUEOI"]["Are you a self-starter? Do you want to help get things done for MT? Apply to be one of my spring interns today! https://t.co/yHMcqiUCZI"][".@POTUS just signed our bill to deliver $576 million for wildfire relief &amp; help the @forestservice mitigate future 🔥 risks. #FlattopFriday https://t.co/dDw05bb7Gd"]["Consolidation is rampant in the ag industry &amp; the @USDA just made it harder for family farms &amp; ranches to fight back\nhttps://t.co/BPSHAX1E3Q"]["The Alexander-Murray bill will bring certainty to markets, lower health care costs &amp; reduce the deficit, but don't just take my word for it: https://t.co/9kZ19c1YdZ"]["If Uncle Sam wants info about MTs he better have a good reason. My bill will rein in gov't 🔍 &amp; protect 🇺🇸 liberties. https://t.co/Z20QlDbrZ7 https://t.co/cKAJOvHlvk"]["While EPA's Pruitt lives the high-life on taxpayers' dime, Montana's Superfund communities continue to wait. #mtpol https://t.co/hP72p5s62z"]["Yesterday we passed a bill to replenish @forestservice $$$ depleted by fire season, but we need a permanent fix for wildfire funding. #mtpol https://t.co/oolLIGHwmw"]["This will price MT families out of our parks &amp; hurt local economies. Tell @Interior we #HikePeaksNotFees HERE -&gt; https://t.co/YDJ5Nmaw0p https://t.co/ZNGNAlTLwa"]["This week the Trump Administration threw out a USDA rule that prevents big companies from taking advantage of family farms &amp; ranches. #mtpol https://t.co/PFJfMyzBjn"]["Watch LIVE as I discuss disasters assistance for folks affected by this wildfire season &amp; what more must be done. https://t.co/lC444sLAhN https://t.co/4E9Z9MwYRz"]["This decision is spiking premiums that are already too high. We need bipartisan effort to lower health care costs.\nhttps://t.co/it30mUgsIl"]["Had a great time speaking with my fellow farmers and​ ag enthusiasts at the @MFUfarmers Annual Convention on Friday. #MFU17 #mtpol https://t.co/8VgcyCgYsU"]["This plan will secure our border w/o wasting billions of taxpayer $ on a wall that doesn't utilize the most effective technology possible. https://t.co/WQotC6YySL"]["The budget that passed last night is unacceptable—I'll fight to defend MT seniors &amp; ensure future generations aren't saddled w/ debt. #mtpol https://t.co/gnkoiwXHQ4"]["I’m urging @BLMNational to extend the public comment period on the sage-grouse review. Montanans must be heard.  \n\nhttps://t.co/pL400sEOPV"]["Had a great time Skyping w/ 9th graders from Plevna School District this morning. Their questions were tough, but fair &amp; mighty impressive. https://t.co/UoCVaf1tP7"]["After getting @usedgov to fund UM's Upward Bound program I met the amazing students pursuing their dreams thx to UB.\nhttps://t.co/uEACadLnWa"]["From Billings to Bozeman to Missoula &amp; back, check out what I’ve been up to these last few weeks on the latest edition of #BigSkyRewind. https://t.co/QpFuPEwfIH"]["I held my 6th Farm Bill Listening Session to hear from folks on the ground about how the #FarmBill can help address hunger &amp; feed MT. #mtpol https://t.co/FlYPWtPt3X"]["No better way to spend a Saturday https://t.co/6stN6iNS1w"]["Touring CLEARAS Water Recovery, a MT small business using algae to treat wastewater w/ no harmful by-products. #FlattopFriday @TeamClearas https://t.co/i0wO91rw1u"]["These students right here are why I fought so hard for Secretary DeVos to reconsider UM's Upward Bound grant application https://t.co/3IMzLIMC5b"]["Packed house for my 6th Farm Bill Listening Session. It is critically important to hear from the folks on the ground #mtpol https://t.co/C880r4HL2Z"]["It's sabotage and Washington needs to knock it off. #mtpol https://t.co/unCDhMlPdm"]["On #NationalFarmersDay I want to thank the folks that make ag MT’s #1 industry, including my favorite farmer of them all—Sharla Tester! 🚜🌾 https://t.co/ghAtYP5Jee"]["We can’t keep handing the @DeptVetAffairs $ w/o more accountability to ensure veterans are getting the best care.\nhttps://t.co/j7LDjc6OYL"]["One of the best parts of my job is giving Montana #veterans the long overdue recognition they deserve. https://t.co/CrPXXHwUeV"]["I was honored to present George Wright &amp; Gerald Zelmer with long overdue medals for their sacrifice, service &amp; bravery in WWII &amp; Vietnam. https://t.co/YQprU20lGK"]["Had a great time meeting with students at Little Big Horn College today! Got a group shot with the future nurses of Montana. https://t.co/pfBO1GCy1K"]["It's great to be in the magic city this morning on @KTVQ https://t.co/bOFIRoc3Zx"]["ICYMI - I'm excited to be traveling across MT this week, but here's a peek at what a typical day is like fighting for MTs back in DC. #mtpol https://t.co/EVwY7fG8Ry"]["This #FlattopFriday I’m celebrating MT's manufacturing industry—the folks who work w/ their hands &amp; ensure great products are #MadeinMontana https://t.co/JffxC2bj9Q"]["Moon over the snowy Bear Tooth Mountains last night, courtesy of my wife Sharla. #BigSkyCountry https://t.co/nvdp9mWECH"]["The IRS' decision is unfathomable. Equifax shouldn’t receive a dime of hard-earned taxpayer money. #mtpol https://t.co/c6NchtBnZy"][".@Equifax took 6 weeks to announce their breach—6 weeks! That’s unacceptable &amp; I certainly didn’t wait 6 weeks to tell @Equifax that. #mtpol https://t.co/aVWJcKxA4L"]["We must stop all the gridlock and grandstanding and get back to the day-to-day business of governing. #mtpol \nhttps://t.co/PofHXrFCQi"]["A year after the @WellsFargo scandal folks are still waiting for their day in court. So today I told them to fix it. https://t.co/sZP6gOaEjO https://t.co/cVAJWwpZlK"]["#LasVegas https://t.co/yo6Z4oyKTb"]["The @DeptVetAffairs needs an action plan to address the veteran suicide crisis. We must ensure that no more lives are lost. #mtpol https://t.co/x4knLlVApF"][".@SteveDaines &amp; I are pushing a bipartisan bill to allow the @forestservice to better manage our forests. #mtpol\nhttps://t.co/smHZwAJaMp"]["Had a great meeting w/ MT Principal of the Year Gordon Klasna of Eileen Johnson MS—we need more folks like Gordon molding MT's young minds. https://t.co/a8jcZx4O3g"]["Rural MT is defined by wide-open spaces—that's why we love it. But it also means we need better broadband to #ConnectMT. #mtpol https://t.co/3gMfoOrfwU"]["Dude, @brianschatz you stole my emoji. 🤙🏽 https://t.co/8XyirAOrAF"]["Montana sent me to Washington to fix what's broken &amp; defend our way of life. That's what I'll continue to do. #mtpol\nhttps://t.co/W0GfFieIKB"]["From meeting Montanans to defending our state on Capitol Hill, here is a quick snapshot of a day in the U.S. Senate. #mtpol https://t.co/1Q8H5FUG54"][".@SteveDaines &amp; I teamed up to testify about our bill to strengthen MT's timber economy, mitigate wildfires &amp; maintain our forests. #mtpol https://t.co/ZbCCLBd8VR"]["Had a wonderful meeting w/ Erin Williams, MT's nominee for the Angels in Adoption award. She has spent 20 yrs fighting for MT’s children. https://t.co/UhSUIMlaw4"]["I don’t care if @Equifax CEO Richard Smith resigned today, he’s not squirreling his way out of testifying before our Committee next week. https://t.co/zNfGGppZZL"]["Regardless of what you’re hearing, the Graham-Cassidy bill ain’t dead yet. So keep fighting because the time to stop it is now. #WhatsAtRisk"]["This is what we need to be focusing on—not another half-cooked plan to repeal health care for millions of Americans. https://t.co/zmvM1lQKtU"]["We've relentlessly defended MTs' health care &amp; we can't let up as we debate another dangerous bill this week. #mtpol\nhttps://t.co/iKx1yGLnDL"]["ICYMI: After @Verizon abruptly cut off service to 💯s in MT, I demanded answers &amp; on Friday the company reversed its decision. #ConnectMT https://t.co/0UDhkxFEvU"]["I'm joining @AGTimFox to hold @Equifax accountable &amp; show folks how to protect themselves if their info was exposed. https://t.co/xBIsovBWYL https://t.co/tSfBSE0WRo"]["Bozeman's @FLIR laboratories produces technology that could secure both our borders—w/o building a wall. #mtpol https://t.co/2EQzW5OIF9"]["I spoke to students today at MSU. A quality education is critically important to the future of Montana. https://t.co/kHLSY6IKjI"]["After I demanded @verizon reverse its decision to cancel MT contracts, these accounts will stay intact. #ConnectMT \nhttps://t.co/qhGTAhSvbb"]["Great to be up bright and early. Tune in now to @KBZK https://t.co/OA3MWEl1mG"]["Teaming up w/ @AGTimFox to roll out tips for MTs who may have been exposed in the @Equifax breach. Check 'em out: https://t.co/xBIsovTxQj https://t.co/pVg1HAyGYl"]["This is Congress’ latest attempt to rip health care away from thousands in MT, but don’t just take my word for it:\nhttps://t.co/2hqrN8bLVt"]["Shucks, I’m busy next Tuesday. @GovernorBullock, you free? #Mermen @sipndiplounge https://t.co/aQaJFlLRY1"]["I joined MT health care professionals today to oppose the new Graham-Cassidy health care bill. #WhatsAtRisk #mtpol \nhttps://t.co/DdYEdgDxHv https://t.co/c513GBn0Xp"]["Today I sent a letter to @POTUS welcoming him to Montana and offering to work with him on tax reform. #mtpol https://t.co/zQSfHue9Tp https://t.co/7GQ7N0Smyj"]["This bipartisan bill will bolster national security, improve missile defense &amp; give our service members a pay raise.\nhttps://t.co/7F8mK77Pn3"]["Anyone who deliberately delayed or misreported mail delivery should be fired for violating Americans' trust. #mtpol https://t.co/WbxWf1i6Zt"]["The folks at Malmstrom &amp; MANG go above and beyond to protect our freedoms. Today we celebrate 70 years of service. https://t.co/er1SmQwexn https://t.co/De1B3No3dD"]["This will help folks recover from the #MTFires &amp; I'll keep rattling cages to ensure MT gets what we need to rebuild.\nhttps://t.co/588XK1RZ4R"]["A contract is a promise between company &amp; customer. I'm not going to let @Verizon break its promise to folks in rural MT. #mtpol #ConnectMT https://t.co/neyzwG8aQx"]["Honored to receive the Golden Triangle Award from the @NFUDC this week. I'll always defend MT's family farmers &amp; ranchers. #FlattopFriday https://t.co/DIVzGX3icW"]["As a wise man once said—where I come from, rain is a good thing. #LukeBryan #PrayForRain #MTFires https://t.co/IXDFMGUkSC"][".@verizon's recent termination of contracts in rural MT is very troubling &amp; I'm urging them to reverse it. #mtpol\nhttps://t.co/I0DIBQERdr"]["Had a great time talking #FarmBill &amp; #RuralBroadband at today’s #SenateRuralSummit. Check it out here (@ 2:19): https://t.co/hUfxzV4O6g https://t.co/6n4RoJIUPS"]["(5/5) Finally, after historic hurricane, drought &amp; wildfire seasons it's time to have an honest debate about climate change. #MTFires #mtpol https://t.co/iT0RwN9HmO"]["(4/5) We must give local governments the resources they need to recover from these fires &amp; mitigate losses in the future. #MTFires #mtpol https://t.co/sVa0awuV1E"]["(3/5) Every family farm &amp; ranch that's suffered wildfire-related loss needs access to @SBAgov &amp; @USDA's recovery resources. #MTFires #mtpol https://t.co/0h5ZKg5Dkk"]["(2/5) Congress must fix wildfire funding. The @forestservice isn’t a firefighting agency—it’s a forest management agency. #MTFires #mtpol https://t.co/Z1TjZNSnjr"]["(1/5) We must reimburse the @forestservice's firefighting expenses so they can afford maintenance, mitigation &amp; restoration. #MTFires #mtpol https://t.co/JwcB7NKrt1"]["On the @SenateFloor discussing 5 ways we must respond to this devastating fire season. #mtpol #MTfires Watch LIVE: https://t.co/OPIlpD59VO https://t.co/pmG6tUOyr9"]["I’m demanding @Equifax's CEO brief the Senate Banking Committee on the impacts of its massive data breach. https://t.co/mk8fN9sYHd #mtpol https://t.co/Pa3CE7l1nt"]["The Highway 200 Complex and Moose Peak Fire are now eligible for additional @FEMA assistance. #MTFires #mtpol\nhttps://t.co/0SLENJAWeo"]["We will #NeverForget the thousands of American lives lost on #September11 https://t.co/kg4Q1Mkq86"]["These resources will be a critical force on the front lines as firefighters &amp; first responders fight the #MTFires.\nhttps://t.co/zE5D5ZL3g4"]["A happy #FlattopFriday from @RedLodgeAles. I hope everyone can escape the smoke and sit back with a cold one this weekend! 🍻 https://t.co/lZ9NdmyHq1"]["The #MTFires are national news &amp; I will fight for national help to recover from this brutal fire season. #mtpol\nhttps://t.co/rWGX71C52l"]["Today I invited @POTUS to come out and see the destruction &amp; havoc the #MTfires have wreaked across our state #mtpol https://t.co/kWN7cLWuL3 https://t.co/w1KP11zGLO"]["Extreme weather poses a serious risk to MT's economy. Things will only get better if we take a stand #MTfires #mtpol https://t.co/i1jOBymEhX"]["As Congress works to help folks devastated by Harvey, we also need to help folks across the West fight these fires. #MTFires #mtpol https://t.co/x8vrMv2EVw"]["We’ve tragically lost two brave firefighters and seen homes, farms, ranches, and businesses crumble before our eyes. #MTFires #mtpol https://t.co/GFUWeNfvlz"]["More than 45 #MTFires have already consumed over 900k acres—an area larger than the state of Rhode Island—and 600k continue to burn. #mtpol https://t.co/NbIvoiB05G"]["The #MTFires have created so much smoke that air quality has been deemed “hazardous” in parts of the state. https://t.co/Uf7RvhNcjv #mtpol https://t.co/j0SYfES84R"]["Nearly ALL of MT is in a historic drought. Dry grass, high winds &amp; lightning -&gt; 40 new fires across MT just last week. #MTFires #mtpol https://t.co/HRsdZ7dTX4"]["Record temps &amp; severe drought have turned MT into a tinderbox. WATCH LIVE as I talk #MTfires on the @SenateFloor: https://t.co/X8CMbcdzDU https://t.co/aAD1jS0w8s"]["Amid one of the worst wildfire seasons on record, I will continue to fight for the emergency funding Montana needs to combat the #MTfires. https://t.co/xs1R6FdbCU"]["On #LaborDay we all must recognize the hard working folks in Montana’s labor movement! https://t.co/FXeEZAkZhi"]["We can't sit idly by as a dangerous dictator threatens our families, freedoms, &amp; America’s standing in the world. https://t.co/TXp7icRwnm"]["It's been a grueling fire season, so please stay safe &amp; reach out to me w/ any questions about assistance. #MTfires\nhttps://t.co/R3RRFgjVxF"]["As #MTfires continue to rage I want to thank the firefighters on the front lines putting in long days—they will always have my full support. https://t.co/RpWUvLaPqi"]["My blue collar jobs tour continues in Helena. Together, we can create good-paying jobs across Montana. #mtpol https://t.co/WaATMJkP4D"]["This project will bring hundreds of jobs &amp; millions of $ in economic growth to Northwest MT. #EmployMT #ConnectMT\nhttps://t.co/JKzaf86daC https://t.co/Icdk3NFZuA"]["Stopped by Ben Steele Middle School w/ the USS Billings crew to kick off the new school year! I know you all are as excited as we are 😜 https://t.co/09Frlfe7R8"]["Great tour of @RedLodgeAles and even better beer. Montana's craft breweries create good paying jobs across the state #mtpol https://t.co/sRMtjl0EgR"]["This is a common sense bill that gives folks on the ground more power to determine what’s best for students. #mtpol\nhttps://t.co/2DVgX2WSDe"]["As Sponsor of USS Billings, Sharla's showing the crew around the ship's namesake city this week. Today Sharla &amp; her #squad stopped by @KTVQ. https://t.co/Ny7r2UlOEl"]["My Blue-Collar Jobs Tour is about creating more good-paying jobs for folks who want to work w/ their hands #EmployMT https://t.co/nLkhcDSaIF"]["I am joining Montana This Morning. Tune in now on @kpaxnews #mtpol https://t.co/uAltqbqqMC"]["I'm in Butte America launching my blue collar jobs tour. We need to work together to create good paying jobs across Montana #mtpol https://t.co/RpS0Hq6OMw"]["Stopped by the @ButteSilverBow Fire Department to thank the brave first responders who keep this city safe. 🔥🔥🔥 https://t.co/GzOGO6Eflv"]["As we head back into session, I hope the VA Committee can lead by example &amp; inspire more folks in Congress to reach across the aisle. #mtpol https://t.co/GatqSA1mq0"]["Happy birthday to the @NatlParkService! We threw a party at the gateway to @GlacierNPS this week to celebrate! #FlattopFriday #KeepItPublic https://t.co/ZyVgQATms3"]["#tbt to a very busy birthday. I barely had time to celebrate! Thankfully someone brought this to my listening session with @SecShulkin. https://t.co/uDMzn2bGyk"]["We're still here till 8 pm! Come on by! #LastBestOutdoorsFest https://t.co/py56oISyT6"]["We cherish our public lands and the jobs they sustain in Montana. The full house at the #lastbestoutdoorsfest shows it. #mtpol https://t.co/v1lXOvn0jc"]["Kicking off my Last Best Outdoors Fest. Our public lands brings millions of dollars and thousands of jobs to Montana's economy. #mtpol https://t.co/6BL7LORUve"]["Great to present the Columbia Falls American Legion with a flag flown in their honor over the U.S. Capitol. We must honor our vets. https://t.co/rGPeITyG8y"]["My pleasure talking jobs and the importance of infrastructure at the groundbreaking of the Glacier Rail Park in Kalispell. #mtpol https://t.co/wdgalurVvm"]["Hosted @SecShulkin in Helena today to talk about how we can get even more done for #veterans across MT. #mtpol\nhttps://t.co/7ONmSPS3C9"]["Oddly enough, @SteveDaines and I are both turning 39--again #mtpol https://t.co/fnAZZtjLSK"]["#SolarEclipse2017 in Helena, MT with my grandkids. https://t.co/pSmj1K6Ry0"]["Touring the VA facility in Helena with @SecShulkin. It's critically important to hear from the folks on the ground on how to improve the VA https://t.co/qHETKZTqC6"]["Great to host @SecShulkin this morning in Helena #mtpol https://t.co/W8FkzNM1i7"]["T-minus 2 days until our first-ever Last Best Outdoors Fest—a celebration of MT's booming outdoor economy. 🍺🎤🏕️\nhttps://t.co/2vctpiZJy2"]["See amazing speakers @ my first https://t.co/nuLJyM5eSy THIS TUESDAY, including REI’s Community &amp; Government Affairs Manager @Taldii Walter https://t.co/RYj9FhnOey"]["Come out THIS TUESDAY to my first https://t.co/nuLJyMmQh8 in Columbia Falls to see amazing speakers, including: https://t.co/c44XM0AMoP https://t.co/bpUmUNh2ny"]["Come out THIS TUESDAY to my first https://t.co/nuLJyM5eSy in Columbia Falls to see amazing speakers, including: https://t.co/qfm8LtyuGR https://t.co/Q5L95uTx8Y"]["Come out THIS TUESDAY to my first https://t.co/nuLJyM5eSy in Columbia Falls to see amazing speakers, including: https://t.co/8Bqvjym7MS https://t.co/2YFTtYbVTY"]["Great to join the groundbreaking for the water treatment plant at Tiber Dam. This means clean water and jobs for north central Montana https://t.co/xIrQ4OuPY8"]["Hearing from folks on the ground is important to my job as a Senator. Great to be in Bozeman to hear about new ways to #employmt #mtpol https://t.co/Ai6ITh1nZC"]["From the library to the airport to the fire department—and a few other places in between—I had quite a day in the Magic City! https://t.co/JjXiudUmrb"]["Great to hear from Billings business leaders on how to create more jobs across Montana #mtpol #employmt https://t.co/q2LlN1ihaH"]["Great to join @KTVQ this morning in Billings https://t.co/zplDqCg4l8"]["Had a great time chatting with local business owners in Great Falls. These are the folks who #EmployMT https://t.co/EgizqCrMx9"]["With threats like North Korea, the men &amp; women of the @341MissileWing are more important than ever &amp; working hard to keep us secure. #mtpol https://t.co/rLuWwdnkDz"]["Great to join @KRTV this morning to talk about delivering for Montana's veterans #mtpol https://t.co/UzffnGkrZI"]["As #MTfires continue to burn I want to remind anyone who's been affected to contact my office for help &amp; assistance. https://t.co/L4r0WKp94Z https://t.co/wS2VZrUvVw"]["As #MTfires continue to burn I want to remind anyone who's been affected to contact my office for help &amp; assistance. https://t.co/a0Qn6N3jnR"]["I won’t stop until @BetsyDeVosED rips off this red tape &amp; gives our rural schools the resources they need. #mtpol\nhttps://t.co/jUAI9CEfyK"]["Including the VA Clinic in Missoula! Proud to have our third bipartisan veterans bill signed into law! #mtpol https://t.co/5YzTbNIQwG"]["This will bill strengthen @DeptVetAffairs &amp; expand the VA Clinic in Missoula—proud to see it signed into law! #mtpol https://t.co/ZBC1wBm9TE"]["This bill strengthens VA care &amp; helps fix #Veterans Choice—proud to have it be my 4th 📜🖊→ law this Congress! #mtpol https://t.co/GraJIxHwfo https://t.co/3cgBxd2KPV"]["Today's #FlattopFriday is also a #FlashbackFriday to my testimony on protecting the gateway to @YellowstoneNPS. https://t.co/BNMFk1d0QK https://t.co/vaz9R963uG"][".@BetsyDeVosED must roll back the red tape @usedgov's using to stop rural schools from getting annual funding #mtpol https://t.co/3v0aT87uob https://t.co/Bls94CepEY"]["Getting input from the folks on the ground is a critical part of my job. First up today: Fort Belknap Tribal Council. https://t.co/2RmteMWkdI"]["10 years ago I helped lead the charge to clean up DC &amp; shed light on special interests taking over Congress. #mtpol https://t.co/na3AnMKzd2 https://t.co/pvoonjM8Nq"]["Join me, @MTBizforOutdoor &amp; the @montanabrewers in 2 WEEKS for a celebration of MT's outdoor economy! 🌭🍻🎤 \n\nRSVP -&gt; https://t.co/Ord2zQxqw8"]["I hope my colleagues heed this advice &amp; support my bill to help fight the opioid epidemic. #mtpol @BillingsGazette\nhttps://t.co/hNEHuO6pAH"]["Shout out to Waverly from Fairfield, who won a purple ribbon at the Teton County 4-H Fair w/ her own great take on Sharla’s brownie recipe! https://t.co/vhAqH7CEsB"]["Honoring those who have sacrificed for our freedom is not a partisan issue, it's our patriotic duty. #PurpleHeartDay https://t.co/mQOb7YT5t4"]["Last year's @WellsFargo scandal went beyond opening unauthorized accounts &amp; we must hold them accountable. #mtpol https://t.co/ze1B1UYyPY"]["Like (grand)father like (grand)son. #TheMoreFlattopsTheMerrier https://t.co/5xj0qefgTJ"]["Happy Birthday to my amazing wife Sharla! Great to be celebrating back in MT. BDs are always better in Big Sky Country. PC: @billingsgazette https://t.co/SMy7JgLZge"]["Meeting w/ the Incident Commander of the Rice Ridge Fire outside Seeley Lake. Thanks to the firefighters for you hard work. #mtfire #MTFires https://t.co/8vrI88mSYe"]["Join me, @MTBizforOutdoor &amp; @montanabrewers on 8/22 in Columbia Falls for the first ever Last Best Outdoors Fest! https://t.co/IL0oExdJBz https://t.co/sAUlQfMgWn"]["The grandson of Norman McLean says \"his legacy &amp; ours depend on the health of the Blackfoot River.\" #KeepItPublic\nhttps://t.co/DNoT3hY9Eb"]["This is exactly why I introduced the Blackfoot Clearwater Stewardship Act. We must protect this Montana treasure. #KeepItPublic #mtpol https://t.co/MabLViia8Y"][".@JohnnyIsakson &amp; I discuss our huge success passing 3 major bipartisan bills through Congress this week! WATCH LIVE https://t.co/SJ7aanVVij https://t.co/hJxkvV4jBW"]["I was pleased to once again work with @SenatorIsakson and pass this important legislation and send it to @POTUS to be signed. #mtpol"]["This #GIBill expansion will open doors and create opportunities for our nation’s #veterans. #mtpol"]["BREAKING: The Senate passed our major bipartisan legislation to expand veterans’ educational benefits #GIBill #mtpol https://t.co/u6kLnRLLDf"]["Senate also passed our #bipartisan bill that speeds up disability appeals, so #veterans aren’t left waiting for answers. #mtpol (4/4) https://t.co/euymZdaIDT"]["Tonight we passed a bipartisan bill that helps address workforce shortages at the @DeptVetAffairs. #mtpol (3/4) https://t.co/YU0VZmJpZq"]["Great news for #Missoula #veterans, a larger VA clinic is coming your way. #PassingBills #GettingThingsDone #mtpol (2/4) https://t.co/nqdqK7pNip"]["We're sending another bipartisan veterans bill to @POTUS! Thx @SenatorIsakson for working with me to deliver for #veterans. #mtpol (1/4)"]["It's great to see businesses like Montana Specialty Mills move into the AgriTech Park &amp; create jobs in GF! #EmployMT\nhttps://t.co/QCOsQRNkou https://t.co/IzOp5b5QpJ"]["If you need help w/ disaster assistance due to drought or wildfire, fill this out &amp; I’ll have someone call you ASAP: https://t.co/L4r0WKp94Z https://t.co/TuId5Mkerx"]["Following N. Korea’s missile launch, @SenatorHeitkamp &amp; I are calling on @POTUS to appoint a special envoy. #mtpol\nhttps://t.co/TXp7icRwnm https://t.co/BO1scpdeVQ"]["It's time to work together and find a bipartisan solution that will make health care more accessible &amp; affordable for ALL Montanans. #mtpol https://t.co/nJpdDutStX"]["Republicans and Democrats must work together to lower the cost of health care for all Montanans. #mtpol"]["You hear that @GovernorBullock? All in a day's work. #teamworkmakesthedreamwork #LodgepoleComplex #wildfire #mtfire #mtfires https://t.co/VvGELmpdup"]["Eastern MT needs these resources, glad to work w/ @fema to get them to firefighters on the ground. #LodgepoleComplex #wildfire #MTfires https://t.co/iPxpa49IJA"]["It's time to get in gear &amp; put out the #LodgepoleComplex #wildfire so we can focus on rebuilding eastern MT #MTfires https://t.co/jZCxLftnRR https://t.co/L3e3RGGzsp"]["@fema These @fema funds will provide eastern MT w/ equipment, supplies, evacuation, shelter, mitigation, management &amp; mobilization assistance."]["After calling @fema Admin Brock Long twice this week about the #LodgepoleComplex #wildfire I'm glad MT will get resources from feds. #mtfire https://t.co/sKk91jiaxP"]["These photos show exactly what my bill Yellowstone Gateway Protection Act is protecting. #KeepItPublic #mtpol https://t.co/EHcTHZJ106 https://t.co/FXMHiRCGqQ"]["I had the chance to chat w/ Ridley &amp; told him not to let a few missing fingers slow him down! These kids = #MTValues\nhttps://t.co/MrqWrhfJ0u"]["As the Senate debates health care, this uncertainty is driving up health insurance rates in rural America. #mtpol https://t.co/Y71rrZntO4"]["New report from @OIA reveals MT’s outdoor economy -&gt; $7.1 billion/year &amp; 71,000 jobs 🏕 #KeepItPublic #ThriveOutside\nhttps://t.co/8hBSFUG1Qf https://t.co/31WLw8vCFn"]["My bill to protect @YellowstoneNPS for future generations is receiving a committee hearing this morning. #mtpol\nhttps://t.co/kewNg9EvWc https://t.co/7FpfFPh0yg"]["I’ve introduced 7 bills to lower health care costs—that’s what we should be voting on right now. #mtpol https://t.co/nETmcXZPcr"]["Speaking on the Senate Floor about the wildfires currently raging across Montana. #mtfire #MTfires WATCH LIVE HERE: https://t.co/bwDVkVQA6n https://t.co/f1EsJLXjFl"]["It’s time for Congress to walk the walk &amp; get to work. #mtpol @billingsgazette https://t.co/RaEz1v5gTb"]["As eastern MT faces a severe drought, I've worked with @USDA &amp; they're sending extra staff to help. Info here: https://t.co/TjghqQ7QfG https://t.co/RZRXYE6sqg"]["The @RedCross can help you prepare for #mtfire / #MTfires. Below is a prep list &amp; A LOT more info can be found HERE: https://t.co/toKRVbg6C1 https://t.co/TZcc2hvMRh"]["We're monitoring the #MTfires closely &amp; you can stay up to date w/ @mtpublicradio. Be vigilant &amp; stay safe. #mtfire\nhttps://t.co/BdK2aGKdWk"][".@HeadStartgov helps our next gen thrive &amp; these resources will help kids in Great Falls &amp; beyond. #mtpol @GFTribune\nhttps://t.co/NKZc2WkDRy https://t.co/vpflSRjL0X"]["My bill will help stabilize rates, increase certainty for insurers &amp; curb growing healthcare costs #mtpol https://t.co/XAIhGHODXy @kpaxnews https://t.co/i01qlrQVWa"]["MT mourns the loss of Mr. Johnson—a sobering reminder of what firefighters risk to protect us. His bravery &amp; sacrifice won't be forgotten. https://t.co/dLaAr4xXrT"][".@SenJohnMcCain is tough as nails and we’re all in his corner as he takes the fight to this terrible disease."]["\"77% of Montanans support the Upper Missouri Breaks and other existing monuments.\" -@missoulian #KeepItPublic #mtpol https://t.co/OqAihtNQkW https://t.co/IXL2DooBlj"]["Instead of proposing another scheme to rip away coverage, Congress should work together to improve access &amp; lower health care costs. #mtpol https://t.co/0kmM303TzB"]["Check out what I’ve been talking, reading, and tweeting about in this week’s edition of #FlattopHeadlines #mtpol\nhttps://t.co/ffWeooPBsP"]["My grandson Brayden just wrapped up his big trip to DC. Next time he comes, I might even let him take my seat &amp; cast a vote on the floor! 😉 https://t.co/TVTLyfsZU7"]["@whatwouldDOOdo @uscapitol DM me your contact info and we'll set something up!"][".@whatwouldDOOdo Once you're settled in DC you should come by the @uscapitol and we can chat about giving these vets the care they deserve. https://t.co/CBCif9uadz"]["ICYMI\n#KeepItPublic #mtpol https://t.co/7tjYDERPev"]["Today we honor a man who loved &amp; served our nation. Conrad Burns will be forever remembered by the people of Montana. May he rest in peace. https://t.co/METbzTFCuz"]["ICYMI https://t.co/S2fTbXLQLa"]["https://t.co/Z9CvVSQosx #mtpol #WhatsAtRisk"]["ICYMI: https://t.co/P4qlKR29xg\n#mtpol #bipartisan #veterans https://t.co/n5F7ps5ACf"]["My statement on the Senate's updated health care bill:\n#WhatsAtRisk #mtpol https://t.co/7ck3saPdAf"]["I’ve introduced a bill to hold Big Pharma accountable &amp; protect MTs against sky-high prescription drug costs. #mtpol https://t.co/edIrOtzT41"]["I just left a truly unbelievable committee hearing on the future of Indian health care. Watch the full video here: https://t.co/HDXMOfod1A https://t.co/2VO3IO2Lc9"][".@GovernorBullock &amp; I are demanding the @WhiteHouse rescind a request that could threaten the privacy, freedom &amp; voting rights of MTs #mtpol https://t.co/ZQhE5pqRnH"]["Check out what I’ve been reading, tweeting &amp; talking about recently w/ this edition of #FlattopHeadlines — https://t.co/k9o9HIHQB0 https://t.co/HdbpeDhzOw"]["Thank you to all the firefighters currently battling these blazes. Monitoring developments closely. Everyone stay safe out there! #mtfire https://t.co/JzT60GSxke"]["The Kalispell Bypass has won the American Transportation \"Quality of Life\" Award—a great investment for years to come!  #ConnectMT #mtpol https://t.co/ozdqUvIFDj"]["I'm proud to work with folks on BOTH sides of the aisle to produce real results for our nation’s #veterans. #mtpol\nhttps://t.co/jiBxzJz1Qb https://t.co/OuGBDAkD36"]["Joined @kpaxnews to talk about health care reform &amp; how to ensure ALL MTs have access to quality affordable health care. #WhatsAtRisk #mtpol https://t.co/ShTlMyYU4A"]["My office was in good 🐾 as I traveled across MT this week. Winston is one gov't watchdog w/ the loyalty &amp; good \"scents\" to get the job done. https://t.co/Ih2bbKs2hg"]["Joining @kpaxnews bright and early this beautiful Montana morning https://t.co/HNXJDngHct"]["Met with Missoula #veterans today &amp; told them I would fight with everything I had to make sure proposed cuts to the VA don't happen. #mtpol https://t.co/OUTtfsBGZV"]["Health care is an investment that helps millions of Americans lead prosperous, productive lives. #mtpol #WhatsAtRisk https://t.co/x1JFoJ8lw9"]["We can pass a health care bill that works for all Montanans if we're bipartisan, transparent &amp; inclusive. #mtpol\nhttps://t.co/7PsxmKlQl4 https://t.co/GmcHNekCgd"]["Today we celebrate the freedoms that make 🇺🇸 the greatest country on 🌎 &amp; empower us to work hard and thrive. #RedWhiteandBlue #FourthOfJuly https://t.co/wJi3VpYHCg"]["ICYMI: On Saturday, my wife Sharla christened the USS Billings. God bless our men and women in uniform, and God bless America. #HappyFourth https://t.co/RrVbSrw2H7"]["We need to rein in our budget and reduce our deficit, but not at the expense of communities​ like Butte, America. #mtpol https://t.co/31lmsOIsBp"]["\"Billings is truly the Magic City, and just from looking at this ship I can tell it’s got a little bit of magic in it.” - Sharla Tester https://t.co/KkqPqemw3M"]["Watch LIVE as my wife Sharla christens the USS Billings! #mtpol #BillingsLaunch\nhttps://t.co/YN37mlzCQi https://t.co/tgAswUiFkc"]["“Had a great time touring the USS Billings today. Excited for the big day tomorrow!” -Sharla https://t.co/OqthA5h2pz"]["My pleasure to be at Riverstone Community Health Center talking about what's at risk for Montana patients, families, and communities #mtpol https://t.co/hX5fLHcOpE"]["Cheers to my lovely wife Sharla who is in WI to christen the #USSBillings. Before she left MT, she got a little practice in on the farm. https://t.co/jikiP175cp"]["Up bright and early to talk with the  @bigjshow https://t.co/AR4vhqqDhW"]["I will continue to hold this administration accountable &amp; always fight to protect MT's clean air &amp; water. #mtpol https://t.co/MPpnn3IJOM https://t.co/v9M8kZEXyh"]["On the steps of the Capitol showing folks exactly #WhatsAtRisk &amp; who’s at risk if we roll back health care. #mtpol https://t.co/hfRJdWByPf https://t.co/NvAS2ME0d5"]["Join me NOW to discuss the Senate's controversial health care bill. #WhatsAtRisk #mtpol \nhttps://t.co/0PW5YUKAVP https://t.co/YJACv0F02S"]["My statement on the decision to delay the Senate’s health care bill vote:👇 #mtpol #WhatsAtRisk https://t.co/bAAVvf8jrb"]["Lyn from Livingston tells us #WhatsAtRisk if we go back to a system where folks couldn’t afford to get sick. #mtpol\nhttps://t.co/zW0A9341bn"]["Join me TOMORROW on Facebook LIVE to discuss this week’s vote on the Senate health care bill.  #WhatsAtRisk #mtpol \nhttps://t.co/x3BlHVfn8i https://t.co/tqqegs7Hin"]["This is what we can accomplish when we put politics aside and work together on behalf of our #veterans. #mtpol\nhttps://t.co/9KZq5siBHw"]["We need to improve our health care system, not kick folks off their insurance plans &amp; jack up rates for MT families. #WhatsAtRisk #mtpol https://t.co/u8DYFvD01c"]["Anyone considering voting for this terrible bill should hear #WhatsAtRisk if we upend our health care system.\nhttps://t.co/ip9WsMVY4t"]["Full house for my health care town hall tonight in Great Falls. https://t.co/wqmYkULsHl"]["Honored to have Dick Brown (MT Hospital Assoc), @vicky_byrd (MT Nursing Assoc), &amp; Dale Lambert (GF Schools) joining me tonight. #mtpol https://t.co/BnOZlQTyHf"]["My town hall starts in 15 minutes! See you soon. #mtpol https://t.co/v580FfQXDZ"]["Join me TONIGHT to ensure Montanans have a seat at the table &amp; make your voice heard! #WhatsAtRisk #mtpol \nhttps://t.co/sB9NXmyi5w https://t.co/guEwxmv8jc"]["The Senate’s health care bill cuts Medicaid, threatening coverage for 250k Montanans like Jay. #WhatsAtRisk #mtpol https://t.co/zAwbNzaEvx https://t.co/5jo6n2wP27"]["Today @PresidentTrump signed my VA Accountability bill into law, which will help #veterans get care and benefits they’ve earned. #mtpol https://t.co/afoT90y79Q"]["I'm glad to see the @USDA has finally listened to my many demands to halt the import of Brazilian beef. #mtpol \nhttps://t.co/7UktuXL7I9 https://t.co/vVWgHlFe1b"]["My statement on the Senate's health care bill:\n#WhatsAtRisk #mtpol https://t.co/CnNEm1eIMo"]["Join me THIS SATURDAY in Great Falls for a health care town hall &amp; have your voice heard! #WhatsAtRisk #mtpol\nhttps://t.co/Rgwiwp8aSs https://t.co/5qVHK1wXTg"]["I'm fighting to make sure ALL Montanans have access to quality, affordable health care. #WhatsAtRisk #mtpol\nhttps://t.co/k8Exf6VItj https://t.co/FaW3KQ53dn"]["After folks in the majority claimed their secret health care meetings were open to “anybody,” I made sure to RSVP! #WhatsAtRisk #mtpol https://t.co/SeOxplbIT2"]["Real Montanans explain #WhatAtRisk when it comes to the future of health care.  #mtpol\n\nhttps://t.co/AXmOaMNku8 https://t.co/FLYkt8zhh9"]["Congress' current health care plan will put Jennifer of East Glacier &amp; thousands more out into the cold #WhatsAtRisk https://t.co/zAwbNzaEvx https://t.co/NZsXx73Cjt"]["This secret health care process does a disservice to folks like Julie Williams of Shepherd, MT. #WhatsAtRisk \nhttps://t.co/zAwbNzaEvx https://t.co/CXRPzIBFS5"]["The ACA isn’t perfect so let’s fix it instead of throwing out all the progress we’ve made on health care. Too much is at risk. #WhatsAtRisk"]["A small group of politicians are crafting a health care bill that will impact every American &amp; we don’t know what’s in it. #WhatsAtRisk"]["Speaking for every Montanan who deserves to know what the heck is going on w/ health care &amp; #WhatsAtRisk. WATCH LIVE https://t.co/7eNJY20nFb https://t.co/hqLoQQSpiY"]["Going back to the old health care system where folks couldn't afford to get sick is a bad move for MT. @AARPMontana https://t.co/PNGAaV7Y5M https://t.co/5kSIUDMB0O"]["This week I’m featuring Montanans who will be impacted by a deadly rewrite of our health care system. #WhatsAtRisk  https://t.co/a9g5xF7LqP https://t.co/yKIKoDHs7t"]["According to the @MTHCFoundation, more than 70k Montanans could lose healthcare under Congress’s current plan. #mtpol #WhatsAtRisk https://t.co/L1pQkPLnpb"]["Recently chatted with @NBCMontana about my thoughts on Russia, the Paris Climate Accord, health care and https://t.co/UUFHDODCd4 #mtpol https://t.co/P9SVG0i7gJ"][".@CapitolPolice put their lives on the line to protect officials, visitors &amp; institutions that uphold our democracy https://t.co/PIL8vHyIEM"]["We need to rein in spending, but not at the expense of hardworking families, seniors &amp; rural communities. #mtpol\nhttps://t.co/ylPHPlWnBV https://t.co/FUI6V2h3Yj"]["As @GlacierNPS &amp; @YellowstoneNPS stand to lose $$$ under @POTUS' proposed budget, I’m reaching across the aisle to protect our public lands. https://t.co/66iLNfKgFe"]["Had a great chat with Browning's Olivia Hall about how well @trioworks for her &amp; I promised to always fight for MT's students. #mtpol https://t.co/SvMZ13BWki"]["Congress passed my VA Accountability bill to help our #veterans get the care they've earned. Next stop @POTUS' desk!\nhttps://t.co/mV05xSVmw7"]["My thoughts are with Rep. Scalise, all victims, staff and the brave Capitol Police officers who work hard to protect us every day."]["Talking to thousands of Montanans right now about health care, budget cuts &amp; more on my teletownhall. #mtpol https://t.co/fRY6EdGxM7"]["#KeepItPublic #mtpol https://t.co/8F98rSymjC"]["@Interior @YellowstoneNPS @GlacierNPS This budget gives ammunition to the folks who want to sell our public land, undermine our outdoor economy &amp; fundamentally change our state."]["@Interior The proposed budget would take millions from @YellowstoneNPS &amp; @GlacierNPS, cut funding for trail maintenance by 84% &amp; gut LWCF. #mtpol"]["Every aspect of the fed budget is critical, but the @Interior budget impacts our state in particular &amp; what's being proposed would hurt MT."]["As a result, MT’s outdoor economy sustains more than 64,000 jobs and contributes $6 billion to our state’s economy each year."]["We enjoy an unmatched quality of life in MT—a headwaters state with 27 mil acres of public land &amp; infinite outdoor opportunities. #mtpol"]["Joining hunters, business owners &amp; MT officials to raise concerns about the impact of the President's proposed budget on our outdoor economy"]["As 13 Senators debate health care in secret, they are now preventing reporters from asking tough questions. We need transparency now. #mtpol https://t.co/xd4ieqUGPq"]["As DC crafts a health care bill behind closed doors, MT officials need to bring transparency back to this debate. https://t.co/tD6WOVsgBR https://t.co/El7ENNswfh"]["Getting MT beef back on the menu in China helps ranchers grow their operations &amp; make a living off the land. #mtpol \nhttps://t.co/HiOcE1jgKh https://t.co/cYGqf9ibae"]["I’ve introduced a bill to help the VA recruit, train &amp; retain top-notch medical professionals. #mtpol https://t.co/omoVi0MYhd https://t.co/JzYqw3Bpkv"][".@pacificsource has secured in-network access to all air ambulances in MT, saving nearly 45,000 MTs from huge fees.\nhttps://t.co/WEzmmf2Bwl"]["100 years after 168 miners lost their lives, the Granite Mountain disaster remains the worst hard rock mining disaster in U.S. history. https://t.co/p4r1XxjaZX"]["I'm pleased that former FBI Director Comey is testifying at a public hearing so we can get to the bottom of this &amp; get back to governing."]["Montana is known as the Last Best Place. @AmeriCorps &amp; @ServeMontana play an important role in keeping it that way.\nhttps://t.co/yHFzmcgpDu https://t.co/mXMSAPlHCy"]["With the help of @SenatorIsaakson &amp; @SenatorRubio, the Senate unanimously passed our VA Accountability bill—a big victory for #veterans. https://t.co/pAQCpGKccN"]["Last week, I logged a few hundred miles listening to farmers, ranchers, veterans, seniors &amp; families across MT. https://t.co/HVq8TM6n45 https://t.co/1BewNRILS4"]["Proud to work with @SenatorIsakson and @SenatorRubio on this bill that the Senate unanimously passed earlier today. https://t.co/gWDRvunVcu"]["Watch @SenatorIsakson &amp; I discuss our bill to hold the @DeptVetAffairs accountable to #veterans on the Senate floor. https://t.co/jR7nexYL8G https://t.co/3D8aDiZafl"]["Upward Bound puts taxpayer money to its best use, preparing the next generation to be productive, contributing members of the MT community. https://t.co/qRpRWhMR0t"]["ICYMI: https://t.co/SojBxyvjRZ"]["I visited FALKOR Defense this week to discuss the huge opportunities MT’s gun manufacturers will have once the ECR Initiative is finalized. https://t.co/MVAygoltmb"]["My VA Choice Improvement Act means #veterans will start having a better Choice experience as soon as July! #mtpol\nhttps://t.co/Iav04d5MqV https://t.co/rr2ycJNiaw"]["@TomLFulton Absolutely! Just swing by the office (Hart Senate Building #311) any time between 9 and 5 tomorrow and they'll give you the VIP treatment."]["Back in Montana holding listening sessions this week. Rain check? https://t.co/Z2NpGmUTT1"]["The @whitehouse’s attempt to gut critical manufacturing resources will hurt Montana workers &amp; companies. #mtpol\nhttps://t.co/hHMgHfeFu1 https://t.co/lHE1Cx30IH"]["This bill will support Montana businesses, strengthen our national security, and create good-paying jobs. #mtpol\nhttps://t.co/nzw5SgtaGy https://t.co/5ZPAtHS2Cl"]["I’m urging the @whitehouse to cut red tape for gun makers like FALKOR so they can access new markets &amp; create jobs. https://t.co/ORKLOaDHi3 https://t.co/c8IMYAEawL"]["Held #veterans listening sessions in Billings &amp; Missoula this week to talk issues w/ the VA's Choice Program. #mtpol https://t.co/wPIVonk26l https://t.co/oWwLj6W0Fz"]["Continuing to get feedback from MT veterans on how we can improve care for our veterans #mtpol https://t.co/8VMSa9bC6K"]["Starting my morning off right with @kpaxnews https://t.co/FCZrFC5lzz"][".@theMysteryRanch announcing my new bill to supply folks who keep us safe with equipment made in the USA. #mtpol https://t.co/kGFBHSbypU https://t.co/WTxQJyt3eM"]["To ensure the next Farm Bill works for MT, family farmers &amp; ranchers must have a seat at the table. #mtpol @ABCFOXMT https://t.co/3BlbIYJvbX https://t.co/eD3ssS16YQ"]["The Choice program is broken, I am gathering feedback from Montana veterans on how we can work together to fix it and make it work for MT https://t.co/Qo0cOS7VfK"]["Great to join @KTVQ this morning to talk about my veterans listening sessions. Hearing from Montana vets is critically important to my work https://t.co/M9MqDys4Cr"]["Today and every day, we must always remember the men and women who paid the ultimate price to protect our freedom. #MemorialDay https://t.co/gXi72NyuCU"]["It's my job to listen to veterans' ideas &amp; concerns and work across the aisle to address them. #mtpol @KXLF https://t.co/Eyk4NzGx4f https://t.co/S5pSDVGYYx"]["Had a great time in Glendive and Lewistown today chatting with my fellow farmers about how we… https://t.co/LGtbZ4LUp1"]["As a farmer, I know how important the Farm Bill is to MT. It's my pleasure to hear from my fellow producers in Lewistown #mtpol https://t.co/c945As0OVW"]["The Farm Bill is critically important to MT. That's why I'm in Glendive to hear from Montana producers about how we can improve it #mtpol https://t.co/N9Nc86ctb6"]["Great to hit the airwaves in Sidney this morning https://t.co/YifX5YVIGY"]["Rather than move the #AHCA forward, let’s work together, R's &amp; D's, to lower costs &amp; increases accessibility. #mtpol https://t.co/EVqjyhyrni"]["The #AHCA is as irresponsible as we all thought. #mtpol #CBOSCORE https://t.co/EVqjyhyrni"]["For 50 years, Upward Bound at UM has helped 1st generation college students graduate. That shouldn't end because of gov't red tape. #mtpol"]["Now it is critical that Sec DeVos does not make this mess worse by rejecting UM's Upward Bound grant. #mtpol https://t.co/Ns9oX9C0P3"]["Sec DeVos' decision to ignore MT was troubling, but I'm pleased she will reconsider UM's grant application. #mtpol https://t.co/Ns9oX9C0P3"]["My statement about the proposed budget: https://t.co/4MycQ0HJZ9 #mtpol https://t.co/3P7coPcs85"]["Today we confirmed Gov. Branstad as Ambassador to China &amp; I told him to expand trade opportunities for MT producers. https://t.co/lddrxgfVPm https://t.co/sTfkksOUga"]["MT is called Big Sky Country for a reason, so we need to invest in places like @BozemanAirport ✈️ to #ConnectMT. https://t.co/lH6G56SV7U https://t.co/aPzAZ8TOFw"]["Montanans have been clear: we do not want a sales tax in MT &amp; I'm making sure the @WhiteHouse is on the same page. https://t.co/XaSccnFnA7 https://t.co/2t7MT9JRqq"]["ICYMI https://t.co/CPe3AyPjKL"]["The @IndianCommittee unanimously passed my bill to recruit &amp; retain more good teachers across Indian Country. #mtpol https://t.co/fGaU8q7KG4 https://t.co/ty5nXwrsqJ"]["On #ArmedForcesDay we salute all the folks in uniform who sacrifice their safety to protect our families, our freedom &amp; our way of life. https://t.co/3XBCJqL15L"]["The proposed budget wouldn't just cut funding for @SeniorCorps, it would eliminate the program all together. #SeniorCorpsWorks https://t.co/RwnxSYiaFN"]["Dave's a Missoula-based Navy vet who has continued to serve through @SeniorCorps. He's proof that #SeniorCorpsWorks. https://t.co/AX6AwBfPdb https://t.co/vmKZ6rYheE"]["I'm urging the @WhiteHouse not to cut funding &amp; potentially cripple MT anti-drug task forces. #mtpol @Missoula_Indy: https://t.co/RWm0Nwx5Xj https://t.co/HN94bAdkAD"]["From the @Missoulian to @NBCMontana, check out what I’ve been watching, reading &amp; talking about recently: https://t.co/p5FJom1nmt #mtpol https://t.co/iZ0i6zxbeD"]["Bill to reduce @BetsyDeVos' personal budget by $500k/week until DoE reconsiders @umontana's Upward Bound app #mtpol https://t.co/AZxCiiBjXO https://t.co/l3Dt6gAGn3"]["From securing new security equipment @FlyGTF to talking health care w/ @TeamCavuto, check out what I’ve been up to on #BigSkyRewind #mtpol https://t.co/T0pvbq2miO"]["It's with heavy hearts that Sharla &amp; I mourn the loss of Dep. Moore. MT is forever grateful for his service &amp; will not forget his sacrifice. https://t.co/Wiq3nXtw0X"]["I’ve introduced a bipartisan bill to give first responders the recognition they deserve. #NationalPoliceWeek #mtpol https://t.co/gVEB46uwvW https://t.co/TJLoIJ2ZAJ"]["MT #veterans often love the doctors &amp; nurses at the VA. But there are a few folks who give the VA a bad name. #mtpol https://t.co/RWODeTn97k https://t.co/6ueOhXlUeh"]["The details of our federal budget may not make be glamorous, but they are critically important to Montana. #mtpol https://t.co/T4tBOvvvIJ https://t.co/JhoH5ctFUT"]["Happy Mother's Day to the woman who's made me the luckiest husband and father this side of the continental divide. https://t.co/7hj0f58fxT https://t.co/Gk5PLkdnqn"]["This #MothersDay I'm teaming up with @HeidiMurkoff and @WhatToExpect to say, \"let's put moms &amp; babies first!\" https://t.co/GNYsFSuWPn"]