["Thank you to the dairy farmers across the state of Iowa who produce milk enjoyed around the nation! #NationalMilkDay https://t.co/19UTu8SW5Y"]["Today, I'm wearing blue to raise awareness on #HumanTraffickingAwarenessDay and in support of efforts to #EndTrafficking. #WearBlueDay @DHSBlueCampaign https://t.co/mEnua98lkV"]["The Tax Cuts &amp; Jobs Act will provide sweeping tax cuts for farmers and rural communities, allowing our producers to keep more of those hard earned dollars. Watch my full remarks on the Senate floor today here: https://t.co/SanxK2OFQ6"]["I applaud @POTUS' move today to automatically open the door for more veterans to receive potentially lifesaving mental health treatment. We must continue helping to ensure that our veterans are prepared to transition back to civilian life. https://t.co/DFfu5kMop6"]["Thank you to our #lawenforcement in Iowa and around the country who risk their lives daily to keep us safe. #LawEnforcementAppreciationDay https://t.co/Z4mUcuVa6r"]["Read my statement following @POTUS' remarks at the @FarmBureau's Annual Convention today: https://t.co/Zz9sudIGp1 https://t.co/t0UQMgt6ED"]["Setting the record straight on #taxreform and the opportunities for Iowans in the @gazettedotcom: https://t.co/xyZaWdkueA"]["Our resolution solidifies U.S. support for Iranians fighting for freedom, peace and a freely elected democratic government. We stand behind those rejecting a government that favors terror and oppression over human rights and economic prosperity. #IranProtests (2/2) https://t.co/hQ2zNlIjpU"]["The recent protests in Iran further expose the brutality of the Iranian regime. That is why I joined a bipartisan group of colleagues in condemning the government of Iran for their support of terrorist organizations and the continued oppression of the Iranian people. (1/2)"]["With the #TaxCutsandJobsAct, you’ll have more of your own paycheck to decide how to spend, rather than giving it to the federal government – which does not have the best record of responsibly spending your hard-earned dollars… Read more here: https://t.co/xyZaWdkueA https://t.co/hG7U0Wonxk"]["📰 The Tax Cuts and Jobs Act means new opportunities for Iowans. Read more in today's @gazettedotcom → https://t.co/xyZaWdkueA"]["#BREAKING: My bipartisan VETS Act just advanced through the Senate, moving us one step closer to improving veterans' access to health care - including mental health treatment - by expanding VA telehealth services. Read more: https://t.co/HPOdDXLTpB"]["Fortunate to have worked with my friend @senorrinhatch over the last three years. Thank you for your years of dedicated service and wishing you, Elaine, and your family the very best."]["✨From my family to yours, have a very happy and prosperous #NewYear! ✨ https://t.co/n3M0PRKmoz"]["Why is tax reform good for Iowa’s small businesses? Watch: https://t.co/tz1531vE5K"]["#Taxreform is now law. What does that mean for Iowans?\n✅Middle- and low-income will see lower tax rates\n✅Individual mandate eliminated\n✅Folks will keep more of their hard earned dollars\n✅Child tax credit doubled\n✅Job creators will be more competitive \nhttps://t.co/Gq2UVNJGrg"]["Happy 171st Birthday to Iowa! https://t.co/IGzYNym6K5"]["We have made significant progress in 2017, and I am looking forward to building on these gains in the new year. https://t.co/Nv1A02jrXg"]["Love getting to spend a little time with my family this holiday season! https://t.co/gGN1eRvIxX"]["Thankful for all our servicemembers for their sacrifices and commitment to protecting our great country https://t.co/wHAx9yqJ7I"]["ICYMI: I joined my colleagues in introducing bipartisan legislation to protect against sexual harassment and discrimination in Congress and hold members accountable for their actions. More in this @KCCINews story: https://t.co/XYY28TdTD2"]["Coming soon → Tax Relief! Today, the President signed #TaxReform into law. Learn more about what this means for Iowans here: https://t.co/Gq2UVNJGrg"]["Iowans sent me to Congress to make Washington squeal. I am thrilled my SQUEAL Act was included in this historic tax reform package. Next stop, @POTUS' desk: https://t.co/YPmIRIPvDl https://t.co/qxxiTe51CN"]["🚨 UPDATE 🚨 We are one step closer to helping hardworking, lower- and middle-income Iowans keep more of what they’ve earned. Tax reform, including my SQUEAL Act, has passed the Senate: https://t.co/YPmIRIPvDl"]["Sunday morning read 📰 @qctimes: Ernst joins Gillibrand on sexual harassment bill https://t.co/x4YQFZO9ks"]["ICYMI → @POTUS signed #FY18NDAA into law which includes 37 of my provisions: https://t.co/eRsCQpHytN"]["🎉Congratulations 🎉 to the 41 exemplary young Iowans that I had the honor of nominating to be considered for appointments to our U.S. Service Academies. https://t.co/3w9a90b0OO"]["Today I joined my colleagues in introducing the bipartisan Congressional Harassment Reform Act. Read more → https://t.co/iFuoKU7Ra0 https://t.co/vDxIjYYhL8"]["Corporal Chesty was pawsitively cheerful at @ToysForTots_USA today! 🐾 https://t.co/YBDN42RD4Y"]["Happy Birthday, @USNationalGuard! #Guard381 🎂 https://t.co/ECaPeAUkME"]["To all who are celebrating, wishing you a #HappyHanukkah"]["Today, @POTUS signed into law the National Defense Authorization Act to provide critical support to our men and women in uniform. Read more about the #NDAA and my 37 provisions included in the law: https://t.co/zlJuInZDHx https://t.co/JCrdHKzZkr"]["What a game! Great to watch Army #BeatNavy over the weekend with one of my favorite #Army fans! https://t.co/ipJpKia5LN"]["Please join me in praying for those in NYC impacted by the Times Square terror attack and expressing gratitude for the first responders and law enforcement who rushed into action."]["Had an encouraging and productive conversation with nominee to be assistant secretary of the Army for Civil Works where I received a commitment to improve the flawed flood project funding formula. More in @RadioIowa: https://t.co/HvCxMio6e6"]["We can, and must, do better for our veterans. @ChuckGrassley and I are working to get answers from the @DeptVetAffairs following a disturbing report on hiring practices at VA facilities. WATCH: https://t.co/44BuRK6gAD via: WQAD"]["Thank you @realDonaldTrump for reiterating your commitment to Iowans and all of rural America by continuing to support the Renewable Fuel Standard in today’s meeting."]["Pleased that the Senate's Tax Cuts and Jobs Act included my SQUEAL Act and other efforts. More here: https://t.co/WCwSe8ej4Z"]["The Senate took a monumental step forward in pursuing a simpler tax code that provides much-needed relief for hardworking Iowans and helps strengthen our economy. Read my full statement here: https://t.co/WCwSe8ej4Z"]["I'm wearing my red ribbon today in honor of World Aids Day, and as a reminder that we must continue the fight to eradicate this devastating disease. #WAD2017 https://t.co/mdw0G9RNqh"]["Traveling office hours are a great opportunity to receive assistance from my office in a town near you. Here is where you can visit with one of my staff members today https://t.co/jE3XTTHBdv"]["Today, the Senate voted to begin debate on the much-needed tax reform package. https://t.co/zyvxCnYQNf"]["How will tax reform help #Iowa? It’ll lower the pass through rate for #smallbiz, help create ~10,000 Iowa jobs, and let lower &amp; middle income Iowans keep more of their hard earned $$. Watch → https://t.co/2kM594FBda"]["Joined @SBALinda and small business advocates to stress the importance of tax reform to provide relief for our small businesses so they can flourish and thrive. Watch: https://t.co/vGxi61JJZ8 https://t.co/HLYwwpp4m9"]["My staff is here to assist you in your dealings with the federal government and answer questions you may have. Visit with a member of my staff at one of today's traveling office hours https://t.co/ZQWWpQuavQ"]["Important read 📰 → Ernst: Tax reform would provide much-needed relief and opportunity for Iowans https://t.co/nGibyyt2Uq"]["Small businesses are the backbone of the economy and make up nearly 97 percent of all employers in Iowa. Be sure to #shopsmall this #SmallBizSat, and help support our Iowa small businesses. cc: @SmallBizCmte https://t.co/gRBElNqZbE"]["November is #MilitaryFamilyAppreciationMonth. Today – and every day – I am #thankful for my family’s unwavering support, and for the families across the globe who stand alongside their loved ones in uniform. Happy Thanksgiving and may God bless you and your family. https://t.co/89T4Z5yVZ4"]["In this season of thanksgiving, it was an honor to visit with our Iowa soldiers who are away from their loved ones at the holidays, and to thank them for the sacrifices they make – and those of their families – to protect all that we hold dear. https://t.co/mIDdkYQ9IT https://t.co/MssHO6DLRM"]["Read more about the experiences our interns gain and how to apply for a Spring 2018 internship in one of my Iowa or Washington, D.C. offices: https://t.co/tf8OwVZCZU"]["U.S. Marine Corps, Gunnery Sergeant Al Nelson's service to our nation in World War II at Iwo Jima, the Korean War, and the Vietnam War is inspiring. I was honored to participate in a ceremony honoring this Iowa veteran and true American hero: https://t.co/MK0L8fPwdJ"]["Today we celebrate the families that are now complete because of adoption, and raise awareness of the many children across the country still in need of a home. #NationalAdoptionDay https://t.co/aQqcfhP37g"]["During #NationalFamilyCaregiversMonth, we recognize and thank family caregivers. Proud to lead a bipartisan effort to provide these caregivers with a tax credit to help when caring for a loved one. https://t.co/hsj4s1TebG https://t.co/KfSJh4HWC5"]["Traveling office hours are a great opportunity to meet with a member of my staff about your dealings with the federal government. Here is where you can meet them today. https://t.co/pWo0bf7HQJ"]["I am pleased to see several of my efforts that aim to increase the strength and readiness of our military were included in the final package of the NDAA. I hope @POTUS signs it into law as soon as possible. https://t.co/RcdKD84tlk"]["If you have a question or need assistance in your dealings with a federal agency, be sure to stop by one of my staff member's traveling office hours today. https://t.co/lJ0mmWA7ZU"]["Pleased to hear @POTUS raising awareness over the rise of ISIS in Southeast Asia, a threat I have been following closely and one we cannot afford to turn our back on: https://t.co/XQr3esZZng"]["WATCH LIVE: I'll be speaking from the Senate floor about the need to lower tax rates for middle and low-income Iowans. Likewise, by creating a more competitive tax system for businesses, we can foster greater growth and investment in the US, &amp; boost wages https://t.co/4yyfYiclYH"]["@SenThomTillis Congratulations to you and your family on this wonderful blessing!"]["Today the Senate confirmed Dr. Mark Esper to be Secretary of the Army. As a member of the Senate Armed Services Committee, I look forward to working with Dr. Esper to ensure our soldiers have the resources they need to protect our homeland &amp; defend our freedoms."]["Stop by one of my office's traveling office hours today to meet with a member of my staff. https://t.co/NBNN38XFp6"]["Our veterans deserve our gratitude for their selfless service to our nation. I was honored to spend time with veterans from across Iowa this weekend. Watch: https://t.co/api0Gv8Rdm via @weareiowa5news"]["My staff is here to help you. Visit with a regional director from my office who can provide assistance and answer questions about your dealings with federal agencies at any of the stops below. https://t.co/hRBMMvyoA5"]["My legislation to roll back former presidents’ taxpayer funded perks just passed the House ✅\n\nNow it needs approval by the Senate, and then off to the President’s desk to be signed into law. Learn more here: https://t.co/QBO5a20Rma"]["Sunday morning read 📰 Joni Ernst's SQUEAL Act targets lawmakers' deduction for living expenses https://t.co/52ABG4niGu via @OWHnews"]["On Veterans Day, I want to express my deepest gratitude to Iowa's more than 200,000 veterans, and all those who have served across the nation. Thank you for the selfless sacrifices you've made to protect all that we hold dear. https://t.co/yV1xwdsKRT"]["As often as I can, I lead ruck marches with veterans &amp; staff. We march to remember the sacrifices of our veterans &amp; those who still serve. https://t.co/pVpfEi4z2u"]["Thank you to the @USMC for 242 of service to our great nation. Happy Birthday, Marines!"]["\"I firmly believe that it is our duty, as a grateful nation, to ensure we are doing everything we can to support and honor our veterans, as well as those who continue to serve in uniform.\" Read more in my #VeteransDay op-ed in the @TelegraphHerald. https://t.co/ulAqfmital https://t.co/LQkYghgfek"]["My staff is here to help in your dealings w/ the federal government and answer any questions you have. Here is where you can visit them today https://t.co/stySTRG3cB"]["Traveling office hours are a great opportunity to talk with a member of my staff in a town near you. Here is where my staff will be today https://t.co/cwxjWEg3a4"]["Thrilled the House passed our bipartisan bill to expand veterans' access to telehealth. Learn more about VETS Act: https://t.co/OZKglKuINM"]["My staff will be in all 99 counties this month to answer questions and provide assistance with the federal government. Here's today's stops https://t.co/BQrgaZlnHl"]["My staff is here to answer questions &amp; offer assistance you may need with the federal government. Here's where you can visit my staff today https://t.co/3VJmXEmNOw"]["Do you need help with a federal agency? Here are today's traveling office hours where you can talk with a member of my staff https://t.co/fUkVYfMaIf"]["My office is here to help! My staff is holding traveling office hours in all 99 counties this month. Here's where they'll be today https://t.co/UKmCOw38TQ"]["Praying for the victims of this horrific terror attack in NYC. Grateful for the selfless actions of first responders and law enforcement."]["The only thing scarier than #Halloween is a world without bacon. Happy #NationalPorkMonth from Iowa, the #1 pork producing state in the U.S. https://t.co/AJpP9Wd75j"]["Time to make Washington squeal! 🐷 I intro'd my SQUEAL Act to eliminate thousands of $$ in a tax break for Congress: https://t.co/ji3sU8qTbE"]["Today, we intro'd the Prove It Act to give small businesses a stronger voice &amp; incentivize better rulemaking: https://t.co/4IAmzInnY2 (2/2) https://t.co/u7rN6vw1Qb"]["A fed agency can claim a proposed rule won’t hurt #smallbiz, but @SenatorHeitkamp &amp; I aren’t taking just their word for it… (1/2) https://t.co/BzEiHDHzQn"]["In 2016, Iowa ranked #28 in the US for human trafficking cases; that’s unacceptable. I joined a bipartisan discussion on ways to combat it. https://t.co/NfXBVDa4d9"]["Proud to see my resolution to honor USS Forrestal crewmembers, those lost, and survivors of the 1967 fire, approved https://t.co/v1vM6nllSY https://t.co/uTnrI32b5N"]["#OnThisDay in 2012: @ChuckGrassley gave us an update on his drive down Highway 136 and @Twitter was never the same. No need to assume. https://t.co/byE4Cs8E6G"]["Now the House must pass our budget to pave the way for tax reform so Iowans can keep more of their hard-earned dollars! (2/2) https://t.co/zfd8NKiIwq"]["Good discussion with @realDonaldTrump at lunch yesterday on the Hill over tax reform. (1/2)"]["My last #99CountyTour stop was a productive town meeting in Plymouth County. Thank you to all who attended! https://t.co/UEjBCemIjk"]["Great to visit local shops in Buena Vista Co. Small businesses are the backbone of our communities. #99CountyTour https://t.co/R0EftwYYzK"]["Tonight @EPAScottPruitt provided us w/ key commitments that he will uphold the spirit of the RFS. My statement here: https://t.co/93st8oeGIt"][".@OWHnews: Ernst: Trump, EPA taking steps in right direction on renewable fuels https://t.co/WKj0J4bpwh"]["My thoughts on the EPA’s nominee for role that directly oversees the implementation of the RFS: https://t.co/UqoYNmKYgQ"]["Great input over coffee w/Pocahontas Co. business leaders &amp; law enforcement on tax reform, mental health care, and more #99CountyTour https://t.co/GjzZxRAxJ8"]["Today, I met w/ Administrator Pruitt to make clear that we will never stop fighting to protect the #RFS: https://t.co/NASSApLacY https://t.co/f9Xta0iGZ2"]["It was an honor to greet our veterans on the Eastern Iowa Honor Flight as they arrived in Washington, D.C. today! https://t.co/rCe7ox4RX7"]["Just wrapped up my 99 county tour! https://t.co/BIvZCV1tzG"]["I heard from community leaders about flood damage recovery efforts in Butler County &amp; the work that still needs to be done #99CountyTour https://t.co/oc6QVI73TP"]["In Chickasaw Co., I  visited with local businesses and folks along New Hampton's Main Street. #99CountyTour https://t.co/FRhJB518US"]["I visited @helpingservices in Fayette Co. to learn more about the work they do for children &amp; families in NE Iowa #99CountyTour https://t.co/rZO21CDfxA"]["Happy 242nd Birthday to the @USNavy! #SemperFortis https://t.co/143TBNN9Ni"]["Thank you to Iowa farmers for their hard work, persistence &amp; commitment to our land. Wishing you a happy #NationalFarmersDay. https://t.co/eXbZNTVQmK"]["This month we celebrate our survivors, honor those we have lost, &amp; support those continuing to fight. #BreastCancerAwarenessMonth https://t.co/M6x18avYVU"]["Today is #WorldMentalHealthDay. Visit https://t.co/bR2Rog97tw to learn more about mental health and to find local services and resources."]["Today we celebrate Iowa's manufacturers and their commitment to excellence when producing goods used around the world. #ManufacturingDay https://t.co/u8EhMnO3dT"]["Don't forget: applications for a nomination to one of our exceptional U.S. Service Academies are due TOMORROW! https://t.co/liud06Uht3"]["Just a few days left to submit your U.S. Service Academy nomination application. Visit my website for more info: https://t.co/liud06CGBv"]["Joined @kiwaradio to discuss my commitment to defending the RFS. Listen here: https://t.co/1uUs5ThNwf"]["REMINDER: The deadline for Iowa students to apply for a nomination to a U.S. Service Academy is this Friday, 10/6. https://t.co/liud06CGBv"]["Sen. @ChuckGrassley and I will never stop fighting to protect the RFS &amp; Iowa: https://t.co/F51qtis8Ay"]["My prayers are with all of the victims in #LasVegas and their loved ones affected by this senseless act of violence."][".@Messenger_News applauds Ernst for her proposal and urges Congress to give it serious consideration: https://t.co/C71ksg2GSN"]["I had a productive discussion with mental health providers, law enforcement &amp; community leaders in Lee County. #99CountyTour https://t.co/V7ImlDJegD"]["Great to visit with business leaders in Mitchell County and hear from the Osage Chamber about developments in the area. #99CountyTour https://t.co/9I55fISIHP"]["From wind energy to biofuels, Iowa is helping to lead our nation in #RenewableEnergy innovation! #NationalCleanEnergyWeek https://t.co/3LqXUsnxn9"]["We tragically lose 20 veterans a day to suicide, according to VA. One vet lost to suicide is too many. We must do better for our vets. (1/2)"]["Thrilled that @SteveScalise returned to the U.S. House today! Your faith, strength and determination is inspiring. https://t.co/fVMMoxRiND"]["I sent a letter to the President urging him not to lower RFS volumes https://t.co/2La3uxwcNZ"]["This #ChildhoodCancerAwarenessMonth join me in raising awareness &amp; showing support for the children, families, &amp; survivors. https://t.co/SkW4PYIlN4"]["Tax reform must put Iowa’s families, individuals, and small businesses first. Read my statement here: https://t.co/aTiUE1vILA https://t.co/GX3TOr70bK"]["Thanks to everyone who attended my #99CountyTour town meeting in Johnson County https://t.co/GVDatXb22A"]["The Wayne County town meeting was a good opportunity to hear from Iowans about their concerns and ideas. #99CountyTour https://t.co/Eu1q6KOtr4"]["Appreciated hearing from folks who attended the Floyd Co. town meeting, including AP govt. students from Charles City HS #99CountyTour https://t.co/PrETdFgHhI"]["Agri Pulse: Corn, soy, wheat groups applaud bill to boost funding for ag export programs https://t.co/4epsBZ6bKU"]["Ag Web: Bipartisan Push to Boost Ag Exports https://t.co/5bnbKrT7rE"]["Read more about our bipartisan CREAATE Act in Ag Daily: https://t.co/uc2WzQ0nIg"]["VIDEO: Our veterans fought tirelessly for us – and now it’s our turn to stand up for these American heroes. https://t.co/fr86SPLhlS"]["@anotherdrbob From Ernst staff: Please contact our Des Moines office at (515) 284-4574 and ask for Amy"]["This critical &amp; bipartisan legislation included 41 of my provisions. Read more here: https://t.co/vdf48kY3wx (2/2) https://t.co/FT4vSfKTp9"]["Today the Senate passed the FY18 #NDAA, ensuring our servicemembers have the resources they need to protect themselves &amp; our country (1/2)"]["Happy 70th Birthday to the @usairforce! Thank you for continuing to protect our nation and the freedoms we hold dear. https://t.co/5dvuFimnrd"]["On #ConstitutionDay, let us reflect on the core principles established in our Constitution &amp; all those who serve our nation to defend it. https://t.co/LAvP6Q5OCf"]["I hope your birthday is as great as your love for ice cream. Happy Birthday to my dear friend, Senator @ChuckGrassley! https://t.co/QlJ6NJfHVa"]["KCRG: Ernst continues fight to cut costly presidential perks https://t.co/65MQNjnEVq"]["On #NationalPOWMIARecognitionDay we reflect on our nation's POW/MIA &amp; their loved ones. They will never be forgotten. https://t.co/9V4nJIslfT"]["Hear more about this legislation here: https://t.co/3wfO9pGZzd (2/2) https://t.co/JmS9IjHkgy"]["BREAKING: Our bill to roll back former presidents’ perks just passed out of @GOPoversight w/ unanimous support. cc @CongressmanHice (1/2)"]["Grateful for the opportunity to visit with our veterans from the Des Moines Honor Flight at the Korean War Veterans Memorial in Washington. https://t.co/PnhlO9lcZU"]["It was an honor to welcome Iowa's veterans on the Waterloo Honor Flight to Washington, D.C. yesterday. https://t.co/9wUdrLAbsG"]["This #NationalTruckDriverAppreciationWeek, join me in recognizing Iowa’s hardworking truck drivers. https://t.co/RqLCAndGat"]["I joined @FoxAndFriends to discuss my bill to roll back some of the perks of former presidents. https://t.co/cvWTtUCTy0"]["Great visit to the Clay County Fair over the weekend. I enjoyed seeing old friends &amp; new. #99CountyTour https://t.co/oZhdMHg2gP"]["September is #NationalChickenMonth! https://t.co/rmeOGuRcfU"]["🚨Our national debt just hit $20 TRILLION 🚨We have to get serious about cutting spending. My legislation is a start:\nhttps://t.co/cvWTtUCTy0"]["Re-intro'ing a bill to roll back some past presidents’ perks, implement greatly needed reforms &amp; save taxpayers $$ https://t.co/64z77qpUXA"]["I had the opportunity to tour Cherokee County’s Main Street and visit with small business owners &amp; community members. #99CountyTour https://t.co/IlB6rq2V0d"]["let us #NeverForget those we lost and those who continue to protect our freedoms. (2/2) https://t.co/WbtHLVO0hw"]["As we remember the attacks on the World Trade Center, the Pentagon and in PA, (1/2) https://t.co/PgaNbRvTx6"]["ICYMI: Watch KCCI's story about our call to cancel the Oct. State Work Period to stay &amp; work: https://t.co/HAgtD0ITUZ cc @ChuckGrassley"]["Today I voted in favor of relief funding for victims of Hurricane Harvey, but against raising the debt limit: https://t.co/FndpkW1Pv9"][".@ChuckGrassley and I are calling for session instead of October State Work Period https://t.co/hB6oXL1GQU"]["Productive visit at Two River Co-op in Jasper Co. I heard their thoughts on trade &amp; how we can reduce regulatory challenges. #99CountyTour https://t.co/96n70OtYNt"]["From health care to farm bill, I discussed important issues w/Innovative Ag Services employees &amp; community leaders in Jones Co #99CountyTour https://t.co/3wqylCbuBn"]["My statement on the Trump administration’s announcement regarding the Deferred Action for Childhood Arrivals (DACA) program: https://t.co/hlZsJhH5YI"]["Today we celebrate the American spirit of ingenuity, hard work, &amp; perseverance. Happy #LaborDay! https://t.co/yWao58CjWK"]["Great choice to nominate my friend @BNorthey as Undersecretary for Farm Production and Conservation at USDA https://t.co/3JknH9CwKv"]["At Grinnell Regional Medical Center in Poweshiek Co., I learned about the care they provide to the folks in rural communities. #99CountyTour https://t.co/LXdjOAKF5i"]["It was a pleasure to visit with several small business owners as I toured the Belle Plaine Main Street in Benton County. #99CountyTour https://t.co/lYbaQtPD9d"]["Enjoyed touring Iowa Premium in Tama Co. last week, the first Iowa-based company to send beef to China after 13 year embargo! #99CountyTour https://t.co/VdgjgwzA6c"]["In Dickinson County, I visited with land and farm owners about conservation programs &amp; priorities in the 2018 Farm Bill. #99CountyTour https://t.co/F1kBNKdPh2"]["In Osceola Co. I had a productive discussion with Lewis &amp; Clark Water System &amp; local leaders abt supporting rural communities #99CountyTour https://t.co/DpDpfkzu3A"]["At DGR Engineering in Lyon County, I learned more about their ongoing projects &amp; visited with employees. #99CountyTour https://t.co/cR5RCtxomN"]["It was a pleasure to visit Maassen Dairy in Sioux Co. #99CountyTour https://t.co/iFO8ufnLYF"]["For info and ways to help, visit: https://t.co/lIZJCEtn1G (2/2) https://t.co/zSpt89e5Aw"]["Grateful for first responders &amp; volunteers (inclu many Iowa volunteers) working tirelessly to help those impacted by #HurricaneHarvey. (1/2)"]["I toured Associated Milk Producers Inc. and got a first-look at their soon-to-be completed expansion project in O'Brien Co. #99CountyTour https://t.co/hdp8vucgso"]["Join me in praying for all those affected by #HurricaneHarvey."]["Gave a quick legislative update followed by a productive conversation with folks at the Sioux City Noon Rotary in Woodbury Co. #99CountyTour https://t.co/QlQNyaWFtK"]["Great discussion at Nichols Farms in Adair County on everything ranging from trade and the 2018 Farm Bill to national defense. #99CountyTour https://t.co/9Vgatr4FUS"]["Last week I toured &amp; spoke with employees at Asmus Farm Supply in Winnebago Co. about the importance of ag, Farm Bill &amp; more. #99CountyTour https://t.co/yfRQQKBr2k"]["Moved by the support Cradle of Hope Pregnancy Resource Center provides the unborn, mothers &amp; families in Henry Co. #99CountyTour https://t.co/B7ImPuVKhZ"]["Enjoyed touring Milton Creamery in Van Buren County, whose award-winning cheese has made its way from coast to coast! #99CountyTour https://t.co/MvdFJHDtiI"]["Enjoyed touring RMA Armament in Appanoose County to learn how they make body armor for our military &amp; law enforcement. #99CountyTour https://t.co/cudUmt6IgO"]["Visited with nurses, doctors &amp; staff ab caring for our vets at the Ottumwa VA Community Based Outpatient Clinic in Wapello Co. #99CountyTour https://t.co/bBFMJl4oUx"]["Grateful for the opportunity to visit with folks at Sieda in Davis Co about their work to help Iowa families. #99CountyTour https://t.co/eNYPMz1xkA"]["Enjoyed meeting w/POET Biorefining employees in Hamilton Co to discuss the importance of the #RFS for Iowa's rural economies. #99CountyTour https://t.co/33a5GocHlw"]["At Weiland Farms in Hancock County, I saw how technology is taking on an increasing role on their family farm. #99CountyTour https://t.co/8RRLznArlJ"]["Discussed protecting crop insurance &amp; other important ag issues in the upcoming Farm Bill with the Worth County Farm Bureau. #99CountyTour https://t.co/bUWV0NoNta"]["Join me in thanking the employers who support our @NationalGuard and Reserves as they faithfully serve our nation. (2/2) https://t.co/XkxznHGAzY"]["This week is National Employer Support of the Guard and Reserve Week. (1/2)"]["My statement on the path forward in Afghanistan https://t.co/VyT86tgIFw"]["Thanks to family owned &amp; operated SATERN Barrels in Emmet County for showing me your facility &amp; letting me drill a barrel! #99CountyTour https://t.co/KixEmR5CfZ"]["Great time working &amp; visiting with folks while I was \"Clerk for a Day\" at Casey's in Humboldt County. #99CountyTour https://t.co/KLdd4WJFTB"]["Enjoyed touring Aluma Trailers' new warehouse addition &amp; learning about their growing manufacturing business in Kossuth County #99CountyTour https://t.co/EaL15d3y2w"]["Productive discussion with the Palo Alto County UDSA Farm Service Agency on burdensome regulations &amp; the upcoming Farm Bill. #99CountyTour https://t.co/2T9vhnMcfl"]["I appreciated hearing Iowans' concerns, ideas and questions firsthand at my town meeting in Washington County. #99CountyTour https://t.co/ZG650unkUo"]["Our servicemembers serve tirelessly each day to uphold our freedoms. Please join me in praying for our missing USS John S McCain sailors."]["I heard from rural law enforcement officers in Keokuk County about the challenges they face while serving our communities. #99CountyTour https://t.co/ZNYBgRW11q"]["I had a great discussion with Williamsburg Manufacturing employees in Iowa County about the need for good trade agreements. #99CountyTour https://t.co/nDJVRdgvQN"]["My Webster County town mtg was a great opportunity to hear about issues most important to Iowans. Thanks to all who attended. #99CountyTour https://t.co/LvkUS4hDP7"]["Learned more about Tipton Adaptive Daycare in Cedar County and all they do to for Iowa children and their families. #99CountyTour https://t.co/L5fiGocjf8"]["Our prayers are with the victims and all those impacted by the horrible terror attack in #Barcelona."]["We are one nation, under God, and indivisible. We cannot stand for this terrorism. (2/2) https://t.co/kCm6xs7Ln9"]["The violence in #Charlottesville that is fueled by racist hatred has no place in our society. (1/2)"]["Talking strategy ahead of the Governor's Charity Steer Show! #iowastatefair https://t.co/X5JzwISlYS"]["Great to visit with so many folks at the @IowaPork tent! #IowaStateFair https://t.co/NWMAuGb5N9"]["Looking forward to a great day at the @IowaStateFair! https://t.co/j2o0isUiLj"]["Read more about our bipartisan #KnowBeforeYouOweAct in @Messenger_News: https://t.co/2pIMMjaL6f cc: @ChuckGrassley @SenFranken"]["Today we honor America’s Purple Heart recipients – selfless men and women who sacrificed in service to our nation. #NationalPurpleHeartDay https://t.co/2clkkqAzQr"]["This memorial will honor the brave men and women, and their loved ones, who have sacrificed so much in defense of our nation. (2/2) https://t.co/QgP2jY34O4"]["Thrilled the Senate passed our bipartisan Global War on Terrorism War Memorial Act: https://t.co/gViE0XPeVf (1/2)"]["Happy 227th Birthday to the @USCG! Thank you for your commitment to protecting our nation. #SemperParatus https://t.co/C60NzcTrvD"][".@maziehirono &amp; I pushed for expanded telehealth in our VETS Act &amp; are glad to see this put into action: https://t.co/vdngd9QagX (2/2) https://t.co/hDLCQgKpSd"]["Pleased the VA has decided to expand telehealth services for veterans &amp; provide telemedicine across state lines... (1/2)"]["Discussions continue in @SenateAgGOP over the 2018 Farm Bill. Read more about my efforts in @KMABroadcasting: https://t.co/FNuCGXQ3mN"]["Pleased @SmallBizCmte approved my bipartisan bill to study women owned small biz opportunities https://t.co/BErR3erFNF cc @SenGillibrand"]["This is an opportunity to work legislative efforts through our committees and engage w/all of our colleagues to find a solution. (2/2) https://t.co/8oQ3iMqFFd"]["Today I called for the Senate to press ahead on repealing &amp; replacing ObamaCare. https://t.co/awK57RU9Fo (1/2)"]["On #NationalWhistleblowerDay, we recognize the contributions of Whistleblowers in pursuit of a better, more efficient, federal government. https://t.co/oZkiLD3RJi"]["The memorial will honor our men &amp; women in uniform, fallen servicemembers, families &amp; all those impacted by our nation’s longest war. (3/3) https://t.co/zwncUYBlyI"]["Thrilled the House passed the Global War on Terrorism War Memorial Act. I intro'd this bipartisan bill in the Senate w/ Sen Manchin... (1/3)"]["We must now continue to find ways to work on behalf of Iowans and the American people who have been negatively impacted by Obamacare (2/2) https://t.co/4ZLSAEDCoL"]["I am disappointed that the Senate was unable to advance important changes to this flawed law. https://t.co/a8srehcFVk (1/2) https://t.co/wzDmqTxvKZ"]["Happy #NationalInternDay! Grateful to have had these hardworking students in our office! Apply here: https://t.co/tpJIte5HRk https://t.co/7kH7pfUxPh"]["On the 50th anniversary of the USS Forrestal fire, I introd a resolution honoring the crew, including @SenJohnMcCain https://t.co/4WPNp2Cjm6 https://t.co/jAOFEm3yw6"]["On #NationalKoreanWarArmisticeDay, we recognize the service of our men &amp; women who fought to defend freedom &amp; democracy in the Korean War."]["Today I joined 36 Senators in calling for the @USDA to push the Chinese government to end their ban on U.S. poultry: https://t.co/BSqrMb6FT1"]["Great to visit with @iowaffa officers &amp; @NationalFFA kids from across the country with @secretarysonny at @USDA this morning! https://t.co/DFwUaoXCPS"]["We’re looking for interns in the Washington, D.C. and Iowa offices for Fall 2017! Learn more here: https://t.co/DOHyZLox9b"]["Proud to help introduce the bipartisan Know Before You Owe Federal Student Loan Act. Read more here: https://t.co/K25mGlF6N2"]["Today we took a step forward and voted to allow the full Senate to begin debate over repealing &amp; replacing ObamaCare https://t.co/kpVrp8VrHb"]["As support continues to grow, our bipartisan Global War on Terrorism War Memorial Act made progress this week: https://t.co/rWUArLuMhE"]["ICYMI: I had the privilege of joining @MilitaryTimes in recognizing their 5 Service Members of the Year: https://t.co/fmvmZ6xO20"]["I spoke w/ @NRO about the importance of providing our Army soldiers w/ the most reliable ammo available. Read more: https://t.co/VtneEkeDlI"]["My DC &amp; Iowa offices are now accepting internships applications for Fall 17! More info for interested students here: https://t.co/camFgNLBjD"]["Looking forward to seeing you soon! https://t.co/9mLsQzj15o"]["At @SenateAgGOP hearing I called for increased trade agreements to strengthen our ag economy &amp; natl security. More: https://t.co/wfLfdyxlC8"]["At @GovWaste's #PigBook release, I spoke about my efforts to highlight wasteful spending with my #SquealAward: https://t.co/yZMjyim0He https://t.co/XeCs1OFmqQ"]["Thanks to the folks at yesterday's town meeting in Shelby County for sharing their thoughts &amp; stories with me. #99CountyTour https://t.co/eSGRpbE8DB"]["On #IndependenceDay, let us renew our commitment to uphold the principles our founding fathers envisioned for our nation. https://t.co/gFUiycphwh"]["The first U.S. beef export in more than 13 years arrived to China last night. A huge win for our nation's agriculture industry. https://t.co/Q7jfHl4a5q"]["Pleased the FY '18 #NDAA includes 35 of my provisions to strengthen national security &amp; support our servicemembers: https://t.co/9KBZXDE2co"]["Today I introduced the HEARTS Act to improve flexibility &amp; choice for medically retired servicemembers. Learn more: https://t.co/ZnJyqIwcIE https://t.co/UH0jfYKFZ4"]["Today, the administration took another step in scrapping this burdensome WOTUS rule. Good news for #Iowa. https://t.co/1MlWV0rHzQ"]["Thrilled to have support from Iowa Governor Kim Reynolds for the EMPOWERS Act. https://t.co/lFmsWRzJ46 https://t.co/dP7fXyHTyy"]["#EMPOWERSAct gives states flexibility to modernize programs to help families &amp; individuals find long-term success: https://t.co/lFmsWRzJ46 https://t.co/f62VY5DuhQ"]["Today @marcorubio &amp; I unveiled our legislation to combat poverty and empower states. Read more ab the #EMPOWERSAct: https://t.co/lFmsWRzJ46 https://t.co/89h60WZGtN"]["Investing in Iowa's teachers is investing in our future leaders. Read more about bipartisan Teachers Are Leaders Act https://t.co/c34QammnDE"]["This will improve expertise within the military justice system. Read more here: https://t.co/tmQY1FbN0F (2/2) https://t.co/PkCUTXGSAj"][".@SenGillibrand &amp; I intro'd bipartisan legislation to create a career track for the Judge Advocate General (JAG) Corps (1/2)"]["I joined my friend and fellow lifelong motorcycle rider, @SenGaryPeters, to officially launch the Senate's first ever Motorcycle Caucus! https://t.co/Yybnxm0Dfz"]["Today is #NationalSelfieDay, so I’m posting an early #tbt from my spring break reception with Iowans! https://t.co/A0B6J0798z"]["On the Senate floor I shared Iowan's stories and highlighted the unsustainable health care system under ObamaCare. https://t.co/gOxEceiFVt"]["My prayers are with the 7 sailors killed aboard the USS Fitzgerald, as well as their families, friends &amp; shipmates."]["Terrorism Is on the Rise in Southeast Asia https://t.co/1I3TcIEbbZ @Militarydotcom"]["Happy birthday to the 45th President of the United States, @POTUS!"]["The U.S. flag is symbol to be revered &amp; a reminder of the great sacrifices our past &amp; present servicemembers have made for our freedom. https://t.co/C6cwnrwMUa"]["242 years of bravely serving our nation. Happy Birthday @USArmy! #Hooah! https://t.co/cHvA6CKDCc"]["Continuing the status quo in Iowa simply isn’t an option because ObamaCare is unsustainable:  https://t.co/xM2X5Zun6l (2/2) https://t.co/3wLBdJ2sEG"]["Earlier today I joined many of my Senate colleagues at a White House meeting on health care reform. (1/2)"]["Intro'd bipartisan legislation to extend suicide prevention training in National Guard &amp; Reserves https://t.co/VmjFUcRHT0 cc @SenatorTester"]["On Memorial Day, I paid tribute to our fallen servicemembers at the dedication of Lucas County Veterans Memorial Park. #99CountyTour https://t.co/rlV0CpZCmD"]["Enjoyed sharing the time-honored tradition of @USArmy Twilight Tattoo with the students of Lynnville-Sully Middle School last night. https://t.co/FqYsw5fjp2"]["The @scj editorial board believes our \"Kirkpatrick Act deserves passage by Congress.” Read more: https://t.co/zV6gpyZKub"]["Great to visit with Iowans in DC this morning! If you're planning a trip, make sure to stop by my office for coffee https://t.co/9gaOuWbsId https://t.co/OU2GbzAfBx"]["Last week at Atlantic Coca-Cola Bottling Company in Cass Co., we discussed rolling back burdensome regulations &amp; tax reform. #99CountyTour https://t.co/6XUxE43hxD"]["Thanks to 3M in Marion Co for sharing their perspective on the challenges employers in rural Iowa face last week. #99CountyTour https://t.co/Ycn626YZn0"]["Wishing a very happy birthday to my fellow Midwesterner and friend, @vp!"]["Today, we honor the sacrifices and remember the courage of our servicemembers and allies on #DDay73 https://t.co/CL9S7nezZj"]["Planning a trip to Washington? My office can help schedule tours of the U.S. Capitol and more: https://t.co/9gaOuWbsId https://t.co/8FgUIlLxuw"]["Today, we pause &amp; remember those who gave their lives for our freedom. My full #MemorialDay column in @wcfcourier: https://t.co/4nJVwEIYYD https://t.co/BWWbMdXzJc"]["It was an honor to greet and thank Iowa’s veterans with the Eastern Iowa Honor Flight when they arrived in D.C. earlier this week. https://t.co/tCDDy1RwNI"]["Read more about my legislation to thwart military sexual assault in @theHill: https://t.co/AiEMl7t6v3 @SenGillibrand"]["Today I introduced the E-STOP Act with @SenGillibrand to thwart military sexual assault through in-person training: https://t.co/YpZ3IBuRG4"]["It’s an extraordinary day for Iowa &amp; our nation! Congratulations to Ambassador @TerryBranstad &amp; IA Gov @KimReynoldsIA. https://t.co/q0rsEndvjL"]["Our thoughts and prayers are with the victims and their families in Manchester following this horrific act of terrorism."]["TUNE IN: Senator Ernst will speak in support of IA Gov @TerryBranstad on the Senate Floor at ~4pm CT/5pm ET. Watch: https://t.co/uyczlNQunT"]["May is Motorcycle Safety Awareness Month. Head over to my @Snapchat for more: joni_ernst https://t.co/A3aHN7cgO5"]["Recently, I had the opportunity to visit Eagle Grove Pharmacy in Wright Co. on my #99CountyTour https://t.co/YgYCLPAJAB"]["Thank you the men &amp; women of our Armed Forces for responding to the call of duty. RT to thank our servicesmembers on this #ArmedServicesDay https://t.co/QEuqw1MT2q"]["A few weeks back, I toured Hampton's historic Main Street &amp; met with many of Franklin Co's small business owners on my #99CountyTour. https://t.co/QRsvu7ts2K"]["It is with great pride that I support Rachel Brand of Pella, Iowa to serve as U.S. Associate Attorney General: https://t.co/x59Og4Fc2t"]["Today I reintroduced the Credit for Caring Act to assist Iowa family caregivers w @SenBennetCO @SenCapito @SenWarren https://t.co/hsj4s1TebG https://t.co/YNAp9KYTz8"]["So thankful to hear! https://t.co/HBZtqQwzF3"]["Prayers for my friend @SenThomTillis. Wishing him well."]["Prayers and well-wishes for a speedy recovery to my friend @maziehirono as she undergoes treatment."]["If you’re an Iowan visiting DC, stop by my constituent coffee tomorrow! https://t.co/8TeqtP9o7E https://t.co/Rc9UhS0yrS"]["To our law enforcement community &amp; their families on #NationalPoliceWeek, thank you for your service &amp; sacrifice. RT to show your gratitude. https://t.co/cwpWQXazLd"]["Happy #MothersDay to my incredible mom, and to all the moms across our great state and country! https://t.co/LDUfRnkpdC"]["Last month, I joined the Iowa Corn Growers Association in Marshall County for their annual conservation tour. #99CountyTour https://t.co/1vAncL6ilP"]["An inspiring visit to Hope Wellness in Dallas County. I met with folks who have completed treatment &amp; are now giving back. #99CountyTour https://t.co/h8yigvUJ59"]["My town meeting in Guthrie Co. was a great opportunity to hear from Iowans about the issues they're most concerned about. #99CountyTour https://t.co/9BgMExOBG5"]["Enjoyed discussing issues important to IA business &amp; industry at the Harrison County 50th Annual Economic Development Meeting #99CountyTour https://t.co/VkN0SqYO4b"]["Heard from folks in Fremont Co. about continued levee issues following 2011 floods &amp; their ideas for potential solutions. #99CountyTour https://t.co/E4nkE4MSgd"]["In Mills Co, I participated in a round table discussion with farmers. Their input is critically important for next Farm Bill. #99CountyTour https://t.co/LRPLCuhisk"]["Last month, I spent time visiting with and taking questions from the students and faculty of Bedford High School in Taylor Co. #99CountyTour https://t.co/OzW8vNCszS"]["Enjoyed visiting @Boonevalleybrew in Boone Co. to discuss regulations &amp; hear about their experience growing a small business. #99CountyTour https://t.co/l84VJbac8U"]["Spoke with employees &amp; leaders of Syngenta Seeds in Greene Co. to hear trade concerns &amp; take questions on the 2018 Farm Bill #99CountyTour https://t.co/IZYr89JNOJ"]["At Caring Hands Closet in Calhoun Co, I heard about their work &amp; the community's support for families in need. #99CountyTour https://t.co/OUMyu2Lhb0"]["Thank you to everyone who participated in my Wall Lake Town Meeting in Sac Co. last month. I appreciated hearing from you all. #99CountyTour https://t.co/osFJqG2UZp"]["I toured @TempletonRye in Carroll Co. to learn more about their new facility &amp; their investment in the Templeton community. #99CountyTour https://t.co/A39ILnvx0F"]["Visited Denison Job Corps in Crawford Co last month to hear students' success stories &amp; learn about their training programs. #99CountyTour https://t.co/pejRthMxYm"]["Thank you to all of Iowa's teachers who are committed to shaping the next generation of leaders. Happy #NationalTeacherAppreciationDay! https://t.co/9IVilkb6vf"]["Proud to introduce bipartisan legislation with @SenGillibrand to examine women-owned small business opportunities: https://t.co/jO9pWwkoHG"]["Glad to have you in Iowa today, @SecretarySonny! https://t.co/gUmsmO7l9h"]["Happy #SoilandWaterConservationWeek! Growing up on a family farm taught me the value of conserving our land &amp; water for future generations."]["Today we take time to reflect and pray on this #NationalDayofPrayer. https://t.co/AxMbVSMWuI"]["Enjoyed catching up with Charlie Stone of @kscj1360 in DC today. https://t.co/fTZOeAtPA3"]["It was an honor to introduce my friend &amp; Iowa Governor @TerryBranstad at his confirmation hearing today. https://t.co/K4gS2TEsM5"]["From the feedlot to main street, small business makes up 97% of businesses in Iowa. Grateful for all our entrepreneurs. #SmallBusinessWeek https://t.co/cVLIWUlURV"]["Small businesses are the backbone of our communities. This #SmallBusinessWeek, let's celebrate their contributions to our state &amp; nation. https://t.co/qPwzNP8xY1"]["Pleased that @SecretarySonny was confirmed to lead the @usda. Read more @KMANews1: https://t.co/7ijRLiiRRt"]["Read more about my efforts to ease regulatory barriers that make Rx drug take back a significant challenge: https://t.co/TBYyI0BJ7z https://t.co/3g5VyynTHZ"]["Today is #NationalPrescriptionDrugTakeBackDay. Find where to dispose of unused meds &amp; help combat Rx drug abuse: https://t.co/VCWA3giyoy"]["Read more about my bipartisan bill to expand telehealth for veterans, the VETS Act, in @MilitaryTimes: https://t.co/s0DZxe0f0n"]["Visited ACCESS in Story Co, where I volunteered as a student, to hear their latest efforts to combat domestic &amp; sexual abuse. #99CountyTour https://t.co/LkL7AnJ4yF"]["Enjoyed making new friends at Mosaic in Allamakee Co. &amp; learning more about the support they provide for Iowans. #99CountyTour https://t.co/JuEZj5SxOR"]["I enjoyed visiting Cartegraph in Dubuque Co to learn more about the technology &amp; products being created in Iowa #99CountyTour https://t.co/ws1jdrdsKE"]["Had the chance to learn about the education &amp; vocation programs at the State Training School for Boys in Hardin Co. #99CountyTour https://t.co/dlNS65wGq7"]["Thanks to CUNA Mutual Group in Bremer Co for sharing their insights &amp; priorities for the credit union community #99CountyTour https://t.co/84opX55Q6F"]["This month, I met w/the Upper Explorerland Regional Planning Commission in Winneshiek Co to hear abt their efforts in NE Iowa. #99CountyTour https://t.co/BmCLfehsT9"]["Enjoyed speaking with local business and civic leaders at the Waterloo Rotary in Black Hawk County. #99CountyTour https://t.co/7GtwMYXS2i"]["At the Grundy County Memorial Hospital, I heard about the challenges they face as a rural hospital. #99CountyTour https://t.co/ksYwMx8CtN"]["Enjoyed speaking at the annual Howard Co. Business &amp; Tourism Banquet, celebrating their commitment to our communities &amp; state #99CountyTour https://t.co/9krNgOE6mB"]["Honored to present 97 year old veteran, Stauffer Johnson, with medals to recognize his selfless service to our nation in World War II. https://t.co/MAoGMm8SBE"]["Thank you to everyone who attended my Clayton Co. town meeting to discuss the issues our state and country are facing. #99CountyTour https://t.co/SStc2i5wXy"]["It was a privilege to join the Eastern Iowa Honor Flight today to express my deepest gratitude to our WWII, Korea and Vietnam Veterans. https://t.co/hpBU94D55r"]["My VETS Act works to provide Iowa's rural or disabled veterans with access to quality &amp; timely care via telehealth: https://t.co/xuHMHteDDS"]["This is the start of a memorial that will honor our servicemembers, veterans, &amp; families of the fallen https://t.co/ZtKv5eXMq9 (2/2) https://t.co/MgxEYbgfba"]["Proud to introduce legislation w/ @Sen_JoeManchin to authorize the construction of the Global War on Terrorism Memorial (1/2)"]["Always a pleasure to visit small businesses committed to supporting veterans, like Pries Enterprises in Buchanan Co, on my #99CountyTour https://t.co/dBjG39nuAR"]["We must #NeverForget the horrific events of the Holocaust and the senseless murder of millions of Jewish people. #HolocaustRemembranceDay"]["Please join me in saying #CongratsPeggy! https://t.co/P5XyNqZmKd (2/2) https://t.co/PKeCOiHGdX"]["If you couldn't make it to Senator Ernst's town meeting in Sac County today, you can watch it live on Facebook: https://t.co/mNIxUkIuza"]["Wishing you and yours a blessed Easter Sunday. https://t.co/lKaCXzkK2D"]["There must be zero tolerance for sexual assault, including in our gyms. Read more here: https://t.co/S0uJDjvNaO #SexualAssaultAwarenessMonth"]["Our legislation to restore states' abilities to identify the best eligible Title X providers is law: https://t.co/IOHfLaTvc9 @RepDianeBlack https://t.co/JobZuHP2KX"]["#TBT: In March I joined my colleagues to call for passage of legislation to protect our athletes from sexual abuse https://t.co/1A4hwvl1uI https://t.co/P1EEV4J4ku"]["Couldn't make it to Senator Ernst's town meeting in Clayton County? Watch it live here: https://t.co/KTIiYOoaMm #99CountyTour"]["Our prayers are with the victims &amp; families impacted by the horrific #PalmSunday terror attack in #Egypt."]["Thrilled that a bipartisan majority voted to confirm Judge Gorsuch to serve on our nation’s highest court https://t.co/YxBu86A2BK"]["My statement on the missile strike against Syria: https://t.co/boU5hdVB4I"]["Today, I joined my colleagues in reintroducing bipartisan legislation to combat sexual assault on college campuses: https://t.co/BAct0fMBur https://t.co/sTLEeffBNK"]["The Fair Chance Act represents second chances &amp; opportunity. Proud to reintroduce this bipartisan legislation today. https://t.co/pMyaaT2Cjk"]["Please join me in congratulating @AstroPeggy on these remarkable accomplishments! (4/4)"]["Dr. Whitson will also be promoted to commander of ISS – becoming the only woman to hold that title twice. (3/4)"]["…for cumulative spacewalk time by a woman – which was more than 53 hours of time on space walks! (2/4) https://t.co/KWnUnDxw63"]["Great to talk with @AstroPeggy all the way from the @Space_Station to congratulate her on setting the record for… (1/4)"]["April is Sexual Assault Awareness Month &amp; on my @Snapchat, I'm discussing how we must change the culture of sexual assault in our society. https://t.co/BKHvAERlbq"]["Talk about a long distance call! I'm talking w/IA Astronaut Peggy Whitson who is currently on the @Space_Station. https://t.co/xvENC9PzQm"][".@SenGaryPeters &amp; I are chatting about the launch of our new Motorcycle Caucus in the Senate on my @snapchat. Follow along at joni_ernst. https://t.co/XzR2iJ0RRc"]["Thrilled to join @SenGaryPeters in launching the first-ever bipartisan Motorcycle Caucus in the U.S. Senate. https://t.co/o7VZo2lGaZ https://t.co/6rUHocgMzC"]["If you haven’t yet, read my column on why the Emerging Threats and Capabilities Subcommittee matters to Iowa: https://t.co/e8U9cKBcoF"]["We discussed unchecked regulations &amp; my Prove It Act at this week's @smallbizcmte hearing. https://t.co/YgJOJLuS5m"]["I applaud @SenateAgGOP cmte's decision to favorably confirm Gov. Perdue &amp; move forward with his confirmation process https://t.co/XcObbDrGrA"]["I appreciated hearing from everyone that attended my Polk County town meeting. #99CountyTour https://t.co/8pPZmlxnYr"]["At the confirmation hearing for USAF Secretary, I questioned nominee Heather Wilson on cost-savings &amp; innovation: https://t.co/w1lxEjNbfg"]["Why does the Emerging Threats and Capabilities Subcommittee matter to Iowa? Read more here: https://t.co/PlS7mX1nC3"]["…and restored funding decisions for Title X providers to the states. https://t.co/xW3PvmAPFB (2/2)"]["Today the Senate overturned an 11th-hour rule issued by the Obama administration… (1/2)"]["At today's @EPWGOP hearing, I pressed the Army Corps on Cedar Rapids flood mitigation funding: https://t.co/JTN9QEf3UU"]["Moving the point of obligation is latest misguided ploy to undermine RFS. Read our @thehill column cc @SenDuckworth https://t.co/zN1mkQtNWT"]["Today I chaired my first Emerging Threats &amp; Capabilities Subcmte hearing to examine Russian “grey-zone” operations: https://t.co/ZUWbtrr3JP"]["HAPPENING NOW: Chairing my first open hearing for @SASCMajority Emerging Threats &amp; Capabilities Subcmte. Watch live&gt; https://t.co/mjDNc5Kr1C"]["I joined my colleagues in calling for the passage of our bipartisan bill to protect U.S. athletes from sexual abuse: https://t.co/y1077c8lzv"]["Tune in: Tomorrow I'll be chairing my first open hearing for @SASCMajority Emerging Threats &amp; Capabilities Subcmte. https://t.co/N8uK6GJ1PP"]["Thank you to everyone who attended my town meeting in Linn County. #99CountyTour https://t.co/sOs8aJaXNe"]["Good mtg about outstanding flood mitigation projects in Iowa w OMB Director Mick Mulvaney @ChuckGrassley @RepRodBlum https://t.co/bcg09aY2MJ"]["Enjoyed hearing from middle &amp; high school students at East Union Community School District in Union Co. #99CountyTour https://t.co/enQXywxZh8"]["We discussed scrapping outdated regulations and supporting small businesses last week at Albia Brewing Company in Monroe Co. #99CountyTour https://t.co/c28ChvxRpM"]["I toured Osceola Foods in Clarke County last week, and we discussed their commitment to rural development. #99CountyTour https://t.co/e8iuPlXJy0"]["Saddened by today's terror attack in London. Let us remember the lives lost (1/2)"]["Last week, I heard from employees at Freedom Racing in Decatur County about the obstacles they face as a small business. #99CountyTour https://t.co/dyD6M0uc8J"]["VIDEO: Judge Gorsuch is a well-respected #SCOTUS nominee who the Senate previously confirmed with unanimous support. https://t.co/MlG0kRiDrJ"]["I enjoyed catching up with Iowans at my constituent coffee this morning. Be sure to let us know if you'll be in DC! https://t.co/8TeqtP9o7E https://t.co/U82Icjny0Q"]["Read my column w/ @JerryMoran &amp; @RepMcCaul on our Agriculture Students EARN Act that encourages our future farmers: https://t.co/Vl1oA4Fx9f"]["Happy #NationalAgDay! Join me in celebrating the important ag contributions our great state makes each &amp; every day: https://t.co/RqIN8Y51jJ"]["It was a pleasure speaking with and hearing from students and faculty at Mount Ayr High School in Ringgold County last week #99CountyTour https://t.co/7BR2u35Zye"]["Enjoyed visiting with Iowans in Washington D.C. last week at our spring break reception! cc @ChuckGrassley https://t.co/lsqlUrQr0M"]["Welcome home from Afghanistan Iowa National Guard soldiers of the 185th CSSB Warhawks! https://t.co/dZWwPylvXK"]["Couldn't attend Senator Ernst's town meeting in Polk County? Watch it live on Facebook: https://t.co/Vm1B3D1z5o"]["Couldn't make it to Senator Ernst's town meeting in Linn County? Watch it here: https://t.co/Oofyg8e91z"]["Today's traveling office hours in Wright, Hancock, Winnebago &amp; Worth co. will also be rescheduled due to weather: https://t.co/t5XDqO3IAs"]["Due to inclement weather, today's traveling office hours in Emmet, Palo Alto &amp; Pocahontas co. will be rescheduled: https://t.co/t5XDqO3IAs"]["Enjoyed learning more about the pumps made at Carver Pump in Muscatine Co that provide support for our Navy's ships last month #99CountyTour https://t.co/ZfutM3AafT"]["At the Wallace Foundation annual meeting in Pottawattamie Co, I spoke ab opportunities for revitalizing our rural communities. #99CountyTour https://t.co/hMRvnMWvB4"]["Great to tour the Oskaloosa National Guard Armory last month in Mahaska Co. #99CountyTour https://t.co/Cli0bAD5db"]["At CNH in Des Moines Co., I had the opportunity to take a tour of the plant and visit with staff. #99countytour https://t.co/jKRkGnOmux"]["Thanks to our interns for all their hard work! To learn more about our internships, visit: https://t.co/WzVIZMm4jG https://t.co/VBL9uG3aKK"]["Enjoyed visiting Tyson Foods in Louisa Co, where we discussed increasing trade opportunities &amp; cutting regulations. #99CountyTour https://t.co/wr9Tq2PORv"]["Heading to President Trump's first address to a Joint Session of Congress with Senator @ChuckGrassley! https://t.co/3nbkhHTsHv"]["Today's action is a significant step forward toward rolling back the burdensome WOTUS rule. Read my full statement: https://t.co/IGzQtFJQGo"]["Thanks to everyone who came out to my veterans roundtable discussion in Jackson County last week. #99CountyTour https://t.co/ARoQAXE85G"]["Enjoyed visiting with folks at Flint Hills Resources Ethanol Plant in Ida Co. #99CountyTour https://t.co/ZEIEbJKb6Y"]["At American Coating &amp; Welding in Monona County, we talked about overcoming regulatory challenges. #99CountyTour https://t.co/lyYR8eaDle"]["Inspired by our veterans' healing through art &amp; thankful for the support provided by New Century Art Guild in Audubon Co. #99CountyTour https://t.co/v7Eybj1PVD"]["At Gateway ImpACT Coalition in Clinton Co, we talked about opioid abuse, prevention &amp; treatment in the community &amp; across Iowa #99CountyTour https://t.co/Pep8BxkvA6"]["It was a privilege to tour Gilda's Club in Scott Co &amp; visit with the brave Iowans battling cancer &amp; their loved ones. #99CountyTour https://t.co/s3V0p0F0pU"]["Happy Independence Day #Kosovo!"]["Thinking of visiting DC for spring break? Learn how my office can assist in planning your trip: https://t.co/8TeqtORMJ4"]["Sign up for my e-newsletter to stay up to date on what I'm working on in Iowa &amp; DC: https://t.co/5RlVQBvRTr"]["Mr Pruitt answered 1200+ questions from this cmte - over 1k more answers than the incoming noms from the last 4 administrations #Delayocrats"]["...but there comes a point when vetting has been turned into obstruction and that is what we are witnessing here today. (2/2) #Delayocrats"]["Vetting nominees is an important role and one that I take seriously as do my colleagues... (1/2) #Delayocrats"]["Democrats were ‘glaringly’ absent at today’s EPW committee meeting. #Delayocrats https://t.co/NLVBQ9SgLj"]["Read my statement on Judge Neil Gorsuch's nomination to the Supreme Court of the United States: https://t.co/v0iicx1VRp https://t.co/jHwbt9AJqe"]["Today marks one year since Iowans lost Sarah Root. Today, let us remember and honor her life. https://t.co/8Z2ZXYR9Tl"]["Pleased the Senate has confirmed Elaine Chao as Secretary of the Department of Transportation: https://t.co/EigaLIXv16 https://t.co/AKYU0ckXjO"]["I’ll be speaking soon at today’s #MarchforLife2017. Click the link to watch it live: https://t.co/xkk1FSKtPx"]["Pleased Senate confirmed @RepMikePompeo to be Director of @CIA. Read my full statement: https://t.co/c15UJEDnGO"]["Pleased the Senate has confirmed Gen. Kelly to be Secretary of DHS &amp; Gen. Mattis to be Secretary of Defense. https://t.co/BgmlcXMR1R"]["Great to attend the inauguration with 2 of my friends, @SenThomTillis &amp; @sendavidperdue. Such an energetic crowd! https://t.co/hcj4BfWFkE"]["Congratulations to @POTUS and @VP https://t.co/KPSHupr7tL"]["during his confirmation hearing to be our next for Secretary of Defense. Watch our exchange here: https://t.co/sp6qZUtPrv (4/4)"]["I was also glad last week to hear General Mattis say he would work with me to address our military's outdated weapon systems... (3/4)"]["I am pleased to see the Army finally selected a new handgun for our soldiers: https://t.co/0lw98WFMzS (2/4)"]["After over 30 years with the M9 &amp; countless issues with the Modular Handgun System acquisition program to replace it... (1/4)"]["Check out how we celebrate #NationalPopcornDay in my office by adding me on @Snapchat https://t.co/P0ddUNfQez"]["I am pleased to join @SASCMajority in giving my support to General Mattis to be Secretary of Defense."]["I am honored to serve as the Chairman of the @SASCMajority Subcommittee on Emerging Threats &amp; Capabilities: https://t.co/XYp1swOtoO"]["Encouraged to hear US Supreme Court will take up jurisdiction issue surrounding the WOTUS rule. This is good news for farmers, manufacturers https://t.co/4BNIDWWeMZ"]["Proud to join @SenatorFischer in introducing a resolution expressing the need to scrap the harmful WOTUS rule today: https://t.co/FnQuqhXfqK"]["I’m talking about my Allowing Greater Access to Safe and Effective Contraception Act on @Snapchat today. Add me to learn more. https://t.co/8834dUkm9k"]["Today @SenCoryGardner &amp; I introduced the Allowing Greater Access to Safe &amp; Effective Contraception Act: https://t.co/pSjpkpNrAl https://t.co/AmmrrHulhA"]["Be sure to add me on @Snapchat to get a behind the scenes look at my work on behalf of Iowans https://t.co/TESQaZKZdx"]["Today I met with the Secretary of the Army nominee, Vincent Viola. Read more about it here: https://t.co/eEBeRbhxvb https://t.co/rE1xE9K919"]["On Saturday I kicked off my #99CountyTour with a town meeting in my home county of Montgomery. Thanks to all who joined. https://t.co/k3CcQ1UVdL"]["Thankful to have spent time with the students of Clarinda Academy in Page Co &amp; to share my 4 pillars of success with them. #99CountyTour https://t.co/T6CHgqdN7k"]["Have you added me on @Snapchat yet? Be sure to watch my story from yesterday’s #99CountyTour kickoff before it disappears! https://t.co/Umyxt9sk4H"]["I’m kicking off my 2017 #99CountyTour today. Be sure to add me on @Snapchat to follow along with me https://t.co/J7E8DGYKmf"]["I am heartbroken over the news of the shooting at the Fort Lauderdale airport. My prayers are with the victims and their families. #FLL"]["Yesterday, I reintroduced Sarah's Law so that families like the Roots can receive justice. Read more in @OWHnews: https://t.co/FV4xNnyDQC"]["I’m excited to head out on my 2017 #99CountyTour tomorrow. Follow along by adding me on @Snapchat https://t.co/lFDSsX9m27"]["Pleased the House passed a resolution condemning anti-Israel UN action. Proud to have introduced bill in Senate to show we #StandwithIsrael"]["I greatly appreciate the time Scott Pruitt, nominee to be EPA Administrator, took to visit with me today https://t.co/XNwVGFTpl5 https://t.co/oibTAIGPNF"]["I enjoyed meeting with Small Business Administration nominee Linda McMahon today https://t.co/7GVug2p1V7 https://t.co/tkPQZljsk7"]["Today I reintroduced Sarah's Law as my first bill in the 115th Congress w/ @ChuckGrassley @SenatorFischer @SenSasse: https://t.co/I1IYo1d0FD https://t.co/WAk90VBpOk"]["Had a productive meeting with Secretary of Homeland Security nominee Gen. John Kelly https://t.co/KtFNrvRSPl https://t.co/beXDECaeKC"]["Great to meet with Sec. of Defense nominee Gen. Mattis today https://t.co/D0hcjwppVU https://t.co/MDMbuW65xQ"]["Congrats to my friend @ChuckGrassley, Iowa's commonsense voice in the United States Senate, who was sworn in today! https://t.co/sEZK6ZkOLJ"]["Wishing you a happy and healthy new year! https://t.co/JZhH4yMekm"]["Today we celebrate 170 wonderful years of statehood. Happy Birthday, Iowa! https://t.co/HSwnoVfXUO"]["From my family to yours, we wish you a Merry Christmas and Happy Holidays! https://t.co/2R86bNSDc5"]["This legislation will help uphold our commitment to provide quality &amp; timely care for our veterans (3/3)"]["Veterans shouldn't have long waits for VA appointments, &amp; this bill modernizes processes by allowing vets to schedule &amp; confirm online (2/3)"]["The Faster Care for Veterans Act, which I worked on with @amyklobuchar was signed into law: https://t.co/VUFDlRsD8Q (1/3)"]["Today, our DC staff cheered on 5 year old #SuperKaheem as he helped save the day at the @uscapitol! #KaheemSavesDC https://t.co/2S65BziLTh"]["This bill has the potential to save billions of $ that could otherwise have been wasted on large govt prgms https://t.co/n3WLLtd1oN  (2/3)"]["Thrilled that my bipartisan Program Management Improvement and Accountability Act I intro'd with @SenatorHeitkamp was signed into law (1/3)"]["Congrats to these Iowa students nominated to be considered for an appointment at a US Service Academy: https://t.co/c5JWbsCfMY"]["Happy 380th Birthday, @USNationalGuard! https://t.co/K3odlx7HdL"]["Joined @Varneyco to discuss ISIS, @transition2017, @TerryBranstad &amp; @KimReynoldsIA https://t.co/KBzMS9mKiT"]["Thrilled for @TerryBranstad &amp; @KimReynoldsIA! https://t.co/japosTrAdQ https://t.co/5CnlFAOXnE"]["My day got 1775% better after @USMC Corporal Chesty stopped by. https://t.co/wMf1jV0UmG"]["I am thankful to have served alongside @KellyAyotte in the United States Senate &amp; incredibly thankful to call her my friend. (2/2)"][".@KellyAyotte has tirelessly served the people of NH with passion &amp; dedication, and has supported those serving in our armed forces. (1/2)"]["At the Parliamentary Intelligence Security Forum, I emphasized the need for US &amp; allies to partner so we can defeat ISIS across the globe. https://t.co/sVNG51x3yO"]["75 years have passed since the attack on Pearl Harbor. We will never forget the sacrifices &amp; heroic acts of our servicemembers on that day. https://t.co/N5gYfxEWkC"]["Our veterans should be able to easily schedule their own appointments w/ the VA. We will keep working to make that a possibility. 2/2"]["The House version of our Faster Care for Veterans Act passed the House today!  CC @amyklobuchar 1/2"]["At @SASCMajority hearing, I spoke with Ret. Gen. Keane on ISIS spreading in SE Asia. We need a strategy to defeat it https://t.co/zIjH1M1uK9"]["My regional directors are in Audubon, Shelby, Grundy, Harrison, Tama &amp; Benton today to assist you: https://t.co/5j0d4h53VX https://t.co/NZ0h1rI81G"]["Been a great &amp; productive 2 years with my freshman colleagues. I look forward to keeping the momentum going in 2017. https://t.co/q1pC4jDgBe"]["Proud my legislation w/ @clairecmc to further curb sexual assault in the military has been included in NDAA https://t.co/M8rD9rvqsX"]["My Program Management Accountability &amp; Improvement Act marks my 6th bill to head to the President's desk. Read more: https://t.co/JWHL1CBQ0n"]["Great to join my friend @SteveDaines in sending holiday cards to our troops serving overseas @RedCross #HolidaysforHeroes event! https://t.co/yWYok1t1Zf"]["We must make sure our first responders have the best training and equipment possible to better protect them as well as our communities.(4/4)"]["The findings and recommendations would then be reported to Congress so we can act. (3/4)"]["response plans and overall strategies used by our first responders when they are faced with railroad hazardous materials incidents. (2/4)"]["Glad our bipartisan bill, RESPONSE Act, passed the House which would establish a council to evaluate the current training methods, (1/4)"]["Read my column in TIME about the need for a comprehensive strategy to combat ISIS in the Philippines here: https://t.co/hTdSW2PE6P (2/2)"]["News of a bomb near the US Embassy in Philippines is alarming. I continue my call for @POTUS to focus on spread of ISIS in SE Asia (1/2)"]["So thankful to have visited the 211th Aviation Battalion &amp; the 185th Combat Support Sustainment Battalion of Iowa in Afghanistan. https://t.co/AyqHuzvgLj"]["From my family to yours, Happy Thanksgiving! https://t.co/FVB4FYxvNy"]["Read my statement on the EPA’s release of RFS volume requirements for 2017: https://t.co/WxepwH0jP4"]["November is National Family Caregivers Month. Read my column in @gazettedotcom thanking Iowa's family caregivers: https://t.co/IH70bg2Lgg https://t.co/NYt3EoXJcQ"]["Tater &amp; Tot of Iowa have a lot to be thankful for this year: they are being pardoned by the President tomorrow for #TurkeyPardon2016 https://t.co/kiWGJO66S6"]["Today I completed my 2nd annual #99CountyTour. Watch the journey: https://t.co/ROv5ORJNRz"]["Just wrapped up a town meeting in Cherokee County. Great way to complete this year’s #99CountyTour! https://t.co/Y9fWjleL1u"]["Discussed the need to improve our IT capabilities for rural areas at a roundtable at Pocahontas County Farm Service Agency #99CountyTour https://t.co/XTjDbwLLoJ"]["Thousands of kids across the country are searching for a forever family. Join me in spreading the joys of adoption on #NatlAdoptionDay. https://t.co/bbFDWGBIbL"][".@SenPatRoberts @SenDanSullivan @USMC Those are nice ties, but I think they'd be even better if they were in Army gold and black!"]["... let us remember to lend a helping hand to all those struggling in our communities. (2/2)"]["It’s National Hunger and Homelessness Awareness Week. As colder weather and the holiday season approaches... (1/2)"]["Today, I'm wearing purple to raise awareness for World Pancreatic Cancer Day &amp; in support of all those battling this devastating disease. https://t.co/UCRA4GsKNI"]["Whether it's help with Medicaid enrollment or the VA, stop by and learn the many ways my office can serve you. (2/2) https://t.co/5j0d4gNsxn https://t.co/jR0gtbpfCe"]["Today my staff will be in 16 counties to take your questions &amp; provide assistance with the federal gov... (1/2) https://t.co/5j0d4h53VX https://t.co/5T2AMYIAlI"]["to the health care services they need by promoting the use of telemedicine and fighting to protect our community hospitals. (2/2)"]["Today is National Rural Health Day. I’m working to ensure that Iowans living in rural and underserved areas have access...(1/2)"]["being held over the next few weeks. For dates and locations near you, visit my website: https://t.co/5j0d4h53VX (2/2) https://t.co/BgkzE4G3L9"]["My staff is able to assist with Medicare Open Enrollment, which ends December 7th, at all of the traveling office hours... (1/2) https://t.co/KCwhvSvsH0"]["Tickets to the Presidential Inauguration are limited &amp; will be awarded on 1st-come, 1st-serve basis. More info here: https://t.co/ly2nFlCJUh https://t.co/WsxIvhbAmf"]["We cannot ignore where ISIS will spread next. Read my column in @CNNOpinion: https://t.co/bJnLxZva8Y"]["No presumption, but I hit a deer last night @ChuckGrassley. What do you think its odds are?"]["The President must make the growth of extremism in Latin America a priority during his visit to Peru: https://t.co/nVvxoLC1RF"]["On Veterans Day I had the pleasure of attending the Van Horne Legion Veterans Day Ceremony &amp; Memorial Dedication to thank all who served. https://t.co/CUrs9HRUqP"]["… to speak with a member of my staff and learn about the many ways my office can better serve you. https://t.co/5j0d4h53VX (2/2) https://t.co/S9kIgIJCoA"]["Need assistance with the VA, IRS, or more? My office is here to help. Stop by one of these many locations today… (1/2) https://t.co/mNrjbDbvpR"]["In October I made over a dozen stops across the state to speak with folks in the ag industry. Here's what I heard: https://t.co/D63e7XolIH"]["Today I wrote President Obama urging him to address w/ leaders the spread of ISIS in Latin America while in Peru: https://t.co/s1isi5Juv7"]["Team Ernst is headed to you! Today's traveling office hours &amp; upcoming dates/locations can be found here: https://t.co/5j0d4h53VX https://t.co/lVarMoW559"]["by an enemy torpedo on this day in 1942. They, and all Iowans who gave their lives for our freedom, are true heroes. (3/3)"]["the attack on Pearl Harbor, and they tragically all lost their lives at the battle for Guadalcanal after the USS Juneau was struck... (2/3)"]["Read my column in @qctimes on fighting for those who faithfully served. #VeteransDay https://t.co/ZIwNJKoHlc"]["Join me in recognizing our Iowa heroes who have bravely served &amp; all veterans across our great country. #VeteransDay https://t.co/wDQ7KXF3FU"]["Happy 241st Birthday @USMC! #SemperFi https://t.co/ekR4vlEitf"]["For ticket info on the 58th Presidential Inauguration, click here: https://t.co/ly2nFlCJUh https://t.co/Hr1f6BucX0"]["Congratulations to Neil Steinhagen of Clinton, IA on being named commander of the @USSILLINOIS, the @USNavy's newest attack submarine. https://t.co/0vXeri9FYJ"]["My thoughts and prayers are with the two Iowa police officers killed in line of duty: https://t.co/oCi471Ixap https://t.co/SaSnCMxl5p"]["Had a great discussion with Fehr Family Farm, their neighbors &amp; local ag stakeholders in Palo Alto County last week. #99CountyTour https://t.co/bepK8tGT5q"]["Had the opportunity to tour the Network Operations Center at Winnebago Cooperative Telecom Association in Lake Mills last week #99CountyTour https://t.co/QpsviK3QQS"]["Thanks for the warm welcome, Skoglund Meat &amp; Locker! Enjoyed learning more about Kossuth County's fine local meat production. #99CountyTour https://t.co/QeGL5bPwRf"]["Visited Winnebago Industries in Hancock County where we discussed regulatory burdens and the need for skilled labor. #99CountyTour https://t.co/GMjZyjUZMS"]["ICYMI: @MilitaryTimes highlighted my push to counter the rise of ISIS in Southeast Asia. Read it here: https://t.co/eypXWSSrdh"]["My DC and Iowa offices are accepting applications for spring internships until Dec 1st. More info can be found here: https://t.co/WzVIZMDFbe"]["Congrats to the historic 10 female soldiers who graduated from @FortBenning's Army Infantry Officer Basic Leadership Course yesterday."]["My staff will be traveling to all 99 counties to hold office hours. Click here to find a location near you: https://t.co/5j0d4gNsxn"]["Years ago, President Obama promised health insurance premiums would go down under ObamaCare. They haven’t. https://t.co/sFKstYUFjt"]["Next year's double digit premium increases prove the Affordable Care Act is anything but affordable: https://t.co/sFKstYUFjt"]["My heart is full after visiting Mission of Hope in Cedar Rapids yesterday. Grateful also to Iowa’s passionate &amp; dedicated volunteers. https://t.co/RUcFUUTGRd"]["At Rembrandt Foods in Dickinson County, I met with employees, toured the facility, &amp; tried out their new egg protein products. #99CountyTour https://t.co/WvkvwfLC3n"]["… &amp; returning unused prescription meds responsibly. Find a drop off site near you by clicking here: https://t.co/D6S9lCmtPy. (2/2)"]["Our prayers are with the 467th Firefighting HQ DET as they prepare for deployment overseas https://t.co/3QMUej9SMx"]["It was wonderful to visit one of IA’s family businesses, Brown Fertilizer, in Clay County on my #99CountyTour. Thanks for having me! https://t.co/1T091BheiG"]["Visited Iowa Lakes Community College in Emmet Co. on my #99CountyTour &amp; heard about the work they're doing in wind energy education https://t.co/k6PAbitwrw"]["Great questions and ideas from the students at Northwood-Kensett High School! #99CountyTour https://t.co/6ucuGmAHqe"]["Chatted w/ folks at the Spencer Daily Reporter's \"Coffee with the Editor\" about ways to help folks out of poverty in Iowa &amp; the US. https://t.co/mF5FF677mU"]["My staff will be holding traveling office hours in all 99 counties to help Iowans in their dealings w/ the fed govt https://t.co/8oYF0MvrS4"]["Happy to see Army Sustainment Command NCO of the year, and Davenport resident, SGT Henrique Magalhaes honored at the @Cubs game Sunday!"]["Enjoyed learning more about the innovative research happening at Borlaug Learning Center's NE Research Farm in Floyd County. #99CountyTour https://t.co/AtdOiocs8m"]["TriMark in Chickasaw County produces hardware for agriculture, truck &amp; recreational vehicles. Thanks for showing me around. #99CountyTour https://t.co/zcgePZykdT"]["Had the chance to check out Heartland Cooperative's solar array and facility while in Mitchell County. #99CountyTour https://t.co/nWQPmZxWn2"]["In Winneshiek County, I learned more about the craft brewing process in Iowa at Toppling Goliath Brewery Company. #99CountyTour https://t.co/dvcK2t432Z"]["We must counter the alarming rise of ISIS in Southeast Asia. Read more about my efforts in @MilitaryTimes: https://t.co/3B15l8D0aD"]["Always enjoy hearing from the folks in Howard County. Thanks to all who attended my town meeting. #99CountyTour https://t.co/ev6L4wkgtf"]["My Federal Information Systems Safeguards Act will provide agencies w/ the tools necessary to reduce the risk: https://t.co/ab6qGzl1yU (2/2)"]["Cyber hacks occur at an alarming rate &amp; preparation is key to preventing the next attack. (1/2) #NationalCyberSecurityAwarenessMonth"]["Thank you to the volunteers in Council Bluffs who packed their millionth cookie for our troops overseas! https://t.co/77HPSl7mcQ"]["Great to see the progress made at Iowa Fertilizer Company in Lee County. #99CountyTour https://t.co/vgoXhvm5xA"]["Thanks to those who attended my town meeting in Van Buren County on Tuesday. Your feedback helps me to better serve you. #99CountyTour https://t.co/nnabHvPel3"]["Happy Birthday @USNavy! https://t.co/c8Na8vx2J1"]["My DC and Iowa offices are currently accepting applications for spring internships. More info can be found here: https://t.co/TEXRw38a98"]["I enjoyed the opportunity to hear from folks in Cerro Gordo County at last week's town meeting. Thanks to all who attended. #99CountyTour https://t.co/oFiJK6Df93"]["It was great to meet with local entrepreneurs &amp; small biz owners in Fayette County last week. #99CountyTour https://t.co/HPEiLYeSeO"]["Today @ChuckGrassley &amp; I pressed the Army Corps again on the flawed policy for prioritizing flood control projects: https://t.co/EPCs2FAgef"]["Join me in wishing a Happy #NationalManufacturingDay to all of our hardworking IA manufacturers who help to keep our state running! https://t.co/p7tlJh1EqD"]["Shared our stories and took questions from the bright students of Van Meter School with @RepDavidYoung today. https://t.co/iSjpLoeEW9"]["Enjoyed talking about the ag economy w/ folks at the Creston Livestock Auction yesterday #JoniAgTour https://t.co/Ie7t1GpjYI"]["Great crowd at yesterday's Cattle Growers Roundtable in Atlantic. Thanks to all who attended &amp; shared your feedback. #JoniAgTour https://t.co/6hmFV4P3D2"]["It was an honor and a privilege to present Mr. Kurt Paeper, a Vietnam veteran, with two purple hearts in Humboldt on Tuesday. https://t.co/B2G47xfo0m"]["Enjoyed visiting family owned Lewright Meats &amp; Deli in Wright Co &amp; getting to visit w/ the store's owner, employees &amp; patrons. #99CountyTour https://t.co/5bh2xsh7yv"]["In Humboldt Co, I spoke w/ local officials, small businesses &amp; leaders about how regulations impact business &amp; the community #99CountyTour https://t.co/r7kBFvJH5n"]["Having grown up on a farm in Southwest Iowa, it warmed my heart to visit a family owned &amp; operated farm in Lyon Co #99CountyTour #JoniAgTour https://t.co/zeIZ2ob1EW"]["Taxes, ObamaCare costs, &amp; regulations were a few of the topics we covered at Latham Hi-Tech Seeds in Franklin Co. #99CountyTour #JoniAgTour https://t.co/oywzNGkFpb"]["In Sioux County yesterday, I toured Hull Co-Op &amp; discussed burdensome federal regulations' effect on ag industry. #99CountyTour #JoniAgTour https://t.co/0O67emy92P"]["Enjoyed discussing agricultural education &amp; our future farmers at Noteboom Implement in Osceola County. #99CountyTour #JoniAgTour https://t.co/fElQCBStX1"]["Yesterday I visited Ag Processing, Inc in Sheldon to discuss the challenges they are facing. #99CountyTour #JoniAgTour https://t.co/vjaHhCU8x9"]["Ernst on U.S./ASEAN Meeting: Good Step, But Must Do More to Defeat ISIS in Asia: https://t.co/oePRmIlKbX"]["October is #NationalPorkMonth! Join me in thanking our pork producers for helping feed America. https://t.co/vbe1FPtzps"]["After touring the Hy-Vee Distribution Center in Lucas Co, I had the opportunity to visit with employees &amp; hear their thoughts. #99CountyTour https://t.co/WMoM1c8Lby"]["affected by the August floods: Allamakee, Chickasaw, Clayton, Fayette, Floyd, Howard, Mitchell, &amp; Winnesheik. https://t.co/cbhDslDBXv (2/2)"]["I'm pleased the President fulfilled the State of Iowa's request for federal disaster relief for the 8 counties... (1/2)"]["VIDEO: We must continue pushing to make Cedar Rapids' flood mitigation project a priority. https://t.co/N0b83QtumR #Flood2016"]["Great to catch up with Iowans at this morning's constituent coffee. If you're visiting DC, make sure to stop by: https://t.co/8TeqtP9o7E https://t.co/9u6Ve61WPp"]["Early morning snap with the birthday Senator &amp; some fellow freshmen. Happy Birthday Senator Bill Cassidy! https://t.co/jeEm0gKwIi"]["Thankful for the service of these Cedar Valley veterans. It was my privilege to greet them at today's Honor Flight in D.C. https://t.co/HYsL2hm7nq"]["Today, @ChuckGrassley &amp; I sent a letter to the Army Corps demanding answers on Cedar Rapids Flood Projects. Read: https://t.co/qZOUL6mEvh"]["Praying for the safety of those affected by the #IowaFlooding. For assistance info &amp; resources, please click here: https://t.co/69PbeNzyO9"]["adequate oversight and sufficient planning. This is unacceptable. https://t.co/l5323VQPOZ (2/2)"]["The VA OIG report confirms that the process through which the VA chose to award Health Net billions of dollars lacks accountability…(1/2)"]["Click and share these resources and information regarding the #IowaFlooding in eastern Iowa: https://t.co/69PbeNhXWB"]["On #GoldStarMothersDay, join me in thanking &amp; honoring our nation's mothers who sacrificed so much for our freedoms. https://t.co/VZrN31L9pl"]["Please click and share this link for flooding resources in Eastern Iowa: https://t.co/69PbeNzyO9"]["For those in need of assistance, please click the link for a list of resources: https://t.co/ulOcl7Lkbo (2/2)"]["It is critical that amid the flooding, Iowans remain vigilant and exercise caution around standing water. (1/2) https://t.co/ulOcl7Lkbo"]["Last night’s House passage marked an important step toward making government more cost-effective and efficient. https://t.co/GdkGap82RT https://t.co/SstFVknlHz"]["As I told @gazettedotcom, we need a global and comprehensive approach to defeating ISIS. Read: https://t.co/c7LObRNQgQ"]["Started my day off with a 3.75 mile ruck-run with members of my staff. https://t.co/jB4x4MXPKe"]["Yesterday I joined my colleagues in pushing for sexual assault awareness &amp; reform on college campuses. Watch: https://t.co/NyyQGr0J6l"]["#SenateOpportunityCoalition is a new initiative aiming to ensure every family has access to the American Dream. https://t.co/4Gl51WvQXe"][".@SenatorTimScott @SenatorLankford @SenRubioPress @SenDanSullivan &amp; I launched the #SenateOpportunityCoalition: https://t.co/4Gl51WvQXe"]["Enjoyed visiting with Iowans at yesterday's constituent coffee. Thanks to all who stopped by. https://t.co/9bNN7LXduK"]["It was a privilege to attend the Cedar Rapids Post Office renaming to honor SFC Terryl Pasker: https://t.co/N6bi0Y4gxB"]["VIDEO: @ChuckGrassley &amp; I toured the Iowa City VA to discuss the VA's system, policies, &amp; procedures: https://t.co/ZbZPqwkMmX"]["Read my statement on the recent attacks in Minnesota, New Jersey, and New York: https://t.co/Lb1aZCdbVw"]["September is #SuicidePreventionMonth. Read my @gazettedotcom column about raising awareness, particularly among vets https://t.co/zMym82WNkR"]["This month’s Squeal Award goes to… Presidential Perks. https://t.co/1eIu5yxVxR"]["Happy 69th Birthday @usairforce! https://t.co/DRpT0ACJB5"]["Joined fellow veterans @SenTomCotton &amp; @SenDanSullivan to honor #ConstitutionDay2016.  https://t.co/gYUX4siT1E https://t.co/YUIRrULnZ9"]["Happy Birthday to a great Iowan, a strong partner in the Senate, and my dear friend: @ChuckGrassley! https://t.co/fUyamCDMhO"]["To our nation's POW/MIA, their families &amp; friends: You are not forgotten. #NationalPOWMIARecognitionDay https://t.co/I07gnQycn6"]["...to reauthorize the leasing authority at arsenals. Read more here: https://t.co/xVo3VmAqFO (2/2)"]["Today I introduced a bill with @ChuckGrassley, @SenatorDurbin, @SenatorKirk &amp; @SenGillibrand... (1/2)"]["Also glad my provision requiring GAO to study the Corps method for evaluating flood mitigation projects was included https://t.co/nfkSYIIFcG"]["Included in today's WRDA bill was my work to push for the completion of the Cedar Rapids flood control project: https://t.co/nfkSYIIFcG"]["Had a great start to my day visiting with Iowans at my constituent coffee https://t.co/J4y3dSxfKU"]["TUNE IN: I'll be speaking on the Senate floor about the growing threat of ISIS in Asia @ ~10:30am CT. Watch live: https://t.co/jo83BmRJg8"]["ICYMI on @action3news: @SenGillibrand &amp; I sent a letter pressing FBI to track domestic violence, stalking crimes: https://t.co/NqSLjcWvP3"]["Enjoyed welcoming about 100 Iowa veterans to Washington during today's Cedar Valley Honor Flight. https://t.co/7BGXQeKh4v"]["The FBI currently doesn't collect data on stalking &amp; only has limited data on domestic violence. That must change. https://t.co/nepHa7Wgmt"]["I joined @SenGillibrand in sending a letter to the FBI urging them to collect data on stalking &amp; domestic violence https://t.co/nepHa7Wgmt"]["I joined @WHORadio to discuss the rise of ISIS in Asia &amp; the lack of US leadership in the world. Listen here: https://t.co/F6mS840HVy"][".@SenatorCarper &amp; I reflected on this tragic day &amp; how our nation united w/ such resolve in the face of evil. Watch: https://t.co/4eaB1hQ4JA"]["America will never forget those who were lost &amp; our prayers are with their loved ones who continue to feel the deepest pain of their absence"]["Today is the 15th anniversary of the terror attacks on our nation on September 11th, 2001 &amp; is a somber reminder of the lives lost."]["My thoughts on North Korea's 5th nuclear test: https://t.co/PDacHJ6Pjt"]["VIDEO: @SenatorCarper &amp; I reflected on September 11th: https://t.co/4eaB1hQ4JA #NeverForget"]["The @uscapitol rotunda has reopened! Learn how my office can assist in arranging tours: https://t.co/8TeqtP9o7E https://t.co/AtqHDHXJ0s"]["@lostnorwegian Tom in our Davenport can do an official inquiry with USPS on your behalf. Give us a call (563) 322-0677."]["Enjoyed speaking with Sac Co farmers &amp; officials about collaborative approaches to water quality. #99CountyTour https://t.co/hDHQWZpRsK"]["Discussed ethanol production &amp; importance of a strong RFS @ Quad Co Cellulosic Ethanol Plant in Ida Co #99CountyTour https://t.co/i08c2k4b1y"]["Talked about burdensome fed regulations &amp; the state of the farm economy at @LandusCoop in Calhoun Co. #99CountyTour https://t.co/wD9yE1WPrp"]["Thank you! https://t.co/TAvo8nAiMQ"]["that he should address on the rise of ISIS: https://t.co/rz8qWJdxg1 (7/7)"]["in the region this weekend. Ahead of his meeting with the president of the Philippines, I highlighted critical questions (6/7)"]["our homeland - President Obama must make this one of his top priorities for discussion as he meets with world leaders (5/7)"]["and show U.S. strength. As Islamic extremists groups in Asia unite beneath the flag of ISIS – an enemy who threatens (4/7)"]["of the need for a global strategy against ISIS. The U.S. must address global strategy shortfalls, show leadership, (2/7)"]["The terrorist attack yesterday in the southern Philippines that left 14 dead and over 70 wounded is a somber reminder (1/7)"]["We must do more to help those who sacrificed so much for our freedoms. Join me in raising awareness this #SuicidePreventionMonth. (3/3)"]["Each day, ~20 veterans tragically commit suicide. Female veterans commit suicide at 6 times the rate of non-military females... (2/3)"]["Today marks the beginning of #SuicidePreventionMonth. Suicide among veterans is a crisis that is more pressing now than ever before... (1/3)"]["Today I sent a letter to President Obama urging him to focus on solutions to counter the rise of ISIS in Asia. https://t.co/sHgWRGZXDk"]["Discussed water quality with @DucksUnlimited at the Storm Lake conservation site yesterday. #99CountyTour https://t.co/CYNrMLaEWu"]["Had a chance to visit with local veterans before yesterday's town meeting in Ida Grove. https://t.co/KkLQKv1ArO"]["Enjoyed hearing more about the latest and greatest in agriculture at this year's Farm Progress Show in Boone. https://t.co/jSPT1HY1FF"]["Great crowd at yesterday's Pottawattamie County Veterans Roundtable. Thanks to all who attended &amp; shared your ideas. https://t.co/zn6YI52ZRC"]["Blown away by the wind energy production at New Harvest Wind Farm in Crawford County. #99CountyTour https://t.co/8AyefUejD2"]["Pleased the Pentagon has ordered a review of the wasteful Ford aircraft carrier (one of my squeal award recipients): https://t.co/baXN8PmdSq"]["Grateful to the United States Marine Corps Reserve for 100 years of service and sacrifice to our great nation. #USMCR100"]["Yesterday I enjoyed learning more about the good work Mid-Sioux Opportunity does in Plymouth County. #99CountyTour https://t.co/ArE3hXoNyU"]["The U.S. can’t ignore ISIS in Asia. Read my column in @TIME on combatting the expansion of terrorism: https://t.co/cfBieQXqVH"]["Enjoyed visiting with entrepreneurs at yesterday's tour of Colab in Jefferson County. #99CountyTour https://t.co/aiJXpEJbFP"]["Great discussion at yesterday's Veterans Roundtable in Ottumwa. Thank you to all who attended &amp; shared your feedback https://t.co/Ur23daASgh"]["Thank you to Keith's Grocery in Davis County for showing me around &amp; helping to feed our community. #99CountyTour https://t.co/JJXbpdSqji"]["Great discussion on the available opportunities for our veterans in ag &amp; entrepreneurship at @IowaStateU yesterday. https://t.co/WM2UwRIRiZ"]["Ernst Statement on U.S. Payment of $400 Million to Iran Contingent upon Americans’ Release https://t.co/coytmKh4tD"]["Yesterday I got the 'scoop' on the locally produced dairy at WW Homestead Dairy in Allamakee County. #99CountyTour https://t.co/GPP4bbwSdp"]["Thank you to all those who joined the discussion at my Cedar Falls veterans roundtable. https://t.co/E9mOb7CY4Y"]["Enjoyed learning about the important role waterways play in IA commerce @ Lock &amp; Dam 10 in Guttenberg #99CountyTour https://t.co/ApN7ELt3Ke"]["Had the opportunity to tour XL Specialized Trailers in Delaware County on my #99CountyTour https://t.co/GSZphj2myy"]["It was an honor to march in the @IowaStateFair Veterans’ Day Parade today! https://t.co/OKCzEfRiTv"]["Great catching up with old friends and new at the @IowaStateFair today. https://t.co/aIKIFpOqKx"]["RT and join me in wishing Iowans competing in the #Rio2016 Olympics good luck! https://t.co/AfOiJ9mNCk"]["Ernst, Senators Press VA for Answers on Iowa Veteran’s Death https://t.co/o12cYARS4u"]["Ernst Statement on U.S. Payment of $400 Million to Iran: https://t.co/0L9rrYvkqs"]["Enjoyed visiting Valley of the Moon Commercial Poults in Clarke County today! #99CountyTour https://t.co/Ggx3KSNEVd"]["Today I called on VA Sec McDonald to prioritize our veterans' care over art work: https://t.co/HiAKatXmZ0"]["Thanks to @CapCityFruit in Warren County for the tour and for talking w/ me about your business. #99CountyTour https://t.co/T9eBLUa8WG"]["Great talk in Grinnell at the Pow I-80 economic roundtable on ways to help help rural communities grow #99CountyTour https://t.co/PHByndJrOl"]["(2/2) ... Marion, Plymouth, Warren, and Woodbury County to take your questions! https://t.co/ZZJ2K7qGp0"]["(1/2) My staff is holding traveling office hours in Black Hawk, Buchanan, Delaware, Des Moines, Louisa, Mahaska... https://t.co/jHwxAt5w43"]["Only a few days left to apply for a fall internship in our D.C. &amp; state offices! Deadline is August 1st → https://t.co/WzVIZMm4jG"]["Proud of the students from #Iowa Ambassadors of Music for their tribute to the service &amp; sacrifice of this WWII vet. https://t.co/XgpwrjkjrW"]["(4/4)... and Keokuk, Wapello, and Washington County! Stop by any location and learn how we can serve you! https://t.co/uiy6yURWBr"]["(2/4) ... O'Brien and Osceola County... https://t.co/C9kaTcLwhR"]["(1/4) Today my staff is holding traveling office hours in Cedar, Iowa, Johnson, Powesheik... https://t.co/gXcxUCYGHc"]["My staff is holding traveling office hrs in Buena Vista, Cherokee, Clayton, Fayette, Henry &amp; Jefferson County today https://t.co/wC4ABhPQEg"]["My staff is holding traveling office hours in Clay &amp; Dickinson County today to take your questions! https://t.co/WWDVmdcLEt"]["(5/5) I hope President Obama will reconsider and work with us to protect taxpayers’ hard-earned dollars."]["(4/5) The Presidential Allowance Modernization Act would have cut many of these unnecessary and costly presidential perks."]["(3/5) ... hardworking Americans are also expected to foot the bill for their personal staff, office expenses, and much more."]["(2/5) I am so disappointed that at a time when past presidents receive well-compensated book deals and speaking fees..."]["ICYMI: (1/5) Last week, @POTUS vetoed the bipartisan Presidential Allowance Modernization Act. https://t.co/64BdWa1XOw"]["My staff is holding traveling office hours in Boone, Greene, Polk, &amp; Story County today to take your questions! https://t.co/OTyMhhqwO5"]["My staff is holding traveling office hours in Davis, Lee, &amp; Van Buren County today to take your questions! https://t.co/FBzq4vpvpS"]["My staff is holding traveling office hours in Audubon, Cass, Mils &amp; Montgomery County today to take your questions! https://t.co/c1HvCYCSa3"]["(2/2) ... &amp; has grown to be an energetic 4 year old. We are so proud of you! https://t.co/JfeabYZbXJ"]["(1/2) Happy 4th birthday to my friend &amp; fellow Iowan, Micah! He was born prematurely at approx 5 months... https://t.co/JfeabYZbXJ"]["(2/2) ... Pocahontas, Pottawattamie, Scott and Winnesheik County today to take your questions! https://t.co/AMnILMJkK9"]["(1/2) My staff is holding traveling office hours in Allamakee, Clinton, Emmet, Howard, Muscatine, Palo Alto... https://t.co/Ea73rhJRZ9"]["(2/2) ... We stand with our ally as they work to make sense of such unnecessary and senseless violence."]["(1/2) My heart goes out to the victims and people of Munich and across Germany..."]["Thank you, Hillphoenix Specialty Products in Centerville, for showing me your facility yesterday. #99CountyTour https://t.co/PSgivVkFik"]["(2/2)...Madison, &amp; Sioux County today to take your questions! https://t.co/cs4lNtbT4m"]["(1/2) My staff is holding traveling office hours in Adair, Bremer, Butler, Chickasaw, Dallas, Guthrie, Lyon... https://t.co/inAadgLdVD"]["My staff is holding traveling office hours in Ida &amp; Monona County today to take your questions! https://t.co/YtwCGEP9Hr"]["My staff is holding traveling office hours in Clark, Decatur, Ringgold &amp; Union County today to take your questions! https://t.co/onfOSGtXWd"]["My staff is holding traveling office hours in Adams, Fremont, Page &amp; Taylor County today to take your questions! https://t.co/6tPsz8k8Xj"]["I enjoyed talking about Iowa's ag priorities with my friends at the Henry County @FarmBureau Saturday #99CountyTour https://t.co/AzRiJJ8k1c"]["Thanks to US Gypsum in Des Moines County for showing me around your plant on Saturday! #99CountyTour https://t.co/q8CUpihKkt"]["For each month's #SquealAward, news, and announcements, sign up for my e-newsletter on my website: https://t.co/bfQkyupaHP"]["ICYMI: July’s #SquealAward: $86 million for an unused aircraft. Read more here: https://t.co/lpD941uVxs"]["My prayers are with France and the victims of this horrific terrorist attack. Read my full statement below. https://t.co/FX3RwwQ3Px"]["Don’t forget! Reps from my office begin traveling office hours on Monday. Learn when/where here→ https://t.co/1baNC859CB"]["I am so grateful for Tim’s service to our country. https://t.co/xECYK5DFnM (2/2)"][".@SenatorTimScott is a calming and caring leader, not only for law enforcement but for communities across SC and the nation. (1/2)"]["Fall internship applications for my D.C. &amp; state offices are due August 1st! Learn about joining #TeamErnst here→ https://t.co/WzVIZMDFbe"]["To all the Iowans who served our nation, my office is here to serve you. Click here for resources/info for veterans: https://t.co/FM03uUgTKA"]["Planning a trip to Washington, D.C.? My staff can help arrange tours to the @uscapitol, @WhiteHouse &amp; more! Info → https://t.co/8TeqtORMJ4"]["ICYMI: Female Veterans Suicide Prevention Act was signed into law. We must help those who bravely served our nation https://t.co/EQdhktOcss"]["From Allamakee to Fremont County, reps from my office are stopping in all 99 in July to serve you. Learn more→ https://t.co/1baNC859CB"]["ICYMI Female Vets Suicide Prevention Act is now law. Proud this initiative is now a reality → https://t.co/EQdhktOcss"]["Our Suicide Prevention Act was signed into law. We must help those who bravely served our nation https://t.co/EQdhktOcss"]["Watch @KCCINews on our legislation #SarahsLaw: https://t.co/UEdrWFppso"]["We lift up the victims, injured, law enforcement community &amp; their loved ones in prayer following the tragic acts of violence in Dallas."]["You can read more about the Female Veterans Suicide Prevention Act here → https://t.co/EQdhktwBAU"]["The Female Vets Suicide Prevention Act requires the VA to identify the most effective programs in reducing suicide rates among female vets."]["Female vets commit suicide at 6x the rate as nonmilitary females. We must do more to help those who sacrificed so much for our freedoms."]["Glad that my bipartisan legislation, the Female Veterans Suicide Prevention Act, was signed into law last week."]["This Independence Day, let's thank and honor our servicemembers &amp; veterans who have fought to preserve our freedom https://t.co/7P6lrsvegr"]["#SarahsLaw brings us one step closer to restoring justice. Thankful to @ChuckGrassley, @SenatorFischer &amp; @SenSasse for introducing it w/ me"]["Under #SarahsLaw, Sarah's killer would have been detained by ICE &amp; held accountable for his actions. https://t.co/2u7s1iprE9"]["How convoluted has our immigration system become that someone who came here illegally &amp; killed a citizen is not an enforcement priority?"]["Under #SarahsLaw a person who entered the US illegally &amp; caused serious harm or death to a citizen would be detained https://t.co/2u7s1iprE9"]["#SarahsLaw would require ICE to take custody of an illegal immigrant charged w/ a crime resulting in death or serious bodily injury"]["Under current ICE policy, Sarah's killer was not detained and is now at-large. https://t.co/2u7s1iprE9"][".@ChuckGrassley, @SenatorFischer, @SenSasse, and I introduced Sarah’s Law: https://t.co/2u7s1i7QMB"]["My staff will hold traveling office hours around #Iowa in July to assist you in your dealings w/ federal agencies: https://t.co/8oYF0MvrS4"][".@dailyiowegian: Ernst legislation to cut former presidential perks passes Senate https://t.co/gI6sPIgUON"]["This morning, I spoke w/ @KHQA about solutions to fix VA wait times &amp; prevent veteran suicides. Watch it here → https://t.co/CFRf5Yj0rV"]["Check out this piece from @OttumwaCourier on how my Female Veterans Suicide Prevention Act would help those w/ PTSD https://t.co/dTHvP3ZUcL"]["Discussed the need to have a national GMO labeling standard w/ members from the @farmbureau Young Farmer Program https://t.co/1qkA26RE46"]["I'm disappointed my colleagues stood in the way of passing #Zika &amp; veterans funding today. Read my full statement ↓ https://t.co/yG3RS6KRZo"]["Thanks to the folks who came to my veterans roundtable in Sioux City last week!  https://t.co/jbFkZNxj5C"]["ISIS is present in all 50 states. Click the link to read my latest newsletter: https://t.co/zTUzczMXci"]["Spoke w/ folks at @MCEDPG in Monona Co. about what we need to do to help our small businesses thrive #99CountyTour https://t.co/jmAr2ocT06"]["Important discussion at my Sioux City vets roundtable on the need to improve care for our men &amp; women #99CountyTour https://t.co/ZAX9oyyVPy"][".@ChuckGrassley and I had a great time greeting the next generation of ag leaders w/ @iowaffa in DC today https://t.co/6N9IEGJsM6"]["I support an effective solution to prevent terrorists from obtaining a gun w/out violating constitutional rights https://t.co/kaVqNop3eL"]["When we’re $19 trillion in debt, taxpayers shouldn’t be forced to foot the bill for perks of former presidents https://t.co/2YidlSkEJV (2/2)"]["Glad the Senate passed our Presidential Allowance Modernization Act w/ @SenRubioPress and @SenatorKirk https://t.co/2YidlSkEJV (1/2)"]["The VA has engaged in more than enough waste and abuse to earn this month's Squeal Award: https://t.co/lYbdXItFvm"]["It was great to see the Carroll Chamber in DC today https://t.co/WItqccBkVB"]["Thanks to all of the Iowans in DC who joined me for my constituent coffee this morning https://t.co/R7xys5K57S"]["On Friday I’m hosting a veterans roundtable in Sioux City. I hope you can join me. Details here: https://t.co/oMrQEMUfIS"]["The horrific attack in Orlando made clear that we must do more to defeat terrorism here at home &amp; around the globe. https://t.co/kaVqNop3eL"]["To learn more about our internship opportunities, click here: https://t.co/I01nlEZxuj (2/2)"]["Enjoyed visiting with our awesome summer interns. Thanks for all of your hard work! (1/2) https://t.co/Kj10H0UC3C"]["Had a great meeting with the Iowa Falls Chamber in DC today https://t.co/n8XQ9Pl3gk"][".@scj: Joni Ernst to hold roundtable with veterans in Sioux City https://t.co/NINFjRfdPi"]["I voted to prevent terrorists from obtaining weapons &amp; renewed my call for greater efforts to defeat &amp; destroy ISIS https://t.co/YXkNHCZ8Ol"]["It was nice to see the @AmesChamber in DC today https://t.co/n0N0kh40Cp"]["Enjoyed seeing so many young Iowans in DC today w/ @iowa4h, @IowaYouthTour, &amp; @NationalHistory participants https://t.co/HIjlhfCsdx"]["It was wonderful to visit with all of the Iowans who came to my constituent coffee this morning https://t.co/Fe1TW6nLeX"]["Had a great time visiting with West Lyon High School FFA students with @ChuckGrassley today https://t.co/0gbZm2yUwy"]["Pleased that the Senate today passed the bipartisan National Defense Authorization Act https://t.co/TAm5qL05xh"]["The Orlando tragedy underscores that we must do more in our fight to defeat terrorism here @ home &amp; across the globe https://t.co/U4HBbkXd1J"]["Our prayers are with the lives lost, those injured, and their loved ones in this senseless act of violence in Orlando."]["I spoke on the Senate floor about my amendments to #NDAA. Watch: https://t.co/iDP1eEqVp3"]["Today @ChuckGrassley and I visited with students from Clarksville High School https://t.co/r4G9fH8tCH"]["It was an honor to meet with @ConcernedVets. Thank you for all of the work you do for our vets. https://t.co/0TE4ojsLnY"]["Had a great time welcoming our future leaders in ag from North Central @iowa4H with @ChuckGrassley today! https://t.co/BCDoF81TQw"]["Grateful that the Senate passed the Female Veterans Suicide Prevention Act I introduced w/ @SenatorBoxer, @SenBlumenthal &amp; @SenSherrodBrown"]["It was great to meet with Iowa manufacturers today https://t.co/11TYqHAN5K"]["My DC &amp; state offices are accepting fall internship applications for IA college students. Learn more &amp; apply here: https://t.co/WzVIZMm4jG"]["So proud of @ISUCFVMB, performing in France for 72nd #DDay anniversary to honor the sacrifices of our brave soldiers:https://t.co/1V1Ilsf8Ux"]["Join me in congratulating our IA students who received offers of appointment to service academies! https://t.co/bMdZxbrboL"]["Our office can help arrange tours of the Capitol &amp; other attractions in DC for Iowans who are visiting. Learn more: https://t.co/8TeqtP9o7E"]["I've already completed over half of my 2016 #99CountyTour so far! Follow along here: https://t.co/ARUcrUqEAk"]["June is #NationalDairyMonth! https://t.co/R02BO76Nla"]["Let’s remember and give thanks to all of our men and women who have given their lives so we can be free. #MemorialDay"]["Thinking of our fallen heroes &amp; their families this #MemorialDay weekend. We will never forget your sacrifices for our nation."]["May the WASP rest in peace at Arlington National Cemetery https://t.co/gObABPzwOF"]["I’m honored to give the Weekly Republican Address. Take a look: https://t.co/rAHB9RzCkc"]["Do you have ideas of how to #MakeEmSqueal in Washington? Let me know here: https://t.co/5zBLnNGL5o"][".@KCRG took a look at some of the pieces of legislation I moved through the Senate this week. Watch: https://t.co/aRml8wRooi"]["Yesterday I told @marthamaccallum on @FoxNews why I'm calling for VA Secretary McDonald to resign. Watch: https://t.co/I0fbD5zYvO"]["Our legislation to name a Cedar Rapids post office after an Iowa Guardsman killed in Afghanistan passed Senate https://t.co/EQCtsH223P"]["We’re $19 trillion in debt, yet our govt is spending $100,000 to build ski jumps? https://t.co/64KtPjm7pG"]["RT if you agree VA Sec. McDonald needs to resign immediately. https://t.co/FzESuEEyzE"]["I'm joining @AmericaNewsroom on @FoxNews at 9:40 AM CT to talk about my call for the VA Sec to resign. Tune in: https://t.co/tdxCJ28PVg"]["Legislation to name a Cedar Rapids post office after an Iowa hero passed committee: https://t.co/obm11ZKgSt"]["Spoke w/ @KCRG about our legislation to restore inurnment rights of WASP @ArlingtonNatl: https://t.co/yHL8zjlxOP"]["Do you agree that our govt shouldn’t be spending $250K on a maple processing facility? See my latest Squeal Award: https://t.co/64KtPjm7pG"]["I'm calling on VA Sec. McDonald to resign immediately: https://t.co/FzESuEEyzE"]["I announced this month's recipient of my Squeal Award for wasteful spending. Find out the winner here: https://t.co/64KtPjm7pG #MakeEmSqueal"]["Last week, I had the honor of hosting a roundtable w/ vets &amp; officials in Greene County https://t.co/IPICHmJGKO"]["Learned about the things KemX Global is doing in Boone on my #99CountyTour last week https://t.co/jhzG0EQZGN"]["Absolutely appalled by Sec. McDonalds’ callous &amp; out of touch comparison of long VA wait times to lines @ Disneyland https://t.co/2QcIPJIYBw"]["VIDEO: @POTUS signed into law our legislation to restore inurnment rights of WASP @ArlingtonNatl https://t.co/udVVvz6I9s"]["TUNE-IN: Sen. Ernst to speak on Senate floor now on legislation signed into law to restore WASP inurnment rights:  https://t.co/T3iPTKMqC1"]["Talked about the health care issues facing Iowans w/ @IowaPharmacyIPA at the Guthrie Co. Hospital #99CountyTour https://t.co/7vfNfYL8VP"]["Thrilled that our WASP measure has been signed into law! @SenatorBarb @RepMcSally @RepSusanDavis https://t.co/5S5aUDAtvi"]["I’ll be back on my #99CountyTour tomorrow! Check out my visits so far this year: https://t.co/ARUcrUqEAk"]["thru providing post access to transportation &amp; ridesharing companies like Uber https://t.co/T6taBarp75 (2/2)"]["My NDAA provision would reduce drunk driving/provide opportunities for military communities (1/2)"]["Always wonderful to see @ChuckGrassley and Iowans visiting DC at my Wednesday am constituent coffee! https://t.co/sgOhxMqrXC"]["I was honored to greet the heroes from the Eastern Iowa Honor Flight to DC today. Thank you for your service! https://t.co/un9dxE938Q"]["Congrats to fellow Iowan &amp; friend Swati Dandekar on her new role as executive director w/ the Asian Development Bank https://t.co/6jYHrAjz9c"]["Progress! @GOPoversight passed my bipartisan program mgmt bill which would prevent tax $$ from being wasted due to fed govt mismanagement."][".@wcfcourier: Ernst legislation to aid WASPs goes to president https://t.co/GNs5IUz2Lt"]["Honored to see the Army Reserve Soldiers off in Sioux City on Saturday as they deployed to Kuwait &amp; Afghanistan. https://t.co/ZlZSdjPJNc"]["Learned about the dam and dry run project in Bremer County on my #99CountyTour last week https://t.co/u5gJpeC7Ux"]["Had a great time in Waterloo on my #99CountyTour visiting @TysonFoods and the TechWorks Campus https://t.co/PTw8r6hLhC"]["Appreciated the Qs &amp; ideas from all of those who came to my town meeting in Hardin County last week. #99CountyTour https://t.co/qC8duWC1Ta"]["My office can help Iowans in their dealings w/ the fed govt. Visit my website for more info: https://t.co/Zoom2YAwpF"]["Do you have ideas of government waste that you think should be cut? Email me here: https://t.co/5zBLnNGL5o #MakeEmSqueal"]["Enjoyed visiting with the @DesMoinesMetro this am! https://t.co/kqjlvnvySr"]["The House just passed our legislation to restore the inurnment rights of WASP @ArlingtonNatl! I encourage @POTUS to sign it into law ASAP."]["Thanks to all of the Iowans who joined me for coffee this morning at the DC office! https://t.co/K0eTxTnAAN"]["Thrilled the Senate passed legislation I intro’d w/ @SenatorBarb to restore inurnment rights of WASP @ArlingtonNatl https://t.co/QSbw4LErlp"]["It was great to speak with @UEPCertified as we celebrate #NationalEggMonth https://t.co/xzEUdTQe73"]["If you’re an Iowan visiting DC, I’d love to see you at my constituent coffee tomorrow. Click here for more details: https://t.co/8TeqtP9o7E"]["Was honored to take part in the sendoff for the 185th CSSB of the IA National Guard as they deploy for Afghanistan. https://t.co/FGctErzrC2"]["Got to see the awesome liftgates Tommy Gate makes on my #99CountyTour in Harrison County https://t.co/aAJJP3KboU"]["Had a wonderful time at @FrmTbleDelivery in Shelby County on my #99CountyTour https://t.co/wM4G7Qs9oy"]["Learned about the great work the Children’s Nest does in early childhood education on my #99CountyTour in Audubon https://t.co/tJ0Cu3k1Bu"]["Want to get the latest on my work in Washington on behalf of Iowans? Sign up for my newsletter here: https://t.co/5RlVQBvRTr"]["April was #SAAM; check out some of the reforms I’ve been working on to raise awareness &amp; combat this heinous crime: https://t.co/aLhEMpNcvT"]["Thanks to DAC, Inc. in Jackson County for showing me around your facility on my #99CountyTour &amp; for the work you do https://t.co/3RcV35yeaZ"]["It was great to hear from folks at my town meeting on Friday in Jones County on my #99CountyTour https://t.co/FpOSFulhGX"]["Got to see the work Cedar County’s Xerxes Manufacturing does on my #99CountyTour https://t.co/hWSawtPux6"]["@KMANews1: Ernst supports new energy reform bill https://t.co/yyFwe22Wye"]["Introduced the Military Retaliation Prevention Act to protect survivors of military sexual assault from retaliation https://t.co/8pS7N16udf"]["Check out my column in the @DMRegister: Ernst: Improve response to sexual assault in the military https://t.co/CqNJeUWIcH"]["This week, I joined a bipartisan group of Senators to demand we #passCASAct: https://t.co/9H6hC57Iup"]["Great meeting with folks from @mtownchamber and @LandOLakesInc today https://t.co/tqtO3Vk3tb"]["Wonderful way to start Wednesday: Having coffee with Iowans visiting DC! https://t.co/ICIIM7mN5C"]["Prove It Act would mitigate rules like overreaching expansion of WOTUS that threatens livelihood of many small biz https://t.co/Gf7j6sRGLy"][".@RadioIowa: Ernst and Grassley back bill designed to cut sexual assault on college campuses https://t.co/hRwRMkcXwU"]["Had good conversations with folks from Iowa Area Agencies on Aging &amp; @IACommunityBank today https://t.co/Rhv4uXw9pP"]["I’ll be joining @trenterice on @1430KASI shortly at 1:05 PM CT. Listen here: https://t.co/rE8H6KeyME"]["Getting ready to join fellow Senators &amp; survivors in urging Congress to #passCASAct. Click here to watch live: https://t.co/wrzHYmckB5"]["Are you planning a trip to DC? My office can help arrange tours for Iowans. More info here: https://t.co/8TeqtP9o7E"]["Last week the Senate passed bipartisan energy reforms to promote American energy production &amp; save $$ for consumers https://t.co/IUKcaLOxgf"]["It’s always great to see strong bipartisan support for youth involvement in programs like 4-H: https://t.co/glbcC8CFmO"]["Wonderful to honor, welcome, &amp; thank our veterans visiting with the Honor Flight of the Quad Cities organization. https://t.co/Vl3AXSvQ64"]["Welcomed @northpolkcomets students and folks from the @CityofPella Chamber of Commerce yesterday. https://t.co/n6uGR0fv6w"]["What a heartwarming story about one of Iowa’s very own! https://t.co/WXhRS16f58"]["It was great seeing Iowans in DC this morning at my constituent coffee! https://t.co/zD03bvXzud"]["Great visits w/ folks from @ChamberMC and @VisitClearLake chambers today! https://t.co/Eb1rlwST4K"]["#TaxDay is a good reminder of why we need to cut wasteful spending and #MakeEmSqueal in Washington: https://t.co/aEHgyO89uC"]["My first Squeal Award highlights wasteful govt spending: TSA Randomizer. Find out why here: https://t.co/aEHgyO89uC"]["Iowans sent me to Congress to cut wasteful spending: https://t.co/aEHgyO89uC https://t.co/9FJwIS1UfY"]["April is Sexual Assault Awareness Month; a time to speak out &amp; fight for victims of military sexual assault. #SAAM https://t.co/XkYDEixRbj"]["You won’t want to miss my newsletter this weekend! Sign-up here: https://t.co/5RlVQBvRTr"]["My staff will be at the following spots to assist you w/ problems over Medicare, vets benefits, passports &amp; more: https://t.co/5qKJjUo0ON"]["It was great to see @SiouxlndChamber and @ChamberQC today! https://t.co/JrUD56YBkR"]["Need help cutting through fed govt red tape? Ask a member of my staff at traveling office hours today: https://t.co/Vyr5SB9ohS"]["Had fun welcoming some young faces from LeMars Middle School to DC https://t.co/RdkwAUbTn0"]["Had some good meetings today with @IAcattlemen and @IowaRestaurant https://t.co/RvpLbFfOnl"]["Introduced legislation w/ @JerryMoran to promote youth involvement in programs that serve as intro to careers in ag https://t.co/jA02dEDQjW"]["It’s time to cut the pork! @GovWaste’s #PigBook2016 release https://t.co/nIXLEuh0mY"]["If you have Qs on passports, Social Security, or other issues, my staff is holding office hours in IA today to help: https://t.co/hgW0BOWMTa"]["If you’re an Iowan visiting DC, stop by my constituent coffee tomorrow! https://t.co/8TeqtP9o7E"]["Do you have Qs on Medicare, immigration issues &amp; more? My staff is traveling around IA today to help you. Details: https://t.co/ls4f8qWT87"]["We must restore the rights of Women Airforce Service Pilots to be inurned @ Arlington Natl Cemetery. RT if you agree https://t.co/PJjnyZ7bB7"]["My staff will be around IA today to answer your Qs on vets benefits, Social Security, Medicare, passports, and more: https://t.co/8jC1lXr8tp"]["Spoke w/ @KCRG about my fight for the inurnment rights of WASPs at Arlington National Cemetery https://t.co/PJjnyZ7bB7"][".@weareiowa5news took a look at my bipartisan Credit for Caring Act. Watch: https://t.co/VbWb0UJkcm"]["Watch the highlights from my @SenateAgGOP sub hearing from @KHQA: https://t.co/Xq07ujbsSM"]["Stop by if you are in the area! https://t.co/hX9oJnrjZC"]["Questions on passports, Medicare or military affairs? We are here to help. Check out where my staff will be today: https://t.co/azQEAt16Qc"]["There are 40+ mil. family caregivers in the US and 317,000+ in IA. These folks deserve recognition &amp; some relief! https://t.co/1MpkDNMDth"]["Family caregivers deserve our recognition &amp; some relief. The Credit for Caring Act helps Iowans helping other Iowans https://t.co/1MpkDNMDth"]["My bipartisan Credit for Caring Act will provide relief to the 40+ mil. family #caregivers in the US who support their loved ones. (2/2)"]["Today I introduced the Credit for Caring Act which provides a tax credit for working family caregivers (1/2) https://t.co/1MpkDNMDth"]["Have questions about Social Security, Medicare, or vets benefits? Check out where my staff will be today to help: https://t.co/PAwgbXtqEd"]["Thanks to @ALZIowa for visiting today https://t.co/C6MZuDlTlB"]["Heard from Iowans about how burdensome fed regs are impacting rural communities at @SenateAgGOP sub hearing https://t.co/lA9Gb34dKg"]["Thanks to Craig Hill from @IowaFarmBureau and Monte Shaw from @iowafuel for joining the @SenateAgGOP sub hearing today!"]["Watch my opening remarks from the @SenateAgGOP sub hearing on USDA rural development programs: https://t.co/pCcxBoQEeG"]["Getting ready to chair my @SenateAgGOP sub hearing on the impact of USDA rural development programs. https://t.co/UWC44wE0N0"]["At 8:20 AM CT, I’ll talk with @GarySadlemyer on @kfabnews. Tune-in: https://t.co/yWK43SfXcS"]["Need help w/ issues like veterans benefits, passports, or IRS? Here's where my staff will be to help answer your Qs: https://t.co/ftsfAzaGWW"]["I’ll join @DougWagner on @600WMTAM at 6:25 AM CT. Listen online here: https://t.co/rpNbk9SO6D"]["Met w/ some of our future leaders: students from Adair-Casey Community School &amp; Boy Scout Troop 418 from Forest City https://t.co/fbyFpAJuo5"]["Looking forward to chairing @SenateAgGOP sub hearing on economic impact of USDA rural development programs. Watch: https://t.co/EGOlDwKvkL"]["Are you an Iowan visiting DC this week? I host a coffee on Wednesday mornings and hope you can stop by. More info: https://t.co/7TnIqC5qEq"]["My staff is on the road in IA to help you cut through the red tape w/ the fed govt. Here's today's stops (2/2): https://t.co/8gEbzEkHau"]["My staff is on the road in IA to help you cut through the red tape w/ the fed govt. Here's today's stops (1/2): https://t.co/iOrPIEL14z"]["Protecting trade secrets is an extremely important component to helping our companies retain a competitive edge: https://t.co/Z8aqUS4ZBG"]["I’ve completed over a third of my #99CountyTour so far. Check out some of the highlights here: https://t.co/dPGyyWazkR"]["Need assistance with a federal agency? We are here to help. Stop by our traveling office hours: https://t.co/qY33i5rtXW"]["Reps from the office of Sen. Ernst are holding traveling office hours throughout IA. Here's where we'll be today. https://t.co/qFnZtvekOs"]["Grateful for the staff at @blankchildrens for the work they do. https://t.co/Li7NyfSJCX"]["Called for review of regulatory barriers Iowa pharmacies face in federal drug take back program https://t.co/iKS5n2q3zG"]["Discussed how overregulation is harming our ag industry at @AGRILANDFS in Winterset on my #99CountyTour https://t.co/Ag1nMrbfG6"]["Great to join the @WorldFoodPrize event recognizing the important achievements of women in agriculture https://t.co/wURBMvNWjX"]["On my #99CountyTour in Adel, I talked w/ @admschools students about the importance of making their voices heard https://t.co/fhgQsDSLqf"]["Spoke with @WOWT6News recently about what we need to do to defeat ISIS https://t.co/FtnSTmkLZS"][".@WOWT6News: Sen. Ernst’s first year focused on Vets https://t.co/zoIBB9jANf"][".@nonpareilonline: Ernst: U.S. needs to lead fight against ISIS https://t.co/yksYXIZNCG"]["WASPs were trailblazers and forged the way for women serving in today’s military forces. #WomensHistoryMonth https://t.co/vecgVJG2rg"]["My staff is hosting traveling office hours around IA to help in dealings with the fed govt https://t.co/8oYF0MvrS4 https://t.co/QGcYhmX9Dx"]["My office can help Iowans visiting DC arrange a tour of the Capitol building and other historic landmarks: https://t.co/8TeqtP9o7E"][".@965ksom: Iowa Senator Joni Ernst visits Atlantic Manufacturing Plant https://t.co/wADj0qRhCD"]["Des Moines Register: Roses: Ernst leads effort to honor female pilots https://t.co/B5uz7x4FuU"]["Gail and I are thinking of and praying for all of the lives lost, as well as their families and friends. (2/2)"]["Incredibly saddened to learn of the news about the crash early this morning, in which two Des Moines police officers were killed. (1/2)"]["Talked about the issues our manufacturers face on my tour of the Plastic Professionals in Cass County. #99CountyTour https://t.co/Zha63TlfJ2"]["Happy 102nd birthday to Iowa native Norman Borlaug, founder of the world food prize &amp; great ag champion https://t.co/W2YkEGmreE"]["Was able to spend time with the amazing kids and staff at @BGCM in Council Bluffs on my #99CountyTour https://t.co/t19Okksd2Q"]["Great discussion w/ folks at my town meeting in Mills County about WASP, defeating ISIS, GMOs, &amp; more. #99CountyTour https://t.co/bTHSWNdaSL"]["Fun stop at Podium Ink in Ringgold County on my #99CountyTour to see some of their work https://t.co/v3lFUu8Ckk"]["In April I'll be chairing a hearing on USDA rural development programs where we'll hear from witnesses from IA https://t.co/EGOlDx26cj"]["Talked about health issues w/ folks who joined my roundtable at the Southern Prairie YMCA in Creston  #99CountyTour https://t.co/VFAlEZaq7g"]["Visited the Henry A. Wallace Country Life Center in Adair County on my #99CountyTour @seedsofcivility https://t.co/mbDpaqb54J"]["Thrilled to see the House pass bill to reinstate WASPs right to have their ashes placed at Arlington https://t.co/iSQCtJTc6F @RepMcSally"]["We must stand united in the fight against terrorism &amp; strengthen our efforts to protect our liberties &amp; way of life. https://t.co/3idL4QxUZF"]["Thanks to the folks at Penn Drug Company in Sidney for hosting me on my #99CountyTour https://t.co/lQSfTPWbvV"]["Visited the Shenandoah VA clinic and discussed how we can improve care for our vets #99CountyTour https://t.co/HtsUNKH6ec"]["Toured the food processing plant at @MichaelFoods in Taylor County on my #99CountyTour https://t.co/9LF7C1ajLv"]["Highlights from #NationalAgWeek in my newsletter: https://t.co/dRgyn0oSUQ Sign up on my website to receive updates to your inbox!"]["Chatted with @iowafarmertoday about the issues facing agriculture in our state and country: https://t.co/8rSAAVKMOF"]["Check out my op-ed on @gazettedotcom “Engaging in the battle against opioid abuse” https://t.co/bpY9C67zwN"]["Did you know that Iowa is the number one pork producer in the country? #NationalAgWeek https://t.co/5fymAGo1rf"][".@gazettedotcom: Ernst, Grassley join effort to name Cedar Rapids post office for Eastern Iowa soldier https://t.co/bh6z37a3ix"]["Great to join a bipartisan group for our WASP press conference. Check out the coverage from @KCCInews https://t.co/kJqS34AOOF"][".@action3news took a look at my efforts to allow WWII women pilots to be inurned at Arlington National https://t.co/2fkUr43azH"][".@KMANews1: Ernst meets SHS students in DC https://t.co/kgYE8Isuhn https://t.co/oyCN5CdSkS"]["Farm business is family business. #NationalAgWeek https://t.co/GGehdkOUdK"]["Proud to join my colleagues to advocate for some incredible women who deserve to be honored: the WASPs. Watch here: https://t.co/2mwdw3Unlu"]["Check out my statement on the bipartisan Biotechnology Labeling Solutions bill: https://t.co/UBONp5J5it"]["Introduced a bill w/ @chuckgrassley to name an IA post office after SFC Terryl Pasker: https://t.co/dpfED4Sm63"]["The American people deserve a voice in the SCOTUS debate https://t.co/3zNewrsryG"]["Iowa feeds and fuels the world, producing more corn and soybeans than other state in the county #NationalAgWeek https://t.co/LZrmTmr9Cw"]["Had a blast hosting a Spring Break reception for over 200 Iowans in DC today with @ChuckGrassley https://t.co/SmesLxCf9V"]["Check out my column to celebrate #AgDay: https://t.co/2sRLJ5hNmK @IowaFarmBureau"]["Check out my post on @IndJournal: 6 Amazing Facts About Iowa Agriculture That The Rest Of The Country Should Know https://t.co/Gl772a4YRX"]["Let’s keep our focus on the next generation in agriculture https://t.co/2sRLJ5hNmK"]["Today, Iowa will produce an astonishing 20 million pounds of pork and 25 million eggs #AgDay https://t.co/atHBpu7XR1"]["It's #NationalAgWeek! As we celebrate the contributions of IA farmers, ranchers, &amp; manufacturers, follow my page to learn more about IA ag!"]["Tomorrow I’m hosting a Spring Break reception with @ChuckGrassley for Iowans visiting DC. More details here: https://t.co/9MAIFCxCJd"]["The @TelegraphHerald wrote about my bill to cut presidential perks for ex-presidents. Read more here: https://t.co/hD0DNA7Iut"]["The Office of Senator Joni Ernst will host traveling office hours across Iowa in April. Click the link for details: https://t.co/KlbqDt7A8D"][".@TelegraphHerald editorial board:  Ex-presidents who don’t need taxpayers’ help: https://t.co/hD0DNA7Iut"]["#CARA will increase drug prevention efforts and will provide treatment and recovery options for those suffering from addiction"]["I am proud to support the Comprehensive Addiction and Recovery Act, which passed the Senate with bipartisan support. https://t.co/OgC39qOVKc"]["Next week I'm hosting a reception w/ @ChuckGrassley for Iowans visiting DC on spring break: https://t.co/9MAIFCxCJd"]["Was able to visit w/ our wonderful interns this am! Check out our internship opportunities: https://t.co/I01nlEZxuj https://t.co/nbN6lrspBm"]["Enjoyed meeting with @IowaGifted and @leagueofcities members from Cedar Rapids, Bettendorf, and Des Moines. https://t.co/Vl6G1mGdp7"]