["The president's reported comments about our allies in Latin America and Africa are disgusting. They diminish America's standing in the world and should be denounced by every member of Congress."]["I've introduced legislation to provide those with temporary status from countries including Haiti and El Salvador a path to citizenship. Congress should stand up for American values and pass it! #SaveTPS"]["It was 16 years ago today that detainees arrived at the Guantanamo Bay detention facility. This prison has cost taxpayers more than $5 billion, and the propaganda value for terrorists has been even greater. It’s time to close this prison once and for all. https://t.co/TRMvQfJ1Xu"]["Californians are dealing with some of the most devastating natural disasters in our state’s history. @SenKamalaHarris and I are pushing @FCC to act on its plan to establish wireless emergency alerts. We have the technology. #EverySecondCounts https://t.co/7xRy32hNXL"]["Child sex trafficking is a scourge that is plaguing our country. We have legislation in the Senate to protect sex trafficking victims—it’s a no-brainer for Congress to act on it. #StopSexTrafficking #SESTA"]["More than 15,000 DACA recipients have already lost their protection from deportation. More lives and futures hang in the balance unless Congress acts immediately. Let’s do what is right and pass the #DreamActNow."]["RT if you stand by #Dreamers. Congress should end the games and pass the #DreamActNow!"]["#Dreamers are our neighbors, friends and classmates. They’re aspiring to be doctors, scientists and community leaders. Why wouldn’t we want them in our country’s future? Their success is America’s success. #DreamActNow"]["If the president violates the nuclear agreement, he would give Iran the ability to resume its nuclear weapons program and undermine the protesters he claims to support. The president would be foolish to create a nuclear crisis in the Middle East. https://t.co/NsciS3z6zo"]["The Trump administration is supporting Ohio's law to purge voters from the rolls. The Justice Department should NOT be working to advance widespread disenfranchisement. This move should outrage every American. #ProtectMyVote"]["Today the Supreme Court hears oral argument in a critical voting rights case. Ohio’s restrictive law would allow the state—with little or no notice—to begin the process of purging voters who missed voting in just ONE election. That's wrong. #ProtectMyVote"]["Blocking the Trump plan to expand offshore oil drilling is a top priority of mine in 2018. We don’t want to be one mistake away from environmental catastrophe. The dangers are too great!"]["My heart is with the Californians affected by the devastating mudslides in Southern California. Please heed evacuation orders and pay close attention to instructions from emergency personnel. https://t.co/rHCHQI7L5C"]["I want to welcome @SenKamalaHarris and @SenBooker to the Judiciary Committee. The committee has jurisdiction over many critical issues facing our country, from immigration to criminal justice to voting rights, and they couldn’t be better suited to tackle them."]["122 Dreamers are losing their protection from deportation every day. We need to act now! That’s why I pushed the president to support a clean bill. #DreamActNow https://t.co/KGGwExMdOP"]["The American people deserve the opportunity to see the transcript of the Judiciary Committee’s interview with Fusion GPS founder Glenn Simpson. Read it for yourself: https://t.co/yEaJLHpGdG"]["Expanding offshore oil drilling is another short-sighted, terrible idea from the Trump administration. The risks are far too high, the environmental damage would be irreversible and we don’t need the oil. Let’s make sure this never happens!"]["Seven years ago six Americans were killed and my friend Gabby Giffords’ life changed forever. She works tirelessly to stop the violence in our communities. Please join us in the fight for commonsense gun safety laws. https://t.co/XUWLdARfTa"]["Community health centers are vital for so many patients in California and throughout the country. Republicans have zero justification for letting this crucial funding expire. It’s awful! https://t.co/ax4T4L1jfV"][".@SenatorCardin, @ChrisVanHollen and I have introduced legislation to provide permanent protection from deportation to individuals with TPS. Congress must move it! #SaveTPS https://t.co/Ugd43I9spx"]["American children need Congress to act and #ExtendCHIP. We have a duty to protect the most vulnerable in society—letting #CHIP funding lapse and leaving millions of children in limbo is inexcusable. https://t.co/u1xcB6nBzI"]["SANTA BARBARA COUNTY: The upcoming rain storm may bring dangerous flooding and mudslides to the community. Conditions are especially dangerous in the aftermath of the Thomas Fire. Pay attention to evacuation orders and information from emergency personnel. https://t.co/FJarSStzB6"]["Offshore oil drilling was the culprit in the greatest oil spill in California history—1969 off the coast of Santa Barbara. Do we really want to put our coasts at risk again? I vow to do all I can to block Trump’s oil drilling plan. https://t.co/Mz4lTlTSgB"]["Must-read @latimesopinion piece: Birth control is essential health care and bosses shouldn’t be able to deny their workers coverage for basic health care. https://t.co/Qql4iojVTq"]["Point Conception and Santa Barbara County are home to some of the most pristine land in the world. I’m thrilled the hear about the effort to keep 25,000 acres unblemished for education and research. @Nature_Org https://t.co/Z49U1XvlF5"]["California has been fighting to protect our coast from offshore oil drilling for nearly 50 years. We will NOT relent! https://t.co/JbLMp9q7aM"]["The Affordable Care Act does more than just provide health coverage—it contributes to improved financial stability for American families. Payday loans decreased by 11% per month in California associated with the expansion of Medicaid. #ACAWorks https://t.co/YMSAi8FiNL"]["Thursday’s East Bay earthquake underscored the urgent need for full implementation of an early-warning system. We must be prepared for a major quake. We have the technology, let’s take advantage of it. https://t.co/lXV3zqJPfn"]["The longer Congress waits to act on #DACA, the more #Dreamers lose protection and are at risk of deportation. These are young people who have the potential of making big contributions to their communities and the U.S. economy. We must act NOW. #DreamActNow https://t.co/75VpV3b5BV"]["My office is in communication with Mr. Mora's attorney to see how we can be helpful. https://t.co/yyx9zjYObQ"]["Trump administration’s reckless “drill, baby, drill” approach threatens our oceans and coasts while doing nothing to increase energy independence. CA doesn’t want or need risky new offshore oil rigs. I’ll do all I can to oppose offshore drilling expansion. https://t.co/2M0IYITRNM"]["We must instead turn our attention to voting rights, which are under attack nationwide. Protecting the rights of all Americans to vote by enacting a new Voting Rights Act must be a top priority this Congress."]["The demise of the so-called Election Integrity Commission is long overdue. There’s never been a shred of evidence to back up the president’s outrageous claims of widespread voter fraud. This commission was a waste of taxpayer dollars. My statement: https://t.co/M3cqOkVSMO"]["Funding for the federal government expires on January 19. We must pair the Dream Act with a bill to fund the government. Every day we fail to act 122 #Dreamers lose their protection from deportation. Let’s get it done! #DreamActNow"]["The way the federal government budgets for preventing and fighting wildfires is outdated and ineffective. In the aftermath of California’s most devastating and expensive fire season, Congress can and MUST act on meaningful wildfire budget reform. https://t.co/AfxBo1yQyx"]["Former Homeland Security secretaries are calling on Congress to pass legislation for #Dreamers. Count me in. Let’s pass the #DreamActNow. https://t.co/384f5pmviA"]["I’m looking forward to working with Alabama’s newest senator, Doug Jones. He’s shown an unwavering commitment to justice for all. Welcome Doug!"]["Welcome and congratulations to Senator Tina Smith, the 22nd woman senator! The drumbeat for equality continues, and I’m proud of the progress we’ve made and continue to build on."]["The Senate returns to Washington tomorrow and we have a LOT to do. Top priorities: pass the Dream Act, ensure long-term funding for children’s health insurance, secure funding for wildfire relief and protect funds for community health centers."]["A new study suggests increasingly severe wildfires will forever alter California. The only way we can limit this trend is by battling climate change and sustaining healthy forests. We must take action now. Our future depends on it. https://t.co/0OaWcG2m58"][".@NYTOpinion published a powerful series of editorials on the connection between domestic abuse and gun violence. We should be able to come together to make it harder for abusers to get weapons. https://t.co/RkXaQBy39o"]["122 Dreamers lose their protection from deportation EVERY DAY. Passing the #DreamAct MUST be a top priority when Congress returns next week. These young people should not live in fear."]["9 MILLION children are covered by the Children's Health Insurance Program. Long-term funding stability MUST be one of our top priorities when Congress returns. Parents should not have to worry that their children could lose their health care."]["Positive train control can prevent deadly accidents similar to the recent derailment. This live-saving technology must be deployed as quickly as possible to prevent another tragedy. https://t.co/KVGbM5nsJo"]["Important op-ed explaining Tom Farr’s hostility toward protecting voting rights. I oppose Farr's nomination to the Eastern District of North Carolina. https://t.co/t6S7U6gHQR #CourtsMatter"]["Families like the Sanchez family are being torn apart by the Trump administration’s cruel enforcement policies. Important @SFChronicle reporting shows that deportation takes a terrible toll: https://t.co/TUfOzkGuo6"]["By refusing to hold a vote on the #DreamAct, Republicans are telling Dreamers they’re just not important enough. I simply can’t accept that! https://t.co/7chrC6i5Hk"]["Merry Christmas to everyone celebrating here in California and around the world. May this holiday season bring blessings to you and your loved ones."]["President Trump and the majority of Republicans claim they support Dreamers. So why did they skip town without voting on the #DreamAct? https://t.co/7chrC6zH5U"]["Banking fraud affects us all. Our bill gives state attorneys general the tools necessary to hold banks accountable, protect consumers and preserve the integrity of our financial system.\nhttps://t.co/XXjsK4oO75"]["I voted NO on the stopgap funding bill because it failed to meet many of our nation’s priorities—including protecting Dreamers. To allow these young people to continue to suffer is tragic. https://t.co/Pwq26USZ1s"]["A tax break for millionaires? You bet. No wonder the president was smiling after signing the #GOPTaxPlan. https://t.co/NJIFKrdc6g"]["Railroads have one year left to install lifesaving PTC technology on their tracks. In the wake of this week’s train derailment, the Transportation Department must make sure the industry is ready to meet the 2018 deadline. \nhttps://t.co/bysF3l7bwt"]["In response to #CitizensUnited, Senate Democrats are fighting to ensure corporations can’t hide political spending from shareholders. https://t.co/7s9viIIYMy"]["The Justice Department said it can’t regulate bump stocks, refuting the @NRA’s tactic to stall action. Republicans have run out of excuses. Congress must act now to keep these deadly weapons out of our communities. https://t.co/fIxge62z4T"]["It’s been three months since Republicans let community health center funding expire. While wasting time cutting taxes for the rich, they’ve put access to health care for the 25 million people who rely on these health centers at risk."]["If the president and Republicans truly cared about Dreamers, they’d help us pass the Dream Act bill right now!"]["Two days after wasting $1 trillion on tax cuts for the rich, Republicans now claim we have no money for children’s health insurance. I can’t imagine anything more heartless than ignoring our most vulnerable while giving more money to millionaires and billionaires."]["After wasting a year trying to repeal Obamacare and cut taxes for the rich, Republicans left no time to govern. One day before a potential government shutdown, they passed yet another short-term funding bill that ignores our nation’s priorities."]["While Republican’s are rushing home for the holidays, thousands of Dreamers are left wondering if this will be their last Christmas in the only country they’ve called home. That breaks my heart."]["I hope that Republicans will finally realize this isn’t the right way to govern. You’re not representing the country when you govern one month at a time and rush through poorly-written bills that only benefit certain special interests."]["Republicans came up with a government funding bill at the very last minute that ignores many of our highest-priority needs, including passing the Dream Act and coming up with a long-term solution for children’s health insurance."]["Sería una tragedia dejar que estos jóvenes sufran aun mas sin tener la certeza de poder quedarse en nuestro país."]["Los Dreamers han compartido sus historias conmigo y me duele el corazón que se encuentren en esta situación."]["No existe un plan realista para aprobar el Dream Act, y por eso es mi intención votar en contra de la resolución para financiar el gobierno."][".@SenKamalaHarris and I today called on President Trump to declare the Southern California wildfires a major disaster and make federal assistance available to wildfire victims. https://t.co/nw4HEZIqJD"]["It's unconscionable that Republicans are leaving the Dream Act and long-term children's health insurance funding out of their last-minute spending bill. I can’t vote for a CR without those items. https://t.co/Pwq26USZ1s"]["We have legislation requiring this type of abuse of young athletes to be reported immediately. It’s time for the House to take up and pass the bipartisan Senate bill.  https://t.co/27bfRFxBYs"]["It’s troubling to hear about the lengths USA Gymnastics went to cover up sexual abuse. Absolutely heinous actions that must never be repeated. https://t.co/9h84g2xw3R"]["UPDATE: House Republicans are voting on the #GOPTaxPlan again today because of mistakes. This is what happens when you rush to pass a bad bill!"]["Senate Republicans just gave corporations and the richest Americans an early Christmas present at the expense of middle-class families. #GOPTaxPlan https://t.co/qQySvidtlc"]["To review, the #GOPTaxPlan:\n \n     • Unfairly harms Californians by limiting state and local deductions.\n     • Raises taxes on millions of middle-class families.\n     • Balloons the federal deficit.\n \nThe Senate will vote on this bill in a matter hours. It's a disaster."]["BREAKING: The House just passed the disastrous #GOPTaxPlan. I’ll be voting NO on the bill when it comes to the Senate and I call on my colleagues to do the same. This bill is NOT tax reform. It’s tax cuts for the rich and so-called “trickle-down economics” that DOES NOT work."]["The @MercNews editorial board calls out the misleading job-creation promises in the #GOPTaxPlan. We must stop Republicans from rushing this terrible bill into law. https://t.co/kyInDE4cAv"]["The #GOPTaxBill unfairly punishes Californians by limiting the state and local tax deduction. I’m calling on my colleagues to vote against a bill that raises taxes on middle-class families in order to pay for tax cuts for the rich. https://t.co/93d5S1Pgbj"]["The Santa Rosa Press Democrat editorial board is spot on. If the #GOPTaxPlan was a good bill, Republican leaders wouldn’t try to jam it through before Christmas. Where were the congressional hearings? @NorthBayNews https://t.co/d7wFQC6ZVV"]["The @SacBeeEditBoard calls the #GOPTaxPlan a “monstrosity.” I couldn’t agree more. The bill raises taxes on many Californians and grows the federal deficit. I call on my Republican colleagues to reject this bill and start over. https://t.co/Dd5onaWB8A"]["This is one of the most heartless provisions in the #GOPTaxPlan. Victims of wildfires and other disasters will have a tougher time getting their lives back on track in order to help pay for tax cuts for the rich. So disappointing. https://t.co/r5rPUW5Yo9"]["Unless Republicans allow a vote on the Dream Act, tens of thousands of #Dreamers will lose their immigration status. These are young people who are making big contributions to America. We can’t turn our backs on the future of our country. #DreamActNow"]["Cory Iverson lost his life protecting his fellow Californians. He is a hero and will be remembered as such. Thank you to the first responders fighting wildfires throughout California and across the West. We are forever indebted to your service. https://t.co/z3C3tQGrha"]["San Francisco is the kind of city where a mayor has to be hands on. It's understanding what's going on, balancing budgets, responding to constituents, solving problems and knowing this city in every street and district. Ed Lee was that kind of mayor and he did an exemplary job."]["The #ThomasFire is now the third-largest fire in California history. My thoughts are with the courageous firefighters battling the flames and all of the families who have been affected. Follow @CALFIRE_PIO for updates.   https://t.co/DZEl5Iahcz"]["The Republican tax bill will increase health care premiums in the individual market by 10 percent each year. Individuals who make just above the limit for financial help—around $48,000 per year—will be hit hardest. #GOPTaxScam"]["The Republican tax bill caps the mortgage interest deduction at $750,000 for new mortgages. In California, seven counties have average home prices that are more than $750,000: Alameda, Marin, Orange, San Francisco, San Mateo, Santa Clara and Santa Cruz counties. #GOPTaxScam"]["The Republican tax bill caps the deduction for state and local taxes at $10,000. In 2015, more than 6 MILLION California households claimed the SALT deduction with an average deduction of $18,400. BOTTOM LINE: California families pay MORE so corporations pay LESS. #GOPTaxScam"]["It’s the height of hypocrisy for Republicans to vote for a tax cut that would add at least $1 trillion to the deficit after spending eight years railing against the national debt. #GOPTaxScam"]["I’m surprised anyone can call this a tax reform bill with a straight face. This is nothing more than a huge tax cut for big corporations and the rich, paid for by the middle class. https://t.co/vRMKOEhURm"]["Matthew Petersen, another one of President Trump’s nominees for a lifetime trial court judgeship, doesn’t know the first thing about trials.  It’s disturbing. https://t.co/0j1gj6S9vj #CourtsMatter"]["Get Covered in California! The deadline for quality @CoveredCA health care is December 22 for plans that begin on January 1. Enroll today! Explore plans here:  https://t.co/mWu8aFaru4"]["I’m heartbroken to hear that a firefighter has died battling the #ThomasFire. We’re all indebted to the first responders who keep us safe every day. Make sure to thank a firefighter today. https://t.co/9hILT3T8AM"]["DISASTER UNEMPLOYMENT ASSISTANCE: For those seeking unemployment assistance in the aftermath of the October wildfires in Northern California—the deadline to apply is December 18. This deadline does not apply to the #LAFires. More info from @CA_EDD: https://t.co/YQJRWoeERc"]["#NetNeutrality is the latest decision by the Trump administration in an effort to systematically repeal and destroy EVERYTHING we achieved over the last eight years. I’m concerned about any policy that could harm consumer access to the internet."]["RIGHT NOW: Republicans are secretly writing a bill behind closed doors that will raise taxes on millions of middle-class families. We’ll only get to see it just days before the vote. #GOPTaxPlan https://t.co/6rK2Mo4EWM"]["I ask myself over and over how Congress could take no action after 20 beautiful children were shot to death at #SandyHook. All of us should be outraged. I’ll never stop fighting for smart gun laws. I hope one day we'll succeed. #HonorWithAction https://t.co/ZWhoF9gPhj"]["Today I renew my call for Congress to pass our bills to ban bump-fire stocks, which allow semi-automatic weapons to fire like machine guns, and improve our background check system. #HonorWithAction"]["Five years after the #SandyHook shooting, Congress has done nothing to protect our communities. We must honor the memory of those 20 children and six educators by taking action, not with words. #HonorWithAction"]["Today is the fifth anniversary of the mass shooting at #SandyHook Elementary School. Twenty children and six educators were slaughtered. I keep a copy of this @NYDailyNews cover in my office because these children are why we fight for commonsense gun safety laws. #HonorWithAction https://t.co/i705szxVuo"]["VENTURA COUNTY: Local assistance centers are NOW OPEN for those affected by the devastating #ThomasFire. Officials are standing by and ready to help. More info: https://t.co/Y9dYpoMWjg"]["Brett Talley is a profoundly unqualified judicial nominee. He hasn’t tried a single case in a courtroom. He failed to submit 15,000+ of his online posts. He should NEVER have been nominated and he certainly shouldn’t be vetting future nominees. https://t.co/satb8Cub6q"]["Three cheers for Deputy AG Rosenstein for making clear (again) that he will say NO to the president if ordered to fire Special Counsel Mueller without cause."]["I heard Deputy AG Rosenstein’s testimony today. He sees no reason to fire Special Counsel Mueller and says he was the “ideal choice for this task.”  I agree."]["Climate change is wreaking havoc on the Arctic—why would we put more habitat in jeopardy and accelerate global warming? #ProtectTheArctic https://t.co/0X1zHtYgWM"]["There's an awful provision in the #GOPTaxPlan that would allow drilling in the pristine Arctic National Wildlife Refuge."]["GOOD NEWS: Our earthquake preparedness bill just unanimously passed out of its Senate committee. Now it’s on to the full Senate. We must be prepared for the next catastrophic earthquake and this bill gives our communities the tools they need to be ready. https://t.co/sFbT6SwHrl"]["Every Senate Republican voted last night to confirm Steven Grasz to a lifetime judgeship despite the fact that he was voted unanimously “NOT QUALIFIED” due to concerns that he could not be impartial. Biased judges on our courts should alarm every American. #CourtsMatter"]["Happy Hanukkah to those celebrating the Festival of Lights in California and around the world! I hope you enjoy the holiday surrounded by family and friends."]["I asked Brett Talley last month about his failure to disclose potential conflicts of interest and online commentary. He never responded to my letter. https://t.co/1fH6yXNwiS #CourtsMatter"]["The #GOPTaxPlan undercuts America’s electric vehicle and renewable energy transformation. It would be senseless for Republicans to disrupt these new industries that are a key part of growing our economy and fighting climate change."]["Another disgusting tweet from Thin-Skinned Donald Trump. This man has a problem, plain and simple. He lashes out at women and doesn’t seem to be able to control his impulses. For the good of the nation, he should delete his account. https://t.co/0aoBA1ze8i"]["Our courts have a critical role in upholding women’s constitutional and civil rights, from health care to workplace discrimination. We must speak out against judges who are #BadforWomen. #CourtsMatter"]["Steven Grasz defended state efforts to deny Medicaid coverage of abortion to women who are raped, which is required by federal law. #BadForWomen #CourtsMatter"]["Don Willett said he “resisted” the idea that glass ceilings, pay equity, sexual discrimination and harassment were serious problems for women.  #BadforWomen #CourtsMatter"]["Kyle Duncan defended a law that would have made abortion nearly impossible to access in Texas. The Supreme Court disagreed and overturned the law. He’s #BadForWomen #CourtsMatter"]["Stephen Schwartz has been nominated to serve on a court he’s not licensed to practice before—but what he HAS done is argue against women’s access to contraception and reproductive healthcare. #BadforWomen #CourtsMatter"]["Brett Talley, rated unanimously “not qualified” by the American Bar Association, has called Roe v. Wade “indefensible.” #BadForWomen @ABAesq"]["John Bush, confirmed to the Sixth Circuit, said that Roe v. Wade was one of the two greatest tragedies in our country’s history. #BadForWomen #CourtsMatter"]["Many of President Trump’s judicial nominees have demonstrated a clear hostility toward women’s rights. If you care about women’s rights, you need to care about who sits on our federal courts. #BadForWomen #CourtsMatter"]["The passing of Mayor Ed Lee is a very sad day for San Francisco and all of us who knew him. My heart and thoughts are with Ed’s family and friends and the city I love."]["Since 1989, only TWO of 1,755 nominees reviewed by the American Bar Association have been rated unanimously “not qualified” because they wouldn’t be objective. One is Steven Grasz, and Senate Republicans want to jam him through the Senate THIS WEEK. #CourtsMatter"]["LOS ANGELES COUNTY: As wildfires continue to grow and threaten the area, evacuation orders and the latest information from emergency personnel can be found here: https://t.co/hOSATv09fa #LAFires"]["SANTA BARBARA COUNTY: The #ThomasFire continues to grow. Familiarize yourself with the latest evacuation orders and please heed insturctions from first responders. https://t.co/GqzYbRunKA #LAFires"]["VENTURA COUNTY: For the latest evacuation and safety information, call the emergency hotline at 805-465-6650. Assistance is available for those affected by the wildfires, including shelter locations. #LAFires https://t.co/JZIHr0WtqJ"]["Senate Republicans are poised to confirm a judicial nominee rated unanimously “not qualified.” This hasn’t happened in nearly 30 years! The bar has never been lower for judges confirmed to lifetime positions. #CourtsMatter"]["My office can be of assistance if you have been affected by wildfires in California. We’re ready to help at 415-393-0707. #LAFires"]["Even as fires burn in California, Republicans are working to take money away from wildfire victims so the rich can have a tax cut. #GOPTaxPlan https://t.co/XPahIGVMKU"]["The rush to pass the #GOPTaxPlan is making a bad bill even worse. Tell your representative to vote NO on jamming a bill through that raises taxes on half of American families. https://t.co/LpkMcGbkM1"]["I received tens of thousands of calls, emails and letters last week from those who support #NetNeutrality. I’m impressed by the passion and enthusiasm. Make sure to read our letter to @AjitPaiFCC and keep letting @FCC know how you feel about the issue! https://t.co/Ds11O8gW1B"]["IMPORTANT: If you were affected by last month’s wildfires, today is the LAST DAY to register for federal assistance from @FEMA. You can find more information here: https://t.co/1MnIzIlkgI"][".@SecShulkin, I’m glad to hear you share the same commitment to homeless veterans that Californians do. We must preserve access to housing vouchers and do all we can do to take care of those who sacrificed so much to keep the country free. https://t.co/uARCZYcrXn"]["President Trump created a crisis by ending the #DACA program to please his political base. Republicans must work with Democrats to solve that crisis. #DREAMActNow"]["Many Republicans say there’s no urgency to passing the Dream Act. That's wrong! #DACA recipients are losing their protection from deportation every day. #DREAMActNow"]["The average Dreamer came to the United States at just 6 years old. This country is the only home they’ve ever known. #DREAMActNow"]["220,000 Californians are living in fear of deportation. We must pass the Dream Act by the end of the year. #DREAMActNow"]["MAIL DISRUPTIONS: Due to the #LAFires, residents in East Ventura and Oak View may pick up their mail at the post offices below. For the latest information on postal service disruptions, refer to @USPS: https://t.co/UMiGmt6fO3 https://t.co/FBEjnDB2es"]["The #GOPTaxPlan is windfall for corporations disguised as tax reform. It’s not tax reform! We can do much better than this bill. Help us defeat it! https://t.co/7AH1PnC17U"]["Republicans are STILL dead set on repealing the Affordable Care Act. We can't let them do that. Keep the phone calls to Republican representatives coming! #GOPTaxPlan https://t.co/2IEbLiqrCS"]["Real middle-class tax reform should provide tax relief for ALL middle-class families, not raise taxes on many middle-Americans to fund tax cuts for the rich. #GOPTaxPlan https://t.co/Qih9kmRcNF"]["This movement to root out harassment and assault started with Anita Hill. We owe her a debt of gratitude. Our culture is finally catching up. Thank you, Anita, for your courage. https://t.co/A0T1dhSoGX"]["SANTA BARBARA COUNTY: Be aware that #LAFires are now affecting parts of Santa Barbara and the surrounding area. Evacuations are underway. Pay attention to ALL instructions from emergency officials. Stay up to date with up-to-the-minute alerts: https://t.co/jsnymMm1zV #ThomasFire"]["Rural communities in California and across the country depend on the contributions made by #Dreamers. 91% of DACA recipients in rural areas are employed and contributing to their local economies. #DreamActNow"]["#BeFirefighterReady when it comes to prepping for wildfire. https://t.co/wWgXtSmkQZ"]["Covered California enrollment is up 28% from last year! Need health care coverage? Join the many Californians who are getting quality coverage from @CoveredCA. https://t.co/kVHcKRfXY5"]["December 7, 1941, defined a generation of heroes, a day our nation will remember forever. Today is National #PearlHarbor Remembrance Day."]["VENTURA COUNTY: Please visit https://t.co/zXcYVIVRho or call 805-465-6650 for up-to-the-minute information on evacuations and shelter locations. Californians always stay strong in times of peril—preparation is key. #ThomasFire"]["LOS ANGELES COUNTY ROAD CLOSURES: Wildfires causing many closures. Check on the latest information. https://t.co/lSAwq8HoqS"]["VENTURA COUNTY ROAD CLOSURES: It’s imperative to plan ahead. https://t.co/B0CatnRjVr"]["#ThomasFire now up to 96,000 acres with strong Santa Ana winds causing the flames to behave erratically. Please heed ALL instructions from emergency personnel. Conditions are changing by the minute, so staying up to date is vital."]["140 years ago today the @WashingtonPost printed its first issue. Its reporting has been critical to holding people in positions of power accountable. Happy birthday!"]["Keep calling California Republicans. Tell them to vote NO on the #GOPTaxPlan that raises taxes on the middle class and takes money away from these vital programs."]["Unbelievable! Speaker Ryan isn’t hiding the fact that Republicans want to give billions in tax cuts to the rich while taking money from Medicare and Social Security. We have to stop this awful bill! #GOPTaxPlan https://t.co/T31R61H1s0"]["In 1995, we passed a bill to recognize Jerusalem as the Israeli capital IN THE CONTEXT of the Oslo peace process. Today, there are ZERO direct negotiations. By taking these actions now, there’s real potential to further inflame the Middle East."]["The president’s decision to unilaterally recognize Jerusalem as Israel’s capital rejects decades of bipartisan policy and undermines our standing with Palestinians and regional partners. https://t.co/5yU2jS0SEZ"]["We can’t let the Trump administration tear down what took us decades to build. Read our letter calling on EPA Administrator Scott Pruitt to maintain increased fuel economy standards that save drivers money at the pump and reduce our dependency on fossil fuels. https://t.co/0O3z1I7T0o"]["The House Republican bill to expand the ability to carry concealed weapons would effectively allow states with the weakest gun laws to supersede states with the strongest gun laws, including California."]["It’s disgusting that House Republicans have decided to advance a bill to expand the ability to carry concealed weapons in the wake of two of the deadliest shootings in U.S. history. #StopCCR"]["Thank you to all of the advocates who came out to show their support for our bill to #BanBumpStocks: @BradyBuzz, @MomsDemand, @GiffordsCourage, @NewtownAction, @AmProg, @CSGV and @NTFSDV."]["It’s clear the American people don’t look lightly on these kinds of actions, no matter who they’re committed by, and the number of complaints against Senator Franken is a concern. I think resignation is the right thing for him to do."]["#ThomasFire is now at 65,000 acres and shows no sign of slowing down. Please pay attention to instructions from first responders and emergency personnel. Thank you to all the firefighters working hard to keep Californians safe!"]["In his prepared testimony, the acting ATF director said that the agency DOES NOT have direct authority to regulate or ban bump stocks. Congress MUST act to ban these dangerous devices. #BanBumpStocks"]["We’re taking a hard look at gun safety measures including bump stocks and background checks at today’s Senate Judiciary Committee hearing. Watch my remarks: https://t.co/QjlTsBMC7d"]["I voted against Kristjen Nielsen as DHS Secretary because I believe she would continue to prioritize deporting immigrant families rather than criminals. We also don’t yet have a commitment that the #DREAMAct will be passed by the end of the year."]["The fight is NOT over! The final tax bill still has to be passed by the House and Senate. Keep calling your representatives and tell them to vote NO on the #GOPTaxPlan. https://t.co/lVMaKO7hcI"]["The Senate and House still have to pass the final tax bill. Keep up the pressure on your representatives. Tell them to vote NO because Californians can’t afford the #GOPTaxPlan. https://t.co/lVMaKO7hcI"]["Important read: Nonpartisan experts conclude that the Republican tax bill will increase the deficit. Instead of changing the bill, Republicans have attacked those nonpartisan experts. Terrible. https://t.co/ukvo61NZ7D #GOPTaxPlan"]["Santa Ana winds causing the #ThomasFire to behave unpredictably—now at 45,500 acres and growing fast. If you are in Ventura County, pay attention to evacuation orders from emergency services. @CAL_FIRE\nhttps://t.co/I8Glcgekx7"]["Reports indicate the president will move the U.S. Embassy in Israel from Tel Aviv to Jerusalem. I wrote him last week to explain why that would be a terrible decision. https://t.co/MV1o73nyDk"]["VENTURA COUNTY: #ThomasFire dangerous and rapidly growing. 31,000 acres burned and 150 structures destroyed. Please heed evacuation warnings and instructions from @Cal_Fire and emergency personnel. Stay safe! https://t.co/q8IBv1WN8K"]["Los Dreamers son miembros de familia y de nuestras comunidades que merecen permanecer con sus seres queridos en el único país que conocen. Sus futuros dependen en la aprobación del #DreamAct por el Congreso. #Dreamers"]["#Dreamers are parents, siblings, spouses, and friends who deserve to stay with their loved ones in the only country they call home, the United States. Their livelihoods depend on Congress passing the #DreamAct."]["Al rehusarse a traer el #DreamAct a votación, el partido republicano está poniendo a nuestra economía en riesgo. Sin el #DreamAct, nuestra economía perdería $ 460.3 mil millones del PBI nacional durante la próxima década."]["ONE WEEK LEFT to register for federal disaster assistance if you were affected by the recent catastrophic wildfires. More info here: https://t.co/B2JucGiufD @FEMA"]["We’re committed to protecting a free, open internet, and the majority of Americans agree. Reports that the FCC public comment period may have been compromised are deeply concerning. #NetNeutrality https://t.co/jvbelRobrL"]["The president removed protected status from 2 million acres of national monuments to allow mining, drilling and more. This is an assault on ALL public land and a terrible decision! Continue to make your voices heard. Our national monuments are #MonumentsForAll!"]["The Myanmar government can deny truth, but the world knows the rampant killing of thousands of Rohingya is ethnic cleansing. https://t.co/BTZDrWD0Zf"]["Greenland’s glaciers are melting at an alarming rate, driving up sea levels. Greenland alone will be responsible for 16% of the sea level rise along California’s coast. We must #ActOnClimate! https://t.co/odrAZXxFPy"]["I discussed Michael Flynn and the Judiciary Committee’s investigation into obstruction, and Trump campaign/Russia ties yesterday on @MeetThePress with @ChuckTodd. Watch here: https://t.co/RM5ctD8XYX"]["While Americans were sleeping last night, Senate Republicans passed a massive tax cut for the rich paid for by a tax hike on the middle class. https://t.co/dasUjtIHgo"]["This FIGHT isn't over! They will now have to reconcile the differences between the House and Senate versions before a final vote.\n \nWe can still defeat the #GOPTaxPlan. Keep making calls and tell Republicans: Don’t RAISE taxes on the middle class!"]["BREAKING: Republicans just jammed through their middle-class tax hike! This awful bill was written behind closed doors and introduced only hours ago. Outrageous!"]["UPDATE: Republicans rejected our motion to adjourn until Monday so senators could read the bill they just introduced.\n \nRT If you think senators should have time to read a bill that affects every single American."]["UPDATE: Republicans finally released their 500-page tax cut bill—drafted ENTIRELY behind closed doors. We’re probably voting tonight, but NO ONE has read the bill! Unacceptable."]["30 years after the first treatment we have therapies that allow people with HIV to live longer and fuller lives. But more work remains. #WorldAidsDay @SF_DPH"]["LATEST: There's no #GOPTaxBill yet, but we may vote on it in a matter of hours. No Republican senator who has said they're voting 'yes' has even seen the final bill. This is atrocious. https://t.co/mFpnutPtur"]["BREAKING: Republicans now say they have the votes to pass their dangerous tax bill. The vote could happen later today or tomorrow, but we STILL haven’t seen the secretly-negotiated bill!"]["(2/2) It’s critical that we determine whether Flynn spoke with the Russians on his own initiative and who knew and approved of his actions. More proof that these investigations must be allowed to continue without interference. https://t.co/LdeV9thjld"]["(1/2) Michael Flynn’s guilty plea is about more than just lying to the FBI. This shows a Trump associate negotiating with the Russians against U.S. policy and interests before Donald Trump took office and after it was announced that Russia had interfered in our election."]["NEW THIS MORNING: Republicans are rewriting their bill in secret. They don’t have the votes, but it’s clear they’re DESPERATE to get SOMETHING, ANYTHING done. We have to keep up the pressure. #GOPTaxPlan"]["BREAKING: Republicans just canceled tonight’s vote on their tax bill. They still don’t have enough votes to pass this awful bill. \n \nWe can’t let up! Keep calling your representatives and tell them to vote NO on the #GOPTaxPlan."]["LATEST: The Joint Committee on Taxation says there’s NO CHANCE the Republican tax bill could generate enough revenue to cover the $1.4 TRILLION it will add to the deficit. Republicans claimed their tax cuts would pay for themselves through economic growth. That’s NOT TRUE."]["To all of the graduate students in California and across the country: I stand with you! You shouldn't be punished for pursuing higher education. https://t.co/fbkMezEBhO"]["UPDATE: Democrats just offered an amendment to ensure corporations use their tax savings to raise employee wages at the same rate they increase executive pay, stock buybacks and dividends to shareholders. Every single Republican voting, voted NO. #GOPTaxPlan"]["I’ll be voting AGAINST the #GOPTaxPlan and I urge my colleagues, for the good of hardworking Americans across the country, to vote against it too. This isn’t tax reform, this is a bill that overwhelmingly benefits the rich."]["From education to health care to the pocketbook, the #GOPTaxPlan would affect all Americans—and not for the better. We must stop this bill. https://t.co/lJQbFQLS0n"]["UPDATE: We may vote on the Republican tax bill TONIGHT. We don't have the final bill. We don't have analysis from the Joint Committee on Taxation as to whether or not the bill would boost the economy. We don't have a Treasury Department analysis. This is OUTRAGEOUS!"]["New @AARP analysis: This #GOPTaxPlan is bad news for older Americans from coast to coast. https://t.co/xyXSXYTIOP"]["The awful #GOPTaxPlan will hurt commuter benefits and transportation projects. As if your daily commute wasn’t bad enough already. https://t.co/9IAcFfATX4"]["The #GOPTaxPlan is getting closer and closer to a vote in the Senate. Keep the calls to your representatives coming! This bill is bad for working Americans and a windfall for the rich. Let’s work together to defeat it!"]["Los Angeles City Controller Ron Galperin details just how bad the #GOPTaxPlan is for LA. Great read: https://t.co/qD2X26TM9L"]["California has tight restrictions carrying concealed weapons. Under a bill being debated in the House, someone with a concealed-carry permit from Nevada could carry a concealed weapon in California, no questions asked. #StopCCR"]["ALERT: The House Judiciary Committee today passed a dangerous proposal that would effectively allow states with the weakest gun laws to supersede states like California with the strongest gun laws. #StopCCR"]["The nonpartisan Tax Policy Center found the #GOPTaxPlan INCREASES taxes on 13 million middle-class households by 2019. https://t.co/YQpcTZehnQ"]["A 60-year-old in Fresno who makes $50,000 per year currently pays $727 per month.\n\nUnder our bill, that person would SAVE $323 per month.\n\nUnder the Republican plan, that person would pay $72 MORE per month."]["A 60-year-old in Los Angeles who makes $50,000 per year currently pays $548 per month.\n\nUnder our bill, that person would SAVE $542 per month.\n\nUnder the Republican plan, that person would pay $54 MORE per month."]["A 60-year-old in San Diego who makes $50,000 per year currently pays $652 per month.\n\nUnder our bill, that person would SAVE $248 per month.\n\nUnder the Republican plan, that person would pay $65 MORE per month."]["A 60-year-old in Sacramento who makes $50,000 per year currently pays $905 per month.\n\nUnder our bill, that person would SAVE $501 per month.\n\nUnder the Republican plan, that person would pay $90 MORE per month."]["A 60-year-old in San Francisco who makes $50,000 per year currently pays $946 per month. \n\nUnder our bill, that person would SAVE $542 per month.\n\nUnder the Republican plan, that person would pay $94 MORE per month."]["Democrats want to make health insurance more affordable for middle-class families. In contrast, the current #GOPTaxPlan would make insurance more expensive by sabotaging the individual market. Follow for examples of how middle-class families would be hurt."]["New analysis forecasts increasingly devastating wildfires. If things don’t change, California could see the worst of the dire effects detailed in this report. We must take action—for the good of future generations. #ActOnClimate https://t.co/mVOwZ2ez8J"]["112,000 foster children in this country are waiting to join loving families. Let’s work together to ensure they are able to live fulfilling and productive lives in forever homes. November is #NationalAdoptionMonth. https://t.co/28w4HgOd8n"]["The courts are the last line of defense against President Trump’s policies. That’s why Republicans eliminated the #blueslip, to make it easier to confirm his right-wing nominees. #CourtsMatter"]["I joined district attorneys from around the country at a press conference to talk about reducing gun violence. I want to send a special thank you to @CityAttorneyLA Mike Feuer, @ManhattanDA Cy Vance and Clark County DA Steve Wolfson. https://t.co/5w3XAQDHGZ"]["FACT: 5 of the 9 Trump nominees confirmed to date have required a #blueslip from Democratic senators. All have received them. There has been NO obstruction to justify eliminating a 100-year-old Senate tool."]["FACT: During the Obama administration, 18 judicial nominees were blocked because they did not receive a #blueslip from both home-state senators."]["FACT: During the administrations of Presidents Obama, Bush and Clinton, not ONE judge was confirmed without two blue slips."]["FACT: The last time a judge was confirmed without two #blueslips was 1989."]["FACT: Fewer than FIVE judges have been confirmed without two #blueslips in 100 years."]["FACT: During the Obama administration, Democrats NEVER violated the #blueslip policy, even though Republicans used it to block many nominees."]["FACT: In 2015 and 2016, Republicans used the #blueslip to block 9 Obama nominees: \nRebecca Haywood\nLisabeth Tabor Hughes\nAbdul Kallon\nMyra Selby\nDon Beatty\nMary Barzee Flores\nDax Lopez\nPatricia Timmons-Goodson\nAnne Traum."]["This morning’s Judiciary Committee nominations hearing includes a nominee who has yet to receive sign off from home-state senators. Republicans are misrepresenting the history of the 100-year-old blue-slip policy to justify this move. It’s important to know the facts."]["Cadiz wants its friends in the Trump administration to clear any federal hurdles for a disastrous water extraction project in the Mojave Desert. Today’s lawsuit shows that won’t happen without a fight. https://t.co/EDHJHu1DIQ"]["Teachers who give everything to help their students shouldn’t pay for tax cuts for the rich. #GOPTaxPlan\nhttps://t.co/eOjVKan0MT"]["It’s been nearly two months since Republicans allowed the Children’s Health Insurance Program to expire. California could lose $2.7 billion to care for children if we don’t act NOW. #ExtendCHIP https://t.co/514hh9aIvl"]["BREAKING: Senate Budget Committee just voted to advance the awful #GOPTaxPlan that hurts the middle class! However, many Republican senators are still on the fence. Keep up the calls and let’s stop this bad bill!"]["A better approach for Republicans would be to scrap this bad bill and start working with Democrats on tax reform that helps middle-class families. #GOPTaxPlan https://t.co/p53QyVkL6j"]["RT if you think the Senate should prioritize health care for children over tax cuts for big corporations and rich Americans. #ExtendCHIP https://t.co/514hh9aIvl"]["72% of #Dreamers are pursuing a bachelor's degree or higher. These young people are the future of our country and we must protect them. #ProtectDreamers"]["We should expand the child tax credit for working families instead of giving wealthy families more benefits. Families nationwide are struggling to pay for child care. #GOPTaxPlan #BadDealForWomen"]["Many women are primary caregivers in our country, and many struggle to care for children and aging parents. Rather than expand access to paid family leave, the #GOPTaxPlan would instead benefit wealthy companies that already offer paid leave. #BadDealForWomen"]["The president claims he won’t benefit from the #GOPTaxPlan. If that’s true, he can easily prove it by releasing his returns. What’s he hiding? https://t.co/WJ2EErTSo9"]["Economists say the Senate #GOPTaxPlan will increase our debt. I believe Republicans will use that as an excuse to gut Medicare, Medicaid and Social Security. We can’t afford this bill! https://t.co/9QyFPNGbX5"]["Happy 25th birthday to the Monterey Bay National Marine Sanctuary! The @MBNMS is the largest U.S. marine sanctuary, protecting more than 6,000 square miles of ocean along California’s coast. https://t.co/rsNoKTN62W"]["Ignore the Republican spin—tax cuts for the rich WON’T pay for themselves. #GOPTaxPlan https://t.co/9QyFPNGbX5"]["Nonpartisan Congressional Budget Office says most Americans earning less than $75,000 would be WORSE OFF by 2027 under the Senate #GOPTaxPlan. Meanwhile, the rich get a big tax cut. This is a bad bill! https://t.co/oTks6lwcmu"]["Under the Senate #GOPTaxPlan, taxes would eventually go up for more than 1/3rd of middle and working class families in California. https://t.co/Z8TwfnCvyw"]["It’s pretty clear who is a priority in the Senate Republicans tax bill. #GOPTaxPlan"]["Today is Small Business Saturday, a great chance to support your local business and shops. https://t.co/jRhMXfIPzE"]["To give corporations a permanent tax cut, the Senate #GOPTaxPlan adds $1.5 trillion to our deficit, raises taxes on the middle class and leaves 13 million people without health insurance. Unbelievable! https://t.co/aBz1TwUGd0"]["It’s open enrollment season: If you need quality, affordable health insurance, visit https://t.co/aXIlXoF6UJ. Sign up by December 15 for coverage that begins January 1."]["The Senate #GOPTaxPlan is simple: Corporations get a huge tax cut, middle-class Americans get a tax increase and millions are left without health insurance. https://t.co/bcsZHsjrcZ"]["Wishing you and your family a happy and blessed Thanksgiving. https://t.co/CqXXZoFRzE"]["The #GOPTaxPlan adds $1.5 trillion to our deficit but the real cost could be even more. Americans can’t afford this awful bill! https://t.co/FGE1Jd2dSm"]["This is absurd! If you make less than $75,000 per year, your taxes could go up under the Senate #GOPTaxPlan. Meanwhile, the rich get a HUGE tax cut. https://t.co/6MzDVlLLb8"]["Justice for Larry Nassar’s victims can’t come soon enough. I’m heartbroken for these young women, but because of their bravery in coming forward, the Senate passed a bill to help prevent this from happening again. I urge the House to pass this bill ASAP. https://t.co/kFzgEuFxJj"]["Women make up 53% of DACA recipients. Failure to pass the Dream Act by the year’s end puts their future and the future of their families in jeopardy.\nhttps://t.co/gsMhIVzpQv"]["It’s been 52 days since funding for community health centers expired. They are the largest source of primary care–serving 27 million Americans. Congress must act now!"]["I joined Democratic women senators in urging Senator McConnell to bring the Dream Act to the floor as soon as possible.\nhttps://t.co/gsMhIVhOYX"]["We should support efforts to save elephants, not undermine them.\n\nToday I called on the Trump administration to uphold the ban on African elephant trophy imports. #BeKindToElephants https://t.co/i7POHsCPCR"]["Curious who will pay to give a permanent tax cut to big corporations?\n \nAccording to the Tax Policy Center: Half of all households would see a tax increase by 2027 under the Senate #GOPTaxPlan."]["Last month, I called on the US Trade Representative to address the problem. Environmental concerns along the border must be a priority in the next NAFTA deal. https://t.co/MwAJJ3HK8h"]["Great op-ed on the need to include Tijuana river pollution as part of the NAFTA renegotiation. https://t.co/lYFX0hN0px"]["The #KeystoneXL pipeline remains a bad deal for our country. It’s an unnecessary pipeline for a company that just spilled 210,000 gallons of oil in South Dakota. \n\nI'll continue to oppose it and fight for clean energy alternatives. #NoKXL https://t.co/0LDXpPTypu"]["The #GOPTaxPlan raises taxes on the middle-class to give big corporations a permanent tax cut. Read this important op-ed:\nhttps://t.co/3VkzY1dEMB"]["The Senate shouldn't move forward on the nomination of Brett Talley if he fails to answer questions about potential conflicts of interest and online commentary. My letter: https://t.co/J54zZolfWQ"]["Republicans just eliminated a 100-year-old Senate policy to jam President Trump's right-wing judicial nominees through the Senate as quickly as possible. Our letter to Chairman Grassley: https://t.co/zB3PkFGjT1 #CourtsMatter"]["To cut taxes for the richest individuals and corporations, the Republican tax bill would increase taxes for graduate students by 300 to 400 percent. These students typically earn $30K per year. Absolutely outrageous! https://t.co/WEVCBUfzHF #GOPTaxScam"]["Media reports indicate that Tom Farr was not truthful in his response to my question about his involvement in voter suppression efforts. This disturbs me greatly. Nominees must be forthright—these are lifetime appointments we’re talking about. https://t.co/aCnC3gvVVZ"]["My bill with Senator @ChrisVanHollen and @SenatorCardin would provide a path to citizenship for those with Temporary Protected Status. These individuals have established roots in their communities and it would be cruel and inhumane to separate these families."]["In light of Brett Talley’s failure to disclose potential conflicts of interest and online political commentary, I'm demanding answers. My letter: https://t.co/J54zZoCQOo"]["Read @Refinery29's story about our bill to ensure the safety of personal care products and @BeautycounterHQ's endorsement. https://t.co/rGRT6vluHM #SafeProducts"]["Democrats want tax reform that helps all Americans get ahead. Instead, the Republican plan leaves the middle class holding the bill. https://t.co/WPDuR2pfMU"]["Judiciary Committee Democrats denounce the decision to give President Trump even MORE power on judicial nominations by eliminating the 100-year-old #blueslip. Read our letter: https://t.co/zB3PkFXVhB #CourtsMatter"]["I agree! California can’t afford the #GOPTaxPlan. https://t.co/G28unUK3VO"]["Not only is there inadequate funding for Puerto Rico, the Virgin Islands, Texas and Florida hurricane relief, but California wildfire victims were NOT included in the Trump administration’s disaster request. Completely unacceptable. https://t.co/I8fwegYKHY"]["It’s disgusting the White House is even considering lifting the trophy ban. I’ll fight this or any attempt to weaken protections for endangered elephants. https://t.co/gVJhpeZccy"]["Join me in telling them: Keep California’s parks open and accessible to all! https://t.co/1MIlEFxbLf"]["I’ve called on the Trump administration to not raise visitor fees at Yosemite, Joshua Tree, and Sequoia and Kings Canyon national parks. https://t.co/R1lSdbSRlz"]["The White House’s request for disaster assistance did NOT include aid for California wildfire victims. That’s appalling! \n\n@SenHarris and I are working to secure wildfire funding before it passes Congress. https://t.co/Kt4fJI8reR"]["This says it all: \"The congressional Joint Committee on Taxation said on Thursday that the latest version of the Senate tax bill would effectively RAISE taxes for lower-income Americans by 2021.\" https://t.co/neWzlnrHdT #GOPTaxScam"]["In 2015 and 2016 ALONE, Republicans used the #blueslip to block these nine Obama nominees:\n\nRebecca Haywood\nLisabeth Tabor Hughes\nAbdul Kallon\nMyra Selby\nDon Beatty\nMary Barzee Flores\nDax Lopez\nPatricia Timmons-Goodson \nAnne Traum"]["The Republican tax cut bill was written to help the rich at the expense of the middle class. That’s the bottom line. https://t.co/aBhxhSmc6n"]["The lengths to which Republicans are going to jam extremely conservative and controversial nominees through the Senate is unprecedented. What’s happening is diminishing the Judiciary Committee and the Senate and undermining the independence of the federal judiciary. #CourtsMatter"]["Republicans shouldn’t have one blue slip policy for Democratic presidents and another for Republican presidents. In 2015 and 2016, Chairman Grassley refused to allow NINE Obama nominees to have hearings. #CourtsMatter"]["House Republicans just passed a bill that adds up to $12.1 billion to Californians’ tax bill each year. Why would California Republicans vote against their own constituents? https://t.co/Qvijvty0bE"]["Thank you @RahuaBeauty for supporting the Personal Care Products Safety Act! Independent review of ingredients is critical to ensure #SafeProducts."]["Our skin is our largest organ, which is why we need to ensure the safety of personal care products. Thank you @SWBasicsofBK for your support of the Personal Care Products Safety Act! #SafeProducts"]["Thank you @VapourBeauty for endorsing the Personal Care Products Safety Act. Companies know that commonsense rules of the road help businesses succeed. #SafeProducts"]["@beautycounterhq We all use personal care products each and every day. We deserve to know they are safe. Thank you @OSEAMalibu for your support of the Personal Care Products Safety Act! #SafeProducts"]["Thank you @BeautyCounterHQ for endorsing the Personal Care Products Safety Act! We continue to build momentum for our bill to ensure #SafeProducts."]["Republicans should stand with our police officers and keep their hands off the deduction for state and local taxes. #GOPTaxPlan https://t.co/6lIvGUQbOy"]["Our background check bill will strengthen the existing system and close loopholes. It’s vital we do all we can to keep guns out of the hands of dangerous people. Read more about our bill: https://t.co/1gQQVOqwTH"]["BREAKING: We've just introduced bipartisan legislation to improve the gun background check system. Progress is possible!"]["As we approach the five-year anniversary of the horrifying shooting at Sandy Hook, it’s heartbreaking that we’ve made so little progress in preventing these shootings. Elementary schools like the one in Rancho Tehama Reserve shouldn’t have to prepare for mass shootings."]["Is this a country that kicks people off of their health coverage to cut taxes for the top 1 percent? Repealing the Affordable Care Act in a tax-cut bill is outrageous. #GOPTaxScam"]["More than 15,000 scientists from 184 countries just issued a dire warning on climate change. The science is settled, we must #ActOnClimate before it’s too late. https://t.co/2Gy53GARir"]["The #GOPTaxPlan raises taxes on millions in the middle class. Repealing the Affordable Care Act would make their health care costs skyrocket too. The middle class can’t afford this awful bill."]["I agree with our police officers, ending the deduction for state and local taxes is a bad idea. #GOPTaxPlan could force cuts to funding that first responders rely on to keep our communities safe. https://t.co/qzjUgjepFL"]["We need a tax plan that encourages companies to hire American workers. Instead, the #GOPTaxPlan would create a huge payday for the rich. https://t.co/3MQh79RUst"]["The House #GOPTaxPlan would make it even harder to build affordable housing in California. This is a bad bill! https://t.co/m4rotXt8Mc"]["The #GOPTaxPlan could trigger a $25 billion cut to Medicare. Seniors shouldn’t suffer so the rich can have a tax cut.  https://t.co/HDz10dFQ27"]["Affordable Care Act sign-ups are up nearly 50% over last year. Americans want quality, affordable health coverage. Senate Republicans are pushing a policy in their tax bill that would raise premiums another 10%. Disgraceful. #GOPTaxPlan"]["Sound the alarm! Senate Republicans’ tax-cut bill is now an attack on the Affordable Care Act. 13 million people will lose their health coverage if this passes! #GOPTaxPlan"]["Under Richard Cordray’s leadership, the @CFPB fought to return nearly $12 billion to consumers across America. Richard, I thank you for your service and can’t wait to hear what’s next for you. https://t.co/QZaKyLeD88"]["If we destroy the #ArcticRefuge, we can’t get that pristine landscape back. #ProtectTheArctic for future generations! https://t.co/NcaVhRaRTP"]["In the wake of allegations of sexual abuse made against personnel involved with USA Gymnastics, USA Swimming and USA Taekwondo, we introduced legislation to protect young athletes. Today, our bill PASSED! Read more: https://t.co/U0wTEX1bla"]["Pursuing an education is already too expensive, #GOPTaxPlan could make it unaffordable for many graduate students. https://t.co/nqyLMrsGsJ"]["I’m disappointed the Senate confirmed Steven Bradbury to the Transportation Department. He provided the feeble foundation upon which the CIA ran its torture program, endangering our troops and betraying our values. He doesn’t belong in government. https://t.co/4zFVXwOUvx"]["Senate Republicans’ tax bill wipes out the deduction for state and local income, sales and property taxes. The 6 million Californians that claim this important middle-class deduction could see their taxes go up. #GOPTaxPlan"]["BREAKING: The Senate just passed our bill to prevent sex abuse in amateur athletics. This wouldn’t have been possible without the courage of women who came forward to say ‘ENOUGH is ENOUGH.’ Today is their day."]["Senate Republicans’ tax bill would add $1.7 trillion to the deficit. That’s too steep a price tag for a bill that gives the top 1% a tax cut they don’t need! #GOPTaxPlan"]["Social Security, Medicare and Medicaid recipients shouldn’t be victims of the Republicans’ tax cuts for millionaires and billionaires."]["Senate Republican tax bill adds $1.7 trillion to the deficit, creating an excuse for Republicans to make drastic cuts to Social Security, Medicare and Medicaid in the future.  #GOPTaxPlan"]["The #GOPTaxPlan only allows deductions for federally declared natural disasters. But many disasters—including most wildfires—do not receive that designation."]["Many victims of natural disasters would no longer be able to write off their losses under the Senate Republicans’ tax bill."]["It’s beyond cruel to ask families struggling to pick up the pieces after a natural disaster to foot the bill for tax cuts for the rich! #GOPTaxPlan"]["Tax reform should prioritize middle-class Americans, not wealthy Republican donors. The Senate Republican bill fails that test! \n\nUnder the Republican plan, more than 21 million middle-class households would see their taxes increase by 2025. #GOPTaxPlan"]["BREAKING: Senate Republicans now want to gut the Affordable Care Act in their tax bill! Middle-class families will pay more for health coverage while the top 1% get tax cuts. Terrible!"]["Another heartbreaking shooting, this time in Rancho Tehama, California. When will this stop and how can we stop it?"]["Regardless of whether there was a Democratic or Republican president, @SenatorLeahy had the same policies for judicial nominees. https://t.co/ut7QvMYKRD"]["Brett Talley has betrayed his obligation to be open and transparent with the Senate and the American people. He failed to disclose his wife is one of President Trump's lawyers—a potential conflict of interest. https://t.co/J1rhfl0uz9"]["We must do more every single day, not just on #VeteransDay, to honor the sacrifices made by those who served. Ending homelessness for veterans should be a priority for the VA. https://t.co/jOReOQYOgK"]["The @SacBee editorial board says that we need to keep the conversation about gun safety at the forefront. https://t.co/EIhx4sbMp1 #BanAssaultWeapons"]["Senate Republicans have done a head-spinning 180 on the right of senators to sign off on judicial nominees from their states. My op-ed sets the record straight. https://t.co/iV74LYOvlH"]["It’s past time that the @FEC update rules governing political ads. Americans deserve to know if a foreign government is behind the content they see online. https://t.co/hGXyMQmgTM"]["Antibiotics save lives, but overuse makes them ineffective. We must do everything we can to cut down on overuse and develop new drugs to combat antibiotic-resistant bacteria strains. #WAAW #AntibioticResistance"]["The @SFChronicle editorial board says that our bill to #BanAssaultWeapons \"needs to come to a roll-call vote so Americans can see which of their elected officials are taking a stand for public safety.\" https://t.co/SjmvBoJ6c1"]["Many of President Trump's judicial nominees are FAR outside the mainstream. Important @NYTOpinion op-ed. https://t.co/aitmozZ8FA #CourtsMatter"]["Our federal courts serve as an independent check on the executive branch. Senate Republicans are trying to transform them as quickly as possible. https://t.co/aMMuAkdjDw #CourtsMatter"]["Spot-on @PostOpinions editorial: Senate Republicans shouldn’t rush judicial nominees through the Senate. https://t.co/7fM3jihU0Y"]["If you care about women's rights, civil rights or worker's rights, you need to care about our courts. Must-read @NYTOpinion op-ed on #TrumpJudges: https://t.co/aitmoAgK4a"]["Today we salute the service of the brave men and women who have defended our freedom around the world. Thank you #Veterans. Your sacrifice will never be forgotten. https://t.co/ysoM7brD0W"]["Happy #VeteransDay to all those who have served our country!"]["Every employer and employee—including the U.S. Senate—must take sexual harassment seriously. That's why I've introduced legislation with my colleagues to require harassment training. https://t.co/N3cimBsvGg"]["The Trump administration’s decision to terminate protections for nationals of countries like Nicaragua and Sudan is shortsighted and contradictory to what our nation stands for. Sending them back is wrong. https://t.co/cckRtzDmRv"]["All Californians should be prepared for the next quake. The federal government should be incentivizing retrofitting, not getting in the way. @SenKamalaHarris and I want to make sure tax breaks are available for life-saving earthquake preparation efforts. https://t.co/0Q2FJF3DkL"]["#Dreamers, I stand with you. It’s time for Congress to pass the #DREAMAct. Let’s empower young people who are making major contributions to their communities. #DREAMActNow https://t.co/C3tPeL17Ms"]["RT if you agree that weapons of war that are designed to kill more people, more quickly don’t belong on the streets of America. #BanAssaultWeapons"]["Learn more about our bill here: https://t.co/5LfmUBHNZM #BanAssaultWeapons"]["Our bill would ban bump-fire stocks and other accessories that increase a semi-automatic weapons rate of fire to that of a machine gun. #BanAssaultWeapons"]["Our bill would ban magazines and other ammunition feeding devices that hold more than 10 rounds of ammunition, which allow shooters to quickly fire many rounds without needing to reload. #BanAssaultWeapons"]["Our bill would ban any assault weapon that accepts a detachable ammunition magazine and has one or more military characteristics: pistol grip, forward grip, barrel shroud, threaded barrel or folding or telescoping stock. #BanAssaultWeapons"]["Our bill to #BanAssaultWeapons would prohibit the sale, manufacture, transfer and importation of 205 military-style assault weapons by name."]["The bottom line is that military-style assault weapons allow gunmen to kill more people, more quickly. These weapons should not be on our streets. #BanAssaultWeapons"]["November 2017: 26 parishioners praying in Sutherland Springs, Texas, were killed by a gunman with an assault rifle. The dead ranged from 17 months old to 77 years."]["October 2017: A gunman opened fire on concertgoers in Las Vegas, turning an evening of music into a killing field. The shooter used multiple assault rifles fitted with bump-fire stocks to kill 58 people. This is the deadliest mass shooting in our history—so far."]["June 2016: A gunman entered a nightclub in Orlando with an assault rifle, spraying revelers with gunfire. The shooter fired hundreds of rounds and killed 49 people. Many of the victims were shot in the head at close range."]["December 2012: A young man entered an elementary school in Newtown, Conn., armed with an assault weapon. He murdered six educators and 20 first graders. One child was shot in the head after telling his classmates to run."]["July 2012: A gunman walked into a darkened movie theater in Aurora, Colo., murdering 12 people and injuring 70. The youngest victim was 6 years old. The gunman had purchased 6,000 rounds of ammunition in the months prior to the shooting."]["Simplifying the tax code should focus on eliminating loopholes that corporations exploit, not ending vital deductions that middle-class families rely on. https://t.co/2lhNtE0wST"]["Americans want a tax code that helps those in need, not just the rich. https://t.co/swq76AZo46"]["Isolating the Cuban people didn’t serve our interests before, and it certainly won’t do so now. Isolation doesn’t work. https://t.co/YIY1XuqjmG"]["BREAKING NEWS: Non-partisan Congressional Budget Office says Republican tax bill would add more than $1.7 trillion to our debt. We simply can’t afford their tax cut for the rich. #GOPTaxPlan"]["NORTH BAY RESIDENTS: FEMA grants are available to help families rebuild after last month’s wildfires. Be sure to apply today—the deadline is December 11. https://t.co/xBPdlrB0rj"]["San Bernardino. Aurora. Newtown. Roseburg. Orlando. Las Vegas. Sutherland Springs. These mass shootings all involved military-style assault weapons. It's past time to remove weapons of war from our streets."]["Mayors across California agree: Republican plan to end state and local income tax deductions would hurt the middle class. https://t.co/8zwvKQdQKF"]["The #GOPTaxPlan isn't reform, it's a middle-class tax hike to give corporations and the rich a tax cut. https://t.co/NZm5W1BrA6 https://t.co/2f1TsGJKvw"]["New analysis finds that #GOPTaxPlan would lead to nearly half of middle-class families paying MORE taxes in 2026. https://t.co/NZm5W1BrA6"]["It was my pleasure to meet with Nasser Nawaj’ah from Susiya in the West Bank. Israel should not demolish his village! https://t.co/92O8Pfuyzk"]["If you need quality, affordable health insurance, visit https://t.co/aXIlXonvw9! Sign up by December 15 for coverage that begins January 1."]["The average teacher spends $500 per year on school supplies. Republican plan says they can't deduct even $250 from their tax bill. Terrible!"]["Why in the world would we make it more expensive for teachers who want to help their students learn to cut taxes for the wealthy?"]["Teachers spend $1.6 BILLION per year on school supplies. The Republican tax bill ELIMINATES their ability to deduct those expenses."]["The Thorsen family relies on the deduction for medical bills to provide adequate care for Alzheimer's disease.  https://t.co/2bMIC8SlHY"]["Must-read op-ed on how the Republican tax plan could devastate seniors with serious medical conditions. https://t.co/DyXStATiS8"]["Nearly half of those who deduct medical bills earn less than $50K per year. It’s shameful to raise their costs to cut taxes for the top 1%."]["9 million Americans, most of whom are older, deduct medical bills. The Republican tax bill RAISES their medical costs to help the rich."]["California faces an affordable housing crisis. Republican tax bill ELIMINATES credits and bonds that financed 22K units of housing in 2016."]["When will we decide that we can’t accept massacres in our places of worship, schools, or at concerts? When will we actually DO something?"]["I’m horrified by the news of this latest mass shooting. My thoughts are with all of those in Sutherland Springs. https://t.co/gCTIsAXQX6"]["Why in the world would we make it harder to pay back student loan debt to give the wealthiest corporations a tax cut?"]["44 million Americans are paying back $1 TRILLION in student debt. Republican bill increases their costs to cut taxes for top 1%. Terrible."]["The average California student graduates with $23,000 in debt. The Republican tax plan makes it MORE expensive to pay student loans back."]["The #TrumpTax bill eliminates deductions for state and local income taxes. 5 million Californians could see their income taxed twice."]["If you care about civil rights, the rights of women and the ability to protect our environment, you need to care about judges. #CourtsMatter"]["#TrumpJudges have been handpicked by right-wing, dark-money groups that have litmus tests. That should trouble us all."]["Our tax code encourages companies to hire veterans. #TrumpTax plan ends the Work Opportunity Tax Credit, hurts those who served. #HireVets"]["The effort to remake our federal courts with right-wing judges deserves far more attention. https://t.co/Izrnq0yEnV #CourtsMatter"]["More than 100,000 American kids are waiting to be adopted. #TrumpTax plan makes it harder for families to adopt, ends adoption tax benefits."]["An independent judiciary is the backstop against President Trump’s legally-suspect policies. We must protect it. #CourtsMatter"]["Trump policies have been challenged in court, so Republicans are trying to stack the courts with right-wing judges. #CourtsMatter"]["#TrumpTax plan ends mortgage interest deduction on new homes above $500K, making it more expensive to buy a home. CA median price is $553K."]["Republicans allowed just 22 judicial nominees to be confirmed the last two years of Obama’s presidency—the fewest since President Truman."]["Senate Republicans are pushing President Trump’s controversial judges through as quickly as possible to transform our courts. #CourtsMatter"]["My bill to expand tax credits to more middle-class families on the individual market would help fix this problem. https://t.co/q0zYE1ZlZv"]["Rosa Maria should have never been taken into custody, but it's great news that she's been reunited with her parents! #FreeRosa https://t.co/minR6STEBe"]["Median home price is above $500,000 in 18 Calif. counties. #TrumpTax plan could make new home purchases more expensive in those counties."]["Government report: U.S. must reduce our carbon emissions.\n\n#TrumpTax plan: Ends tax credit for electric cars.\n\nhttps://t.co/7EpX0fLlaC"]["We can’t allow ourselves to become numb to the president calling on independent law enforcement to investigate his political opponents."]["President Trump’s calls for investigations into Secretary Hillary Clinton are deeply disturbing and show his contempt for the rule of law."]["Emergency alerts can save lives when wildfires strike. @SenKamalaHarris and I are demanding @FCC update the system: https://t.co/XTTcR3NlCV"]["DOJ is responsible for ensuring constitutional rights of transgender Americans. We’re making sure they know that. https://t.co/4RP0kZZTJj"]["Working to stop the revolving door between the pharmaceutical industry and DC lobbyists. Vital for community safety. https://t.co/nAOUBCI32I"]["#TrumpTax bill eliminates the key state and local income tax deduction, which was claimed by 5 million working California families in 2015."]["#TrumpTax bill caps the mortgage interest deduction and puts in place a huge barrier to homeownership."]["#TrumpTax bill increases deficit, slashes key deductions/credits for working families in order to give big companies and the rich a tax cut."]["It’s unbelievable the lengths Republicans will go to give the rich a tax cut. Their bill is a non-starter for me. https://t.co/BDujDNANk6"]["The @Dodgers left it all out on the field. I’m proud of #ThisTeam and look forward to watching them next year. #Respect"]["The pay gap is largest for #Latina women, who earn just 54 cents for each $1 earned by white men. We MUST do better. #LatinaEqualPay"]["California was scorched by record-setting wildfires. Additional recovery funding must be made available to help communities rebuild. https://t.co/pcNT17OMSG"]["Western wildfires may have faded from the news cycle, but recovery efforts continue. Read our letter to the president: https://t.co/O4Ib2DOeyR"]["Looking for quality, affordable health insurance? #GetCovered today through @CoveredCA: https://t.co/mWu8aFaru4"]["\"After a signal from the NRA, spineless lawmakers have done exactly what the gun lobby wants. Absolutely nothing.\" https://t.co/Lsk36ww0hL"]["NRA playbook: Distract and delay until victims no longer dominate the news. Those who care about gun violence need to keep pushing."]["Just 1 month after the deadliest mass shooting and companies are resuming sales of bump-fire stocks. Disgusting. https://t.co/QpwlNgkkv4"]["The Judiciary Committee should hold a hearing on the detention of Rosa Maria Hernandez. My letter: https://t.co/CGpyGuMcFP #FreeRosa"]["I’m confident #ThisTeam will finish strong tonight! Let’s go @Dodgers! #WorldSeries"]["After Las Vegas, it was ‘too soon’ to discuss gun safety. Now it’s apparently not ‘too soon’ to paint immigrants with the same broad brush."]["It's deeply troubling that the president's response to a terrorist attack appears to be driven by Fox &amp; Friends. https://t.co/yJYvs3lgtF"]["Great @USAToday opinion piece calling out NRA efforts to block our commonsense bill to ban bump-fire stocks. https://t.co/Lsk36wepqd"]["Looking for quality health insurance? Open enrollment starts TODAY for health care from @CoveredCA: https://t.co/mWu8aFaru4"]["It’s a fact, tech platforms were used by foreign actors to influence 2016 election. Changes need to be made so this never happens again. https://t.co/77E7e7PXQt"]["I can't support sticking California families with the bill for corporate tax breaks. https://t.co/mzZsW0T53o"]["Eliminating income tax deductions would hurt the middle-class and allow double taxation. Families shouldn't pay for corporate tax cuts."]["It’s unbelievable the lengths Republicans will go to give the rich a tax cut. https://t.co/bhy9GNyWuK"]["Efforts to repeal Affordable Care Act caused confusion. The law has NOT been repealed! RT to spread the word. #GetCovered today! @CoveredCA"]["I’m following the attack in New York closely. My thanks to the brave first responders on the scene. Heartbreaking."]["Tomorrow is a big day, @CoveredCA open enrollment begins! Information on quality health care plans here: https://t.co/SOnKsA4GQG"]["WATCH NOW: Judiciary Committee looks at how Russia used tech platforms to influence 2016 election. https://t.co/WVMAzco4nf"]["How we treat a 10-year-old w/ a disability recovering from surgery says a lot about our country. Rosamaria must be reunited w/ her parents."]["President Trump claims to focus on deporting criminals. In fact, the border patrol targeted a 10-year-old with cerebral palsy. #FreeRosa"]["An ambulance carrying a 10-year-old girl to emergency surgery should NEVER be stopped by the border patrol. #FreeRosa"]["Rosamaria was taken from the hospital by the border patrol. She REMAINS in custody. This is a travesty. #FreeRosa https://t.co/8XjR7ciptR"]["Miembros del Congreso tenemos el poder, y la obligación moral, de ayudar a los #Dreamers. Ya es hora de aprobar el #DreamAct. #Faith4Dream"]["Members of Congress have the power and moral obligation to help #Dreamers. It's time we pass the #DreamActNow."]["The #DreamAct is about protecting our values as a nation. A nation where everyone, including #Dreamers, can live with dignity."]["A federal court has made it clear, Trump’s discriminatory attack on transgender service members will not stand. https://t.co/2aMrnrg8ta"]["Trump advisor George Papadopoulos’ guilty plea outlines Trump-Russia communications. Read my statement: https://t.co/UvHXNUaoUV"]["Read my statement on charges against Trump campaign officials: https://t.co/DcAa0p1kxt"]["Dreamers are nurses &amp; doctors, teachers and business owners. They deserve protection from deportation. #DREAMActNow https://t.co/jKYdBmjv4i"]["A must-read op-ed by @UofCalifornia President Janet Napolitano on the need to protect #Dreamers. https://t.co/gtY3iNMgtR"]["The #CHIP program must be reauthorized as soon as possible. 1.3 MILLION children in California depend on it for their care!"]["Heidi Martinez, a Dreamer from San Diego, works to help U.S. military veterans who've been deported. #DREAMActNow https://t.co/LN7f519Y31"][".@PostOpinions supports our bill to ban bump-fire stocks and calls out the NRA for standing in the way. https://t.co/k6ONmUDvyU"]["Why in the world would we tell medical students that they aren't wanted in America? We must pass the #DREAMActNow. https://t.co/yfpfgRw4en"]["Efforts to repeal the #ACA and Trump administration sabotage have caused widespread confusion. We must help our loved ones #GetCovered! https://t.co/muNLoypOE9"]["Climate change and drought play a role in stronger wildfires—higher temperatures lead to hotter, drier conditions. https://t.co/WtnDlrF2LV"]["It's been nearly 1 MONTH since #CHIP expired. This must be a TOP priority! My letter with @SenKamalaHarris: https://t.co/WMqQot042E"]["This is an immoral travesty. Rosamaria should be released to her parents IMMEDIATELY. https://t.co/iBUP9Ps6p3"]["I told Acting Homeland Security Secretary Elaine Duke that the detention of Rosamaria Hernandez is appalling. https://t.co/Oksy5mAB21"]["We must not resume business as usual after the deadliest mass shooting in history. We’re pushing for policies to reduce gun violence."]["The @49ers and Calif. police unions support my bill to ban bump-fire stocks. We can only win this fight TOGETHER! https://t.co/feDX281Hkz"]["Is America a country that stops an ambulance carrying a 10-year-old girl to emergency surgery? This is outrageous. https://t.co/iBUP9PJHND"]["The Trump administration needs to include wildfire recovery funding in next disaster package and fix fire borrowing. https://t.co/V4l9IOkMhT"]["You can’t argue with the facts. The #TrumpTax plan is nothing more than a massive tax cut for the wealthy. https://t.co/tb6C6fjTMe"]["FACT: A family of four with a $50,000/year income could see their taxes skyrocket under #TrumpTax plan. For me, that’s a non-starter."]["What happened to spendthrift Republicans? #TrumpTax plan slashes tax rates for corporations and the wealthy while driving up the deficit."]["We need to END “fire borrowing,” forcing the Forest Service to cut fire prevention to fund firefighting. Awful! https://t.co/WtnDlrF2LV"]["No family should choose homelessness b/c they fear deportation. FEMA should work to ensure families aren't targeted. https://t.co/UUPrHosoUz"]["Congress should listen to @NatlGovsAssoc and @JerryBrownGov. We MUST reform the way we fund fighting wildfires. We can’t wait any longer. https://t.co/AejUeKTNwe"]["I'll be joining @Plough_Shares soon to discuss Iran, N Korea and reforming US nuclear weapons policies. Watch live: https://t.co/UZXUFsY7Ib"]["We can’t sit by while our communities are ravaged by the opioid epidemic. We need action NOW. Our bill: https://t.co/fzDa5HxZwn"]["Our bill empowers states with $45 billion in long-term funding to address the opioid crisis. Congress should pass it immediately."]["We urgently need solutions to battle the opioid crisis in this country. Every day we lose 91 individuals to this terrible scourge."]["The Background Check Expansion Act is based on a simple premise: If you can’t pass a background check, you shouldn’t be able to buy a gun."]["I’m proud to support the Background Check Expansion Act. Loopholes in current background check system make us less safe. https://t.co/X3tw0mQhHE"]["If a person can’t pass a background check, they shouldn’t be able to buy a gun. RT if you agree."]["#BackgroundChecks on gun purchases are supported by the vast majority of Americans. It should be a no-brainer for Congress. https://t.co/n0kAqn6S35"]["Help #FundTheFight! Every $ from @USPS Breast Cancer Research Stamp helps us find a cure. #BreastCancerAwareness https://t.co/TK8Yv5goIW"]["Republicans sided w/ Wall St. over the American people. Consumers wronged by corporations deserve their day in court https://t.co/IFGACTmn0p"]["When it comes to federal funding, we MUST treat wildfires like other natural disasters. Read our op-ed: https://t.co/WtnDlrF2LV"]["El 94% de los beneficiarios de DACA están estudiando gracias al programa. El #DreamAct continuaría dándoles esa oportunidad #ProtectDreamers https://t.co/iFOQ85Urz8"]["#DACA youth are the best and brightest. Their success leads to AMERICAN success. I won’t stop fighting for #Dreamers. https://t.co/OY9f9CKrlV"]["Let’s empower those who have the potential to make big contributions to our communities. #Dreamers #DreamActNow https://t.co/6Mnzg50UT3"]["HAPPENING NOW: @SenateDems are joining university chancellors and presidents to call for passage of the #DreamAct. https://t.co/igb0a9WHic"]["LIVE at 10:30am EDT/7:30am PDT: Joining college chancellors to advocate for #Dreamers. https://t.co/igb0a9WHic #DreamActNow @UofCalifornia"]["Dreamers are nurses &amp; doctors, teachers and business owners. They deserve protection from deportation. #DREAMActNow https://t.co/jKYdBm1UcK"]["Led by @CityAttorneyLA, 25 members of Prosecutors Against Gun Violence support our bill to ban bump-fire stocks. https://t.co/GZPACA6wRC"]["The disaster relief package provides a down payment on wildfire recovery efforts—I’ll continue to work to ensure full funding gets done."]["The Senate’s aid package will help California rebuild after the most destructive wildfires in state history. https://t.co/DjyM1Jzyu9"]["Dangerous conditions in Southern Calif. have led officials to declare a Red Flag fire warning. Preparation is key: https://t.co/cKH55rF2ua"]["72 years ago today the @UN was established. It remains a strong force for peace and international security. #UNDay"]["Containment of the catastrophic fires in Napa &amp; Sonoma Counties is now well over 90%. We WILL rebuild. California never stays down for long."]["BREAKING: The D.C. Circuit rules that Trump officials can’t block an undocumented 17-year-old from access to abortion care. #JusticeforJane"]["After two years, I still believe Aliso Canyon should be shut down. Public safety must be our primary concern. https://t.co/mC2465IYfS"]["The quest to win the #WorldSeries begins TONIGHT. #ThisTeam is going to make history. Make California proud, @Dodgers!"]["Thank you Chancellor Gary May for giving #Dreamers the power to flourish at @UCDavis! I really enjoyed our meeting today. #DefendDACA https://t.co/F009lEZxQU"]["We can help prevent the next big wildfire, but we have to take action now. Status quo is dangerous, unsustainable. https://t.co/WtnDlrF2LV"]["It's been three weeks since nearly 60 people were slaughtered at a concert. We MUST act. That starts with banning bump-fire stocks."]["The @SFChronicle profiles Enrique, a young #Dreamer: “I’m here to help people. I’m here to uplift communities.” https://t.co/msEAzLHNXi"]["The NRA has a finely-tuned playbook for mass shootings: express openness to change, then work to kill any momentum. https://t.co/ow47ow8SnC"]["Nicolle's story is like that of so many other Dreamers. We must pass the #DREAMActNow. https://t.co/aURcXgeTXH"]["The NRA's \"openness\" to addressing bump stocks was nothing more than a tactic to avoid action. We're not fooled. https://t.co/ow47owqtfa"]["@thehill Our bill would not ban all firearm accessories. Only devices that mechanically increase the rate of fire would be affected."]["@thehill The ATF does NOT have the authority to address bump-fire stocks—and has made this point clear to Congress MULTIPLE times."]["The NRA is flat out wrong about our bill to ban bump-fire stocks. My op-ed for @TheHill: https://t.co/ow47ow8SnC"]["2/2 Need to fix wildfire budget to allow more work on forest health. Otherwise, cycle of destruction will continue. https://t.co/JaKXhvxxu7"]["1/2 The Tubbs fire is now the most destructive in California history. We’ll recover and rebuild, but we also need to plan ahead. https://t.co/Q1ZU0KriIx"]["Congratulations @Dodgers! You knocked off the World Series Champs…now bring that trophy back to California! #ThisTeam"]["Happy Birthday to my good friend, @SenKamalaHarris. One of 2017’s bright spots has been working with you! https://t.co/JRECxGF1DC"]["Young women don’t lose their right to make their own health care decisions just because they are in government custody. #JusticeForJane"]["Today's budget resolution vote made it clear that Republicans have only one priority: tax cuts for the rich. https://t.co/NevbRWoDOw"]["At a MINIMUM, these interviews create the appearance that President Trump may be trying to influence or elicit inappropriate commitments. https://t.co/OUGBmEK7FI"]["It’s appalling that the Trump administration believes women—undocumented or otherwise—don’t have the right to control their own bodies. https://t.co/cXlHjQlnmr"]["President Trump should NOT be interviewing US attorney candidates, especially those from NY—where he has personal &amp; business interests."]["Republicans voted against @SenatorCardin’s amendment to prevent tax reform from increasing our deficit."]["@SenatorHeitkamp The amendment would’ve ensured the middle class doesn’t get hit with the bill for President Trump’s tax cuts for the rich."]["Republicans voted against @SenatorHeitkamp's amendment to protect middle-class families from a tax hike."]["@SenatorCantwell Republicans voted against @SenBillNelson’s and @SenSanders’s amendment to restore $1.5 trillion cut from Medicare and Medicaid."]["Republicans voted against @SenatorCantwell’s amendment to protect the deduction for state &amp; local taxes that California families rely on."]["Republicans have made it clear with their budget they only have one priority: cutting taxes for the rich. During the ongoing budget debate:"]["Always wonderful sitting down to chat with Mayor Libby Schaaf of Oakland. She’s a terrific leader and a great friend. @LibbySchaaf https://t.co/ZyPVLqeZmB"]["The current system for funding wildfire prevention, recovery and forest health is broken. Our bill provides a fix. https://t.co/ehvVpcK2Bc"]["Innovative leadership coming out of the Central Valley. I’ll be following closely, Mayor Tubbs! Stockton is in good hands. @MichaelDTubbs https://t.co/EZO9NecwgG"][".@SenKamalaHarris and I are looking into why counties didn’t use emergency alert system leading up to tragic fires. https://t.co/qFcJ5cVQ6X"]["Proud to stand with @GLAAD on #SpiritDay. We’re making progress on ending bullying and supporting #LGBT youth, but we still have work to do."]["California and other states must have all resources possible when it comes to wildfire prevention and suppression. Read our letter: https://t.co/4dCrwiB1Lj"]["Great op-ed by former ATF director exposing the NRA's bait-and-switch on bump-fire stocks. Legislation needed! https://t.co/3FUsF8u5W3"]["President Trump's attempt to cloak the latest \"Muslim ban\" isn’t fooling anyone—as evidenced by two rulings against it in federal court."]["If President Trump and congressional Republicans scuttle this bipartisan agreement on health care, they’ll own the damage they’ve caused."]["I strongly support the bipartisan bill crafted by Senators Murray and Alexander to mitigate President Trump's sabotage of the ACA."]["For too long, amateur athletics organizations have shirked their responsibility to protect young, vulnerable children. That MUST stop."]["I’m so sorry McKayla has endured this pain. I offer her the same message I’ve given to other victims I’ve met: ‘You’re not alone.’ #MeToo https://t.co/RCFTg1oR3d"]["Trump’s 3rd travel ban is another effort to fulfill his promise of a \"Muslim ban.\" We’ll do all we can to block it. https://t.co/8ZcvKCi5Ht"]["AG Sessions’ Justice Dept. is urging courts to let employers discriminate against LGBT workers. We must not go backward. #SessionsHearing https://t.co/PFJnGPS5Du"]["The family of #SgtLaDavidJohnson deserves our compassion and the thanks of a grateful nation for his sacrifice."]["I told Attorney General Sessions that the Justice Department's failure to protect the right to vote is wholly unacceptable. #SessionsHearing https://t.co/8U0cfsfE6D"]["#Dreamers embody the American spirit and have made positive contributions to the country. I told AG Sessions we should stand by them. #DACA https://t.co/JVt1Oq47f3"]["It’s been two weeks since 58 people were slaughtered at a concert. We owe it to them to take action now! Ban the bump fire stock!"]["On October 17, 1989, we were reminded just how dangerous earthquakes can be and how we all need to be prepared. #LomaPrieta"]["Possible coordination with Trump’s “election integrity commission” casts doubt on Justice Department’s dedication to protect voting rights. https://t.co/YH6s2Xs4Pq"]["Republicans believe they can compensate for their stalled agenda by attacking Democrats on judicial nominations. https://t.co/aRnl5uMAbq"]["We will never end the harassment and abuse of women, especially in the workplace, unless we speak out and stand together. #MeToo"]["Vital meeting today with Salvation Army’s Kenneth Hodder on how to get help to families affected by wildfires. California WILL recover. https://t.co/2q7dnzkljI"]["The Affordable Care Act is not dead or imploding, it still insures millions of Americans. But it IS being sabotaged! #ProtectOurCare #ACA"]["Ending cost-sharing reduction payments INCREASES insurance premiums and INCREASES federal spending. Everyone loses!"]["President Trump: Sabotaging the Affordable Care Act doesn't hurt just Democrats or insurance companies—it hurts all Americans!"]["The entire @UofCalifornia system agrees: Congress MUST act to protect #Dreamers. I’m ready to vote yes on the Dream Act. #DefendDACA. https://t.co/R8RYGoNlFi"]["Great to have lunch with this terrific group of young Californians interning in my DC office. I’m so thankful for all their hard work! https://t.co/rKB9Dh1zoa"]["Home-state senators should have a seat at the table in choosing judicial nominees—not right-wing groups. https://t.co/RT1Q00U7l9"]["Today I visited some of the communities devastated by wildfire. The stories are heartbreaking, but we stand with you. We WILL recover. https://t.co/VsN8YCxuJa"]["?Afectado por los Incendios y buscas apoyo? Llama a mi oficina 415-393-0707. Estamos listos para ayudar."]["If you have been affected by the wildfires, please call my office at 415-393-0707. We are here to help."][".@countyofsonoma envío este guía para las víctimas de los incendios de California y incluye información que beneficia todas las víctimas. https://t.co/K5gljxDYJd"][".@CountyofSonoma sent out this updated guide on resources for wildfire victims, includes good info for other counties affected by wildfire. https://t.co/ATWhmNoF4b"]["Trump has said he has litmus tests for judicial nominees. The \"blue slip\" is the last defense against extreme picks. https://t.co/RT1Q00U7l9"]["Middle-class consumers who don’t receive financial help to buy insurance will be hit hardest by ACA sabotage. They will pay 25% more."]["FEMA proporciona asistencia individual para los residentes de Sonoma/Napa. Aplique aquí https://t.co/bivuaYVSJc o por telefono 800-621-3362."]["4/4 Working to get this expanded to all counties hurt by wildfire. In the meantime, if you need assistance, call my office at 415-393-0707."]["3/4 For those who use 711 or Video Relay Service (VRS), call 800-621-3362."]["2/4 For individuals with a speech disability or hearing loss and use TTY, call 800-462-7585."]["1/4 FEMA is providing individual assistance to Sonoma and Napa residents. Apply at https://t.co/eNYIs6G5oX or by the phone at 800-621-3362."]["The federal government will spend $2.3 billion MORE on tax-credit subsidies due to the president’s sabotage of the ACA."]["President Trump is hurting millions of people to send a political message. It's appalling. https://t.co/uC0tqNcDo1"]["For 100 years, home-state senators have played a role in judicial nominations. My @PostOpinions op-ed on blue slip: https://t.co/RT1Q00U7l9"]["IMPORTANT: ICE won't conduct enforcement in areas affected by fires. Immigrants shouldn't be afraid to seek help. https://t.co/yoUJFJes7s"]["6/6 We already have one nuclear crisis on our hands, we don’t need another."]["5/6 It’s the United States, not Iran, that will have broken its commitments, further damaging our credibility on the international stage."]["3/6 Our national security experts and the international nuclear inspectors all agree that Iran is living up to its commitments."]["2/6 Leaving the Iran nuclear agreement now would only undercut our ability to solve future diplomatic crises, including North Korea."]["1/6 President Trump's decision to weaken the Iran nuclear agreement is reckless and irresponsible. https://t.co/XJLINSnc3E"]["@CAL_FIRE @Cal_OES 6/6 And if you are affected by the wildfires, please don't hesitate to contact my office at 415-393-0707. We're here to help."]["5/6 Follow @Cal_Fire and @Cal_OES along with your local news for updated information about the fires and possible evacuations."]["4/6 Have a plan, be ready to go and leave immediately if you’re evacuated. https://t.co/uGFPLaOM93"]["3/6 Right now, we all agree the most important thing for you to do is follow any evacuation order. It's imperative that you get out safely."]["2/6 There's no doubt this is the worst fire season in our history. However, I'm confident that California can get through this together."]["1/6 I've stayed in constant contact w/ Governor Brown and his staff, Congressman Thompson and CalFire Chief Pimlott about the #NorCalFires."]["Make no mistake: The Trump administration is intentionally making Americans pay more for their insurance. Congress MUST act! https://t.co/s4QmfP8Wzp"]["Keep listening to your local news and follow @CAL_OES and @CAL_Fire for the latest updates on the wildfires. https://t.co/KAxQQuM5kR"]["If you need assistance due to the wildfires, please call my San Francisco office at 415-393-0707. My staff and I are here to help."]["If you don't have a plan, now is the time to make one in case you're evacuated due to wildfire. Follow these steps: https://t.co/uGFPLaxaKt"]["The Trump administration is ramping up efforts to break the insurance market. We must focus on protecting the ACA. https://t.co/YTroDErA6C"]["Firefighters are working nonstop to put out the wildfires. Please stay vigilant and monitor your local news for evacuation announcements. https://t.co/dKNcG9ajJG"]["Thank you to all of our first responders for their heroic efforts fighting these wildfires. https://t.co/4CqiNcurSL"]["It warms my heart to hear Caitlan, Josh and their children are coming home after being held the last five years in captivity by the Taliban."]["Good news! By a vote of 151-3, the Massachusetts House voted to ban bump-fire stocks. https://t.co/DKAxIfyhpL"][".@JudiciaryDems won't accept stonewalling by AG Sessions. Our letter on executive privilege, led by @SenWhitehouse: https://t.co/V2zkwfMwC3"]["Please stay safe. More strong winds are expected this evening. Keep monitoring your local news and follow any evacuation orders."]["Wildfire info, including evacuation center locations &amp; how to sign up for emergency alerts, can be found here: https://t.co/wP6PIysINU"]["Ten House Republicans have now signed onto legislation banning bump-fire stocks. It’s a sign that we’re making progress!"]["Paying for tax cuts for the rich on the backs of middle-class families isn’t something I can support. https://t.co/PDUsh5gZkg"]["Today is #NationalComingOutDay! My message to LGBT youth: We love and accept you for who you are. Don’t be afraid to be true to yourself!"]["We're here &amp; ready to help. If you need immediate assistance due to the wildfires, please contact my San Francisco office at (415) 393-0707."]["If you live near the fires, start preparing now in case you have to evacuate by following this guide by @Cal_Fire: https://t.co/uGFPLaOM93"]["3/3 Fact: During the Obama administration, 18 judicial nominees were blocked because they did not receive blue slips."]["2/3 Fact: During the administrations of Presidents Obama, Bush and Clinton, not ONE judge was confirmed without two blue slips."]["1/3 Home-state senators should play a role in choosing judicial nominees, NOT special interest groups. My statement: https://t.co/EKqXsZjypU"]["The ATF lacks authority under the law to ban bump-fire stocks. Period. Legislation is the only answer and Congress shouldn’t pass the buck."]["3/3 You can get the latest information about the wildfires from @Cal_Fire and @Cal_OES."]["2/3 Please follow evacuation orders and all instructions from state and local officials. We must do everything we can to save lives."]["1/3 As of this morning, there are 115,000 acres still burning around the state. I'll continue to monitor the situation closely. https://t.co/IShNAOLjQT"]["The @FresnoBee says our bill to ban bump-fire stocks is a \"no-brainer.\" I agree! https://t.co/w5JQTznnOX"]["Some Republicans say they never heard of bump-fire stocks. I discussed them at length at a 2013 hearing. WATCH: https://t.co/IUKuu5YNYK"]["I joined @MeetThePress to discuss our bill to ban bump stocks, which allow weapons to reach automatic rates of fire. https://t.co/2lrcN8aDLO"]["The fact that our current laws couldn't stop the Las Vegas gunman from buying dozens of weapons and bump stocks shows they need an update."]["The president's decision to repeal the Clean Power Plan ignores reality. Climate change is happening &amp; we must act.  https://t.co/xDUpyKbyoR"]["New technology has made the legal definition of machine guns largely obsolete. That’s why our laws need an update."]["4/4 Our bill does NOT blur the line b/t semi-automatic &amp; automatic weapons. It only affects devices that mechanically increase rate of fire."]["3/4 Our bill would NOT ban semi-automatic weapons. It would ONLY apply to devices that increase the rate of fire of semi-automatic weapons."]["2/4 ATF does NOT have the authority to ban bump fire stocks under the National Firearms Act because they are not legally machine guns."]["1/4 As expected, the gun lobby is spreading falsehoods about our bill to ban bump-fire stocks. Let me set the record straight."]["If you need immediate assistance due to the wildfires, please contact my San Francisco office at (415) 393-0707. We are ready to help."][".@SenKamalaHarris and I called on President Trump to expedite aid to those affected by California's wildfires. https://t.co/4w44E03aYg"]["Sonoma County has a complete list of which evacuation centers still have room. https://t.co/Es9TVjPmt9"]["Stay safe! Updated information about the wildfires, including evacuation center locations, can be found here: https://t.co/wP6PIyb7pk"]["Don't wait, prepare now in case you're evacuated due to wildfire. Follow these tips from @CAL_FIRE to be ready: https://t.co/R3dEuJfZib"]["Thank you to our first responders for their heroic efforts fighting these wildfires. Follow @CAL_FIRE &amp; @Cal_OES for the latest info."]["#DACA recipients shouldn't be a political football. My statement on the Trump administration's draconian demands: https://t.co/Q3CXPMS7sS"]["3/3 Please follow @Cal_Fire and @Cal_OES for the latest information about wildfire evacuations and how to get out safely."]["2/3 If you are in an evacuated area, please get out now. These are swiftly moving fires that pose a serious threat to your life and safety."]["The ATF has clearly told Congress that it does NOT have the legal authority to ban bump fire stocks. Legislation is needed."]["My thoughts are with everyone affected by the #NapaFire and #SonomaFire. Stay safe and follow evacuation orders. https://t.co/CrYtHWfLM1"]["We agree that civilians shouldn't have machine guns. We should agree on banning accessories that allow weapons to fire like machine guns."]["A ban on bump fire stocks could have saved lives in Las Vegas by reducing the gunman's rate of fire. We MUST take action!"]["The @nytimes analyzed the Las Vegas gun fire. The shooter fired about 90 rounds in just 10 SECONDS. https://t.co/Nu3kPvIM0y"]["Major Cities Chiefs, a leading law enforcement organization, supports closing the bump fire stock loophole and S. 1916!"]["An American concert venue should not look like a battlefield. Enough is enough! Let’s take commonsense steps to reduce gun violence."]["The Las Vegas shooter passed background checks. He bought dozens of weapons and bump fire stocks. Our gun safety laws need an update."]["Our bill is simple. Accessories that allow semi-automatic weapons to function like machine guns are banned. Read it: https://t.co/aG4W36b7w4"]["Speaker Paul Ryan, an avid hunter, acknowledged he is not aware of any hunting purpose for bump fire stocks."]["9 minutes. That's how long it took the Las Vegas gunman to kill nearly 60 people and injure 500 more. We can't allow this to continue."]["164 congressmembers support Rep. @DavidCicilline's bill to ban bump fire stocks. Urge your representative to support H.R. 3947!"]["Automatic weapons have been banned for 30 years. We should all agree on the need to update our laws to maintain that ban."]["The gun lobby says that the ATF has the authority to ban bump fire stocks. That's NOT TRUE. The ATF has made clear legislation is needed."]["38 senators support our bill to ban bump stocks. We're making progress, but we need your help. Urge Republican senators to support S.1916!"]["Semi-automatic rifles fire between 45 and 60 rounds/minute. A bump stock increases the rate of fire to between 400 and 800 rounds/minute."]["Bump fire stocks allow semi-automatic weapons to reach rates of fire of between 400 and 800 rounds PER MINUTE."]["Las Vegas shooter outfitted 12 semi-automatic weapons w/ bump stocks. No law on the books would have stopped him from buying bump stocks."]["FACT: Legislation is needed to ban bump stocks. This CAN’T be done through regulation."]["Technology like bump stocks has made the current definition of automatic weapons largely obsolete. That’s why we MUST update our laws."]["The @latimes supports our effort to ban bump stocks and says that the gun lobby should back our bill. https://t.co/Jyvde5dWfo"]["The Justice Department has AGAIN reversed itself on an important issue of civil rights and fundamental fairness. https://t.co/O4NRm38IBV"]["FACT: The ATF in 2010 made clear that it did NOT have authority to regulate bump stocks under the Gun Control Act or National Firearms Act."][".@SFChronicle supports our effort to ban accessories that allow semi-automatic weapons to mimic automatic weapons. https://t.co/rgwhysOFwg"]["I’ll continue to support manufacturing in Calif. A strong manufacturing industry is vital to middle-class success. https://t.co/FJ9hyjnQPx"]["Manufacturing is on pace to create 3.5 million new jobs over the next decade. We need to help fill those open positions. #MFGDay17"]["Rolling back the contraceptive coverage requirement take us backwards and shows utter disregard for women’s health. #HandsOffMyBC"]["In California, manufacturing jobs pay double the state average. Let’s find ways to bolster this vital industry. #MFGDay17"]["The Affordable Care Act's contraceptive coverage requirement has saved women $1.4 billion per year. https://t.co/BuON2PRp7J #HandsOffMyBC"]["Thank you to the Nobel Peace Prize winners for their persistent efforts to create a nuclear-free world. \nhttps://t.co/gXCf1ky1pQ"]["Manufacturing is key to the U.S. middle class and California's economy. Read my op-ed: https://t.co/FJ9hyjnQPx #MFGDay17"]["#DACA youth are leaders, thinkers and doers. They represent the best of the next generation. Their success is American success. #HereToStay"]["I won’t stop speaking out in support of #DACA youth. These are young people looking for ways to succeed &amp; contribute to society. #DefendDACA"]["Leaving the Iran nuclear agreement divides us from our allies and creates a 2nd nuclear crisis we don’t need. https://t.co/Hb18qftGPB"]["Scrapping Iran agreement would demonstrate we don’t keep our word, making it difficult to reach a diplomatic resolution with North Korea. https://t.co/FdKgS7Lace"]["Today marks the final day for #DACA recipients to renew benefits. Watch my remarks on the importance of DACA: https://t.co/lHoWyLG8lT"]["Our commonsense proposal: A background check must be completed before gun sales go forward. https://t.co/zjZdo8GpfI"]["In the aftermath of the Equifax hack, scammers are out in full force preying on those concerned with the security of their personal information. \n\nWe’re asking FTC: What’s being done to stop this? \n\nhttps://t.co/7HO5hDC65m"]["There’s agreement that automatic weapons should be illegal. There should also be agreement that accessories that allow weapons to mimic automatics should be illegal."]["My message to Americans: Stand with us and demand action. It’s the least we can do to honor the nearly 600 people killed or injured in Las Vegas."]["We will not sit idly by when a concert venue in America is turned into a battlefield. We must take action to prevent gun violence."]["Columbine, Virginia Tech, Tucson, Aurora, Newtown, Charleston, Roseburg, San Bernardino, Alexandria, Las Vegas. We can’t allow this to keep happening in our country."]["Automatic weapons are illegal, but devices like bump stocks that modify a gun to fire at fully-automatic rates ARE legal. That makes no sense. We introduced a bill today to close that loophole. \n\nhttps://t.co/YYAJADDovR"]["Congratulations @CalTech scientists Dr. Kip Thorne &amp; Dr. Barry Barish on being awarded the Nobel Prize in physics! Your work on gravitational waves has revolutionized the way we view the universe. Science will build off your discoveries for years to come. https://t.co/sTaWCzsR15"]["After a mass shooting is EXACTLY the right time to talk about gun safety. If not now, when? To my Republican colleagues, I beg you—stand up to the NRA!"]["I’m looking at ways to proceed with legislation to ban bump fire stocks and close this ridiculous loophole for good. Doing nothing in the wake of this tragedy is not an option."]["Automatic weapons are illegal, but individuals are still able to purchase bump stocks to allow semi-automatic weapons to fire up to 800 rounds per minute—the rate of automatic weapons—and inflict maximum carnage."]["In the wake of the deadliest mass shooting in U.S. history, Congress must examine ways to prevent tragedies like this from happening in the future."]["The average #Dreamer came here at just 6 years old. These are motivated individuals with a lot of potential. They embody a bright American future. #DefendDACA"]["#DACA participants are highly-motivated individuals brought here through no choice of their own. Let’s help them unleash their potential and contribute to the only country they’ve ever known. #DefendDACA"]["76% of Americans agree: #Dreamers deserve a path to citizenship. Congress MUST work together to pass the #DreamAct."]["#DACA youth are living, working and being educated in California and throughout the country. They are American in every way that matters. Their success is good for our country."]["This morning at 10am EDT/7am PDT, the Senate Judiciary Committee hears from Denisse Rojas, a young woman who embodies the importance of the #DACA program. \n\nRead more about Denisse here: https://t.co/0vj1yKPagY #Dreamers"]["My full statement on the senseless tragedy in Las Vegas: https://t.co/j3Kkaq6D1n"]["Health care for 9 million children is now threatened by the lapse in the Children's Health Insurance Program. We MUST #ExtendCHIP!"]["The goal of tax reform should be helping working families, not the top 1 percent.  #NotOnePennyMore"]["FACT: The Trump administration's sabotage campaign is leading to HIGHER insurance premiums in the individual market"]["The richest Americans don’t need a tax cut paid for by middle-class families. RT if you agree. #NotOnePennyMore"][".@SenKamalaHarris and I wrote about the danger posed by President Trump's health care sabotage. Learn more: https://t.co/aa13yoWH5U"]["President Trump could save $1 BILLION under his tax plan, while middle-class Californians could pay more. https://t.co/3DW4lARE27"]["American citizens in Puerto Rico need assistance. We must commit more federal resources and personnel to expediting recovery efforts."]["(3/3) I want CalFresh to have resources it needs to help feed California—including the 1 in 5 children in our state that faces hunger daily."]["(2/3) Our state’s version of SNAP, called CalFresh, is key in the fight to end hunger and fed more than 4 million Californians last year."]["(1/3) Today marks the 40th anniversary of the Supplemental Nutrition Assistance Program, a vital, successful program for feeding Americans."]["The Children’s Health Insurance Program ensures that 800,000 kids in California get quality care. We must fund #CHIP now."]["#DACA RECIPIENTS: Extension applications MUST BE RECEIVED by Thursday, October 5. Don’t delay, mail your application ASAP. #DefendDACA"]["Funding for the Children's Health Insurance Program may lapse because Republicans prioritized repealing the #ACA. That's shameful!"]["Our fight to protect health care isn't over. We MUST extend the Children's Health Insurance Program and prevent sabotage of the #ACA."]["Senate passed our resolution supporting collaborative workforce development strategies to boost job growth and promote sustainable career pathways. Great news. https://t.co/Ja45PeYBNX"]["We’re calling on the president to do more to address the humanitarian crisis in Puerto Rico, U.S. Virgin Islands. https://t.co/hR0gOg4EVv"]["I received a briefing from Chief Ken Pimlott on the wildfire season. I’m committed to ensuring @Cal_Fire has all the resources it needs. https://t.co/WJJPzC2YHe"]["This month we stand with the 100,000 Americans affected by #SickleCell disease. Your bravery is truly inspiring.  https://t.co/h3WvUgsMdf"]["ATTENTION: Applications to extend #DACA must be RECEIVED by Thursday, October 5. Please mail your application as soon as possible."]["Thanks for stopping by, can’t wait for the Silicon Valley BART extension! https://t.co/d2Jt6pqejE"]["The Republican tax plan is nothing more than a tax cut for the rich! It’s another backroom GOP proposal, with no input from Democrats or the public, that will leave working Americans worse off in order to benefit the rich. A real nonstarter! https://t.co/PXGDeyPJGR"]["Much of Northern California under #RedFlagWarning for dangerous fire conditions. Learn more about fire prevention from @Cal_Fire. https://t.co/9NWAq5V3Wu"]["#GrahamCassidy has been consigned to the dustbin of history—right where it belongs! https://t.co/K9NozcUAqf"]["(2/2) We must focus on promoting sustainable career pathways for the modern workforce. Job growth depends on it. https://t.co/Ja45PeYBNX"]["(1/2) This month we’re recognizing the importance of collaborative workforce development that emphasizes economic prosperity for all."]["BREAKING: Senate Republicans will NOT vote on the terrible #GrahamCassidy bill. Thank you everyone who made their voices heard! We did it!"]["Our fellow citizens in Puerto Rico have been devastated by Hurricane Maria. Federal funds should be approved as soon as possible."]["The federal guarantee that those with pre-existing conditions are not charged exorbitant premiums should be NON NEGOTIABLE. #GrahamCassidy"]["Home-state senators should play a role in choosing judicial nominees, NOT special interest groups. #DefendBlueSlips https://t.co/XvXCwM5pTA"]["#GrahamCassidy is devastating for women’s health: Ends guarantee that maternity care and contraception are covered."][".@StephenCurry30 &amp; @Warriors, the president doesn’t know what he’s missing—you’re always welcome in the Senate! Hope to see you in February."]["California has done everything to make the Affordable Care Act work well. #GrahamCassidy punishes our success."]["#GrahamCassidy is an attack on California. Read more here via @LATimes: https://t.co/40dVgk6KCN"]["Read my letter to California House Republicans: Put the people of our state above politics—oppose #GrahamCassidy. https://t.co/aH5RON1BCs"]["#PAYGAP UPDATE: Women still make on average 80 cents for every $1 a man makes. Let’s continue to strive toward #EqualPay for equal work. https://t.co/TeiXs6Y88O"]["Conway Collis is right: Let’s do more to reduce poverty in California. Children and families are depending on us. https://t.co/eu8HzEAbaQ"]["(2/2) I’ll continue to work in the Senate to protect victims of campus sexual assault. We can’t give up the fight. #TitleIX"]["64% of Medicaid funds in California cover those with disabilities and in nursing homes—the most vulnerable. We must not cut Medicaid!"]["Supporters of #GrahamCassidy say it will lower premiums. NOT TRUE! They will spike 20% under #GrahamCassidy."]["Under #GrahamCassidy, states decide whether insurance companies cover your care. Cancer treatment, even asthma, may not be covered!"]["Over the next 20 years, #GrahamCassidy would cost California $800 BILLION. This would be absolutely crushing financially."]["This provision of #GrahamCassidy says states can allow insurers to charge sick people much more for coverage. Terrible! https://t.co/zSeIj2Iecw"]["FACT: This provision of #GrahamCassidy says that states can allow insurers to spend less on care &amp; more on administration and CEO salaries. https://t.co/AGBilWILrw"]["Between 2020 and 2027, California would be forced to pay $129 billion more to offset the loss of federal funds from #GrahamCassidy."]["California is the biggest loser if #GrahamCassidy passes. A 13% cut in federal funds amounts to a $129 billion loss by 2026!!"]["FACT: This provision of #GrahamCassidy says states can allow insurers to stop covering essential health care like maternity care. #SaveACA https://t.co/nD585k7MjB"]["Jimmy Kimmel has become a California hero for exposing the worst of the latest Republican “health care” bill. https://t.co/brzqTQOfur"]["Our state’s first-class children’s hospitals depend on Medicaid. Without Medicaid, they’ll need to reduce services and maybe even CLOSE!"]["Medicaid covers 1 in 3 Californians, including children, seniors in nursing homes and those with disabilities. We MUST protect it."]["To vote without a Congressional Budget Office analysis of what #GrahamCassidy does to coverage &amp; premiums is irresponsible and inexcusable."]["American people MUST be active. Get on the phones. Call Republican senators at 202-224-3121. #ProtectOurCare!!"]["You’d expect Senate Republicans’ 4th attempt at a “health care” bill to be better. Instead, #GrahamCassidy is the WORST!"]["#GrahamCassidy replaces the ACA’s federal guarantee of protections for pre-existing conditions with vague assurances. Don’t be fooled!"]["One of the #ACA's most important provisions said that insurance companies couldn’t sell junk plans. #GrahamCassidy brings them back."]["Wishing everyone celebrating #RoshHashanah a very happy new year. Shanah Tovah!"]["Thank you Alyssa and Debra for helping to spread the word that California would be hit harder than ANY other state under #GrahamCassidy. https://t.co/le55yjrCkV"]["Californians stand ready to help in any way we can. Thank you, Los Angeles County! @LACo_FD https://t.co/k9BAhlVF4S"]["Jimmy Kimmel, whose son was treated at @ChildrensLA, did a good job summing up everything wrong with #GrahamCassidy. https://t.co/cZznSP7roS"]["(2/2) Let’s empower federal agencies to get ahead of what could be another catastrophic fire year. https://t.co/YU6YuDgOVk"]["(1/2) Devastating wildfires have already burned millions of acres and fire season isn’t over. We must fix a BROKEN fire prevention system."]["(3/3) Senate should pass our bill that strengthens our ability to prepare for &amp; respond to destructive earthquakes. https://t.co/w67HPVgqDL"]["(2/3) We must acknowledge the same could happen here at home anytime, and we have to be #QuakeReady."]["(1/3) The scenes from Mexico City are heartbreaking. I’ve lived through deadly earthquakes and my thoughts are with everyone affected."]["#GrahamCassidy takes health funding from California and gives it to red states. California shouldn’t be punished. It's appalling! https://t.co/jpTcdPEQEL"]["Here’s a key point on #GrahamCassidy: It shifts a larger and larger portion of health care costs onto states, crushing them financially. https://t.co/lNw85cooKe"]["Previous CBO scores of their bills showed up to 32 million losing health care. The new Republican solution is to not wait for another score."]["NEW: The CBO will not be able to analyze the effects of #GrahamCassidy on coverage and premiums by September 30. NO SCORE, NO VOTE!"]["I’m committed to protecting community health center funding. 50,000 jobs, health care for 9 mil. Americans at stake. https://t.co/7btFn72i2D"]["(3/3) Keep up your energy, California. We CAN’T let our guard down. We won’t stand for the Trump’s assault on our national monuments."]["(2/3) We only found out Trump administration plans for gutting monuments from a leaked memo. Why no transparency? #Monuments4All"]["(1/3) The lack of transparency by Trump’s Interior Dept. has been concerning for the entire monument review process. https://t.co/OqZidcGiid"]["The UN is a venue to promote peace. Today, the president used it as a stage to threaten war. https://t.co/LFMAFNSW0K #UNGA"]["For #HispanicHeritageMonth, join me in honoring the countless contributions to our nation by the Latino community. https://t.co/pzFQaOLrZU"]["Republicans know the only way they have a chance to pass #GrahamCassidy is if the American people know as little as possible. It’s insanity!"]["It’s unbelievable to me that Senate Republicans would abandon bipartisan efforts to improve the Affordable Care Act for this awful bill!"]["California would be forced to pay more than $57 BILLION more by 2027 to offset the loss of federal health care dollars. Crushing!"]["The latest Republican “health care” bill is an absolute disaster. My statement on #GrahamCassidy: https://t.co/jXugH3F4v0"]["I thought the president’s Sunday morning tweet depicting an attack on Hillary Clinton was appalling and disgusting. https://t.co/WVIXjJh26b"]["Joined @CNNsotu yesterday to discuss North Korea, the Russia investigation and our efforts to protect #Dreamers. https://t.co/twobLmTo6X"]["The Graham-Cassidy \"health care\" bill hits states that expanded Medicaid especially hard. That means California. We MUST defeat this bill!"]["A top priority between now and September 30 must be defeating the Graham-Cassidy bill. #SaveACA"]["The latest ‘health care’ bill—Graham-Cassidy—is much like the four that came before it: 32 million would lose coverage."]["Here’s what you need to know about the Graham-Cassidy bill: It would disproportionately hurt California and take away billions."]["Republicans have until September 30th to pass a bill to repeal the Affordable Care Act. We can’t lose focus. #SaveACA"]["ATTENTION: Senate Republicans may try to repeal the Affordable Care Act and gut Medicaid AGAIN. Time to make calls!"]["I’m closely monitoring the San Diego County Hepatitis A outbreak. Resources on prevention can be found here: https://t.co/EEthkz35kR"]["1 in 5 U.S. families spend 25% of their income on child care. That’s unacceptable. Time for change. #ChildCare4All"]["@JerryBrownGov @GavinNewsom @Rendon63rd 6/6 The heart of the Mojave Desert is at stake. We must #StopCadiz and the Trump administration from destroying what makes it special. https://t.co/PmE7fGkzJS"]["5/6 Tell them \"I stand with @JerryBrownGov, Lt. Gov. @GavinNewsom &amp; Speaker @Rendon63rd in fighting for the desert.\" https://t.co/LUQRYoFvjC"]["4/6 Tell your state Senator you demand a vote on AB 1000 to #StopCadiz from robbing the Mojave Desert of its most precious resource – water."]["3/6 AB 1000 is currently being blocked in a state Senate committee. The full Senate should get to vote. We need your help today!"]["2/6 The state legislature has just two days left to pass AB 1000, a bill to #StopCadiz from draining a desert aquifer for private profit."]["1/6 The Mojave Desert is being threatened by Cadiz and its friends in the Trump administration. California can #StopCadiz if we act now."]["Sending my best wishes to the Marines injured at Camp Pendleton—a reminder of the sacrifices made daily by our brave servicemembers. https://t.co/X7yANTXeef"]["Child care costs are a crushing burden for so many families. Our bill would help address this growing problem. #ChildCare4All"]["The Trump administration MUST consult Congress on the number of refugees to be admitted. My letter w/ @SenatorDurbin https://t.co/xs5kNtAwYS"]["I’m committed to expanding health care that ensures healthy pregnancies and reliable maternity coverage for women across America. https://t.co/mXYF659EEe"]["Welcoming those from countries facing war and disaster is an ideal sewn into America’s fabric. Lowering the refugee cap is just plain wrong."]["Equifax fails to protect info of 143 million people—now we’re hearing execs sold off stocks. Unbelievable. There MUST be an investigation. https://t.co/B92llNIEJm"]["More than 8 million acres have already burned in the West this year due to wildfires—many currently burning in Calif. #SalmonAugustComplex https://t.co/ACIizRlvQL"]["Edith Windsor made this country better. Her courage means millions of Americans can now marry the person they love. #LoveWins"]["To those in high-risk areas, wildfire smoke poses serious health concerns. Good info from American @LungAssociation: https://t.co/sDvJDnEWZk"]["Always great to see my friends from @CalHospitals. We had a good discussion on protecting access to health care for California &amp; the nation. https://t.co/51JVu70rN2"]["I support @AGBecerra’s decision to take legal action to #DefendDACA. We must protect the 223,000 #Dreamers in our state. https://t.co/aBcQMlDS8X"]["Leaders from across CA agree: State Senate must pass AB1000 to protect Mojave from Trump’s disastrous pet project. https://t.co/LUQRYoFvjC"]["Ending veteran homelessness must be a priority. @DeptVetAffairs is doing its part with $188 million in grants. https://t.co/QmKcIqlt0c"]["On the 16th anniversary of the #September11 attacks, we reaffirm our pledge to honor the victims and the bravery of the first responders."]["Wishing California a very happy birthday! On this date in 1850, California became the 31st state. #OTD"]["3/3 The future of the Mojave Desert is at stake. The California Senate can still #StopCadiz by passing AB 1000 before Sept 15."]["2/3 California can stop this assault on our public lands by passing AB 1000. The votes are there but it's being blocked in the state Senate."]["1/3 Great op-ed! Trump admin. will stop at nothing to muscle through the Cadiz project. We must fight back. https://t.co/6PpMY6LhM2"]["IMPORTANT: DHS says DACA recipients MUST renew by October 5 if their status expires btw September 5 and March 5.  https://t.co/45PSZ5gYnk"]["(2/3) This tragedy reminds us that we must do everything we can to prepare, respond and recover from earthquakes. #QuakeReady"]["(1/3) This morning, my thoughts are with those in Mexico affected by the devastating earthquake near Tres Picos. https://t.co/xn0KEfRt5Z"]["(3/3) Today's vote was important. The public deserves to know where all their representatives stand on climate change. We must act!"]["(2/3) U.N. climate funding is key. The climate is changing now—oceans warming, stronger hurricanes, melting ice caps—and we must act."]["(1/3) Great news: The Appropriations Committee voted today to fund the U.N. climate change panel. https://t.co/25TD3YJ61N #ActOnClimate"]["BREAKING: Senate Appropriations Committee just voted to restore vital funding for the UN climate change panel—a big victory. #ActOnClimate"]["I was heartbroken by the deportation of Maria and Eusebio Sanchez and am pushing a bill to reunite their family. https://t.co/5GV3cyl3U5"]["If a nominee doesn't receive blue slips from both senators, the Judiciary Committee shouldn't move forward. https://t.co/u07JO3K2F4"]["Protecting #DACA recipients isn’t a matter of politics or economics. It’s about what’s right as Americans and human beings. #HereToStay"]["#DACA recipients deserve certainty NOW—not six months from now. They trusted our government, and it’s time to stop playing with their lives."]["I spoke on the Senate floor about the many contributions made by #Dreamers. They must be protected. #HereToStay https://t.co/kKANsXkAqJ"]["Failure to protect young people who’ve come out of the shadows would constitute an abject moral failure. #DefendDACA https://t.co/tUFnjONb9B"]["Contributions made by #DACA youth help the ENTIRE nation. We should be doing all we can to unleash their potential. #DefendDACA https://t.co/oBxDtIy2eN"]["I was proud to vote to advance the DREAM Act in 2007 and 2010. I’d be even more proud to vote “yes” today. Give us a vote! #DefendDACA"]["(4/4) #DACA youth have pursued their dreams, becoming doctors, engineers and teachers. They’re American in every way that matters. #SaveDACA"]["(3/4) Calif. is home to nearly 223,000 DACA recipients, more than any other state. Their contributions are an important part of the economy. https://t.co/S5iinchZIz"]["(2/4) Congressional action is now the only way to protect DACA recipients. The #DreamAct deserves a vote as soon as possible. #DefendDACA"]["(1/4) To #DACA youth across the country, I say this is not over. I stand with you and your families. You are valued. https://t.co/tUFnjONb9B"]["Thanks for doing the right thing Tim and standing by these impressive young people. Your voice is vital in the fight to #SaveDACA. https://t.co/2b5qv5kFBS"]["Happy #LaborDay! Thank you to our nation's workers. We're grateful for all that you contribute to our country."]["Congress MUST act to protect #DACA recipients. I'm ready to vote \"YES\" on the DREAM Act!"]["There are more #DACA recipients in California than in any other state. We stand with them. We have their backs. #HereToStay"]["#Dreamers are Americans in every way that matters. They are our future. #SaveDACA"]["#DACA recipients have done everything that the federal government has asked of them. They don't deserve to live in fear. #HereToStay"]["It's deeply disappointing that AB 1000, a bill to protect the Mojave Desert, was blocked. My statement: https://t.co/aGZXVxG8V7 #StopCadiz"]["BREAKING: Tennessee's attorney general urges Congress to protect Dreamers. Let's pass the #DREAMAct! https://t.co/NY7VqCH8Bn #DACA"]["@JerryBrownGov Lt. Governor @GavinNewsom also supports the bill to block Cadiz—a Trump pet project! We must #StopCadiz. https://t.co/0XLwqWqL5O"]["State legislators should look toward the leadership of @JerryBrownGov. Let’s preserve the Mojave for generations to come—AB 1000 must pass! https://t.co/xZK1xwJ3ST"]["Legislation to provide #DACA recipients permanent protection from deportation—and eventual citizenship—MUST be on the Senate's agenda."]["(3/3) Learn more about how the Cadiz project could destroy the Mojave desert in our op-ed: https://t.co/nSqXRE360l"]["(2/3) Special interests have been pushing the Cadiz project for YEARS. We can't let them kill a bill that would block it."]["(1/3) President Trump's pet project could destroy the Mojave desert. The state legislature MUST pass AB 1000."]["#DACA unleashes the potential of youth brought here through no fault of their own. Their success enriches the economy AND society. #SaveDACA"]["Failure to protect young people who have come out of the shadows and enrolled in #DACA would constitute an abject moral failure. #SaveDACA"]["California is home to more Dreamers than any other state—222,000 impressive young people. We MUST #SaveDACA!"]["#Dreamers, I’ll always stand with you. We’re in this together. Never stop chasing your goals and keep making your voices heard! #SaveDACA"]["State legislators need to step up and help protect our desert from Trump. Pass AB 1000 now! https://t.co/nSqXRE360l"]["Arpaio has long history of racial profiling—his pardon sends message to law enforcement that racial profiling is ok. https://t.co/UIvry5suB2"]["National Guard members who answered the call of duty will keep the bonuses they earned—the right decision by DoD. https://t.co/sK3rf3VAP6"]["Californians interested in helping those affected by devastating Texas floods can make a donation through @RedCross. https://t.co/WOVE3J8am5"]["On #WomensEqualityDay, let’s recommit ourselves to a society where young women aren’t held back from achieving their dreams."]["For years Sheriff Arpaio systematically violated civil rights. President Trump indicates he approves of that behavior with this pardon."]["Sheriff Arpaio should not have been pardoned. A pardon for his conduct demonstrates flagrant disregard for the rule of law in this country."]["All Americans who are fit and willing  should be able to serve their country in the military. #ProtectTransTroops"]["Calls by President Trump and Senate Republicans to split the Ninth Circuit are a political response to decisions they don’t like."]["Splitting the Ninth Circuit is unnecessary and would waste taxpayer dollars. https://t.co/DHR7EA6gza"]["(2/2) Dreamers are an vital part of the fabric of our communities. They have contributed to our country and deserve to live without fear."]["(1/2) To all the Dreamers in California and across the country, I stand with you. #HereToStay #SaveDACA"]["California will fight any attempt by President Trump to eliminate protected parkland. #KeepItPublic https://t.co/7DAcgxuQTr"]["Great news: A court again blocked Texas’s discriminatory voter ID law. It should be easier to vote, not harder. https://t.co/YWctVcZtcD"]["Another year, another terrific #TahoeSummit. With our ongoing public-private partnership, Tahoe’s future is bright. https://t.co/o1RWp1XMio"]["@TahoeAgency (3/3) Our public-private partnership is committed to reducing pollution, improving lake clarity &amp; protecting ecosystems in the #Tahoe area."]["@TahoeAgency (2/3) The temperature of Lake Tahoe is rising faster than the historical average. That’s not just a coincidence. #ActOnClimate"]["(1/3) The science is clear. Climate change poses a very real threat to #Tahoe. Read my op-ed with @TahoeAgency: https://t.co/ZDuPSOQsBc"]["The #TahoeSummit wouldn't have been possible without all the young volunteers. Great to see a new generation is working to #KeepTahoeBlue! https://t.co/6YCTr7C56I"]["\"Team Tahoe\" is ready to meet the new challenges facing Lake Tahoe. I invite you to join us.\n\nThank you to all who came to the #TahoeSummit."]["Climate change is having a profound effect on Lake Tahoe. We must strike at the heart of the issues facing this lake. #TahoeSummit https://t.co/B4lIa3lIl2"]["Our mission to improve Lake Tahoe clarity will be aided by a $200,000 @EPA grant. Great news. #TahoeSummit https://t.co/tmShQyDvra"]["Vital investments have led to improvements in lake clarity. Let’s ensure #Tahoe is preserved for generations to come.  #TahoeSummit https://t.co/1EqOo8x04v"]["\"This lake is a national treasure because of one virtue...your efforts.\" - former Interior Secretary Bruce Babbitt. #TahoeSummit https://t.co/gv19a0WCRc"]["\"Wherever I go around the country, I see one bumper sticker...#KeepTahoeBlue.\" - former Interior Secretary Bruce Babbitt. #TahoeSummit"]["\"Pause for a moment, take a deep breath and observe where we are - this is a special, beautiful place\" - @RepGaramendi #TahoeSummit"]["\"Tahoe is my favorite place on this earth. You just have to breathe, listen and feel to understand Lake Tahoe\". - @GovSandoval #TahoeSummit https://t.co/vC8YqGgb7s"]["\"Let's use this as an opportunity for showing not just our two states but showing the nation what can done.\" - @SenKamalaHarris #TahoeSummit https://t.co/qYkRbaswYs"]["\"The partnership we strengthen here today will endure.\" - @SenCortezMasto #TahoeSummit https://t.co/sBvcpzG13F"]["Thank you Dinah Pete, tribal elder of the Washoe Tribe for her beautiful invocation to start the #TahoeSummit. https://t.co/uLnfzxrUUW"]["Stage is set at Valhalla, shuttles are running, and volunteers are ready to welcome everyone. See you in an hour for the 2017 #TahoeSummit. https://t.co/i5xAuVjIG7"]["Conservation is on the agenda today at the annual #TahoeSummit. We must do everything we can to #KeepTahoeBlue. https://t.co/3hrHoCDe7h https://t.co/AgLQWAaZFs"]["Five California monuments are still at risk. They are national treasures and we won't stop fighting to protect them. https://t.co/hjawZztH1a"]["@Aly_Raisman Our bipartisan bill would require immediate reporting of abuse allegations and safeguards to prevent abuse. https://t.co/PyDKouWDlS"]["Thank you @Aly_Raisman for speaking out on the need to reform amateur sports to ensure we protect young athletes. https://t.co/ddIBp335ha"]["(3/3) To keep #Tahoe in pristine shape, reducing the effects of climate change must be prioritized. Read our op-ed: https://t.co/ZDuPSOQsBc"]["(2/3) Our next challenge for preserving #Tahoe: Tackling climate change. Surface temperatures are rising 14 times the historic average."]["(1/3) At the #TahoeSummit we’ll discuss next steps in the public-private partnership that has led to $2 billion in conservation projects."]["2016 was terrific for #Tahoe conservation—among other accomplishments, our bill led to $415 million in restoration &amp; conservation projects. https://t.co/Ar5n9GFWDF"]["The #TahoeSummit happens tomorrow at Tallac Historic Site. We’ll discuss keeping the region in pristine condition. https://t.co/3hrHoCDe7h"]["These women leaders are spearheading the fight to save #Tahoe. One of my favorite events of the year—we talked restoration efforts &amp; ideas. https://t.co/mC6T1sHPrj"]["#SolarEclipse2017 will happen early today here in California. Find the best viewing time for where you live: https://t.co/BFUw3aBqOy"]["This morning I’m thinking of the crew aboard the USS John S. McCain and praying for the missing sailors."]["Gen. Dunford meeting with Chinese leaders on North Korea. Military-to-military communication is key to build trust. https://t.co/Zlbmc98jhB"]["President Trump can’t ignore the threat of domestic terrorism. #Charlottesville reminds us we must stay vigilant. https://t.co/OvHCp6GcJZ"]["Cadiz would destroy a Mojave aquifer while doing nothing for our water security. Vital op-ed from @LauraFriedman43: https://t.co/E7iSUBBgw9"]["In order to protect young athletes, reform is key at USA Gymnastics. Turning our bill into law is a must. https://t.co/Sse7P8mjz6"]["As far as the next big quake, it’s not a matter of if it will occur, it’s when. Preparation is vital. My statement: https://t.co/84aTqBDPr9"]["Great news: Major grants awarded to further develop an earthquake early-warning system. Among the recipients are @CalTech and @UCBerkeley."]["(2/2) Our intelligence community has offered assistance and I encourage other nations to work with Spain. We stand with #Barcelona."]["(1/2) I’m closely monitoring the terror attack in Barcelona. It’s horrific to again see images of victims hit by a car driven by hate."]["Pres. Trump should listen to his nat’l security team. Scrapping the Iran nuclear agreement won’t make us any safer: https://t.co/GaT2EMUSIz"]["Inciting hatred and violence doesn't belong in California. I've called on the park service to deny Patriot Prayer a Crissy Field permit. https://t.co/b1ZgDB978o"]["A unilateral withdrawal from Iran nuclear agreement would isolate the United States—not Iran. Read my op-ed: https://t.co/GaT2EMUSIz"]["(4/4) I’ll continue to fight for the Sanchez family and all families across the country who have been callously targeted."]["(3/4) More evidence that Donald Trump’s immigration policy is just a hateful deportation program that targets law-abiding families."]["(2/4) Trump administration has denied every avenue to allow this family to stay together. This deportation is devoid of humanity."]["(1/4) Heartbroken for Maria and Eusebio Sanchez, who will be deported after 23 productive, law-abiding years in US. https://t.co/uQhLGtUZHf"]["Let’s ensure #Dreamers have the tools they need to unlock their potential and contribute to their communities. #DACAworks https://t.co/WHfGOKpH4G"]["We’re ready to counter any challenge the Trump administration gives #DACA. Protecting #Dreamers is a top priority of mine. #DefendDACA"]["On the 5th anniversary of the implementation of #DACA, I remain committed to #Dreamers in California and across the nation. #DefendDACA"]["We’ll fight any Trump administration attempt to discriminate against the #LGBT community. Read our letter to AG Sessions on Title VII: https://t.co/L16zgFu1JR"]["Violent acts of hate and bigotry have no place in America. The president must use his voice to condemn the events in #Charlottesville. https://t.co/abXxgAkxBY"]["1 in 50 jobs created in 2016 was in the solar industry. Let's not erect any barriers to undercut that growth! https://t.co/LRF56UJuFO"]["Read more about my bill, which would help 1.2 million Americans get health coverage and DECREASE premiums. https://t.co/BYFVvMo5J3"]["Before we can improve affordability in the individual market, President Trump must STOP his threats of sabotage. https://t.co/BYFVvMo5J3"]["The president’s escalating rhetoric won’t calm tensions or facilitate diplomacy with North Korea. He needs to step back from the brink."]["A new Republican immigration bill is a thinly-veiled attempt to keep immigrants out. My op-ed for @FortuneMagazine: https://t.co/bCJbWdJWq4"]["My statement on the pending deportation of the Sanchez family: https://t.co/PBUCGLeIYA"]["Maria and Eusebio Sanchez are hardworking parents. These are the kind of people we should welcome into the United States with open arms."]["I just had lunch with two great San Franciscans. https://t.co/5teTIAZZQA"]["Protecting farmworkers from deportation is a win-win. It helps our farmers and the hard-working immigrants who put food on our tables."]["9 of 10 Calif. farmworkers are immigrants. At least 5 in 10 are undocumented. My bill provides legal status: https://t.co/KiVCrb8cug"]["Important NBC report on the shortage of farmworkers in California. Terrible for our state's agricultural economy! https://t.co/FKzRWwyJNl"]["There's no such thing as winnable or limited nuclear wars. The president's \"fire and fury\" remark hurts diplomatic efforts with North Korea. https://t.co/aBzG2TH5qG"]["Burying this report and refusing to act on climate change would be a dereliction of duty. https://t.co/UmuyyLJQqg"]["I joined with 13 senators to call on the administration to make this important report public. https://t.co/y3bIYBTA0W"]["Despite the overwhelming scientific evidence, the Trump administration still refuses to accept that human activity drives climate change."]["The science is clear: climate change is real. The Trump admin can’t dismiss facts just because it doesn’t like them. https://t.co/hlplMD41F1"]["“We seek the total elimination one day of nuclear weapons from the face of the Earth.” - President Reagan https://t.co/Xq0aX0ODTZ"]["The situation with North Korea is volatile enough. We need diplomacy, not saber rattling from the White House. https://t.co/U25lQ7nYZU"]["Our failure to impose even basic safety rules on personal care products is an urgent public health issue. My letter: https://t.co/pYc0afE3YI"]["I'm urging President Trump to abandon his threats to sabotage the individual insurance market. My letter: https://t.co/GSw2um01wL"]["It appears that under the Trump administration the mission of the DOJ is to pave the way for widespread disenfranchisement. Outrageous!"]["The Justice Department’s reversal in yet another key voting rights case is alarming. My statement: https://t.co/uBep6yRgx6"]["Secretary Tillerson is still in Asia. He should be discussing the possibility of reopening North Korean talks with our regional partners."]["The situation on the Korean peninsula is already volatile enough. President Trump is not helping the situation with his bombastic comments."]["Isolating the North Koreans has not halted their pursuit of nuclear weapons. Diplomacy is the only path forward. https://t.co/PBMrNbNb4v"]