["I encourage service members and veterans concerned about their exposure to sign up for the registry today. Your participation will help the VA continue to research burn pits and find solutions for impacted service members and their families. https://t.co/ciGsdxBW9c"]["@JoeBiden This is a tough issue, and that’s why @SenBobCorker and I passed a law creating the Burn Pits Registry so that we may better understand the hazards of exposure and and help impacted veterans heal."]["Powerful message from @JoeBiden. Our service members deserve every protection and their families deserve every assurance we are reducing hazards for their loved ones. https://t.co/Ga5mpBQvig"]["This racist remark is a disgrace to our nation--a nation built by immigrants from around the world.  \n\nhttps://t.co/W92tjrmRF3"]["@POTUS #Dreamers are not a bargaining chip—they're real people with jobs, families &amp; aspirations. They deserve our protection &amp; certainty they're going to receive it. Republicans need to stop talking the talk and start walking the walk. Let’s fix this. Let’s vote on a #DreamActNow."]["We interviewed seven #NM #Dreamers who were able to pursue their dreams in America thanks to #DACA. Now, @POTUS' reckless actions have endangered their bright futures in this country—unless Congress passes the #DreamAct.\n \nHelp me share their stories and work for a #DreamActNow. https://t.co/LAN48Pv5Tc"][".@MartinHeinrich and I know that over 100 Dreamers are losing their status every day. No more delays. 800,000 lives are on the line. We need a #DreamActNow. https://t.co/SaJEGa0MDF"]["Thank you to Cochiti Pueblo Gov. Eugene Herrera and Lt. Gov. Bernard Sunia for hosting myself, @SenatorDurbin, &amp; former Rep. George Miller for lunch and Pueblo Christmas dances. It was a beautiful celebration and opportunity to learn about the Pueblo and its needs. https://t.co/RFH3w8faOU"]["@SenMarkey @SenateDems @realDonaldTrump The @FCC's primary responsibility is protecting consumers and public interest, not reducing competition for big corporations and protecting their bottom line.\n\nThe American people overwhelmingly support #NetNeutrality. The FCC isn’t listening to them, but we are. #SaveTheInternet"]["@SenMarkey @SenateDems @realDonaldTrump Too many Americans—particularly in rural states like #NewMexico—are already stuck in the internet slow lane. \n\nWe must expand broadband access &amp; bridge the digital divide, not destroy the essential protections that keep the internet open &amp; inspire innovation, growth &amp; expression."]["You've called, emailed, and raised your voice online, urging us to do everything we can to protect the open internet.\n\nI’m proud to support @SenMarkey @SenateDems effort to reverse @realDonaldTrump’s attack on #NetNeutrality."]["The #ACA has helped diabetes patients in #NM by providing more options &amp; better choices for medication, treatment, and management. Thanks to Lisa Taylor and Lawren McConnell of the @AmDiabetesAssn for joining me to discuss the progress we've made and the work left to do. https://t.co/6N6ScZZiPC"]["Every day we neglect these programs, more people will suffer.  \n \nIt's time for GOP leaders to stop the partisan gamesmanship, put American families' health first, and work with Democrats to reauthorize these programs immediately."]["1000 #NM parents get parenting education &amp; training from the Maternal, Infant &amp; Early Childhood Home Visiting Services program. The Special Diabetes Program for Indians helps Native communities treat &amp; prevent diabetes. \n \nThe GOP has also failed to fund these crucial programs."]["In #NM, 17 community health center clinics serve 330,000 patients in 90 underserved &amp; rural communities. They employ almost 3,000 people across the state.\n\nRepublican refusal to reauthorize the Community Health Centers Program puts these patients and these jobs at risk."]["GOP inaction has put access to affordable health care for over 11,000 #NM kids &amp; their families in danger. These families deserve to know—does our nation still believes they deserve every chance to lead healthy, successful lives? We must #ExtendCHIP &amp; keep our promise to them."]["Families should not have to choose between getting life-saving care for their children and keeping a roof over their heads. But some families may be forced to make such a heartbreaking decision soon if Congress doesn’t #ExtendCHIP now. https://t.co/NC287XzyIM"]["Ensuring our kids have the essential health care they need to grow and thrive should be a bipartisan priority. But Republicans in Congress have been playing politics with our children’s health for 100 days. It’s time to put an end to this and #ExtendCHIP now."]["It's been 100 days since the Congressional GOP let #CHIP expire.\n \nThat's 100 days of uncertainty and fear for families of the 9 million kids across America who depend on immunizations, prescriptions &amp; doctors visits through CHIP.\n \nThis is unconscionable and unacceptable."]["#HappyBirthday to the great state of #NewMexico! https://t.co/UZ8XP5ePEK"]["Read my statement on President Trump’s failure to protect #DREAMers: https://t.co/WfOn6K4Jb5"]["Welcome to the Senate and congratulations on being sworn in today, @SenTinaSmith and @GDouglasJones! I'm looking forward to working with my newest colleagues."]["Must read for 2018: Despite campaigning like a populist, @realDonaldTrump spent 2017 defending the interests of his family, GOP donors and corporate interests. \n\nIn 2018, @SenateDems and I will keep fighting for the people.\nhttps://t.co/q85hrKo0XG"]["Happy New Year! Wishing everyone in New Mexico and across the country health, happiness and success in the year to come. https://t.co/HaLaRU3XqM"]["Firing Special Counsel Mueller would be an affront to our Constitution and the rule of law. The President must know that any interference with this investigation will be met with a swift rebuke from Congress and an outcry from the American people. https://t.co/wW6BMtcCjQ"]["The #GOPTaxScam “will ensure a financial windfall\" for @POTUS &amp; family that's \"virtually unprecedented.” How much will he gain from the #TrumpFamilyTaxCut? We can’t know because Trump has refused to release his tax returns. https://t.co/jAGH4qI7f6"]["Republicans made the top 1 percent their top priority by passing their #GOPTaxScam. When will they finally focus on keeping our children healthy by funding #CHIP and protecting some of our nation’s most promising youth with a vote on the #DreamActNow?"]["While the GOP was staying up late to pass tax cuts for their rich donors w/ the #GOPTaxScam:\n-81 days passed w/out #CHIPFunding &amp; some states were forced to send notices to families that their kids' health insurance could end soon\n-More than 11,000 Dreamers lost #DACA protection"]["Since the day my Uncle Mo championed the protection of this precious land almost 40 years ago, we have been fending off these attacks and winning the fight to #ProtectTheArctic for future generations. And this fight is still not over. https://t.co/TrI5dtJ9K7"]["Republicans voted to open the #ArcticRefuge to drilling despite the irreparable harm it will do to its ecosystem, overwhelming opposition from the Gwich’in people who live there &amp; majority of Americans, &amp; a complete lack of evidence that drilling will provide windfall revenue."]["The #GOPTaxScam will be remembered as a terrible deal for the middle class, but it is also one of the greatest attacks on our #publiclands. To help pay for massive tax cuts for the ultra rich Republicans voted to sell off the #ArcticRefuge to the highest bidder. My statement: https://t.co/9FTNRJ4yif"]["@realDonaldTrump The #GOPTaxScam will do nothing for working families in New Mexico. But then, this bill wasn’t written for working families. It was written to benefit the most fortunate in our country – at the expense of everyone else."]["I voted NO on the #GOPTaxScam, which will line the pockets of @realDonaldTrump, his family &amp; the GOP’s billionaire donors. It will be a boon for multinational corporations, but for working New Mexicans and for the rest of the country, this bill will be an utter disaster."]["Giving millionaires and billionaires a massive tax cut through the #GOPTaxScam will blow a $1.5 trillion hole in the deficit — which will lead to huge tax increases for most Americans down the road &amp; cuts to Social Security, Medicare, &amp; Medicaid."]["Republicans are within hours of passing their #GOPTaxScam in a late night Senate vote. I was on the Senate Floor fighting for working families and opposing this #GOPTaxScam. WATCH: https://t.co/hI1jh4b3x8"]["BREAKING: House Republicans just passed the #GOPTaxScam to give massive tax cuts to corporations &amp; America's wealthiest -- paid for by working families. The final vote is just hours away in the Senate. The American people deserve better, I'm voting no."]["While Republicans are busy rushing their #GOPTaxScam through before the holidays, they are neglecting the 800,000 young people at risk of deportation. We need a #DreamActNow"]["Communities in #NM depend on strong environmental programs to protect clean air and water, and keep families healthy. Harmful riders that gut these programs have no place in mandatory budget bills. Join us in demanding #NoPoisonPills https://t.co/ExZ5lLGQIO"]["Happy 50th anniversary to @GoParks. Thank you for your tireless work helping preserve New Mexico's natural and cultural wonders. From @CavernsNPS to @PetroglyphNPS, NM's national parks are some of our state's most cherished places. #WeAreParks #FindYourPark https://t.co/CFv9SDsrap"]["Dreamers are scared they will be deported from the only country they have ever known. States are running out of money to provide kids’ health insurance. Meanwhile…Republicans are passing a tax cut for millionaires and billionaires. #DreamActNow #FundCHIPNow #GOPTaxScam"]["Let the GOP know you’re paying attention and you oppose the #GOPTaxScam to raise taxes on the middle class and force cuts to Medicare, Medicaid, Social Security, and the budget for everything from infrastructure to scientific research to environmental programs."]["Republicans will take a vote on the #GOPtaxscam as early as TOMORROW. But they can still vote it down and choose to work with Democrats on common-sense tax reform to help working families, not just corporations and the super rich. Keep calling and making your voices heard."]["Dreamers represent the very best of our nation. They are ambitious, talented, passionate young people who want nothing more than to work, get an education, care for their families and contribute to their communities. They deserve protection, they deserve #DreamActNow"]["We have almost 800,000 young people whose lives, dreams, and future hang in the balance. They are scared, their families are scared, and everything they have worked for is at risk. Tell Congress we need to pass the #DREAMActNow"]["Wishing everyone celebrating the festival of lights in New Mexico and across the country a very happy #Hanukkah"]["UPDATE: A last minute addition to the #GOPTaxScam would personally enrich President Trump, his family, and other billionaire real estate developers. Now they’re trying to rush it through Congress days before Christmas. https://t.co/l8PF8kVfdW"]["The Republicans are trying desperately to give their billionaire donors a big gift before the holidays. But there's still time to stop this #GOPTaxScam--call Congress before it's too late. https://t.co/6dmVREngq9"]["It's the last day to sign up for health insurance. Don't miss your chance to get covered. To sign up for a 2018 health care plan, go to https://t.co/yWiDjHxSv3 and #GetCovered today."]["I am excited to congratulate the 50 New Mexico students I have nominated to the United States service academies this year. These students represent New Mexico's best and brightest, and I wish them luck as they continue with the admissions process. https://t.co/9r3O42RURm"]["States across America are running out of funding to help the 9,000,000 children who rely on #CHIP--but Republicans are focused on passing a massive tax cut for corporations and the ultra-wealthy. This is simply inexcusable, we must act to #FundCHIPNow."]["It's been 75 days since GOP let #CHIP expire which provides health care for 9,000,000 children. Senate GOP made the time to pass tax cuts for millionaires. They’ve voted to open the #ArcticRefuge to drilling. Yet they continue to ignore children's health."]["5 years after #SandyHook, congress has made no progress on commonsense gun laws. Just last week, yet another school—this time in #NM—was touched by a devastating act of gun violence. It is long past time to act to prevent gun violence—we owe it to our children &amp; communities."]["Today’s vote to repeal #NetNeutrality rules is a major blow to the internet as we know it. @AjitPaiFCC’s legacy will be leading the surrender of the free &amp; open internet to corporations, letting ISPs create internet toll lanes, &amp; stifling online competition, innovation &amp; dynamism"]["Too many New Mexicans, especially in rural areas, are already stuck in an internet slow lane. We should be working to expand broadband access and bridge the digital divide — not repealing #NetNeutrality rules and destroying essential protections for a free and open internet."]["One thing is clear, the internet is an essential aspect of everyday life. It is not a luxury, it has become a necessity and it should remain free and open to every New Mexican and every American. #ProtectNetNeutrality"]["I want to thank the many advocates for #chemicalsafety who spoke out against #Dourson — especially the brave families who lost loved ones due to unsafe and unscrupulous practices. Their willingness to share their personal experiences truly made a difference for others."]["I am glad Michael Dourson did the right thing and withdrew his nomination to head the EPA's chemical safety office. As someone who has spent his career working for weaker safety standards for dangerous chemicals, he was a terrible choice, and he faced bipartisan opposition."]["He told me that DACA has given him “wings,” and the freedom to work and study at NMSU to pursue his dream of becoming an engineer. He is also a volunteer firefighter and wants to give back to his community. He deserves to feel safe in his home. #DreamActNow"]["Carlos has lived in the US since he was a baby. He grew up and went to school in NM, but because of his immigration status, he couldn't play sports, attend field trips or pick up an after-school job—even though he &amp; his classmates pledged allegiance to the same flag every morning https://t.co/uSRMBI7VRI"]["Los Dreamers son tan Nuevo Mexicanos y americanos como yo—y no deberían vivir con miedo constante en el único país que ellos conocen. Miedo a ser deportados, perder sus trabajos, y no poder seguir adelante con sus estudios #DreamActAhora, #DreamActNow"]["Dreamers are every bit as New Mexican and American as I am and this is the only country they've ever known. They shouldn’t have to live in constant fear of deportation, losing their ability to work, or being unable to finish school #DreamActNow"]["Headed to the Senate floor to urge a vote on the #DreamActNow. Dreamers deserve certainty, safety and security. WATCH LIVE: https://t.co/ABrgiUET0b"]["→ Worsening income inequality, \n→ Sabotaging the Affordable Care Act,\n→ Hurting Puerto Rico,\n→ Making working families pay for a $1.5 trillion deficit hole. \n\nThe #GOPTaxScam would be devastating for Latino communities in #NM and across the country. https://t.co/9hLDmVTpzL"]["Drilling will cause irreparable harm to the wild #ArcticRefuge &amp; the people who depend on it. We've faced this fight many times &amp; have always chosen to #ProtectTheArctic. We can't rush this irreversible decision now. RT &amp; tell @GOP to keep the #ArcticRefuge out of the #GOPTaxScam https://t.co/hCsUNxvA4c"]["The majority of Americans agree; drilling doesn't belong in the #GOPTaxScam and it doesn't belong in the #ArcticRefuge. \nhttps://t.co/wAW2j6qZ6v"]["Republicans are getting closer to passing their #GOPTaxScam &amp; it still includes drilling in the #ArcticRefuge. Americans don't want massive tax cuts for the ultra rich and they definitely don't want to destroy our public lands to pay for it. https://t.co/buxgDoJnQZ"]["There’s still time to stop this bill. The Republican margin is razor thin. Keep burning up the phones &amp; tell GOP leaders what you think of this #GOPTaxScam before it’s too late."]["Meanwhile, the #GOPTaxScam’s attack on the #ACA will leave 13 million Americans without health care. And it will cause out of pocket costs to soar across the country."]["The #GOPTaxScam’s $1.5 TRILLION deficit hole will mean a huge tax increase on most Americans down the road — in the form $12,500 in debt per family and GOP cuts to Social Security, Medicare, and Medicaid."]["BREAKING: Republicans say they’ve reached a deal on their #GOPTaxScam. Here’s the big picture: huge tax cuts for the rich and for big corporations. Skyrocketing health care premiums and huge deficits for the rest of the country to pay off."]["@FCC Too many New Mexicans, especially in rural areas, are already stuck in the internet slow lane. Instead of rolling back #NetNeutrality  that protects internet openness, we should be finding ways to make affordable high-speed broadband accessible for everyone."]["If @FCC Republicans succeed in rolling back #NetNeutrality tomorrow, internet service providers will be able to block, slow &amp; throttle internet service for certain sites. Meaning NM students, small biz owners &amp; everyday consumers could see slower download speeds &amp; higher prices."]["I stand with @SenGillibrand, a consummate professional and an excellent senator. @realDonaldTrump’s tweet is disgusting for a childish bully, and it’s wildly out of line for a POTUS. @realDonaldTrump absolutely should apologize and remove his tweet. https://t.co/XeOgvLNebp"]["Alabamians deserve to have their senator vote on the tax bill. Republican leaders should hold off on any #GOPTaxBill votes until Senator-elect Jones is seated."]["Are you a parent trying to track down a Fingerling or the Vampirina Scare B&amp;B? We can't let #GrinchBots steal Christmas. Read my letter with @SenSchumer and @SenBlumenthal: https://t.co/G4YWmfvMiy"]["@jimmykimmel I also want to join @jimmykimmel in urging you to sign up for health insurance. You have until December 15th to choose your 2018 health care plan. Go to https://t.co/yWiDjHxSv3 and #GetCovered today."]["Thank you @jimmykimmel &amp; Billy for raising awareness of the egregious neglect by Republicans not to fund the Children's Health Insurance Program (while trying instead to pass massive tax cuts for their donors). It's time to prioritize the health of our children and #FundCHIPNow https://t.co/UBCHrztFxF"]["Among the NM families who are unsure what will happen to their kid's health insurance is Colton’s. He was 8 yrs old when he was diagnosed w/ cancer. Without #CHIP, his treatment would've cost his family 100s of dollars a month- close to the cost of rent. We must protect his care. https://t.co/TGGhxU1qVz"]["It's been 2 1/2 months since the GOP let the Children’s Health Insurance Program expire while they were busy passing tax cuts for billionaires. 9 million American children-including 11,000 in NM-depend on CHIP for health care &amp; states are starting to run out of money #FundCHIPNow https://t.co/tbYSmig7nW"]["@FCC @AjitPaiFCC The @FCC's primary responsibility is protecting consumers and public interest, not reducing competition for big corporations and protecting their bottomline, but eliminating #NetNeutrality  rigs the playing field in favor of big business, hurting entrepreneurs and ordinary people https://t.co/w2MgP5DJGv"]["On THURSDAY, the Republicans on the @FCC intend to vote to eliminate #NetNeutrality . We are asking @AjitPaiFCC to abandon his reckless plan to radically alter the free and open internet as we know it. https://t.co/LdUWo4AsAk"]["The #GOPTaxScam will add over a TRILLION dollars to the deficit. How are they going to pay for it? They’re already talking about cuts to programs that help seniors and those most in need, like Medicare, Social Security, Medicaid and food assistance. https://t.co/xndJeR6cgc"]["If the @HouseGOP gets their way, the #GOPTaxScam will eliminate the deduction for medical expenses. Americans with extensive medical costs could see their taxes go up tens of thousands of dollars per year. https://t.co/BHmSo6XlFW"]["The #GOPTaxScam is an attack on the #ACA. The nonpartisan @USCBO says the bill will result in even higher premiums and would increase the number of uninsured Americans by 13 million. https://t.co/DaGpyXiwbT"]["The #GOPTaxScam doesn't just raise taxes for middle class families (to pay for tax cuts for the ultra rich), it jeopardizes their health. Here's how:"]["There are almost 8,000 DREAMers in NM at risk of deportation because of @POTUS' reckless decision to end #DACA. We should not be tearing apart families, we should be helping these young New Mexicans achieve their dreams. Tell Congress to act and pass the #DreamActNow."]["There is no excuse for leaving almost 800,000 young people's lives, dreams, and future hanging in the balance.\n \nIt's time for a vote on the #DreamActNow, we can't wait any longer to protect our immigrant youth."]["The GOP is rushing to pass their #GOPTaxScam because the more the American people learn about what’s in it, the more they oppose it. It's irresponsible- and immoral- to cut taxes for the ultra rich &amp; corporations while raising taxes &amp; cutting health care for middle class families"]["\"How could anyone trust #Dourson to put public health before the interests of the clients he has spent decades defending?\" We can't. The Senate must #RejectDourson."]["#Dourson has made his living producing junk science for the chemical industry to help them weaken our safety standards. Now, @POTUS wants Dourson to run the EPA's chemical safety office. We can't let that happen. #ScienceForSale"]["When Bonnie Lautenberg talks about chemical safety, we should all listen. Read her op-ed in @CNN on why Michael #Dourson's nomination at EPA threatens the safety of families and children across our country → https://t.co/9YHmuGA2LT"]["Thank you Candice. I agree, #Dourson is the ultimate example of putting the fox in charge of the henhouse. We must #DefeatDourson &amp; ensure the EPA continues to be a strong watchdog that protects NM families from dangerous chemicals. https://t.co/sLAnklL6Ye"]["My thoughts are with the students and faculty at Aztec High School as well as their families, 1st responders, and the broader community. I am monitoring the developments and will provide any assistance I can."]["Indigenous rights are human rights. We stand with you. https://t.co/OS6TVmptoc"]["I’m standing with the Gwich'in people to fight against the GOP’s sneak attack on the #ArcticRefuge and the Gwich'in way of life. Selling off America’s Serengeti to the highest bidder is an irreversible mistake. #ProtectTheArctic https://t.co/GGrbhVqlWh"]["Real GOP lawmaker quotes on #GOPTaxScam: \n\n-\"Fundamentally a corporate tax reduction &amp; restructuring bill, period.”\n-“My donors are basically saying, ‘Get it done or don’t ever call me again.’”\n-“The financial contributions will stop” if it fails.\n\nThey're not doing this for you."]["The New Mexico Air @NationalGuard has a long legacy of proud service to our nation. Read our letter urging the @usairforce to restore the NM Air National Guard Tacos' flying mission ↓ https://t.co/6yziPEu0l4"]["@POTUS This battle isn't over. President Trump has overstepped, and he's underestimating just how deeply the American people care about keeping public lands in public hands. I'm going to fight this overreach every way I can. RT if you're with me. #StandWithBearsEars #MonumentsForAll"]["In #NewMexico, our national monuments #OMDP4NM and #SaveRGDN are drivers of our economy and central to our way of life. I'll be reviewing this report closely, but let me be clear: @POTUS doesn't have the legal authority to rescind a monument designation. https://t.co/qscl0d47bw"]["Our national monuments are lands of stunning beauty &amp; sacred meaning that belong to all Americans. President Trump is taking away protection of your lands -- risking looting &amp; vandalism, and opening to development. #MonumentsForAll #StandWithBearsEars #SaveGrandStaircase https://t.co/k4YMmPm1Ma"]["Donald Trump’s ignorance and repeated disrespect for Native Americans diminish the office of the president of the United States. @POTUS decided to dismantle Bears Ears in secret--and he didn't bother to consult the Tribes who co-manage it. #StandWithBearsEars #MonumentsForAll https://t.co/ZkZph63a6n"]["I stand with Bears Ears and Grand Staircase, and I support the legal fight against this attack on our public lands and heritage. #MonumentsForAll #StandWithBearsEars #SaveGrandStaircase https://t.co/JUvwC5Jvke"]["RT &amp; share the truth: @POTUS’ decision to roll back Bears Ears &amp; Grand Staircase Escalante by over 80% isn’t a reconfiguration of the boundaries. It's the largest frontal assault on public lands in history. #MonumentsForAll #StandWithBearsEars #SaveGrandStaircase https://t.co/T4b7lxO3WE"]["@POTUS .@POTUS doesn’t have the legal authority to shrink a monument. He's using never-tested, dubious theories to try to reverse designations. He will be challenged in court, &amp; I'll fight him every step of the way in the Senate. #StandWithBearsEars #SaveGrandStaircase #MonumentsForAll"][".@POTUS is making a mistake that risks the ~$900B outdoor recreation economy &amp; a source of good jobs in NM &amp; across the nation. Shrinking our monuments is bad for our economy &amp; our natural heritage. #MonumentsForAll #StandWithBearsEars #SaveGrandStaircase https://t.co/sDNbQQ9l2Z"]["Well said: “https://t.co/NccEwG0hdZ"]["Folks, this #GOPTaxScam is bad and it’s easy to get discouraged. But this is why we need you to channel your outrage into action — get everyone you know to get organized, speak out, and get ready to vote!"]["We still have the chance to do one good thing with this #GOPTaxScam — STRIKE the provision that would sell off the Arctic coastal plain without real hearings, consultation, public input. I’m voting to #ProtectTheArctic"]["Republicans are setting up a fiscal trainwreck by adding almost $1.5 trillion to the deficit, which threatens future government revenues &amp; long-term budgets for #NM families, schools, labs, bases, scientific research funding, &amp; public lands. Those are some outrageous priorities."]["You can't make this stuff up. https://t.co/kxrtdqwBYy"]["We’ll have plenty of time to talk about the latest #TrumpRussia bombshell. But we need you to keep burning up the phones about the #GOPTaxScam that's barreling ahead on the Senate floor. Senate Republicans don't want you to pay attention to this terrible bill. Show them you are."]["The #GOPTaxScam will add nearly 1.5 TRILLION dollars to the deficit. Doesn't sound to me like the plan @POTUS promised would pay for itself. https://t.co/Hqiq2JhH7H"]["The #GOPTaxScam will trigger Medicare cuts of up to $410 billion – while wealthy donors enjoy write-offs for private jets. https://t.co/sSzlEDg8mG"]["Q: If the GOP thinks their bill is so good for the middle class, why has it been written behind closed doors? A: Because it’s a #GOPTaxScam https://t.co/2KRGtWzfrx"]["Tune in: I'm about to join @180099native to discuss the incredible patriotism and heroism of the Native American Code Talkers. I'll also talk about why I need input from Indian Country on several nominees that the Senate will soon consider ➝ https://t.co/l1myqtilNG"]["Voting soon on the #GOPTaxScam (spoiler alert: I’m voting no) but still haven't seen the final bill language. What are they hiding? Even more tax cuts for billionaires? More cuts to health care services? More special interest favors?"]["Tune into @MSNBC @ 9:45 a.m MT / 11:45 a.m. ET. I'll be on talking about who loses money in the #GOPTaxScam (working families, seniors, children, the sick &amp; disabled, rural families, &amp; the poor) and who gets new handouts (millionaires, billionaires &amp; multinational corporations)."][".@SenateGOP is using the #GOPTaxScam to open the #ArcticRefuge to drilling. Drilling does not belong in the Arctic, nor in this corporate tax cut, so we have an amendment to strike it. RT if you agree the world's most wild place is more important than tax breaks for GOP donors. https://t.co/mDzTzVumwZ"]["It's the one trillion dollar question https://t.co/lzSZGO1Iea"]["Very good question, @brianschatz! https://t.co/lzSZGO1Iea"]["The #GOPTaxPlan would have a devastating impact on #NewMexico. It will raise taxes for hundreds of thousands of working New Mexicans, drive up health care premiums and cost our state hundreds of millions of dollars. I'm voting no. https://t.co/DSKKzKassc"]["Americans don’t want a tax bill written in secret, cobbled together at the last minute &amp; filled with goodies for special interests. But that’s what we're going to get unless we can defeat the #GOPTaxScam today.\n \nTime is running out—call your Senators now &amp; tell them to vote no."]["Let’s be very clear:\n \nNo middle-class family is demanding permanent tax cuts for corporations. They aren’t demanding a bill that drives up their health care premiums. They certainly aren’t demanding a tax INCREASE.\n\nThis #GOPTaxScam is a terrible deal for everyone except the 1%."]["@SenateDems @SenSchumer @SenatorCantwell @SenMarkey @SenBennetCO @MartinHeinrich @LCVoters @JaneGoodallInst LIVE NOW: We’re calling on GOP leadership to drop their attempt to open our #ArcticRefuge to drilling as part of the #GOPTaxScam. #NoArcticRider #ProtectTheArctic \n\nhttps://t.co/FPs9DxYK6M"]["@SenateDems @SenSchumer @SenatorCantwell @SenMarkey @SenBennetCO @MartinHeinrich @LCVoters “You have an important opportunity to make a difference—both now &amp; for future generations—by urging your legislators to oppose oil development in one of the world’s most spectacular wilderness areas, the Arctic National Wildlife Refuge”\n\n-@JaneGoodallInst https://t.co/vxibNcEUCs"]["@SenateDems @SenSchumer @SenatorCantwell @SenMarkey @SenBennetCO @MartinHeinrich @LCVoters This is what happens when you attempt to subvert regular order. GOP leaders think they can reverse decades of bipartisan agreement to protect our #ArcticRefuge without the American people noticing. Raise your voices and let them know they won’t get away with it. #ProtectTheArctic"]["@SenateDems @SenSchumer @SenatorCantwell @SenMarkey @SenBennetCO @MartinHeinrich @LCVoters Yesterday, the Senate Parliamentarian ruled that the arctic drilling rider violates budget reconciliation rules—but the GOP has already drafted a new attempt to loot our #ArcticRefuge in order to pay for tax cuts for corporations and the ultra-wealthy. https://t.co/NEOOa1EKkK"]["@SenateDems @SenSchumer @SenatorCantwell @SenMarkey @SenBennetCO @MartinHeinrich @LCVoters The #ArcticRefuge has sustained the Gwich’in people for centuries. It’s home to an incredible array of wildlife including caribou, wolves and polar bears. Drilling would have a devastating impact on the Gwich’in people, their way of life, and this unparalleled natural wonder. https://t.co/bPUGrI3nnJ"][".@SenateDems are fighting back against the #GOPTaxScam drilling provision that hands our #ArcticRefuge—one of the last truly untouched places on earth—over to the fossil fuel industry. \n \nWatch our press conference live at 12:30: https://t.co/875HZKZNcu #NoArcticRider"]["Native language revitalization builds connections between generations &amp; promotes higher academic achievement outcomes among Native youth. Proud to pass our bill honoring Esther Martinez's legacy by devoting resources to promoting Native languages in Tribal communities. https://t.co/VGCbUbTBVu"]["More than 4 in 5 American Indian and Alaska Native women have experienced violence in their lifetime. \n \nThese women are #NotInvisible. Join me today in sharing their stories, raising awareness and working to end this epidemic. https://t.co/g5iOOCK2EX https://t.co/HbISuee3Wt"]["Indian Country—I need your help!\n \nI’m committed to ensuring Native communities are meaningfully engaged throughout this process &amp; your voices are always heard here in Washington DC. \n \nSend me your input on these nominees &amp; make your voices heard: SenTomUdall@tomudall.senate.gov https://t.co/SH7Gr4nGIr"]["In the coming weeks, the Indian Affairs Committee will be considering two nominees for positions that are critical to Tribal communities: Robert Weaver to be Indian Health Service Director and Tara Sweeney to be Assistant Secretary for Indian Affairs."]["Conservative British Prime Minister Theresa May said the president was wrong to stoke hatred against Muslims. Republican leaders in Congress need to stand up and do the same. \nhttps://t.co/W88GEwQtah"]["This needs to be called out: the president of the United States is retweeting fascist, anti-Muslim propaganda. This behavior is beyond irresponsible and exceedingly dangerous, even for this president."]["#GOPTaxScam will help corporations &amp; the ultra wealthy &amp; leave working Americans out to dry. It repeals the state and local tax deduction, a key provision for middle-class families, but reduces the estate tax - a tax break only 30 NM families are wealthy enough to benefit from."]["The #GOPTaxScam treats corporations better than people. Corporations receive the only permanent tax cut while 1 in 3 working New Mexicans will see their taxes go UP by 2027."]["\"The only way anything ever changes in Washington is when people stand up &amp; demand it. So speak out, post on social media, write letters to the editor, &amp; get everyone you know to help make sure Dourson is never confirmed to this position.\" @SenGillibrand https://t.co/0BYVr6iiKj"]["“When Dourson delivers for his industry clients, it is the public who pays, through weakened health protections. That’s not the quality of person we need in a leadership position in a critical public health agency.” https://t.co/32G5vqwnOG"]["\"Dourson's record suggests that when there is doubt, he does not err on the side of caution in questions of human safety. He errs on the side of what his clients want. That makes him unsuitable to be the people’s lead protector from chemical pollution.\" https://t.co/U2uqhOdtgi"]["\"This nomination is no longer an issue of political affiliations but a concern for the health of the American people.\" https://t.co/vwEobFuQoC"]["\"Dourson’s past work is bad enough, but to put such a man in charge of chemical safety would be dangerous to people in Parkersburg, Vienna, the Mid-Ohio Valley and those around the country.\" https://t.co/1qgAdbZCFq"]["\"Dourson isn’t just your run of the mill chemical company apologist. He built a career helping companies...weaken &amp; evade federal chemical safety laws…This is precisely the wrong person to ensure Americans aren’t poisoned by chemicals &amp; toxic pollution.” \nhttps://t.co/tR0L1NYNXH"]["\"Dourson has already taken up residence at the EPA, appointed without confirmation to a special adviser position. It is imperative that we keep our drinking water and our children safe, and send Dourson packing.\"  https://t.co/nANXhIHxly"]["“When it comes to chemicals such as these, we need vigilant oversight and continued focus on regulations. The goal should be to keep people safe, but I worry that safety will not be Dourson’s priority.” https://t.co/GYZwSpVi6n"]["\"This isn’t about political ideology or whether you support or don’t support President Trump. This is about nothing less than the very basic safety of our drinking water.\" https://t.co/6dbJ317zHK"]["\"At a time when the EPA has newfound and much-needed authority to test chemicals under the nation’s updated toxics law, passed with bipartisan support just last year, why invite the fox into the henhouse?\" The Senate must protect us from Dourson\" https://t.co/6SHEk3hX5V"]["\"Last month I returned to Washington to wage my next fight against cancer, urging my senators to remember that cancer isn’t a partisan issue and chemical safety isn’t either. They must reject Dourson.\" https://t.co/XRcbwJ4ooY"]["\"We recently went to Washington to ask our senators 'What if it was your child? How hard would you fight &amp; what lengths would you go to protect not only your own, but all of our children?' Refusing to approve [Dourson] is part of that fight.” https://t.co/ufSOLX3mNa"]["“Dourson is a terrible and, we think, dangerous choice. A toxicologist by training, he has spent years as a consultant for chemical companies, arguing on their behalf for weaker safety standards.”\nhttps://t.co/H5e3LnK5FI"]["\"The notion of putting Dourson in charge of our chemical safety program is nothing less than absurd...families deserve to know that the products they buy and bring into our homes are safe. We simply cannot trust Dourson to keep our kids safe.\"\nhttps://t.co/xuldif9EmJ"]["“Dourson has built a career of abusing science to mischaracterize real-world chemical risks and in doing so has jeopardized public health, including the health of those most vulnerable among us like pregnant women and children.” https://t.co/eFbHhMjvOp"]["\"[Dourson] has been paid by chemical companies to produce favorable studies and reports. Now he’s in line to supervise chemical safety at EPA. Someone who has a record of protecting human health and environmental quality ought to hold that job\" \n\nhttps://t.co/qCwEE8oY8Z"]["Concerned citizens from #Indiana to #WestVirginia to #Tennessee to #Maine to #NorthCarolina are urging the Senate to #RejectDourson. His nomination represents an immediate threat to our public health &amp; safety. RT their stories and help speak out against #Dourson. #ScienceForSale"]["We worked hard to protect #NetNeutrality because the internet should be free, fair, &amp; open to everyone - not subject to gatekeepers or toll lanes. But the FCC is about to roll back rules that have ensured an open &amp; equal internet. We can't let them, tell FCC to #SaveNetNeutrality"]["3) The bill creates new loopholes for the mega-wealthy and tax dodgers, encourages multinational corporations to ship jobs overseas &amp; big corporations are getting the only permanent tax break - while small biz is getting the short end of the stick."]["2) The GOP is using the tax plan as another opportunity to undermine the ACA. Their ACA repeal-without-replace provision to remove Obamacare's individual mandate will result in 13 million more uninsured Americans by 2027 and soaring health care premiums."]["1) The GOP plan will hurt NM's working families while lining the pockets of the ultra wealthy. And according to the nonpartisan CBO report released yesterday, it's even worse than we thought. https://t.co/3kQ0rN3d9r"]["RED ALERT: Senate Republicans are trying to pass their #TaxBill THIS WEEK. Here are just a few reasons we need to fight it every step of the way:"]["This moment in history won’t overshadow the contribution the Code Talkers made and continue to make to our nation. But at what should have been a solemn ceremony to honor Native veterans, Donald Trump took low even lower. https://t.co/XnQ4WRox7q"][".@CFPB has already fought for and won $12 billion in relief for 29 million cheated Americans. New Mexicans and all Americans deserve – and need – a CFPB director who will fight to #ProtectConsumers. #DefendCFPB"]["@cacaosantafe Supporting #MainStreet helps build an economy that works for every corner of #NewMexico. When you #shopsmall you support local businesses and good jobs - and keep more dollars in our communities. #SmallBusinessSaturday"]["In NM, supporting the arts also supports the growth of new small businesses (&amp; jobs) like @cacaosantafe, a coffee &amp; chocolate shop in a growing arts &amp; business district in Santa Fe. I loved learning about &amp; tasting chocolate during my visit for #smallbusinesssaturday. #shopsmall https://t.co/XRWFTnu4jZ"]["Today, on #SmallBusinessSaturday, I plan to #ShopSmall. I hope you'll join me in supporting #NM small businesses and small business owners. https://t.co/UDjfQWUbb0"]["Today we had a great time kicking off the @SalvationArmyUs #RedKettle Campaign in #NM to help provide resources to people in need during this holiday season. https://t.co/4HABlmlswM"]["Jill and I wish you all a happy &amp; safe Thanksgiving! Join me in giving thanks today for our service members and their families who sacrifice so much for our freedom. https://t.co/ZbMtUn1HJz"]["I welcome the guilty verdict against Ratko Mladic. This is an important moment for the victims of Mladic’s war crimes and for international justice. https://t.co/rHMkuD08ht"]["RT if you believe the internet should be open and free for all Americans #netneutrality #SaveNetNeutrality https://t.co/266AARPZ4j"]["This attack on the open internet will hurt consumers in order to give big corporations more control over the online world. Americans have the power to stop this—but you must speak out now. #SaveNetNeutrality https://t.co/5OBjLVmYch"]["The internet was founded on free and open access—but the FCC is about to act to end the internet as we know it by repealing #NetNeutrality.\nhttps://t.co/xMYyYMzBS2"]["I worked hard to include many #NM priorities in this bill, but I can’t look past its deep and damaging cuts to the EPA budget that put public health at risk. I refuse to support a bill that takes aim at the laws that protect our environment &amp; communities.\n\nhttps://t.co/yU9J81ZYDt"]["On Public Health Thank You Day, let’s celebrate the public health professionals—from researchers to nurses to doctors—who work every day to save lives and make our world a healthier and safer place. #PHTYD"]["\"Dourson isn’t just your run of the mill chemical company apologist. He built a career helping companies… weaken &amp; evade federal chemical safety laws.\"\n \n#Dourson’s nomination is dangerous for families from #Maine to #NM. The Senate must #RejectDourson.\n\nhttps://t.co/tR0L1NYNXH"]["Happy #NationalTakeAHikeDay! This weekend, take the opportunity to #GetOutside and explore some of #NewMexico's treasured #publiclands with friends and family. #FindYourPark https://t.co/ANEAa6dSVY"]["We’re one “No” vote away from stopping this dangerous nomination to head @EPA’s #chemicalsafety bureau. \n\nHelp win this fight and protect American families from dangerous chemicals—call your Senator and urge them to #RejectDourson today. https://t.co/KH1kZ9sK2w"]["Today @JerryMoran &amp; I passed the #MGTAct to save taxpayers $20 billion/year by updating government IT &amp; addressing cybersecurity vulnerabilities. On to the president for his signature! https://t.co/ZzC8r4Dg9s"]["Did you know that 75% of the $80 BILLION our government spends on IT is used to maintain old, legacy systems from the era of dial-up modems and dot-matrix printers? It wastes money &amp; time, and leaves our systems vulnerable to cyber attack."]["Why does President Trump want to pass this #GOPTaxScam? Hint: It’s not because it helps YOU. https://t.co/UqKw6Q8DSm"]["@SenatorBurr @SenThomTillis Thank you to Jerry Ensminger and concerned citizens across the country who have spoken out and urged the Senate to #RejectDourson. \n \nYour voices are powerful—they can make a difference. Retweet, keep speaking out and help us reject this dangerous nominee. https://t.co/zyPBfEGxBq"]["Join me in thanking @SenatorBurr @SenThomTillis for opposing Dourson's nomination to lead EPA's toxics bureau.\n \n#Dourson's career as a toxicologist for hire is disqualifying—Americans deserve a #chemicalsafety watchdog who'll put their health &amp; safety 1st https://t.co/rr5KTmFAge"]["This is not tax relief—it’s a plan to shift more of the tax burden onto hardworking families. \n\nI’m fighting this Washington giveaway to the ultra rich. Call your senators and representatives (202-224-3121) and join the fight."]["Senate GOP wants to gut 13 million Americans’ health care in order to give corporations a permanent tax cut &amp; tax breaks to the 1%. #GOPTaxPlan will raise health care costs while increasing taxes on students, teachers &amp; the middle class. #NM families can’t afford this #GOPTaxScam"]["Proud to partner with @soulofnations to host a display of young Native American artists’ work in the Senate this week. \n \nDuring #NAHM, let’s celebrate the artistic contributions of indigenous people &amp; the Native youth who are creating work that inspires and challenges us. https://t.co/IYkmM4CMNu"]["Thousands of #DACA applications were rejected because of a delay at the post office. #Dreamers shouldn't face life changing consequences because of an error they had no control over. Urging @DHSgov to let them resubmit their applications. https://t.co/UkDUntEWTy"]["Jerry Ensminger is a retired Marine Corps master sergeant whose daughter died of leukemia connected to #TCE contaminated water at #CampLejeune. Jerry’s raising the alarm abt Michael #Dourson's record &amp; \"the damage this guy could do to future generations.\" https://t.co/KLR4k7AqUU"]["@SenatorCantwell @SenBlumenthal @PattyMurray @SenMarkey @SenFranken @SenatorDurbin @RonWyden @SenSanders @SenDuckworth @SenJeffMerkley @CoryBooker @POTUS This disturbing timeline of events needs to be independently investigated. \n \nUntil then, Chairman Pai should recuse himself from Sinclair-related business in order to protect the public interest, integrity and independence of the FCC's decision-making process. https://t.co/RSAaw4hqfq"]["@SenatorCantwell @SenBlumenthal @PattyMurray @SenMarkey @SenFranken @SenatorDurbin @RonWyden @SenSanders @SenDuckworth @SenJeffMerkley @CoryBooker Quid pro quo? The basic timeline:\n \n1. President-elect Trump meets with Sinclair’s CEO &amp; reportedly discusses FCC rule changes.\n \n2. Pai holds 3 meetings w/Sinclair.\n \n3. @POTUS elevates Pai to FCC Chairman.\n \n4. FCC repeatedly acts to ease rules to benefit Sinclair\n \nRead more: https://t.co/iIXAQ4laci"][".@SenatorCantwell &amp; I are deeply concerned with potential quid pro quo between the Trump administration, Sinclair &amp; FCC Chairman Pai.\n \nWe're calling for an investigation into whether the FCC Chairman has been improperly paving way for the Tribune/Sinclair merger since Nov. 2016. https://t.co/18Ql6F0ruF"]["Brandon came to the US when he was only 2. He’s volunteering in his community &amp; working to help his family afford medical expenses. It's time to pass the #DreamAct &amp; ensure Brandon—and 800k Dreamers just like him—can build a better future in the only country he’s ever called home"]["Brandon's an #NM #DREAMer who's studying hard to become an architect and build his future in America. RT &amp; help share his story #DreamActNow https://t.co/AYH14agQFK"]["Congrats to Tim Keller and Cynthia Borrego! I'm looking forward to working with you to boost growth and expand opportunity for everyone in #NM."]["Our children &amp; grandchildren can’t afford for us to sell out the #ArcticRefuge to pay for tax cuts for corporations &amp; billionaires. \n \nWe can’t let its destruction be the legacy we leave future generations—call your representatives (202-224-3121) &amp; tell them to #ProtectTheArctic https://t.co/PPrIcoilIR"][".@JaneGoodallInst: Congress has “an important opportunity to make a difference both now, and for future generations, by voting to oppose oil development in one of the world’s most spectacular wilderness areas-the #ArcticRefuge.” #ProtectTheArcticRefuge https://t.co/eo147AAFxb"]["Drilling in the #ArcticRefuge would have a devastating impact on the Gwich’in people and their way of life. I'm joining the Gwich'in Nation in standing up to #ProtectTheArctic—RT and join us. https://t.co/1pwourzEK0"]["#ArcticRefuge is our Serengeti—a majestic ecosystem and a part of our national heritage. GOP plan to drill it for oil is an irreversible mistake. #ProtectTheArctic https://t.co/W94ifXGimw"]["Americans’ access to affordable health care is NOT a political bargaining chip. \n \n16 patient and consumer groups stand opposed to the #GOPTaxPlan’s individual mandate repeal. \n \nJoin us in speaking out. We must defeat Senate Republicans' dangerous proposal and #ProtectOurCare. https://t.co/zRbFJzZmfd"]["🚨This is not a drill🚨\n \nSenate GOP is trying—AGAIN—to gut your health care. 13 million Americans will lose their #ACA coverage under #GOPTaxPlan &amp; premiums will rise by 10%.\n \nYou know what to do. Americans rose up and defeated #TrumpCare before—we need you to speak out again. https://t.co/AGQhAF2iVh"]["Michael #Dourson has made a living as a mercenary for corporate polluters. His confirmation would put Americans’ health &amp; safety at risk. \n \nWe can't allow the Trump Administration to put #ScienceforSale. Join me in calling on the Senate to #RejectDourson. https://t.co/Lsrk9jmm8c"]["It's #RockYourMocs week! Encouraging everyone to celebrate #RYM2017 and all the contributions Native Americans and @NativeHillStaff make here in Congress and across the country. https://t.co/fo7voTo5Z7"]["I’m thrilled to welcome this $1B investment in #NM. FB's decision to expand its data center—which will be powered by 100% renewable energy—is a testament to how investments in clean energy &amp; technology can work together to create jobs &amp; opportunity in NM. https://t.co/FRJuDlZKb3"]["@EPA Parkersburg, WV is a small community that was contaminated by PFOA, the toxic chemical that Micahel Dourson was hired to downplay concerns over. \n \n#Dourson's bunk PFOA science was used to justify poisoning Parkersburg. He has no place at EPA. https://t.co/1qgAdbZCFq"]["Michael Dourson has spent his career helping corporations cover up the damage caused by dangerous substances—from second-hand smoke to PFOA, the chemical in Teflon tied to cancer.\n \n#Dourson has no place running @EPA's toxics bureau. We must #RejectDourson\nhttps://t.co/tgOAzNZPOw"]["\"If you're ever going to contact your US senator’s office about a national issue, this is it.” I couldn't agree more. \n \nWe need your help to #RejectDourson—RT &amp; tell the Senate to oppose his nomination &amp; protect American families from dangerous chemicals\nhttps://t.co/JSd7O7VBzX"]["JFK said, \"As we express our gratitude, we must never forget that the highest appreciation is not to utter words, but to live by them.\" Our veterans have honored their commitment, they kept their promise. We must keep ours—not just w/words on #VeteransDay, but w/actions every day"]["On #VeteransDay, we recommit to ensuring veterans have everything they need when they return to civilian life. No veteran should return home without a place to live, quality health care, or the training or education necessary to secure a job."]["Today &amp; every day, I'm honored to recognize the service, bravery, dedication and sacrifice of our veterans. This #VeteransDay, join me in paying tribute to all veterans, the fallen, all prisoners of war, the wounded, the missing in action, gold star families &amp; military families. https://t.co/WPrJKhdPcu"]["@NativeHillStaff I learn every day from the diverse voices, backgrounds and expertise on my staff—New Mexico benefits from their knowledge and experience. I’m proud to be a strong supporter of efforts to increase diversity in the halls of Congress."]["@NativeHillStaff For too long, Congress has made policy choices FOR indigenous peoples. By committing to hiring Native staffers on Capitol Hill, we can help ensure that the critical policies impacting Native communities are shaped by this Nation’s first peoples."]["Thrilled to welcome the launch of @NativeHillStaff, the first staff association for Native congressional staffers. https://t.co/hNl1voq2K4"]["Thanks to the Wilderness Land Trust for its tireless work, to @MartinHeinrich &amp; @repbenraylujan for being great partners in this fight, to @SecretaryZinke for seeing the value of this land firsthand and to all who worked to open this pristine #NewMexico landscape to the public."]["Excited to announce the Sabinoso Wilderness will finally be made publicly accessible. This is a major win for #NM’s hikers, hunters, sportsmen and women, lovers of the outdoors, and our thriving recreation economy. https://t.co/mdfASypVSa"]["@EnvDefenseFund Oil and gas jobs are trending up in the last year. We can create even more #NM jobs, help our school kids, &amp; protect the environment by supporting a natural gas-loss mitigation industry. Colorado did it, and is growing jobs and collecting royalties for taxpayers’ benefit."]["@EnvDefenseFund Oil and gas are an important industry for #NM, good to see that some in industry are reducing emissions. State and federal rules set a floor so that everyone is held to the same standard. #StrongerEconomy #BrighterFuture"]["#NM kids lose out on $27 million in school funding due to wasted natural gas. This report by @EnvDefenseFund gives us an important picture of how much we could gain by taking simple steps: https://t.co/oPfjeLRLjK"][".@POTUS is stacking @EPA with industry insiders who've built careers on putting corporate interests ahead of public health. I voted against #Wehrum’s nomination, and I will keep fighting to #RejectDourson. We owe it to our children, our planet and our future."]["#Dreamers’ voices and stories are reverberating loudly through Washington DC today. Congress must preserve their dreams, protect their future and pass the #DreamActNow. https://t.co/p3CtG4dQLS"]["Joining @EDF on a press conference call shortly to share a new report about methane waste and pollution and its cost to #NewMexico. If we #CutMethane waste across our state, we can make a big difference for #NM kids and climate change."]["I believe Congress should seek new solutions—including banning the use of unverified social security numbers in commerce and establishing secure online IDs—to further protect American consumers."]["It's painfully clear that Americans can't rely on the large companies that store their data to protect it. Today, I pressed Equifax &amp; other companies that have experienced serious data breaches to improve their protections for consumers’ personal info. https://t.co/xXxnmx5o1Q"]["Participation is the cornerstone of a healthy democracy. I’m energized and inspired to see so many Americans making their voices heard yesterday and so many new leaders emerging."]["Great meeting with @Enric_Sala and discussing the challenges facing our #pristineseas. Thank you for all the work you do to document and protect these precious marine ecosystems. https://t.co/B8TSF903zf"]["@POTUS #Dreamers give back to NM &amp; our country every day—whether serving in the military, studying at school or working in their communities. It’s time to pass the #DreamAct so Dreamers can keep building a better future here."][". @POTUS' move to end #DACA has put nearly 900 #Dreamers serving in our military at risk of deportation. These young people putting everything on the line for our country are as American as you or me. Congress must pass the #DreamActNow &amp; protect them. https://t.co/1Lev3FLNrW"]["Now that I have 280:\n\n#DreamActNow #ProtectDreamers #HereToStay #DreamActNow #ProtectDreamers #HereToStay #DreamActNow #ProtectDreamers #HereToStay #DreamActNow #ProtectDreamers #HereToStay #DreamActNow #ProtectDreamers #HereToStay #DreamActNow #ProtectDreamers #HereToStay"]["Need help understanding your options? Here’s a useful tool to help compare plans and prices: https://t.co/hwsL2T7u3Q"]["#NewMexico—you have until December 15th to choose your 2018 health care plan. Go to https://t.co/yWiDjHxSv3 and #GetCovered today. https://t.co/T0N7sdKv8l"]["Ross has repeatedly failed to respond to Congress. We want answers—Ross needs to return to the committee &amp; answer Qs https://t.co/n2MhnXLpYG"]["I joined a call for OGE to review Ross’ disclosures in light of discrepancy between his testimony &amp; press accounts\nhttps://t.co/QfJUtMsrSY"]["Ross failed to disclose this business connection to Putin's inner circle during confirmation—part of a troubling pattern in this admin. https://t.co/noKyWDfDA7"]["Jill &amp; I are devestated to hear about the TX church shooting. Our hearts go out to the victims &amp; community. Thankful for the 1st responders."]["Happy #NationalBisonDay—our national mammal has an important place in American history &amp; holds cultural significance for many Native peoples https://t.co/6bjDVrREAb"]["The Trump admin must stop the denials, listen to our nonpartisan scientists’ findings &amp; work with Congress to address this urgent crisis."]["Read and RT this report. We can’t afford to bury our heads in the sand. We must #ActOnClimate before it's too late. https://t.co/ZOkblKoyOd"]["NEW US govt comprehensive climate science report was just released—and it shows that #climatechange is a threat to our planet &amp; our future. https://t.co/UD4ZRZKfzb"]["I'll keep fighting for tax reform that makes the wealthy pay their fair share &amp; that enables us to invest in infrastructure &amp; jobs for #NM."]["The GOP tax plan even weakens protections that stop secret political donors from abusing tax provisions meant for charities."]["This GOP tax bill is full of political gifts to special interests—like the backdoor measure to open the #ArcticRefuge to drilling."]["The GOP tax bill is a big gift to corporations and the richest 1 percent—and it makes the rest of the country pay for it."]["Drilling the #ArcticRefuge will not raise the $1 billion the GOP promises. It’s just a backdoor gift to industry. https://t.co/awdFPZonQI"]["Congress has debated opening the #ArcticRefuge many times &amp; thought better of it each time—bc Americans want to preserve this majestic place https://t.co/vQRDHaIa8T"]["HAPPENING NOW: Sen Energy Comte is debating oil drilling in the #ArcticRefuge to pay for tax cuts for the ultra wealthy. #ProtectTheArctic. https://t.co/7DxCZ7AY4n"]["@SenMarkey @SenateGOP The Gwich’in people depend on the #ArcticRefuge. Drilling threatens their way of life &amp; food security. Tell @senateGOP to #ProtectTheArctic"]["@SenMarkey Econ reports show @SenateGOP's estimated revenues from drilling in the #ArcticRefuge are out of touch with reality https://t.co/gw9brB0Jtr"][".@SenMarkey &amp; I held a press call to OPPOSE GOP plans to drill #ArcticRefuge to pay for tax cuts for the ultra rich→ https://t.co/uF1xc1VqBY"]["@SenMarkey We'll talk more about how the #ArcticRefuge drilling budget revenue would cover less than 1% of @SenateGOP tax cuts for the super rich."]["I’m holding a press conf call with @SenMarkey at 12:30 ET about how opening the #ArcticRefuge to drilling WILL NOT solve our deficit."]["Jill &amp; I are keeping #NYC victims &amp; families in our hearts. Grateful for 1st responders as we learn more about this cowardly act of terror."]["I’ve been calling for a new AUMF for yrs—under D &amp; R presidents. In 2001-02 Congress never envisioned invading Syria—or indefinite war. https://t.co/8qm4iCuQsx"]["@JeffFlake The American people—through Congress—deserve a chance to decide how long and where the US wages war. Read my statement ↓ https://t.co/aJArmGmAEi"]["@JeffFlake This is legally questionable and dangerous position to put our nation and our military in. We have already invaded Syria under 9/11 AUMF."]["@JeffFlake Tillerson responded that the US will stay even if the Iraqis ask us to leave—under the existing AUMFs."]["Remember, the 9/11 &amp; 2002 AUMFs were approved 15+ yrs ago. As @JeffFlake said, none of the current SFRC members were even in the Senate then"]["Last night, I asked Tillerson &amp; Mattis how long the US will remain in the Middle East and under what authority. https://t.co/Jw5sEtbP6N"]["Lots of news happened Mon, but what Tillerson said in the Foreign Relations Cmte abt authority for the war in Middle East deserves attention"]["“Trump’s most enduring legacy may be cancer, infertility and diminished I.Q.s for decades to come.” https://t.co/EiFmR8Af84"]["@EPA Dourson’s science helped WV establish a PFOA safety standard 2,143x weaker than @EPA’s. Our families deserve a real chemical safety watchdog"]["#Dourson's weak safety standard enabled the chemical industry to keep poisoning this town. He doesn't belong at @EPA https://t.co/1qgAdbZCFq"]["Thanks to everyone in Southern NM who worked hard to create #OMDP4NM and are now fighting to keep it fully intact. I'm standing with you. https://t.co/o2sWAUl2qL"]["Great visiting Las Cruces to see how #OMDP4NM has helped local businesses &amp; the economy thrive. I'm fighting to keep #OMDP intact. https://t.co/0o9SPPNcYc"]["Honored to have addressed #NM @NAACP conference—thank you for working to advance justice throughout our communities  https://t.co/ueboP4AXip https://t.co/NgyljJl3dO"]["I challenge both parties to promise decisive action to defend the Constitution if @POTUS tries to fire Mueller or pardon his associates."]["Congress should take any &amp; all necessary steps on a bipartisan basis to protect the special counsel from being removed. My statement ↓ https://t.co/MHzbYHrkM1"]["Manafort/Gates indictments, Papadopoulos guilty plea demonstrate beyond doubt Mueller investigation is consequential https://t.co/Np5cA4fJc6"]["Tomorrow's National Prescription Drug #TakeBack Day—find a local collection site in NM &amp; help combat Rx drug abuse: https://t.co/ooawb5Fuhh"][".@SenBobCorker &amp; I worked hard to establish the registry &amp; ensure vets get answers. Impt VA continues to examine hazards to veterans’ health"]["The Burn Pit Registry helps the VA study how exposure to toxic fumes impacts vets' health; now they’ve ID’d a new lung hazard—blast exposure https://t.co/LUAoW4uGqC"]["Cutting @Interior’s budget by $1.7B while doubling entrance fees undermines #AmericasBestIdea. We’re demanding answers from the Trump admin. https://t.co/aoto3eidZ6"]["Trump’s outrageously expensive wall won’t stop the flow of drugs into our communities—his own chief of staff said so https://t.co/dgOBWOSiRO"]["@POTUS .@POTUS &amp; GOP Congress must join @SenateDems in addressing this crisis with the full and sustained funding and attention it deserves."]["@POTUS Opioid abuse is devastating families across #NM. I’m supporting a bill to provide states with $45 billion to address this crisis head-on."]["@POTUS Today’s declaration applies a band-aid to a gaping wound. This crisis is devastating families across America. We must—and we can—do more."]["@POTUS We need more than the $57,000 this declaration makes available to address a crisis that kills 142 Americans daily.\nhttps://t.co/E10udTuy7M"]["In the department of backward progress: @POTUS proposes doubling #NationalPark entrance fees while cutting @Interior's budget by $1.7B. https://t.co/B2rGggySEv"]["Members of the Gwich’in Nation &amp; @trusteesforAK came by to thank us for fighting for the #ArcticRefuge. Grateful for your support! https://t.co/0C24uo0Byu"]["Congrats to Santa Fe High School’s Faris Wald for winning the @Society4Science grand prize! Proud of #NM students leading the way in #STEM. https://t.co/Ij5KpISkcz"]["@SenatorLeahy @SenFeinstein @SenBlumenthal If Dourson &amp; other Trump nominees are influencing agency policy without confirmation, they’re violating the law &amp; circumventing Constitution"]["Trump administration must answer legal Qs for noms like Michael Dourson who are working w/o Senate confirmation. Our letter seeking answers↓ https://t.co/cpVAYKzP4J"]["The GOP should stop playing politics w/ people’s lives &amp; reauthorize these programs that help ensure Americans get the health care they need"]["GOP also failed to extend Maternal, Infant &amp; Early Childhood Home Visiting program—which helps 1k NM moms learn to care for their new babies"]["Without community health centers, many rural residents couldn't access care; without federal funding, many centers will be forced to close."]["Last month, Congress let #CHIP &amp; the Community Health Centers Program expire. And the Special Diabetes Program for Indians will expire soon."]["WATCH LIVE: I’m standing up for 9 million children across America who rely on #CHIP to access critical health care. https://t.co/58sPRxcHrK"]["This is the epitome of leaving the fox in charge of the henhouse. Join me in fighting to urge the full Senate to #RejectDourson."]["Today’s party-line vote for Michael Dourson in the EPW Committee is dangerous for public health and safety. My statement ↓ https://t.co/Oj81zrP8fc"]["@EPA At 10AM, @EPWDems will vote on whether to confirm Dourson. RT to join me in opposing this dangerous nominee https://t.co/cVvV7GV1si"]["This is yet another reason we need a strong leader at the @EPA's toxics bureau—not a toxicologist for hire. The Senate must #RejectDourson"]["Trump admin is trying to water down safety standards for asbestos &amp; other hazards—this violates the intent of Congress’ #chemicalsafety law. https://t.co/M3SdiqD2ex"]["#Dourson has made a career of creating junk science for corporate polluters and industry. He has no business at @EPA https://t.co/layZ8M8hSE"]["@SenateGOP I'll be on the Senate floor speaking in defense of @CFPB's arbitration rule--which protects millions of consumers: https://t.co/jJ8pIWEIEy"]["#NM Dreamers are every bit as New Mexican &amp; American as I am—except on paper. They deserve the opportunity to realize their American dreams."]["#Dreamers are integral to our communities &amp; our future. It's time to pass the #DREAMAct &amp; ensure they're #HereToStay https://t.co/4tjqgVOB4Q"]["Congrats to Grant County community leaders, citizens &amp; orgs being nationally recognized by @NatlDevCouncil for excellent work on water needs https://t.co/jainaBeZok"]["We've intro'd the USA RIGHTS Act to protect Americans’ security &amp; constitutional privacy rights by outlawing warrantless spying on citizens. https://t.co/vWODe6LCQi"][".@JeffFlake is a good man and a good senator, and AZ, the Senate and the nation are better off for his service. https://t.co/U4v4WGed3N"]["WATCH LIVE: I’m joining #EOWilson for #HalfEarthDay to discuss protecting America’s wildlife &amp; places https://t.co/R68EH7KlGZ @EOWilsonFndtn"]["@EPA Neglecting public health in order to get chemicals to market endangers families—I'll fight to ensure health/safety are EPA's top priorities."]["@EPA EPA announced the 1st 10 hazardous chemicals it will evaluate under #TSCA reform. Industry is already pushing back. https://t.co/shEjFgXVUl"]["@EPA \"Protecting people and the environment for decades to come… At least, that is what we planned.” https://t.co/ZLG1he3lqo"]["We passed #TSCA reform to ensure @EPA put public safety first. Now, industry insiders are putting our progress—and American families—at risk https://t.co/gVxLU6nYoV"]["Get a 360 degree look at #NM's creative economy at work @MeowWolf1 courtesy @nytimes!  https://t.co/ZVtmfSt9Pk"]["Last night I offered an amdt to block the sale of our nat’l parks &amp; refuges to pay for tax cuts. I’ll keep fighting to protect these places. https://t.co/Tk9bXDwl0u"]["Past US Presidents both Democratic and Republican stood up for the free press around the world. Will this @POTUS? https://t.co/94HdcwL6ss"]["WH should use all tools incl #NM nat'l lab expertise to help #PuertoRico rebuild. We must help our fellow Americans. https://t.co/o3zRrF5C6G"]["The Senate just approved my amendment w/@MartinHeinrich to fully fund Payments in Lieu of Taxes for rural communities in #NM &amp; the West."]["Working families are the backbone of #NM. I’m joining @SenatorHeitkamp to offer an amendment protecting the middle class from a GOP tax hike"][".@SenateDems &amp; I are fighting for simple principles: No tax cuts for the rich. No tax hikes on the middle class. No Medicare/Medicaid cuts."]["$1.5 trillion cut from Medicare and Medicaid. All to give a massive tax break to billionaires like @realDonaldTrump &amp; his cabinet."]["The Republican budget is a terrible deal for #NM. It's a tax cut for the 1 percent, financed on the backs of middle and low-income families."]["I’m standing up to the Republican attempt to use the terrible #GOPBudget to open 1.5 million pristine acres in #ArcticRefuge to development. https://t.co/QGtQ7DIwmR"]["ALERT: The vote is today. Republicans are sneaking a measure into the #GOPBudget to allow drilling in #ArcticRefuge https://t.co/DjuUnQaunP"]["Tell Congress to save the #ArcticRefuge. Drilling to pay for tax cuts for the ultra wealthy is an irreversible mistake. #NoArcticRider"]["#ArcticRefuge is our Serengeti—a majestic ecosystem and part of our national heritage. RT to join the fight to keep it wild. #NoArcticRider"]["GOP hopes no one notices their plan to open #ArcticRefuge to development &amp; destroy this treasure. I'm fighting back: https://t.co/5jos3mMP8P"]["\"No nomination has been as brazen, as dangerous to public health and as deserving of Senate rejection as that of Michael Dourson.\" I agree. https://t.co/CVilz7lG6e"][".@AjitPaiFCC needs to address the Commerce Committee and fully respond to @POTUS' dangerous attacks on the media. https://t.co/1hZo2Ugb1F https://t.co/oAm9uLTGCa"]["Happy birthday @MartinHeinrich! I couldn't ask for a more dedicated or hardworking partner for #NM in the Senate—honored to work with you. https://t.co/xt8mhp3EcT"]["This is a bare minimum response from @AjitPaiFCC, and several days late. @POTUS will continue his attacks—we need a stronger defense. https://t.co/uS8nbGnZlS"]["WATCH LIVE: We’re fighting to protect #ArcticRefuge from development. RT &amp; help reject this attack on America's wildest place #NoArcticRider https://t.co/fzMzSmeh3w"]["@POTUS Our unaccountable system is being taken advantage of by special interest $ and foreign actors. #WeThePeople must take our democracy back"][".@POTUS' lack of transparency begs the question: whose interests come first—his donors or #WeThePeople? It's time to fix our broken system. https://t.co/xhCSS5brOl"]["Each year, @balloonfiesta reminds the world why we call #NM the Land of Enchantment. Check out 2017 highlights: https://t.co/u5rjkCj0Va"]["Congress needs to show leadership where @POTUS won't. Both parties must come together to uphold our commitments and protect our security."]["Our allies will not support Trump’s dangerous #JCPOA decision. Congress should oppose &amp; not put U.S. in material breach of the agreement."]["Iran is in compliance with the #JCPOA. U.S. intel agencies and IAEA have both confirmed that Iran is not in breach of the agreement."]["The president’s dangerous Iran decision weakens the United States’ position in the Middle East and risks further conflict."]["The Trump administration's spiteful sabotage of #ACA will send out-of-pocket costs soaring and jeopardize access to care for millions. https://t.co/U2c43AaDgx"]["@POTUS Instead of relentlessly trying to sabotage the #ACA, @POTUS should work with us to improve health care for #NM &amp; the nation."]["Unacceptable attacks on the #FirstAmendment by @POTUS. @AjitPaiFCC committed to Congress to speak up at times like this. We are waiting. https://t.co/JN6qglesRw"]["The president's Orwellian rhetoric attacking the free press as \"fake news\" undermines our democracy. @SenateCommerce should call a hearing. https://t.co/em3EJQ2f7z"][".@POTUS is again openly suggesting an abuse of power. @FCC and @AjitPaiFCC must never act to retaliate against critical news. https://t.co/q1kEXkusMg"]["Killing the Clean Power Plan is a reckless and dangerous decision that jeopardizes our health, safety, economy and way of life."]["Trump admin's continued denial of climate change in service of big polluters will have grave consequences for our children &amp; grandchildren. https://t.co/wVYbzpOyOI"]["We can't afford to ignore #climatechange. Citizens must speak out, states &amp; Congress must act to cut pollution &amp; save clean energy economy. https://t.co/QyJFQt0HVH"]["I was honored to welcome #NM veterans to the WWII Memorial for their honor flight. Our nation is indebted for their service and sacrifice. https://t.co/RbWe9qg4rd"]["Trump admin has no business interfering with a woman’s health care decisions. This will take critical care away from women across America."]["Retweet if you believe 62 million women know their reproductive health needs better than the Trump administration. https://t.co/YITJMgHlVr"]["@SenateCommerce @POTUS .@POTUS' 1st Amdt attacks are unprecedented—@SenatorHassan &amp; I seeking a real hearing abt these assaults on 1st Amdt https://t.co/em3EJQjPZ7"]["Pulitzer said “Our Republic &amp; its press will rise &amp; fall together.” It’s time for a @SenateCommerce hearing abt @POTUS attacks on free press https://t.co/otOpwGSPXb"]["Unacceptable. The American people need to know who has access to @POTUS. This is why we must pass the #MarALagoAct. https://t.co/TkDXkuHx9j"]["We're launching the #SaveLWCF campaign to ensure this vital program continues working for decades to come. RT &amp; join the fight to #SaveLWCF!"]["In #NM, we can thank LWCF for urban parks like Valle de Oro, special places like Tent Rocks &amp; for conservation in our National Forests. https://t.co/p75XitRHCX"]["WATCH LIVE: I’m joining a bipartisan group of congressional lawmakers to call for the permanent reauthorization &amp; mandatory full funding of #LWCF—a smart investment that creates jobs, boosts local economies and helps fund conservation across #NM &amp; America. https://t.co/2X2CvfHdFm"]["@EPA Yesterday, I joined families from across the country who have lost loved ones and whose health is threatened by the same dangerous chemicals industry has paid Dourson to “research” in order to justify weak safety standards. #RejectDourson #ScienceForSale\n\nhttps://t.co/MDgf1ol0ZD"]["@EPA Dourson was paid by the chemical industry to research #TCE. Dourson argued for a #TCE standard up to 15x weaker than EPA’s standard. \n \n#Dourson has consistently downplayed concerns abt chemicals for industry clients—he has no business heading EPA's toxics bureau. #ScienceForSale"]["@EPA #Dourson was paid by PPG Industries to study 1,4 dioxane, a chemical PPG has released into the environment that led to contamination of a public water supply in Ohio.\n \nDourson argued for a 1,4 dioxane standard 1000x weaker than EPA's standard."]["If appointed, #Dourson will lead @EPA’s review of whether to ban the use of 10 hazardous chemicals under #TSCA. Dourson was paid to research 2 of these chemicals—#TCE &amp; 1,4 dioxane—by the same corporate interests that hope to keep them in circulation. #ScienceForSale"]["Dr. Michael Dourson has made a career of creating junk science for corporate polluters and industry. \n \nTrump wants to make him head of the EPA office charged with protecting our families and environment from dangerous toxic chemicals. #ScienceForSale\n \nhttps://t.co/jLTuQc5O09"]["@SenBlumenthal @POTUS @EPA The agency tasked with protecting the health &amp; safety of American families &amp; our environment should put the health &amp; safety of American families &amp; our environment AHEAD of industry interests."]["@SenBlumenthal @POTUS @EPA The families with us have lost loved ones or experienced health impacts from exposure to dangerous chemicals like #TCE, #PFOA &amp; #chlorpyrifos—the same dangerous chemicals Dr. Dourson has downplayed concerns over on behalf of his chemical industry clients. https://t.co/o4rzJfi9CT"][".@SenBlumenthal, families &amp; I are speaking out against Michael Dourson, @POTUS' nominee to lead @EPA's toxics bureau. Dourson is an industry hired gun whose junk science is used to justify weak safety standards that put Americans' health &amp; safety at risk. https://t.co/Lo50K43aPN"]["@MartinHeinrich Senator Domenici and I didn’t always see eye to eye on policy—but I always appreciated that he cared deeply about the issues and did his best to put the nation &amp; #NM's interests first. I join all of #NewMexico in thanking him for his contributions and in mourning his passing."]["Watch live: I’m joining @MartinHeinrich on the Senate floor to remember the late Senator Pete Domenici and his lifetime of work for #NewMexico. https://t.co/VsyqSYRruN"]["If you’re in #NM and want to help, #LasVegas victims need blood donations. Find a location near you in #NM: https://t.co/3NAUEbbHgq"]["One #LasVegas victim was Lisa Romero, a secretary at Miyamura HS in Gallup #NM. She was adored by everyone &amp; her loss will be deeply felt."]["We must come together to support the victims in #LasVegas, thank 1st responders, &amp; focus resources &amp; policy on preventing future massacres. https://t.co/4fB7E0s1IR"]["Heartbroken to learn of the horrific shooting in Las Vegas last night. My thoughts are with the victims and their loved ones this morning."]["Secretary Price got caught with his hand in the taxpayer's cookie jar. Returning one cookie doesn’t make it okay. https://t.co/6MfCQgOuRj"]["I’m demanding answers from @EPAScottPruitt abt his reported excessive spending of taxpayer money on $25K \"privacy booth\" &amp; chartered planes. https://t.co/P3kCdurNR8"]["Every #NM family deserves the same chance to succeed. In the 30’s, that meant rural electricity. In 2017, it means rural #broadband access."]["Universal #broadband will close the #homeworkgap facing rural #NM kids who need internet to learn &amp; do schoolwork.\n https://t.co/Mb132HBjNB"]["Rural #NM needs #ABetterDeal on high-speed internet. #Broadband gives rural communities access to education, health care &amp; job opportunities https://t.co/eLWrnhwHCb"]["1/2 of all school districts can punish kids when their parents haven't paid their lunch bill. Share &amp; help end #lunchshaming in America. https://t.co/cwD9Bztz0D"]["Welcome back! We’re all grateful for your return and continued recovery. https://t.co/iQsorkPDJT"]["Productive committee hearing today examining what support, resources &amp; research we need to help #EndTrafficking in Native communities. https://t.co/OJhWbNEn7H"]["@RepDavidEPrice @SenJeffMerkley @SenatorLeahy @RonWyden @SenatorDurbin @amyklobuchar @SenWhitehouse @SenGillibrand @SenFranken @SenatorBaldwin @SenAngusKing .@SenMarkey @maziehirono @SenWarren @ChrisVanHollen! Proud to work with you all to champion the reforms that Americans are demanding. (3/3)"]["@RepDavidEPrice @SenJeffMerkley .@SenatorLeahy @RonWyden @SenatorDurbin @amyklobuchar @SenWhitehouse @SenGillibrand @SenFranken @SenatorBaldwin @SenAngusKing (2/3)"]["Great support for #WeThePeople Act. Together, we'll #GetMoneyOut and take our democracy back. Thanks @RepDavidEPrice @SenJeffMerkley (1/3)"]["@POTUS Public service is its own reward. No government official should live a life of luxury on the taxpayer dime. This behavior is unacceptable."]["Price flies private for $400k+ , Mnuchin goes eclipse watching &amp; Pruitt builds a $25k phone booth. @POTUS—stop this waste of taxpayer $ NOW. https://t.co/xVN6ZrEy8T"]["@RepDavidEPrice @SenJeffMerkley @SenatorLeahy @RonWyden @SenatorDurbin @amyklobuchar @SenWhitehouse @SenGillibrand @SenFranken @SenWarren RT if you want to take democracy back from the privileged, powerful few &amp; #GetMoneyOut. #WeThePeople Act will return democracy to the people https://t.co/V7mdE76vxD"]["@RepDavidEPrice @SenJeffMerkley @SenatorLeahy @RonWyden @SenatorDurbin @amyklobuchar @SenWhitehouse @SenGillibrand @SenFranken @SenWarren #WeThePeople Act fixes our broken campaign $ system, ends partisan gerrymandering, increases voter participation &amp; boosts govt transparency. https://t.co/oMEi1f0iCT"]["Our democracy has reached a crisis point. Today, we're introducing the #WeThePeople Act to #GetMoneyOut and return democracy to the people. https://t.co/w05uabPZpV"]["We must #EndTrafficking in Native communities. I'm working to collect info &amp; provide victims &amp; Tribes with the support/resources they need."]["The Senate Committee on Indian Affairs is holding a hearing on human trafficking in Native communities. Watch live: https://t.co/EuO1qibrex"]["Looking forward to a good conversation about the urgent need for #campaignfinance reform at @BrookingsInst w/ @RepDavidEPrice and more."]["Great meeting w/Col. Cartier &amp; the 58th SOW to discuss @KIRTLAND377ABW's continued success &amp; how to keep supporting our great airmen &amp; women https://t.co/KHcdXiia7Y"]["I’ve enjoyed working with @SenBobCorker on Senate Foreign Relations. Though we have our differences, the Senate will miss his integrity. https://t.co/KfQBC8G1M7"]["US Administration must provide military, disaster &amp; humanitarian assistance to help maintain order, &amp; assist w/ food &amp; fuel distribution."]["Our fellow Americans in #PuertoRico &amp; #USVI are suffering in the wake of catastrophic hurricanes. US govt needs to step up aid efforts now."]["Thank you @SenCortezMasto &amp; @SenatorHeitkamp for defending Native Americans’ health care and highlighting the need for proper consultation."]["Let’s commit to moving our country past these bitter, political fights by working together and doing our jobs for the American people."]["We can’t be complacent. The GOP has already indicated they'll keep trying to pass #TrumpCare—in 2018 &amp; beyond—we need you to stay involved!"]["Americans have defeated #GrahamCassidy with calls, letters &amp; demonstrations. Now, let's work together to deliver quality health care to all. https://t.co/jbhVK6DTf9"]["Thank you everyone in #NM &amp; across America who fought and defeated #TrumpCare. Let’s keep working to get everyone the health care they need."]["Any health care bill must uphold Congress' moral and legal responsibility to Native Americans. Watch my speech live: https://t.co/Y3fMhtyH1U"]["#GrahamCassidy is dead—but GOP attacks on #ACA aren't. I'll keep fighting to ensure Indian Country gets quality care https://t.co/PTENgYT8re"]["@MartinHeinrich NM is already seeing the impacts of #climatechange. We can’t respond &amp; adapt if we pretend they don’t exist or hide the truth from our kids."]["@MartinHeinrich If we want NM to lead in the modern high-tech economy, we must welcome cutting edge scientific thinkers &amp; innovators, not suppress #science."]["My op-ed with @MartinHeinrich urging all #NM speak out against censoring #climatechange education in K-12 science. https://t.co/Wn4WycaBv8"]["It's time for Senate GOP to come together with Democrats to make sure that every New Mexican and every American has the care they need."]["Even this very limited score from @USCBO paints a scary picture of #GrahamCassidy. Millions would lose coverage under #TrumpCare."]["I’m inspired by the intelligence &amp; compassion of these young people—and i’m proud of their commitment to building a better future for #NM."]["Great taking questions from and exchanging ideas with New Mexico’s future leaders about the challenges &amp; opportunities facing #NM &amp; America. https://t.co/2JiKaqGoGs"]["Instead of pushing dangerous #TrumpCare bills, we should come together in a bipartisan way to improve health care for Indian Country. https://t.co/S3qRDmdza7"]["#GrahamCassidy is another version of #TrumpCare that would be disastrous for American Indians &amp; Alaska Natives https://t.co/sOt8WuSQsg"]["Excited to talk public policy with 120 students from across #NewMexico at my Student Leadership Institute today at the Roundhouse. https://t.co/rvElu8idc5"]["Jill and I wish everyone in New Mexico and across the US celebrating #RoshHashanah a happy new year. Shana Tova!"]["NM is fed up with threats to health care. #GrahamCassidy is GOP's most radical #TrumpCare plan yet. Spread the word. We can't stop fighting."]["#GrahamCassidy pulls Medicaid, guts essential health benefits, risks protections for pre-existing conditions. Help fight to #KeepNMCovered"]["The GOP is forcing a vote on the worst #TrumpCare bill yet—threatening health care for thousands of #NM families like these. #SaveACA https://t.co/sNTuegJERC"]["Taking away health care from millions of people and destroying Medicaid is not a \"replacement” for the #ACA. #GrahamCassidy"]["Thinking of everyone in #MexicoCity &amp; praying for their safety. Americans on the scene should contact loved ones &amp; let them know you're safe"]["#GrahamCassidy might be the worst version of #TrumpCare yet. It's going to take all of us working together to stop it—RT &amp; raise your voice!"]["The GOP is rushing to pass #TrumpCare one more time before anyone notices. Help make sure they don't get away with it."]["@MartinHeinrich @SenBennetCO @RonWyden @SenMarkey @repbenraylujan Our #MiningReform bill requires mining corporations to pay their #fairshare so we can clean up old mines &amp; prevent future disasters."]["@MartinHeinrich @SenBennetCO @RonWyden @SenMarkey @repbenraylujan Our hardrock mining laws were written when we traveled by wagon, mail came by pony &amp; doctors used leeches. Time to modernize. #MiningReform https://t.co/WF8X1lz3SN"]["@MartinHeinrich @SenBennetCO @RonWyden @SenMarkey @repbenraylujan Taxpayers shouldn’t be on the hook for billions of dollars of abandoned mine clean-up. We must fix America’s broken mining law from 1872. https://t.co/V0WS9apx7v"]["@MartinHeinrich @SenBennetCO @RonWyden @SenMarkey @repbenraylujan #GoldKingMine disaster highlights the threat posed by nearly 500,000 abandoned mines. #MiningReform will protect communities and taxpayers. https://t.co/tMI253bKnD"]["Time to end the sweetheart deal mining corps have had for 150 yrs &amp; ensure taxpayers get a fair share of profits from mining on public lands https://t.co/E8ZxlGgesr"]["The earth's age, evolution &amp; #climatechange aren't up for debate. #NM kids deserve the best education we can provide, not #alternativefacts. https://t.co/fLHmypxBgm"]["@SecretaryZinke .@POTUS must reject Zinke’s report, honor the work and wishes of #NM communities &amp; leave intact #OMDP4NM, #RGDN &amp; all our #MonumentsForAll. https://t.co/2qEqmlnbnl"]["@SecretaryZinke Zinke’s sham report was produced behind closed doors, ignoring #NewMexico stakeholders' overwhelming support for our #MonumentsForAll."]["@SecretaryZinke #OMDP &amp; #RGDN are essential to #NM's heritage &amp; economy. Communities &amp; Tribes have worked for decades to ensure their permanent protection."]["@SecretaryZinke Retweet if you believe America's #MonumentsForAll should not be privatized, leased, or sold to the highest bidder."][".@SecretaryZinke's sham report is a politically driven attempt by Washington to justify reducing protections for America's #MonumentsForAll. https://t.co/VhhgTu3Swb"]["Americans deserve to know who's influencing WH policy—this admin is failing on transparency, so Congress must step in &amp; pass my #MarALagoAct https://t.co/HclR0ImZL9"]["Co-hosting a briefing w/ @niwrc today on this issue. I'll do everything I can to combat abuse &amp; assault &amp; get Native victims needed help."]["Native women face high rates of abuse &amp; assault, but they often lack access to resources when they experience domestic violence."]["Impt resource for #NM Native communities. Indian Country is disproportionately impacted by domestic violence. Call 1-844-7NATIVE to get help https://t.co/jBWdmiTQcO"]["#MedicareForAll will make prescription drugs affordable and ensure American families can get the health care they need. My take: https://t.co/FeZCkdbIDN"]["#ChildCare4All will help #NM kids seize their potential while giving working parents the chance to advance their careers &amp; boost our economy"]["Children do better throughout life if they have access to quality child care &amp; Pre-K. Every kid in #NM deserves the opportunity to succeed. https://t.co/Q49rFOs9Ml"]["#NM parents shouldn't have to choose between holding down a job &amp; getting quality care for their kids. I'm proud to support #ChildCare4All https://t.co/LqRVS1YoDd"]["@billscher @awgaffney @sangerkatz Thanks for a great conversation about the challenges in our health care system &amp; possible solutions to enable every American to get covered."]["Going on @1a to talk about #MedicareForAll. It’s time to ensure every American can get the care they need. Tune in: https://t.co/B9rpXOd8Bs"]["Happy 70th birthday @usairforce! Today we celebrate our brave airmen &amp; women and the critical missions of Kirtland, Cannon &amp; Holloman AFBs. https://t.co/ZLoLQeHJjX"]["We risk throwing away our shot to inspire kids &amp; enrich society if we underfund arts &amp; humanities. Great conversation w/ @Lin_Manuel today. https://t.co/8eVTEpMg87"]["@SenSanders It’s time to put patients before profits, make prescription drugs more affordable &amp; end medical bankruptcy. It's time for #MedicareForAll."]["@SenSanders I’ve been working to pass universal health care in Congress since ’03—I’m proud of the progress we've made &amp; stand ready for the fight ahead"]["Joining @SenSanders to call on Congress to pass #MedicareForAll &amp; make health care a right, not a privilege. Watch: https://t.co/PfwpZlxyHa"]["Every New Mexican and American should be able to see a doctor when they need to and get quality health care regardless of their income. https://t.co/6MrUNFv4sX"]["What I admire most about Sen. Domenici is that during his over 30 years representing NM in the Senate, he always kept New Mexicans first. https://t.co/xiKXXYME1d"]["Jill and I send our deepest sympathies to the family of former Senator Pete Domenici. https://t.co/colah9biSZ"]["Health care is a human right. Every American should be able to see a doctor when they’re sick. That’s why I support #MedicareForAll. https://t.co/LcfviYwTYD"]["@POTUS @RepCummings @SenWhitehouse @SenBlumenthal @SenGaryPeters Protecting the 1st family is a matter of national security. That’s one reason we provide POTUS with the White House &amp; Camp David."]["@POTUS @RepCummings @SenWhitehouse @SenBlumenthal @SenGaryPeters @POTUS’ insistence on staying at #MarALago &amp; Bedminster is making it impossible for Secret Service to protect 1st family &amp; follow the law."]["@POTUS @RepCummings @SenWhitehouse @SenBlumenthal @SenGaryPeters Secret Service is burning thru taxpayer $ at a staggering rate to protect @POTUS @ private resorts instead of the WH https://t.co/ZzNaUCAZwp"]["We’re demanding DHS investigate the unprecedented amount of money the Secret Service is being forced to spend because of @POTUS' travel. https://t.co/S2J5DCBY9I"]["Today, 1st responders lead the #Irma and #Harvey recovery efforts. Even in our darkest hours, we can overcome anything when we stand united."]["We also commemorate the service &amp; sacrifice of our service men &amp; women and salute many Americans still proudly serving our country overseas."]["On #September11th we come together to remember those we lost &amp; the bravery of 1st responders who risked everything to save fellow Americans. https://t.co/NHvdrnccnC"]["Joined my colleagues to pass critical disaster relief $ for #Harvey &amp; #Irma victims. We stand with you during the difficult recovery ahead."]["800k #Dreamers in the US—nearly 8,000 in #NM—want to chase their dreams &amp; strengthen America. Let's pass #DreamAct &amp; give them that chance."]["Carlos is a volunteer firefighter studying to become a mechanical engineer at NMSU. Without #DACA, his bright future is in in danger. https://t.co/wRLjYgouC5"]["Brandon is a #Dreamer who's studying to be an architect &amp; volunteering in #NM while working to help his family afford medical expenses. https://t.co/yKauShbALo"]["Roxana said “Santa Fe, #NM, is my home...it’s where I know people…it’s my life. It’s something that is mine but doesn’t truly belong to me.”"]["Roxana came to #SantaFe when she was only one. She’s a #DACA recipient, medical assistant, and nursing school student. https://t.co/bxfF5n9HLM"]["WATCH LIVE: I’m standing up for #Dreamers, speaking out against Trump’s cruel decision &amp; calling for the #DreamAct https://t.co/iyVYP46yUV"]["Thinking of the many people in the Caribbean, Puerto Rico, USVI &amp; Florida in #Irma’s path. Please be safe and heed local officials' advice. https://t.co/YqQXPcT9RB"]["Democrats are united. We will do whatever it takes to ensure that #Dreamers can give back to their communities &amp; help build a better future."]["#Dreamers are asking for their chance to achieve the American dream. We’re asking GOP to do what’s right &amp; help us codify that opportunity."]["Democrats stand ready to pass the #DreamAct. Many Rs have signaled support for #Dreamers—but the time for talk is over. Now they must act. https://t.co/2hF0YQZDQx"]["Watch our press conference live: https://t.co/skXwpoSS0E"]["I'm on the way to the Capitol to call on GOP leaders to help pass the #DreamAct &amp; secure #Dreamers' bright future in America once &amp; for all"]["Proud to see so many #NM students standing up to #DefendDACA and demanding Congress protect the opportunities that #Dreamers have earned. https://t.co/TksH68YWCS"]["Carlos and the 800,000 #Dreamers like him \"have proven ourselves of being worthy of being in the US.” Help me share his story if you agree."]["Carlos grew up like every other American kid and knows no other country. He says #Dreamers “were given wings when we got #DACA permits.”"]["Carlos—#Dreamer, NMSU student &amp; volunteer firefighter—shared his story with me. He says “#Dreamers need your support.” RT &amp; help #DefendDACA https://t.co/ChbuvhtO6c"]["I said before that Trump is increasingly unfit to be POTUS. His #DACA decision, following #Charlottesville &amp; Joe Arpaio, is more evidence."]["#Dreamers' future is in the GOP’s hands. Now is the time to stand up &amp; speak out—let your representatives know you want to #DefendDACA."]["Trump’s decision is shameful. #Dreamers represent America's best—talented, patriotic young people who want to give back to their communities"]["Ending #DACA is a cruel, short-sighted mistake that will hurt families and our economy. I will fight tooth and nail to defend #Dreamers. https://t.co/bk6LOR2wfo"]["On #LaborDay we celebrate the contributions of NM &amp; US workers &amp; their determination to ensure all families can achieve the American dream."]["Lucky gave selflessly to the people of #NM. He understood the people behind the numbers—their struggles, hopes and dreams. We will miss him."]["Jill &amp; I offer our heartfelt condolences to the family &amp; friends of former NM Rep. Lucky Varela. We join all of NM in mourning his passing."]["A wall along the entire border would not increase security, it would cost billions in taxpayer $ and stand as a symbol of waste and bigotry."]["DACA allowed thousands of young people to get legal status to continue their education &amp; contribute to the only country they've ever known."]["The divisive threats from the Trump admin - to strip DACA &amp; build a border wall - are not what this nation of immigrants stands for."]["I'm heartbroken by the horrific events in Clovis tonight. Please join Jill and me in keeping Clovis in your thoughts and prayers."]["We must look out for each other in times of crisis. For info on how you can help recovery efforts in Texas: https://t.co/RDPzz46DQy"]["My thoughts and prayers are with the people in the path of Hurricane Harvey. Stay alert and stay safe."][".@POTUS is trying to divide us w/ a pardon of Joe Arpaio &amp; transgender ban. RT to say you will stand strong for our great diverse nation."]["Pardoning Joe Arpaio and banning transgender troops - just weeks after #Charlottesville - is hurtful and wrong."]["If Zinke has recommended serious reductions to #NM #MonumentsForAll, he has badly misjudged the admin's authority under the Antiquities Act."]["#NM needs transparency. The communities have worked hard to protect #OMDP4NM &amp; #RGDN deserve to know what this admin plans to do with them."]["Today @SecretaryZinke cited #OMDP4NM &amp; #RGDN as #MonumentsForAll he may alter. The threat to #NM's national monuments is still very real. https://t.co/omd8865Klh"]["@CNN Instead of shaming kids from struggling households, we should work to find solutions to end childhood hunger &amp; support families in need."]["@CNN These kids have done nothing wrong &amp; they shouldn't be embarrassed in school because of a debt that they have no power to pay. #lunchshaming"]["We can’t expect kids to succeed in school when they’re hungry &amp; face public embarrassment. Read my op-ed for @CNN on ending #lunchshaming. https://t.co/JQhZXkQD9b"]["@SecretaryZinke If @SecretaryZinke listens to #NewMexico voices, there’s really only one conclusion—#OMDP4NM and #RGDN should be left fully intact."]["@POTUS’ threat to shrink or rescind #MonumentsForAll is a threat to corporatize our natural treasures and an attack on our way of life."]["@SecretaryZinke @MartinHeinrich @RepLujanGrisham @repbenraylujan .@POTUS doesn’t have the legal authority to rescind #NewMexico's #MonumentsForAll. If he tries, we will fight him every step of the way."]["On Monday, #NM Democrats urged @SecretaryZinke to honor our state's overwhelming support of #MonumentsForAll &amp; keep #OMDP4NM &amp; #RGDN intact. https://t.co/0zEO87uhN1"]["@SecretaryZinke #MonumentsForAll are part of the living culture of Tribes &amp; pueblos—revoking protections would betray our government's commitments to Tribes"]["@SecretaryZinke .@SecretaryZinke should listen to the #NM hispanic, business &amp; faith leaders, sportsmen, Tribes &amp; veterans who support our #MonumentsForAll. https://t.co/Hy2g5t2KBU"]["Weakening #MonumentsForAll protections would be an affront to local communities who worked to preserve public lands for future generations."][".@SecretaryZinke will submit his #MonumentsForAll review soon. RT to tell him you support protecting our natural treasures. #OMDP4NM #RGDN https://t.co/6f6l62IG0a"]["#MonumentsForAll are a part of America's spirit and soul. They're essential to #NM’s way of life, culture &amp; economy. Let's #KeepItPublic. https://t.co/Z9wwgN9Ps1"]["So sorry to hear the terrible news from the USS John S. McCain—Jill &amp; I are thinking of and praying for the missing sailors &amp; their families"][".@POTUS needs to invest in diplomacy, fill out State Department staff and develop a real and effective strategy to defeat ISIS &amp; Al-Qaeda."]["The war in Afghanistan is now our longest military engagement. A troop increase alone won't defeat terrorism in Afghanistan or end this war."]["@SecretaryZinke @MartinHeinrich @RepLujanGrisham @repbenraylujan Over 90% of 2.7 million comments opposed changing or revoking #MonumentsForAll—Trump WH should listen to the people, not corporate interests"]["@SecretaryZinke @MartinHeinrich @RepLujanGrisham @repbenraylujan #NM voices have been clear—#OMDP &amp; #RGDN are part of our history &amp; the living culture of local Tribes &amp; pueblos. They must stay protected. https://t.co/8jxfLFP5KE"]["@SecretaryZinke @MartinHeinrich @RepLujanGrisham @repbenraylujan #MonumentsForAll showcase #NM's abundant natural beauty &amp; archeological wonders, bring visitors from across America &amp; drive local business"]["We’re urging @SecretaryZinke to listen to #NM communities, business leaders &amp; Tribes who overwhelming support #OMDP &amp; #RGDN #MonumentsForAll https://t.co/U72bpv6reA"]["Visit one of these #NewMexico parks to watch the eclipse safely &amp; learn about this spectacular celestial event: https://t.co/FfPJnrxu2K"]["#SolarEclipse2017 will soon become visible in #NM. Make sure you’re putting safety first and protecting your eyes. https://t.co/CDuH1aP9MY"]["Trump must answer for his behavior. We all must be clear that there are not 'two sides’ to the story on racism, neo-Nazism &amp; white supremacy"]["Steve Bannon may be gone from the White House but that does not absolve Donald Trump of his inexcusable, bigoted words and actions."]["RT and spread the word—Congress must #BanChlorpyrifos to protect American kids, farmers and farmworkers. https://t.co/at6X6FCmpn"]["Americans in #Barcelona—please use social media or other methods to notify family and friends that you are safe https://t.co/VoVaHiDgE5"]["Jill &amp; I are heartbroken to learn of the horrific attack in #Barcelona. Our thoughts are with the victims of this tragedy &amp; their families."]["Delivered keynote at @NMWRRI’s Water Conference. It’s critical we prepare for drought, adapt to #climatechange &amp; modernize our water systems https://t.co/wp6nCpME7A"]["DACA le brindó la oportunidad a #DREAMers de inscribirse en la universidad, conseguir empleo y beneficiar a sus comunidades sin miedo."]["After 208 days of failing to lead, threatening war, and attacking American values, it's increasingly clear that Trump is not fit for office. https://t.co/OeZ4UCKXy8"]["After 5 years of #DACA, we celebrate #Dreamers and recommit to securing their future with the #DreamAct &amp; comprehensive immigration reform."]["#DACA has allowed #Dreamers to go to college, work and give back to their communities without fear. We must #DefendDACA. #DACAworks"]["My #MOMSAct ensures Nat'l Guard &amp; Reserve mothers don’t have to choose between being a mom &amp; serving their country https://t.co/w1SegcHXM8"][".@EPA shouldn’t be a rubber stamp for the chemical industry. They must put public safety 1st—as Congress intended when passing #TSCA reform. https://t.co/WzRUXNH57p"]["Met w/#NM Nat'l Guard abt my #MOMSAct to ensure female Guard &amp; Reserve members don’t have to sacrifice pay &amp; credits during maternity leave. https://t.co/zoVz9PxE3F"]["These men answered the call to fight evil abroad in the face of extreme adversity at home. Let’s pledge to follow their courageous example."]["On Navajo #Codetalkers Day, we honor the brave service of the 400 Navajo who were instrumental to American victory in the Pacific in WWII."]["We must honor the memory of those killed in #Charlottesville by showing we will not condone the ugly forces of white supremacy and hatred."]["We can't ignore that the #Charlottesville white nationalists cited POTUS' words: “take back America.” Remember—America belongs to us all."]["@USGLC @POTUS Eroding relationships with our neighbors and attacking international norms is not a sustainable economic strategy for New Mexico or the US."]["@USGLC @POTUS Rhetoric about “building a wall” has strained relations w/ Mexico &amp; talk of tearing up NAFTA threatens economic development in #NewMexico."]["@USGLC @POTUS In #NM, we feel direct and real implications of U.S. political and economic relations with other countries."]["@USGLC Now @POTUS wants to cut $300M from PEPFAR’s budget &amp; cut the State Dept &amp; USAID 31%. I'm strongly opposed &amp; will fight those dangerous cuts."]["@USGLC For example, President Bush created PEPFAR in 2003 to combat AIDS abroad. Today, it's saved 11.5M people &amp; 2M babies have been born HIV-free"]["@USGLC The world recognizes our leadership. From my seat on the Foreign Relations Cmte, I’ve seen the good smartly targeted intern'l aid has done."]["@USGLC US diplomatic, trade, &amp; humanitarian efforts since WWII have led to the largest economic growth &amp; the most peaceful period in human history."]["On my way to @USGLC to speak about how America's global leadership makes a difference for #NM. Watch live: https://t.co/fZpRpZHODH #usglcNM"]["The Charlottesville march goes against the values Americans hold dear. We all must stand against the destructive forces of racism and hatred"]["2014, '15, &amp; '16 each set global temperature records. Failure to #ActOnClimate means more extreme temps &amp; weather that endanger our security https://t.co/Ce27HvbNht"]["@SenFranken @SenCortezMasto @SenatorHeitkamp Congress needs to provide Tribes w/more resources to #Endtrafficking &amp; ensure that all Native victims get the support they desperately need."]["I recently held a stakeholder meeting in DC on how to prevent, prosecute, &amp; improve data collection on human trafficking in Indian Country. https://t.co/vgW9tVgiFo"]["This is a step in the right direction—but Congress must do its part to help #EndTrafficking in Native communities. https://t.co/7Gm75kiUeA"]["I urge the White House to avoid further escalation in North Korea. We need sober and steady diplomacy first. https://t.co/gWbsO1KyuH"]["Our delegation is united: #NM needs a strong @USDARD state director to support jobs &amp; economic development in our diverse rural communities. https://t.co/eT6DXSmPcH"]["Many in #NM worked yrs for access to #Sabinoso. This is a key step to unlocking this pristine land for sportsmen &amp; all outdoor enthusiasts. https://t.co/FyUiVz6NRN"]["@EPA I will be examining this development in the new chemicals program and will take any steps necessary to prevent it from being weakened."][".@EPA reviews are critical, but if EPA's prioritizing speed over safety, that's not what Congress intended w/reform https://t.co/qT3rsrLl6K"]["@POTUS We can’t wait to #ActOnClimate. I'll do everything in my power to fight this threat to our health, economy &amp; future. https://t.co/heOdXzNJHA"]["@POTUS .@POTUS called #ParisAgreement a bad deal for America—the real bad deal is saddling our kids w/higher temps, extreme weather &amp; rising oceans"]["@POTUS Extreme weather associated with climate change is \"having significant, direct efforts on the United States and the global economy &amp; society”"]["@POTUS “From the top of the atmosphere to the depths of the oceans,” there’s ample evidence we're already experiencing #climatechange's ravages."]["The only thing more alarming than #climatechange impacts? Scientists feared @POTUS would suppress the findings. https://t.co/duGh2ioTCh"]["@SenMarkey @brianschatz @RonWyden @SenFranken @SenBlumenthal @SenatorBaldwin @SenJeffMerkley @SenWarren @CoryBooker @SenatorHassan Your voice matters. Tell the @FCC that the internet should stay open, free and fair for everyone—not just those who can afford to pay extra."]["@SenMarkey @brianschatz @RonWyden @SenFranken @SenBlumenthal @SenatorBaldwin @SenJeffMerkley @SenWarren @CoryBooker @SenatorHassan Americans don’t want to change the internet as we know it. They're speaking out in record numbers for #NetNeutrality https://t.co/31waZUFxrD"]["@MartinHeinrich @SenBennetCO @repbenraylujan Western taxpayers shouldn’t be on hook for tens of billions of dollars of needed mine clean-up. We need to fix broken mining law from 1872."]["@MartinHeinrich @SenBennetCO @repbenraylujan Mining corps don't pay royalties. #MiningReform ensures they pay their fair share so we can clean up old mines &amp; prevent future disasters."]["#GoldKingMine disaster underscores threat posed by 500k abandoned Western mines. Our #miningreform bill helps protect communities, taxpayers https://t.co/TOhl08jwV0"]["I voted no on #TaylorForceAct. It fails to protect humanitarian aid that helps prevent unrest and future radicalization in the West Bank​."]["Women in the National Guard &amp; Reserves shouldn’t lose out on pay or creditable service during maternity leave. Let's close this loophole. https://t.co/AHaDgyiXgL"]["#NM needs comprehensive #paidleave that reflects the realities of today’s jobs. #FamilyAct will help boost working families &amp; our economy."]["No one should have to choose between taking care of a loved one and taking home a paycheck. That’s why I support the #FamilyAct. #FMLA24"]["Americans should know who's influencing executive branch policy. There’s little difference between hiding visitor logs and hiding visitors. https://t.co/un4B6Qoamc"]["Spoke about the value of public service &amp; bipartisanship w/congressional interns today—special thanks to my interns for all their hard work! https://t.co/8vn2mdrTaC"]["@EPA @SenBlumenthal @CoryBooker @SenGillibrand @SenatorDurbin @SenatorCardin @SenMarkey I'm speaking out against #chlorpyrifos on the Senate floor. Watch live and help us spread the word: https://t.co/Tzq7bZSk0g #BanChlorpyrifos"]["@EPA @SenBlumenthal @CoryBooker @SenGillibrand @SenatorDurbin @SenatorCardin @SenMarkey When parents feed their kids fruits &amp; vegetables, they're trying to do the right thing. They shouldn't worry if healthy foods are dangerous. https://t.co/qYvFMimntM"]["We've introduced a bill to #BanChlorpyrifos. @EPA refuses to act to protect our children from this toxic pesticide, so Congress must step in https://t.co/8yQzKGhFQZ"]["Never intended my 2001 vote authorizing use of military force to cover US military action in Syria in 2017. We need to debate a new #AUMF. https://t.co/P0Ni7aqlHz"]["@JRosenworcel Committee also approved Chairman Pai &amp; Carr nominations. I'll keep holding #FCC accountable to protect free speech https://t.co/PBAGIFYZkJ"]["Just voted to reappoint @JRosenworcel to the #FCC. Looking forward to continuing our work to expand rural broadband &amp; close the #homeworkgap https://t.co/kLGWwewjNT"]["@AmeriCorpsNCCC @NFO_NM .@AmeriCorpsNCCC helped to give Taos vets the community support they deserve at NFO's Military Family Respite Center https://t.co/dw9oCTzbeH"]["@AmeriCorpsNCCC @NFO_NM In Santa Clara, @AmeriCorpsNCCC repaired &amp; restored historic Ft. Bayard &amp; completed important food security projects https://t.co/aqx3EUKHIv"]["Thanks to @AmeriCorpsNCCC for their work in #NewMexico restoring the historic site at Fort Bayard &amp; @NFO_NM's Military Family Respite Center"]["After hastily written/secretly negotiated GOP bills, it's time to work together to bring down costs, lower Rx prices &amp; expand access for all"]["Health care shouldn't be a privilege only for those who have the money &amp; means. Let’s work to ensure everyone gets the health care they need"]["Last night proved that the voices of regular people can make all the difference in Washington DC. Thanks to all who spoke up to #SaveACA. https://t.co/vcFZdWEa3U"]["From rural counties in every corner of #NM, I was told repealing #ACA and gutting Medicaid would shutter hospitals &amp; devastate communities. https://t.co/lEmmM25ju3"]["Senate Republicans released #TrumpCare at 10pm. Now they want to vote on it while you're sleeping. RT to tell them you're wide awake."]["Just voted for Russia sanctions. @POTUS needs to sign our bill now and show Russia that meddling in our elections has serious consequences."]["Today, I advanced an amendment directing DOJ to prevent the unjust firing of #TrumpRussia Special Counsel Mueller &amp; adhere to rule of law. https://t.co/hi8FMDH9mj"]["Our #BanChlorpyrifos bill will help protect kids, farmers and farmworkers from exposure to this dangerous pesticide. https://t.co/REhcBKeq6t https://t.co/8XLxF5AlUk"]["@SecretaryZinke .@POTUS' threat to rescind or reduce #RGDN &amp; #OMDP puts #NewMexico’s $9.9 billion recreation economy at risk: https://t.co/T7ptw5b2Hc"]["If @SecretaryZinke listens to #NM, there’s only one conclusion—our #MonumentsForAll should be left fully intact. https://t.co/hLUChACGMI"]["@MartinHeinrich #TrumpCare would rip health care away from 300,000 in #NM &amp; devastate our economy. GOP is making a dangerous mistake. We’re fighting back."]["LIVE: @MartinHeinrich &amp; I are speaking out to #SaveACA and protect the health care that #NM families rely on. https://t.co/0FkGDJUbIX"]["We’re standing up for #NewMexico against #TrumpCare. Watch live around 1 ET. https://t.co/PE58Lo1UcK"]["https://t.co/GysaDIPn8I"]["#NM elected me to deliver real solutions, supported by experts &amp; evidence. These groups know what patients need &amp; oppose the #ACA repeal: https://t.co/GLNVMvSYG5"]["My GOP colleagues never answered my call, never held hearings. Now they're voting on repeal and replace &amp; STILL don't have a specific plan."]["Since POTUS began his ACA repeal push, I've been calling on my Senate colleagues to \"work to improve, not repeal, the Affordable Care Act.”"]["To improve #ACA we should:\n✅lower Rx drug prices\n✅lower costs\n✅expand rural choices\n\nWe can't afford to:\n❌Cancel health care for 32 million"]["WATCH: #NewMexico families welcomed us into their homes to share how the #ACA has saved their lives. #ProtectOurCare #AmericaSpeaksOut https://t.co/Sw3HEhA8GV"]["It’s simple—#TrumpCare Medicaid cuts imperil working families, children &amp; the elderly who rely on the 52 year old program for essential care"]["Medicaid enables working people—like Matthew from ABQ—to keep their families healthy w/o worrying abt going bankrupt https://t.co/gZgZeThqux"]["GOP has a choice: support our amendment &amp; the millions who depend on Medicaid, or slash health care for kids, disabled &amp; the most vulnerable"]["Today, I'm voting to #ProtectMedicaid and the health care that gives 900,000 New Mexicans a chance to live &amp; pursue their dreams."]["We need all willing and able troops to serve. This political act robs the military of talented, patriotic members. https://t.co/Hu5KEmcprZ"]["The Republican vote to move forward with #ACA repeal is a disgrace to the Senate, and a betrayal of the people we were sent here to serve. https://t.co/ap0FGw9BGM"]["I stand ready to work with anyone who wants to improve Obamacare. But I will never support denying families access to health care."]["Raiding hundreds of billions from Medicaid, which 900,000 New Mexicans depend on will not solve our nation's health care challenges."]["We need to work to get every single person the health care they need, not take it away from the folks who need it the most."]["In all of my years in Congress, I've never seen anything like this. Total secrecy about a bill that impacts every single American."]["ICYMI—New Mexicans welcomed us into their homes to share their #ACA stories. Today, we fight for families like these https://t.co/Ru2hRpzVWb"]["Watch @Earthjustice's live discussion about why we must #BanChlorpyrifos, a pesticide linked to brain damage in kids https://t.co/35TkkBiUFZ"]["WATCH LIVE: #chlorpyrifos harms kids' brains. @SenBlumenthal &amp; I are introducing a bill to ban this toxic pesticide https://t.co/qhZqQYoBHR"]["@SenBlumenthal @CoryBooker @SenatorDurbin @SenGillibrand @SenMarkey @SenatorCardin The science on #chlorpyrifos hasn't changed, the politics have. If EPA refuses to act to protect children and workers, then Congress must."]["@SenBlumenthal @CoryBooker @SenatorDurbin @SenGillibrand @SenMarkey @SenatorCardin Pruitt reversed EPA's #chlorpyrifos ban after meeting w/ Dow. EPA shouldn’t put the interests of chemical manufacturers over kids' health."]["@SenBlumenthal @CoryBooker @SenatorDurbin @SenGillibrand @SenMarkey @SenatorCardin The American Academy of Pediatrics says #chlorpyrifos use \"puts all children at risk.” We need to listen to the experts &amp; #BanChlorpyrifos"]["@SenBlumenthal @CoryBooker @SenatorDurbin @SenGillibrand @SenMarkey @SenatorCardin The science is clear—#chloryprifos can cause brain damage in children, and it threatens farmers &amp; farmworkers too. https://t.co/Efj6amecxD"]["Today, we're introducing the Protect Children, Farmers &amp; Farmworkers from Nerve Agent Pesticides Act to #BanChlorpyrifos use on food. https://t.co/ZoAdtyXrv7"]["@EPAScottPruitt #Chlorpyrifos creates danger for people throughout the distribution chain—from farmworkers in the fields to children at the dinner table. https://t.co/6yt8LZv8T9"]["@EPAScottPruitt The American Academy of Pediatrics told Pruitt that continued #chlorpyrifos use \"puts all children at risk.” Inaction isn’t an option. https://t.co/PunzZn040i"]["@EPAScottPruitt Bonnie was exposed to #chlorpyrifos after it drifted through her A/C unit from a nearby alfalfa field. Bonnie &amp; her son deserve protection. https://t.co/tuAu834Apc"]["@EPAScottPruitt Scientists believe #chlorpyrifos damages children’s brains, causing reduced IQ, loss of working memory, and attention deficit disorders. https://t.co/XGxGmBgOJP"][".@EPAScottPruitt reversal of EPA's proposed #chlorpyrifos ban puts American families, workers &amp; farmers at risk. Our bill would protect them"]["Tomorrow I will introduce a bill to #BanChlorpyrifos, a dangerous nerve agent pesticide linked to brain damage in children. https://t.co/DmzedluysI"]["Repealing #ACA would hurt countless #NM families. I'm joining @SenateDems &amp; speaking out now to #SaveACA. WATCH: https://t.co/UL5xkJyvMx"]["New Mexicans deserve #ABetterDeal—higher wages, more affordable Rx drugs and access to 21st century necessities like broadband internet. https://t.co/aNiZAc0P7p"]["@EPA We must act to protect our public health from this #NerveAgentPesticide. RT and join me in speaking out against #chlorpyrifos use"]["@EPA We use 5-10 MILLION lbs of #chlorpyrifos on crops annually. Ignoring scientists' findings endangers the health &amp; safety of American families"]["@EPA Bonnie Wirtz was hospitalized after #chlorpyrifos exposure—she’s worried the nerve agent will harm her son too\nhttps://t.co/kc1z8yCrIe"]["@EPA 50 farmworkers in CA were exposed to #Chlorpyrifos through pesticide drift. Over a dozen became immediately ill https://t.co/DvkjlWru6h"]["@EPA But after meeting with Dow Chemical, Pruitt reversed @EPA’s course on #chlorpyrifos &amp; began putting corporate interests before public health"]["@EPA .@EPA repeatedly acted to restrict #chlorpyrifos use—in households &amp; on various crops in '00, &amp; around schools, hospitals &amp; day cares in ‘12"]["@EPA The scientific evidence of #chlorpyrifos’ danger is widespread, compelling and clear. https://t.co/mwAgDN9oH4"]["@EPA #chlorpyrifos is in a class of chemicals designed as WWII nerve agent weapons—studies link it to brain damage and ADHD in kids."]["Pruitt's reversal of @EPA's #chlorpyrifos ban put corporate chemical interests ahead of the health &amp; safety of children &amp; farmworkers. https://t.co/KzJCSCCRFH"]["@POTUS I don't believe @POTUS has the legal authority to rescind #NM #MonumentsForAll and if he tries, I will fight him every step of the way."][".@POTUS threat to shrink or rescind national monument designations is a threat to corporatize our natural treasures &amp; change our way of life https://t.co/gs5Lby1hAx"]["Met w/@Pathkeepers Native Youth Leadership Camp. These young Native leaders are building the skills they need to lift up their communities. https://t.co/jiMuyNbo8d"][".@POTUS is threatening to shrink or rescind #RGDN—we must preserve our #MonumentsForAll so that #NM communities can keep growing &amp; thriving."]["Tomorrow I’ll be joining community leaders &amp; business owners in Pilar to highlight the economic &amp; recreational benefits #RGDN brings to #NM."]["Secured strong funding for #NM's national labs at the @SenateApprops markup. I’m working hard to fund critical investments in #NM's economy. https://t.co/AKAbklC4ze"]["My amendment to prevent commercial #horseslaughter just passed the Appropriations Committee. Thanks to all in #NM who've spoken out."]["Jill and I are thinking of our dear friend John McCain and his family at this difficult time."]["@POTUS Repealing #ACA &amp; ripping away health insurance from millions—or sabotaging it by undermining the parts that make it work—will hurt people."]["@POTUS I'm urging my colleagues to listen to these stories, stop the attack on #ACA &amp; work to protect the gains we have made for our constituents."]["@POTUS Matthew says insurance is like \"a bedrock\" that allows people to take risks and do \"all the things that have made our country what it is.”"]["@POTUS Matthew is an Albuquerque farmer who learned he qualified for Medicaid after his wife underwent a costly emergency C-section. https://t.co/NTK0FY9CXA"]["@POTUS Sam said “Every single day we feel a little bit threatened that our son’s future is kind of hanging in the balance with people on the Hill.”"]["@POTUS Jessica &amp; Sam's 16-month-old son, Rafe, has a type of neurological blindness that requires intensive medical care—care covered under #ACA. https://t.co/EUdar7NSNy"]["@POTUS Elena shared that \"Even in the worst moments this year, I have felt so grateful to know that I didn’t have to worry about my health care.\""]["@POTUS #ACA's Medicaid expansion covered the procedures Elena needed when she discovered her very high risk of developing breast and ovarian cancer https://t.co/PdLkwHFuTL"]["@POTUS Daena told us that \"I can’t solve her Type 1 diabetes, but I know there are resources there to help me, like the Affordable Care Act.\""]["@POTUS Or Daena and her daughter Kitt, who has Type 1 diabetes and is safe from discrimination under the #ACA’s pre-existing condition protections. https://t.co/DYsh4ilmxv"]["@POTUS Mike said that \"When the Affordable Care Act came along, it was perfect. It was meant to deal with this type of a situation.\""]["@POTUS People like Pam and Mike, a small business owner in Placitas whose cancer treatment was covered by ObamaCare. https://t.co/9OeoEjh1ck"]["@POTUS 300,000 New Mexicans would lose health insurance if the ACA is repealed. That’s not just a statistic, it’s people’s lives and livelihoods."]["@SenFranken @SenatorHeitkamp Repealing the #ACA will have devastating consequences for Tribal communities across our country. We must do better."]["@SenFranken @SenatorHeitkamp Thanks to #ACA, Jude was born healthy &amp; happy &amp; Rachael was able to get her master's degree without worrying about her family’s health care"]["@SenFranken @SenatorHeitkamp #ACA's Medicaid expansion ensured Rachael &amp; Justin from the Pueblo of Laguna in #NM got critical prenatal care during a difficult pregnancy https://t.co/ynAPknv2VB"]["@SenFranken @SenatorHeitkamp #ACA &amp; Medicaid expansion have made a huge difference: 64% of IHS patients now can receive care above the “life and limb only” level."]["@SenFranken @SenatorHeitkamp 287,000 Native Americans from 492 Tribes have benefited from the ACA’s Medicaid expansion - including 45,600 Native Americans in #NM."]["@SenFranken @SenatorHeitkamp \"Don't get sick after June\" is what Native Americans said abt Indian Health Service-that's when it would run out of funds. That is a crisis."]["WATCH LIVE: @SenFranken @SenatorHeitkamp &amp; I are on the Senate floor highlighting how #ACA has benefitted Tribes: https://t.co/HoZg4ClDSo"]["We are working hard to ensure all Tribal communities have access to reliable, affordable, quality health care where they need it. https://t.co/3esIzjybPY"]["#ACA has filled badly needed funding gaps for the Indian Health Service, yet there has been no Tribal consultation about plans to repeal it."]["#ACA &amp; #Medicaid expansion has insured nearly 287,000 American Indians and Alaska Natives from 492 tribes, including 45,600 New Mexicans."]["WATCH LIVE: I’m hosting a roundtable w/ Tribal leaders &amp; health experts about how repealing ACA would impact Tribes. https://t.co/sWzW6LtFYM"]["New Mexicans deserve reliable, quality health care that's there when they need it, &amp; I will keep fighting to #KeepNMCovered."]["Your voices - calls, emails, letters - made the difference, #TrumpCare has failed again. https://t.co/5NvkeuhmeL"]["I'm hosting a roundtable on how #TrumpCare would impact health care in Tribal communities. Watch tomorrow @ 7:30 MT https://t.co/sWzW6LtFYM"]["Americans deserve to know who’s influencing policy at the highest levels of government. Trump must also release WH, Bedminster visitor logs. https://t.co/gynKKtXDXL"]["Sending good wishes to my friend @SenJohnMcCain."]["#TrumpCare will hurt #NM families &amp; kill 50,000 NM jobs. Join the fight to #ProtectOurCare &amp; make your voices heard https://t.co/kQ7PaHlcpg"]["Proud to welcome the 2017 class of @udallfoundation interns to Washington. Our nation is in good hands with this next generation of leaders. https://t.co/1GcrHBFIXz"]["We must make cultural, political, &amp; economic sovereignty a reality for all American Indian and Alaska Native Tribes https://t.co/UmDHTYaLF2 https://t.co/fZAcTQBxx0"]["Today is the internet day of action on #NetNeutrality. Join me in speaking out to protect the internet as we know it."]["A free &amp; open internet is fundamental to American discourse &amp; commerce today. Giving #BigBroadband control of the internet endangers this."]["I’ve put a roadblock on my website to show visitors what the internet would look like if @POTUS &amp; Congressional GOP destroy #NetNeutrality https://t.co/A4AfTSgJnb"]["@SJCAlliance @CleanAirMoms_NM @POTUS @SenWhitehouse @SenMarkey @SenBrianSchatz @SenatorCantwell @SenBennetCO Suspending rules that protect kids from harmful oil &amp; gas emissions to pad the industry's bottom line is antithetical to @EPA's core mission"]["@SJCAlliance @CleanAirMoms_NM Trump admin suspending methane waste rules is unwarranted threat to public health, the taxpayers and energy security. Our letter to @POTUS: https://t.co/aeXS9oWOnr"][".@SJCAlliance &amp; @CleanAirMoms_NM urged me today to protect the commonsense rules to #cutmethane and fight for the clean air our kids deserve https://t.co/Mz1cbnEF0b"]["We need to see @POTUS' tax returns--and all of the Trump campaign's email correspondence--to determine the full extent of #TrumpRussia ties."]["Donald Trump Jr., Jared Kushner, and Paul Manafort should testify in public &amp; before Congress in the #TrumpRussia investigation."]["These emails are evidence of outright collusion between the Trump campaign and Russia to influence the 2016 election https://t.co/nzHbaCNQRx"]["President Trump doesn’t have the authority to rescind or shrink #MonumentsForAll. If he tries, we’ll fight him every step of the way."]["2.7 million Americans have made their voices heard in support of #MonumentsForAll—and against @POTUS' threat to our public lands."]["WATCH LIVE: I'm joining @SenateDems and concerned Americans to speak out against @POTUS' attack on #MonumentsForAll. https://t.co/e5y8bcTlew"]["Revoking or shrinking #NM's national monuments will cause irrevocable harm. Read my full comment to @SecretaryZinke: https://t.co/UkDw3ub6S7"]["Join me in the fight to protect our precious #MonumentsForAll. Tell @POTUS to keep public lands in public hands: https://t.co/knUjsuwBk4"]["Fake art hurts Tribal communities where arts &amp; crafts are major economic drivers. We must ensure Native cultural integrity is preserved."]["Imitation Native arts &amp; crafts flood the market across the SW—and swindlers are making millions of dollars off the back of Native Americans."]["WATCH LIVE: I’m holding a field hearing in #NM on protecting the cultural integrity of Native American arts &amp; crafts https://t.co/XR9fd7uqcP"]["I'll continue fighting to keep rural New Mexicans insured and to keep rural hospitals and clinics open. #NM needs these jobs &amp; health care"]["#TrumpCare would make it difficult for rural hospitals &amp; clinics—a major source of good jobs in rural #NM—to keep their doors open."]["Toured the De Baca Family Practice Clinic in Fort Sumner today, which provides essential health care to many surrounding rural communities. https://t.co/gZac57WIcD"]["I will continue working to keep Cannon competitive, and a great home for our airmen and women &amp; their families."]["Great visiting Cannon AFB today. #NM's military bases play a critical role in our national security and our state's economy. https://t.co/j4uWhwmCmr"]["Visited Mesalands Dinosaur Museum yesterday—they're doing great work to inspire &amp; train the next generation of paleontologists https://t.co/cqqNx4uyVe"]["I’ll keep supporting clean energy projects that could reduce water use &amp; greenhouse gas emissions and help to grow our economy."]["Tucumcari's ethanol plant is being converted into a biorefinery that could bring good jobs to Quay &amp; boost #NM's leadership in clean energy. https://t.co/sXd9wUr4M6"]["That idea has brought millions to our shores for over 200 years &amp; has defined who we are. Join me in celebrating these new Americans."]["We're not Americans because of an oath or a piece of paper, but because of an idea—freedom &amp; equal opportunity—set out in the Declaration."]["Yesterday, dozens of people in #NM became citizens of the United States. Each of them is part of the heritage and promise of America. https://t.co/G1p0fR3ZpE"]["#SantaFe’s Pancakes on the Plaza is a great 4th of July tradition. Happy #IndependenceDay https://t.co/xYmSWy8S2g"]["This July 4th, let’s resolve to keep working to achieve the principles set out in the Declaration—true equality &amp; freedom for every American"]["On #IndependenceDay, join me in taking a moment to honor the sacrifice of service members, veterans and military families."]["@EPAScottPruitt EPA must ban chlorpyrifos &amp; protect the health &amp; safety of children &amp; farmworkers. Unnecessary delay leads to additional dangerous exposures"]["@EPAScottPruitt Is Pruitt putting chem company interests before public health? He met w/ chlorpyrifos maker days before his decision https://t.co/dzNYCWjPll"]["The 10,000+ calls/emails from #NM opposing #TrumpCare strengthened my resolve to fight. My colleagues are listening too. Keep speaking up. https://t.co/q2FLY34agX"]["#TrumpCare won’t just take people’s health care away—it will cause 50,000 New Mexicans to lose their jobs &amp; devastate our fragile economy. https://t.co/tsmPqxpF6E"]["@POTUS @SenFranken @SenWhitehouse @SenWarren @SenJackReed @SenSanders @SenatorHassan @SenSherrodBrown @SenBlumenthal @CoryBooker @SenatorBaldwin Americans agree that Rx prices are too high. Our bill makes drug companies put patients before profits &amp; helps families afford needed meds."]["We’re pushing @POTUS to keep his campaign promises &amp; help bring down prescription drug costs—not make giveaways to Big Pharma. https://t.co/sDMr4gDwgP"]["Make no mistake: #TrumpCare will be devastating for #NM. I’m speaking out against this dangerous bill. Watch live: https://t.co/d3kizBNRJX"]["This speaks volumes: @AmerAcadPeds representing 66K+ pediatricians is \"deeply alarmed\" by EPA move on #chlorpyrifos https://t.co/ORhiDIR2LQ"]["Disturbing. Which is more important to Pruitt—Dow Chemical or children’s health? EPA must act now to ban Chlorpyrifos. https://t.co/Y8A7pgnISX"]["The fight to save health care continues. Help me highlight #TrumpCare's disastrous costs—send me your story: SenTomUdall@tomudall.senate.gov https://t.co/O75WhWxIs4"]["@ELIORG @GWpublichealth 1 year ago, we passed the 1st major enviro. law in 25 yrs—we must ensure it becomes the strong public health &amp; safety tool Congress intended"]["I’m discussing where we are/aren't w/ #TSCA reform at @ELIOrg &amp; @GWpublichealth #chemicalsafety conference at 2:45: https://t.co/1OpcLEuhza"]["I'm standing w/@SenateDems against #TrumpCare—for Kitt a 4-yr-old w/Type 1 diabetes—&amp; the 1000s in NM who'd lose health care under TrumpCare https://t.co/GTYqBtRavy"]["@POTUS EPA must do more to make the communities impacted by #GoldKingMine spill—almost 2 years go—whole again. EPA must meet this obligation."]["#TSCA review must focus on chemicals &amp; their public health &amp; enviro impacts—not on uses that help shield chemical companies from regulation."]["Strong #ChemicalSafety reform requires strong implementation—it’s hard to square dramatic cuts in EPA’s #dirtybudget with successful reform"]["@EPAScottPruitt Science is about evidence, not beliefs. And the evidence that we must #ActOnClimate is overwhelming. Ignoring the problem is not a solution."][".@EPAScottPruitt’s inability to articulate this Admin’s position on #ClimateChange—the biggest existential threat we face—is beyond alarming"]["The sudden removal of the White House's #ClimateChange website is part of a troubling pattern of ignoring or hiding evidence of this threat."]["Exposure scientists say Chlorpyrifos is a dangerous pesticide that threatens the American public. I'm pushing EPA to act to protect families"]["@POTUS #EPA proposes cutting 30% from #Superfund &amp; speeding up Superfund cleanup. I don't want focus on speed to lead to shortcuts &amp; lax standards."]["@POTUS #Climatechange is a global crisis &amp; requires urgent global action. But #EPA &amp; @POTUS are making dangerous moves to isolate US fr the threat."]["EPA proposed budget axes almost all $ to fight #climatechange. Sadly that goes hand in glove w/ @POTUS decision to renege on #ParisAgreement"]["Most Americans &amp; I see EPA's core responsibility is protecting public health, clean air &amp; H2O. #EPA seems to think it's to cater to industry"]["#EPA's dangerous proposed budget tells states to take the lead but cuts support to states by 45%. The end result will hurt clean air &amp; water"]["#EPA proposed budget cuts research $ by 50%, wld cause ripple effects for generations. It’s 2017 but I fear we're reverting to the Dark Ages"]["I'm questioning #EPA admin Pruitt abt his dangerous budget to gut EPA's core missions of clean air &amp; water. Watch: https://t.co/Fahp9LWOhf"]["RT to help #KeepNMCovered. Share your family's health care story with me: SenTomUdall@tomudall.senate.gov https://t.co/qqgBXcKL0y"]["The 1st vote on #TrumpCare could be tmw &amp; we need you now! Urge everyone you know to call, email &amp; spread the word about this dangerous bill"]["#TrumpCare Medicaid cuts would devastate NM's economy, kill jobs, push rural hospitals to the brink – and possibly force them to close."]["#TrumpCare will cause hundreds of thousands in #NM to lose access to health care, prescription drugs, drug addiction counseling &amp; more."]["CBO confirms: #TrumpCare isn't a “health care bill,\" it's a tax cut for the rich on the backs of working families, kids, seniors &amp; the sick."]["President Trump has completely abandoned his promise to “have insurance for everybody” (1/15/17) &amp; “save Medicaid” (10/13/15) w/ #TrumpCare."]["The CBO score shows what we already knew. #TrumpCare guts Medicaid and would force 22 million Americans to lose health care. https://t.co/15e6xs6Xy7"]["96% of 10,000+ calls/letters/emails I've gotten from constituents re: #TrumpCare have been opposed to this dangerous bill #AmericaSpeaksOut"]["These Deming HS &amp; Chaparral MS students are representing #NM at the MESA USA Engineering Design Competition. You make #NM proud—good luck! https://t.co/f0Kh1y4TCZ"]["Join me in speaking out against #TrumpCare—email me your story about how #ACA helped you receive treatment: SenTomUdall@tomudall.senate.gov"]["Drug overdoses are now the leading cause of deaths for Americans under 50. We must do more, not less, to address this terrible epidemic."]["Justin’s dad Robert died from substance abuse complications. Too many in #NM share this heartbreak—but #TrumpCare cuts impt treatment funds. https://t.co/PYzY4MpymO"]["#TrumpCare is a total retreat &amp; broken promise in the face of the #opioid epidemic, the defining public health crisis of this generation."]["These are the people #TrumpCare will hurt—families, doctors, children, neighbors, veterans, small business owners: https://t.co/NLUT4kWAiv"]["Jonathan works w/ #ABQ residents battling addiction. Many access treatment through #ACA’s Medicaid expansion that's threatened by #TrumpCare https://t.co/Gm7OjOTLtu"]["Elena had a life-saving surgery that reduced her chances of breast cancer. #Trumpcare takes Medicaid expansion away from those who need it https://t.co/hMfpAO0NP9"]["Amber has MS. #ACA enabled her to afford $60k in yearly prescriptions, MRIs &amp; doctors visits. #TrumpCare will put her health care at risk. https://t.co/1pdPKVdVrQ"]["Kitt is a four year old with Type 1 diabetes. #TrumpCare will make it more difficult for her family to afford her medical care. https://t.co/w3Jhyhcgpy"]["Molly’s a NM native &amp; medical student who knows #TrumpCare will hurt families across our state &amp; cause more providers to leave the NM market https://t.co/wrqITZaid4"]["Lori insures her kids—1 w/autism—through the Medicaid expansion. She works full time, attends school &amp; can’t afford #TrumpCare Medicaid cuts https://t.co/0sQwpFFmLi"]["Matthew is an #ABQ farmer &amp; #smallbiz owner. His pregnant wife &amp; kid are covered under Medicaid expansion that #TrumpCare threatens to slash https://t.co/eSg3zWhl6T"]["Dr. Wangler works with Zuni Pueblo. #TrumpCare cuts to Medicaid will make it harder for Tribal IHS patients to access care. https://t.co/DKSzLIbYYb"]["Alexis had emergency surgery covered through ACA. W/#TrumpCare, insurers can once again institute annual limits forcing patients to pay more https://t.co/EV9pvqfTG1"]["Cathy has 9 kids, 6 of whom she adopted. #TrumpCare would gut the Medicaid funding her family uses to get the health care they need. https://t.co/vKII72mn6O"]["Dr. Fleg is a #NM family physician who’s concerned about #Trumpcare’s impact on the 300,000 people in #NM who gained coverage through #ACA https://t.co/3htPJqncnD"]["Loving Schools Superintendent Dr. McIlroy says “Medicaid funding is vital” for #NM schools. #TrumpCare Medicaid cuts would devastate NM kids https://t.co/IYRCJ10xwn"]["1 yr old Rafe was born w/ cortical visual impairment &amp; significant developmental delays. His parents afford his care w/ help from Medicaid https://t.co/p4ktbJnNw2"]["Christa lost her leg in 2010. #ACA helped her afford a prosthetic—#TrumpCare could reinstate annual limits tht would've limited her recovery https://t.co/f4MCFRkKWy"]["Kris is a #smallbiz owner &amp; single mom who couldn’t afford insurance before #ACA. Her family can’t afford to lose coverage under #TrumpCare https://t.co/fxPcFZjk4R"]["Quincy's an #ABQ veteran. #ACA helps her care for her autistic son; #TrumpCare strips access to needed services for conditions like autism. https://t.co/Y2tQyA1rGH"]["#TrumpCare would be a disaster for #NM &amp; America. People’s health &amp; lives are at stake—here are some of their stories #AmericaSpeaksOut"]["Read Elena’s story in her own words: https://t.co/t8lykOVADr"]["I’m on the Senate floor telling Elena from #ABQ’s health care story. Watch live: https://t.co/uvFO3iWb5N #AmericaSpeaksOut"]["Since January, I’ve received over 10,000 letters, emails &amp; calls from New Mexicans pleading with me to help save their access to health care"]["#Trumpcare will be devastating for the elderly, low-income families, women, people with pre-existing conditions, and rural New Mexicans."]["#TrumpCare guts Medicaid in order to give a tax cut to the wealthiest Americans. This will hurt the most vulnerable among us. #KeepNMCovered"]["The Senate #TrumpCare bill is a disgrace and a disaster that will cause hundreds of thousands of New Mexicans to lose access to health care. https://t.co/1cZ3Lxdir2"]["Now we’re seeing proposals from EPA that prioritize business interests over public health. We need #TSCA to work to protect families. https://t.co/ARWX0IwbB0"]["1 yr ago, #TSCA reform became law. We passed the biggest enviro. reform in a generation with the intent of protecting public health &amp; safety https://t.co/6kbd0Lg21w"]["Met w/ Alamogordo Committee of 50 today to discuss our ongoing efforts to secure the permanent relocation of F-16 squadrons to Holloman AFB. https://t.co/NcjLiRFvLD"]["@SecretaryZinke @SenatorCantwell We fought hard an attempt to overturn this commonsense rule—&amp; bipartisan Congress opposed repeal. @SenatorCantwell &amp; I will keep fighting"][".@SecretaryZinke’s #CutMethane rule suspension is a brazen attempt to circumvent law that will harm taxpayers, clean air &amp; public health. https://t.co/O1mm8nszSG"]["#NM should know @MartinHeinrich &amp; I will fight #TrumpCare tooth &amp; nail. This bill will hurt our constituents, our state, &amp; our country. https://t.co/NR4uf0UPUP"]["@POTUS #NM BLM Dir Amy Lueders is 1 of the staff being moved. I don’t want NM to lose her, &amp; I’m v. concerned about the impact of other changes too"]["@POTUS …that’s a bad business decision. NM &amp; DOI workforce deserve better &amp; Congress needs to know how the unprecedented changes impact NM &amp; Tribes"]["I know @POTUS wants to run govt more like business but this is like taking your head of marketing &amp; putting them in charge of accounting… https://t.co/kFfn5SSacW"]["Did #ACA help you access needed health care? Worried about #TrumpCare? Send me your story: SenTomUdall@tomudall.senate.gov #AmericaSpeaksOut https://t.co/YNj5Ux2ACO"]["I will fight for Kitt, Elena, and all New Mexicans &amp; Americans who are scared for themselves, their families and their friends. #TrumpCare"]["We must work to make sure all Americans have health care. #TrumpCare benefits only the healthy and the wealthy."]["Dr. Wangler works with Zuni Pueblo. #TrumpCare cuts to Medicaid will make it harder for IHS patients to access care. https://t.co/RW6FiAdw3d"]["Kitt is a 4 yr old w/Type 1 diabetes—#TrumpCare will make it more difficult for her family to afford coverage for her pre-existing condition https://t.co/tIctrUSGtC"]["Loving Schools Superintendent Dr. McIlroy says “Medicaid funding is vital” for #NM schools. #TrumpCare Medicaid cuts would devastate NM kids https://t.co/Rp5mBW0jRD"]["Elena from #ABQ has the BRCA gene mutation &amp; fears she'll lose insurance because #TrumpCare won't guarantee care for pre-existing conditions https://t.co/u7hwS0aGgS"]["I shared stories from 4 constituents—Elena, Dr. McIlroy, Kitt, &amp; Dr. Wangler—to highlight why we must #KeepNMCovered #AmericaSpeaksOut"]["Today, I made my 3rd floor speech about how #TrumpCare will hurt people across #NM and devastate our economy https://t.co/xwfiFm1i97"]["I’m on the Senate floor right now telling the stories of New Mexicans who will be hurt by #Trumpcare. Watch live: https://t.co/xwfiFm1i97"]["@POTUS Constitution requires President to put American people’s interests above his own. This idea is fundamental to our democracy and our values."]["@POTUS President Trump's failure to resolve his conflicts of interest &amp; divest from his business has left us no choice but to take this action. https://t.co/SLKhtREtZO"]["@POTUS Watch here: https://t.co/p0hsxJQTFA"]["On my way to a press conf to outline the constitutional case for lawsuit compelling @POTUS to follow the Constitution's Emoluments Clause"]["We’re urging @SecretaryZinke to protect #OMDP4NM &amp; #RGDN. #NM’s #MonumentsForAll are a part of who we are and drive our local economies. https://t.co/Ppgp4VE71C"]["To my GOP friends—you can't hide #TrumpCare forever. If it passes, the millions of Americans who lose health care will know."]["Hearing expert &amp; constituent opinions on pending legislation is—quite literally—our job. There’s simply no excuse for governing in the dark."]["Our legislative process is designed to be responsive to the will of the American people. This sets a dangerous precedent."]["2017 Senate #TrumpCare process:\n• 0 hrs debate\n• 0 public hearings, meetings, walkthroughs\n• No amendment process, 0 Dem. amdts adopted"]["2009 Senate #ACA process:\n• 160 hrs of floor debate\n• 100+ committee hearings, meetings, etc\n• Full amendment process, 171 GOP amdts adopted"]["A reminder—my Republican colleagues aren’t being truthful when they tell you #TrumpCare is business as usual. It’s not. #ShowUsTheBill"]["@SenSherrodBrown @SenGillibrand @SenFranken @SenJackReed @SenatorHassan Our bill would require Big Pharma to report &amp; justify Rx price hikes and penalize companies that make unfair, unjustified price increases."]["On #Juneteenth we celebrate the end of slavery in the US while recognizing inequality's persistence &amp; the hard work that remains."]["RT to tell Senate GOP you want hearings on a bill that could cut off your access to health care &amp; impact 1/6 of our economy #ShowUsTheBill"]["Great to meet with #NM's next generation of leaders when they visited DC to make their voices heard on the issues that matter most to them. https://t.co/2AuVRYMaIb"]["We already know @POTUS' outdated #Cuba approach won't work. We need openness, to grow our economy &amp; bring real freedom to the Cuban people."]["Doubling down on failed Cold War policies won’t help either side -- not U.S. interests, &amp; not the Cuban people. https://t.co/CMlvo0HIaV"]["@JRosenworcel @FCC Looking forward to continuing to work with @JRosenworcel on #NetNeutrality &amp; especially to close the #HomeworkGap in NM &amp; across the country"]["Re-nominating @JRosenworcel to another term on the @FCC is a smart move &amp; I'm glad it's finally happening https://t.co/K3PKPVFigS"]["@POTUS Reversing Cuba policy will endanger the human rights &amp; prosperity of the Cuban people—and harm flourishing American business opportunities."]["I pressed Secretary Tillerson on @POTUS' plan to reverse our engagement with Cuba and return to the failed policies of the Cold War. https://t.co/1BugvN1G4z"]["My thoughts and prayers are with my colleagues, their staff and Capitol Police involved in this morning's tragic shooting."]["@POTUS The administration's lack of transparency makes it critical for an independent panel to investigate Russia's attempt to disrupt the election"]["The American people are deeply worried about our country &amp; deserve answers, but @POTUS' cabinet refuses explanations https://t.co/JhKh0pBhQS"]["@SenateDems @ChrisMurphyCT @CoryBooker @SenSherrodBrown @SenatorDurbin @SenFranken @SenWarren @brianschatz @SenatorLeahy @ChrisVanHollen @SenMarkey I’m cosponsoring #NoHearingNoVote Act because my constituents deserve a public explanation of how this bill will impact their health care."]["@SenateDems @ChrisMurphyCT @CoryBooker @SenSherrodBrown @SenatorDurbin @SenFranken @SenWarren @brianschatz @SenatorLeahy @ChrisVanHollen @SenMarkey Senate GOP doesn't want you to see their bill because it will hurt your health care &amp; pocketbook. Join me in demanding they #ShowUsTheBill"]["@SenateDems @ChrisMurphyCT @CoryBooker @SenSherrodBrown @SenatorDurbin @SenFranken @SenWarren @brianschatz @SenatorLeahy @ChrisVanHollen @SenMarkey 2017 Senate #TrumpCare process:\n• 0 hrs debate\n• 0 public hearings, meetings, walkthroughs\n• No amendment process, 0 Dem. amdts adopted"]["@SenateDems @ChrisMurphyCT @CoryBooker @SenSherrodBrown @SenatorDurbin @SenFranken @SenWarren @brianschatz @SenatorLeahy @ChrisVanHollen @SenMarkey 2009 Senate #ACA process:\n• 160 hrs of floor debate\n• 100+ committee hearings, meetings, etc\n• Full amendment process, 171 GOP amdts adopted"]["@SenateDems @ChrisMurphyCT @CoryBooker @SenSherrodBrown @SenatorDurbin @SenFranken @SenWarren @brianschatz @SenatorLeahy @ChrisVanHollen @SenMarkey The Senate GOP has reportedly decided to keep their bill text secret from the American people. What are they hiding? https://t.co/WakpN3N3zF"]["In March, @SenateDems &amp; I asked Senate GOP to give Americans the open, transparent debate on the future of health care that they deserve. https://t.co/BwKlxKtXGM"]["Great meeting with @CCLsantafeprep. These #NM students know we must #ActOnClimate now to protect their future &amp; our way of life. #CCL2017 https://t.co/ZgCQQmiORC"]["@POTUS Sec Zinke’s #BearsEars recommendations are deeply disrespectful &amp; insulting to Tribes who work to protect this culturally significant region https://t.co/kzES7Mdv78"][".@POTUS does not have authority to act alone to reduce #BearsEars National Monument. If he tries, he WILL be challenged in court. https://t.co/EJliZp8dp0"]["During #PrideMonth, we recognize the intolerance so many in the LGBT community face every day &amp; commit to fight for equality at every turn."]["My thoughts are with #Orlando today. We must honor the #PulseNightclub victims by doing everything we can to #DisarmHate &amp; end gun violence."]["I don’t believe @POTUS can legally rescind #MonumentsForAll—but he’s trying. Tell @POTUS to protect our #publiclands https://t.co/knUjsuwBk4"]["#MonumentsForAll are part &amp; parcel of the American spirit &amp; soul. They're essential to #NM’s way of life &amp; economy. We must preserve them."]["Today is the 111th anniversary of Teddy Roosevelt signing the #AntiquitiesAct to protect America’s natural treasures for generations to come https://t.co/uEX72Nrpka"]["This is an extraordinary attack on our democracy. We need an independent commission on #TrumpRussia. Americans deserve the full truth. https://t.co/V0mlEjsSPD"]["I believe that it is appropriate for President Trump’s actions to be investigated for obstruction of justice. #ComeyHearings"]["James Comey’s testimony has painted a truly frightening picture for the American people. We need an independent commission on #TrumpRussia. https://t.co/s5BHUlqAdB"]["@GreenChamberLC1 @karathrowsjav @MargauxIsaksen Help me convince @POTUS to protect #PublicLands—submit your comment in support of #NM's #MonumentsForAll today: https://t.co/knUjsuwBk4"]["@GreenChamberLC1 These #OlympiansForPublicLands agree—#PublicLands offer unparalleled recreation &amp; training where everyone can go for the🏅 https://t.co/rlaRXlGERQ"]["Thank you to Carrie Hamblen &amp; @GreenChamberLC1 for highlighting how #OMDP4NM &amp; #MonumentsForAll help local #NewMexico businesses thrive."]["Great talking w/#MonumentsForAll supporters. #PublicLands are critical to #NM's way of life &amp; economy—we must preserve them for the #Next100 https://t.co/zP8il3kn4H"]["Exec agencies should respond to all Congressional oversight—not just requests from their party. Glad USFS Chief committed to this practice. https://t.co/cCOQeV6DrB"]["I introduced #CreateAct to support artists, #creativeeconomy businesses like @MezelMods that help grow #NM’s economy https://t.co/bu64ozjrbt"]["Today we honor the brave Americans &amp; allies who stormed the beaches of Normandy 73 yrs ago—their courage changed the course of history #DDay"]["Big congrats to the 16 students who have been accepted to a U.S. military service academy, I was proud to nominate NM's best &amp; brightest! https://t.co/YEjLQoZy4G"]["Thank you for all of your town hall questions, we had over a 110 questions from the audience alone and many from social media!"]["Dark money capturing the Congress, electoral democracy...we gotta fight this dark money. All of it should be out in the open.” -- Sen. Udall"]["“We’re a country that stands for loving ppl, respecting ppl &amp; respecting ppl for who they are” -Sen Udall on protecting #LGBTQ rights"]["Sorry about the technical difficulties, new live link here. \nhttps://t.co/Y3H4jQ0zNQ"]["\"We should be a country that is welcome to people that are fleeing persecution from home, we need to have a little heart.\" -Senator Udall"]["\"We need to fight the prescription drug companies and bring those costs down\" - Senator Udall"]["\"I want you to join me in urging that no cuts take place\" -Senator Udall, committing to protecting SNAP and food assistance"]["\"People are standing up and saying 'don't take my health care away' and that's what we need.\" - Senator Udall"]["\"Involvement has gone up tenfold. I'm really glad you all are doing this, it's showing that our democracy is alive and well.\" -Senator Udall"]["\"@POTUS' budget is dead on arrival on Capitol Hill\" - Senator Udall"]["HAPPENING NOW: my #townhall meeting in #ABQ. Watch live at https://t.co/8pB4VK5lj0 and submit your questions using #askTomUdall"]["I’ll be streaming tonight's #townhall live on Facebook. I hope you’ll tune in &amp; submit your questions https://t.co/LCtMc0aE4t #askTomUdall"]["Tonight is my #ABQ #townhall. If you can’t attend, don’t forget to submit your questions w/ the hashtag #askTomUdall https://t.co/jd3qjZ59AQ"]["#ParisAgreement withdrawal endangers American moral leadership, our booming clean energy economy and a healthy future for our children."]["Backing out of the #ParisAgreement would be a failure of leadership that robs future generations of a healthy environment and safe future https://t.co/k8rrrK4alC"]["Your thoughts &amp; concerns inform my decisions in Washington. Make your voice heard, submit your #townhall questions today. #askTomUdall"]["I’m taking questions for Thursday’s #ABQ town hall—submit yours using #askTomUdall https://t.co/KZ5cKyF0ij https://t.co/JglMUSamNV"]["We recommit to ensuring that the men &amp; women of our Armed Forces &amp; our veterans receive the honor they deserve &amp; the benefits they've earned"]["I’ll be streaming the town hall live on my Facebook and answering questions from social media. Submit yours using the hashtag #AskTomUdall"]["I’m looking forward to hosting a town hall next Thursday, June 1st in #ABQ. I hope you’ll join me! #AskTomUdall https://t.co/NaCIHbQLb2 https://t.co/1svMZO8sKp"]["Tourism sustains 90k+ jobs in #NM &amp; brings $6 billion annually. @POTUS must address tourism slump caused by his hostile rhetoric &amp; policies https://t.co/k8zXrZzcrE"]["I'm urging @POTUS to remain in the #ParisAgreement. Withdrawal would threaten our economy, our environment and our children's health. https://t.co/THx3LwjFEd"]["@Interior .@POTUS doesn’t have legal authority to overturn our #MonumentsForAll. Join the local communities &amp; stakeholders urging him to #KeepItPublic"]["Today's the last day for public comment on #BearsEars. Make your voices heard—tell @Interior you #StandWithBearsEars https://t.co/knUjsuOcbC"]["My full statement on the Congressional Budget Office's score of #TrumpCare: https://t.co/DaJ21KJpO5"]["Legislation that makes 23 million people lose their health insurance is not a “health care” bill. #TrumpCare #SaveACA #KeepNMCovered"]["Today's CBO score confirms that #TrumpCare would be an utter disaster for #NM families and our economy. I'll fight this bill tooth and nail."]["Congrats to @usairforce Secretary Wilson. Look fwd to working w/her to ensure #NM's bases &amp; labs remain critical part of our #natsec mission https://t.co/2flEDWvlGc"][".@POTUS' budget cannibalizes programs that help low and middle-income families get ahead to give the richest Americans a huge tax cut https://t.co/zRfTpZbkoa"]["Join me in the fight to #SaveACA &amp; #KeepNMCovered; email me your #ACA story at SenTomUdall@tomudall.senate.gov"]["If #Trumpcare becomes law, cuts to medicaid and insurance subsidies will jeopardize Alexis and Rafe's health care coverage"]["1 yr old Rafe was born w/ cortical visual impairment and significant developmental delays, his parents afford his care w/ help from Medicaid https://t.co/Z5VPg1OsfG"]["Alexis was denied private insurance bc of preexisting condition, she said it \"broke us financially.\" W/ #TrumpCare she could be denied again https://t.co/Vjjf8yn8e1"]["Every 1 of the 300k New Mexicans who now have health care will tell you how having coverage has made a difference &amp; even saved their lives https://t.co/KwZiziOuO8"]["I shared stories of New Mexicans whose health &amp; economic security are threatened by #TrumpCare on the Senate floor: https://t.co/ocLIFoB5gG"]["Hospital administrators say #Trumpcare will endanger rural hospitals—threatening access to care #NM families rely on &amp; countless rural jobs"]["If the WH succeeds in blocking OGE from discovering who has secretly received waivers of @POTUS' ethics pledge, we'll get the info ourselves https://t.co/JCL4ZCUbps"]["#TrumpCare doesn’t cover more people or more services, and it doesn’t improve health care. It raises costs AND reduces quality."]["#TrumpCare puts insurance companies back in the driver’s seat, meaning less quality—and more cost—for all of us."]["I strongly, unequivocally support the right of all people to have health care. Let’s get to that goal—#TrumpCare will only take us backwards"]["@MartinHeinrich @SenFranken #TrumpCare fails Senator Hubert Humphrey's moral test of government https://t.co/Hk0nhdeat9"]["@MartinHeinrich @SenFranken #NM hospital administrators are raising the alarm—#TrumpCare Medicaid rollback could mean rural hospital closures &amp; lost health care access"]["#TrumpCare will be a disaster for rural families &amp; rural economies in #NewMexico. I'll fight like heck to keep my rural constituents insured https://t.co/rqVPIZHwNq"]["Watch live: my press conference w/ @MartinHeinrich about how #Trumpcare will hurt #NewMexico rural communities https://t.co/F7orHugOBD"]["OGE must be able to conduct ethical oversight of exec branch independently &amp; free from political pressure. WH should comply w/their request https://t.co/SiC9iYuLiK"]["My thoughts are with Manchester tonight and the loved ones of those lost in this tragic event."]["Mexico &amp; #NM's roots run deep. I look forward to working w/ Mexican Amb. Gutierrez to ensure U.S.-Mexico relations stay strong &amp; prosperous. https://t.co/DLbxZLhq6x"][".@POTUS' proposal to cut $800B from Medicaid through #Trumpcare will devastate the health and economic security of #NM families. #TrumpCuts https://t.co/6Ft7I9JiXJ"]["From attacking legitimate reporting as \"fake news\" to manhandling FCC reporter, WH hostility to free press deserves @SenateCommerce hearings https://t.co/l81nlf0TVY"]["@POTUS .@realDonaldTrump promised to stop the revolving door of lobbyists into government. Instead the revolving door is spinning faster than ever."]["@POTUS We asked WH to disclose these waivers in April—if they won’t meet transparency/ethics standards, Congress should act https://t.co/rdfSCyUsEu"]["How many ex-lobbyists are working as gov't officials violating rules or with secret waivers? @POTUS refuses to say https://t.co/IgMirXYFlH"]["@GreenChamberLC1 I vow to fight tooth and nail against any attempt by the Trump Administration to rollback protections on #NM’s cherished national monuments."]["@GreenChamberLC1 #MonumentsForAll boost local businesses &amp; create outdoor rec &amp; tourism jobs. It’s vital to #NM’s economy &amp; environment that we protect them"]["This month @greenchamberLC1 is highlighting 31 #LasCruces #smallbiz that benefited from #OMDP4NM’s national monument designation 3 years ago https://t.co/INFl0JHo4u"]["Thanks to the students at El Camino Real Academy &amp; @Defenders for sharing their wildlife art with me #EndangeredSpeciesDay https://t.co/Hc3lHT6RQj"]["#ESA is our most effective law for protecting #wildlife from extinction. It has prevented more than 99% of listed species from going extinct"]["My letter to @AjitPaiFCC asking for an explanation of the incident https://t.co/MVe1PQwSe1"]["This is disturbing behavior for any public official, especially one overseeing communications. https://t.co/KoZpaIJY7t"]["Too many New Mexicans are already stuck in the internet slow lane. Tell the #FCC to protect #NetNeutrality &amp; a free, open internet for all"]["Call the #FCC and tell them to protect #netneutrality and end this attack on the internet as we know it"]["The #FCC is taking steps to roll back the #NetNeutrality rules that have ensured a free and open internet for all Americans"]["#NAFTA renegotiation must protect the thousands of New Mexicans whose livelihoods depend on stable trade relations w/ Mexico. My statement: https://t.co/ci1LUUBZ39"]["#Trump has appointed more super-wealthy connected special interest donors &amp; insiders to high-level posts than any POTUS; we need reform now. https://t.co/rSEklOE16l"]["@SenWhitehouse @RepTedDeutch By requiring high-level govt officials to answer whether they have received or given campaign donations we can start to #GetMoneyOut."]["Americans deserve to know who might be influencing appointees at the very top of our government. Proud to join @SenWhitehouse, @RepTedDeutch https://t.co/1ZClPpWJ8R"]["Now Congress must do its job, appoint an independent 9/11 style commission to investigate every aspect of Russia's meddling in the election."]["This is welcome news and badly needed after weeks of turmoil and chaos. Robert Mueller has impeccable credentials. https://t.co/JQdIFnPJfP"]["We can only stop this attack on the internet as we know it with your help. Speak up and tell @AjitPaiFCC &amp; @POTUS you support #NetNeutrality"]["#OpenInternet has driven innovation &amp; growth across #NM. Revoking #NetNeutrality will help big corporations and hurt consumers &amp; #smallbiz"]["The internet's unrivaled social &amp; economic opportunities exist because it is a free &amp; open platform. #NetNeutrality rollback destroys this."]["President Trump’s FCC wants to revoke #NetNeutrality &amp; change the internet as we know it forever. We must fight back https://t.co/Z3rDWKJuZ8"]["Brand's support for NSA's §215 bulk collection of Americans' phone records while a member of the PCLOB makes her a dangerous choice for DOJ"]