["“What if there were a way to run a business that generated lasting wealth for employees and helped anchor companies in the U.S.?”\nhttps://t.co/ROND4aSTOW"]["Thank you, Serena, for speaking out on this! You're very right. We must work toward change to ensure that no one is forced to choose between a paycheck and caring for a child or loved one. Let's finally pass a national paid family leave program like my #FAMILYAct. https://t.co/q0eZ2BfqhA"]["A repulsive, unacceptable remark, far beneath the dignity of the presidency. Our country is better than this. https://t.co/U54NdZ9Dgz"]["Iranians should have every right to raise their voices in protest without fear of intimidation or violence from their government. I've joined my colleagues @SenBobCorker, @SenatorCardin on a Senate resolution to affirm that right."]["This is a big victory in our fight against partisan gerrymandering. https://t.co/ERVDZGUzxa"]["Congratulations to @shelley4senate on winning the Democratic nomination for New York State Senate District 37. I look forward to supporting your campaign!"]["To all Dreamers: You are part of our communities, you are part of the fabric of this country, and you deserve to be part of our future. We will not stop fighting for you. #DreamActNow"]["The opioid crisis has destroyed far too many lives, and we cannot wait any longer to take action. Congress must pass my bipartisan bill that will address the one of the root causes of this crisis by curbing over-prescription. https://t.co/zGvJqq6ytp"]["U.S. attorneys should work for the people they serve and be independent from the executive branch—that is a cornerstone of our democracy. https://t.co/NUkUcKT17j"]["I am deeply troubled by the reports that President Trump personally interviewed Geoffrey Berman to permanently fill the post of Manhattan U.S. attorney, and find it disqualifying, considering the potential conflicts of interest on matters that could affect the president himself."]["Happy to see my friend @KarinaCBell who worked so hard in my office continue to try and help others by launching a podcast called Reach Mama, where she shares stories of career-driven moms of many different backgrounds pursuing their professional dreams. https://t.co/twzWdFFysy"]["It has been over 100 days since funding expired for the Children’s Health Insurance Program. Have you taken action this week and called on Congress to renew coverage for nearly 9 million children?"]["Joe Arpaio has absolutely no business being in the Senate. It’s more important than ever to make sure my friend @kyrstensinema wins this critical seat. Will you pitch in now to help her win and take back the Senate for Democrats? https://t.co/CUybHafTNO"]["I’m proud to join @SenMarkey’s effort to restore #NetNeutrality. Let’s keep speaking out to fight for a free, open internet. https://t.co/0xJOrYgycW"]["Dreamers shouldn't be used as political pawns to pay for an absurd border wall. We shouldn't put hundreds of thousands of lives on the line just so that the president can fulfill a hateful campaign promise. It's nonsense. We need to pass a clean #DreamActNow."]["An important project of this size and scope cannot get done without help from the federal government. I'm very concerned about the Trump Administration's stance on this, and plan to ask Secretary Chao today to explain their position."]["If President Trump really wants to rebuild our crumbling infrastructure, he should start by working constructively with Democrats and Republicans from New York and New Jersey on the Gateway Project, the single most important rail project in the country."]["Another example of the revolving door of special interests that could hurt both patients and consumers alike. Alex Azar’s record at the drug company Eli Lily demands that he be blocked from leading such an important agency. https://t.co/kZVKNgeN4J"]["Too many would-be small business owners struggle to get loans from banks to start businesses, and more often than not, the people who lose out are women and minority entrepreneurs. I’ve co-sponsored legislation to address this. https://t.co/dX4uZa5UAC"]["“...when that new day finally dawns, it will be because of a lot of magnificent women, fighting hard to make sure that they become the leaders who take us to the time when nobody ever has to say #MeToo again.” \n\nPowerful words from @Oprah. https://t.co/yENnpLVGHl"]["This decision will separate families and force members of our communities into the shadows to live in fear of deportation. Heartless and cruel. https://t.co/OjWCXiSJ5y"]["Companies like Niagara Gear that allow workers to share in their successes through Employee Stock Ownership Plans are great examples of how we can reward work again. That’s why I'm working to pass legislation to support more employee ownership in New York and across the country. https://t.co/zBecwKsYJT"]["Worth watching: Puerto Rico continues to suffer without water, food, or power months after Hurricane Maria, which has given way to yet another crisis. https://t.co/74tY7wrN3Y"]["Passing adequate, long-term funding for the Children’s Health Insurance Program shouldn’t be a partisan issue. Let’s get to work."]["If we want to tackle the opioid crisis head on, then we must curb the over-prescription of painkillers. Glad to be working with @SenJohnMcCain on this issue. https://t.co/PNYB7J2uvt"]["Another week has passed and Congress has done nothing to help the hundreds of thousands of Dreamers who are living in fear of losing their status and are at risk of deportation."]["Much credit should be given to the families of Flight 3407, who have worked hard to push for stronger rules to keep our commercial flights safe. \nhttps://t.co/bSTUFCqqtu"]["Joeette asks the right question of AG Sessions: \"Where is the compassion? It is cruel to withhold a treatment of medicine from people that are suffering.\" https://t.co/3zL1gd33EZ"]["New Yorkers, please make sure to stay warm this weekend! https://t.co/rmip76CRs4"]["A great reminder for Congress today. #DíaDeLosReyes https://t.co/tkr6f2Wh2q"]["New York State now offers paid leave! Let’s keep up the momentum to guarantee this important benefit for workers across the country. \nhttps://t.co/hg0EAE014A"]["Attorney General Sessions' decision to restrict states’ ability to legalize and decriminalize marijuana is either willfully ignorant of the medical science or an act of greed on behalf of the pharmaceutical industry. In either case, it's an attack on patients, and it's wrong. https://t.co/Kiw8nOmPb7"]["DOJ should investigate how pharma helped create the opioid crisis, not institute policies that take marijuana based medicines from patients and needlessly target non-violent minority youths."]["Our country is in the midst of an opioid crisis and the AG is going to divert resources to cracking down on medical marijuana? This is either willfully ignorant or cowing to corporate greed on behalf of pharma special interest profits."]["This reported decision is a direct attack on patients. Parents should be able to give their kids the medicine they need without fear of prosecution. Veterans should be able to come home from combat and use the medicine they need without fear of prosecution. https://t.co/ra43TqWsQE"]["It has been over 100 days since Hurricane Maria made landfall in Puerto Rico. Over a million of our fellow citizens remain in crisis, and Congress has yet to give them the aid they need. Please, keep up the pressure and tell your members of Congress to take action now."]["Nearly 9 million children across the country are waiting desperately for Congress to pass adequate, long-term funding for the Children’s Health Insurance Program. We cannot leave this unresolved any longer."]["As of today, over 14,000 DACA recipients have lost their protections and face the risk of deportation. There are no more excuses. Protecting Dreamers and passing a clean #DreamActNow must be one of Congress’s top priorities this month."]["Great to see over 300 powerful women in Hollywood come together to help others by launching an initiative and legal defense fund aimed at ending sexual harassment in the workplace. #TimesUp\nhttps://t.co/PTgwzsbRub"]["We have big and important fights to wage together this year. Stay focused, stay hopeful, and please keep raising your voice. Thank you for all that you do. Happy New Year!"]["I’m so grateful for everyone who’s gotten off the sidelines, raised their voices, and fought for what we believe in this year. As you think ahead to 2018, I’d love for you to share some resolutions in a reply. Wishing you and your family a joyful, safe evening!"]["Here is your reminder that our fellow American citizens in Puerto Rico and the U.S. Virgin Islands have suffered through the holidays without power, water, or refrigeration. They cannot wait any longer—Congress must act quickly to give them the funding needed to rebuild."]["Creating a nationwide wireless broadband network to enable our first responders to communicate with each other in real time during national crises is something I worked hard to pass in Congress. All 50 states now taking part in the program is an important step forward. https://t.co/djDQhZEsVx"]["I’m heartbroken at the news of the devastating fire in the Bronx last night. Praying for the New Yorkers we lost, for those still fighting for their lives, and for the families affected by this horrific tragedy. Thank you to @FDNY and first responders for your bravery."][".@schriock1 is a powerhouse who has inspired, motivated, and recruited thousands of amazing women to get off the sidelines, take the plunge, and run for office. I’m glad to see her accomplishments celebrated here and proud to be with her in this fight. https://t.co/gtoha38P3a"]["As we look ahead to some very important fights in the new year, never forget that your voice matters. You never know: Your words and your actions can spark, shape, or lead an important debate. Keep showing up, keep speaking out, continue to be part of the conversation."]["Allowing thousands of Dreamers to lose their protections and face the risk of deportation is not just immoral, it also hurts our economy and our communities. We cannot sit idly by. It's time for a clean #DreamActNow."]["While we have taken some of the right steps forward to address sexual harassment and assault on Capitol Hill, significant reform must take place to ensure that every employee in Congress can have the workplace they deserve.\nhttps://t.co/PR6EQKsCMe"]["Merry Christmas! Wishing you many blessings today and all year. https://t.co/1UHaQEjtVD"]["I’m so deeply grateful for your passion and your voice. Wishing you and your family a holiday filled with joy and love. Happy holidays! https://t.co/MAddSJYFdT"]["Paid family leave benefits begin for workers across New York State on Jan. 1st! https://t.co/lrFw5JiOEF"]["This is worth your time. @thewarhorsenews put together a powerful, jarring timeline that chronicles nearly four decades of failed attempts to end sexual harassment and assault in our military. \nhttps://t.co/NAVmrCyVWR"]["Taxpayers shouldn’t have to bail out politicians' bad behavior. The system needs reform, which is why we must pass my bipartisan bill, the Congressional Harassment Reform Act, to create more accountability in Congress. Let's finally hold elected officials to the highest standards https://t.co/oXmyys53Ar"]["I voted no on the short-term CR. It did nothing to protect #Dreamers and did not fully reauthorize #CHIP. That’s unacceptable."]["We cannot forget about the American families in Puerto Rico and the U.S. Virgin Islands that have been without food, water, or electricity for over 12 weeks. They deserve nothing less than a fully funded Marshall Plan to rebuild."]["In light of the shameful tax bill and inescapable influence of big money in Congress, we should demand more transparency and accountability from every member of Congress—and from the president. After all, sunshine is the best disinfectant. https://t.co/QqnA8PsR4k"]["Senate Republicans are doing nothing to address the fact that millions of children are only weeks or months away from losing #CHIP coverage. It’s shameful to lavish tax giveaways on wealthy donors while claiming children’s access to the most basic medical care is too expensive."]["Across the country, Dreamers are living in fear of losing their jobs, of having to go into hiding, of having to make a choice between staying here undocumented or being forced out of the only country they've ever called home. #DreamActNow"]["The House’s disaster aid package does not do enough to help with the humanitarian crisis in Puerto Rico—and it doesn’t address the debt crisis that has made Puerto Rico’s recovery harder than it needs to be."]["Thank you to @microsoft for standing with us in our bipartisan fight to end unfair forced arbitration policies that prevent sexual harassment survivors from getting the justice they deserve. https://t.co/2SYY9mOi3Y"]["This powerful, heartbreaking story sheds light on those we are fighting for and the structural changes that must take place to give every employee the workplace they deserve. I am grateful to these women who so bravely shared their stories. https://t.co/2zEboi1HiQ"]["In 2018, I hope you will channel your anger and energy into defeating those who voted to put their donors before hardworking middle-class families."]["Taking decisive action to protect Dreamers is a matter of basic human rights and dignity—it's about people’s lives. #DreamActNow"]["Soon, the Senate will vote on a damaging bill that gives tax cuts to corporations at expense of middle class families, &amp; sets the stage for cuts to Medicare, Medicaid, &amp; Social Security. This bill is Washington's culture of soft corruption at its absolute worst—I'm voting NO."]["These images are jarring. See for yourself, then tell me if you think our government is doing enough to help our fellow citizens. https://t.co/1h1snnoAQG"]["The Republican tax plan is an abomination—nothing but a massive giveaway to corporations and the wealthiest Americans. Time is running out before the final vote on this plan, so please make sure to keep up the pressure. Contact your Senators and tell them to vote NO."]["For each day that Congress fails to act to protect Dreamers, 122 DACA recipients lose their status and face the risk of deportation. \n\nIt is Congress' moral obligation to take decisive action. #cleanDreamActNow"]["As women continue raising their voices to ignite change, women-led films are breaking through to reign at the box office. https://t.co/DekaU8tfxe"]["This week, my Republican colleagues are eager to send an early holiday present to their corporate donors through the #GOPTaxScam.\n\nIf you're part of a middle class family, it's very likely that you'll take a hit. Keep speaking out."]["A federal judge temporarily blocked a Trump administration rule that would allow employers to deny women contraceptive coverage. \n\nThis is encouraging news. Let’s keep fighting back to ensure that no woman’s boss has the ability to determine her access to birth control. https://t.co/wEGpywgAuC"]["In the name of handouts to corporations and the wealthiest Americans, the #GOPTaxScam\n\n• blows a hole in our deficit\n• raises the cost of health insurance \n• could raise taxes on the middle class \n• could make drastic cuts to Medicare and Social Security"]["The real winners from the #GOPTaxScam will be the corporate shareholders, CEOs, and lobbyists that were paid to write the bill."]["Republicans are rushing to pass their disaster of a tax bill, so please keep up the calls, tweets, letters, emails. We need your voice now more than ever."]["On roads and highways across the country, underride crashes kill hundreds of people each year. These tragedies have a simple fix that can help save lives. This week, I introduced legislation to get this done. #STOPunderrides\nhttps://t.co/CuniS5ZJje"]["If we want to be competitive in the 21st-century economy, our students and graduates need to learn skills in the classroom that will put them on a path to the good paying jobs of the future. https://t.co/5kO75tzFHD"]["Took the family to see the new Star Wars! The boys and I loved it. That’s all I will say! https://t.co/0aJD315ANn"]["At 5:30 on a Friday evening, Republicans handed a nice little holiday present to their corporate donors. \n\nSee for yourself, this bill is a disaster. https://t.co/7IBOnbQnSg"]["As Puerto Rico continues to suffer from the devastation of Hurricanes Maria and Irma, it’s clear that we must be doing much, much more to help. Here, @Lin_Manuel writes beautifully about what it will take to help our fellow Americans in need. https://t.co/iuvIbntzqO"]["We still need your voice in the fight against the GOP tax plan. \n\nWhy? It'll kick millions off of health insurance. It's likely to raise middle class taxes—and it could lead to drastic cuts to Medicaid &amp; Social Security, all to repay the GOP's corporate donors."]["For those in New York State, your deadline for open enrollment is January 31, 2018, so you have a bit more time, but there’s no reason to wait! You can #GetCovered at  https://t.co/bVtCo3jTSA"]["Today is the deadline to sign up for quality, affordable health coverage in 2018. Go to https://t.co/rJyLTZVTkf to #GetCovered—and make sure to spread the word!"]["As of today, over 12,000 DACA recipients have lost their status. This is shameful. \n\nLet’s get to work to pass the #DreamActNow."]["The @FCC just voted to repeal #NetNeutrality, a move that attacks freedom of speech for the millions of people who use the internet every single day. This is outrageous, and I’ll be joining @SenMarkey’s effort to reverse this horrible decision. https://t.co/QsgwqnNPfr"]["After we placed a hold on his nomination, Michael Dourson withdrew his name from consideration to lead the EPA’s chemical safety office. His ties to the chemical industry made clear that he was unfit for the job. This is a huge win for families in New York and across the country. https://t.co/PtGvDb5XoH"]["5 years ago today, 20 kids and 6 educators were killed at Sandy Hook Elementary. My heart goes out to all whose lives were torn apart by gun violence on December 14, 2012, and on every day since. Congress’ failure to act is shameful. We need to pass lifesaving reform now."]["Today, the @FCC is voting on a proposal to wipe out #NetNeutrality, which ensures that the Internet is free, fair, and open to the millions of people who use it every day. Keep fighting back—make yourself heard on this."]["Ten years ago, @TaranaBurke created the #MeToo movement to tell young women of color who had survived sexual assault that they were not alone. This sparked a powerful movement, made uniquely possible by a free and open internet. \n \nThis is why we must fight for #NetNeutrality."]["A quick reminder: Have you signed up to #GetCovered for 2018? The deadline is Friday, so make sure to get it done: https://t.co/rJyLTZEisH"]["Republicans should not rush to pass their terrible tax plan until @GDouglasJones is seated in the Senate."]["The internet has opened up a wealth of opportunity for women across the country to organize, share stories, and build businesses. \n\nIf the @FCC ends #NetNeutrality, they’ll lose out: https://t.co/3yWdggLBur"]["Congrats, @GDouglasJones, on your win in Alabama! This is a victory for showing up, fighting to the end, and standing for what’s right."]["Women are a force to be reckoned with. We won’t be silenced."]["Wishing a very happy, joyful, and bright #Hanukkah to all those who are celebrating!"]["We won't be silenced. https://t.co/Di2J4hvn1R"]["You cannot silence me or the millions of women who have gotten off the sidelines to speak out about the unfitness and shame you have brought to the Oval Office. https://t.co/UbQZqubXZv"]["Great news. Anyone who is willing to serve our country, and who meets the standards, should have every opportunity to do so regardless of gender identity. https://t.co/RyDzB0V96v"]["President Trump should resign. But, of course, he won't hold himself accountable. Therefore, Congress should investigate the multiple sexual harassment and assault allegations against him."]["Under the Republican tax plan, corporations can deduct their state and local taxes, but working families cannot. How is that fair? https://t.co/Svel2oVbLX"]["Grateful to the NYPD for quickly apprehending the suspect at Port Authority. We must remain vigilant and give law enforcement the federal resources to keep us safe. https://t.co/YNEUrPan6X"]["In rushing their harmful tax plan through Congress, Republicans have broken their promises to middle class families in the name of giant tax breaks for the rich and corporations. \nhttps://t.co/3GIRkSq0js"]["We are in a moment of reckoning—and the silence from Republicans is deafening. It is long past time for them to join Democrats in holding members of their own party accountable."]["The accusations against Moore are disgusting. And President Trump has admitted on tape to how he treats women. His campaigning for Moore isn't leadership, it's shameful."]["That means Farenthold should step aside, Moore should never set foot in the Senate, and President Trump should be held accountable."]["As elected leaders, let's rise to the occasion, and not shrink away from it. That is what the larger #MeToo moment is about. Let's send a clear message none of this is okay."]["When it comes to sexual assault, harassment, and the general mistreatment of women, we must be able to call out anyone, Democrat or Republican."]["@conniebritton Thank you, @conniebritton!"]["With the Alabama special Senate election just a few days away, Doug Jones is counting on all of us to step up and help him win. Give now to make sure we defeat Roy Moore on Tuesday:\nhttps://t.co/nj6njvNLZ0"]["If the Republican tax plan passes, some New Yorkers could see the price of their homes go down by 10% or more. There’s no doubt that it’s an “economic dagger aimed” at New York’s working families.\nhttps://t.co/4ljUOeSwjz"]["Nice to grab breakfast this morning @thegemdiner with @walshformayor for a discussion about the different ways we can help working families in Syracuse. https://t.co/JFCQefPWub"]["This is an inexcusable failure by our military that has resulted in lives lost. Leadership has an obligation to fix this asap. https://t.co/hDZ2DS8J5R"]["This moment is a culmination of all the fights we’ve taken on together. Thank you for raising your voice, again and again, to fight alongside me for the things we believe in. https://t.co/G2eOo3Pxqx"]["Today, we remember the heroes who lost their lives at #PearlHarbor 76 years ago, and all who lost their lives in the war that followed. We honor the families who carry with them the memories of those they lost. May God bless them and all who serve in our Armed Forces."]["Families across the country who rely on #CHIP are needlessly living with the fear that their children might lose health insurance, all because Congress has yet to act. This is troubling."]["There’s no question that Roy Moore is completely unfit to serve in the Senate. The accusations against him are disgusting, and he’s spent his career advancing racist, homophobic and misogynistic views. \n\nDonate to help Doug Jones win: https://t.co/dGygZwjqlT"]["The Senate and the House still must come together to vote on a final tax bill. We must keep spreading the word about just how devastating this would be for America's middle class. Whether by call, text, or tweet, keep doing what you can to stop this bill from becoming law."]["When Americans are losing their lives to senseless gun violence, the last thing we should be doing is making it easier for more dangerous people to carry loaded, hidden guns in public places. https://t.co/JlnA9p8wI9"]["An excellent choice for #TIMEPOY. The women and men who have come forward to say #MeToo have not only shown extraordinary courage in sharing their stories, but have also brought forth one of the most important conversations we'll ever have. https://t.co/psE8cq5PzF"]["Over the past weeks, I’ve spent a lot of time reflecting on the moment of reckoning we’re in on this issue of sexual assault and harassment. We have to rise to the occasion, not shrink from it. I’ve written more here: https://t.co/n3DYiGnV0g"]["As elected officials, we should be held to the highest standards—not the lowest. The allegations against Sen. Franken describe behavior that cannot be tolerated. While he’s entitled to an Ethics Committee hearing, I believe he should step aside to let someone else serve."]["Thank you, Gretchen, for your willingness to tell your story and turn your experiences into meaningful action. Proud to join you tomorrow. https://t.co/MIBUYNiLas"]["It is long past time to end the culture of secrecy that protects predators and keeps victims of sexual harassment from coming forward. \nhttps://t.co/WKOwzTkMVE"]["It's a complete travesty that #Dreamers must be forced to wait and see if our Republican-controlled Congress has the guts to stand up to the president and do what’s right and humane."][".@deray references a powerful quote at the beginning of this week’s @PodSaveThePpl: “They do not need to silence us if we do not use our voice.”\n\nIt was a pleasure to be part of this episode to discuss the ways we can make ourselves heard. Thank you for having me! https://t.co/ZIDGFzrCyo"]["While the horrendous Republican tax bill has passed the Senate, our fight to stop it from becoming law isn’t over yet. We still have to vote on a final version of the bill and need you to keep speaking out. Here are some actions you can take: https://t.co/4o5fKaa3si"]["This decision certainly will not make our country any safer. \n\nMy heart goes out to the families that will be hurt by this cruel, discriminatory ban as the courts make their decisions. https://t.co/dasCB8zji1"]["Republicans left some big items to address as they focused on cutting corporate taxes last week: \n\n• Government funding, which runs out on Friday\n• The uncertain futures of hundreds of thousands Dreamers\n• Renewing CHIP for almost 9 mil kids\n\nCan I count on you to speak out?"]["I will not vote for any long-term spending bill unless Congress acts to protect our Dreamers. This is a matter of respecting basic human rights and human dignity. https://t.co/LcfY38DIl9"]["Now’s the time to believe in yourself and in one another. We may have lost today, but tomorrow is another day in our fight—and we need to fight harder than ever against this administration’s cruel agenda."]["We will win if you donate to candidates who share your values, if you volunteer to knock on doors or make calls, if you refuse to let this abominable behavior become normalized."]["My Republican colleagues need to remember who we were sent here to serve: you. I’ll spend every day fighting back and reminding them of that fact, but this fight demands all of us."]["The entire ordeal was a deafening blow to our democratic process. This bill was designed to take from everyday Americans and give to wealthy CEOs and corporations."]["In the middle of the night, Republicans rammed through their atrocious tax scam. We didn’t have time to read the nearly 500 pages of partially handwritten, scribbled notes—unlike the lobbyists who knew what was in the bill before we did."]["What a disgrace. Families in New York and across the country deserve so much better than this bill. https://t.co/oknE6s51y4"]["Heading to the Senate floor to vote NO on the Republican tax plan. Huge corporations don’t need any extra help. They’ll be just fine."]["I want to note that we’ve barely had time to review the revised Republican tax plan—and we might be voting on it as soon as TONIGHT. It is astounding the lengths that Republicans will go for corporate tax cuts."]["Flynn news is a BIG deal, but please also pay close attention to the Senate floor. Sen. McConnell just said he has the votes for the tax scam bill. Keep the pressure on—call your Senators and tell them to vote NO!"]["Republicans have been rewriting this horrible tax plan behind closed doors, but they're still keen to rush a vote on it today. How reckless. I hope you’ve been making those calls."]["We won’t be voting on the tax bill tonight, so keep making those calls and posting those tweets! Make sure your Senators hear from you about how this horrible tax plan could affect you or your family, then tell them to vote NO."]["My friend @SenatorHeitkamp is raising awareness about a very important issue—the violence and horrific crimes experienced by Native American women. Let’s not keep this unnoticed any longer. https://t.co/h080mBqLrE"]["It is up to each and every one of us to stop the Republican tax plan in its tracks. Make your voice heard. https://t.co/rLc36ISqtE"]["This tax plan will hurt hard working middle class families in New York and across the country. If you care about this issue, I urge you to speak out. \nhttps://t.co/zGiHN1USEp"]["The Senate will be voting on the harmful Republican tax plan without the much-needed debate, oversight, and transparency it should have. I’m voting against it and I need you with me. Be heard today—do everything you can to speak out and oppose this plan."]["The Republican tax plan puts the well-being of millions of seniors at risk. https://t.co/eVmBxR3pmx"]["Tax reform should reward work, not Wall Street. These promises are nothing more than corporate welfare. \n\nhttps://t.co/WVnIkDQQA8"]["I voted against Kathleen Hartnett White's nomination to serve as Chair of the Council on Environmental Quality. Her views on issues ranging from climate change, to the role of science, to clean air regulations are deeply troubling and make her unfit for this position. https://t.co/JI9CTaHDqO"]["A good tax system should do three things: It should reward work. It should be fair for working families. It should help create good-paying jobs. \n\nThe Republican tax plan does none of that."]["The #MeToo Congress Act shouldn't be \"particularly controversial, but passage is far from assured.\" That's why it's so important to be heard on this issue. Thanks to @USAToday for making the case.\n\nhttps://t.co/8VGJ8B8K8R"]["It has been more than two months since Hurricanes Maria and Irma devastated Puerto Rico and the U.S. Virgin Islands. For #GivingTuesday, will you consider donating to help the recovery effort? https://t.co/fC9fcRTBQN"]["The #MeToo Congress Act, my legislation with @RepSpeier, would finally bring real transparency to this process. Congress should come together to pass it. https://t.co/24YOTRD7fD"]["Let’s be clear about what the Republican tax plan really is: It is Washington corruption at its peak—nothing more than paying back donors through corporate welfare, at the expense of the middle class."]["“It’s a lousy idea. And it deserves a heated response from the millions of Americans who work and create online every day.” An important read on #NetNeutrality from @JRosenworcel: \nhttps://t.co/6KDkCFLuj4"]["The harmful Republican tax plan could come to a vote as soon as this week. You know what to do—speak out against it. It’s as easy as a quick phone call to Congress: (202) 224-3121"]["Here’s how we make change: Put more women in leadership, from the U.S. military, to boardrooms, to Congress."]["Sexual harassment is not confined to any one industry or any one person, it’s prevalent across society—and it’s our obligation to confront it, change the climate, and hold people accountable."]["I’m fighting to #PassMJIA because sexual assault cases must be handled by trained military prosecutors to ensure predators are held accountable and the retaliation against survivors ends. Speak out and join me: https://t.co/LhxEyUy8y7 https://t.co/R3yc5RCaxU"]["Small businesses are deeply important to our communities in New York State and across the country. I hope you'll support them and #ShopSmall today! \n\nWill you tell me how you're celebrating #SmallBizSat?"]["Very proud of this win: We worked across the aisle to include a provision in the defense spending bill that will help support the military families who make enormous sacrifices for our country.\nhttps://t.co/iGUihTdC60"]["It has been nearly two months since Congress let health insurance coverage expire for almost 9 million children. That is cruel and absurd. I hope you’ll call on your representatives to reauthorize CHIP as soon as possible."]["As we celebrate Thanksgiving, we must not forget that hunger affects all types of communities across New York State and the country. Let’s keep supporting efforts to end this problem once and for all. \nhttps://t.co/RSCtdek6ZP"]["I’m very grateful to get to spend time with my family today. This year, the boys and I made an apple cobbler. Wishing you and your loved ones a very happy Thanksgiving! https://t.co/G0neBpqt45"]["A federal court has blocked the Trump administration’s efforts to ban transgender troops from serving in our military. This is a victory for equality, for everyone who raised their voices and, most of all, for the brave trans people who serve in our armed forces. https://t.co/YxRuxORy5N"]["I’m joining my colleagues to demand a vote on the Dream Act by the end of the year. There is no excuse. Congress must act to protect the lives of Dreamers and their families, whose lives have been thrown into complete uncertainty.\nhttps://t.co/YC3zTfMa7G"]["#NetNeutrality is good for our economy and vital to our freedom of speech. I urge you to raise your voice on this. Do not let the FCC take away a free and open internet."]["I’m hearing from families in every corner of my state who are already struggling just to stay afloat. If the Republican tax plan passes, there's a good chance they will take a big hit. We must defeat this awful bill."]["The FCC is siding with big corporations by releasing a plan to claw back #NetNeutrality rules. They were hoping you wouldn’t notice. We must fight back to defend a free and open internet."]["We need to #passMJIA to create a military justice system worthy of the women and men who serve our country. I need you with us in this fight. Sign the pledge to say you’re in: https://t.co/EtsJkTbzVK https://t.co/I18eVGKShB"]["This decision puts tens of thousands of Haitian families, who make important contributions to our communities, in harm’s way. What an astounding lack of compassion. https://t.co/h7bbAiRkVb"]["There’s still time to #GetCovered! Open enrollment is happening now until December 15. Head over to https://t.co/rJyLTZEisH and sign up now."]["“There is no debate. The middle class will pay more in taxes than under current law, and the rich will pay less.” https://t.co/DmIz7dcbq8"]["I am placing a hold on Michael Dourson’s nomination to lead the EPA’s chemical safety office. Here’s why: \nhttps://t.co/Tj1a9AiT9a"]["A reminder: Senate Republicans are trying to pass a tax bill that will leave millions of Americans uninsured and raise insurance prices, all so that they can slash taxes for billionaires and big corporations. \n\nIt’s up to all of us to speak out and stop it."]["Today, I headed to the steps of the Lincoln Memorial to join the #UnityMarchForPuertoRico. It was amazing be with so many standing strong on behalf of our fellow Americans in Puerto Rico &amp; USVI. We will not give up. Let's keep fighting to get them the relief needed to rebuild. https://t.co/K0RXaXsQ9M"]["I spoke with @jestei &amp; @nytimes about how sexual assault and harassment are confronted across our institutions. The brave survivors who’ve shared their stories have brought forth a moment of reckoning. Together, by raising our voices alongside them, we can become better. https://t.co/1I4GHhtWx8"]["ICYMI: I introduced a bill with @RepSpeier to address sexual harassment on Capitol Hill. Learn more about our efforts:\nhttps://t.co/nuzGm591Hc"]["The White House’s request for disaster aid is not nearly enough to help the recovery efforts in Puerto Rico and the U.S. Virgin Islands. https://t.co/G55WnB2S6D"]["@callyrgf @RepKClark Thank you @aminatou, @annfriedman for having me! Let’s keep working to encourage more women to run (and win!) up and down the ballot."]["As elected officials, we should be held to the highest standards—not the lowest. https://t.co/d2kYIP2vKt"]["This tax plan hurts middle class families to give tax cuts to the wealthy and big corporations—and the Senate version is even worse.\n\nSound the alarm. It's time to speak out. https://t.co/NTSQjCAHOM"]["The allegations against Sen. Franken are deeply concerning. This kind of behavior is unacceptable and should not be tolerated anywhere in our society. There is nothing funny about it and there is no excuse for it. The Ethics Committee deserves answers from him."]["There should be no more excuses. The status quo must end. Listen to the stories of military sexual assault survivors. Listen to their experiences. Then, please join me in this fight. Let’s do everything we can to #PassMJIA."]["Today, we renewed our bipartisan push in Congress to pass the Military Justice Improvement Act, a bill that would take the prosecution of serious crimes, like sexual assault, from the military chain of command to give to independent, trained military prosecutors."]["How much longer must our brave service members wait before we finally do the right thing?"]["Top officials continue to say that they will fix this problem. Every Secretary of Defense, beginning with Dick Cheney in the early 90’s, has pledged 'zero tolerance.’ Yet nothing has changed. The system is still broken. We continue to have little accountability."]["In recent months, scandal after scandal has made clear that sexual assault and harassment remain pervasive in our military."]["Senate Republicans are using their tax plan to sneakily repeal part of Obamacare and leave millions uninsured. I need you to speak out—add your name to fight back: https://t.co/TyjfQa9TCx"]["This is amazing to hear. Congratulations to you, @RossMoRock, and the entire @runforsomething team! https://t.co/k4ccE0UBsG"]["When it comes to addressing sexual harassment, Congress should not play by their own set of rules. As elected officials, we should be held to the highest standards. \n\nWe need reform—and I'll be working with @RepSpeier to get us there. https://t.co/TkEsKDMPeC"]["Completely unconscionable that Republicans want to kick 13 million off of health insurance in the name of tax cuts for corporations and the wealthiest Americans."]["Yet another senseless act of violence. How many more of these tragedies must occur until we see real, meaningful action from Congress? \nhttps://t.co/FxCXjX86nJ"]["Republicans are now looking to gut health care for their corporate giveaways. All the more reason to speak out against this harmful tax plan. https://t.co/IVsHR3jcmZ"]["We shouldn’t add to the burden of the millions of young graduates who are drowning in student debt. https://t.co/sPALEb82Uo"]["It's National Run for Office Day! If you're thinking about running, I encourage you to go for it. #runforsomething https://t.co/r7CjQybFSZ https://t.co/a6Q76gWkv2"]["Because of you, we defeated Trumpcare three times. It is absolutely critical to do the same for the harmful Republican tax plan. Please, take the time to contact your elected officials this week on this issue. Be heard."]["Red flag. While an executive at Eli Lilly, Alex Azar, Trump’s new HHS pick, oversaw questionable spikes in insulin prices. https://t.co/83sxIyGDg1"]["We should be rewarding work in this country, not doling out lavish tax cuts to big businesses, CEOs, and bankers."]["I cannot say this clearly enough: If you're not rich—if you’re part of a hard working, middle class family—then there’s a good chance you'll take a hit if the Republican tax plan passes."]["Today, we honor the incredible service and sacrifice of our veterans and their families. We are so grateful. Thank you, and happy #VeteransDay. https://t.co/A6a7OhCdlQ"]["I’m introducing legislation to change the way that sexual harassment is addressed in the halls of Congress. Yesterday, I spoke to @mitchellreports about it: https://t.co/fBzx239J5L"]["Puerto Ricans are not receiving the food relief that they desperately need. My colleagues and I are taking action to fix this by fighting to increase food aid funding in the disaster relief bill. \nhttps://t.co/sKboFgXgKw"]["During last night’s #CNNTownHall on sexual harassment, I spoke about the bravery of the women and men who have come forward to say #MeToo. https://t.co/WkvoHgvRmF"]["A very happy birthday to the U.S. Marine Corps! Thank you to every Marine who has served and who continues to serve."]["Four women all with shocking stories. I believe them."]["Appalling. There’s no question Roy Moore is unfit for office. https://t.co/CCtA9VpOfa"]["If you thought the House tax plan was bad, the Senate plan is worse. This is corporate welfare at the expense of the middle class."]["These women are rising up to own our democracy. How amazing to see! https://t.co/Wcc8RZi2lC"]["The Republican tax plan is a blatant attempt to hand the collective wealth and resources of our country to rich corporations on the Fortune 500 list."]["New Yorkers, there is still time to head to the polls today! You can confirm your polling place here: https://t.co/PKxMC8QIoo"]["@JenAshleyWright @harpersbazaarus That’s right—it’s time for every woman to get out there and raise her voice. It was a pleasure to speak!"]["In the wake of the mass shooting in Texas, I spoke out to demand immediate action on gun violence. \nhttps://t.co/pxXU5ag2Jj"]["Happy #ElectionDay! Get out there and vote to take back the future for ourselves, our families and one another. https://t.co/xysWg1TIrC"]["No excuse for this. I'm calling on the Department of Defense to audit old case files to prevent this deadly error from happening again. https://t.co/J9i7o9N15W"]["We create change when we make our voices heard. Tomorrow is #ElectionDay—make sure you know where to vote: https://t.co/9zHX2AWP2O"]["Plain and simple, Americans are being slaughtered and Congress is refusing to stand up for them. This is a monumental failure of leadership."]["I reject the notion that it is “too soon” to act on gun violence. If not now, when? We cannot wait any longer."]["How many times can our hearts break for communities in America ripped apart by gun violence? We can never allow this to be the new normal. https://t.co/E20xAC72JE"]["@BilldeBlasio @JuanitaForMayor @MayorByronBrown @LauraCurran2017 @Vote4Latimer @MPorette @wpmayorroach @Andrea4CoExec We need these people fighting for New York &amp; they’re counting on your support. So make a plan to #vote on Tuesday, then head to the polls!"]["@BilldeBlasio @JuanitaForMayor @MayorByronBrown @LauraCurran2017 @Vote4Latimer @MPorette @wpmayorroach .@Andrea4CoExec has the experience and good judgement to lead Rensselaer County. She’ll be a true advocate for the community."]["@BilldeBlasio @JuanitaForMayor @MayorByronBrown @LauraCurran2017 @Vote4Latimer @MPorette @wpmayorroach Tracey Edwards has a proven record of governing &amp; managing responsibly. She’ll be a fighter for Huntington. https://t.co/2tZ16CCeqD"]["@BilldeBlasio @JuanitaForMayor @MayorByronBrown @LauraCurran2017 @Vote4Latimer @MPorette White Plains residents have a strong advocate in @wpmayorroach. I hope he can continue leading us forward."]["@BilldeBlasio @JuanitaForMayor @MayorByronBrown @LauraCurran2017 .@Vote4Latimer cares deeply about those he represents in Westchester County, and is never afraid to tackle difficult problems."]["@BilldeBlasio @JuanitaForMayor @MayorByronBrown .@LauraCurran2017 understands that we’re here to serve the people who elect us. Nassau County needs her leadership and vision."]["@BilldeBlasio @JuanitaForMayor In working with @MayorByronBrown, I've seen firsthand the way he'll continue making Buffalo residents a top priority. Proud to support him."]["@BilldeBlasio As a mother, attorney, and veteran, @JuanitaforMayor is committed to building a strong community in Syracuse. We need her leadership."]["@BilldeBlasio Mayor Lovely Warren is a fierce advocate who I know will lead the city of Rochester to a brighter future. https://t.co/ovnEQZyUu1"][".@BilldeBlasio is a staunch, progressive champion who will always put New York City’s families first. I’m proud to work alongside him."]["#ElectionDay is Tuesday! I’m thrilled to support many great New York Democrats up and down the ballot &amp; I'd like to share a bit about them."][".@LarryKorb: “It’s time to do what our allies have done or this problem will continue to get worse.” https://t.co/lQxM6sRlbi"]["My bill would increase accountability and transparency in the sexual harassment reporting process."]["Today, I’ve announced that I will introduce comprehensive legislation to combat sexual harassment in Congressional offices."]["For an issue as serious as sexual harassment, Congress should never play by their own set of rules.\nhttps://t.co/gvrQCDl8kW"]["I’ll sum up the new Republican tax plan: The super-rich and big corporations get kickbacks, middle class Americans are left in the dust."]["Years of corporate donations are paying off today as House Republicans unveil their new tax plan."]["Open enrollment has begun. Don't forget to sign up! Head to https://t.co/bVtCo3jTSA or https://t.co/rJyLTZVTkf to #GetCovered today."]["This bill, introduced by @RepEspillat and @RepDanDonovan in the House, would help protect pedestrians and bicyclists—and keep cities safer."]["Today, I introduced the Senate version of the STOP Act, which will provide funding for traffic barriers in cities across the country."]["New Yorkers are resilient. No cowardly act of terror can change who we are."]["This is not who we are. The New Yorkers I know pull together and roll up their sleeves to help in times of tragedy. https://t.co/kAj9sEFrCs"]["As NYC has shown over and over, we are resilient. We will not cower to senseless hate. I am confident we will get answers."]["A horrific act of terror in NYC today. My heart is with the victims and families—I am grateful to the NYPD, FDNY, EMS, NYS police and FBI."]["It’s clear: We need more women in public office. Will you be part of this movement?  \nhttps://t.co/JLAnQaW4MF"]["The Republican tax plan will raise middle class taxes to pay for corporate welfare and giveaways to billionaires. \nhttps://t.co/qhX53k9wjl"]["This movement belongs to every woman who is marching, protesting, speaking out—and we're not finished yet. #WomensConvention https://t.co/7KVhoKaIBo"]["This morning, I had a great time speaking with @ZerlinaMaxwell for a @SIRIUSXM town hall. Watch our full discussion: https://t.co/RYMAcYRiP5 https://t.co/bYEGJniDcc"]["@clairecmc So sorry to hear, Claire. Thinking of you both and wishing for a swift recovery."]["I’m glad to hear that the courts have ruled against this harmful, misguided ban on transgender troops. https://t.co/kCkgf53ZZN"]["My statement on today’s indictments in FBI Special Counsel Bob Mueller’s investigation of the Trump campaign. https://t.co/xvw9UZl1hI"]["This survey makes a clear case for taking the prosecution of military sexual assault cases out of the chain of command. https://t.co/4wGe5Hf9rJ"]["Excited for New York State to set an example for the nation as they begin a new paid family leave policy. https://t.co/4R21Zz78mG"]["5 years since #Sandy hit communities across NY, we must recognize the work left to do to help our families still struggling to recover."]["I can't wait to take the stage at the #WomensConvention tonight. Are you attending or watching? If so, tell me what you're excited about!"]["Republicans in Congress took a big step toward giving tax breaks to big corporations, while taking one away from middle-class taxpayers. https://t.co/FAWBsvggLa"]["See you soon, Detroit! #WomensConvention https://t.co/7rwgBznY5i"]["Every Secretary of Defense since Dick Cheney has claimed to have zero tolerance for military sexual assault.\nhttps://t.co/86AbUuak67"]["Any plan to end the opioid epidemic must include ending the over-prescription of these medications for acute pain."]["It is Scott Pruitt's job to get toxic PCBs out of the Hudson River. We'll keep holding him accountable. \nhttps://t.co/Yn6XKLzHBy"]["Dreamers are leaders, teachers, innovators, and scientists. We must do what we can to give them a path to citizenship."]["An important read in @USATODAY. It is appalling that top military officials are committing these kinds of crimes. https://t.co/ZYliFZdIth"]["Dourson would be required to protect Americans from being poisoned by companies who've paid him. I don't trust him with that responsibility. https://t.co/gjQcaHJwau"]["What we need now is a new Marshall Plan. That's the only way Puerto Rico and the US Virgin Islands can fully recover and rebuild."]["I voted for the Disaster Relief funding bill, but I want to be clear that it is not enough to help with Puerto Rico &amp; USVI's recovery."]["This move is bad for consumers, bad for transparency, good for big corporations. I'm voting against it."]["Forced arbitration helps corporations take away your legal rights to sue for wrongdoings."]["The Senate GOP is calling a vote on a bill to make it easier for corporations to use forced arbitration—a practice that harms consumers."]["The suffragists give us inspiration &amp; courage in our fights to ensure equal pay &amp; end domestic violence, fights started over 150 years ago."]["The only silver lining of the Trump presidency is that more women are speaking out, fighting back, &amp; running for office in record numbers."]["I am excited to head to Detroit on Friday to join the #WomensConvention and build upon the progress of the women’s movement. https://t.co/uazJXg2N4X"][".@Bakari_Sellers, it was such a pleasure to speak with you last week! Listen to our conversation on the latest episode of #ViewPoint: https://t.co/WA1pC6Momn"][".@MMFlint, thanks for having me on your final Broadway show! Congrats on a great run &amp; for urging people to take action &amp; make a difference. https://t.co/IUujPHXbht"]["My bill, the Stop CEO Excessive Pay Act, would close this loophole. That's what real tax reform looks like.\nhttps://t.co/3RxSjt0djh"]["Did you know that big corporations can get massive tax deductions for paying excessively high salaries to their CEOs?"]["I'd say so. https://t.co/m8Jl5Y8yrC"]["Republicans are putting big corporations and the rich over middle class families saving for retirement. Terrible. https://t.co/3akpmAtJls"]["Of course—caregivers do critical work to support families across New York and the country. I’m glad to support them.\nhttps://t.co/GjomTi800Y"]["That's right! It's why we all need to keep fighting for a $15 minimum wage. https://t.co/3Z765EmF3o"]["I stand with IBEW Local 3 and all of our union brothers and sisters who are fighting for economic equality. https://t.co/POBHZdEd8x"]["More, and immediate, action is needed to help Puerto Rico on the long road to recovery. https://t.co/XT0OCos61i"]["Happy #SpiritDay—today and everyday, let’s show our support for #LGBTQ youth and stand together against all forms of bullying."]["Wishing a joyful and happy #Diwali to all celebrating the Festival of Lights in New York and around the world!"]["I'm proud to join @PattyMurray, @LouiseSlaughter, @RepDianaDeGette on a bill to reverse Pres. Trump's rollback of the birth control mandate."]["On ending sexual assault in the military, @supriya_venk courageously says: \"It is too big and important a job to be left to a few good men.\" https://t.co/XwwdMoSDt5"]["This is disrespectful to the Senate's role in the nomination process and to families who are worried about the effects of toxic chemicals."]["Dourson shouldn't set foot inside the EPA at all, but definitely not before the Senate has had the chance to vote on him. https://t.co/4mHSyAlPQU"]["If you’re a member of Congress and not even willing to renew health insurance funding for vulnerable children, then who are you serving?"]["It's another heartless budget that would lead to taking from working families, seniors, children, the sick and poor to give to the top 1%."]["It's another heartless budget that would lead to cuts to education, health care, affordable housing, child care—programs working people need"]["Let's be clear: The Senate GOP budget is a vehicle to a huge tax cut for big corporations &amp; the rich, written by big corporations &amp; the rich"]["Let me tell you the words I wish someone had said to me 20 years ago: \n\nYou should run for office. \n\nhttps://t.co/ZKhAkkGRMb"]["If you're outraged, the first vote on Michael Dourson (a chemical industry insider) to regulate chemicals at the EPA is tomorrow."]["As Tom Marino withdraws his nomination to be drug czar, perhaps the president should stop nominating industry shills altogether."]["To survivors who have shown extraordinary courage by speaking up: You're not alone. We're listening. And we believe you."]["Congress must still take up the unfinished business of renewing health insurance for 9 million children. Have you made your voice heard yet?"]["Grateful to @jonlovett and @crookedmedia for having me on #lovettorleaveit! Listen to our chat: https://t.co/zDIeni6PjB https://t.co/ZbRuFJl1D5"]["It’s our responsibility to stand up for those who fight for us. \nhttps://t.co/3ZYnjl3Rqw"]["Ending ACA subsidies makes no sense. It helps no one—and if you aren’t helping people, you should go home."]["This decision will be devastating for the middle class. It increases premiums and could leave up to a million people uninsured."]["The president’s decision to end ACA subsidies is a cruel attempt to play partisan politics with our health care."]["This purely political act undermines the US’s position in the world &amp; strengthens Iran’s while sending an unfortunate message to North Korea https://t.co/Lnjbc0kYQZ"]["When there's a crisis, we pull together, and never leave a fellow American behind. I wrote about PR for @Refinery29: https://t.co/dCLrlBc2qN"]["This is nowhere near close to the amount of funding needed to rebuild. We must go further to help. https://t.co/Q6RgVNZzQu"]["It was fun to spend time with @JonnyVanMeter again for @voguemagazine to talk about these intense times. https://t.co/iVxbub3AgF"]["This will sabotage health insurance markets and will be catastrophic for millions of Americans, whose coverage will become more expensive. https://t.co/ZcRpjNnEYA"]["We should be doing much, much more to help—that's why we need a Marshall-style plan to rebuild Puerto Rico as soon as possible."]["This is absolutely shameful. It is your obligation to keep them there as long as our fellow Americans are in crisis. https://t.co/IiVtJAPK1Q"]["Let's encourage every girl to raise her voice, trust her power, and be a force for change. \n\nHappy International #DayoftheGirl! https://t.co/gC17gV0QGi"]["In 2017, no boss should get to decide a woman’s access to birth control. I’m sick of these relentless attempts to roll back our progress."]["Many are trying to bring desperately needed resources to loved ones Puerto Rico. We must all step up, too https://t.co/8ijK2zmX7i"]["It would serve the Trump administration well to quickly embrace the fact that climate change is real―our safety and security depend on it."]["Congress can, and should, come together around Puerto Rico’s recovery. https://t.co/V8bR2oc2QR"]["Another move to cede our country’s leadership on global climate change. A terrible decision. https://t.co/v6S7A7TbP9"]["After traveling to PR to see the relief effort, it is clear that there is much more work to be done to help our fellow citizens recover. https://t.co/z4WIhlcszm"]["Tomorrow, I’m heading to Puerto Rico to see how we can help our fellow citizens recover as quickly as possible. https://t.co/EDHtRE5TlG"]["Needless to say, I will be voting against Michael Dourson's nomination to lead the EPA's chemical safety office. https://t.co/ZFEPAh2gGg"]["A woman’s health care decisions should be made between her and her doctor. No one else."]["Women across the country will suffer because of this decision. This shouldn't have been up for debate in the first place. We'll fight back. https://t.co/XcIwzieC3z"]["For $1.5 trillion, we could\n• Lift 3.2 million kids out of poverty\n• Guarantee paid family leave\n• Make public college tuition free"]["The Senate GOP tax plan adds about $1.5 trillion to the deficit over next decade, all for tax cuts for the wealthy. https://t.co/woCqSkjKMl"]["Enough is enough. We must work around the clock to prevent senseless gun violence. Here’s one of many solutions: \nhttps://t.co/oJYYrpmc2N"]["Spread the word and speak out to pass the #DREAMAct. https://t.co/0GPgWlBcLl"]["It would be shameful for Washington to turn its back on our fellow American citizens in Puerto Rico. https://t.co/UMt42PPJrE"]["If middle class &amp; low income New Yorkers have to pay more in taxes, and large corporations don't, it's a bad plan. \nhttps://t.co/wfwzJOL6zL"]["Women's reproductive rights are not negotiable. If they refuse to give up their attacks, we'll keep fighting back. \nRise up and speak out."]["It's astounding: Republican leaders will never end their near-constant attempts to roll back women's access to health care."]["The House has voted to attack women's reproductive rights once again. It's a horrific piece of legislation."]["Inspired by the hotel workers in Albany, and by workers across New York State, who are fighting for the wages and benefits they deserve. https://t.co/iPdZ1wNSad"]["Ending DACA doesn’t make our country safer or our economy stronger. I hope you’ll lead where the president won’t and stand up for Dreamers."]["Congress must take gun violence as seriously as the threat of terrorism. If you agree, call your representatives today."]["This senseless violence must end—thoughts and prayers are simply not enough. We must act to prevent this from happening again."]["Devastated to hear of the horrific tragedy in Las Vegas. My heart is with the victims and families. Grateful to the responders at the scene."]["Millions of Americans in Puerto Rico and USVI have no food, no water, no power. Here's how to help. https://t.co/lT2kcmVAZe"]["A tax bill written by the rich and powerful for the rich and powerful. https://t.co/emlkUwyf07"]["We can, and we must, come together to support and fight for transgender service members. https://t.co/Pzb4Zn880W"]["Offensive. When millions in Puerto Rico are in crisis, the president should be better than this. https://t.co/ca52gNgHUZ"][".@KyrstenSinema is a powerhouse. I’m glad to hear that she’s #offthesidelines and running for Senate! https://t.co/bvrVy1N1xL"]["American citizens are dying. This is horrific. We must act with urgency. https://t.co/MwLCvM1npf"]["Opening our doors to refugees helps our economy and our role in the world. Powerful words from Adm. Mullen. https://t.co/OmwaKrA2nu"]["I will vote against @AjitPaiFCC. We must protect net neutrality rules on behalf of freedom of speech and innovation."]["New Yorkers: This year’s \"I Voted\" sticker will celebrate 100 years of women's suffrage in NY. Pick your favorite! https://t.co/eQ274XZ0iK"]["Trump's tax plan helps large profitable corporations and millionaires, shortchanges lower income workers and the middle class. A cruel joke."]["“Any individual who meets the standards should be afforded the opportunity to serve.” I agree. https://t.co/YhsKQJGzyb"]["Today was a victory in our fight to save health care for millions. But remember this: The fight won't end until we flip the House &amp; Senate."]["Thank you. Your calls, letters, tweets, and actions helped to stop the health care vote. Never underestimate the power of your voice."]["We cannot ignore the unfolding tragedy in Puerto Rico. Congress must act now to help. It is our obligation. https://t.co/TtYqb0Tjaf"]["#GrahamCassidy would end funding to Planned Parenthood and harm women in many other ways. https://t.co/ZU0b5biZwc"]["It is clear that millions of Americans would be harmed by #GrahamCassidy. This bill would hurt many families."]["Blocking students, business people, tourists &amp; family members of U.S. citizens from coming here, for no good reason, doesn’t make us safer. https://t.co/Fmzq9bbaip"]["Checking in: Have you called your Senators this morning to help protect health care for millions of Americans?"]["Our fellow American citizens in Puerto Rico are in crisis and need our help. Here are some ways to do your part. https://t.co/zLoGn2PaVc"]["In cases like this, Scott Pruitt and the EPA have important roles to play in protecting farmers and consumers. Where are they? https://t.co/oCzRkD6mE1"]["An informative thread. Read and learn more about our work to expand child care on college campuses. https://t.co/sUS5UaTaTj"]["A quick note to all women: \nHave you thought about running for office? https://t.co/jbj8Sm2BTQ"]["With so many unanswered questions around these cyber attacks, we need a 9/11-style commission to investigate what happened. https://t.co/aN2hD8PcBS"]["This fight still isn't over—please keep up the calls to stop the #GrahamCassidy bill once and for all."]["Shameful. This decision will hurt and betray students, plain and simple. https://t.co/b2syuMM4ma"][".@iamsambee called my office this week to ask if I was voting against #GrahamCassidy. Now, it’s your turn to call your Senators today! https://t.co/fcE6anHQM4"]["Let's demand a military justice system that is transparent, effective, and worthy of our service members. \nhttps://t.co/O8sDj8EKLz"]["Right-to-work laws weaken workers’ voices in the workplace. I’m joining @SenWarren and @SenSherrodBrown to push back https://t.co/RRllKxnDgV"]["Sending strength to our friends in Puerto Rico today. Melissa, thank you for your insight and for taking the time to speak with me. https://t.co/jAqo8KIKXF"]["Evergreen. https://t.co/QK7xka21yK"]["Senate Republicans could have the votes to pass #GrahamCassidy. We must do everything we can to stop this awful bill. Speak out. https://t.co/f11goS0TSk"]["It’s time to pass the #DREAMAct for the 800,000 young people who know only the United States as their home."]["Proud to work with @ProtectRDfnders, who have pushed hard for important change in our military justice system. https://t.co/Dz1eGUirq9"][".@jimmykimmel explains how #GrahamCassidy will harm millions of Americans. A powerful monologue. https://t.co/03vPPkX0xF"]["L'Shanah Tovah to all celebrating Rosh Hashanah. Sending my warmest wishes for a happy New Year."]["We need all hands on deck. Please take the time to contact your Senator and tell them to vote NO on #GrahamCassidy. Your calls matter."]["#GrahamCassidy will hurt New Yorkers, who could lose nearly $19 billion in health care funding."]["#GrahamCassidy is yet another health care repeal bill that will have a devastating impact on women's access to reproductive health care."]["#GrahamCassidy is yet another health care repeal bill that will kick millions off of coverage."]["Senate Republicans are once again showing little regard for transparency. https://t.co/iuYc6fOYnL"]["Senate Republicans will keep trying to repeal the ACA up until Sept 30. We stopped these attempts before, it’s on us to stop it again."]["Thinking of those in Puerto Rico, the Virgin Islands, &amp; the Caribbean who'll be impacted by Hurricane Maria. Please find shelter &amp; stay safe https://t.co/07bAyTSrQD"]["Do not let the Senate GOP rip health care away from millions. Contact your Senators today and tell them to oppose the Graham-Cassidy bill. https://t.co/3iAl6NaAat"]["One thing Betsy DeVos could do to address campus sexual assault: Support the Campus Accountability and Safety Act. https://t.co/pAyNDD1Jai"]["This week, we must push back on yet another attempt by Senate Republicans to repeal the ACA. Your voice is needed. #GrahamCassidy"]["“Wouldn’t you pay $7 a year to get money out of politics?” A great conversation with @ChelseaHandler.\nhttps://t.co/C292hW1gLa"]["That’s right: Transgender people are not a burden. We won’t stop fighting for them. \nhttps://t.co/bHLhykICLX"]["As I’ve talked to people all across New York, one thing has become clear to me: Health care shouldn’t be a partisan issue. #MedicareforAll"]["People willing to put their lives on the line for this country shouldn’t have to endure this kind of uncertainty. \nhttps://t.co/lSaVrrkMI1"]["Senate Republicans are moving quickly to try to pass yet another bill to repeal Obamacare. We must push back. https://t.co/gVrftKb8M3"]["Had a wonderful conversation with the @PodSaveAmerica team this week. You can listen to it here: \nhttps://t.co/OAvXXaFvkW"]["No one, neither the Russians nor large corporations, should have the ability to influence our elections from the shadows. https://t.co/D4FBDpMq4o"]["Learn more about what's next in our fight to protect transgender service members. https://t.co/2GKU37TbBF"]["It's time to urge your member of Congress to support this bill. Speak up for our trans service members who deserve to stay in uniform."]["Yesterday, Sen. McConnell cut off debate on the defense bill and we didn't get to vote to protect trans service members. I'm outraged."][".@LindseyGrahamSC and I introduced a bill to put together a 9/11-style commission to look into vulnerabilities in our election systems."]["The 2018 elections are not too far away. There isn’t much time, and we must take action soon."]["Americans deserve a clear understanding of how, when, and why we were attacked in 2016. It’s time to get to the bottom of what happened."]["Our country’s election systems remain vulnerable to cyber attack. We must figure out how we are vulnerable and how we can fix it."]["Too many insurance companies value profit more than the people they’re supposed to help. It's time for something better. #MedicareforAll"]["Let’s fight back to make sure @BetsyDeVosED and the Department of Ed do not turn their backs on survivors of campus sexual assault. https://t.co/TTkiTR1DOM"]["She was the grande dame of civil rights for gay Americans. https://t.co/4FPSnKfTUC"]["@AlyssaMastro44 @TeenVogue @PodSaveAmerica You’ll have to wait and see—hope you all tune in!"]["Transgender men and women who love our country enough to risk their lives for it, and even die for it, deserve to stay in our military."]["Our current health care system leaves too many uninsured or unable to access the care they need. That’s why we must pass #MedicareforAll."]["Congratulations to @Lin_Manuel who just accepted the 2017 Freedom Award from @USCapHis. A well-deserved honor! https://t.co/Jqp6JMshqf"]["Edie Windsor was larger than life, and her leadership was indispensable to our fight for equality. Thank you, Edie. We will miss you. https://t.co/fuNX2cDAT7"]["If you believe every American should have good, affordable health care, join me in supporting Medicare for All. https://t.co/Sx8OSHh95q"]["Health care is a right, not a privilege. This week, I'll proudly join Senator @BernieSanders to co-sponsor Medicare for All."]["Today, we honor those lost on September 11, 2001, and remember the courage and heroism of our first responders."]["Supporting caregivers is critical to healthy families and a strong country. I'm glad to hear @NA4Caregiving giving supports the #FAMILYAct. https://t.co/yM2VoBbQYb"]["Will I see you at my town hall in Brooklyn on Sunday? I hope you can join us. https://t.co/E1fTceDf8k"]["No current active duty service member should be discharged based on their gender identity. #ProtectTransTroops"]["It takes resolve and unrelenting persistence to fight for what you believe in. Grateful to @RollingStone for letting me make the case. https://t.co/v2o6uaHuoA"]["This betrays students. @BetsyDeVosED should be doing everything she can to make Title IX enforcement stronger. https://t.co/Kt6GO0XoIQ"]["You spoke out to protect health care. Now, it's time to speak out to protect Dreamers. Make those calls."]["Today at the Department of Ed, I called on @BetsyDeVosED to protect Title IX guidance for campus sexual assault survivors. #INeedIX https://t.co/HyX1s62k1z"]["Diversity is our strength. This country thrives because of immigrants."]["Thinking of those in Puerto Rico, the US Virgin Islands, Florida, and all areas in Hurricane Irma's path. Stay safe."]["This race to the bottom is not what American workers need. They need living wages and overtime protections. https://t.co/mkIcdXDoWe"]["It's time to give Dreamers the path to citizenship that they rightly deserve and pass the DREAM Act."]["Moving to end DACA will not make our communities safer or our economy stronger."]["It's simply wrong to needlessly target hardworking young adults in order to score political points. #DefendDACA"]["DACA has helped hundreds of thousands of young people come out of the shadows and achieve their dreams. #DefendDACA"]["This #LaborDay, I’m saying it loud and clear: It’s time to recommit ourselves to fighting for strong American unions https://t.co/qzkgQSm5R0"]["Dreamers have only ever called the U.S. their home. This is their country. \n\nThis action is an affront to who we are as Americans. https://t.co/lemLcEP8sa"]["Stay informed about the Trump admin’s efforts to undermine workers’ rights—then speak out against them. https://t.co/NlZKRxkldB #LaborDay"]["Enjoying your #LaborDay weekend? Thank the unions, who have raised the bar for the entire American workforce."]["It’s time to raise our voices in support of #paidleave for our workers, our businesses, our families. #LaborDay"]["With so much that we care about at risk, it’s never been more important for all of us to speak out and stand up for our values."]["For #LaborDay, @SherylSandberg makes a compelling case for the #FAMILYAct. https://t.co/QEbdXgge1c"]["Stories like this demonstrate the need to change our laws and expand research into #medicalmarijuana. https://t.co/Tk3JeCc8Bc"]["The American people deserve a clear understanding of what happened and what our vulnerabilities are so that this never happens again. https://t.co/4GUpps2haV"]["Agreed. I was proud to have voted for the DREAM Act in the past. I will proudly keep fighting to pass it as a co-sponsor. https://t.co/FS372NzF0x"]["Ending wage transparency makes it harder to ensure equal pay. Another broken promise from this president. https://t.co/lxtRkqSBM3"]["It’s our responsibility to push back against this hateful policy. https://t.co/ZgCOCLNyAx"]["Ending DACA would impact the lives of hundreds of thousands of young people who contribute a great deal to this country. #DefendDACA"]["Grateful to the New York Guard and all New York first responders aiding in #Harvey rescue efforts. https://t.co/nXF33FJDpG"]["We're taking our town hall to Buffalo! Hope you can attend. I'd like to learn more about what's on your mind. https://t.co/XXR5oZn7mi"]["As I've said before, this is cruel and wrong. I will fight this for our trans men and women bravely serving in the armed forces. https://t.co/xdqeU8w8HM"]["Thinking of the families affected by #Harvey this weekend. Praying for those who have been hurt or have lost their lives."]["Do you know a woman who should take the plunge and run for office? Ask her to run. Ask her today."]["It is abundantly clear that sexual assault in the military remains a pervasive problem that puts troops at risk and harms military readiness https://t.co/HZQo1ij7jY"]["I'm heading to Kingston for a town hall on Saturday! Hope you'll join me if you're in the area. https://t.co/0UByCFeHFd"]["To all trans men and women serving bravely in the military: I plan to introduce legislation to fight back. We'll keep raising our voices. https://t.co/kvKLXe1aN4"]["Taxpayers have invested hundreds of millions to recruit and train transgender service members willing to fight and die for this country."]["This move has little to do with military strength, and everything to do with discrimination and ignorant bigotry. \nhttps://t.co/kvKLXe1aN4"]["Katrinka, thank you for making your voice heard. Climate change is one of the most important issues of our time. https://t.co/IFCgJ9fV7L"]["It’s short-sighted to kill funding for a program that helps prevent teen pregnancy in Buffalo and across NY. https://t.co/2uVWcbZlzN"]["@POTUS I'll be calling for hearings in the Senate where Congress must demand accountability and transparency from this Administration."]["Until @POTUS can define what success in Afghanistan looks like, sending more troops to fight there is a disservice to their sacrifice."]["Child care in this country can have a hefty price tag—it's time to support working families by helping to lift the burden of these costs."]["We must not give up hope; we must make it clear to those who live in fear that we stand with them and we support them."]["We will never forget Robert and Raymond's sacrifice. My prayers are with their family and friends. https://t.co/hc5gB5ob0a"]["Silence is not an option—it is our responsibility to push back against hate. https://t.co/k1Vb6AkEeJ"]["It​'s a basic civil liberty for a woman to​ ​make her own​​ ​decisions about her​ ​reproductive​ ​health care. This move is​ ​unacceptable. https://t.co/kVmwIqjxkP"]["Leadership means standing up and speaking out when equality is in jeopardy and hateful ideologies undermine our common values."]["Equality and justice are the lifeblood of our democracy and we must consistently defend and fight for those basic tenets."]["Statues commemorating the Confederacy should not sit on pedestals, uplifted as a celebration in our cities."]["America does not tolerate diversity; it thrives on it."]["If he won’t lead, we have to. And we will. https://t.co/TYkBCcSmaW"]["Couldn't agree more. https://t.co/crdyhuMvqM"]["Wow, what a disgrace. There is only one side. No one, especially not the leader of the free world, should ever tolerate violent racists."]["Dreamers deserve every chance and opportunity to keep contributing to the country that they love. #DefendDACA"]["Sending my condolences to the families of these two brave @82ndABNDiv Paratroopers—Sgt. Roshain Brooks of Brooklyn, NY &amp; Sgt. Allen Stigler https://t.co/5UxAEfVPTT"]["From revitalizing American manufacturing to raising wages, we must have long term conversations about building an economy that rewards work."]["A strong national paid leave plan will lift up all American families. \nhttps://t.co/wyBxmFvV2M"]["I know we are better than this, but we must all speak out against this hate. Silence is not an option."]["White supremacy and neo-Nazism have no place in America. Domestic terrorism like this cannot be tolerated."]["The images out of Charlottesville are some of the worst I've seen in America in my adult life."]["We must not remain silent or accept the hate and bigotry brought to Charlottesville, VA—or anywhere in this country."]["I’ll keep working to help close the digital divide and make sure our rural communities can have access to high speed internet. https://t.co/FXF946VpnS"]["A great read about working moms sharing their experiences with pumping in the workplace. https://t.co/msnoRxGUxp"]["It was a pleasure to hold a town hall in my hometown of Troy, NY. A great discussion! Thank you to all who attended. https://t.co/oYLswUWlRf"]["Very grateful to @sherylsandberg for calling for a strong national paid leave program and supporting the #FAMLYAct. https://t.co/lxQFwzyGi3"][".@SenAngusKing, I look forward to working with you to get paid leave to every American worker! Thank you for supporting the #FAMILYAct. https://t.co/yb5vYr9DNP"]["We must continue to demand that women have the freedom to make decisions about their own health care, their own lives."]["Democracy works when people like you stand up and demand the changes you want to see."]["Thank you for your leadership, Simone. A well-deserved honor and achievement. Go Army! https://t.co/gon3luee93"]["Almost half of all food stamp recipients are children. It is unconscionable that the President wants to cut food stamps in his budget."]["If you’re in NYC and care about clean water, make yourself heard at the EPA’s meeting on Hudson River cleanup. https://t.co/7RW8DcgDMV"]["We're here to listen, to help people, to do good by those we serve. That's what matters. I'll work at it every single day."]["We should never go back to the days when insurance companies could make women pay more for health insurance because of their gender."]["This country is big enough and strong enough to welcome those who are in need and at-risk with open arms."]["My bill to help level the playing field for women-owned small businesses is up for a vote in the Senate. https://t.co/8tatue7Ok6"]["American workers cannot wait any longer for the family-friendly policies they deserve. It’s time to pass universal paid family leave #FMLA24"]["The Family Leave and Medical Act was enacted on this day 24 years ago. Today, we honor its promise of a family-friendly America. #FMLA24"]["A new study suggests the need to curb over-prescription of opioids—exactly what my bill with @SenJohnMcCain would do https://t.co/mqGDDMsa7z"]["Yes. https://t.co/Q9bibZhH1M"]["Diversity makes us stronger. It's wrong for Sessions and @TheJusticeDept to try to diminish this @SCOTUS decision on affirmative action. https://t.co/hQO0Po13Qr"]["We do not have to make compromises on protecting women’s health to win back the House or Senate."]["A big challenge to tackle as we try to fix our health care system: Insurance companies putting profits over people."]["You've got this, @AmyMcGrathKY. Honored to support your race. https://t.co/QKaVxJgVPa"]["Great to speak with residents in Queens with @RepGraceMeng and @MelindaKatz. Thank you to all who came out yesterday! https://t.co/eOZfV78szI"]["With so many issues on the line—health care, the economy, women’s health—I won’t focus on staff disputes. That’s not what I’m here for."]["How can we claim to care about motherhood when we deny mothers the health care they desperately need? https://t.co/LDoXCl5Q5f"]["We can work together to solve problems in our health care system and forge a path for those who still need affordable care. It's possible."]["At 63¢ to the dollar, black women face a more severe wage gap than women overall. That affects everyone. #BlackWomensEqualPay"]["As we fight to close the wage gap, we must keep talking about how it impacts women of color. https://t.co/tbxrTRFyUS #BlackWomensEqualPay"]["Trump’s cruel, discriminatory military transgender ban:\n- insults our troops\n- harms our national defense\n- weakens our military"]["Imagine if half of Congress was women. If half of all mayors and governors were women. Imagine what could get done."]["ICYMI: ​I’m taking steps to fight back against @POTUS’s damaging military transgender ban. Are you with me? https://t.co/akfgMnCfkB"]["The health care vote this week demonstrated the importance of every single voice. \n\nYour voice matters, never forget that."]["It bears repeating: I will always stand with Planned Parenthood. \nhttps://t.co/wG1PnDdnQ9"]["My colleagues and I are urging Secretary Mattis not to carry out the President’s ban on transgender service members. https://t.co/5ZQ9saTpeH"]["Never forget that your voice matters, that you can change outcomes when you demand action. Keep fighting for the health care you deserve."]["I’m ready to get to work to improve Obamacare and build a health care system that will benefit all Americans."]["Millions have a stake in what happens next in this health care fight. Our neighbors, mothers, fathers, friends, children, grandchildren."]["I’m glad that we can breathe a small sigh of relief about this terrible Skinny Repeal bill, but this is certainly not the end of the fight."]["It’s unconscionable that Republicans are rushing a vote on this terrible #SkinnyRepeal bill."]["As someone born and raised in ‘upper New York,’ I can tell you that these comments are ignorant. https://t.co/OxsA5ByJ5V"]["I want all transgender service members to know that their fight is our fight. Read more: https://t.co/ECifEAluJG"]["“The Finger Lakes region is a jewel worthy of national attention.” I agree. \nhttps://t.co/F9AWdNslQv"]["This health care bill is toxic. \nIt is horrible. It will harm millions.\nWill you fight back?\nhttps://t.co/uwBF8aGXpU"]["Mark my words: We will not let Congress roll back access to reproductive health care for women and men across the country. https://t.co/tWVgNwhuGl"]["Maggie, thanks for speaking out on behalf of those who rely on Medicaid. I'll keep fighting for you and for Jake. https://t.co/hi2J4ELNkI"]["Health care should be a right.\nIt should not be a privilege."]["This new decision is harmful and misguided. It weakens—not strengthens—our military. And I’ll do everything in my power to fight it."]["...only to be told (on Twitter, no less) that their Commander in Chief doesn't want them in any capacity—it's outrageous!"]["This is beyond insulting to the brave and honorable service of transgender service members willing to die for this country. https://t.co/xYSlLAANyw"]["I can promise you that I'll raise my voice against any bill that makes it harder for women to access the health care they need."]["Please, keep speaking out. Demand better than a back-room deal that harms those who work so hard to provide for their families."]["I am hard-pressed to remember a vote in the U.S. Senate that has treated the American people with less respect. https://t.co/e3qIG8iAUo"]["I hope you're making those calls, sharing those articles, letting everyone you know about what's at stake for today's health care vote."]["Millions voted to legalize medical marijuana in several states. Now, the DOJ is looking to undermine their will. https://t.co/N8MGIXouXa"]["Whatever issue speaks to you, make your voice heard. I’ll always stand with survivors of sexual assault. https://t.co/IGm2Rtg7rb"]["I introduced legislation with @SenJohnMcCain to go after a root cause of the opioid epidemic: over-prescription. \nhttps://t.co/41qvdgHCfR"]["Our fundamental goal around health care should be to ensure everyone can afford coverage as a matter of right, not as a matter of privilege."]["@ELF1010leeray @getots Great to meet you yesterday!"]["@INDVSBLHarlem That's right, keep speaking out and doing the great work you've been doing! A pleasure to have you yesterday."]["@indivisible_bk Thank you for coming!"]["Ran into @JoeBiden and @MariaTeresa1 at Ozy Fest in Central Park. Great event, great discussion! https://t.co/JHr7MCkcK7"]["Candice Jackson’s remarks about campus sexual assault cases are unworthy of her role at the Department of Ed. She should step down. https://t.co/zvJBCwo1fz"]["I voted against John Bush’s nomination to the 6th Circuit Court of Appeals today."]["Changing open internet rules threatens our freedom of speech. It’s more important than ever to stand up and protect #NetNeutrality."]["Young people who have lived in America their whole lives and play by the rules should always be welcome here. We must #DefendDACA."]["Proud of my team's work to help bring an important play on the Syrian conflict to @LincolnCenter this week. https://t.co/kRhx8hzgau"]["Awful news. Praying for @SenJohnMcCain and his family tonight. Sending heartfelt wishes for a full recovery. https://t.co/GFVrWnx9jI"]["Confirms what we already know: Repealing Obamacare with no plan to replace it—and leaving millions uninsured—is a horrific idea. https://t.co/dzBdO1gDEx"]["This so-called election commission is a sham that would do nothing but threaten voting rights.\nhttps://t.co/4hP6YvzE0S"]["Real change in our communities takes persistence and perseverance, and the will to never, ever give up. It starts with you."][".@SenatorHeitkamp and I discuss how we can end the motherhood penalty through paid family leave and affordable childcare. https://t.co/9AEC23iZom"]["It’s disappointing to hear that the President is more interested in the blame game than in trying to improve healthcare for all Americans."]["The President and Senate Republicans moving to repeal Obamacare with no plan to replace it is dangerous and irresponsible."]["A win on health care, for now. Your protests, calls, letters, tweets count for something. Stay focused, keep speaking up."]["We’re in public service to help people. If we’re not, we should get out. So #DearBetsy: Who are you serving? https://t.co/ySJ4CCquUq"]["#MondayMotivation: Today, let’s do all that we can to own this democracy and fight for what’s right ."]["I’m very grateful for all who came out to our town hall in Syracuse. Thanks for speaking out! https://t.co/4aQ0faUC4p"]["Meet Maple, the newest member of the Gillibrand family! https://t.co/mCpVz8sGsb"]["Wishing @SenJohnMcCain a speedy recovery. Glad to hear all is well! https://t.co/AOpa0yPpf7"]["A #paidleave policy that doesn’t cover all workers is woefully inadequate in my opinion. https://t.co/nOGeXtLrmN"]["What a great throwback! https://t.co/qaTxRJoduU"]["Saddened by the death of Nobel Peace laureate Liu Xiaobo. It's disgraceful that China did this to someone just for speaking his mind."]["I'm counting on you to keep speaking out on health care. Truly, your voice matters. Here's how you can: https://t.co/yKFyMjnV4f"]["You've spoken out overwhelmingly against this awful bill—so I'm going to do everything in my power to keep it from becoming law."]["The Republican health care bill needed a wholesale overhaul. This new proposal continues to turn its back on the most vulnerable. https://t.co/hZrJgGn5tW"]["I can’t wait to head to Syracuse tomorrow. Hope you’ll join us if you’re in the area!\nhttps://t.co/SH7Cqms9YS"]["#DearBetsy: I ask you to listen to these survivors—and understand just why we’re in this fight. https://t.co/KqZOxHxoSG"]["Let’s not sugarcoat it: Republicans are working to kick 22 million people off of health coverage, all so that the rich can get a tax cut."]["Saddened to hear of this incident that took two lives, including NYS Trooper Davis. Praying for their families. https://t.co/5dr49Fozkg"]["Praying for the loved ones of all lost in the military plane accident in MS. Heartbreaking to hear the plane was based at Stewart ANGB."]["Officer Familia brings new meaning to being one of New York’s Finest. May she rest in peace. God bless her and her loved ones. https://t.co/x3HSnRSZcB"]["An ingenious project! Great to see New Yorkers spreading awareness about food access in their communities. https://t.co/BVScfFjyRa"]["It's time for some of my GOP colleagues to recognize that @PPFA helps millions of women in this country—and end their attempts to cut it."]["This week, I worked with @RepTomSuozzi to ensure Title IX protections for U.S. Merchant Marine Academy students. https://t.co/WMn9CDwLe8"]["Donna, thank you for sharing your experiences. This is a must read. https://t.co/RsWvwc96u7"]["Today, I got to celebrate the 200th birthday of the Erie Canal—by officially making it a National Historic Landmark! https://t.co/JBaWQ6qtbk"]["The question remains: How do we support our communities while providing a safety net for those who work hard but still need help getting by?"]["Budgets reflect priorities. Taking food away from children, seniors, and struggling families shouldn’t be the federal government's priority."]["44 million Americans (3 million NYers) in every kind of community—urban, rural, small town—need SNAP to survive. https://t.co/SXHZfFjDkO"]["While it shouldn’t take government assistance for a working parent to buy dinner for their family, it happens more often than we think."]["It’s disturbing to see that the President wants to cut SNAP funding, federal food assistance, by billions of dollars"]["No matter where you live, or what you believe, I think we can all agree that access to healthy food shouldn't be a partisan issue."]["I have so much hope in the women who are stepping up to own our democracy. Thanks for this reminder, @gailcollins. https://t.co/f7U1nHzve5"]["We have so much to learn from the unbelievable dedication and wherewithal of the women who came before us. https://t.co/BD1lMdZCGM"]["Hi @Malala! Hope everyone here will follow such an important and powerful voice. https://t.co/GRoNR6mH4V"][".@clairecmc and I called on Betsy DeVos to reverse a decision that could set back investigations into sexual assault on college campuses https://t.co/jCwlaIFKba"]["Slow but sure victories for policies that help our families. It’s up to us to pass them nationwide. https://t.co/ju8ncSkEVL"]["This health care fight isn’t over. Just because the GOP doesn’t have the votes today doesn’t mean that they won’t have them next week."]["Congrats to Washington State for becoming the 5th state to pass #paidleave—and hopefully becoming an example for the nation. https://t.co/MycFbzCO9m"]["No parent should be forced to make this choice. I’m fighting to change this terrible rule. https://t.co/iQ5afkn8Ri"]["Officer Familia was a true hero and brings new meaning to being New York's Finest. We cannot tolerate this kind of hate and violence."]["NYPD Officer Miosotis Familia's name translates to “forget me not.\" Please read this piece in her memory https://t.co/HpHlQtf7bJ"]["Each dollar from @NYDailyNews's fund will go directly to her kids. Let's stand together to protect those who protect us—and their families"]["Please join me in making a contribution to support the three children of murdered NYPD officer Miosotis Familia. https://t.co/gXBR6FBJnh"]["Horrible news from the Bronx this morning. My prayers are with the family of Officer Miosotis Familia and the rest of the NYPD. https://t.co/iFLZ8kxmNu"]["Had a great time today at the Lake Placid #FourthofJuly parade! https://t.co/2SKOyEauxW"]["In the best place to celebrate America's birthday—Lake Placid up in the North Country! Happy #FourthOfJuly to all. https://t.co/sP2wF9UG3k"]["Ramming a health care bill through the Senate without public input or a single public hearing is the height of irresponsibility."]["Over a million people in New York rely on LIHEAP. A cruel move by the Trump Administration. https://t.co/ZUvfz2A7rx"]["The Republican health care bill puts the 58 @PPFA centers in my state at risk. Know someone who relies on Planned Parenthood? Tell them."]["Millions of women could lose maternity care coverage under the Republican health care bill! Think about that for a second."]["Families need #paidleave throughout their lives—if a plan only serves new parents, it would leave far too many behind."]["The campaign for a woman’s suffrage referendum in New York State began on this day in 1913, with a great wagon called The Spirit of 1776! https://t.co/Evuq0najDC"]["The Senate is careening toward voting for the worst bill for women’s health in a generation. Speak out."]["ICYMI: We made ourselves heard on the Senate steps this week. An honor to be part of the moment. https://t.co/a9qarwYZOH"]["We refuse to be a country of hate and fear.\nThis is not who we are.\nKeep telling your stories. You'll be heard.\n \n#NoMuslimBanEver"]["I'm grateful and extremely proud of the work of all of our first responders. https://t.co/e6QHtBBim8"]["There's no credible reason to weaken rules that keep all our flights safe. We owe it to the families of Flight 3407. https://t.co/8kzCnEFVD6"]["I opposed this nomination. The CTFC must enact strong rules, oversight, &amp; enforcement to protect Main St &amp; taxpayers https://t.co/V3hoRz5BmQ"]["Here's a good way to spread the word: Tell someone you know (who might not yet know) how they could be affected by the GOP health care bill."]["What democracy looks like: Tens of thousands of New Yorkers speaking out to protect the Hudson River. https://t.co/QkYPWkfY0y"]["Don't believe the cynics. You have the power to change outcomes—get out there and prove them wrong."]["My colleagues and I wrote to @BetsyDeVos with concerns over the Department of Ed's handling of civil rights cases. https://t.co/Tl6basb7jE"]["Since our President clearly has a problem with women, let's send more to Congress. Women of America, you need to run! RT if you agree."]["This is not okay, Mr. President. https://t.co/O9HORCzocV"]["The Senate GOP's health care bill is an insult to the millions of families already struggling to pay for care. We will not accept it."]["Keep calling. https://t.co/2IINQcbpPn"]["I’ve said it before, and I’ll say it again: funding for Planned Parenthood is not negotiable. Too many lives would be negatively impacted."]["Introduced a bill to give military families support and flexibility when looking for quality, affordable childcare https://t.co/RoAWuD3BEO"]["A plan that leaves 22 million uninsured. And it could pass this week. This is not a drill. We must keep fighting back. Are you with me? https://t.co/pdQuB8NItH"]["There wasn’t a single woman in the room when Senate Republicans wrote their health care bill—of course the bill is awful for women's health."]["Jam the phone lines. March. Raise your voice as loud as you can against this health care bill. Demand accountability."]["It’s unconscionable that coverage could be taken away from millions of people—all to save money for the richest among us."]["My best to all celebrating #NYCPride! A wonderful day to celebrate the LGBTQ community in NY, across the country, and around the world."]["We must protect funding for a program that gives healthy, nutritious food to our most vulnerable communities. https://t.co/DsxZ5BxKVA"]["This was great! \nhttps://t.co/QZntvvjaWN"]["If you thought the House bill was bad, the Senate bill is even worse. https://t.co/lc2p8nn1Vs"]["This health care bill will harm people. I'll do everything in my power to fight against it, but I need your help. https://t.co/zJejTUofrB"]["I could not think of a more out-of-touch or insulting proposal to working Americans already struggling with the high cost of health care."]["You have the power to demand accountability from your representatives. I hope you’ll use it. https://t.co/jyVfHsakHN"][".@CecileRichards knows what it means to help people, to speak out, to resist. A beautiful piece. https://t.co/qKcKRGFXgg"]["Caught it. #CWSG https://t.co/7FOQ27k7Vh"]["I wrote at @getOTS about the results in Georgia and coming #OffTheSidelines to win in 2018. Read and follow to join the movement: https://t.co/Br2w4qEjCN"]["I'm ready to play ball tonight! #CWSG https://t.co/a0E8KXpX0e"]["How we make change: Compete in all 50 states. Run in tough campaigns. Fight back and raise our voices on everything we care deeply about. https://t.co/ruVw3sr8Qd"]["In the meantime, don’t lose focus and keep your eyes on the battle ahead: stopping the Republicans’ disastrous health care plan."]["It’s up to Democrats to show up in all 50 states, and I’ll be doing my part to support women candidates through my #offthesidelines program"]["We cannot let losses like last night’s special election discourage us. It’s important to keep going, keep fighting."]["The public deserves full transparency around this health care bill. When millions could be affected, there are no excuses. #ShowUsTheBill"]["@SherrodBrown Our bill will punish companies that price gouge and reinvest their fines in NIH research. This is commonsense, and long overdue."]["Will I see you at the Congressional Women’s Softball Game on Wednesday? I’ll be swinging for the fences! https://t.co/bBLMGGLn0f"]["A reprehensible way to treat a man who put his health on the line for us after 9/11. This is absolutely not okay. https://t.co/XndWIZSNRM"]["With the coverage of millions of Americans on the line in this health care fight, the lack of transparency from Republicans is disturbing."]["No one should ever be penalized for getting sick, for being a woman, for being born with a rare condition. This could happen under Trumpcare"]["We celebrate emancipation on this #Juneteenth, recognize the work left to do, and continue our commitment to a more equal future for all."]["Troop increases absent strategy are a mistake. Congress must demand accountability and a plan from the President."]["The President should never outsource his responsibilities as Commander in Chief. https://t.co/JBnyYesm2i"]["To every woman who dares to make her voice heard: I’m with you. \nhttps://t.co/XQbNhJKwk1"]["Happy #FathersDay. Let’s celebrate all that dads give to our families &amp; keep up the fight for policies that’ll help, like the #FAMILYAct!"]["The @FCC is dangerously close to clawing back open internet rules and making a terrible decision for the future of innovation. Speak out."]["We'll see about that. https://t.co/hnuiead5Fo"]["Military leaders must take cases like Marines United seriously—leniency on those accused of online misconduct will not change behavior. https://t.co/dNrzs2Cg5p"]["If you’re around, hope you can make it to @CWSoftballGame next week! https://t.co/Y7qpN9DoLZ"]["13 men writing the Senate’s health care bill behind closed doors, with no accountability to the American people. It's a recipe for disaster."]["High fives for @JoeCrowleyNY—making all New Yorkers proud tonight! https://t.co/QjgE5X6RNM"]["Here to support my colleagues at the Congressional Baseball Game, as we put aside politics and honor the bravery of our first responders. https://t.co/FjvHwN2oSG"]["Studies suggest that marijuana can alleviate many serious symptoms—we owe it to our families to be able to do more scientific research."]["Today, we reintroduced the bipartisan CARERS Act to finally modernize our laws around medical marijuana."]["A reminder: Russia news is very important, but don't let it distract you from the secret health care bill that'll kick millions off coverage"]["Beautiful, important words from my friend Gabby. https://t.co/Du6GRenTds"]["Praying for Rep Scalise, the staff, members and Capitol Hill police at the horrific scene this morning. Bless the police for their bravery."]["The time has come for #paidleave—and I'm glad we are finally debating it. But parents-only plans leave far too many people behind. https://t.co/1rDPDBeqXF"]["While people watched the Sessions hearing, Senate Republicans worked behind closed doors to pass a disastrous secret health care bill."]["AG's refusal to answer oversight questions without executive privilege invoked at today's hearing is outrageous. Americans deserve answers."][".@HouseGOP has voted to take us back to the reckless rules and regulations that resulted in financial collapse. https://t.co/ClLEJveCYP"]["A great bit from #TonyAwards2017: Kevin Kline talks about the importance of @NEAarts and @NEHgov to our communities. https://t.co/SCQrccyaUr"]["One year after the horrific Pulse shooting, let's recommit to doing our part to ensure the equality and well being of our LGBTQ community."]["The courts are speaking loud and clear on Trump’s unconstitutional travel ban. It's not what our country stands for https://t.co/6tLSSlqww5"]["Someone you should know: @katieporteroc, who’s getting #offthesidelines and running for congress in CA. https://t.co/8qJQjsosVJ"]["The recent rise in anti-semitism at home and abroad has been alarming. It’s vital to keep up and prioritize the fight against it. https://t.co/dC5CNTf1rZ"]["Thanks so much for having me! Really enjoyed our chat. https://t.co/wZbo3jlAyt"]["Great to speak at #PDF17 about the ways we can keep fighting and resisting. (But might need to put some cash in the swear jar tonight!) https://t.co/SlIBVpagQ7"]["Looking forward to it! https://t.co/4p84OKa5FK"]["If they were actually doing good work to help people, it wouldn’t need to be hidden from public view. Speak out, demand transparency."]["Senate Republicans are writing a bill to kick millions of people off of health insurance behind closed doors, with no public hearings."]["We must get to the truth, because nobody, including the President, is above the law."]["That Comey took the President’s comments regarding the Flynn investigation ‘as a direction’ is alarming."]["It was also stunning to hear that Comey began writing memos after his first meeting with Trump due to concerns that Trump may lie about it."]["It was stunning to hear James Comey testify under oath that President Trump ‘defamed’ him and the FBI, and that Trump told lies about him."]["The pattern of behavior laid out in Comey's prepared testimony is extremely disturbing. Important for him to provide more context today."]["If the Trump Administration lets bosses make birth control decisions for their employees, it could be devastating for women. https://t.co/4VwIr790Dm"]["Detained immigrants are not receiving the proper medical care that they need. It has to stop. https://t.co/UONP0DH9ll"]["Troubling stats on racial disparities in our military justice system. If we're going to fix this, we must #passMJIA https://t.co/PbqASYvuJx"]["It's clear that we must expand research into #medicalmarijuana. @CoryBooker, @RandPaul and I plan to re-intro a bill for that."]["The NE Journal study on cannabidiol and its effects on Dravet Syndrome is a big deal in our fight to help people. https://t.co/FJcZKbN42q"]["For a better, more productive workforce, policies must start reflecting the realities facing working families. https://t.co/evLkgkktY8"]["@JessicaScott09 We’re all stronger than we think we are. #WonderWoman"]["@JessTroe She is such an inspiration!"]["@Caley_89 Yes! We should all dream big and see ourselves in our role models."]["Harriet Tubman deserves every bit of recognition for her contributions to history.  https://t.co/bcRBKz3OmA"]["Interesting video about how the bicycle played a small role in the women’s movement. \nhttps://t.co/IHlCp2691H"]["Last week, my legislation to help families of first responders get needed survivor benefits was signed into law. Read more about it below. https://t.co/gH3xaLXm1s"]["The scene where she fearlessly led soldiers into battle by taking the oncoming fire with her shield took my breath away!"]["If you saw #WonderWoman this past weekend, what was your favorite scene?"]["I love that the new #WonderWoman movie is inspiring girls everywhere to be fearless and fight for justice. \nhttps://t.co/0N1VdlroQa"]["Horrific, saddening news out of London—my heart is with the victims of these senseless attacks."]["Trump’s budget isn't just numbers or charts on a page. It's a proposal to cheat our communities and the most vulnerable among us."]["Birth control is part of basic, preventive care for women. It’s wrong to roll back access. It’s wrong to make women pay more for it."]["Tune in if you want to know more! A wonderful chat with the ladies of @TheRivetersPod. https://t.co/7tkb07AmnY"]["@BethBehrs Beth, it was so lovely to meet you too. Thanks for everything you're doing—keep speaking out on the issues you care about! We need you!"]["New Yorkers will lead on climate and take up the mantle where this administration chooses to fail. It's up to us. https://t.co/Vc6OArCixa"]["As this administration tries to roll back women’s access to contraception, raise your voice and exercise your right to use it. https://t.co/lZ3ANevuxE"]["I shudder to think of what future generations will have to deal with as a consequence of this shortsighted, dangerous decision. https://t.co/zKmqMYeCA3"]["I'm seeing the Wonder Woman movie this summer. Want to join? Be automatically entered to see it with me: https://t.co/uKWmJV83XH https://t.co/2wok0petJL"]["Clean air and water shouldn't be up for debate for New York’s families. This decision is awful news for the Capital Region and Hudson Valley https://t.co/Nrrg9b8qWB"]["Right. That's why @CoryBooker, @RandPaul and I wrote a bill to try to expand research opportunities for medical marijuana. https://t.co/7UcUGW3aeu"]["Disturbing that child marriage still happens in this country. I plan to introduce a bill to end this. https://t.co/S3M5Slg1n3"]["If you care about our health, our security, and our economy, raise your voice. Speak out against this. #ParisAgreement"]["Climate change is real. The question is settled. It'd be catastrophic for the President to cede our leadership on this issue #ParisAgreement"]["Withdrawing from the #ParisAgreement would be a complete disaster for our future, an absolute failure of leadership and vision. https://t.co/J3Oocf8g1P"]["Maybe running for office isn’t for you. Here are some other things you can do to make an impact. https://t.co/lFNpiSAUVN"]["A woman's boss shouldn't get to decide if she access to birth control. It's wrong—we'll fight back as hard as we can https://t.co/ksMi9CemPj"]["\"I wanted to make history...pave the way, if not for me, then for others.\" https://t.co/CtTRFQILVq"]["On this Memorial Day, we honor and remember the heroes who sacrificed their lives to protect our freedoms. Grateful to all who've served."]["Taking back the House starts with strong candidates like @HoulahanForPa. I’m all in to support her—hope you can too. https://t.co/ox5OXf0RaQ"]["\"We hold these truths to be self evident that all men—and women—are created equal.\" https://t.co/4G7MA6xxTk https://t.co/tQeMX0b2Md"]["Year after year, we shortchange our economy by not giving our workers the time and flexibility to care for their loved ones."]["My bill with @SenJoniErnst would ensure our recruits get the training needed to thwart military sexual assault. https://t.co/mZqrA1jMRF https://t.co/xPzQOSmd1p"]["A victory. This travel ban is wrong and flies against the face of everything we value as a country. https://t.co/l6WX8whHp9"]["Our rules around medical marijuana should respect scientific research and respect our families. It’s common sense. https://t.co/ReSV4yzuFr"]["Our workers are long overdue for a raise—today, proud to co-sponsor @BernieSanders &amp; @PattyMurray's bill to #RaisetheWage to $15 by 2024."]["A very happy birthday to one of New York City’s most beautiful landmarks.\nhttps://t.co/pjHFStKRDx"]["If the AHCA becomes law, up to 23 million Americans could lose their insurance. Think about that for a second. \n\nIt's unacceptable."]["I think this further confirms just how terrible the AHCA is. \nhttps://t.co/wu2TRyh98j"]["Cuts to food stamps in Trump’s budget would be devastating. Millions across the country—in small towns, cities—need them to make ends meet."]["How? We’ll  do the work, speak out, and keep fighting for what we’ve always fought for. https://t.co/X3vw94EH4b"]["This Administration continues to propose newer and crueler ways to make women’s lives harder. https://t.co/etigmk08N1"]["How can you care so little for the most vulnerable among us to propose deep cuts to our food stamp program?"]["This budget is truly immoral and heartless. https://t.co/MFNkBbWrnn"]["My heart goes out to the victims. We must do everything we can to protect America and our allies. https://t.co/jPUTZNP4aT"]["Was a pleasure to talk with @DavidAxelrod. Listen to our conversation here. https://t.co/F8sH6Wx1AI"]["ICYMI: Paid leave is not just a women’s issue. It’s a middle-class economic issue. See my speech at @AmProg: https://t.co/vVIxyo9YBs"]["When it comes to our health care, it’s personal. So pick up the phones, go to town halls, march. Tell your stories."]["This is shameful. As elected leaders, we should be trying to help people. This only harms Americans. https://t.co/u5C9ODG2vF"]["Making calls? \nAt town halls?\nMarching? \nRunning?\n\nTell me: How are you getting #offthesidelines? https://t.co/yjvnWH7Vkd"]["Disgraceful. https://t.co/nirk2Ury1Y"]["Running for office can be tough. My advice? Think of someone who fought long and hard for something that mattered to them. https://t.co/JLiR1YmtW1"]["I just published “No more excuses: America needs a real national paid family and medical leave plan now!” https://t.co/3ZWaPTkCmP"]["This only happened because regular people raised their voices. Advocacy matters."]["Important step in the right direction. We need to get to the bottom of this mess. https://t.co/T3tVFlhIhd"]["It's an honor to be fighting the fight against hunger with you, @newyorkhunger."]["Huge concerns. We need an independent special prosecutor NOW. https://t.co/QL4zu7SVQq"]["Starting a campaign? You’ll need people in your corner. Don’t be afraid to ask for help. https://t.co/xioWbf0Sy6"]["My commonsense bill, the FAMILY Act, is a REAL paid leave program. So let’s pass it. The time for excuses is over. https://t.co/iuBSKYMY3A"]["We must not stop until we have full transparency &amp; accountability. That means not voting on FBI Director until Special Prosecutor is named."]["This President is creating chaos that doesn’t create a single job or make us safer."]["Last night’s report has taken us to a whole new level of abnormal. This is not business as usual."]["Income inequality is a drag on the economy. That’s why we need:\n\n—Paid leave\n—A $15 minimum wage\n—Equal pay"]["Let me be clear: Affordable, preventive care for women is non-negotiable."]["Know who would suffer the most under the House Republicans’ disastrous health bill? Women. Older Americans. Low income Americans."]["When we can support our working moms, we can lift up every family. A great reminder on this Mother’s Day. \nhttps://t.co/Bi3DgiULRw"]["The Senate GOP’s health care bill is being written by 13 men! That’s shocking, even for Washington."]["Here’s how you can demand support for an independent investigation into the Trump campaign and Russia. https://t.co/yRzUujr5Ev"]["If you plan on running, your reason, your passion, your fire in the belly can make all the difference. https://t.co/Fo1bJU8jOQ"]["I’m working to help preserve and breathe new life into New York State’s manufacturing sectors. https://t.co/kK8h2oYBIv"]["This is alarming. We need accountability and transparency on college campuses. We need to pass CASA. https://t.co/X5rFjNpRst"]["Deeply disturbing that the Trump administration is investigating the Haitian community with a broad brush. https://t.co/gigmBszY9z"]["Americans want a national paid leave program—and I’m willing to work with anyone for us to get there. https://t.co/FlJ3wnggMF"]["I voted against Rod Rosenstein's nomination for his refusal to commit to an independent special prosecutor on Day 1."]["The Senate shouldn't consider a new FBI Director until an independent special prosecutor is appointed to probe the Trump campaign &amp; Russia."]["The @HouseGOP health bill is an atrocious piece of legislation. My thoughts on how we can actually help people: https://t.co/IUOf644PKy"]["Just think of the communities that would be affected.  \nhttps://t.co/PuguS9fFDT"]["Because we want real solutions. https://t.co/B1KKKsJSid"]["Americans deserve to know the truth. It’s time to raise your voice. https://t.co/pXNzgZYcQK"]["Trump is throwing our democracy into chaos by trying to shut down an investigation."]["AG Sessions lied under oath about meetings with Kislyak. One way to exert control after recusal is by getting rid of FBI Director. Chilling."]["No more excuses: We need an independent special prosecutor to investigate the Trump Administration’s ties to Russia."]["Something to agree on: Women-owned small businesses should be able compete on a level playing field in this economy. https://t.co/aDuogiVsSU"]["Pruitt moving to dismiss scientists at the EPA. Absolutely frightening.\nhttps://t.co/qEtudal1Ae"]["My view: When women’s voices are at the table, it makes a difference—especially when it comes to health care. https://t.co/AqreZwlmpn"]["Under #Trumpcare, thousands of families in New York will suffer. We will not let it pass."]["We can make the ACA work better with a not-for-profit public option that\n✓Lowers premiums\n✓Lowers RX drug costs\n✓Lowers out of pocket costs"]["Amen. You’re an inspiration to women everywhere, @ShondaRhimes.\nhttps://t.co/vY6DCTb5qq"]["The House GOP voted to make it possible for insurance companies to charge you more for coverage just because you’re a woman. It’s not okay."]["ICYMI: This week, House Republicans made it okay for employers to cheat workers out of overtime pay. \nhttps://t.co/DuDGb1542g"]["We sure will. https://t.co/5b3N3uyw0O"]["Mark Green's extreme positions disqualified him from his nomination in the first place. https://t.co/ERRI2NMxAe"]["With the health care of millions of Americans on the line, we have to speak out as forcefully as we can. https://t.co/ItkfJT7KkD"]["Thinking about stepping up and running for office? I'm here to help. Here's my first piece of advice. https://t.co/ujjysK2opt"]["Instead of the passing the horrific House GOP health bill, we should actually help people—or go home. https://t.co/1NirFqLZci"]["RT if you’re ready to raise the national minimum wage to $15. #RaisetheWage"]["By letting bosses deny critical preventative care in the name of religious freedom, @POTUS's Executive Order is an attack on women's health."]["A win for New York City and a concrete step toward ending the cycle of pay inequality. Thanks for your hard work on this, @TishJames. https://t.co/JeubFvIsqw"]["Keep government out of religion and religion out of government. \nhttps://t.co/gChLw2jIjS"]["I'll fight back as hard as I can to defeat this bill—a misguided and purely political effort that will hurt New York families."]["Through higher premiums, less coverage, and millions losing their insurance, Americans lose out with the #AHCA."]["Health care shouldn’t be about politics—it's about people. The American Health Care Act would harm people."]["The bill to replace Obamacare that passed today in the House is atrocious and must be defeated in the Senate."]["House Republicans will be voting today on their dangerous health care plan. Raise your voice and fight back: https://t.co/WcPnTDA5nF"]["We need to make smart investments in building the middle class, and in building an economy that rewards work."]["When woman with two children can work a full time, minimum wage job and still live below the poverty line, it’s not right. #RaisetheWage"]["A federal program for family planning shouldn't be run by a person who doesn’t believe that contraception works. https://t.co/TuBvSJiXxu"]["Powerful. Thank you for raising your voice on healthcare, @JimmyKimmel. \nhttps://t.co/BgJXz1ppXh"]["No person who works 40 hours a week should still live below the poverty line. It’s time to raise the national minimum wage to $15."]["We need to pass the Military Justice Improvement Act, so our men &amp; women in uniform have a military justice system worthy of their service."]["We need a military justice system that allows independent military prosecutors to go after sexual predators who harm our military readiness."]["This report doesn't reflect having the good order and discipline that's essential for our military. Congress must take it as a wake-up call."]["The DoD's report shows: \n—a flat overall reporting rate \n—an unacceptable retaliation rate against survivors\n—less accountability"]["While the DoD touts progress, the truth is that the scourge of sexual assault in the military remains status quo. https://t.co/u5tYhVRAkh"]["Parents across the world share their parental leave stories, and demonstrate why we need #paidleave in this country: https://t.co/Nexf2tzqkL"]["Local, small businesses are indispensable to our economy in New York and across the country. Happy #SmallBusinessWeek! https://t.co/OKm5prD4G9"]["Publicly shaming a child over a school lunch is a cruel practice that has to stop. https://t.co/tZjyIe9la4"]["Working families, immigrants, and refugees strengthen our communities. Today, we #RiseUp to celebrate their contributions."]["I am working on a bipartisan bill to reform flood insurance and make it more affordable for New Yorkers. https://t.co/UiTmO9kdto"]