["TWO MILLION Americans (and counting) will receive bonuses thanks to the #TaxCutsandJobsAct. See the list here: https://t.co/Hs1900HWWf"]["Thank you, @POTUS, for your continued efforts to protect our country."]["The American people and their representatives in Congress require a full assessment of Hezbollah’s criminal enterprises. With @realDonaldTrump in charge, they may finally get the answers they deserve."]["The #Iran-backed #Hezbollah uses its criminal network to fund ongoing efforts that undermine U.S. interests. Obama officials blocked efforts to take the terrorist group down."]["In a desperate attempt to secure the #IranDeal, President Obama’s senior officials rejected repeated requests to investigate, prosecute, arrest, sanction, and seek extradition of #Hezbollah operatives. @politico has the full story here: https://t.co/zXykVh2DAQ"][".@realDonaldTrump and @TheJusticeDept’s tough approach to #Hezbollah stands in direct contrast to the Obama administration’s soft treatment of the billion-dollar global criminal enterprise."]["In December, I sent a letter to @realDonaldTrump asking him to instruct @TheJusticeDept to crack down on #Hezbollah as part of his important work to counter the dangerous influence of #Iran. My letter: https://t.co/HUlCKk0IPj https://t.co/ZDYdexdiUx"]["The @TheJusticeDept has responded to my call to take on #Hezbollah and its drug and weapons trafficking empire. An aggressive, multi-agency investigation of this Iran-backed terrorist group is sorely needed. Read the full story in @politico here: https://t.co/tFCMH7xuEy https://t.co/SQsPm2UhcT"]["Thank you, @EPAScottPruitt, for working to address severe chemical pollution at a former manufacturing facility in Grenada. An @EPA Superfund designation would free up long-term federal support to keep residents safe. @WABGTV6 https://t.co/NMDlqoE05M"][".@SecretarySonny has chosen 5 Mississippians to serve on our state @usdafsa committee. @SenThadCochran &amp; I are confident they will be strong advocates for our agricultural producers &amp; workers. https://t.co/x8uHb7djSb"]["The Senate passed my bill to reauthorize @usioosgov. Looking forward to the continued success of this program and its benefit to our vibrant maritime economy! #IOOS https://t.co/SpFVZ5qAwW"]["Each and every day, America’s law enforcement officers put their lives on the line to protect and serve. Join me in thanking them for their service! #LawEnforcementAppreciationDay https://t.co/Dpm8nQSzac"]["The @USArmy has invested millions in developing the capabilities of its U.S.-based Apache missions. I’m glad our troops can continue that training here in Tupelo. https://t.co/Z7XkqBfwf8 @155ABCT\n@nationalguardms"]["The @USArmy is right to keep the Apache helicopters in the hands of our talented Army @NationalGuard in Tupelo. @155ABCT https://t.co/ghRbuSLJjS"]["This country is at its best when those living in rural America are given the opportunity to succeed. Thank you, @realDonaldTrump, for fighting for rural Americans! https://t.co/RqptjUDEab @POTUS #AFBF18"]["Wonderful news for Mississippi’s churches from @fema. Houses of worship can now apply retroactively for disaster aid funding &amp; will be on equal footing with other nonprofits. Looking forward to making this change permanent soon! https://t.co/qFFA14iOXB"]["WATCH ▶ Churches and houses of worship are now eligible for disaster aid funding. Great news for Mississippi’s congregations, who are a critical part of disaster response and rebuilding efforts.  https://t.co/glh3xoaGQi @WLOX"]["#TaxCutsAndJobsAct: https://t.co/DsgA6VvlXc"]["Looking forward to working with @RoyBlunt and others to pass a permanent disaster aid provision for America’s religious centers. Great first step from @fema this week. READ MORE ➡ https://t.co/kI4ocPRjrN"]["Congressman @GreggHarper has been an excellent legislator and great public servant. I am glad to count him among my good friends and wish him all the best. My full statement. ⬇ https://t.co/DhyOtcy0wF https://t.co/E9xHGCWKtH"]["I’m pleased @usairforce awarded a $48M contract to @AuroraFlightSci to develop the next generation of ultra-long endurance military drones in @VisitColumbusMS. https://t.co/JAV93FHleA @Boeing"][".@fema just made an important change to ensure houses of worship are eligible for disaster aid on the same terms as other nonprofits. Mississippians know how important churches are in supporting disaster response and rebuilding our communities. https://t.co/kI4ocPzIAf"]["Encouraged by this effort to help close the #DigitalDivide. Connecting more Mississippians to high-speed internet is essential to our state’s economic future. High hopes for this new partnership! @connectamnow https://t.co/isD42Q8DCM"]["@USUN @nikkihaley “In these first days of 2018, nowhere is the urgency of peace, security, and freedom being more tested than in Iran” – @USUN Ambassador @NikkiHaley #IranProtests"]["Powerful speech yesterday from @USUN Ambassador @NikkiHaley on the #IranProtests: “We must not be silent. The people of Iran are crying out for freedom. All freedom loving people must stand with their cause.” WATCH HERE ▶ https://t.co/q6UikFHU5T"]["\"America is coming back, and America is coming back strong.\" - @realDonaldTrump … Read how the @POTUS plan for national security is taking shape here: https://t.co/bFeXtgRKd7"]["Congress has an important oversight role as @FirstNetGov is being deployed. I am committed to ensuring that #FirstNet meets its obligations to #Mississippi and our emergency responders: https://t.co/MEBmo6TAlP"]["Just learned that my friend of 48 yrs, Joe Rutherford, has died. Most people in NE Ms have no idea the quiet impact Joe had for economic progress and responsible public policy over the decades. His writing didn’t always carry his byline but was fair and principled."]["Gayle and I wish you a Merry Christmas and a Happy New Year! https://t.co/rN3EstNDHd"]["As I told @poppyharlowCNN yesterday, job creators respond to incentives! #GulfCoast restaurant owner plans to use tax break for expansion: https://t.co/2dUxXlgg8C"]["The best way to stop Russian aggression is to deter it. @realDonaldTrump's decision to approve lethal arms sales to Ukraine is a good first step to give the Ukrainian people the means to defend themselves. My full statement: https://t.co/vuFQgpgOAF https://t.co/XWGqsHWFWg"]["Working with @realDonaldTrump , Congress has successfully overhauled the tax code to make it simpler, fairer, &amp; smarter. Starting next year, Mississippi families will begin to see more take-home pay &amp; an economy that continues to pick up steam: https://t.co/KDTiEvZnwh #TaxReform"][".@realDonaldTrump has laid out a bold vision for our national security. The @USNavy plays an important role in achieving @POTUS's plan. My full statement: https://t.co/l9OeaUkVY1 https://t.co/Ca2yxvSmO5"]["Courtland United Methodist Church in Courtland, Miss., displays a nativity scene and Christmas wreaths along the route of Grenada Railroad’s “The Train to Christmas Town.” Thousands of children and their parents make the journey each year. #MississippiMonday https://t.co/pwLwQHrMHT"]["Artificial Intelligence: What It Means and Why It Matters -&gt; https://t.co/QcyrWNB0cN #WickerReport"]["ICYMI: The @USNavy is working diligently to identify the root causes of safety issues in their T-45 training jets. @FoxFriendsFirst https://t.co/hzv2VlF6lP"][".@SenatorWicker &amp; @SenatorHassan: Americans need more security info for internet-connected devices. https://t.co/iE6eE7sDaG (via @thehill)"]["Today, I introduced legislation w/ @SenatorHassan to help consumers take action to protect their internet-connected devices from cyber intrusions. Read more here ⬇ https://t.co/rWbxx0a96j"]["The @FCC’s vote today to restore a light-touch to the internet should kick-start the legislative process in Congress. I’m eager to get to work to pass a long-term solution for #NetNeutrality. My full statement ⬇ https://t.co/vmMZqIsB15 https://t.co/xDjRO131fv"]["Glad to join @SenKaineOffice &amp; 15 other Senators to express support for the block purchase of 2 more Ford-class aircraft carriers. Block buys save $ &amp; give our sailors the ships they need to keep us safe. https://t.co/2PNkrRs4uP https://t.co/hBtTiNf7rt"]["WATCH ▶ @FoxFriendsFirst highlights progress on safety issues with the @USNavy T-45 training jets, based at @nasmeridianms. https://t.co/hzv2VlF6lP"]["Today, I chaired a hearing of the @HelsinkiComm to evaluate the success of the #MagnitskyAct over the past five years. https://t.co/7f79x2MzEN"]["The @USNavy is making great progress to mitigate the harmful effects of physiological episodes in its T-45 training jets. @FoxFriendsFirst has the story ⬇ https://t.co/hzv2VlWHKp"]["Honored to accept the @AOPA Freedom to Fly award. I will continue to be an advocate for Mississippi’s rural airports while working to improve the aviation experiences of all Americans. https://t.co/6GTfZo2yOM https://t.co/zPFgAIqz81"]["I believe R.D. James has the experience and skill necessary to lead the Army Corps. Today, I voted to advance his nomination to the full Senate. @USACEHQ https://t.co/ZxE3HWxlfo"]["Responding to congressional directives, the @USNavy is working diligently to find the root cause of safety issues in the T-45 training jets that are based @nasmeridianms. https://t.co/uZqe25wiwG"]["Today, I chaired a hearing on the future of #ArtificialIntelligence. Good to hear from @msstate Prof. Cindy Bethel about the ground-breaking technology being developed by MS students! https://t.co/M7c5pXQ2pa"]["Today, @realDonaldTrump signed into law my proposal for #355Ships! We have been asking too few @USNavy ships to do too many things. We have taken a major step toward rectifying that problem. #NDAA https://t.co/fTNdcYVlOs"]["With his signature, @POTUS confirms U.S. resolve to meet the needs of our @USNavy sailors. Building up our fleet will make America STRONG again! #NDAA"]["ICYMI: This weekend, I spoke at the opening of the Museum of Mississippi History &amp; the Mississippi Civil Rights Museum. https://t.co/Cl9Tdd1czn"]["#WickerReport: Wicker Commemorates Mississippi’s #Bicentennial with Mississippi-Themed Ornaments, Visit to Mississippi Museums Opening. #MS200 https://t.co/s13uFaVRAh"]["Jackson received record snowfall this weekend ahead of the state’s bicentennial celebrations. The National Weather Service in Jackson reported the snowfall was the highest storm accumulation since 1982. #MississippiMonday #MS200 https://t.co/Uq7cByqX6w"]["Mississippi’s #bicentennial is an important moment for our state. It marks the day our state became part of a growing nation that would go on to be the greatest the world has ever seen. #MS200"]["Let’s make this ceremony an opportunity to look ahead to the next 200 years and to resolve that this postage stamp of native soil will be a truly special place for those who follow. Happy Birthday, #Mississippi! #MS200 #Bicentennial"]["Let’s take this moment to imagine more powerful rocket engines, bigger battleships, more Rhodes Scholars, more Nobel prizes, more championships, and even more presidential visits. #MS200 #Mississippi #Bicentennial"]["As we consider the ghosts of #Mississippi, let’s concentrate most of all on the ghosts of #Mississippi yet to come. A future that includes more songs, more books, more inventions, more cures, more jobs. #MS200 #Bicentennial"]["Today, we shine the light on a history that is proud, but also sometimes painful. Mr. Faulkner would say that to understand this fact is to begin to understand the history of all humankind. #Mississippi #MS200 #Bicentennial"]["William Faulkner once said, to understand the world, you must first understand a place like Mississippi. Today, we take a profoundly important step in that quest for understanding. Today, we celebrate #Mississippi. #MS200 #Bicentennial"]["Summer internship applications are now available for my Mississippi and D.C. offices. Visit https://t.co/aOD1POfnLZ for more information! Deadline to submit is Dec. 30! https://t.co/k6rCCshe3j"][".@SenThadCochran &amp; I are proud to announce Senate passage of our #Mississippi #bicentennial resolution! Read the full resolution here: https://t.co/q8fKc85sTF"][".@realDonaldTrump is welcome in #Mississippi. His visit to celebrate our #bicentennial would give our state an incredible opportunity to showcase the people and stories that make our state so unique. https://t.co/l0nprAp5Me"]["I support @realDonaldTrump's decision to move the American embassy to Jerusalem. My full statement: https://t.co/dS9ffyKkIC https://t.co/NtXuYebGFt"]["WATCH: I was honored to have @GulfportHigh students create handcrafted ornaments for the Christmas tree in my D.C. office. @WXXV25 https://t.co/WZ3OIykngz"][".@WickerGayle and I are on our way to The White House Congressional Ball with @realDonaldTrump and @FLOTUS! https://t.co/LPZ1sLYdLV"]["Kirstjen Nielsen is eminently qualified to run @DHSgov. I am glad she can take charge of her agency and continue her work to keep Americans safe. https://t.co/dWIBzQ4VM6"]["I support #JusticeForJack. Freedom of religious conscience is a right #SCOTUS should uphold. #MasterpieceCakeshop"]["ICYMI: I decorated the Christmas tree in my D.C. office this year with handmade ornaments from @GulfportHigh students. @WLOX https://t.co/8hSRhe6a3K"]["I was blown away by the creativity, skills, and knowledge of Mississippi history demonstrated by the students at @GulfportHigh. Thank you for these impressive Christmas ornaments! https://t.co/pGogOgkkjc https://t.co/Oh2KmIFxMK"]["This morning, I joined my wife, @WickerGayle, and my staff to decorate our DC office Christmas tree with beautiful handcrafted ornaments from @GulfportHigh students. Hoping to start a Christmas tradition and invite one MS school each year to help us celebrate the season! https://t.co/5QFWOffQZK"]["This weekend, I will celebrate the grand opening of the Mississippi Civil Rights Museum in Jackson. Thank you to the many men and women who have worked so hard to make this museum a reality.  Its opening is long overdue. #MississippiMonday https://t.co/SzHqg6KSnW"]["This #TaxReform proposal would be good for job creation &amp; good for small businesses. It would mean millions of middle-class Americans keep more of their hard-earned dollars. And it would mean that American businesses can compete on a global stage. https://t.co/rD78gAhWzy"][".@ADPHattiesburg is a champion for investment in a unified, multi-county market.  In the process, it has created a model for success that other hub cities are learning from. Congratulations on 25 years! https://t.co/sHNQsy32lh"]["Congratulations, @ADPHattiesburg, on 25 years! I wish I could have been with you to celebrate. https://t.co/sHNQsykDJR"]["Today, I joined @TeamCavuto to discuss the latest on #TaxReform ▶ https://t.co/pOgKlXTNLs"]["There’s a reason why the stock market has climbed almost every day this week: Businesses are anticipating great things from #TaxReformNow. Today is a pivotal day for @SenateGOP. @AFRnet https://t.co/wP51ouaJNv"]["Glad to be back on @AFRnet with Tim Wildmon to discuss the latest on #NorthKorea &amp; #TaxReform. LISTEN HERE 🔊 https://t.co/4s22MlYaUy"][".@SenThadCochran, @CongPalazzo, &amp; I welcome @SECNAV's decision to name Ms. Ruby Lucas of Hattiesburg, widow of #MedalofHonor recipient Jack Lucas, as ship co-sponsor of the USS Jack Lucas. https://t.co/1s14z2vflH"]["Today, I asked @realDonaldTrump's nominee to lead @NOAA about his plan to implement my COASTAL Act. Property owners deserve fair compensation for wind and water damage after devastating storms! https://t.co/8acQb3heQt"]["Yesterday, #NorthKorea tested a long-range missile which reportedly can strike the U.S. homeland. I hope the world will unite behind the U.S. to pressure the North Korean regime. My full statement: https://t.co/gzjChEYohR https://t.co/lEss9UqyPW"]["Today, I voted with @EPWGOP to advance the nominations of two @realDonaldTrump nominees for key environmental roles. @SenateDems continue to obstruct and delay!"]["Thank you, Mississippi Rural Health Association. Supporting #RuralHealth in Mississippi has always been a priority &amp; I hope to build upon our success next year. https://t.co/BGtjzd91kV"]["Looking forward to @realDonaldTrump’s visit to the Capitol today to talk #TaxReform &amp; other issues. @SenateGOP plan would mean more take-home pay and jobs in Mississippi!"]["Better data and better management will preserve recreational fishing in Mississippi for years to come. #ModernFish https://t.co/SfJpIPWrBz"]["Today, @SenThadCochran, @CongPalazzo, &amp; I welcomed @realDonaldTrump's approval of @PhilBryantMS's request for disaster assistance in South MS after #HurricaneNate. https://t.co/UEtXaZIowk"]["ICYMI: Recreational fishing matters to Mississippi and the nation. @clarionledger #ModernFish https://t.co/SfJpIQe309"]["Christmas decorations are already up in Water Valley. The town celebrates the Christmas season each year with decorations and events. #MississippiMonday https://t.co/TVydfIGU0m"]["West Harrison H.S. making us proud! #MacysParade #wickerfamilytradition https://t.co/YjRdDFTUHM"]["This Thanksgiving, I am reminded of 1 Chronicles 16:34: \"Give thanks to the Lord, for He is good; His love endures forever.\" I'm thankful for a God and a family who love unconditionally. Have a happy and safe Thanksgiving! https://t.co/9eTr2hXNx7"]["Praying for the safe return of all our @usnavy personnel. https://t.co/uJ84isL0pC"]["I will continue to work with my colleagues to put a legislative solution in place that enshrines #NetNeutrality protections into law and fosters an environment where broadband is accessible, affordable, and reliable for all Americans. https://t.co/aGC3bqW0wI"]["I welcome @AjitPaiFCC’s announcement to restore the light-touch regulatory framework that has allowed the internet to thrive since its creation. https://t.co/aGC3bqW0wI"]["This morning, I traveled to the Pearl Senior Center to help serve meals and meet with leaders from Mississippi about how we can better serve older adults. https://t.co/VNn7XYroDL"]["Last night, I was glad to join my grandchildren to ring the bell for the @SalvationArmyUS in Jackson. Always amazed by how charitable Mississippians are! https://t.co/R6rwv66rvQ"]["This week’s #MississippiMonday comes from Roosevelt State Park in Scott County, Miss. https://t.co/x5FT16hStK"]["I commend @realDonaldTrump's Asia tour. He tackled tough topics and fought for American interests. #WickerReport https://t.co/Bhdj7Dh6Uv"]["This morning, @WLOX highlighted what my plan to expand the @USNavy could mean for South Mississippi. #355Ships @PascagoulaCity https://t.co/jqT97WJsUO"]["ICYMI: I joined @TeamCavuto on @FoxNews to discuss the @SenateGOP plan for #TaxReform. https://t.co/S6btNbTuiK"]["The #SHIPSAct is on its way to @realDonaldTrump's desk! #355Ships is one step away from becoming law. https://t.co/tlk1HrdvGz"]["BIG WIN for the @USNavy. My #SHIPSAct is headed to @realDonaldTrump's desk. #355Ships https://t.co/tlk1Hrv759 https://t.co/UAuwBqtAVb"]["The @usairforce should respect service members' rights to religious conscience. Col. Bohannon deserves justice. https://t.co/hGHhH2FX7L"]["Today, I met with @USTreasury Secretary @StevenMnuchin1 to discuss the @SenateGOP plan for #TaxReform https://t.co/B8NI6dxfeh https://t.co/ifqnvj3b7n"]["Thank you @FCC for taking steps to ensure states have a say in the Lifeline program. https://t.co/BQb1Bt7zft"]["We need a bigger @USNavy and we need it now. My #355Ships proposal is heading to @realDonaldTrump's desk. https://t.co/tlk1Hrv759 https://t.co/9EqxyVCi0J"]["#TaxReform means more jobs and more money for Mississippi families. I’m eager to roll up my sleeves and get this proposal to @realDonaldTrump’s desk: https://t.co/fIJsR46Rhr https://t.co/gBPJyQHdQl"]["This week is National Apprenticeship Week. I look forward to working with the @USDOL Task Force on Apprenticeship Expansion to enact my bill, the Apprenticeship Enhancement Act of 2017: https://t.co/8m2sx1YV7a https://t.co/U4ZUtPETm0"]["#TaxReform means more take home pay and more jobs in Mississippi. https://t.co/J0LtquOofG"]["Today, the U.S. Senate unanimously declared its support for National Adoption Month. Happy to join my colleagues to back families who strive to provide children with forever families."]["I’m confident in new laws benefiting our veterans. Real VA reform is a top priority. #WickerReport https://t.co/lUqx77dEQs"][".@realDonaldTrump has chosen wisely. Alex Azar has the understanding &amp; experience needed to lead @HHSGov. My full statement ➡ https://t.co/K2Zo2v35fM"]["Learn how this Congress &amp; White House are keeping veteran care a top priority. #WickerReport https://t.co/lUqx77vgf2"]["Our veterans and military families hold a special place in our communities. These men and women have fought for us, and we need to fight for them. #VeteransDay2017 https://t.co/SAgRG53Z1u"]["This weekend is an opportunity for all Americans to thank our veterans for their service and to honor them for their sacrifice.  #VeteransDay2017 https://t.co/3c3wrXoS2T"]["Spoke this morning at the Bettye May Jack Middle School Veterans Day ceremony. Good to see Morton Mayor Gerald Keeton and MS Representative Tom Miles! https://t.co/6O998H9e7E"]["In 2013, I welcomed an #HonorFlight of MS Gulf Coast veterans to the WWII memorial in D.C. This #VeteransDay2017 weekend is an opportunity for all Americans to honor our veterans for their service. https://t.co/6EUWDK9Mes"]["Americans deserve to have a tax code that respects and rewards hard work. If we can deliver on these tax cuts, I believe we are going to give a jolt to the economy, the likes of which we have not seen in more than a decade. #TaxReform https://t.co/fIJsR46Rhr"][".@dailyleader: Rural areas need high speed internet access, too: https://t.co/46KGTSFqkG"]["Great editorial from @dailyleader on how greater rural broadband access can change lives:  https://t.co/46KGTSFqkG"]["Mississippi veterans deserve better than two-star and one-star medical centers. Today, I sent a letter to @SecShulkin asking for a plan to make MS VA hospitals better: https://t.co/NaGw2LsPwK"]["We fought hard to keep the @403rdWing's \"Flying Jennies\" in Mississippi &amp; won. @usairforce announced the C-130Js &amp; crew are now at full strength! @SenThadCochran @CongPalazzo  https://t.co/wbliagVc9L"]["If confirmed, @realDonaldTrump’s nominees for @USNavy will commit to much-needed #355Ships requirement:  https://t.co/OCThaowBMl"]["I'm thankful @Starkville_City &amp; Oktibbeha County will soon have a new emergency shelter. It's important to be prepared for dangerous weather. https://t.co/CXPfFZqfkR"]["Internet of Things technologies are making a big impact in rural areas. #telehealth @UMMCTelehealth https://t.co/xbMHyukslV"]["Proud to be a veteran of the @usairforce. It’s something I hold dear. Thank you, @DeptVetAffairs for #HonoringVets. #VeteransDay https://t.co/Ad3TbLz1v8"][".@realDonaldTrump's nominees for the @USNavy agree: #355Ships is a top priority. https://t.co/OCThaoOdaV"]["Today, I chaired a hearing to examine the benefits of the Internet of Things devices in rural communities. https://t.co/xbMHyukslV"][".@NIH &amp; Nat'l Institute on Aging have begun implementing my #EUREKA proposal to fight #Alzheimers! Learn more --&gt; https://t.co/m3tPmgsSTQ"]["The budget sequester has hurt our national security. I told @hughhewitt we need to end it – &amp; commit to #355Ships. https://t.co/VD2eOLtTww"]["ICYMI: I joined @hughhewitt to discuss the @USNavy's need for #355Ships. 🔊 https://t.co/VD2eOLtTww"]["Last week, the Senate confirmed 4 constitutional conservatives to the federal circuit for lifetime appointments. https://t.co/kkO5vSb9lF"]["To quote the Rolling Stones: “But if you try sometimes, you just might find, you get what you need.” https://t.co/OVAzNW6gnT"]["Glad to join @paulgalloshow on @supertalk to discuss GOP plan for #TaxReform. https://t.co/P8W79cAevC"]["Jerome Powell is an excellent choice for Fed Chair. Experienced, independent, pragmatic. Have voted to confirm him twice. Will do so again."]["Today, I asked @realDonaldTrump's choice for @USArmy Sec. to help MS defense manufacturers in Columbus &amp; Stonewall. https://t.co/wHEtu41SWk"]["We’re asking too few ships to do too many things. Our sailors deserve better support &amp; more ships. #355Ships https://t.co/MA6SLZiyC4"]["@washingtonpost @SenateDems .@SenateGOP plan would cut taxes for Americans who need it most! (2/2) https://t.co/A5q6imdqxb"]["The @washingtonpost gives @SenateDems talking points on #TaxReform 4 Pinnochios! (1/2) https://t.co/A5q6imdqxb"]["TUNE IN: On w/ @paulgalloshow next on @supertalk at 7:20am CT. Listen here: https://t.co/ZbKDwqzfIw"]["I support the #RAISEAct authored by @SenTomCotton &amp; @sendavidperdue, &amp; backed by @realDonaldTrump. Would end the Diversity Visa Program!"]["I took to the floor of the Senate to renew my call for #355Ships. Important to meet the needs of our @USNavy. https://t.co/D2cp8eRxm0"]["Sick &amp; twisted act of terrorism in NYC. Thankful for NYPD and first responders. Our resolve to rid the world of ISIS remains firm!"]["Consumer confidence is at the highest level since 2000! @realDonaldTrump's plan for growth is working. https://t.co/acIHmFLUf8"]["I strongly support the confirmation of Amy Barrett. @SenateDems can't block this well-qualified conservative. https://t.co/aT4E7QLAj4 https://t.co/wF3r7JDfLj"]["ICYMI: Last week, I was encouraged by President @realDonaldTrump's meeting with @SenateGOP. https://t.co/UuLIezxZX8 #WickerReport"]["U.S. tax code encourages millions of jobs &amp; billions of 💲 in investment to go overseas. Let’s bring it home. https://t.co/FXAumF8zvc (7/7)"]["Some estimates predict a $4,000 boost in average household incomes with @realDonaldTrump's #TaxReform plan. https://t.co/FXAumF8zvc (6/7)"][".@realDonaldTrump's #TaxReform plan means lower taxes &amp; a fairer, freer system for everyone. https://t.co/FXAumEQYDE (5/7)"]["Our tax system is outdated and  complicated, but @realDonaldTrump &amp; @SenateGOP are ready to fix it. https://t.co/FXAumF8zvc (4/7)"]["With @realDonaldTrump's #TaxReform plan, millions of U.S. #jobs &amp; trillions of dollars in output is unlocked. https://t.co/FXAumF8zvc (3/7)"]["Americans can make better decisions about how to spend their money than the federal government. https://t.co/FXAumEQYDE (2/7)"]["Good to join @NASAStennis and @RollsRoyce for the 10th Anniversary Celebration of the Rolls-Royce Outdoor Jet Engine Testing Facility. https://t.co/LdSymi0KDv"]["I've got 7 reasons why @realDonaldTrump's #TaxReform plan is a win for American workers. Read my op-ed here: https://t.co/FXAumEQYDE"]["The families of those killed in #Niger deserve answers. I believe they will get them. My interview w/@BrookeBCNN ▶ https://t.co/aCfMihLhiy"]["The #Niger mission is critical to American interests &amp; to prevent the area from becoming a terrorist staging ground. https://t.co/O82ruo4n3a"]["Sr Navy officials need to support their own requirements. Disappointed in U/S Navy Dee's comments on #355ships. https://t.co/A9I3pIhrWF"]["We need a #355ship Navy ASAP. Just confirmed SECNAV Spencer agrees!  U/S Dee must have been asleep for nine months. https://t.co/A9I3pIhrWF"][".@POLITICOPro reports the @FCC is working to SPEED broadband deployment. Read my plan for the FCC here: https://t.co/GUIpxnMBKP #SPEEDAct https://t.co/NVTlhWNHlu"]["This week, I explored options to close the #DigitalDivide. Satellites could be part of the answer. Read how here: https://t.co/QsEuUuRgPD"][".@realDonaldTrump is following through on his promise to fight the opioid crisis and to help American families heal: https://t.co/X47mcXE7Js https://t.co/1dXmwbOm2i"]["Expanding #RuralBroadband demands a multi-technology solution. This week, I asked how satellites may help. https://t.co/QsEuUuRgPD"]["The U.S. is getting tough on Iran. Congress sent sanctions for Iran-backed Hezbollah to @realDonaldTrump's desk. https://t.co/KJkB53XSxE"]["WATCH ▶ Our tax system is out of date. We're now on the fast-track to tax cuts for American workers. https://t.co/nszjP8E3ht"]["We're on the fast-track to tax cuts and #TaxReform. Hoping for swift action from the House of Representatives! https://t.co/nszjP8VE91"]["#TaxReform would give a jolt to the economy the likes of which we haven't seen in long time. WATCH ▶  https://t.co/nszjP8E3ht"]["My #ModernFish bill was well-received by a panel of experts. A new report suggests the law needs to change: https://t.co/fmnb83dw9U"]["WATCH: I joined Liz MacDonald on @FoxBusiness to discuss @realDonaldTrump’s visit to the Capitol. ▶ https://t.co/HNghVd1Xqc"]["ICYMI: I joined @CNN to discuss today's meeting w/ @realDonaldTrump. Looking forward to a positive, productive mtg: https://t.co/sbAeJPobig"]["#WickerReport: The Senate should burn the midnight oil to confirm @realDonaldTrump’s nominees. ➡ https://t.co/dMPvbMIQIj https://t.co/BGzFMtohff"]["ICYMI: Last night, the Senate passed a budget resolution that would clear the way for #TaxReform. https://t.co/IxxYy7DgUh"]["My #SPEEDAct would cut the #RedTape for #5G wireless. ALL Americans deserve a fast, reliable internet connection. https://t.co/u14uxUT6O9 https://t.co/KQpkrdBMV4"]["With @realDonaldTrump leading the way, #TaxReform is @SenateGOP's top priority.➡ https://t.co/IxxYy7DgUh https://t.co/UyyLVAG5Ey"]["Intro'd #SPEEDAct to fast-track deployment of #5G wireless &amp; help close the digital divide w/ @SenCortezMasto. https://t.co/u14uxUT6O9 https://t.co/BzDAcygLv6"]["The Senate has passed a budget proposal laying the foundation to cut taxes for middle-class families &amp; job creators! https://t.co/JHXXuKzisD"]["Enough Democratic slow-walking of @POTUS nominees! The President deserves to have his team in place. https://t.co/4GwaxdHKDA https://t.co/qiiiPmOCgU"]["Joined @LizClaman on @FoxBusiness to discuss tonight’s budget vote. Hopeful this will pave way for #TaxReform ▶ https://t.co/VN4730pXGR"][".@SenateDems unprecedented stalling of @realDonaldTrump’s nominees is injurious to the American people! https://t.co/4GwaxdHKDA https://t.co/lu4Ij6ZdgB"]["Republicans are acting like a team to pass a budget that paves the way for #TaxReform. WATCH on @FoxBusiness ▶ https://t.co/VN4730pXGR"]["Here are the facts: @realDonaldTrump's nominees are being DELAYED by @SenateDems. Simply unacceptable! https://t.co/4GwaxdZm2a https://t.co/n77AAGWud8"]["I'm calling for the Senate to work through the night &amp; weekends to confirm @POTUS nominees. No more needless delays. https://t.co/4GwaxdZm2a https://t.co/1GzF4cUtQF"]["Honored to accept the @ABCNational Eagle Award. Their efforts create jobs &amp; help build a bigger, better America. https://t.co/LrOSMwi8NC https://t.co/jvKpwyO3wF"][".@SenateDems obstruction is injurious to the American people. It's time to break this logjam. https://t.co/4GwaxdZm2a https://t.co/UfKGzZQpVC"]["I'm ready to work nights &amp; weekends to confirm @realDonaldTrump's nominees. @SenateDems obstruction should stop. https://t.co/4GwaxdZm2a https://t.co/DRql13lSGP"]["Enjoyed speaking w/ @realdonaldtrump this AM. Working together to get a #355Ship Navy, fix #healthcare, &amp; deliver #taxreform."]["On Friday, I joined @PascagoulaCity Mayor Dane Maxwell to survey the impact of #HurricaneNate. #MississippiMonday https://t.co/mTRDEK4D6o"][".@realDonaldTrump is keeping his promise to roll-back the so-called #CleanPowerPlan! Great move! https://t.co/m9kJWSuDIG"]["The #IranDeal is a terrible deal for America. Pleased @realDonaldTrump is giving us a chance to make a better one: https://t.co/cIvNLM6U5e https://t.co/7NsdVkXsGG"]["Celebrating 242 years of dedication and service. Happy Birthday, @USNavy! ⚓#242NavyBday https://t.co/XWd4L8Nc70"]["Today, @realDonaldTrump took bold action to give families the freedom to find the best rates for their #healthcare. https://t.co/ggUnSfwVjU"]["Kirstjen Nielsen has the right type of experience to run @DHSgov. Hoping to begin her confirmation without delay! https://t.co/pOz3MTT6Ss"]["Emergency Nurses stand on the front lines of emergency care. Thank you for your dedication to saving lives. #ENWeek @ENAorg"]["Mississippi continues to earn national attention. @UMMCnews designated a Telehealth Center of Excellence! https://t.co/1i1XFGpkrt"]["I support an @xprize for #Alzheimers research. Unleashing the power of competition could lead to a cure. Let's get to work, #AlzheimersTeam! https://t.co/YxMNVWBbnO"]["ICYMI: @UMMCnews received national recognition for its leadership in #Telehealth. @UMMCTelehealth #WickerReport https://t.co/1i1XFGpkrt"]["Stand ready to work w/ @realDonaldTrump to ensure that needed federal resources will be delivered to storm victims. 2/2"]["#HurricaneNate is no match for Mississippians’ resilience. Am working closely w/ state &amp; local officials. 1/2"]["I’m tracking TS #Nate closely &amp; stand ready to ensure that needed federal resources will be delivered to storm victims."]["Just spoke w/ @USCG Adm. Paul F. Thomas. TS #Nate likely headed to MS Gulf Coast, w/ heavy wind &amp; storm surge expected. Prepare now! #mswx https://t.co/WDlc9hEJHC"]["Follow @MSEMA and @NWS for the latest on Tropical Storm Nate as it approaches the Gulf Coast. Make preparations now! #TSNate https://t.co/UvqUezmDBS"]["Expanding #Telehealth will be a quantum leap for health care. @UMMCTelehealth is leading the way. ▶ https://t.co/x1aU73wVjM @UMMCnews"]["Honored to join @HHSGov to designate @UMMCNews as a #Telehealth Center of Excellence. Mississippi is leading telehealth growth nationwide! https://t.co/RLKzQ3rPvT"]["Proud to be a cosponsor of this bill with @LindseyGrahamSC. #TheyFeelPain #PainCapable https://t.co/YPAsS5tPUm"][".@SenThadCochran &amp; I are hoping for a quick confirmation for Randy Reeves of Mississippi to the @DeptVetAffairs. https://t.co/RyHwyMVFM6"][".@SenateCommerce also approved @SenBlumenthal &amp; my proposal to protect children from being left in a #HotCar: https://t.co/i6TBVxngH7 2/2"]["Autonomous vehicles are the future. Voted today to advance the #AV START Act! https://t.co/i6TBVxngH7 @SenJohnThune @SenGaryPeters 1/2"][".@March_for_Life fights for the unborn. Join them Friday, January 19, 2018, in D.C. to show the world that #LoveSavesLives! #whywemarch https://t.co/WgzoJqWCSv"]["Congratulations to @MikeHurstMS on his confirmation as U.S. Attorney for the Southern District of Mississippi! https://t.co/0SmDKvYlw0"][".@realDonaldTrump should be commended for his choice to lead @USACEHQ. R.D. James also supported by MS Levee Board: https://t.co/fMMNfqBkeK"]["Great to see such a large group of #Mississippi #Catfish producers in D.C. fighting to keep catfish safe for the American consumer. https://t.co/T1fK9D8Ani"]["Today, Hinds County broke ground on the next phase of the Byram-Clinton Corridor. This project will support economic growth in the area! https://t.co/DpQYw2EVNO"]["My full statement on the crash of a @nasmeridianms-based training jet: https://t.co/TIbyKwkqVk"]["Congratulations, @AjitPaiFCC, on a 2nd term at @FCC! Look fwd to continue working w/ you to close the broadband gap. https://t.co/zxN2SrCpVn"]["Mississippi charter schools are getting a $15M boost from @usedgov. Big win for #SchoolChoice! @EmpowerMS https://t.co/EKswRFlFpX"]["#WickerReport: The GOP #TaxReform plan would make taxes lower, simpler, &amp; fairer - spurring growth &amp; investment. https://t.co/P51ZlXP6AF"]["This weekend, I traveled to my hometown of #Pontotoc to celebrate Mississippi's #bicentennial. #MS200 #VisitMS   #MississippiMonday https://t.co/cYx7KCddBW"]["My full statement on the #LasVegas tragedy: https://t.co/zYGKByHpIH https://t.co/5v7t0X9scc"]["The Senate passed CHRONIC Care Act. Great step forward for cost-effective, life-saving #telehealth services.  https://t.co/0Q5BbYD8xy"]["CHRONIC Care Act passed w/ 4 of my provisions for #telemedicine. Big win for rural health-care! ➡ https://t.co/0Q5BbYD8xy @SenBrianSchatz"]["MS health leaders know the difference that #telemedicine can make. Pleased to see the Senate agrees➡ https://t.co/0Q5BbYD8xy @SenThadCochran"]["Welcome back, @SteveScalise. https://t.co/A3dmCVWtPM"]["ICYMI: @realDonaldTrump unveiled his plan for #TaxReform. I am ready to help him reform our country's tax code. ➡ https://t.co/ZVoMaiJB0H https://t.co/z1o0SWRfA8"]["Mississippi families deserve to keep more of what they earn. The time for #TaxReform is now. 🕖 https://t.co/ZVoMaj1cph https://t.co/tBkftlfLa3"]["I'm ready to help @realDonaldTrump reform our country’s broken tax code. ➡ https://t.co/ZVoMaj1cph"]["Community banking reform is moving forward in Congress! @RepSeanDuffy introduced House bill this week. https://t.co/ExuT4xL1Nq"]["Introduced @realDonaldTrump's choice for @NOAA Deputy Administrator, RDML Tim Gallaudet. ▶ https://t.co/vG2GkKx3CC"]["Productive meeting with the mayors of @PascagoulaCity , @OceanSpringsMS, Moss Point, Gautier, &amp; other Jackson Co. officials this morning. https://t.co/x3KUlbkCPa"]["Today, I attended #GenDunford's reconfirmation hearing to ask about #Ukraine &amp; the @USNavy's #355Ships requirement. https://t.co/ob7XiFuywj"]["The availability of high-speed Internet is directly linked to Mississippi’s future economic success. Thank you, @CSpire! https://t.co/Rk2fFgka0c"]["The Smith County Courthouse in Raleigh was built in 1912 after the previous courthouse was destroyed by fire. #MississippiMonday https://t.co/3HqtbWZJZI"]["#WickerReport: @realDonaldTrump's #UNGA speech offered a bold commitment to U.S. strength, &amp; condemned #NorthKorea: https://t.co/wHSL7awTmE"]["Spoke at a @DeSotoCouncilMS event today about cutting taxes, reforming regs, repealing #Obamacare, &amp; more https://t.co/inRgW3ATid  #SoDeSoto https://t.co/aIJqG6G3zA"]["On-the-job training lets students \"earn as they learn.\" My bill would expand apprenticeships for American workers. ➡ https://t.co/GMIaMPJ6Vl"]["Intro'd a bill to support @realDonaldTrump's goal to expand apprenticeship programs. Learn more➡https://t.co/GMIaMQ0IjV"][".@SenThadCochran &amp; I urge every student who is active in his or her community to apply for the @PruSpirit award. https://t.co/jl1sySYVpd"]["Honored to receive an award from the Regional Counterdrug Training Academy headquartered in @visitmeridian. https://t.co/YRbg9S2jFz https://t.co/n9FhPThEpS"][".@CityofVicksburg was 1 of 8 cities selected by the @RWJF for its annual Culture of Health Prize! @SenThadCochran https://t.co/YYoWo1AqxF"]["Powerful speech by @realDonaldTrump today at the #UNGA. America's foreign policy was made crystal clear to friend &amp; foe alike."]["Senate just passed my #SHIPSAct as part of #NDAA. Building a bigger @USNavy should be a nat'l priority! #355Ships https://t.co/ysE2wz8yKV"]["Great things happening in @DeSotoCountyMS. @Cityofob #5 &amp; @CityofHernando #55 on @MONEY's Best Places to Live 2017: https://t.co/aH3EuU52zc"]["Happy 70th Birthday, @usairforce! Honored to serve 27 years w/ the great #airmen &amp; women of the USAF &amp; @USAFReserve. #AFBday https://t.co/4MAQg6X8Mo"]["#WickerReport: My proposal for #355Ships is nearing the finish line. https://t.co/RtmS8MKEOG"]["The Tripoli (LHA-7) has been christened! Congratulations @USNavy and @HIIndustries. One step closer to #355Ships. https://t.co/ixVMC1ZGL8"][".@HIIndustries launched the Tripoli 13 weeks ahead of schedule, a testament to the work of Mississippi’s shipbuilders &amp; @USNavy. #355Ships https://t.co/F0pshOcPWY"]["The shipbuilders at Mississippi's @HIIndustries provide the expertise &amp; skills necessary to build big-deck amphibious ships like Tripoli. https://t.co/KBmLqmkNmb"]["At 844 feet long, The Tripoli (LHA-7) will support a crew of more than 1000 @USNavy Sailors &amp; almost 2000 @USMC Marines. #355Ships https://t.co/Pto5yqpjks"]["The Tripoli (LHA-7) is the largest of all amphibious warships, capable of supporting the most advanced @USMC aircraft. #355Ships https://t.co/Ni2YnRIEeZ"]["This Saturday in @PascagoulaCity, @HIIndustries &amp; @USNavy will christen the second America-class amphibious assault ship Tripoli. #355Ships https://t.co/iSbT9bw4GF"]["The U.S. should cut the red tape and modernize our policies towards #5G deployment. We can’t be left behind! (5/5) https://t.co/ybBMhiRG20"]["More options for broadband = greater availability &amp; affordability for high-speed connections in rural areas. (4/5) https://t.co/ybBMhiRG20"]["Faster, denser connections enabled by #5G tech will improve quality of service for rural &amp; urban\n Americans. (3/5) https://t.co/ybBMhiRG20"][".@RepMoBrooks &amp; @RepDebDingell intro’d a resolution supporting #5G wireless. Here’s why I think #5G will make rural broadband better: (1/5)"]["Great meeting today with the @realDonaldTrump nominees for @EPA Assistant Administrator - David Ross, Dr. Michael Dourson, and Bill Wehrum. https://t.co/CTFO2FimEe"]["Thank you for your visit, @msprimaryhealth! https://t.co/YSzPW50gLM"][".@POTUS has made an excellent choice in appointing Mitch Tyner to @AdvocacySBA. @gr8tfullawyer https://t.co/ejPlgDP5wU"]["Regulatory uncertainty stifles the recreational fishing economy &amp; causes problems for job creators. #RedSnapper https://t.co/XMOn2b9Bzi"]["All across Mississippi, people are commemorating 9/11 with service. #NationalDayofService @VolunteerMississippi https://t.co/vGhMjnm9E8"]["Thankful that @POTUS and lawmakers are ready and willing to provide much needed resources to storm victims. https://t.co/XumPGU5W3t"]["I commend Mississippi's outreach to hurricane victims in their time of need. #HurricaneHarvey #HurricaneIrma https://t.co/XumPGU5W3t"]["#WickerReport: #Mississippi communities are repaying the kindness that followed Hurricane Katrina.➡ https://t.co/XumPGU5W3t"]["I'm standing with @realDonaldTrump to fund our gov't and provide relief to those affected by #HurricaneHarvey. https://t.co/pYPvLYnetH"][".@SenateCommerce has targeted waste, fraud, &amp; abuse in the @FCC’s Lifeline program. Improper spending must stop! https://t.co/cJMRCPl9LN"]["Improper spending by @FCC's Lifeline program diverts resources from important initiatives, like #RuralBroadband. https://t.co/cJMRCPCLan"][".@realdonaldtrump is right! #TaxCuts would create jobs, boost innovation, encourage investment, &amp; boost wages. #TaxReform"]["#WickerReport: Wicker Looks Ahead to Senate Agenda as Critical Deadlines Approach➡  https://t.co/whImBlrnh2"]["The Friendship Oak tree is located on the front lawn of @USMGulfPark campus in Long Beach. https://t.co/NhDpM5qcF2"]["#WickerReport: Congress has little time for political tactics. National security &amp; tax reform are top priorities. https://t.co/whImBlrnh2"]["Toured the Choctaw Regional Medical Center in Ackerman. The facility is a state of the art rural healthcare center that was built in 2013. https://t.co/toWQzO1PK3"]["Joined @OleMiss and @Globalstar at the #UMTechSummit to announce plan for new satellite communications station in @OxfordMS. https://t.co/Nv1O2A8BXx"]["ICYMI: @SenThadCochran &amp; I encourage #Mississippi students to apply for @SenateYouth. $10k scholarship. ➡ https://t.co/R3OJySsJph https://t.co/5qrH6oLUEg"]["Joined @ATT in Hernando to launch fixed wireless internet service in DeSoto County and other rural locations in Mississippi. https://t.co/dk9ReskTWo"]["Spoke with the @MyTupelo Rotary Club at the Elvis Presley Birthplace Museum. Good to be home in Tupelo. https://t.co/W5pHLEIxGZ"][".@SenThadCochran &amp; I encourage #Mississippi students to apply for @SenateYouth. $10k scholarship. Deadline Oct. 13 ➡ https://t.co/R3OJySsJph"]["#WickerReport: #Mississippi students will thrive in tech careers. Educators know these skills are in high demand. https://t.co/PSzw5vSYJi"]["Today, I met with representatives of the @MSMA1 to discuss #Healthcare. https://t.co/4mlbxhMGC3"]["The full repair of the #USSFitzgerald cannot come soon enough. The @USNavy has chosen wisely in @HIIndustries: https://t.co/ZusHlqbxgL https://t.co/UQvLqLO6uy"]["As we continue to mourn those who died aboard the #USSFitzgerald, I am encouraged by the @USNavy's quick action: https://t.co/ZusHlqbxgL https://t.co/1L62ZEq4g8"]["The @USNavy announced it intends to award @HIIndustries in Pascagoula the contract to repair the #USSFitzgerald. https://t.co/7gHLdWvvcr https://t.co/h8wgS4GNXw"]["Dropped off a few boxes of books from my personal library and the @librarycongress for the Water Valley High School library. https://t.co/upVN5MA7XY"]["I commend @realDonaldTrump for listening to our military commanders on the ground. #Afghanistan ➡️ https://t.co/jkygyPhhNN https://t.co/DtxV1NdOTU"]["I took a break from my meetings today to view the solar eclipse. #MississippiMonday #SolarEclipse2017 https://t.co/mbkl9Qmv90"]["Our hearts go out to the loved ones of the sailors aboard the #USSJohnSMcCain. Praying for the return of all our @USNavy sailors."]["#WickerReport: This month, I'm traveling across the state to hear from Mississippians directly: https://t.co/0DWHE12kng"]["Visited the Olive Branch Airport with Mayor Scott Phillips to discuss the challenges of providing quality air service in the region. https://t.co/kxllHcsFH9"]["Joined Olive Branch Mayor Scott Phillips, Olive Branch Police, &amp; the DeSoto County Sheriff’s Dept. to discuss the opioid crisis in N. Miss. https://t.co/2acfUZ2oim"]["Enjoyed meeting students and faculty at the @DCSeNews Career Technology Center. https://t.co/eZq1BSLZjr"]["Good to see so many DeSoto County leaders this morning at Hazel's Family Restaurant in Olive Branch. https://t.co/f2HMkwTbIa"]["Stopped by The Tracks in Winona for a great lunch with Mayor Jerry Flowers, owners Greg &amp; Donna Pearson, and other friends. https://t.co/r21btNfcEn"]["This morning, I joined other Mississippi leaders to honor Mississippi’s veterans in Kilmichael. https://t.co/oA8vrLDCeJ"]["Gayle and I purchased our lifetime passes for the @nationalparkservice. #FindYourPark https://t.co/MKQOuJADVe"]["For this week’s #MississippiMonday, we go behind the scenes at @NASAStennis for a rocket engine test. #SLSFiredUp https://t.co/OJI50Bj9DB"]["Pleased to see @realDonaldTrump directing @USTradeRep to investigate China's unfair trade practices &amp; possible IP theft. Thank you, @POTUS!"]["#WickerReport: Mississippi will help write the next chapter of drone technology ➡ https://t.co/sZXN48BB3X"]["Tori Bowie, from Sand Hill, Mississippi, won the 100M race at the @IAAFWorldChamps. https://t.co/lfVj8SMrLq"]["Sam Kendricks, from @VisitOxfordMS, took home gold in pole vaulting at the @IAAFWorldChamps in London! https://t.co/MdXIEk4Yyu"]["Brittney Reese, from @CityofGulfport, won the gold medal in long jump at this year's @IAAFWorldChamps in London! https://t.co/0hv3aDnmZD"]["Wonderful visit tonight w/ #Mantachie Rural Health Care Dr. &amp; staff, MHP Trooper Bruce Whited, &amp; others at Ozark Baptist Church. https://t.co/1aoIsPzoFw"]["Today, I stopped by the Rotary Club of Columbus lunch. Great to see many good friends. https://t.co/cIxY4N8LZa"]["Parents, caregivers, &amp; citizens must be vigilant. A heatstroke can kill a child in minutes. #HotCars #CheckForBaby https://t.co/8oYgJmOE5y"]["Leake County Courthouse in Carthage, Miss., features a memorial for Colonel Van T. Barfoot, a Medal of Honor recipient. #MississippiMonday https://t.co/yjUAwlYqI5"]["ICYMI: The @FCC voted to standardize wireless coverage data &amp; provide $2B for rural broadband expansion. https://t.co/ABUEdDWOWz"]["The U.S. #CoastGuard is celebrating 227 years of service. Happy Birthday @USCG! #SemperParatus  #CG227 https://t.co/Qw1gbHhhJq"]["I commend @FCC &amp; @AjitPaiFCC  for working to standardize wireless coverage data &amp; support rural broadband expansion. https://t.co/ABUEdEeql9"]["WATCH ▶ The BENEFIT Act is a win for patients. They deserve a voice in the drug approval process. https://t.co/iOjnoeDDRx"]["The Grenada Railway in central Mississippi won a $7.54M grant to restore service &amp; enhance safety. @SenThadCochran https://t.co/BUxOLGnxrm"]["Today, I spoke from the floor to celebrate passage of the BENEFIT Act. Big win for patient choice in drug approvals. https://t.co/iOjnoeVfg7"]["The BENEFIT Act would give patients &amp; advocates a greater role in @US_FDA drug approval process: https://t.co/I1kpkJMsEj"]["The Senate unanimously passed the BENEFIT Act. Big win for patient-focused drug development. @amyklobuchar https://t.co/I1kpkJuRML"]["Today, the Senate sent the largest expansion of the G.I. Bill in over a decade to @realDonaldTrump's desk. https://t.co/mom5KBlM7u"]["Intro'd res today w/ @SenBrianSchatz in support of expanding #5G &amp; all broadband technologies: https://t.co/odfaGXTRfZ #Jobs"]["Met with Dr. Mark Esper, @realDonaldTrump's nominee for Secretary of the @USArmy. Hoping for a quick confirmation! https://t.co/2cYZwDauvK"]["I’m working to modernize federal fishing policy and support Mississippi’s recreational anglers #LetAmericaFish https://t.co/3dfvZ84dVG"]["Last year, 800+ books were donated to Mississippi libraries. Librarians can submit their requests for books to my office. @wdam https://t.co/DDZi6yoprv"]["Today, I continued my work to support recreational fishermen and modernize federal fishing policy. #LetAmericaFish https://t.co/3dfvZ7MD48"]["Public libraries in Mississippi can apply for book donations from @librarycongress and my personal library. @16WAPTNews https://t.co/tzwkbDCDYn"]["Community banks make the American dream possible. My bill would help these small banks expand local economies: https://t.co/3SN2d88vfb"][".@JacksonAirports is receiving $5.17M in @FAANews funding to complete the final phase of runway renovations. https://t.co/qvbQos7US8"]["Last year, @librarycongress and I donated 800+ books to Mississippi libraries. This year, I'm sure we can give more: https://t.co/iux0CUQgoJ"]["Corn is coming up nicely in Edinburg in Leake County. #MississippiMonday https://t.co/KsJjfSOUT9"]["This month, I've supported three bills to help Mississippi’s hunters, fishers, &amp; wildlife enthusiasts. #WickerReport https://t.co/RArmlsaXiF"]["I'm partnering w/ @librarycongress to donate books to Mississippi public libraries. Read more here: https://t.co/iux0CUyFxb"]["#WickerReport: The Senate is moving closer to achieving big wins for our sportsmen and wildlife enthusiasts: https://t.co/RArmlsaXiF"]["Mississippi public librarians can request donations from my personal library &amp; @librarycongress. More info here: https://t.co/iux0CUyFxb"]["We should...deliver on what was promised to the American people, to relieve those who are hurting from #Obamacare: https://t.co/GoKKkDwj1a"]["I support ending the #sharkfin trade in the U.S. Read the bill here: https://t.co/NXVxctSqRg  #SharkWeek https://t.co/KpHga7aJYx"]["Congratulations to RDML John A. Okon for his promotion to commander, Naval Meteorology and Oceanography Command at @NASAStennis @NavyOceans https://t.co/bxF8MguyWp"]["I support the HELP for Wildlife Act, which expands support for conservation of hunting and fishing habitats. https://t.co/WEXZultA6g"]["REPORT: Mississippi auto manufacturers have created 55K jobs in the state. @MECStateChamber @NSPARC_MSSTATE https://t.co/OmAn0pJkpH"]["Mississippi's auto industry is an economic powerhouse. @NissanUSA, @Toyota, &amp; suppliers have transformed our state. https://t.co/OmAn0pJkpH"]["China should end its ban on American poultry. Today, @SenThadCochran and I urged the @USDA to help: https://t.co/EnedhlsBb5 @chickencouncil"]["Today, I conducted the 5th hearing this year focused on the @USNavy's #355Ships requirement. https://t.co/QPCsTTpIBS"]["Today, I voted to move the Senate a step closer to repealing a collapsing Obamacare system. My full statement 🔻 https://t.co/C9rpOxu8gh https://t.co/zYtwDKbhTr"]["ICYMI: I spoke with @MPBNews’s Karen Brown about my plan to expand high speed internet access in Mississippi. https://t.co/cIGNGuHZWK"]["LISTEN 📢: More Mississippians would gain access to high speed internet if my bill becomes law. @MPBNews https://t.co/cIGNGuZBlk"]["First responders need reliable broadband connections. Closing the rural broadband gap is critical to public safety: https://t.co/UF5jpKBSHw"]["#MississippiMonday: St. Marks Episcopal Church in Raymond, Miss., was built in 1854. https://t.co/tkmNQvSrxS"]["Honored to attend the commissioning of the #USSGeraldRFord. Read my statement here: https://t.co/TQ2qzfakUR"]["The #USSGeraldRFord is a testament to the greatness of American shipbuilding. @HIIndustries https://t.co/apyZ5OiGqN"]["Rural broadband expansion is a top priority for @SenateCommerce. Effective disaster response requires it. https://t.co/UF5jpKTu66"]["#WickerReport: Rural Broadband Expansion Critical for Public Safety https://t.co/UF5jpKTu66"]["Ready to work w/ @realDonaldTrump &amp; @USNavy to ensure more world-class vessels like #USSGeraldRFord join our fleet. https://t.co/w7DJRGWF7V"]["Great to see @CoachJim4UM &amp; @RumsfeldOffice today at the #USSGeraldRFord commissioning! https://t.co/7PKvJEmNsL"]["The #USSGeraldRFord has been commissioned. Congrats @USNavy!"]["At the commissioning of the #USSGeraldRFord this morning in Norfolk w/ @realDonaldTrump. @USNavy @HIIndustries #355Ships https://t.co/rmiz91yTfg"]["The #USSGeraldRFord is equipped to fight emerging threats and project American power abroad. @USNavy @HIIndustries #355Ships"]["LISTEN: My interview on the @IngrahamAngle show. Spoke about GOP plan to vote on healthcare: https://t.co/HnuuCeRVOo"]["TUNE IN: I'll be on the @IngrahamAngle radio show at approx. 8:35a CT. Click here for a list of local MS stations: https://t.co/0qHOjbD8VN"]["The #USSGeraldRFord will be the first in a class of next-generation carriers for the @USNavy. #355Ships https://t.co/Nh4w0E6VHT"]["This Saturday, I will join @realDonaldTrump and the @USNavy to celebrate the commissioning of #USSGeraldRFord @HIIndustries https://t.co/0qZHx6ZfuC"][".@SenJohnMcCain is an American hero. I am praying for his speedy recovery and for the McCain family. https://t.co/WjNqNvx7qq https://t.co/A3mcQ19pTH"]["ICYMI | My interview w/ @JudyWoodruff on @NewsHour. Discussed Senate GOP mtg w/ @realDonaldTrump  on healthcare: https://t.co/MDdd4RRcZ1"][".@realDonaldTrump's @FCC nominees have committed to expanding rural wireless broadband access. https://t.co/Qcq6TAj7G4"]["My wife Gayle helped @the_USO pack snack packs to bring a taste of home to service members serving in remote locations around the world. https://t.co/jQnuZoIGkX"]["I've asked @realDonaldTrump to level the playing field for America's cotton farmers. Read the full letter here ➡ https://t.co/CLPaduzFwp"]["ICYMI | Told @LizClaman today that I have voted consistently to repeal #Obamacare. I want chance to do it again. https://t.co/jNN8Pxe4ks"]["Met w/ 2 groups of @boyscouts from North Mississippi on their way to #BSAJamboree. Proud of these young leaders! #2017Jambo https://t.co/cjg3mdRxXw"]["Encouraging new study shows passenger rail could be restored along the #GulfCoast quickly &amp; at a reasonable cost: https://t.co/sWaObfPhzF"]["ICYMI | My Q&amp;A this morning w/ Gen. Selva about how to help Ukrainians defend themselves against Russian aggression: https://t.co/oWGGTfm3DL"]["Mississippi’s @Taylor_Machine Works represented the state at the White House's #MadeInAmericaWeek proclamation ceremony w/ @realDonaldTrump. https://t.co/5D3BfC68a5"]["Tishomingo State Park is well-known for its swinging bridge dating from the 1930s. @mdwfponline #MississippiMonday https://t.co/WY5K7oRXOc"]["Public storm shelters protect people from dangerous weather. Pleased @fema gave Charleston, MS, $1.2M to build one. https://t.co/vtwS0lQDmy"]["The political theater needs to end. Senate Dems should stop slow-walking @realDonaldTrump's nominees. #WickerReport https://t.co/ADreLp7K8B"]["Amateur radio operators saved lives after Hurricane Katrina. My new bill would help expand their network. https://t.co/1NuaTXMYc7 @arrl"]["Met with a group of ten Explorer Scouts from the @Southaven_MS Police Department. Great group! https://t.co/MrBWYooOzh https://t.co/lUGUhsOG4w"]["Let’s unleash the brain power of this country to solve physiological episodes in @USNavy trainer jets. WATCH HERE ▶ https://t.co/7qDh94oLJn"]["Preventing physiological episodes in @USNavy T-45 trainer jets should be a top priority for @SecNav. @nasmeridianms https://t.co/7qDh94Gn7X"]["Spoke to @CNBC about how the @SenateGOP #Healthcare plan would benefit all Americans. WATCH ▶ https://t.co/nYh8HWiBjI"]["Today, I asked the nominee for @SecNav about the @USNavy’s need for #355Ships. https://t.co/7qDh94oLJn"]["Saddened to learn of the tragic plane crash involving members of our military yesterday. May God comfort their families and friends."]["Read my op-ed w/ @RobWittman on @FoxNewsOpinion: A 355-ship @USNavy should be a national priority: https://t.co/WFH3dZVh1w #355Ships"]["Today, I introduced legislation to boost recreational fishing in the #GulfofMexico. #ModernFish https://t.co/LrffTYQknz"]["Today, I spoke with @WolfBlitzer on @CNN. Watch here ▶ https://t.co/s0I953P7px"]["TUNE IN: I'll be live on @CNN with @wolfblitzer at 12:10 p.m. CT WATCH ▶ https://t.co/V4aoBvlhuo"]["Immaculate Conception Catholic Church in Raymond was built in 1885. #MississippiMonday https://t.co/G7YvysyMvi"]["#WickerReport: America's energy independence is within reach --https://t.co/ztiTVSblia"]["Happy #FourthOfJuly. Today, we celebrate 241 years of independence! (photo by @uscapitol) https://t.co/sXISunmUZs"]["The Hancock County Court House in Bay St. Louis. @msgulfcoast  #MississippiMonday https://t.co/3XWqma39G7"]["#WickerReport: #FAA bill passed by @SenateCommerce last week would improve air travel &amp; rural airports: https://t.co/kfQBZX2AXp"]["We must cut waste, fraud, and abuse from our #healthcare system and give more people a chance to buy real insurance. https://t.co/Xn7IVTOc6P"]["Voted today to reauthorize the #FAA, preserving support for rural airports &amp; protecting citizens from unfair fees. https://t.co/tzE40iHOLK"]["Congratulations to Mike Hurst &amp; Chad Lamar! @realDonaldTrump made the right call nominating these experienced men to be U.S. Attorneys. https://t.co/rWeRDvrSlb"]["The @USNavy is one step closer to #355Ships. My SHIPS Act was incorporated into this year’s NDAA. https://t.co/pDtF4279hN"]["#Healthcare costs are exploding. We have to make the system better. Status quo isn’t working! https://t.co/Xn7IVTwBfh"]["My proposal for a #355Ship @USNavy was included in this years #NDAA. Big win for American security &amp; defense. https://t.co/pDtF42oKGn"]["The threat from #NorthKorea is REAL. Kim Jong Un is dangerous, evil, and unstable. My interview w/ @wolfblitzer https://t.co/okuTkX8vov"]["Joined @cspanwj this a.m. to discuss #Healthcare. WATCH ▶  https://t.co/J45cWeATzl"]["#Healthcare is not one-size-fits-all. People deserve a choice to buy REAL insurance at an affordable price! https://t.co/Xn7IVTwBfh"]["Catch me on @CNN with @wolfblitzer at 12:10 p.m. CT WATCH ▶ https://t.co/i1QEhviKot"][".@realDonaldTrump and @VP are working with @SenateGOP to make #Healthcare better for all Americans. https://t.co/J45cWeSuXV"]["TUNE IN: I'll be on @cspanwj this morning at approx. 7:15a CT to discuss the latest on #healthcare. #Obamacare status quo is not working!"]["#Obamacare status quo not working. Spoke to @CNN RE: yesterday's mtg w/ @realDonaldTrump to fix healthcare. WATCH ▶ https://t.co/1hZrUOnrvZ"]["I'll be on @CNN at 8:15 AM CT. Watch live!"][".@EPA's decision to withdraw harmful #WOTUS rule is a triumph for American farmers, ranchers, &amp; small biz: https://t.co/uiWPiztCzQ"]["Seeking shade under the #crepemyrtle tree. #MississippiMonday https://t.co/IVIGn8EiFq"]["#WickerReport: I am encouraged by the early support for my SHIPS Act. Together we will build a stronger @USNavy. https://t.co/TXaY4PEDih"]["Great news! The #SHIPSAct that I intro'd w/ @RobWittman yesterday has been endorsed by @aircraftcarrier &amp; @amphibwarships. #355Ships"]["I commend @realDonaldTrump for keeping his promises to vets &amp; signing the #VAaccountability and Whistleblower Protection Act into law. https://t.co/hHEsVbpFup"]["Introduced the SHIPS Act w/ @RobWittman to keep us focused on the @USNavy's #355Ship requirement. https://t.co/r0iURjPF22"]["ICYMI: Today, I announced the SHIPS Act w/ @RobWittman to codify the @USNavy's #355Ship requirement. WATCH ▶ https://t.co/gWXeqT2U9G"]["The race to #355Ships starts TODAY. I introduced the SHIPS Act to rebuild our @USNavy fleet. @RobWittman https://t.co/r0iURjPF22"]["WATCH LIVE ▶ Today, I am unveiling the SHIPS Act w/ @RobWittman aimed at rebuilding the @USNavy. #355Ships https://t.co/FNhqS8nhPw"]["@theaward Mamie Albritton volunteered 400+ hours w/ her local animal shelter and honed her shooting skills with @Mississippi4H @theaward"]["@theaward Lane Mitchell volunteered 400+ hours w/ @Mississippi4H to encourage young people to take a stand against bullying. @theaward"]["Presented the Congressional Award Gold Medal to 2 outstanding Mississippi students. Each completed 400+ hrs of service. @theaward https://t.co/aoQiT4npap"]["America's race to #355Ships should start NOW. Building a stronger @USNavy won't happen overnight. WATCH: https://t.co/1XBnri4ymd"]["Strong #manufacturing means a strong U.S. economy. Honored to receive this year's @ShopFloorNAM award. https://t.co/pUEWBc3pyV https://t.co/Y25ylGVLfI"]["I introduced a bill w/ @SenBrianSchatz to expand support for #telehealth providers serving rural areas. https://t.co/ajlNP9E886"]["ICYMI: I chaired a hearing to explore expanding rural broadband service. WATCH ▶ https://t.co/jiWVW8TXMX"]["Rural broadband access is important for job creation, economic development, and digital innovation: https://t.co/dnLC3DD1vj"]["Encouraged to see the City of Tupelo will be building a new  @fema safe room at @TupeloHigh: https://t.co/4I1YspTg83"]["Looking fwd to being on @Morning_Joe this morning at 6:40 AM CT. Tune in!"]["Today, we commemorate the end of a dark chapter. On this day in 1865, the final U.S. slaves were freed in Galveston, Texas. #JUNETEENTH2017"]["Authored new bill to strengthen @GoMAlliance's efforts to protect #Gulf ecosystem: https://t.co/FdWixg4uWd @NOAA @Mississippi_DMR"]["A beautiful sunset over Pickwick Lake. #MississippiMonday https://t.co/XhjFla8KuF"]["#WickerReport: I share @SecretarySonny's commitment to rural America and its future success. https://t.co/aJRuRmHsR8"]["Honored to speak at this year's #MerchantMarineAcademy grad ceremony w/ @SecElaineChao. Congrats to the new graduates! #USMMA @USMMA_Alumni https://t.co/QlgCkn6ngV"]["@USNavy If deterrence fails, our @USNavy forces can provide a decisive response to aggression. #355Ships WATCH ▶ https://t.co/dV45tu8unE"]["@USNavy A strong @USNavy deters aggressive behavior and reassures our allies abroad. #355Ships WATCH ▶ https://t.co/dV45tu8unE"]["@USNavy The @USNavy matters to American economic prosperity and trade. 90% of global trade is by sea. #355Ships WATCH ▶ https://t.co/dV45ttQTw6"]["#China, #Russia, #NorthKorea, &amp; #Iran are building up the size and capabilities of their fleets. We need #355Ships."]["#Russia’s submarine patrols have doubled &amp; those patrols are stretching closer to U.S. homeland. We need #355Ships  https://t.co/ulremOo2ce"]["By 2030, #China will have double the number of attack submarines as @USNavy. We need #355Ships https://t.co/uxXefc4av2"]["We have taken our @USNavy for granted. My thoughts on why we must rebuild our fleet. #355Ships WATCH LIVE ▶ https://t.co/5ueztBQziz"]["My Q&amp;A w/ #SecDef Mattis on #Afghanistan. Asked him to define what 'winning' there means: https://t.co/Gsmre0ARpk @DeptofDefense"]["ICYMI | My first in a series of remarks on building &amp; sustaining a 355-ship Naval fleet: https://t.co/uPeE0OhG3a"]["Speaking on the Senate floor right now about building and sustaining a larger @USNavy. Watch here LIVE: https://t.co/a5Kw3enQRj"]["Greetings from Ruleville, MS! #SunflowerCounty #MSDelta #MississippiMonday https://t.co/7Mqk0WDqUm"]["#WickerReport: We can never truly repay our #Vets, but we CAN ensure they receive quality care from @DeptVetAffairs. https://t.co/9FzGbr1gls"]["Introduced @SecretarySonny at today's #DeltaCouncil mtg. at @DeltaState. Economic development &amp; ag are key to #MSDelta growth! https://t.co/xPYAXyO3we"]["Great meeting this group of #MississippiDelta students today in the Capitol. https://t.co/cBNMBU7K7L"]["Enjoyed celebrating #SeersuckerThursday with my staff and colleagues, @BillCassidy, @SenThadCochran, @amyklobuchar, &amp;  @SenatorIsakson. https://t.co/6LmqFzD2no"]["ICYMI | My Q&amp;A w/ @SecElaineChao about the #FAA and its role in rural America, and the current pilot shortage. https://t.co/80lzkfVxz5"]["My goal as #SASC #Seapower Chairman is to help @POTUS keep his promise for 355-ship @USNavy. https://t.co/UbkB2dNkEV"]["Voted today to make it easier for @DeptVetAffairs to remove substandard employees. Our vets deserve the best care! https://t.co/j82s1KfnbP"]["#Obamacare is crashing &amp; burning. I'm working w/ @SenateGOP to replace it. https://t.co/yEoCFOZqWS"]["We will rebuild America’s defense. South MS is key to fulfilling @realDonaldTrump’s plan for 355-ship @USNavy. https://t.co/UbkB2e4W3v"]["Today, we honor the more than 160K Allied troops who landed at #Normandy and the 9,000+ service members who never returned. #DDay https://t.co/MXSD1tMCf3"]["Kudos to @TrumpHotels for investing in the #Mississippi Delta. @tourclevelandms to be site of luxury hotel in 2018. https://t.co/b0LxJTDTbX"]["Pleased to formally welcome #Montenegro into #NATO. Confident they will make important contributions to #security &amp; stability in our region."]["In this week’s #WickerReport: I agree with @realDonaldTrump’s decision to withdraw from the #ParisDeal https://t.co/MInywtwVDl"]["D’Lo, MS, had more men and women to serve in the armed forces of World War II per capita than any other town in the U.S. #MississippiMonday https://t.co/f8dmSDCTvc"]["Spoke at the Opening Session of American Legion Auxiliary Magnolia Girls State in #Hattiesburg yesterday. Great event to finish the weekend! https://t.co/vDQNikopiF"]["CWallace argues w @ScottPruittOK on @FoxNewsSunday. Won't let him finish his sentences. Paris won't make planet cooler or sea levels lower!"]["AlGore on @FoxNewsSunday says Paris wouldn't solve the problem but would \"send a powerful signal\". We will lose jobs but love that signal."]["50 yrs ago today, Billy Joe McAllister jumped off the Tallahatchie Bridge! #BobbieGentry #GRAMMYs. #Mississippi gal made us proud."]["These #FAA awards are an important investment in #Mississippi’s economic development. https://t.co/41b37Q4iO6 https://t.co/crNIKfjf1r"]["My op-ed in @USATODAY: #ParisDeal would've threatened U.S. prosperity. @realDonaldTrump did the right thing: https://t.co/SxpSDVEJNj"]["Mississippi's #GulfCoast will host development of the next generation of underwater unmanned systems w/ new Ocean Task Force. https://t.co/dZX7HL8xtu"]["Great crowd at today's @Chevron Retirees Association meeting in @PascagoulaCity https://t.co/xHDBYqEr5E"]["Pleased to announce $5M in grants for MS @AmeriCorps. These volunteers have a proven record of improving lives. https://t.co/ZOTSMGanui"]["Spoke with the Mississippi #GulfCoast Business Council this morning in @CityofGulfport https://t.co/07hDoUpgNh"]["Look fwd to being on the @hughhewitt show at 7:30a CT to discuss my effort to help @realDonaldTrump &amp; @USNavy achieve a 350-ship fleet."]["Saddened to learn of the tragedy involving 4 @nationalguardMS members. Confident the community will rally around them and their families."]["Traveled this morning to @OleMissRebels campus to speak with a group of future Mississippi leaders @MS_Boysstate #MSBoysState https://t.co/Eh2piwjabB"]["Powerful story about the origin of #MemorialDay and how it all got started in @VisitColumbusMS https://t.co/aIFQR3HYdi"]["This #Memorial Day, we remember the sacrifices of our nation’s military men and women. #memorialday2017 https://t.co/7OVEdLpXEm"][".@JohnCornyn &amp; I are calling on @EPAScottPruitt to appeal court decision that would create undue burdens on farmers: https://t.co/aFMcgpax18"]["Enjoyed speaking to the Jackson County Economic Development Foundation about the future of @northropgrumman #MSWorks https://t.co/4r6ci6ta4A https://t.co/Eugyb4f2Gq"]["Thanks for the warm welcome this morning, @HIIndustries! #Pascagoula https://t.co/nRmsnT78cY"]["Heard today from industry experts, including Brian Cuccias from @HIIndustries, about achieving a 355-ship @USNavy: https://t.co/HehMkhaNZn"]["Incredible night w/ my wife @WickerGayle, Co-Chair of the @MarchofDimes #MODGourmetGala. https://t.co/0NiU4EjZIw"]["Today I chaired a classified briefing to explore the future of our @USNavy and its need for a 355-ship fleet. https://t.co/1N5zESVKlt"]["Glad to see this group of students from Mantachie High School’s Mu Alpha Theta club. Keep up the good work! https://t.co/eRBoXELli4"]["#MississippiMonday: A rainbow over catfish ponds in the MS #Delta near Doddsville. https://t.co/0OS1VxZAoe"]["#WickerReport: Reaffirming the importance of U.S. mariners; new bill would strengthen @USCG mission: https://t.co/OhwtMFAFGg #MaritimeDay"]["Excellent speech by @POTUS at Arab summit. Unifying and disciplined. A turning point against Islamist terrorism?"]["Dress Rehearsal for Mississippi Metropolitan Dance Academy-- https://t.co/CMF5BQW4aQ"]["A field of volunteers and athletes for yesterday's Opening Ceremony @SpclOlympicsMS #Biloxi https://t.co/K3SuATndLb"]["It was an honor to be a part of yesterday's Opening Ceremony for the Mississippi Special Olympics! @SpclOlympicsMS #somsg17 https://t.co/ZWYmV1wbOL"]["I support the work being done by @AjitPaiFCC &amp; the @FCC to restore the #OpenInternet. https://t.co/uAsKzWZgWU"]["New @USNavy report represents a valuable contribution to the urgent national project of rebuilding naval power. My full statement: https://t.co/wxrGcrqGc3"]["ICYMI | Watch my testimony from this morning's @GOPSenFinance Cmte hearing regarding the promise of #telehealth: https://t.co/BgIolZ8Rve"]["Testifying before the @GOPSenFinance Cmte this morning about the success of #telehealth technologies. #TelehealthWorks https://t.co/enlUKGFLYW"]["#MississippiMonday: A sunny day on #FishboneAlley in #Gulfport. @msgulfcoast @CityofGulfport https://t.co/s5KuGxa0Tn"]["During #NationalPoliceWeek, we remember officers like MS's James Lee Tartt, who have given the ultimate sacrifice: https://t.co/z5ks5lnq2R"]["Congratulations, @OleMissSoftball! #SECTourneyChamps #HottyToddy https://t.co/0LLbrqGWUf"]["Wishing all mothers a wonderful day! My children, grandchildren, and I are especially thankful for @WickerGayle today. #HappyMothersDay"]["Spoke today w/ @LizClaman about FBI Dir Comey's dismissal. @POTUS should replace him w/ ‘Neil Gorsuch type.' Watch: https://t.co/52609nyRfB"]["#MississippiMonday: Holmes County Courthouse in Lexington https://t.co/LMWRBChkg4"]["#WickerReport: Gov't funding bill will advance @realDonaldTrump's agenda; redirect Obama-era spending priorities: https://t.co/DtQ835bbn7"]["ICYMI | My statement after the U.S. House of Representatives passed legislation to repeal and replace #Obamacare: https://t.co/VUS0Y4cTMi"]["On #NationalDayofPrayer, we reaffirm our commitment to protect religious liberty. I support @realDonaldTrump's executive action. https://t.co/cn0fHn5Bve"]["Received updated briefing from @USNavy on issues w/ T-45s. Still working to determine cause of issue. I'll continue to monitor! #NASMeridian"]["Intro'd bill w/ @SenBrianSchatz, @SenThadCochran, others to expand the success of #telehealth to Medicare patients: https://t.co/6V9vKZeiqP"]["My Q&amp;A from today's SASC hearing. Asked about @ArmyERDC, its importance to warfighters, &amp; its work w/ @JacksonStateU https://t.co/YgSRqjNL3N"]["Good news for #GulfCoast shrimpers! USITC voted to extend antidumping orders on frozen shrimp imports for 5 yrs: https://t.co/Ms8ErtB6Ic https://t.co/8SwGit6fP0"]["Honored to receive @TruckSafetyOrg's Legacy Award for my work opposing a nat'l mandate to allow twin-33 ft trucks on hwys. #NoBiggerTrucks https://t.co/egCMGLRFYS"]["Bill to fund the gov't adheres to budget caps. Delivers on impt priorities; increases to mil spending &amp; border security. @realDonaldTrump"]["Congratulations to #NewAlbany on being named 2017's \"Best Southern Small Town\" by @10Best &amp; @USATODAY! More: https://t.co/JxB5kRHbJM"]["In contact w/ state &amp; local officials after yesterday’s storms. Mississippians know how to pull together in difficult times like these."]["An update on my recent fact-finding trip to #NASMeridian, the current state of play, &amp; the plan going forward: https://t.co/g47GPDnYH7"]["My full statement following today's top-secret North Korea briefing at the @WhiteHouse: https://t.co/453drLUkCk https://t.co/J47Gowgkg0"]["Met w/ these creative @GulfportHigh students today. They are representing our state well as #SamsungSolve #STEAM finalists! https://t.co/Ye72IZI6as"]["A Depression-era, utility-style reg structure for the Internet was the wrong approach. Support @AjitPaiFCC's effort to roll back these regs."]["Today is #WorldMalariaDay. US investments around the world have made progress, but more work is needed to end Malaria. https://t.co/g13VGCjXOY"]["It was honor to attend @USDA Secretary Perdue's swearing-in ceremony this morning. The oath of office was administered by Justice Thomas. https://t.co/KMnpGkfpqf"]["I was saddened to learn that Joseph Stone, a US member of an #OSCE mission to #Ukraine, was killed this weekend: https://t.co/OfP4GwZmB3"]["Voted to confirm Sonny Perdue as the next @USDA Secretary. Will work w/ him to protect &amp; promote MS's ag interests: https://t.co/q9Fae9hihk"]["#MississippiMonday: Just one of the dozens of performances at the 14th annual Juke Joint Festival in downtown #Clarksdale, MS. 🎼 https://t.co/lhRR7SMgTH"]["This week's #WickerReport: Signs of progress in @POTUS's first 100 days, including military success &amp; reg reform: https://t.co/31mSaYkrkt"]["Run, Walk, Stroll for Ronald McDonald House @RMHC and cool off with Sno Cones #Jackson https://t.co/vGKn1BFv4A"]["#WickerReport: Job creation &amp; positive investment are signs of rising confidence in the US economy! #economicgrowth https://t.co/9gRiYLh9u9"]["Sciple's Water Mill in #KemperCounty. One of the few remaining water-powered grist mills left in the country. #MississippiMonday https://t.co/fZj1cS9u1V"][".@SenThadCochran &amp; I urge USITC to continue antidumping measures to prevent unfair trade of frozen shrimp imports: https://t.co/NPotyExF2a"]["He is risen! Happy #Easter from my family to yours! https://t.co/ZBBnndCr2Y"]["Navy is also ending the operational pause on Monday. Training flights at #NASMeridian and other flight training installations can resume."]["Fixing this problem is Naval Aviation's #1 safety priority. Standing up a dedicated team for T-45 training jets is a positive step."]["With Coach Gene Stallings at a #FCA event this morning in #Tupelo.  A moving life message for students and adults alike. @fcanews https://t.co/lUPYtqJf4m"]["Great to be part of @Toyota's event to celebrate 10 years in Mississippi! #ToyotaMS https://t.co/ymnf8kjevr"]["Congrats @OSD_OHS on winning the regional Ocean Science Bowl! Good luck in next week's natl competition @DOE_SC_NSB at @OregonState! #Oxford"]["Joined @PhilBryantMS today as he signed a bill to rename MS DEQ building after my friend Alan Nunnelee of Tupelo. Proud to honor his legacy. https://t.co/A2JlSdiyAo"]["Speaking this afternoon at the Stennis Capitol Press Forum in #Jackson. https://t.co/YCaeyn7ayf"]["Read my press briefing transcript following NAS #Meridian visit with Navy officials, pilots to discuss safety issues https://t.co/8PYL36DKBz https://t.co/N93yeOLd2b"]["I will be on the @paulgalloshow this morning at 8am CT -- be sure to tune in! @supertalk"]["#WickerReport: Working to support efforts to protect religious liberty at home &amp; abroad as we approach Easter. https://t.co/xeStVd4zSR"]["Voted today to #ConfirmGorsuch. Senate has ended an unfortunate 14 yr experiment w/ partisan filibusters of judges. https://t.co/1bvDv7EaoD"]["Speaking with John Berman and Poppy Harlow on @CNN shortly. Tune in!"]["Will visit NAS in #Meridian on Saturday to discuss T-45 training jet safety concerns with Navy pilots &amp; officials. https://t.co/IXvsCwLW9A"]["I strongly support Judge Gorsuch. The Senate should #ConfirmGorsuch to the Supreme Court tomorrow. Watch my speech: https://t.co/3Qt5XsVTl1"]["Great visiting with the #Madison Central band today. Glad to hear that they are performing at the Nat'l World War II Memorial tomorrow! https://t.co/FT72fNww0n"]["On the Senate floor discussing why the Senate should #ConfirmGorsuch. Watch here: https://t.co/OajTpl3Esy @GorsuchFacts #SCOTUS"]["Making good on my friendly wager with @SenatorTimScott following the @hailstatewbk &amp; @gamecockwbb game: @MSState cheese &amp; icecream! @ncaawbb https://t.co/bQNu4kGvzq"]["Enjoyed speaking with MS &amp; AL community college leaders this morning during their visit to Capitol Hill! #CommunityCollegeFellowsProgram https://t.co/opILUPokqo"]["MS's Bicentennial is a celebration of our state's great food, soulful music, beautiful art, &amp; wonderful people! #MS200 #MississippiMonday https://t.co/KRheUkc46I"]["#WickerReport: Senate should #ConfirmGorsuch! He's a mainstream pick with extensive experience &amp; widespread support. https://t.co/lLf9O0035g"]["@SenatorTimScott @GamecockWBB .@SenatorTimScott: I'll wager world-class @msstate cheese, ice cream, &amp; peanuts. Let's go, Lady Bulldogs! @HailStateWBK #HailState"]["Kicking off #NavyWeek on the #GulfCoast. Our Navy leaders say we need 350 ships in our fleet. Trump Admin &amp; I agree with that! https://t.co/WDTRHJswos"]["MS bicentennial party in Gulfport. Great place and time to celebrate @HailStateWBK victory over UConn. #NoAprilFooling! #MS200"]["Come on out for Military Academy Day today with @GreggHarper and members of my staff at Madison Central High School! https://t.co/HO9u7rJM9Z"]["Great seeing local commanders &amp; catching up with Gen Boyles at the MS Bicentennial Picnic Saluting the Military. #MS200 @nationalguardMS https://t.co/Y4VbMDuHa5"]["The official unveiling of the Mississippi Statehood forever stamp, saluting Mississippi's 200th anniversary! #MS200 https://t.co/u6GlxS1eIo"]["Spoke during today's @USPS #Mississippi Forever Stamp Dedication Ceremony in #Gulfport in honor of Mississippi's bicentennial! #MS200 https://t.co/VXp4nBHojB"]["Questioned Deputy Transpo Sec Nominee Jeffrey A Rosen about nat’l priorities &amp; Merchant Marine Academy. Watch here: https://t.co/QgHqYimUx9"]["My rural water bill received hearing today, aims to help small communities comply with federal wastewater standards. https://t.co/b4H9gpMmFH"]["POTUS's executive order to review so-called 'Clean Power Plan' is great news for MS's #energy sector &amp; consumers! https://t.co/YJZYISmBlg"]["The #AttalaCounty Courthouse in #Kosciusko, where MS Federation of Women's Clubs was founded in 1898. #MississippiMonday #WomensHistoryMonth https://t.co/fGdKl5m1JA"]["Freedom of speech and the right to assemble are pillars of democratic society. #Navalny &amp; supporters should be released. #RussiaProtests"]["So proud of #LadyBulldogs. MSU on to #FinalFour! First time ever!"]["@DLMiddleton8 @reflectoronline"]["OMG! Tears in my eyes about #Franklin County and #Dr. B's chess champions on #60Minutes. Go, Mississippi!"]["Enjoyed speaking with @BlairEBatson Children's Hospital nurses at @eatPrimos this morning in #Flowood! https://t.co/mIVEMwBDgu"]["Questioned Gen. Scaparrotti @US_EUCOM this morning about ongoing Russian activities in the European region: https://t.co/SVeL8jBLlz"]["Judge Gorsuch has earned respect for his intellect, collegiality, &amp; fairness when it comes to applying the law &amp; the Constitution. #SCOTUS https://t.co/rNCV11tqUh"]["Special relationship between U.S. &amp; Britain is as strong as ever. Those responsible for the #LondonAttacks must be brought to justice."]["Thanks to @NAFSA &amp; @APLU for putting together a terrific panel on #studyabroad and international #education. #simonbill https://t.co/KhgQWhWDme"]["Honored to receive the @USChamber's Spirit of Enterprise Award this morning! #SOE17 #SpiritofEnterprise #Commerce https://t.co/FIBxLf2UYE"]["Judge Gorsuch has shown during his confirmation hearings that, like Scalia, he is brilliant, principled, and fair. #ConfirmGorsuch #SCOTUS https://t.co/osJNlyrDqn"]["#WickerReport: @POTUS is expected to put an end to Obama’s war on coal. Focus should be on U.S. energy independence. https://t.co/mf61mJaNw6"]["Judge Gorsuch is one of the great legal minds in America. The Senate should #ConfirmGorsuch. RT if you agree. #SCOTUS https://t.co/sA2fqwc0nf"]["All decked out for the St. Paddy's Parade in #Jackson with my granddaughter Evelyn and grand dog Rhett! #StPatricksDay https://t.co/GlO1BbQZ4e"]["Met with my friend, @vkaramurza, yesterday. His perseverance for an open, free, and democratic Russia is inspiring. https://t.co/0sxZcwuZgx https://t.co/5Yw2x4nG6c"]["Reintro’d Medgar Evers House Study Act with @SenThadCochran. Designation would be a tribute to Evers’s life &amp; work: https://t.co/Gu93HQiX4Q"]["Students in classrooms across the US need access to a computer science #education. This bill will help achieve that. https://t.co/u7rMpZ5G1R"]["Go to https://t.co/m6nn2Bd8t0 to vote for MS-4 @GulfportHigh Nat'l Finalists in race to win the SFT STEAM competition! #SamsungSolveGPHS 2/2"]["#Gulfport High School was named a Top 10 Finalist in the 7th Annual #SamsungSolve for Tomorrow Contest! #SamsungSolveGPHS @GulfportHigh 1/2"]["Had a productive meeting yesterday at the White House with Lt. Gen. McMaster, @POTUS's National Security Advisor. https://t.co/RxvSyAfLKN"]["#WickerReport: MS’s #seafood industry is a source of local pride, as well as a major economic driver. https://t.co/vdzdSbRX8p #aquaculture"]["The US economy added 235,000 jobs in February and the unemployment rate dipped to 4.7%! #GOP #JobsReport"]["Questioned #CENTCOM Commander, Gen. Votel, about ongoing situation in Afghanistan today during #SASC hearing. Watch: https://t.co/UPsJlZTiW8"]["Intro'd bill with @SenatorDurbin to promote #StudyAbroad, encouraging American students to gain global experience! https://t.co/cKsixiznnt"]["Today the Senate voted for local school boards over a Natl School Board, working to overturn Obama’s #education reg. https://t.co/W3rzBXZIy7"]["Voted for resolution to overturn BLM Rule aka Planning 2.0, returning power back to the states. It now awaits @POTUS's signature. #planlocal"]["Camp Shelby Joint Forces Training Center exercise with @FEMA. #MississippiMonday #Hattiesburg https://t.co/BHuEglPnDh"]["#WickerReport: I strongly support @POTUS’s recent executive order to review the controversial #WOTUS rule. https://t.co/s9xwEM2SWT"]["Introduced bill with @SenatorHeitkamp to help #rural community water systems meet proper water treatment standards! https://t.co/JUXjOxRTsk"]["Honored to serve MS with @SenThadCochran. Spoke on Senate floor to recognize his recent Senate milestone! Watch here https://t.co/02Tuptrz0l"]["Here's my response to @POTUS's first address to a joint session of Congress: https://t.co/uV5ut25JFC #JointAddress"]["Voted to confirm @WilburRoss. His leadership at the Commerce Dept will benefit American workers and job creators! https://t.co/krLIVFWArr"]["#WickerReport: Expecting bold ideas from POTUS's first address to Congress tomorrow! https://t.co/0GyMdVsH6w #jobcreation #economicgrowth"]["Pleased with @AjitPaiFCC's leadership &amp; the @FCC's decision to expand mobile #broadband access in rural America! https://t.co/K4auOboXTq"]["#WickerReport: The new Administration should pursue greater access to #healthcare &amp; #broadband in rural communities! https://t.co/1JBO7Sc2CQ"]["Voted to confirm @ScottPruittOK today. He's an @EPA chief who will listen to both environmentalists &amp; job creators: https://t.co/dRGm3oRC2I"]["Speaking on the Senate floor now on why @EPA administrator nominee, @ScottPruittOK, should be confirmed. Watch here: https://t.co/iL3w8Hwolr"]["Congratulations to #Oxford’s Richard Howorth, the new Chair-elect for the TVA Board of Directors! @TVANews https://t.co/dFKf72F3xs"]["Pleased to see #SeaYear resume at #USMMA – a critical program for midshipmen, mariners, &amp; military officers. @SecElaineChao very helpful!"]["Rural America needs a seat at the table as we work to improve our health-care system. My letter to @SecPriceMD: https://t.co/GCCb38aTu1"]["Working with @SenThadCochran to overturn a rule from the Obama Admin that infringes on #2ndAmendment rights: https://t.co/luFiZf9Cur"]["Discussed Judge Gorsuch, POTUS’s #immigration executive order, &amp; Russia this morning with @SRuhle on @MSNBC. Watch: https://t.co/aqQPCX2RqC"]["Honored to meet with #SCOTUS nom, Judge Neil Gorsuch, this morning. Our country would benefit from his confirmation. https://t.co/m76f4oarrS https://t.co/lyIGVyew5C"]["Pleased to welcome Alabama’s @AGLutherStrange to the Senate! I look forward to working with you."]["It is a new day at @TheJusticeDept. Jeff #Sessions will uphold the #Constitution &amp; the rule of law. Full statement: https://t.co/w51jlFOXyQ https://t.co/wPzCzTmUOS"]["Today I questioned IGs about @FirstNetGov &amp; possible use of @msstate’s #UAS Center of Excellence in #Starkville: https://t.co/Vdlm5Ugj5q"]["Working with @SenThadCochran to dismantle Obamacare's Independent Payment Advisory Board. https://t.co/oV2bfEW2Fp #ObamacareRepeal #IPAB"]["I understand the important role #education plays in our children’s futures. Voted today to confirm @BetsyDeVos: https://t.co/AeVSyuZ7LT"]["Congratulations, @OSD_OMS! https://t.co/GYlo8xHxH3"]["The Gold Coast: 'cross the river - #MississippiBluesTrail marker in #RankinCounty. #MississippiMonday #Flowood #PearlRiver #MississippiBlues https://t.co/5X3G3hxe7H"]["#WickerReport: Judge Gorsuch is an excellent pick for the Supreme Court. Has judicial philosophy similar to Scalia. https://t.co/dnei3iOYqW"]["Mississippians who are planning to visit DC should check my website to learn how they can attend #MississippiMorning https://t.co/QIo0Ve0oqN"]["Spoke with @theJTshow @supertalk to discuss Judge Neil Gorsuch, @POTUS’s pick to fill the #SCOTUS seat. Listen here: https://t.co/1TAQ4Ah2bB"]["Filing Senate campaign reports electronically is simple, efficient, cost-effective, &amp; long-overdue! https://t.co/Il0VxMdNLm @SenThadCochran"]["Questioned a panel of experts about how to reduce unnecessary regulatory burdens like #netneutrality. Watch here: https://t.co/LcYNdSMoPr"]["Rex Tillerson confirmed as Sec of State! Has experience necessary to help @POTUS restore our standing in the world. https://t.co/gadC29GXXa"]["Voters made it clear that the #SCOTUS vacancy should be filled by a jurist in the mold of Justice Scalia. #Gorsuch meets that high standard. https://t.co/ZWt0ICc5Dd"]["Sec Chao has been confirmed! Confident she will use her vast experience to help rebuild our nation’s infrastructure: https://t.co/hjfXUrA3dU"]["#Clarksdale's Josh \"Razorblade\" Stewart, Vietnam veteran &amp; #Blues artist, at the @DBMClarksdale founded 38 yrs ago today! #MississippiMonday https://t.co/AbdIBFXOyw"]["Good luck to @AlcornStateU at Honda Battle of the Bands tomorrow in Atlanta! #HBOB #AlcornExcellence https://t.co/uoh5Zr1Ksg"]["Spent today getting a firsthand look at devastation from the #PineBelt tornado. I know this strong community will work together to rebuild. https://t.co/WTcMHrHa0j"]["#WickerReport: My 'No Taxpayer Funding for #Abortion' bill puts #ProLife legislation on Senate agenda: https://t.co/7tcEvuYAeQ #MarchForLife"]["Great to visit w/ @POTUS &amp; @VP ahead of the President's remarks at the Republican policy meeting today. https://t.co/fprD3gRNgU"]["Congrats to @MSState on receiving this honor for the Mississippi-Morocco partnership! https://t.co/jwAogtEo4K"][".@POTUS is putting Americans first by approving the #Keystone XL pipeline. Supports 42,000 jobs &amp; increases U.S. energy security!"]["Scenes from two of today's @SchoolChoiceWk rallies! At the Mississippi State Capitol in #Jackson &amp; with @SpeakerRyan in DC. #schoolchoice https://t.co/4dp3rFhtNH"]["Senate has confirmed Mike Pompeo to be @CIA Director. He is a well-qualified member of @POTUS' nat'l security team. https://t.co/QkhvEOf5gN"]["Congrats to @AjitPaiFCC on being named the next @FCC Chairman! He is an experienced leader, and he has my full support."]["Just finished a productive call with @DHSgov Secretary Kelly re: support for tornado victims in the #PineBelt. Efforts are moving forward!"]["Worked with @SenPatRoberts, @SenatorFischer, &amp; 34 cosponsors to put a permanent end to taxpayer funding of abortion. https://t.co/48dueqvmmD"]["The #Tupelo Buffalo Park and Zoo, home to over 260 animals. #MississippiMonday #LeeCounty #Buffalo #Bison #Yak @tupelobuffalopa https://t.co/uN5avhlcpx"]["#WickerReport: @POTUS has promised #immigration reform. I'm a cosponsor of 4 bills aimed at ending #sanctuarycities: https://t.co/OVgu1sR90r"]["I am confident that Mississippi families will come together to support tornado victims. I am in contact w/ state &amp; local leaders."]["The Senate has confirmed @POTUS' first two cabinet members! Proud to have cast my vote for #SecDef, James Mattis, &amp; #DHS Chief, John Kelly."]["Congratulations to @POTUS on this historic day! #Inauguration My full statement: https://t.co/v8k92kKtBq"]["So proud of @TheTupeloBand! Looking fwd to their performance tomorrow in the inaugural parade. #Inauguration2017 @TupeloHigh https://t.co/Uzz1L8VwFg"]["Questioned EPA nominee @ScottPruittOK today on negative impact of #CleanPowerPlan, #lumber standards. I support him: https://t.co/UyVXLVV91G"]["ICYMI | My exchange w/ @WilburRoss on creating jobs, lowering taxes, broadband, &amp; cutting red tape. I approve! https://t.co/j3N2yYILPR"]["Honored to continue serving on @SenateGOP leadership team with @SenateMajLdr to advance a conservative agenda. https://t.co/IHK6iFAcDc"]["My wife, @WickerGayle, and I enjoyed talking with @Pat_Boone during today's @60PlusAssoc's reception at the @Newseum. https://t.co/bq1ZKaOxHM"]["Pvt. Manning endangered our troops by leaking classified information. Obama should have kept sentence in place."]["It it time to put an end to #sanctuarycities. I am backing four bills aimed at closing #immigration loopholes: https://t.co/uB0R3LTJAg"]["#WickerReport: President-elect Trump deserves to be equipped with defense team &amp; Cabinet in place on Day One: https://t.co/dIZOHhPKjU"]["In memory of the great #MLK: @NCRMuseum in #Memphis, formerly the Lorraine Motel where he was shot in 1968, 12mi from MS state line. #MLKDay https://t.co/5RqQV9Yl71"]["I was honored to introduce Dr. Lonnie Bunch, director of @NMAAHC, during today's Committee for King lunch at Elvis's birthplace in #Tupelo! https://t.co/Q2bGSsh2cL"]["@SenThadCochran &amp; I have announced two @NatlParkService grants for #CivilRights projects in MS! https://t.co/i1ODAr9Aag #Adams #Tallahatchie"]["About to question Gen Mattis during his confirmation hearing to be our next #SecDef. https://t.co/7pZKoJDrlE"]["In a few mins, I'll be speaking to @BWilliams about why America needs Gen #Mattis to be the next Secretary of Defense."]["Looking fwd to talking to @paulgalloshow at 7:30a CT about the steps the Senate took last night to begin to #RepealObamacare. @supertalk"]["Tonight we begin the process to #RepealObamacare and replace it with something that works. My speech today: https://t.co/WkcN3Tvb26"]["Today I questioned @ElaineChao during her confirmation hearing to be Pres-elect Trump’s Secretary of Transportation: https://t.co/7zsUe1XT0Z"]["Today, fallen service members &amp; their families were honored at this ceremony, where the MS Gold Star Families Memorial was unveiled! https://t.co/bTM7KeDuzW"]["Congrats to @RepTrentKelly, one of the most informed House members on defense issues, on joining @HASCRepublicans! https://t.co/NW0NNDq3uv"]["I am on the Senate floor right now to discuss why #Obamacare is not working for Mississippians. Watch here: https://t.co/iL3w8Hwolr"]["Great meeting with Gen Mattis today. He's an exceptional choice to lead @DeptofDefense during these difficult times. https://t.co/kVB9WcF2Ls https://t.co/i5PbOrepW4"]["John C. Stennis Lock &amp; Dam, impounding the #Columbus Lake in #LowndesCounty. Named after the former U.S. Senator from MS. #MississippiMonday https://t.co/Y8HdDj1cCD"]["#WickerReport: It’s time to repeal #Obamacare. Real change begins with policies that lower costs &amp; increase access: https://t.co/omucDjVGET"]["Great crowd on hand today in #DeSoto County for the investiture of Bobby Chamberlin to the MS Supreme Court! https://t.co/hz8HGxHCy2"]["Obama issued 3,853 regs in 2016. It's impt to pass #REINSAct, which I support &amp; which halts major regs with an annual econ impact of $100M."]["ICYMI | This morning I spoke w/ @CarolCNN on @CNNnewsroom about today's @SASCMajority hearing on cyber threats: https://t.co/OEgJ7r1vTc"]["Met with Vincent Viola, Army veteran &amp; nominee for #SecArmy. Confident that he is the right pick to lead @USArmy. Enjoyed meeting with him. https://t.co/HcORFKQESa"]["Met with @ScottPruittOK today regarding his nomination to lead @EPA. He’s more than qualified for the job! https://t.co/9uxl4ujdA5 https://t.co/qX0y76mKpL"]["Today I announced my committee assignments for the 115th Congress: @SenateCommerce, @SASCMajority, @EPWMaj, &amp; Rules. https://t.co/WDlFRXH96s"]["#WickerReport: I expect major reforms during Trump’s first 100 days, such as Obamacare repeal, SCOTUS nom, &amp; more. https://t.co/vX3fHM1AWe"]["Merry Christmas. In the words of Ronald Reagan, let us follow a higher light and try to be better than our everyday selves."]["The Trump Administration will offer a more supportive and promising agenda in the new year. 2/2"]["Obama's regrettable decision not to veto UN resolution re: Israeli settlements is an embarrassing slap at a steadfast ally. 1/2"]["Sat down with @CFordWTVA yesterday to discuss expectations under a new Congress &amp; President-elect Trump: https://t.co/xazn5cJxy0 @WTVA9news"]["Yesterday I toured the @Navistar assembly plant in #WestPoint. Watch here for @WLOVFox27’s coverage of my visit: https://t.co/0EtQ6zfIs3"]["Enjoyed hearing the Christmas sermons &amp; presenting my book donation today at the #UnionCounty Library Book Club luncheon in #NewAlbany! https://t.co/KzttweCN0x"]["Had a productive morning in #WestPoint at the @Navistar plant. Toured the assembly line where MRAPs are received &amp; spoke with employees. https://t.co/n0xBuvHIDq"]["Thanks to those who came out on a COLD night in #Mantachie to visit with me. Always a pleasure to be in #Itawamba County. https://t.co/pJJvHPNQK7"]["The beautiful Mississippi State Capitol building decorated for the holidays. #MississippiMonday #MerryChristmas https://t.co/ZgMpCidpC7"]["#WickerReport: I've already begun my work for the next Congress with visits across MS to hear directly from you! https://t.co/LtDY2c3jhq"]["$1.15 million awarded to #BayStLouis, #Biloxi, #Gulfport, &amp; #Pascagoula for new passenger #rail service groundwork! https://t.co/K23dxej0TM"]["Festive morning in #NewAlbany helping out with the 5th annual Community Christmas Meal! https://t.co/6jkOwpUr9M"]["Rang the @salarmyjxn bell at the I-55 Kroger in #Jackson yesterday with my daughter &amp; granddaughter. It was a great way to end a great day! https://t.co/tZKhDlsXhY"]["Toured @Colpipe in #Collins. Enjoyed hearing about Collins Junction's daily operations, working to deliver fuel safely across the region. https://t.co/zzzzXniavb"]["Joined former Sheriff Dewitt Napier and others for coffee this morning at Morgan's on Main in #Collins! #CovingtonCounty https://t.co/34PSm9iZnT"]["Pleased to announce that my #EUREKA plan is now law. Hopeful that Dr. Collins can stay on at @NIH to help implement: https://t.co/yKTVQT1TUo"]["My day in the Pinebelt continues: Toured Lowe's Flatbed Distribution Center in #Purvis &amp; MMC Materials ready mix concrete plant in #Columbia https://t.co/SPWKkWsHwG"]["Appreciate @MGCCCBulldogs leadership sitting down with me this morning at the #Perkinston campus. #StoneCounty #education https://t.co/5IhiIdNe7M"]["Are you interested in seeing POTUS sign the 21st Century #CuresAct &amp; my #EUREKA plan into law? If so, watch here! https://t.co/JXNii4Fwvu"]["Thanks to @RepTrentKelly, #Oxford post office will serve as a tribute to 1st Lt Donald Carwile in his hometown: https://t.co/DlmFEvogFO"]["Great to bump into our family friend  Dorothy Roberts while I was in #PassChristianMS today. @DMcEw https://t.co/1sTOHhdTiU"]["#WickerReport: In case you missed Dec 4 @60Minutes, here’s why advanced manufacturers want to call Mississippi home: https://t.co/YqBjaxLFQt"]["Today I heard from members of the #Lucedale community. Enjoyed our visit! #GeorgeCounty https://t.co/qARpFosP2o"]["Had a wonderful visit this afternoon with students, city employees, and local leaders at the @JonesJrCollege campus in #Waynesboro. https://t.co/ZLLJAMkZyH"]["Enjoyed speaking during @Raytheon's T-100 Site Inauguration this morning in the Key Brothers Hangar at the #Meridian Regional Airport. https://t.co/Eymvl9kje6"]["Celebrating 10 years of the Mississippi Blues Trail! #BirthplaceofAmericasMusic https://t.co/9BYDWzwHYt"]["Happy birthday to the great state of #Mississippi! #OTD 199 yrs ago, MS became the 20th state admitted to the Union! #blues #hospitality"]["We listened from my 6th grade class when John Glenn became the 1st American to orbit Earth. A great inspiration."]["Read my @FoxNews Op-Ed on why I support Gen. Mattis. I will fight any attempt by Dems to slow-walk his nomination: https://t.co/TDlesFOoxh"]["My #EUREKA plan to advance Alzheimer's research, part of the #CuresAct, is on its way to the President's desk to be signed into law! https://t.co/sXzuivt6VE"]["Time for new leadership at @EPA! Looking fwd to hearing Scott Pruitt's plan to work w/ @realDonaldTrump to rein in unjustified regs! – RW"]["Happy birthday to @SenThadCochran. Here’s to another year of working together on behalf of our great home state! #Mississippi"]["Senate passed #CuresAct &amp; my #EUREKA plan! Major step toward curing diseases, advancing medical research: https://t.co/24I6vJaE2t #EndAlz"]["75 years after the attack on our nation at #PearlHarbor, we honor the 2,403 Americans who fought and died for our freedom. #PearlHarbor75"]["Sat down with Elaine Chao today. Her experience makes her an excellent pick by President-elect Trump to lead @USDOT. https://t.co/ciuIz8bNYD https://t.co/2EVBhXHzbc"]["ICYMI | Watch this news report from @WLBT's @courtneyannj on my #EUREKA plan aimed @ advancing #Alzheimers research: https://t.co/wTbGzTxHnm"]["The #ECHOact was passed by the House unanimously. Congrats to @SenOrrinHatch &amp; @SenBrianSchatz on their hard work! https://t.co/MA3yqRZFT9"]["ICYMI: Spoke on the #SenateFloor today about the #CuresAct &amp; my included #EUREKA plan. Watch here: https://t.co/0GvyephpDH #EndAlz"]["Great meeting with Wilbur Ross, President-elect Trump’s well-qualified nominee for @CommerceGov Secretary: https://t.co/aIV0bFdBhL https://t.co/i5jm4zLJvC"]["Speaking now on the #Senate floor about the #CuresAct &amp; my #EUREKA plan. Watch here: https://t.co/rWm2IZMPKA"]["Joined @SenCoryGardner &amp; 21 other Senators in sending a letter to POTUS asking him to stop issuing new regulations: https://t.co/jwRWrFUz5N"]["Spoke on @WLOX’s ‘Good Morning MS’ this morning about the #CuresAct &amp; #EUREKA, my Alzheimer’s initiative: https://t.co/Ow0HcSikLS #EndAlz"]["#WickerReport: Alzheimer’s prize competitions, greater FDA transparency, &amp; other priorities included in #CuresAct. https://t.co/CVmpnIrL4x"]["Two tracks appeared by a yellow wood.. #Ginkgo tree in #Jackson. #MississippiMonday #ginkgobiloba https://t.co/7I4EClULjT"]["Congrats to @GreggHarper on being selected by @SpeakerRyan as chairman of the Committee on House Administration! @HouseAdmnGOP"]["Pleased that President-elect @realDonaldTrump has chosen Gen. James Mattis as the next Secretary of Defense: https://t.co/68u6hOp2Je #SecDef"]["My Alzheimer’s initiative #EUREKA passed the House! 1 step closer to becoming law. Senate will act next week. https://t.co/trap8SuLjw #Cures"]["$33M grant going to MS &amp; @UMMCnews to improve emergency communications capabilities &amp; save lives! https://t.co/1hiRyeZM37"]["Spoke on the Senate floor today to express my support of advancing #telehealth with the #ECHOAct. Watch here: https://t.co/MA3yqRZFT9"]["I enthusiastically support President-elect Trump’s nomination of @RepTomPrice to be the next @HHSGov Secretary: https://t.co/UeCNLwheKq"]["Celebrating efforts of #NationalAdoptionMonth by supporting a resolution to promote awareness of #adoption &amp; children in need of a family."]["#WickerReport: Recently visited #Gitmo and I remain opposed to its closure. https://t.co/B6ZvrSJkem"]["Mississippi wildflowers still in bloom. #MississippiMonday #fallflowers https://t.co/FfOuTcsdRT"]["I call on the regime to reject the methods of the past and deliver much needed political and human rights reforms to the Cuban people. (2/2)"]["Fidel Castro may be gone, but the oppression &amp; tyranny characterized by his iron-handed rule continue to grip the island &amp; its people. (1/2)"]["Have a happy &amp; safe #Thanksgiving. Let us give thanks to our men &amp; women in uniform, some of whom are celebrating apart from their families. https://t.co/NUB6SuveqT"]["Fed judge was right to block #OvertimeRule. More red-tape is not the answer to weak job growth. https://t.co/fFdy4IuCHX"]["Honored to take part in a promotion ceremony last night in #Columbus for @USNavy Commander Brad Gore. Thank you for your service! https://t.co/oUb92ADimg"]["As #AttorneyGeneral, @SenatorSessions will be a champion for the #Constitution &amp; the rule of law: https://t.co/zhHtGfXLWd https://t.co/bmBThe8Kqo"]["It's #NationalRuralHealthDay. 1/3 of the rural hospitals, clinics &amp; providers critical to communities are closing. Let's work to #SaveRural!"]["I’m on @FoxBusiness LIVE with @LizClaman. Tune in NOW to watch! https://t.co/7JuCEm8opC"]["Will be on @FoxBusiness LIVE with @LizClaman today at 3pm ET. Tune in to watch! https://t.co/7JuCEm8opC"]["Had a productive meeting today w/ Gen. Boyles during his first official visit to Capitol Hill: https://t.co/iKJgVRVRGz @nationalguardMS https://t.co/cLsnXlW3tn"]["On @MitchellReports to discuss @realDonaldTrump’s transition with Andrea Mitchell. Tune in to @MSNBC now to watch."]["Are you interested in attending @realDonaldTrump’s inauguration ceremony? If so, click here for more information: https://t.co/i2XTDNgkRp"]["#WickerReport: Republican majority plans to continue record of bipartisan achievements. Plenty of work to be done. https://t.co/Ct3NHx0Av1"]["At #Tupelo's Kiwanis Club lunch today. Enjoyed speaking and catching up with friends. @Kiwanis https://t.co/U0bfGLfgqQ"]["In #Nettleton speaking with vets at the local Veterans Day program. Grateful for each &amp; every veteran's noble service. #VeteransDay 🇺🇸 https://t.co/cXict8mrwH"]["Today we pay tribute to the 23M men and women who honorably served and protected our nation. Thank you for your heroic service. #VeteransDay"]["Pleased to speak during investiture of @UMchancellor Jeffrey Vitter at @OleMissRebels Ford Center today. Watch here: https://t.co/TbawWVJ5uR https://t.co/PVvxxNIl4e"]["Happy 241st birthday to @USMC! Thank you for your selfless service on land, at sea, &amp; in the air since 1775. #SemperFi #HappyBirthdayMarines"]["Built in 1970, GM&amp;O Caboose #2994 operated on many railroads. It was restored &amp; is permanently displayed in #Corinth. #MississippiMonday https://t.co/jONTg0QUPi"]["#WickerReport: Casting our vote continues the great American experiment. https://t.co/doT40jWXVb #ElectionDay #Election2016"]["Joined MS delegation in asking POTUS to award MS civil rights leader Medgar Evers the Presidential Medal of Freedom: https://t.co/Ug4vR28Sxf"]["#Obamacare open enrollment starts today. MS premiums likely go up by 15+%. Rising health-care costs highlight need to repeal &amp; replace!"]["Cemetery in #RockySprings, a ghost town in #ClaiborneCounty. Home to over 2600 in 1860. Only church &amp; cemetery remain. #MississippiMonday https://t.co/hQ0f0QBfRs"]["#WickerReport: With #VeteransDay near, MS’s strong military, veteran community honored at #GulfCoast Salute last wk: https://t.co/cd2bhfa4NY"]["New @FCC proposal would help narrow rural #broadband gap! Americans need access to hi-speed mobile wireless service. https://t.co/MpRspIfyH4"]["Participated in today's @MaxxSouth #Broadband press conference announcing their #internet service expansion in #Oxford. #telecommunications https://t.co/BbsZXqxd7F"]["Congrats @GOPSenFinance on the new bipartisan #chroniccare bill. Thanks for seeing the promise of #telehealth and the #CONNECT4Health Act."]["Great news! 8 infrastructure &amp; community dev projects in MS awarded $3.38M funding from @DeltaRegional, $7.2M total: https://t.co/XSGfMgpXc8"]["Last time @Cubs were in the #WorldSeries (1945), south MS native &amp; @MillsapsCollege grad Claude Passeau was the winning pitcher for game 3!"]["@SenatorThadCochran &amp; I asked Obama to negotiate a #lumber deal with Canada to protect US industry &amp; American jobs: https://t.co/nm6hga4xPe"]["Met with @USAirForce Sec Deborah James, @PhilBryantMS, &amp; Brig Gen Janson Boyles at @81trwKeeslerAFB this afternoon. https://t.co/bN9ZznE5nk"]["Joined @SenatorKirk &amp; 12 other Senators in asking @DeptVetAffairs Sec. McDonald to respond to troubling new reports: https://t.co/PUjmboT5m9"]["@NASAStennis recently redid the front of its main administration building in #HancockCounty. #MississippiMonday @NASA @VisitMSCoast https://t.co/sKFWMQl51R"]["#Meridian may host site to produce next generation of @USAirForce trainer aircraft. Chosen by @Raytheon. https://t.co/Ojj1oNyiTG #aerospace https://t.co/te3fofCvrX"]["No child should suffer from polio, a preventable disease. Proud of US leadership, work with @Rotary &amp; partners to #endpolio. #WorldPolioDay"]["#WickerReport: Our fight against cancer is gaining ground. There's no better time for a moonshot! https://t.co/e6FzZWIVMw #breastcancer"]["Today is the National Day on Writing. Writing helps me connect with the Mississippians I’m honored to represent in the Senate. #WhyIWrite"]["Stopped by Joe's Hot Tamale Place, also known as The White Front Cafe, for some #tamales this afternoon in #Rosedale! https://t.co/lWj4j1Fify"]["#CatfishAlley mural in #Columbus, by @MUWedu Prof Stelioes-Wills. Represents alley in 1920s-1960s, at its most vibrant. #MississippiMonday https://t.co/rOJazwqOAf"]["#WickerReport: Oct 7 jobs report cites slow growth, discouraging state of US workforce. Training is key to success. https://t.co/X1ZON3Lxeg"]["Watch my discussion w/ @Dave_Elliott_WLOX, @DougWalkerWLOX on the presidential race, national debt, &amp; war on terror: https://t.co/iEdn0HXtCQ"]["#WickerReport: MS holds 3 of the U.S.’s 49 Nat'l Heritage Areas, generating local revenue and boosting job growth: https://t.co/HwG1vEhKWM"]["Congrats to #Gulfport on being named one of the best places to live in the nation! https://t.co/QXZzAE8jls #MSGulfCoast @VisitMSCoast @MONEY"]["Spoke at the Mississippi #GulfCoast National Heritage Area Launch Event today. @VisitMSCoast @Mississippi_DMR https://t.co/vDsWMN7iPk"]["$2M in @USDA financing to help rebuild #WinstonCounty Medical Center, further restore #Louisville community: https://t.co/VJmmBwRaDN"]["Railroad track running north in #Como. #MississippiMonday #HillCountry #Rail https://t.co/hKX5kd9jAv"]["#WickerReport: Intro’d my #EUREKA bill 1 yr ago to help #EndAlz. Nearly 2/3 of Senate &amp; 78 orgs are now supporting. https://t.co/i8qi0372y7"]["In #Columbus to help kickoff our state's bicentennial celebration. Standing in front of the historic 20 star U.S. flag. @VisitColumbusMS https://t.co/NafPWQCT1z"]["Terrific ceremony in #Oxford today to honor Sheriff \"Buddy\" East - the longest serving sheriff in #Mississippi. https://t.co/gZrdd0KZF4"]["Great news for MS's #GulfCoast! $2M FEMA grant awarded to #Gulfport for improvements to local water systems: https://t.co/gYME28ex1n"]["40yrs ago, the Hyde Amdt began saving lives - over 2 million Americans to date. Protecting lives is not a partisan issue. #HydeSavesLives"]["Working with @SenThadCochran &amp; 41 other Senators to push for Obama admin to abandon proposed estate tax regulations: https://t.co/3DjbEYznjf"]["Looking forward to being on @NewsRadio981 at 7:15a CT this morning! Listen here: https://t.co/3lRvWiWM7f."]["The Senate approved clean govt funding bill that doesn't increase spending. Dems finally dropped political stalling: https://t.co/QkAtn4KIhV"]["Appreciate @SteveDaines &amp; @SenatorKirk supporting my #CONNECT4Health Act, working to grow #telehealth services, lower costs, improve health!"]