["The President should represent all of the people, not just some selected favorites, and should treat others with respect and dignity. These are American values and this White House has strayed from them. https://t.co/TLSaL1yBze"]["While others are choosing to play politics with this issue, here’s the bill I filed yesterday that would permanently ban drilling off Florida’s coast. #ProtectOurCoast https://t.co/m1yqWfQHfl"]["The devil is in the details. We still don’t know what Sec. Zinke really means when he said offshore drilling was “off the table” for Florida, but what we do know is that it was a political stunt and other states should be able to exclude themselves from this plan as well. https://t.co/iChNi6q5yU"]["Florida’s environment and economy shouldn’t be used as political football to be tossed around. Today, I filed legislation to permanently ban drilling off of Florida’s coast. https://t.co/QRmPl3RCMd"]["This political stunt from Secretary Zinke has left us with a lot of unanswered questions. If the administration does in fact have a new offshore drilling plan that takes Florida “off the table,” the public has a right to see it. #GiveUsTheDetails #ShowUsThePlan https://t.co/XgDZ2gV4KR"]["Begs the question: If this was a real deal to take Florida off the table - and not just a political stunt - why doesn’t it apply to other similarly situated states. https://t.co/D1nh9a6GsP"]["I have spent my entire life fighting to keep oil rigs away from our coasts. This is a political stunt orchestrated by the Trump administration to help Rick Scott who has wanted to drill off Florida's coast his entire career. We shouldn’t be playing politics with the future of FL. https://t.co/xJoat2m9az"]["The FCC turned its back on consumers by allowing internet providers to decide what websites people see, how fast they see them, and how much they have to pay for access. I’m standing with my colleagues to force a vote on #NetNeutrality to protect the free and open internet. https://t.co/hCv7ZviKRA"]["I’ve sent a letter to the FDA to ensure that restoring IV bag supplies is a top priority and offered to assist in any way I can to help resolve this issue and to prevent such shortages from occurring in the future. https://t.co/oTp417MmsK"]["Hospitals in Florida and across the country are facing a shortages of IV bags, as IV bag manufacturing facilities in Puerto Rico are still being hampered by the federal government’s sluggish response to Hurricane Maria. https://t.co/0E7kuzFAqO"]["It’s official: Tampa has been chosen as the site of the 2019 Department of Defense Warrior Games! U.S. Special Operations Command at MacDill will be the host. https://t.co/CxDBwJYw60"]["The Supreme Court is hearing oral arguments today involving Georgia’s overuse of water and the effect its having on Apalachicola Bay’s oyster industry. We need a solution that protects this vital Florida industry and the families that depend on it. https://t.co/KYTxB620cS"]["Drilling off of Florida’s coast is a real threat to our state. It’s a risk we shouldn’t have to take. And I’m going to fight it with everything I’ve got. #ProtectOurCoast https://t.co/12dX5seLnx"]["It’s not a question of if there will be another offshore oil spill, but when. That’s why more than 41,000 businesses on the Atlantic coast have expressed opposition to nearshore drilling, and I hope every Floridian will too. https://t.co/0PvQfJqD8n"]["This plan is an assault on Florida’s economy, our national security, the will of the public, and the environment. This proposal defies all common sense and I will do everything I can to defeat it. https://t.co/tYe10AgNbY"]["The United States stands on the side of the Iranian people in their struggle for freedom and opportunity against the oppressive Iranian regime."]["We should be strengthening rules that protect our environment and our economy from offshore oil drilling – not weaken them. This administration seems to have forgotten the lessons learned from the Deepwater Horizon disaster, but I haven’t and neither have the people of Florida. https://t.co/UQN6mVQxlA"]["The half a million fake public comments received by the FCC from Russian sources opposing #NetNeutrality shows Putin’s intent to influence the daily operations of our government, not just our elections. Our democracy is at stake, and we must do everything we can to protect it. https://t.co/JIbmOYpwM8"]["The Trump administration is about to put Florida’s entire economy at risk. We need to protect our state from the threat of offshore drilling, not make it easier for Big Oil to drill closer to our shores. https://t.co/Z8yoCS3tCG"]["Wishing the people of Haiti a triumphant Independence Day and Happy New Year: L'Union Fait La Force! https://t.co/ZK6ThByugw"]["Our fellow American citizens deserve better than this. https://t.co/NhWZhAt5TO"]["Great to hear from so many people in Tampa helping with the recovery efforts in Puerto Rico. I’m grateful for their support and the people of Puerto Rico are grateful for their support. Now Congress needs to get its act together. https://t.co/TfWcFvcro9"]["We shouldn’t be playing games with our coastal communities and the economy of our entire state. We must do everything we can to ensure another disaster like Deepwater Horizon never threatens our state again. https://t.co/Fd4E4Ryh9Q"]["The people of Puerto Rico are our fellow American citizens. They should not be treated like they’re being treated. It’s just not right. https://t.co/IhXMiXMWWD"]["In Kissimmee, Florida with @RepDarrenSoto and @RepValDemings to discuss the state of recovery efforts in Puerto Rico after getting a firsthand look yesterday. https://t.co/F2wG8vAomQ"]["Half of Puerto Rico's economy comes from manufacturing. https://t.co/BoHaWZI6HE"]["Two former governors of Puerto Rico from different parties, Gov. Rosello and Gov. Padilla, are united to make sure Puerto Rico is treated fairly in the tax bill. https://t.co/B2FvrkBvUu"]["Here in Las Piedras, Puerto Rico, which still has no electricity 97 days after the hurricane. https://t.co/YaMcEpRkgz"]["97 days after Hurricane Maria hit Puerto Rico, the roof of Bayamon Hospital is still not adequately repaired. Water leaking into the hallways below. https://t.co/bNPtHcsSEd"]["Just arrived in Puerto Rico with @RepDarrenSoto to get a firsthand look at the recovery efforts. https://t.co/mQOmEtKvfW"]["Merry Christmas and happy holidays to all the brave men and women serving our country. We are all incredibly grateful for your service and wish you and your families the very best this holiday season. https://t.co/FSYpkrNI5g"]["Grace and I want to wish you a very Merry Christmas and happy holidays! https://t.co/lLVH8CiBHW"]["Was a privilege to join all of the volunteers and workers at the City Rescue Mission in Jacksonville today to help serve some pre-Christmas meals to those in need. https://t.co/UWlOwnMsEb"]["I’m proud to be a co-sponsor of the Dream Act and will keep fighting to pass it into law. I will continue working to make sure #Dreamers who came here at no fault of their own are not kicked out of the only country they’ve ever known."]["There is no good reason to halt this study. We must do everything we can to ensure a disaster like Deepwater Horizon never happens again. https://t.co/MiBYwUkLhG"]["The Senate should be voting on a disaster bill tonight. Floridians, especially our citrus farmers, still need help after Irma and Puerto Ricans are still struggling to recover after Maria. I am now more resolved than ever to get this done when Congress returns in January."]["Millions of kids across the nation, and 400,000 kids in Florida rely on CHIP to receive the healthcare they need. We must reauthorize this program before the funds run out in Florida next month. These kids are counting on us and we can’t let them down. https://t.co/9Pm8vDtkFG"]["Here we are at the end of the session and there is still a lot of things that Congress needs to do such as: funding CHIP, providing disaster relief to those impacted by hurricanes and protecting our Dreamers – just to name a few. https://t.co/tUWUQrVpkc"]["Sen. Rubio and I just filed legislation calling on the Maduro regime in Venezuela to release all political prisoners and allow the delivery of humanitarian assistance to help the people of Venezuela."]["Exactly one year ago today we sent Congress our bipartisan Puerto Rico Task Force report on how to help the island recover. Not one of those recommendations was included in the Republicans' tax bill passed today. https://t.co/NfROl2PE5U https://t.co/C9MRDsSehW"]["Thinking about my friend, @SenJohnMcCain this evening. Wishing him a speedy recovery, and look forward to seeing him back in action after the holidays. https://t.co/nsFOuGSyW2"]["I’m about to head down to the Senate floor to vote no on this disastrous GOP tax bill. https://t.co/qJuaaCSV8e"]["Just spoke with VA Secretary Shulkin about helping Florida’s homeless veterans. He told me he was going to personally step in and do what he can to help get these veterans the housing they need."]["Our fellow Americans in Puerto Rico shouldn't be treated as second-class citizens. Yet, that’s exactly what this GOP tax bill does. https://t.co/Q19PrC3sIa"]["Today, I filed legislation to rename the VA Health Care Center in Tallahassee, FL in honor of American hero and Florida native Marine Corps Sgt. Ernest “Boots” Thomas, pictured here guarding fellow Marines as they raised our flag atop Iwo Jima’s Mount Suribachi in 1945. https://t.co/RhuzzMxkHt"]["Sent a letter to Senate leaders today in support of renaming this Kissimmee post office after the Borinqueneers, a highly-decorated regiment of troops from Puerto Rico who fought valiantly during WWI, WWII, and Korea. https://t.co/yYOfgmilRf"]["It would be nice if GOP showed as much urgency for providing millions of kids with health insurance through CHIP, or helping folks recover from hurricanes, including millions in Puerto Rico who are still without water or electricity."]["This tax bill is not for hardworking middle-class families. The real purpose of this GOP bill is to give huge tax cuts to multinational corporations and to make it easier for them to shift jobs overseas. https://t.co/PSdaUl1jHd"]["The Republican-led FCC turned its back on consumers today. By voting to give internet providers the ability to decide what websites their customers see, how fast they see them, and how much they are going to have to pay for access, the FCC just ended the internet as we know it. https://t.co/m8y3zDdUaF"]["Met with several senators from Haiti today about the current situation on the island and why it’s so important that we extend TPS for the nearly 60,000 Haitians currently living in the U.S., instead of sending them back to a country that can’t support them. https://t.co/LDOd7b4YSF"]["#Dreamers are our neighbors, our friends, our valedictorians, and our first responders. It’s time for us, as a country, to come together and acknowledge how they make our nation stronger, instead of trying to kick them out of the only country they’ve ever known. https://t.co/gkUSUwgKF4"]["Drilling off Florida's coast is a real threat to our tourism-driven economy. It's a risk we shouldn't take. https://t.co/XBJ9wp0Un7"]["Met with family members of the sailors lost on the El Faro today to discuss the NTSB’s latest report on the incident and what can be done to make sure another tragedy like this never happens again. https://t.co/45y9e24535"]["USDA forecast shows FL's citrus industry will produce just 46M boxes this year – lowest in decades. If we don’t act soon, we could lose this vital industry. I urge Congress to act now on a disaster package to provide our growers the assistance they need. https://t.co/Vs5BNxHhRS"]["If Congress doesn’t act soon, hundreds of thousands of children in Florida will lose their health insurance. That’s not right. This Republican-controlled Congress needs to get its act together and start working for everyday people, not major corporations. https://t.co/8QZ8a1wPE7"]["The El Faro sinking was a tragedy. The NTSB’s recommendations coupled with the Coast Guard’s investigation clearly show that more can be done to prevent this kind of tragedy from happening again by improving safety. https://t.co/OeoXlIJgW9"]["As I told U.S. Southern Command’s annual Human Rights Initiative conference today, when it comes to Venezuela, now is not the time for the United States to walk away from our responsibility as a leader in this hemisphere."]["The Trump administration is about to unveil a new plan that will open up the entire Atlantic coast to offshore oil drilling. This would be a huge win for the oil industry; and a huge threat to Florida. I’m doing everything I can to block it. https://t.co/CqDskvAjCs"]["People should determine what they see on the internet and shouldn’t have to wait to see certain content. It’s that simple. #SaveNetNeutrality"]["The internet brings people together from thousands of miles away, it educates kids across the nation, and provides countless hours of entertainment. We must #SaveNetNeutrality to protect the free and open internet."]["Today, I sent a letter to FCC Chairman Pai urging him to abandon his reckless plan to radically alter the free and open and internet as we know it. It’s critically important that we #SaveNetNeutrality to protect consumers and the future of the internet. https://t.co/kFJvDZwmtQ"]["The White House just scrapped a new rule requiring airlines to disclose checked-baggage fees BEFORE you purchase your ticket. That’s not right. Consumers have a right to know what they're paying for, before they pay for it. That’s just common sense. https://t.co/AAfuO7O9Ve"]["The VA’s decision to cut more than $460M in dedicated funding from a program designed to help homeless veterans find housing is inexplicable. I have demanded a full explanation from Secretary Shulkin. We should be doing everything we can to help our veterans. https://t.co/VAv8i9zJ5v"]["Millions of Floridians have paid into Social Security and Medicare and rely on these programs as they get older. We must keep our promise to the people of Florida and the nation by working to strengthen these programs — not cut them!\nhttps://t.co/LQ6nB59xSK"]["Today, I’m remembering the brave Americans who made the ultimate sacrifice while defending our nation in Pearl Harbor on this day 76 years ago. These heroes will never be forgotten, and their legacy will live on forever. #PearlHarborDay https://t.co/01lqLixBJ4"]["Jerusalem is the capital of Israel. The U.S. embassy will remain in Tel Aviv for now and the United States should continue to do its part to help bring about a secure and lasting peace between Israelis and Palestinians through a two-state solution."]["There’s no reason why the Sunshine State should be ranked 12th in the nation for solar power. https://t.co/lrbfRFNyRd"]["The Sunshine State should be leading the nation in solar energy production! I just filed legislation to make it easier for homeowners to produce their own solar energy, while making it easier for renewable energy companies to create more jobs in Florida. https://t.co/7oYoIbDt6B"]["This bill is, in effect, a massive transfer of wealth under the guise of tax reform. You can repeat a statement over and over, but that doesn't make it true. This bill does not help the middle class. This bill hurts the middle class, plain and simple. https://t.co/iQP0QwogNp"]["Senate Republicans just voted down my amendment to make the modest middle-class tax cuts permanent, instead of a tax increase in a few years. Proof that this GOP tax bill was never about helping the middle class."]["The Senate is voting right now on my amendment to scrap this disastrous GOP tax bill and force the Senate to come up with a new bipartisan bill that actually helps the middle class."]["If you make $75,000 or less, you will be hurt by this bill. If you are a small business owner, you will be hurt by this bill. If you buy your health insurance in the individual market, you will be hurt by this bill. Those are the facts - plain and simple! https://t.co/p00vbPpmSz"]["Passing this GOP tax bill would be like sending another hurricane to Puerto Rico. We should be working to help Puerto Rico recover, not make things worse. I am urging my colleagues to vote against this disastrous bill. https://t.co/02yEsymKBW"]["This GOP tax bill is not what the American people want, it's what large corporations want. We should be working together to give hardworking middle-class families a tax cut, not a tax increase. https://t.co/0z5JWXRBia"]["Big win for Florida! US Air Force just announced that Tyndall Air Force Base in Panama City will be the home for their new squadron of unmanned aerial drones. The 1,400 airmen and their families that will soon be heading there will provide a tremendous boost to the local economy."]["We have tens of thousands of Puerto Rican evacuees in Florida right now who are struggling to find an affordable place to live. The need for more affordable housing to help those who have been dislocated couldn’t be more urgent and Congress must take action now to address it. https://t.co/kK1dsfRxLL"]["The FCC is planning to end the internet’s Net Neutrality rules that protect consumers’ right to a truly free and open internet. If you’re like me and think the internet should remain a level playing field for all, you need to make your voice heard now! https://t.co/eeiM0wkfMX"]["14 emergency 911 centers in Florida went completely offline during Hurricane Irma. That’s unacceptable. Upgrading our nation’s 911 system is literally a matter of life and death and should be a national priority.  https://t.co/fKN3PExcCd"]["Grace and I wish everyone a wonderful #Thanksgiving. And special thanks to all the brave men and women serving in our military - both here and overseas - who sacrifice so much to keep the rest of us safe. We are ALL thankful for your service!"]["FCC Chairman Pai just released his plan to end the rules that protect consumers’ right to a truly free and open internet. This reckless plan will fundamentally change the internet as we know it!"]["There is no reason to send 60,000 Haitians back to a country that cannot provide for them. This decision today by DHS is unconscionable. And I am strongly urging the administration to reconsider. Ultimately, we need a permanent legislative solution. https://t.co/Ft0bE0itf6"]["Sen. Ron Wyden and I were in Miami and Tampa today to talk with local business leaders about the GOP’s tax plan. We need a tax code that’s fair and works for everyone, including small business owners and hardworking families. This GOP plan does the opposite. https://t.co/oqeRKsA01m"]["The administration’s latest disaster-aid request doesn’t come close to providing what's needed to help people recover from these devastating hurricanes. This request has no money for evacuee housing and barely any money for Florida’s citrus growers. https://t.co/A1RJOVjxUt"]["We got some important Florida projects included in the defense bill Congress passed last night, including an upgrade to the launch infrastructure at Cape Canaveral to support more than one commercial space launch in the same day. https://t.co/Mcnba6vvxd"]["We should work together to cut taxes for hardworking middle-class families, not take health care away from 13 million people just to give the largest corporations massive tax cuts. https://t.co/NmkxI7yrhZ"]["GOP just added a provision to their tax plan that will cause health care premiums to go up 10 % &amp; 13 million to lose coverage. We should be working together to cut taxes for the middle class, not taking health care away from millions just to give tax cuts to large corporations. https://t.co/yljxVtfmYI"]["I met with Kirstjen Nielsen, nominee to be next DHS secretary, this morning and urged her to extend Temporary Protected Status for the 60k Haitians already here in the U.S., instead of sending them back to a country that can’t support them. https://t.co/7IrHoofxd7"]["Thousands of students displaced by Hurricanes Irma and Maria are enrolling in new schools across Florida. We need to make sure these schools have the funding they need to handle this influx of students and provide them the quality education they deserve. https://t.co/ssBCOzd4po https://t.co/0cLpEU9iOt"]["Here we are, working on a tax bill that will inevitably touch every single American in some way, shape, or form. Yet, at the behest of the GOP, we haven’t had any hearings, or time to seriously debate the slew of policy changes in this bill. The American people deserve better. https://t.co/Eq72SzYIcl"]["Filed several amendments to the GOP’s tax bill today to cut taxes for the middle class, make it easier for seniors and small business to file their taxes, and help Florida’s citrus industry replant millions of trees lost to citrus-greening."]["To all the brave men and women who serve in our nation's armed forces: Thank you! 🇺🇸 #VeteransDay https://t.co/VVZIBUbeiq"]["Had a great meeting with a group of veterans in Miami today who shared their own personal stories about why it's so important that we pass the legislation I filed this week, known as the Fair Heroes Act, to ensure our most disabled vets are getting the healthcare they need. https://t.co/o2Mw17foPH"]["There are still a lot of people who need help after these devastating storms. I've called for the federal government to extend these programs to make sure everyone who needs assistance has a chance to get it. https://t.co/0TnF7gN50A"]["Treasury sanctioned 10 more officials in Venezuela today. Still more needs to be done. The U.S. must stand with the Venezuelan people as they fight to restore democracy to their nation."]["Great to see so many Dreamers making their voices heard on the hill today! These kids grew up in the U.S. We should be celebrating their many contributions, not trying to kick them out of the only country they’ve ever known. https://t.co/kGdyyaqcH1"]["We must take action now to ensure that a security breach like the one we saw last summer never happens again."]["Companies like Equifax are holding a financial guillotine over the American people. https://t.co/odL0fJdmpT"]["Had a good time meeting with students from the University of Florida earlier today. We talked about a number of issues, including the need to lower student loan interest rates to make college more affordable. https://t.co/wxOqOf1PiD"]["If credit reporting agencies can’t keep their own information safe, how can consumers trust them to protect their information?"]["We need to make sure consumers’ personal information is protected and enact rules to hold companies accountable. https://t.co/iVqJmsmyep"]["Members of Venezuela’s constituent assembly should be sanctioned until constitutional order is restored, including a ban on importing oil. https://t.co/LEoofgOskT"]["Syria just joined the Paris climate agreement, which means the U.S. is now the ONLY nation not participating. https://t.co/NDrTfzwTeE"]["Gemini and Apollo astronaut Dick Gordon will be missed. My heart goes out to his friends and family. https://t.co/gcr4uXZQos"]["I just spoke with R.D. James, the nominee to head the Army Corps, about completing Herbert Hoover Dike by 2022. https://t.co/wotpRaTqxz"]["I've heard from Floridians who have had trouble applying for unemployment comp. The state website is faulty. Called on US Labor Dept. to fix"]["Regardless of motive or mental state - enough is enough! We have to find a way to put an end to this senseless violence."]["It would be a travesty to send 60k Haitians back to a country that cannot support them. I am calling on Gen. Kelly to prevent this disaster."]["We need a tax code that’s fair. This plan adds trillions to national debt to give tax cut to wealthy instead of hardworking families."]["No one should have to wait 4 hrs. to talk to a FEMA rep by phone, or 45 days for a home inspection. Have asked FEMA to fix this immediately. https://t.co/nQvjo4vXNx"]["These are very serious charges and show why we must be patient about the investigation. https://t.co/z3WZJqNhoM"]["Too many people aren’t getting the help they need after Irma &amp; Maria. I’m calling on FEMA to step up its efforts to provide help sooner. https://t.co/qpRBYbVBih"]["Filed bill to give USDA money needed to help FL farmers who lost crops such as citrus during Irma. GOP Maj Ldr objected. Will keep fighting. https://t.co/VcC8ZlhgDx"]["Here's a good list from USA Today of just some of the things we've been doing lately to help people of FL &amp; PR: https://t.co/CiLmiZoi8u"]["Asked Dept. of Education today to help students affected by Hurricanes Irma and Maria. https://t.co/t3q4l06tCG"]["President nixed disaster money for FL's citrus growers. Says it will be added in Nov. So I just put hold on his nominee to make sure we get."]["This is unacceptable. The state should’ve been prepared for this. I’m calling on USDA to send additional resources and expedite the process. https://t.co/JUq6tevcLq"]["After getting back from Puerto Rico late last night, I took to the Senate floor today to tell the Senate that more needs to be done. https://t.co/3HfplsDyed"]["Met with residents on the ground today in Utuado. I'll continue to fight for the people of Puerto Rico as the island recovers and rebuilds. https://t.co/wH6KfYeJAS"]["In Puerto Rico getting a firsthand look at the damage caused by Hurricane Maria. https://t.co/phR9NblT37"]["Puerto Ricans are suffering. I wrote to HHS this morning to ensure priority locations have the supplies they need most, incl. diesel. https://t.co/c5RzGu0veg"]["Here’s my full statement in response to the latest moves to undermine the Affordable Care Act: https://t.co/tm4iqEPhAy"]["10 hurricanes in 10 weeks. I want to make sure any NOAA admin. will put public 1st in delivering weather forecasts. https://t.co/2Gs9pkg3gz"]["Last week Sen. Rubio and I led FL delegation in requesting additional funding that isn't included in today’s package https://t.co/VQQ24JPal8"]["The disaster relief package is a critical first step, but we will need more funding to support relief efforts like CDBG in FL, PR &amp; USVI."]["Joined Reps. Demings &amp; Soto for FEMA Disaster Assistance Workshop this week. Sign up for Irma assistance before 11/9 https://t.co/05FrkGEaK6"]["Just filed bill to create a FL gas reserve to ensure residents and first responders have access to gas they need before and after a storm."]["Good news for Florida’s Space Coast. Just spoke w/ Air Force Gen. Monteith - he confirmed the Cape is ready to handle two launches in a day. https://t.co/6PsS75qGv4"]["Have just filed legislation to provide some much-needed tax relief to the victims of hurricanes Irma and Maria."]["Have called on Senate Finance Committee to investigate the deaths of 12 seniors at a nursing home in Hollywood, FL https://t.co/bAWN6jmFXI"]["There is a crisis in Puerto Rico. Fuel, water &amp; medicine sitting at the docks. Need immediate response by US military. Where is the cavalry?"]["Spoke with Gen. McMaster. Urged U.S. military to organize and distribute food &amp; medicine to devastated and inaccessible areas of Puerto Rico"]["Just took to the Senate floor to call for an aid package to help people in Florida, Puerto Rico and U.S. Virgin Islands. https://t.co/HiWfUsxojc"]["Thanks @SenatorCollins. We should be focused on finding real bipartisan fixes to the ACA, not this bill that cuts $1 trillion from Medicaid."]["Just spoke to military leaders in charge of hurricane response. Urged them to send additional support to Puerto Rico &amp; USVI in wake of Maria https://t.co/Joji221u16"]["Am calling on U.S. military to send additional search &amp; rescue, medical and construction teams to Puerto Rico in wake of Maria."]["It’s a bad bill. We need to fix the current law instead."]["The latest Republican attempt to kill the health care law eliminates health insurance for 30 million and ends Medicaid as we know it."]["Our staff will be in Collier, Miami-Dade, Orange and Pinellas counties tomorrow if you need help registering with FEMA. https://t.co/0VNytat7Ml"]["On my way to Ft. Pierce where dozens of families are still living in shelters because their apartment complex flooded during Irma."]["FEMA opening a Disaster Recovery Center in Hillsborough county tomorrow at Hillsborough Community College, 6437 Watson Road in Riverview."]["If you need help registering with FEMA, our staff will be in Flagler, Lee, Manatee, Miami-Dade, Polk, Putnam and Volusia counties tomorrow. https://t.co/JqLcyBWNw1"]["Was at the Sunshine Key RV park in Big Pine Key today meeting with local residents who were hit hard by Hurricane Irma. https://t.co/G4HzW8CKqz"]["Heading to Marathon and Big Pine Key to meet with local offficials and get a firsthand look at the damage caused by Irma. https://t.co/1PojF7CMcK"]["Spoke with Gov. of Puerto Rico yesterday. Offered to help however we can, as our thoughts and prayers are with the people of Puerto Rico. https://t.co/TIz9Vf4C7C"]["If you need help with FEMA, our staff will be in Clay, Hardee, Hendry, Highlands, Lake, Marion, Pasco, Sumter &amp; Suwannee counties tomorrow. https://t.co/6hXiIv3qUL"]["Have called on airlines to cap airfares for those fleeing Hurricane Maria: https://t.co/MkfhoACSKe"]["To all of the troops, volunteers &amp; first responders out there helping those in need: Thank you! #FloridiansHelpingFloridians #FloridaStrong https://t.co/Azwcgi7oQt"]["I was just in Lehigh Acres inSW FL They need FEMA mobile office to get help. No power and no internet! The poorest often get hit the worst."]["Meeting with residents and helping volunteers hand out food in Apopka, Florida today. https://t.co/zIrKR7DQEI"]["In High Springs, Florida where flooding from the Santa Fe River has closed at least one major roadway. https://t.co/EvsOhetGBV"]["VA has confirmed it is making beds available to Florida residents affected by Irma."]["In Archer, Florida, a small town near Gainesville, meeting with residents impacted by the storm. https://t.co/QnGJSzZGJn"]["Spoke with the head of VA. He has given me authority to move anyone in a nursing home without power into a VA hospital if necessary."]["I also sent him names of nursing homes without power so we can quickly get power restored and keep our seniors safe."]["Talked to HHS Sec. Price today &amp; asked him to do everything in his power to keep FL's most vulnerable safe, esp. those in nursing homes."]["In Belle Glade with @marcorubio handing out meals to those who still don't have power after Hurricane Irma. https://t.co/FWuK7pv6QY"]["Long gas lines along U S 27 in south central FL. Urged DOT to provide gas ASAP."]["This is inexcusable. I’ve asked HHS to look into this. https://t.co/ke8CGy3gHo"]["In Lake Wales now meeting with citrus growers who have lost up to 75% of their crop as a result of Hurricane Irma. https://t.co/lNpIOTxF37"]["Getting on a Coast Guard C130 now to get firsthand look at storm damage in the Keys and along Florida's Gulf coast. https://t.co/CUsQ1xqCj2"]["If you need help from my office, please call (407) 872-7161 or contact us at https://t.co/ENXdbcELFN"]["President just approved FL's disaster declaration, which means the $15 billion we passed this week will be available to help FL after Irma."]["Here's the latest 11 p.m. advisory from the National Hurricane Center: https://t.co/aG6U5dahkB"]["Irma is shifting more towards Florida's west coast. Here's the latest 8pm track from NOAA: https://t.co/sk7rP0SMXv"]["Here's the latest 8 a.m. track just released by NOAA: https://t.co/eCWKomIFox"]["Have asked FEMA to preposition fuel supplies along evacuation routes to help those trying to evacuate: https://t.co/gXgOwQ8Xam"]["Here's the latest 5pm advisory just released by NOAA: https://t.co/E1XHEv1M2k"]["Met with emergency management officials in Miami and Palm Beach today - both say they are as ready as they can be for this monster storm. https://t.co/Zk6uO8felG"]["Just spoke to the commandant of the Coast Guard – they are moving assets in and around Florida now and will be ready to respond when needed."]["DREAMers are our young neighbors. It’s time to acknowledge their many contributions, not deport them from the only home they’ve ever known."]["“Confederate statues belong in a historical museum or cemetery, not in a place of honor.”"]["I can speak for so many that we are thankful for the bravery, dedication and protection of our law enforcement."]["My heart and prayers go out to the families of Officer Baxter and Sgt. Howard, and the Jacksonville officers."]["Looks like general John Kelly is taking control of the White House. That is a good thing."]["There is no defending white supremacists, neo-Nazis and the KKK."]["I condemn the hatred and lack of respect for others.  It turned into fatal violence which must not be tolerated."]["We must continue to stand with the people of Venezuela as they fight for their democracy."]["John is one tough hombre, and is my friend. I'm praying for you, John."]["This new GOP healthcare bill is just as bad. If approved, this bill will hurt a lot of Floridians and for that reason alone I will oppose it"]["Net Neutrality protections are essential to ensuring that the internet remains free and open for all."]["Just filed legislation to cut student loan interest rates and allow borrowers with existing loans to refinance their loans at a lower rate. https://t.co/rV8IDZ6BIw"]["Feds just extended comment period on plan to allow seismic testing in the Atlantic. Submit your comments here: https://t.co/cItPHKjKlB"]["Now we know why they kept this bill secret – it’s just as bad as House bill. We should be working together, not plotting behind closed doors"]["We are all Americans first, regardless of party. We are all on the same team. And we’re praying for those injured in this heinous attack."]["The FBI conducts some of our most important investigations and needs a professional willing to stand up to the administration when necessary"]["Sea-level rise is a real threat to Florida. If the U.S. stops fighting climate change, the rest of the world will too and FL will be at risk"]["This Republican health care bill is a disaster. We should be focused on improving our nation’s health care system, not making it worse."]["If true, this is another piece to the puzzle and it does not look good for the White House. https://t.co/wo2ZG8QsPi"]["Now it is more clear than ever that we need an independent commission to get to the truth of Russia’s interference with our election."]["Working on legislation to speed up Everglades restoration and build new reservoir south of Lake O. Will introduce later this month."]["This GOP healthcare plan will make it nearly impossible for anyone with a pre-existing condition to get health insurance. I won’t support it"]["The Pentagon agrees: expanding oil drilling in the Gulf of Mexico could threaten our nation’s military readiness. https://t.co/NdeELYKbt2 https://t.co/j39K0IfMbf"]["Gutting the FCC’s net neutrality rules robs Americans of protections that preserve their access to the open and free internet"]["Just sent this letter to State Dept urging it to open a temporary passport office in Miami while repairs being made: https://t.co/hp7xnkzCNm"]["I support the admin’s strike on the air base that launched the chemical attack. I hope this teaches Assad not to use chemical weapons again."]["I had a great time yesterday speaking at Rep. Val Demings’ church in Orlando along with Sen. Cory Booker (D-NJ). https://t.co/VEkDVc4MrZ"]["It is wrong to take away health insurance for 24 million people, as well as increase the cost to seniors."]["Today marks 10 years since Bob Levinson disappeared near Iran. We’re renewing our call for Iran to help return Bob to his family. https://t.co/1yvqxCvfss"]["Sessions should recuse himself. There should be an independent commission and special prosecutor appointed to get to the bottom of this."]["Scott Pruitt’s ties to the oil industry are deeply concerning and Floridians can't afford the risk. I’ll vote no on his nomination. https://t.co/SwkTt9CU7U"]["Good news for Jacksonville! A new squadron of Navy drones – and 400 sailors – are heading to Mayport."]["Brought Sen. Thune to the Everglades today to show him what we’re restoring – got to show him something else you won’t see in South Dakota https://t.co/DZfEr2f2wv"]["A lot happened in Washington the past few days. My privilege is to represent the people of Florida.  https://t.co/4CWXWEJix6"]["We lost a real hero Monday. Gene Cernan, the last on the moon, like Neil Armstrong, the first, was only 82. Pictured w/ Sen. Hutchison &amp; me https://t.co/lMgSP0Gjb5"]["Our thoughts and prayers are with the family of the Orlando police officer killed in the line of duty this morning."]["John Glenn was the pioneer. He was the one who paved the way: https://t.co/qLygtV6AYr."]["Enjoyed meeting the Marines who stopped by the Senate to collect toys for children in need this holiday season. Thanks for your service. https://t.co/XPtq9N37xN"]["Now that Fidel is gone, U.S. should press hard against Raul and support the Cuban people until he provides basic rights and freedoms to all."]["Congratulations to Miami Dade College President Eduardo Padrón on being awarded a much-deserved Presidential Medal of Freedom yesterday. https://t.co/34zwRTY9zp"]["State of Florida is reportedly selling drivers’ private info to companies – I’ve asked Justice Dept. to investigate: https://t.co/0rSLFXZlDY"]["At Palm Beach EOC. Army Corps says no issues with dike now, but more than 5 inches of rain north of Lake O could start to threaten it. https://t.co/0JxlILTk1Q"]["Good news in fight against #Zika: the Senate just approved $1.1 billion to fight the virus, and the House is now expected to do the same."]["Our thoughts and prayers are with the people of Istanbul. There should be no place for such senseless violence in a civilized world."]["Had a good conversation with CNN’s @AlisynCamerota about the new bipartisan gun bill we introduced. Here it is: https://t.co/q07HwyYqQJ"]["I just filed legislation to ensure the FBI is alerted if a terrorism suspect buys a gun; here are the details: https://t.co/edK4A4AWNI"]["Florida's beautiful beaches and tourism-driven economy cannot coexist with oil rigs off its coast. https://t.co/aopXrdTclv"]["The President today signed our bill to speed up the search for a Zika virus cure. With more FL cases today, we must stop this virus ASAP."]["Congrats @SpaceX on a successful launch and the first-ever landing at sea. Amazing!  #GoingToMars"]["It’s the last day to tell @USFWS your thoughts about taking manatees off the endangered species list. Comment here: https://t.co/sPZkkm5VTj"]["It’s official: Hurricane Hunters will stay in Tampa Bay. NOAA announced that it’s looking to relocate them within 50 miles of MacDill AFB."]["The noose is being tightened on ISIS in Syria and Iraq. The killing of two top ISIS leaders is evidence of that progress."]["The Senate has a responsibility to fill Supreme Court vacancies and I hope we’re given a chance to fully consider the president’s nominee."]["Today marks nine years since Bob Levinson went missing in Iran; it’s time for Iran to finally fulfill its promises to help us bring Bob home"]["NTSB just announced it will search again for El Faro’s missing data recorder. https://t.co/00U6Cb7dbY"]["Today we remember the Challenger crew for their courage, sacrifice and pioneering spirit. https://t.co/BC2nJhTvfL"]["We won one little battle today: https://t.co/Zh6iVfugX5."]["Congrats @SpaceX on a successful landing last night. This is a big deal for the country and gets us even closer to our ultimate goal: Mars!"]["This evil must be met with force that is smart and intelligence that is deep."]["Rhea Chiles was a great First Lady, partner to Lawton and friend to many of us. One of her many legacies is Florida House, our embassy in DC"]["Great meeting with Oscar-winning actor Denzel Washington today.  He’s a great advocate for @BGCA_Clubs. http://t.co/NFlUZVEA3c"]["Finding water on Mars boosts likelihood of humans one day being able to live there."]["I'm sorry Dr. Claudia Alexander isn't with us to see all these Pluto pix. The NASA trailblazer passed away July 11: http://t.co/gLG7qqvBIK"]["Today marks 46 years since first human on moon. http://t.co/11Ejl6SzpR"]["Congratulations to @NASA on its unmanned mission to the edge of our solar system. Now let's send humans to Mars."]["Three major computer malfunctions on same day give appearance of an attack, serve as reminder Congress must pass a cybersecurity bill"]["What happened today is why I hold my breath and say a little prayer every time we launch a big rocket."]["The Supreme Court has ruled and gay marriage is the law of the land. I support this decision."]["Hopefully, extremists will now stop trying to dismantle the Affordable Care Act and instead join us in trying to improve it where needed."]["Florida is again under siege from Big Oil. http://t.co/9JXCSn0OdK"]["UCF for 2nd year in a row wins national title in cyber-defense competition. http://t.co/Cq0NoJ11Di"]["Castro should not be rewarded while there are ongoing human rights violations in Cuba. http://t.co/nMXvnBIiQF"]["I have a great personal and professional relationship with Marco. But I am all in with Hillary."]["Science shouldn't be muzzled. http://t.co/gxLibsNS1U"]["Reports say Florida led the nation in Obamacare sign ups. http://t.co/t9csEwO5Jc"]["Just filed a bill to increase penalties for ID thieves who commit tax fraud. Here are the details: http://t.co/5K5cvrRoHN"]["Pleased to have @ConsumersUnion support of our bill protecting kids from poisoning. http://t.co/58lgmdaDG9"]["Happy to report @ConsumerFed support of my bill to make liquid nicotine packaging child-resistant. http://t.co/hKnxKwlA9D"]["I’ve asked @TheJusticeDept to investigate the deaths of 51 kids at the Dozier School for Boys in Marianna, FL: http://t.co/hV7Edxk5l1"]["ESPN'S Stuart Scott had an amazing ability to connect with people including many who remember his time broadcasting in Orlando."]["Florida has officially surpassed New York to become the third most populous state in the country."]["I shot this video of #orion launch this morning @nasakennedy @nasa_go4launch http://t.co/vRxh74Yv9L"]["#Orion is a star now"]["Today marks fifth year of Alan Gross’s wrongful imprisonment in Cuba. On my way to the White House now – will discuss case while I’m there."]["Saturday is National Adoption Day. Remember, there are an estimated 100,000 kids in the U.S. in need of a good home. http://t.co/Yw3Hurj30w"]["Another campus shooting. Yet we still haven't started even a dialogue on keeping guns from criminals and the mentally ill."]["Demanding answers from auto officials at airbag hearing. Watch here now: http://t.co/uclXxnH6rn"]["Tomorrow I’m asking officials for answers about deadly exploding airbags at 10am Senate hearing. Stay tuned for a link to watch."]["Congrats to our European partners in space exploration for landing the first-ever spacecraft on a comet."]["I’ve asked carmakers to give owners loaners or cover rental costs until all defective airbags are fixed. http://t.co/GnXqivSPHg"]["The situation in Dallas has convinced me it’s time to set up White House war room led by Ebola point person. http://t.co/VctePwIIvK"]["Proud of Jayne Ellspermann from West Port High School in Ocala, named 2015 National Principal of the Year!"]["U.S. must do more to combat the Ebola outbreak, including restricting travel visas from affected countries: http://t.co/gFv6LAFO6h"]["A major test in Congress for the effort to regulate e-cigarettes. Watch here now: http://t.co/LQJe9s0kyb"]["Should be no safe place for ISIS, so I just filed legislation to authorize use of airstrikes against them in Syria. http://t.co/7AB3hEnRj4"]["This was the right immigration call by the president given the tea party’s stranglehold on House GOP."]["Tune into @CNN at 8am to hear more about the bill I'm introducing next week to give the president clear authority for airstrikes in Syria."]["Tonight at 6:30, I’ll be speaking with @WolfBlitzer on CNN about the threat of ISIS."]["I spoke with @RonanFarrow on MSNBC today about my legislation to give Obama clear authority to strike ISIS in Syria. http://t.co/hZJt4vcGQK"]["Just back from international meetings on ISIS and Ukraine and will give update on @OutFrontCNN tonight"]["Sent a letter to Sec. Jewell to make known my opposition to oil drilling off Florida’s Atlantic coast. Now, urging local leaders to do same."]["The decrease in U.S. drug fighting in Central America is the root cause of that region’s child exodus: http://t.co/1eWyf74H8T"]["We’ve got to keep kids from being exposed to this new kind of poison. http://t.co/Oe0uyQN77L"]["U.S. should consider use of drones with hellfire missiles if Iraq nears collapse."]["Was great to watch president sign our bill awarding Congressional Gold Medal to veterans who served in an all-Puerto Rican unit of the Army."]["I got a first-hand look at one of three spacecraft competing for America's next-generation commercial launch system. http://t.co/dYt4y15Izu"]["A lot of heads should be rolling. There’s something in the VA’s culture that isn’t responding to serve our vets in the way they deserve."]["Maya Angelou’s soul remains in the indelible words she left behind."]["Developing and assembling long-range strike aircraft is a new beginning for Florida's Space Coast. http://t.co/EwMtfu6sJT"]["A report I asked for links various illnesses hitting some Floridians and defective Chinese drywall in their homes. http://t.co/YzcoaHV90x"]["“Florida lawmakers dilly dally while constituents die”  http://t.co/Rtwc1AgQhd"]["U.S. shouldn't deal with Palestinian govt. that includes Hamas unless Hamas, among other things, renounces violence and recognizes Israel."]["We're celebrating National Park Week - thanks to those with foresight to protect and preserve our country's natural resources and beauty."]["U.S. Senate Commerce Committee hearing in FL today to explore the effects of rising sea levels at \"ground zero\": http://t.co/WhrEt7Cp93"]["Hope you can take a minute to read my column in the Tampa Bay Times: http://t.co/dhXmrvDzbn"]["We should breathe a bit easier thanks to court ruling. http://t.co/d94b1TBXa1"]["I’m co-sponsoring the Paycheck Fairness Act because equal work deserves equal pay. http://t.co/luluh2yUKF"]["4 yrs into wrongful imprisonment, Alan Gross announces hunger strike. We must keep pressure on Cuba for his release. http://t.co/z7MlFaKKjR"]["http://t.co/DGX6b5IRNW is new, improved and better-equipped to help constituents. Check it out (on your mobile device, too)!"]["Service for Gov. Askew today was a fitting tribute and called to mind his unwavering commitment to integrity in public office."]["The flood insurance bill is not everything I wanted for homeowners, but it’s significant protection from unconscionable rate increases."]["Getting ready to vote on flood insurance.  Should be in about 5 mins."]["If unchecked, rising sea levels threaten many coastal areas where some 14 million Floridians now live. http://t.co/1J0x8FmTU4"]["Today marks seven years since Bob Levinson disappeared while working in Iran. We need to keep pressure on government there to get him home."]["Pleased @CommerceGov responded with $6.3 M to my request for disaster funding to decimated Apalachicola Bay oyster industry"]["Today marks 52 years since John Glenn became the 1st American to orbit the Earth."]["With Dr. Haru Okuda at VA medical center in Orlando where simulation training will help save vets' lives: http://t.co/CXu7VRgw16"]["Met with UF students today to discuss Gov. Scott’s attempt to suppress the vote on college campuses. http://t.co/GGj4eKFQWd"]["Extension of unemployment benefits defeated due to lack of GOP votes. http://t.co/qiTcRdXVwj"]["Looks like farm bill with funds to save Florida oranges from citrus disease will win final passage this afternoon."]["Withlacoochee River Electric Coop.'s Billy Brown and I at the opening of the new Lacoochee Community Center today http://t.co/Dx4USYo94w"]["USF team finds 55 bodies in unmarked graves at shuttered Florida reform school: http://t.co/mqQU0UbPZY"]["In remembering Challenger crew today, let’s also remember crews of Apollo 1 and Columbia. http://t.co/rBBilMJr9N"]["The Senate is now scheduled to make an initial decision on curbing flood insurance rates on Monday, the 27th."]["Stunned that GOP House leader says he’ll block our efforts to reduce flood insurance rates.  http://t.co/Hqo6ElCzZq"]["Feds to help Florida's unemployed with delayed benefit claims. http://t.co/bKekRRupKC"]["In the Senate today we’re honoring FSU for winning the 2014 BCS Championship! http://t.co/WRbgtIqMcr"]["It’s been four years (yesterday) since that huge earthquake ravaged Haiti and killed 230,000.  Let’s keep the victims in our prayers."]["Having a reunion this weekend with the shuttle crew I had a blast with in January 1986. http://t.co/es5d8OunU4"]["Keeping the International Space Station up for the next ten years is a big deal. http://t.co/5ctRvIlqdw"]["Proud to see Florida is one of the states that produced the most @PeaceCorps volunteers this year."]["Hats off to 6-year-old Connor Johnson, on a mission to save NASA: http://t.co/XClZdKMpfb"]["Nelson Mandela was one of the great pioneers of human rights whose courage inspired people around the world."]["Health reform law was meant to help uninsured get coverage, not cancel policies folks liked. President made the right decision today."]["The only certain hurdle we have to overcome to fix the budget is excessive partisanship. http://t.co/E4H9kUv5PV"]["Aging Committee today investigating impact of HIV/AIDS among elderly. Hearing live on Web at 2 p.m. http://t.co/4e6CSLNzQq"]["After more than 36 years &amp; billions of miles, NASA confirms first human-made object has entered interstellar space: http://t.co/cokxtjTEFT"]["We’re one step nearer to closure, now that scientists are getting help with reform school investigation. http://t.co/PUUBPNyfYC"]["After chemical weapons use, military action with NATO and our regional allies against Syria's Assad is appropriate."]["Florida’s oyster industry got a little help today. Hopefully there’s more to come after tomorrow. #sayfie http://t.co/gWRrDZCn5T"]["FL Cabinet did the right thing today. Nothing can bring these boys back, but I’m hopeful the families will now get the closure they deserve."]["' hope governor and Cabinet OK the investigation at Dozier when they meet Aug. 6. Here’s the story: http://t.co/kPCUEzGqNS"]["We lost a brave soul this past weekend. Thank you Col. 'Bud' Day for a lifetime of bravery &amp; service to our country. http://t.co/oVOZv5HOgN"]["Last spoke to @AstroMarshburn as he was orbiting 200mi above Earth! Good to welcome him &amp; @Cmdr_Hadfield to DC today. http://t.co/lvyrxE83Dv"]["Old South FL power plant gone in less than a minute to make room for one that burns cleaner fuel. http://t.co/gf9rXXD0Yj"]["Too many children unaccounted for at Dozier.  Families have a right to know.  If the gov. really wanted to do something about it, he could."]["I think it’s time for common-sense solutions to the sequester and budget stalemate. What about you? http://t.co/NYAQzDjBAu"]["A little story about keeping imagination alive. http://t.co/iB8yqstSng"]["What damage has been done by the Snowden leaks? Read my column in The Orlando Sentinel. http://t.co/jy0zvvmcsS"]["I believe the immigration bill the Senate just passed is a balanced, bipartisan and common-sense step in the right direction."]["Take time to thank a veteran or soldier today in honor of @USArmy’s 238th birthday."]["FAA says 14 small airport control towers in Florida will stay open. Good news: they are important to public safety and local economies."]["What's happening right now aboard the space station? Watch our LIVE video uplink with some of the crew here: http://t.co/tytusy9ib0"]["I believe Syria’s President Assad must go.  http://t.co/I6RMC3dIfs"]["Human space exploration pushes us to the limits of our creativity. We want to get back into that business: http://t.co/Q3uZzCxQW5"]["Sign our petition to hold Big Oil fully responsible for the cost of cleaning up any future spills: http://t.co/jNfW1ylvKu"]["Oil companies should be held fully responsible for the cost of cleaning up spills. RT if you agree. http://t.co/xKOUGX4CoA"]["Ban on gay marriage is wrong. http://t.co/CwSOMbwFgL"]["Tomorrow I’m proud to honor a Tampa Bay area Vietnam veteran. http://t.co/gimVGgd1MC"]["The latest from AP photog @LynneSladky: http://t.co/jqMXZmPW5E"]["Wow. Underwater robots may have found engines from Apollo 11 flight that powered first men to land on the moon. http://t.co/goh5mNItfY"]["Was able to talk with her about death of dissident Oswaldo Payá. It’s time for an independent investigation … http://t.co/CVWxowMA1e"]["Thanks @yoanisanchez for coming to meet with members of the U.S. House and Senate today. http://t.co/Nh8dAxVl7r"]["La reunión con @yoanisanchez mañana. Espero con mucha interés esta reunión y oír sus ideas sobre la vida en Cuba."]["Yoani Sanchez to meet with members of Congress next week and share her unique view of life inside Cuba: http://t.co/7diwAAuKFP"]["Carl Levin is one of the finest senators I've met. He will be missed. http://t.co/TzW4QOQmtm"]["Hopefully there will be a peaceful transition of power in Venezuela with real, meaningful democratic reforms."]["The rule of Hugo Chavez is over.  http://t.co/yq1C6ug2RO"]["Budget cuts could be devastating for research into treatment, prevention of cancer, Alzheimer’s, other diseases. http://t.co/pPqC7F6hhv"]["This is what's so great about representing Florida - its diverse heritage. http://t.co/G6425EVPRu"]["A reporter asked me today who I was rooting for in this weekend’s Daytona 500. @DanicaPatrick, of course."]["We need to know whether things are getting overlooked, missed or bargained away during health-care law roll out. http://t.co/IvtjKUhV"]["Just noted at Finance Committee: Treasury nominee Jack Lew deserves credit for helping implement a plan for NASA when it was in turmoil."]["By a 78-22 margin the Senate today took an important step toward curbing domestic violence. http://t.co/XI3zUd9Y"]["Questioning of former Sen. Hagel’s patriotism at committee meeting went way over the line. http://t.co/5iSAerSK"]["Great to have @ryanlochte &amp; @ParentProjectMD stop by the office. Kids, parents touched by this disease are so strong. http://t.co/AO5PBZ0C"]["Florida Olympic swimmer @ryanlochte is on the Hill today supporting research towards a cure for Duchenne muscular dystrophy."]["UF honored today as #1 Peace Corps school with 107 undergraduate alumni currently serving as volunteers in 76 countries worldwide."]["Today marks 10 years since Columbia disaster. Allow me to share my thoughts on the accident and our space program. http://t.co/zjC66I4j"]["Outgoing Secretary of State Hillary Clinton has truly honored all Americans with her indispensable leadership."]["I support immigration reform with tough border security. We simply can’t deport 11 million people. For one thing, it would ruin our economy."]["When Challenger exploded 10 miles up I lost friends, colleagues. Our nation lost heroes. In their spirit we keep exploring."]["I wish Jon Hammar the best. http://t.co/azhzbBgI"]["Let’s pause a moment tomorrow to honor the quarter of a million people who died in the Haiti earthquake three years ago."]["Glad to hear Justice Dept is holding all parties accountable, not just BP. Folks on Gulf Coast deserve nothing less. http://t.co/8STWVOVG"]["Former Marine held in Mexico to be released ...  http://t.co/W7JwgBbR"]["Testified today in front of Senate Judiciary Committee about who’s behind voting law changes in Florida. Watch here: http://t.co/L0GBpPCz"]["Here are two steps to avoid going over the fiscal cliff: http://t.co/Yw7plXbg"]["Former NBA star Alonzo Mourning, a transplant recipient, here today to talk about helping those with kidney disease. http://t.co/3fnu5ZGw"]["Went with my wife Grace to a Flight 93 remembrance this morning.  Read more about it here: http://t.co/KLHNdC0P"]["Today, as Alan Gross begins his 4th year in a Cuba prison, we renew demands that Castro regime release him immediately and unconditionally."]["Justice Dept brought hammer down on BP today. Efforts to hold company responsible continue. http://t.co/WuCfE9vE"]["... outraged by reports of the Castro regime’s arrests of Cuban blogger Yoani Sanchez and other dissidents."]["The murders in Libya have the markings of revenge by al Qaeda for the death of Abu Yahya al-Libi, the terrorists group’s number two leader."]["Shocked, saddened by deaths of ambassador, staffers. Praying for families of fallen and those still on front lines. http://t.co/rVYFEZvJ"]["Today is the 77th birthday of Social Security.  Happy Birthday – and, many more!"]["I’m confident it won’t be long now before human footprints follow in the path of the Mars rover #Curiosity."]["We’re now ready to have U.S. companies develop the vehicles that will take astronauts to the space station. http://t.co/C0iOqKFQ"]["When Sally Ride launched, the whole nation lifted her up on a chorus of “Ride, Sally, Ride.”  She will be missed."]["I’m shocked and saddened by the death of Oswaldo Payá. We’ll never forget his push for freedom and democracy in Cuba. http://t.co/HI5VHFJt"]["Good news for FL’s economy - executive order from White House accelerates expansion of ports in Jacksonville, Miami. http://t.co/ccDo6Jhj"]["Looks like RESTORE Act will be in broader transportation bill.  Great news for Gulf Coast!"]["The governor’s methods should side with all lawful citizens and their absolute right to vote. http://t.co/6UKH6nwq"]["Just got word from the Pentagon: they’ve agreed to my request to keep a two-star General in charge of weapons testing at Eglin AFB."]["Florida man offers free casket for WWII vet buried in cardboard box.  Cemetery accepts, promises proper burial.  http://t.co/mFEZsOzY"]["An 8th grade student from Melbourne, where I grew up, is among the nine finalists in #spellingbee tonight at 8 p.m. Good luck Stuti Mishra."]["Judge strikes part of FL election law because it imposes “harsh” restrictions on groups that register voters.  http://t.co/sH3BZ15A #sayfie"]["Florida students awesome today in #spellingbee. Results updated here:  http://t.co/TbXcus8P"]["“…the Chamber is simply dreaming if it expects to get away with these distortions.” – WESH TV http://t.co/Ia65fMqg"][".@TB_Times just posted: @PolitiFactFL finds Chamber of Commerce ad on my record is untrue. RT to spread facts http://t.co/ozvvA0HJ #sayfie"]["Issue ads don’t give undisclosed corporate interests the right to spread false information. http://t.co/JDdD5qrY"]["Students can’t afford the kind of partisanship that blocked a move today in the Senate to keep college loan rates down."]["New Tampa Bay Buc Eric LeGrand is an example of perseverance and determination in the face of serious adversity. http://t.co/No1dTiHQ"]["Senate reauthorized bill today helping domestic violence victims. Hope partisan bickering doesn’t hold it up in the House. #StandUp4Women"]["Mazel tov to one of America’s greatest allies, Israel, on the democratic nation’s 64th birthday today."]["Need to keep up pressure on financial traders in oil market who are driving up gas prices:  http://t.co/XAbLO9sL"]["How do we break our foreign oil habit? Here’s a recent piece I wrote on the issue.  http://t.co/qJSMK9zr"]["These crooks aren’t using a crowbar. They’re hiding behind a computer to steal from U.S. taxpayers. http://t.co/bIvnFXUV"]["Senate by 76-22 just passed my legislation aimed at making sure no one can take away money intended for victims of BP's oil spill."]["With @neiltyson testifying it should be an interesting Commerce hearing tomorrow on the future of space exploration. http://t.co/X9OLTPwW"]["Seems a few air marshals weren’t just worried about protecting the skies. See an investigation on @ABCWorldNews and @Nightline tonight."]["I'm pretty-much caught up in Tebowmania, so I'll likely be watching the Broncos v. Patriots tonight."]["The House has done the right thing re Americans’ #payrolltax relief. http://t.co/jMV0SpzY"]["First congressional investigation into new voting laws will be held in Tampa next month. http://t.co/lyRHfHY3"]["Just saw that we went over 20,000 followers.  Wow."]["Met @iamwill at Saturday’s Mars rover launch. Was neat to find out the pop star’s a space enthusiast too. http://t.co/xG8ERnRm"]["Thanksgiving morning I’ll be serving food at the Clara White Mission in Jacksonville. Check out some of the go… (cont) http://t.co/C79aFIuC"]["NASA’s now hiring the next generation of astronauts. One might be the first to set foot on Mars. Watch the CBS report. http://t.co/ckMTpohI"]["Watch live at 11 a.m. as we give the first lunar landing crew and John Glenn the Congressional Gold Medal.    http://t.co/uP9CM5ce"]["I’ve just asked the Justice Department to probe new voting laws. http://t.co/7rzsLZZC"]["Great news today for Florida’s Space Coast.  The space program is getting cranked up again! http://t.co/PMgXVB8N"]["FL teacher could be punished for helping students with voter registration. This new voting law’s not good for Florida.  http://t.co/uXToDWBl"]["With Libya’s dictator reported dead, it’s very important that we help the transitional government secure and destroy weapons stockpiles."]["Let’s also remember St. Pete IndyCar driver Dan Wheldon for his work with at-risk youth, the elderly and our soldiers. http://t.co/lq1DgwOL"]["I hope you’ll read an op-ed column I co-authored with @eltonjohndotcom.  http://t.co/ABx6JEwl"]["Want to know why the price of basic items like gasoline and bread keeps going up?  Read this: http://t.co/b6V4YfA0"]["Closing tax loopholes will help U.S. get finances in order. See former Fed chief Greenspan & others testify live. http://t.co/b1sd2HG"]["Chairing hearing tomorrow on how to pull U.S. out of financial doldrums. Look for ex-Fed chief Greenspan to paint dismal picture of economy."]["Here is a list of some of the events going on in Florida this weekend as we remember the victims of 9-11: http://t.co/pUW0fqK"]["Hope you’re able to watch the launch: http://1.usa.gov/nr3wv"]["T-minus 1 hour and 49 minutes – and, we’re going to Jupiter.  http://bit.ly/priZr6"]["Breaking news: Deal reached to fix #FAA. http://n.pr/pV972x"]["The winner of this competition will be America: http://bit.ly/oh3BI4"]["You ought to read this story if you have a minute … http://bit.ly/oHqlcF"]["Holy Toledo!  We just went over 18,000 followers."]["We got a debt deal done. Next up: jobs. Then, we’ve got to get rid of some of the unfair corporate tax loopholes."]["You will see this new debt plan pass with an overwhelming bipartisan majority in the Senate."]["This is going to cut almost $3 trillion from the deficit.  It’s not a perfect plan, but it’s something we need to have right now."]["I’m just a little country boy, but seems to me a solution to the #debt is right under our nose: http://politi.co/qIGu1V"]["I favor a #debt plan that includes $2.7 trillion in savings and cuts, while protecting #SocialSecurity and #Medicare. http://usat.ly/pDmAAz"]["Was 105 in D.C. today. Only 83 right now in Tampa. Never thought you’d have to go to FL to cool off during the summer."]["Welcome home #Atlantis.  Though we’ll not again explore on a shuttle’s wings, we won’t stop reaching as long as there are stars."]["This might be a way to protect vital payments, like Social Security, if partisanship leads country to default: http://1.usa.gov/qsZz7y"]["BP now wants to limit spill claims? It’s the citizenry that needs to be protected from BP. Not the other way around.  http://wapo.st/qFNfC8"]["Today marks the end of one era, the beginning of the next. Soon #NASA will build a new monster rocket that will help get us to Mars."]["Main engine cutoff. #STS135 performing perfectly. #Atlantis crew taking one more step toward our understanding of the universe."]["Go, #Atlantis.  Go.  Go ..."]["I remember my launch. Strapped in, hanging on. When those solid rocket engines light off – right then you know you’re going somewhere. #NASA"]["Do you support closing tax breaks for big business if it helps avoid cuts in #SocialSecurity and #Medicare?  http://billnelson.senate.gov/"]["Census shows FL at 18.8 M poised to top 3rd biggest state NY at 19.4. RT to help us catch Sen. Gillibrand, who’s up by only 1,973 followers."]["Obama, Oprah among most civil in uncivil America, says a new survey that names the most rude.  http://politi.co/lzv8vy"]["Smoke on the water. http://1.usa.gov/6lTdUW"]["What do you think most folks say is the biggest threat to America right now? http://1.usa.gov/6lTdUW"]["Looks like Jacksonville is getting a bold new leader in my good friend, Alvin Brown.  http://bit.ly/jDTjjH"]["Endeavour is on its way.  One more step in our long journey."]["Taxpayers facing maybe 29 percent of tab for Gulf oil-spill cleanup: http://bit.ly/m8UceG"]["Just saw Usama death photos at CIA.  While the job of fighting terrorists isn’t finished, bin Laden is."]["‘am about to question oil co. execs about the price of gasoline"]["So, Pakistan really didn’t know bin Laden was hiding in plain sight?  My response to reporters on what all this means: http://bit.ly/khsZaV"]["Finally. We cut off the head of the snake. http://www.cnn.com/2011/WORLD/asiapcf/05/01/bin.laden.us.reacts/index.html"]["Today we lost one of the best public servants I’ve known.  Patsy Kurth also was a wonderful mother to four daughters. http://bit.ly/jMcUFi"]["Atlantis is coming home to Kennedy after traveling roughly 120 million miles. http://bit.ly/gpvBJ4"]["Let us know whether you think the threat of a government shut-down is a partisan political ploy: http://1.usa.gov/6lTdUW"]["Friday forecast for Orlando: Mostly sunny skies with a good chance of parachutes? http://bit.ly/gzxkXY"]["Maybe our plan for reducing dependence on foreign oil will finally go somewhere now.      http://1.usa.gov/hVcY38"]["I guess these tax cheats figure they have nothing to lose: http://bit.ly/9JWrMV"]["Florida’s chances of getting high-speed rail are still alive  http://bit.ly/gPMdqx"]["I'm very proud of my former legislative director  http://1.usa.gov/eJcpF5"]["Watch live as the future of Florida’s high-speed rail is argued before the state Supreme Court starting at 3 p.m. http://bit.ly/fDhhVt"]["Should the U.S. and its allies intervene in Libya?  http://bit.ly/6lTdUW"]["This legislation would show you the money - http://bit.ly/9JWrMV"]["All aboard - next stop for the bullet train: Florida Supreme Court http://bit.ly/fO7CMY"]["You can offer someone an opportunity, but you cannot make them take it.  http://bit.ly/eVfD66"]["Someone just asked: you looking for a way to sidestep Gov. Scott on his decision to kill high-speed rail? Yep. http://youtu.be/WcqIK0VziDI"]["If Florida would’ve had a governor who rejected President Eisenhower’s idea, we wouldn’t have an interstate system. http://bit.ly/g0gXyT"]["Remembering the lady who reached for the sun, and the contributions of many others http://bit.ly/fHNt5M"]["Sad news out of Palm Coast about Dalai Lama's nephew http://bit.ly/hkm92V"]["Agreed! RT@chuckgrassley: Talked algae/corn ethanol during Finance Comm. Need 2 support 1st & 2nd gen of ethanol http://tinyurl.com/6x3su5x"]["Mubarak will have to go… http://bit.ly/dYFauU"]["Situation in Egypt is right on the edge – and things could go either way. http://youtu.be/Db2fsgX-od8"]["Sacrificed lives remind us that we must press on http://bit.ly/eEz97W"]["Given the recent rash of police shootings it’s clear law enforcement could use some more tools when they go on manhunts http://bit.ly/fjRRsH"]["In what ways has the “Great Recession” most directly affected you? Let me know http://billnelson.senate.gov/"]["I think US-China deal is kinda fuzzy http://wapo.st/ijSQwE"]["A new poll’s been posted on my website where you can share your view of the president's speech last night.  http://billnelson.senate.gov/"]["Today we pray for Haiti and renew our commitment to helping our neighbor in need http://bit.ly/hPTKBw"]["I think total repeal of the health-care law will hurt seniors and others http://bit.ly/ecJjMD"]["Just posted a new poll on my website about the cause of rising gas prices. Weigh in - http://billnelson.senate.gov/"]["Started a poll on my website. First one shows folks by 55-45 don’t yet trust the stock market. Weigh in - http://billnelson.senate.gov/"]["check this out: http://www.fpl.com/environment/plant/riviera_cam.shtml"]["Looks like Santa's trading in his sleigh for a bullet train http://bit.ly/hJCXlF"]["While we’re sad to see him go, the glory Urban brought to the Gator nation won’t soon be forgotten http://bit.ly/fhzrIw"]["Remembering John Lennon on the 30th anniversary of his death, my favorite Fab Four song is “I want to hold your hand.”  What’s yours?"]["Some folks tell me Miss Florida looks a lot like… who? http://bit.ly/epsBzs"]["Who knew? LSU’s football team and I have something in common - we’re both #5 in the polls! http://bit.ly/b4VQU8"]["Fantastic news for Florida - http://bit.ly/cdSLX3. Now we are full speed ahead with high-speed rail construction."]["Some good news from the IRS today for homeowners who have defective drywall - http://bit.ly/9saqXW"]["I happen to love launch photos and Matt Walsh sent me this one. Check it out - http://on.natgeo.com/aLxOBC"]["Phenomenal  – AP’s reporting Florida’s a big winner for school reform money http://bit.ly/arSQ2m"]["Brought federal pay czar Feinberg to the Panhandle today to meet with folks about their oil spill claims http://TwitPWR.com/Ntv/"]["The ‘Glades remains at risk and should’ve never been removed in the first place – http://bit.ly/9euEil"]["Got two thumbs up today from a key Senate panel on my plan for giving Gulf residents oversight of oil drilling http://bit.ly/dftX8a"]["Met w pay czar Feinberg – pushed for oil-spill claims center to be in NW FL Sallie Mae bldg & hiring their workers http://bit.ly/cXcUP0"]["Hearing starts in an hour on Gen. Clapper for intelligence chief - expect a few questions about Washington Post series http://bit.ly/bci63J"]["I would’ve gotten at least one question right - if I’d’ve been on Jeopardy Monday night. http://bit.ly/d50DKW (See: Just a Bill for $800)"]["Some counties wondering why they didn’t get more out of the $50 million BP gave Florida http://billnelson.senate.gov/news/CristLetter.pdf"]["Robert Byrd always put public service ahead of personal fortune.  http://www.youtube.com/watch?v=PMs93QzG2AM"]["Just handed BP a past-due notice on some $7 million it owes FL for oil spill cleanup costs  http://bit.ly/bVhGRl"]["“No drilling off Florida, period,” is what I told the White House today. http://bit.ly/aUCee3"]["Sen. Byrd gave his all - to his wife Erma, to the people of West Virginia and America, and to the U.S. Senate."]["Brewing Gulf gale could leave twice as much oil to clean up.  http://bit.ly/c7Hxpj"]["I’m sure there will be criticism, but Obama had no choice but to accept McChrystal’s resignation. And picking Petraeus was a great move."]["Surveyed waters off Pensacola today. Orange gunk all over. This is not only a disaster – it’s a crime. http://bit.ly/aT6Gcs"]["Feds didn’t alert FL yesterday when they boomed state waters due to oil contamination. Hear what I think about that http://bit.ly/dAFDQ7"]["Fed transportation czar today gave Florida the first multi-million dollar installment for high speed rail. http://bit.ly/9zH53D"]["Latest News: Experts now say Gulf leak is nation's worst spill - far bigger than Exxon Valdez http://bit.ly/d6Jhgx"]["Next hours are critical as BP aims to plug gushing oil well.  Come with me once more – live from one-mile down http://billnelson.senate.gov/"]["I wrote Obama today to say I’m sure Congress will fund an extra space shuttle flight http://bit.ly/9nmNzF"]["It’s time to close the revolving door between regulators and Big Oil once-and-for-all - I’m filing legislation http://bit.ly/cOwE7V"]["New investigation confirms drilling regulators buddy-buddy with Big Oil.  Read it here - http://billnelson.senate.gov/news/IGreport.pdf"]["My angel (Grace) and I are overjoyed. Our daughter has found her Mr. Right. http://bit.ly/bi4S8w"]["Just posted new never-before-seen BP video footage of robots working a mile underwater at oil spill site http://bit.ly/bmowCj"]["Come with me - live from one-mile down, under the Gulf, at the oil spill - http://billnelson.senate.gov/"]["Have put a bunch more BP video on my site http://bit.ly/d80zfB and on my youtube channel at http://bit.ly/avEN5L"]["Previously unseen footage of BP well leak now available on my website - http://bit.ly/dtYiQD"]["Got word this am BP will bring more underwater video of oil spill to our 2:30 Commerce hearing. http://bit.ly/bKPOQc"]["Playing Hardball with Chris Matthews at 5 p.m. – hope we get to talk about oil regulators ignoring safety and environmental concerns."]["We’ve got to stop this - experts now say spill is much worse than thought, while BP chief says it’s “relatively tiny.” Unbelievable!"]["Senator from Alaska just sandbagged my bill to hold BP accountable for up to $10 billion for the oil spill."]["My hearing on the future of space program about to get started with Neil Armstrong and others - watch it live here http://bit.ly/bO7eHL"]["USA Today supports offshore drilling expansion – I’m glad they invited me to share my opposing view http://bit.ly/am6EsH"]["Word is climate bill might let rigs in Florida’s no-drill zone. If Sens. Kerry, Lieberman are following me on Twitter: that’s a non starter."]["Ban, baby, ban – that’s what I’ve asked Gov. Crist to do about any new drilling off FL. http://bit.ly/ayQnig"]["Have been invited to testify in Senate today about the oil rig explosion.  You can read my prepared remarks here - http://bit.ly/99UcDO"]["Injecting golf balls into well isn’t reassuring that BP has a plan to stop oil slick, which could hit FL in 10 days http://bit.ly/bZnyrC"]["The first man on the moon makes a very rare public appearance here Wednesday at a hearing I’m chairing on the future of our space program."]["Mtg w officials in South FL in a bit - if BP doesn’t get this well capped, oil is going to cover the whole Gulf coast. http://bit.ly/bS40PG"]["About to meet with BP execs in my office - hopefully we’ll find out when they’ll be able to stop this underwater volcano."]["Meeting on oil spill  with BP execs today at 5 p.m.  http://bit.ly/dnYCNA"]["This oil spill is our worst nightmare come true. I’m asking for investigation of lobbying on safety rules by Big Oil http://bit.ly/b4aNjX"]["Went over 10,000 followers on Friday.  Thanks to y’all for getting the word out – and hello to our new followers!"]["Holy cow – only need 43 more to hit 10,000 followers… help spread the word and put me over the top!"]["Got favorable response today to my request for a congressional probe of oil industry’s claims that it’s safe enough to drill near florida."]["So far partisanship has kept us from considering Wall Street reform.  Hopefully, we can break the divide.  http://bit.ly/cheB76"]["touring st. joseph’s children’s hospital in tampa.  anytime you want a lesson in hope – just visit some of the kids here."]["Based on all the tweets yesterday, nobody saw Denver coming! http://bit.ly/d8Ree7"]["Ok, it’s draft time – so where do y’all think Tim Tebow’s going to end up?"]["Happy Earth Day. Did you know Sen. Nelson had a hand in launching the movement?  Gaylord Nelson, that is. http://bit.ly/bFlJoR"]["At budget cmte – looks like we’ll get another $1 billion for NASA next year. Could save jobs. Here’s what I had to say http://bit.ly/cdzz9Z"]["Saddened by Dorothy Height’s passing - she certainly left her mark in America’s history as a pioneer of civil rights http://bit.ly/bRC45D"]["At the Clinton Global Initiative mtg – looking forward to meeting the students who are doing extraordinary work http://bit.ly/dCevgw"]["Toured Univision in Miami today – Elizabeth and the rest of the folks there are doing a heck of a job!"]["Was great playing Hardball w Chris Matthews about Obama’s plan for space exploration. See it here - http://bit.ly/9WF0kz"]["Listen to my reaction to Obama’s plan for space here - http://billnelson.senate.gov/audiofiles/NelsonSpace.wma"]["At KSC - Crowd here anxiously awaiting president’s speech on space program http://bit.ly/ajh7RZ"]["The White House announcement today of some extra work for NASA in Florida is a step in the right direction – but there are miles to go."]["Judge says Chinese company at fault in drywall mess. It’s time our government stepped up the pressure on the Chinese. http://bit.ly/ctGzrO"]["FL to get $24 million for medical IT – read more here http://billnelson.senate.gov/news/details.cfm?id=323635&"]["Headed to the White House for historic signing of health care bill"]["Headed to Oval Office for meeting with the president about America’s space program. Lots of folks unhappy with newly released plan for NASA."]["Met some really extraordinary women this morning - volunteer WWII pilots. They're getting long overdue honors. http://bit.ly/9vBihk"]["Glad President Obama has decided to come to Florida next month and elaborate on his plans for our nation’s space program."]["Senate is considering financial reform today – I think executives who got golden parachutes should have been left without their shirts."]["Down in Central Fla today to see where our stimulus bucks are going.  With VP at widening of U.S. 27."]["The latest partisan stunt is getting in the way of helping Americans by temporarily blocking unemployment benefits http://bit.ly/cIxv10"]["We got a jobs bill passed today – it would give companies a strong incentive to hire new folks. Now we have to see what the House does."]["NASA to boldly go - where?  http://www.newschief.com/article/20100224/NEWS/2245060/1053"]["Florida fishermen raised significant concerns with me today about new govt. fishing bans – I’m asking for a full review."]["StoryCorps bus now in Pensacola http://bit.ly/dCkaky – 50,000 Americans have so far recorded their stories for NPR and Library of Congress."]["I’m asking three federal agencies to investigate unusual cancer cases in South FL, here’s more http://bit.ly/clEATU"]["En route back from Haiti. Distribution of food, supplies greatly improved. But urgent help still needed especially before the rainy season."]["Looking at administration’s budget for nasa – houston, we may have a problem."]["Reason for moving it is so they're not all in one place like sitting ducks. Also huge for the North Florida economy. http://bit.ly/bbdWUz"]["In Jax this morning on Mayport landing a new carrier. Something Ander, Corrine and I have spent close to a decade fighting for."]["Obama in Tampa tomorrow where he’s announcing $8 B in stimulus money for high-speed rail, including some for a bullet train in Florida."]["Just got off phone with folks from the administration, they’ll be allowing kids from Haiti with critical injuries quick passage to the U.S."]["Still pressing gov’t for one-year medical visas for the youngest and worst traumatized victims of the quake http://bit.ly/7Tq01D"]["For some ways to help Haiti earthquake victims: http://www.billnelson.senate.gov/2010haitiearthquake.cfm"]["My heart and prayers go out to the people in Haiti."]["Went on quite a ride - 24 years ago today http://www.upi.com/Odd_News/2010/01/12/The-almanac/UPI-51371263285000/"]["Been a long time coming but this a.m. we finally turned the first shovel of dirt on a key 'Glades restoration project http://bit.ly/86DFQM"]["Senate just passed health care with my vote. Not a perfect bill, but good. It’ll let a lot more people get medical coverage."]["@mmarkarian thanks to humane society for supporting a ban on harmful species http://bit.ly/7rmSpt"]["Bunch of us (me, LeMieux, Reps. Brown, Mica) had heart-to-heart with US transportation boss last night. Optimistic FL will get bullet train."]["A guy who punched someone outside one of my speeches on health-care reform gets sent to anger classes http://bit.ly/4XiGdx"]["I told my wife Grace not to push the refresh button so many times http://bit.ly/7PVDUs"]["And the mission is unchanged: wipe out Al Qaeda; diminish the Taliban insurgents and keep up the pressure in the Pakistan border region."]["I think the president offered a sensible plan to empower the Afghan people and allow for our troops to complete their mission and come home."]["Usually where there’s smoke there’s fire – that’s why I’m calling for an investigation into the drug price hikes http://bit.ly/2Qul6W"]["What? Drug makers hiking prices even more, despite promises to shave costs to help pay for health reform?  http://bit.ly/4DfU1b"]["I usually drink my first cup of coffee watching Morning Joe, wonder if he'd host Hillary and Palin talking over a cup? http://bit.ly/1JLLVt"]["We’ll be voting on big military projects today. Stuff like getting ready for one day moving a huge Navy carrier to Florida."]["Today’s picture-perfect launch of the new experimental Ares rocket shows America remains the leader in science and technology."]["Weather’s interfered with new Ares rocket launch. But countdown finally resumed at four minutes. Try to get to a TV or http://bit.ly/IAL4!"]["Well, weather didn’t cooperate. Ares launch scrubbed for today. Maybe go for tomorrow, or the next day?"]["Weather has stalled Ares launch, stay tuned."]["The future of America’s space program is 3 minutes away from launch."]["Going to make sure he knows why we need to get Jacksonville’s Mayport ready for a nuclear carrier."]["I will continue to fight to get NASA funding for the next generation of human spaceflight. More on what we need to do http://bit.ly/1Q1aG9"]["Our space program is being asked to pursue goals without the necessary resources, or so says the Augustine Commission http://bit.ly/UsU09"]["Why care if we explore space? At 2:30 today we’ll “make the case for space” in a hearing that’s online at http://tinyurl.com/yz2f5tz"]["Just voted for the Finance Committee’s health-care bill, I’ll be on CNN about it just after 3 p.m."]["Extraordinary person. Six adopted children. Truly an Angel. Was proud to nominate her for Angels in Adoption http://www.angelsinadoption.org"]["On a break from the cmte health care debate to meet Barbara Kadzis, you may remember her from Extreme Makeover: Home Edition in Tally."]["Americans who like their health coverage should be able to keep it. And we need to make coverage affordable for those who don’t have it."]["Health-insurance exchanges will help the nearly one-in-four Floridians who don’t have or cannot get affordable health insurance."]["Just read excerpts from President’s speech for tonight. I’m glad the president is proposing insurance exchanges."]["Grace and I came to know Ted and Vicki in his later years in the Senate, and we count it a privilege to have known him."]["Whatever your political views, his lion-like conviction was respected. It was that conviction that gave a voice to the powerless."]["Most Americans cannot even remember a time without Ted Kennedy."]["I look forward to having the same bipartisan working relationship with his successor."]["Mel Martinez is stepping down. He has been a good Senate colleague of mine, as well as a personal friend."]["Cash for clunkers?  Hard to argue with apparent success - just wish the thing applied to cars that got better gas mileage."]["Headed to KSC for the shuttle landing"]["It starts at 10 am, and you can watch it live here http://tinyurl.com/nz4z24"]["This morning I’ll be heading up a meeting with some of the nation’s top hurricane experts to see if the govt’s ready for the next big one."]["Meeting with folks in Orl. hurt by decline in tourism worsened by gov’t blacklisting. Talking about ways to end it http://tinyurl.com/nzhzst"]["Went to 40th anniversary celebration of moon landing last night in D.C. Wow!  Neil Armstrong delivered one heckuva stirring speech."]["Waiting to go on with Wolf on CNN’s Situation Room"]["And on this historic 40th anniversary of the moon landing, let’s not rest. It's up to us to reach for the stars."]["Space flight grows science and technology. It grows education. And it grows the economy."]["Our president needs to set clear goals for space exploration: a lunar base, humans on Mars and keep going."]["I remember when JFK reminded us that this country was not built by those who rested, and set a lofty goal for our country – the moon."]["Just used Skype for an interview with a station back in FL.  Great way to see and talk with folks back home - right from my desk!"]["A star has set - with Walter Cronkite's passing America has lost one of her most trusted voices"]["Naval academy grad, Marine test pilot, astronaut, general – Charlie will bring back the magic from a time when we rode rockets to the moon"]["I’ve known Charlie Bolden the better part of a quarter century, since he was my pilot on the space shuttle in 1986"]["Charlie Bolden just confirmed by Senate as nation’s new space czar.  He’s perfect to keep America leading in space, science and technology"]["No big surprises on day one of Sotomayor hearings, a few audience members got tossed out and a couple of lawmakers threw partisan jabs."]["Plus, got a letter from the IRS saying folks with tainted drywall could qualify for a special tax deduction - http://tinyurl.com/ma2gm9"]["stopping the deportation of people when their American spouse dies, even mothers with children who are born here."]["Lotta other news today. Senate OK’d folks buying less expensive prescriptions from Canada online. And…"]["Just left a meeting in Jax with a Coast Guard team that hunts down drug runners. These guys mean business."]["Here’s my letter today to the Prez on closing the Enron loophole  http://tinyurl.com/n639wo"]["We shouldn’t be allowing profiteers to flip oil contracts like condos."]["Glad to see the Obama administration cracking down on unregulated oil speculation http://tinyurl.com/lhzcbz"]["This morning I spoke about the pythons infesting the Everglades, and the tragic death of a toddler in Florida http://tinyurl.com/kv7zd8"]["Was happy to see Al Franken here today, glad that election finally is decided. Known Al for a while. I think you’ll see he’s a good guy."]["This afternoon I’ll be meeting with folks who fear they may be part of a cancer cluster in WPB, I’ve asked EPA and CDC to investigate."]["In Haiti ‘til Monday to see how else we can help our neighbor recover from the wounds of drug trafficking, poverty and violence."]["@MajoratWH re:HC patient looks a little better, but not out the woods yet"]["Some have kids who are American citizens, yet their husbands died too soon, so the U.S. wants to split the families and deport widows."]["Met with widows in the capital today who fear being deported. Heartbreaking stories. http://tinyurl.com/lgh7re"]["Lotta folks asking me about health-care reform. We really need it. I'm working on it. But we need a viable plan for how to pay for it."]["Seminoles just lost their biggest booster. My good friend T. K. Wetherell just announced his retirement."]["Don’t mean to tweet my own horn, but… http://politics.theatlantic.com/2009/06/the_top_30_washington_insiders_on_twitter.php"]["In the Panhandle today trying to stop coastal oil drilling  http://www.pnj.com/article/20090615/NEWS01/90615007"]["In Tampa on oil drilling this morning.  We can’t let the oil industry trash our coast and economy."]["Congress ought to be looking at alternative energy, instead of putting oil rigs off Florida’s world-class tourist spots."]["Senate energy panel just voted to put oil rigs 190 miles closer to spots on Florida’s Gulf coast.  I’ll fight ‘em."]["Just spoke in Senate about stimulus money in Florida. More jobs for teachers in Seminole County, for example, and some 200,000 jobs overall."]["Tonight I’ll join Citizens’ Crime Watch of Miami-Dade County to honor the folks who help keep our communities safe"]["Here’s more on the disappearance of Felix Batista http://www.cnn.com/2009/CRIME/01/07/security.expert.kidnap/index.html"]["Working with Rep. Ros-Lehtinen to find the husband of Lourdes Batista who was last seen in Mexico, we met with the family today in Miami"]["He saw for himself why restoring the Everglades is so important"]["Obama taps Bolden to run NASA http://www.billnelson.senate.gov/audiofiles/052209billnelsonboldennomination.mp4"]["Here's the direct link to the drywall hearing webcast http://bit.ly/XWyrZ"]["We’re holding a hearing on Chinese-made drywall this morning at 10:30 a.m., it’ll be streaming here http://tiny.cc/fwDgo"]["Just got word, Interior Secretary Ken Salazar has accepted my invite to tour Everglades to see importance of restoration efforts"]["It looks like politics has been put aside today and Craig Fugate will be approved to head FEMA – just in time for hurricane season."]["The Department of Education just announced more than $1.8 billion in stimulus money for Florida that will help save teachers jobs."]["This mission will demonstrate the success of humans interacting with machines in space to discover the unknown."]["It was a flawless launch for what will be one of the most technologically challenging missions to repair & extend the Hubble space telescope"]["Just got back from Senate floor, talked about importance of confirming Craig Fugate to head FEMA.  His nomination is being held up."]["More about the shuttle from the Flame Trench http://bit.ly/15uCWS"]["White House tells me the president will fly all nine remaining shuttle missions - even if it means flying the shuttle an extra year."]["Good news today, Obama’s named a new consumer protection chief http://tinyurl.com/dzuh3u"]["Just went to the floor to say a few words about Jack Kemp. We didn’t always agree politically, but he became a close friend.  Sad loss."]["$2.5 billion OK’d for the shuttle to fly through 2011, read more http://online.wsj.com/article/SB124104302283670451.html"]["Whoa, Arlen Specter is switching to Democratic Party after three decades in GOP"]["Going to the senate floor to advocate for a bill to help states that face catastrophic risk like hurricanes and earthquakes"]["http://twitpic.com/3ui6u - I got a few tips today on how to avoid getting sacked from Tim Tebow at a reception for the Gators on the Hil ..."]["I’m gonna see the Gator football champions on the Hill today... will share pics later."]["I can’t believe some Florida lawmakers might actually be serious about allowing oil drilling within ten miles offshore."]["In the past Russia tended to fully support Iran, but I see the chance for more cooperation between us and the Russians."]["I came away from my meetings in the Kremlin last week feeling like Russia now shares our concerns about Iran becoming a nuclear state."]["Headed back to the capital city after a missile-defense trip to Russia with the Intelligence committee"]["Went to the Gators’ spring football game in Gainesville Saturday to present a resolution honoring the team for its national championship."]["Now I’m off to Wolfson Children’s Hospital where they’re building a center to save kids who have brain tumors"]["This morning I met with folks from Flagler and Volusia about getting the local economy back on track"]["I’ve just sent a letter to Obama asking for the ouster of the consumer czar http://billnelson.senate.gov/supporting/mediareleases/nord.pdf"]["I’m off to meet with Bay area elected officials on the economy and the stimulus package."]["I just left the Bradenton home of Kristin Culliton where there were at least 50 homeowners all with the toxic drywall in their homes."]["I’ve been pressing the CPSC to ban importation of the tainted drywall http://news-press.com/article/20090330/NEWS01/90330058"]["I’m on my way to see Joyce and Sonny Dowdy whose Cape Coral home was built with toxic drywall from China"]["Midnight madness!  About 10 votes down on the budget today - and, it still looks like we’ll be here to midnight with up to 100 amendments."]["Meantime, here’s a video that explains the problem really well http://tinyurl.com/cynvyq"]["Working with Sen. Mary Landrieu of Louisiana today to help folks who got stuck with toxic drywall in their homes.  We expect to file leg ..."]["I’m glad she brought up missing Floridian Bob Levinson http://tinyurl.com/cxsoly"]["Just finished with Andrea, she asked about the budget and Iran and saved her Mexico questions for Sen. Lieberman."]["I’m about to go on MSNBC with Andrea Mitchell on the drug war in Mexico, tune in"]["I had a great time joining President Obama for a call to the astronauts http://www.billnelson.senate.gov/news/billsblog.cfm"]["Met with local officials in Ocoee this morning about the stimulus and talked with area media about NASA."]["And, here is a letter I sent to President Obama last week http://tinyurl.com/b2w4ju"]["Renewing the push to upgrade benefits for widows and widowers of servicemembers. I’ll be filing legislation soon."]["There was plenty of talk about politics – and, plenty of strawberry shortcake."]["I visited the Strawberry Festival in Plant City today to attend a luncheon there."]["Here’s some info on it http://tinyurl.com/bpog2e"]["I’m in Tallahassee today meeting with Fla. CFO Alex Sink about bolstering the state’s volatile property insurance market."]["The president posted his blueprint for the FY 2010 budget, you can get the details here http://www.whitehouse.gov/omb/"]["President Obama did a good job tonight in giving the country the confidence that we can – and, we will turn this economy around"]["I’m headed to the Jax Mayo Clinic where I’m meeting with researchers who may be closer than ever to finding a cure to ALS, Parkinson."]["I ended last week in Fort Pierce where we kicked off the construction of a courthouse there, then I met with folks from Indian River County"]["Today I’m with the King and Queen of Spain marking Pensacola’s founding by the Spanish 450 years ago"]["Yesterday I spent the rest of the day in Jackson, Washington and Bay counties talking to folks there about the economy."]["I’m starting today in Tallahassee at FAMU where I’ll be presenting some of my personal memorabilia from the inauguration of President Obama"]["By the way, here are a few things I’ve been saying about the stimulus plan - http://tinyurl.com/dysxmc"]["I’m headed to Trenton, Live Oak and Monticello this afternoon to meet with folks about the stimulus and how to jump start the economy."]["I’m off to Gainesville to talk about their solar initiative."]