["The Burmese gov't should immediately release detained @Reuters journalists. It's because of their reporting &amp; the reporting of journalists like them we know the extent of violence against the Rohingya. The US must stand for freedom of the press everywhere. https://t.co/Y1GRsOQLBH"]["Great to hear the DC City Council voted to name street outside Russian embassy after Boris Nemtsov, a Russian patriot who was murdered in the shadow of the Kremlin. Boris's memory &amp; example will continue to inspire all people to fight for freedom. https://t.co/DADOi2B2SA"]["Congratulations to @jdickerson - one of the true professionals in the business! https://t.co/aJxYZf4lHk"]["My friend Senator Tom Coburn rightfully called #earmarks the gateway drug to corruption &amp; overspending in Washington. That’s why earmarks were banned &amp; that's why they shouldn’t be brought back from the dead."]["I’m excited to welcome @SenatorTimScott to the Senate Armed Services Committee. Our committee will benefit from his principled leadership, integrity &amp; hard work on behalf of our nation’s men &amp; women in uniform."]["Congrats to Amb. Victoria Nuland on being named CEO of @CNASdc! I have known &amp; worked with Toria for years &amp; believe she's an excellent choice to lead this fine organization."]["Thank you @dougducey &amp; the #Arizona legislature for your support! https://t.co/Lx09YVFqc9"]["7 years after the senseless rampage in #Tucson that killed 6 Arizonans &amp; injured 13, including my friend @GabbyGiffords, we pray for the families of those who died &amp; remember with great admiration the heroic actions our fellow citizens took to save the lives of others that day."]["I welcome the administration’s decision to sanction Iranian entities responsible for ballistic missile development. This action is an important step forward in holding #Iran accountable for its destabilizing activities in the region. https://t.co/HiZPJiTo8o"]["Tragic new report shows at least 716 ppl in #Arizona died of opioid-related overdoses in 6 mos. We must address #OpioidCrisis at its root. My bill w/ @SenGillibrand would help curb the over-prescription of painkillers, which often lead to addiction. https://t.co/RPwdX0w1Ti https://t.co/5NhyQBL0Dj"]["Must-read @AP: \"Protests put spotlight on #Iran’s vast, shadowy #Syria war\" https://t.co/9cPEwaEePK"]["Must-read @MJGerson in @washingtonpost: \"The #Iran struggle will be historic. Here’s what Trump should do.\" https://t.co/GtqonH2VbW"]["Important @WSJ: \"#Syria’s Festering War Wound: Legions of the Missing\" https://t.co/Tp9VI4tlkj"]["Congratulations to @cindymccain on being awarded @ASU's MLK Servant-Leadership Award! We are so proud of your unwavering commitment to fighting #HumanTrafficking &amp; helping victims of this terrible crime. https://t.co/JLEMynOoTD"]["As we mark National Slavery &amp; #HumanTrafficking Prevention Month, we must commit to eliminating these horrific crimes, which violate the most basic human rights &amp; target the most vulnerable &amp; at-risk individuals in our society. #EndTrafficking https://t.co/T6ly2nfo5D"][".@starsandstripes: \"First Navy Jack flies at Pearl Harbor to honor sailors killed in collisions\" https://t.co/daMfXgakAy"]["Must-read @WSJ: \"Busting Illusions About #Iran\" https://t.co/moL2dt07cI"]["Imp't @WSJ: \"Here’s the Cure for Hyperpartisanship: Focus on issues that can bring the country together.\" https://t.co/djHTBlGi32"]["Thank you @dougducey for raising awareness of the terrible crime of #humantrafficking, which impacts far too many women &amp; children in our state &amp; around the country. #EndTrafficking https://t.co/vf5cD6Quw9"]["ICYMI: @azcentral: \"John McCain gives #Phoenix river revival the weight it deserves\" https://t.co/PcLzEDrzS4"]["Congratulations to Carson Palmer on an outstanding career - thanks for the memories! @AZCardinals"][".@BruceArians is an outstanding leader who never gives up. Thank you for all you have done for the @AZCardinals &amp; the entire state of #Arizona! #ThanksBA https://t.co/77Bnfeh3s4"]["Must-read @WSJ: “#Iran’s Theocracy Is on the Brink” https://t.co/xyUF0d3ESi"]["Must-read @WSJ: “New Protests in #Iran” https://t.co/MuFtifvJkw"]["For too long, the Iranian people have been oppressed by their government, which cares more about sowing instability abroad than its own citizens. The U.S. stands with the brave protesters who yearn for freedom, peace, and an end to corruption in Iran. https://t.co/taDmyE1w7k"]["Must-read @WSJ: “Trump and #Syria After Islamic State” https://t.co/L7U2cqMCXU"]["Must-read @washingtonpost: “A Chinese dissident takes on the dictatorship — and pays the price” https://t.co/JBlWdP24n9"]["Must-read @WSJ: \"Democracy, #Putin-Style: The Kremlin fears Alexei Navalny is too popular, bars his candidacy\" https://t.co/Ctq7HwLNHY"]["Must-read @washingtonpost: \"#Putin may be in more trouble than we know\" https://t.co/JKjjL1qhhX"]["Thank you @LarryFitzgerald, I’m deeply touched. Thanks for all you do to give back to #Arizona &amp; our nation. Merry Christmas! https://t.co/LD6L90p7n0"]["Merry Christmas &amp; holiday blessings, from our family to yours! https://t.co/SZ9kb5IhXs"][".@POTUS's decision to provide Javelin anti-tank munitions to #Ukraine sends a strong signal that the United States will stand by its allies &amp; partners as they fight to defend their sovereignty &amp; territorial integrity. https://t.co/mFdIxxTBFy"]["Good news: my bipartisan bill w/ @SenatorTester to train &amp; equip America's firefighters is headed to the President's desk for signature. https://t.co/975n7jnpvJ"]["I’m deeply saddened by the passing of my @NavalAcademy classmate Bruce McCandless, a brilliant aviator &amp; iconic astronaut who inspired all of us to reach new heights. RIP. https://t.co/kbcYiOy6zH https://t.co/Ihl9q7T4zA"]["ICYMI @azcentral: “John McCain and Jeff Flake tried to save us from ourselves” https://t.co/x1apTHKm7L"]["Must-read @nytimes: “U.S. Imposes Sanctions on 52 People and Entities for Abuse and Corruption” https://t.co/rcknsIRSRw"]["I also welcome decision to sanction 5 Russians under the Magnitsky Act. Sergei Magnitsky died at the hands of Putin fighting for human rights &amp; rule of law. These sanctions further his effort to provide the Russian ppl justice they’re denied under Putin. https://t.co/HIWtzGK2Xg"][".@SenatorCardin &amp; I wrote the Global Magnitsky Act b/c the US must lead in holding human rights abusers &amp; corrupt individuals accountable. Gratified the US has sanctioned 13 people &amp; dozens of organizations for their crimes under this law. https://t.co/USr8TNM4wc"]["Congrats to @AZCardinals Pro Bowlers @LarryFitzgerald @chanjones55 @P2 &amp; @buddabaker32 - you make #Arizona very proud! https://t.co/yBhvMrSjlp"]["I welcome reports the administration has taken the long-overdue step of approving the sale of lethal defensive weapons to help the Ukrainian people defend themselves from Russian aggression https://t.co/UOHu2EIFpL"]["I’m deeply humbled by @MayorStanton &amp; @CityofPhoenixAZ's decision to designate Terminal 3 @PHXSkyHarbor in my name. I have rarely felt at once so honored &amp; yet so unworthy of an honor as I do today. https://t.co/Rv6z2vwYZK"]["Must-read @azcentral: \"When trees become the enemy, fix the forest\" https://t.co/9PXP8bBhxf"]["Honored by @AzCapitolTimes' recognition: \"John McCain – Lifetime Achievement\" https://t.co/s9y8lT8F5g"]["ICYMI: @hiattf in @washingtonpost today: \"McCain — a tireless voice for democracy the world over\" https://t.co/d1u0LprYA7"]["Thanks to everyone for your support &amp; words of encouragement! I'm feeling well &amp; looking forward to returning to work after the holidays."][".@pressfreedom's annual report shows record # of journalists imprisoned worldwide in 2017, including 21 on \"fake news\" charges. @POTUS must understand his harmful rhetoric only empowers repressive regimes to jail reporters &amp; silence the truth. https://t.co/S65iPnPBsN"]["Reports that Trump admin is willing to accept 4 more years of Assad’s rule in #Syria are deeply disturbing &amp; would validate the de facto policy of 2 successive US admins that have failed to end the slaughter. https://t.co/mRwlnjS5MA"]["Thank you @JoeBiden &amp; the entire Biden family for serving as an example &amp; source of strength for my own family. https://t.co/qmmw5rjdUj"]["Today @POTUS signed the #FY18NDAA, which authorizes $700B to rebuild the military. Congress &amp; the White House must now quickly negotiate a bipartisan budget agreement to secure this critical funding for our troops. https://t.co/GwovVLWpeN"]["Some great photos from the #ArmyNavyGame in @washingtonpost: \"Snow, tradition and a Knight to remember in Philadelphia\" https://t.co/6tMCeT7Eep"]["Great picture @greta! https://t.co/dnHx6HHLkh"]["Must-read @nytimes: \"Fingerprints of Russian Disinformation: From AIDS to Fake News\" https://t.co/ihg9isVk6J"]["Must-read @ejmontini @azcentral: \"Sen. John McCain's message to Gold Star father Khizr Khan\" https://t.co/N7YPBNvkxE"]["Congrats @SunDevilHoops on an incredible #5 ranking in the @AP Men’s Basketball poll - the first top 10 ranking since 1981! #ForksUp https://t.co/gq5EP0uXuc"]["The first upgraded Stryker, the Dragoon, has arrived in #Europe as a result of the #FY16NDAA's requirement for expedited Stryker upgrades. This represents another step forward for bolstering deterrence in Europe. https://t.co/2bGAPmMREp"][".@AZPMnews: \"Decades-Long Dispute Over #Arizona Tribe's Water Rights May Soon Be Resolved\" https://t.co/TqXLrf3SoA"]["Cindy &amp; I are praying for everyone in #NYC following this morning's terrorist attack. We appreciate the bravery &amp; swift action of all law enforcement &amp; first responders. #NYCStrong"]["Congrats to @LarryFitzgerald on another record-breaking game &amp; the @AZCardinals on a great win today! https://t.co/vJmLM2pfB0"]["Congrats to @ArmyWP_Football &amp; @NavyFB on a great game today. You represent the best among us &amp; make us so proud! #ArmyNavyGame"]["Let’s go @NavyFB! #GoNavy #BeatArmy https://t.co/maL29O9ZGg"]["Sent letter w/ @SenatorCardin to @POTUS urging him to recommit to human rights at home &amp; abroad as the world marks #HumanRightsDay this weekend. Read our full letter: https://t.co/2Qa6RHMpLL"]["Every day we spend on a Continuing Resolution is a day our military must try to do more with less &amp; troops' lives are put at risk. We need a bipartisan budget agreement to rebuild our military. https://t.co/JwM3vI9rfs"]["Even as order seems to have yielded to chaos, both here &amp; abroad, no one should make the mistake of betting against America. https://t.co/hLEf22000v https://t.co/4FQgyfFcto"]["#TBT to summers on Oak Creek with @MeghanMcCain! https://t.co/TSMYdjNZQl"]["Thank you @SenatorStrange for your important contributions to the Senate Armed Services Committee, your unwavering commitment to our men &amp; women in uniform &amp; your outstanding service in the U.S. Senate for the people of #Alabama. https://t.co/lZeSp37mh9"]["Congrats to my dear friend &amp; @NavalAcademy roommate Frank Gamboa on receiving @latinomuseum's Valor Award. Frank was the first Mexican-American naval surface warfare officer ever to command a major ship. He is the embodiment of the American dream &amp; an inspiration to all of us. https://t.co/8ycDRT2xdV"]["My opening statement at #SASC hearing today on @DeptofDefense acquisition reform: https://t.co/hkLu2MCaFY Watch live: https://t.co/NUSfZyTTKI"]["I'm holding a #SASC hearing on @DeptofDefense acquisition reform efforts - watch live: https://t.co/NUSfZyTTKI"]["On December 7, 1941, history swung on its great hinge &amp; the world was forever changed. Today, we remember the Americans who bravely answered their summons to duty at #PearlHarbor &amp; gave all that duty asked of them. https://t.co/H8fqmO6T1h"]["I've long believed #Jerusalem is the true capital of #Israel. Today's announcement should be part of a comprehensive diplomatic strategy in coordination w/ regional partners to achieve peace &amp; security btw Israelis &amp; Palestinians. https://t.co/H9QxdmZSCQ"]["Great to see you @GeneralBrnovich &amp; thanks for all you do for #Arizona! #GoNavy https://t.co/x7MugGzAWk"]["Cindy &amp; I are praying for all those impacted by the #CaliforniaWildfires. Thanks to #Arizona's brave firefighters who have deployed to battle the blazes. https://t.co/LFBK5bNFlS"]["STOP THE PRESSES! https://t.co/5xj1z4X8tI"]["Must-read @washingtonpost: \"Brothers in arms: Four siblings wrote hundreds of letters to each other during World War II\" https://t.co/Jf8MCMjZQS"]["Unacceptable we still don't have a budget deal. When @POTUS &amp; congressional leaders meet this week, they must finalize a multi-year agreement to raise the budget caps for defense &amp; ensure our military is sufficiently funded. https://t.co/Ma7OKrU5YD"]["Deeply saddened by the passing of Navajo Code Talker George B. Willie Sr. I had the great honor of meeting this hero in Navajo Nation last year. His sacrifice - and that of all Code Talkers - for the cause of freedom will never be forgotten. https://t.co/Nv5zWLvGdI https://t.co/Qv3BTZk3mw"]["IOC's decision to ban #Russia from Winter @Olympics is a welcome step in serving justice to #Putin’s gov't for its elaborate doping scheme. @FIFA should add this to the list of reasons why @FIFAWorldCup should not be held in Russia. https://t.co/MP9XE2JFF3"]["The murder of fmr Yemeni President Ali Abdullah Saleh proves that the Houthis &amp; their Iranian sponsors have no interest in peace.\n\nI hope that Saleh’s supporters &amp; allies will continue efforts to confront the Houthis &amp; seek a peaceful end to this conflict https://t.co/tkjzsn8mS8"][".@PaysonRoundup #Arizona: \"End to ‘fire borrowing’ proposed\" https://t.co/evWYdttDrl"]["Must-read @WSJ: \"Trump Leads From Behind in #Syria\" https://t.co/XihmOa4Xtw"]["We're only 74 Twitter followers away from 3M - spread the word &amp; help us reach this big milestone!"]["Proud to introduce bill w/ @JerryMoran to transform @DeptVetAffairs into a 21st century health care system. Our bill has the support of @AmericanLegion @AMVETSHQ &amp; @ConcernedVets. More info: https://t.co/lIMhKImIca"]["Welcome to #Arizona Herm Edwards! https://t.co/shPNF8X9Wo"]["My @HASCRepublicans colleague @MacTXPress kicked off @ReaganDefense Forum at the Reagan Library in #CA this morning. Be sure to tune-in to all the great panels taking place throughout the day. #RNDF https://t.co/XSOxyzkC4O"]["Thanks @haimsaban &amp; @BrookingsInst for putting on another great #Saban17 Forum https://t.co/NObAiNOKen"]["Humbled to be honored @BrookingsInst’s #Saban17 Forum today. The three amigos were back together on one stage to discuss our critical US-#Israel alliance &amp; the importance of US international leadership. https://t.co/X8S2kSgYcr"]["Sedona is #1 in my book! https://t.co/PkRSGzYFkU"]["ICYMI @AZPMnews: \"U.S. Senate Passes Tribal AMBER Alert Bill\" https://t.co/WSDQxR8zbv"]["I agree with the @washingtonpost: \"Rename the Block in Front of the Russian Embassy\" https://t.co/zeQnyUNXHy"]["Good to see Senate Interior Appropriations bill includes a provision to boost federal resources for fighting wildfires in #Arizona &amp; around the country. https://t.co/gJuLoaxULe"]["Glad @FAA &amp; #Phoenix have agreed to resolve path changes @PHXSkyHarbor through process that ensures Valley residents have an opportunity to make their voices heard. https://t.co/dRlb7TqoY4"]["Very proud the Senate unanimously passed my bill w/ @SenatorHeitkamp to expand the AMBER Alert child abduction warning system on Native American reservations. https://t.co/4QHnX2F762"]["Must-read @starsandstripes: \"Experts: US faces daunting challenge in new defense strategy\" https://t.co/fHYZ9NwYYn"]["Great meeting with @KingAbdullahII yesterday. #Jordan is an important partner in the fight against terrorism &amp; the security of the Middle East. https://t.co/kO2DvFf5Ah"]["Great to see the #FY18NDAA is on it's way to the White House for signature. This bill is critical to rebuilding the Armed Forces &amp; addressing the military readiness crisis. https://t.co/SB4PsJaHqi"]["After careful consideration, I have decided to support the Senate #TaxReform bill. Though not perfect, this bill will deliver much-needed reform to our tax code, grow the economy &amp; provide long overdue tax relief for American families. https://t.co/BeWZAT0SjM https://t.co/6qwYhmyE5p"]["Holding a #SASC hearing now on recommendations for a future national defense strategy.\n\nBe sure to watch live→ https://t.co/Ka0w6d6qo8"]["Thank you @MayorStanton &amp; the #Phoenix City Council. I'm deeply humbled &amp; honored. https://t.co/9i1L2woOGU"]["Must-read by Bob Zoellick in @WSJ: \"The Peril of Trump’s Populist Foreign Policy\" https://t.co/fLkpiBv3YQ"]["Glad to see DC Council take up bill renaming street outside Russian Embassy \"Boris Nemtsov Plaza.” I'm a cosponsor of a bill to do the same. After his brutal murder, #Putin is trying to bury even the memory of Nemtsov. We must remember his legacy. https://t.co/mnDs9ELUTM)"]["Our nation owes a debt of gratitude to the Navajo Code Talkers, whose bravery, skill &amp; tenacity helped secure our decisive victory over tyranny &amp; oppression during WWII. Politicizing these genuine American heroes is an insult to their sacrifice."]["Must-read @RNicholasBurns &amp; Amb Ryan Crocker in @nytimes: \"Dismantling the Foreign Service\" https://t.co/qMAYJXVeum"]["Must-read @washingtonpost: \"A hug that says volumes about the situation in #Syria\" https://t.co/9sXfEnDZ42"]["Thank you to our Iranian-American friends for this thoughtful video celebrating our daughter @MeghanMcCain’s wedding! https://t.co/bKB1oopdaC"]["Thank you for your support &amp; best wishes. My left leg was doing extra work to compensate for the boot, so I'm giving it a break. I still hate wearing this boot, but it won't slow us down from frying 7 turkeys today!"]["Mother, father &amp; puppy of the bride in beautiful Cornville #Arizona yesterday! https://t.co/sd3rsye1OV"]["Praying for all involved in @USNavy aircraft crash as search &amp; rescue efforts continue. The Senate Armed Service Committee is closely monitoring the ongoing investigation to determine why this happened."]["Yesterday I was deeply blessed to give away my little girl at a ceremony with family &amp; friends in #Arizona. Congratulations @MeghanMcCain &amp; @bdomenech - we are so happy for you! https://t.co/UYoyR1QVYo"]["Thank you @michaelcrow &amp; @ASU for your commitment to the Rio Salado project! https://t.co/afqIwD8aDR"]["This demonstrates yet again @POTUS mistakenly believes the US &amp; #Russia share interests - and it's further evidence we desperately need a strategy for #Syria https://t.co/6OeDn2TNFu"]["Cindy &amp; I send our deepest condolences to the families of the @usairforce pilots killed &amp; injured in crash near Laughlin AFB. We must do more to ensure our troops are prepared, ready &amp; well-equipped. https://t.co/tF55tcYogS"]["Great news! Get up north to @AZSnowbowl! \"#Arizona Snowbowl opens Tuesday to kick off 2017 season\" https://t.co/X2Krkth2M4"]["Thank you @HFXforum for this tremendous honor &amp; for all that you do to promote democracy, security &amp; prosperity around the world. https://t.co/W53AYrKL9F"]["Way to go @LarryFitzgerald! https://t.co/pMEQPKhIwA"]["Positive move by Trump admin responding to assault on human rights &amp; democracy in #Cambodia https://t.co/En68H4D6Oh"][".@MacTXPress &amp; I call on budget negotiators to meet Congress’s constitutional obligation to give our troops the resources they need. Without that, @POTUS's promise to rebuild our military will be impossible. https://t.co/bfGiv1Gaab"]["I applaud @senorrinhatch &amp; @GOPSenFinance on completing markup of #TaxReform &amp; moving it through the regular order w/ hearings, debate &amp; amendments. https://t.co/Jsjz5CjGzg"]["Sad to hear about the passing of Ferdie Pacheco - one of the great personalities of boxing. RIP. https://t.co/7RMJcgGmoS"]["Proud the Senate passed my resolution w/ @SenatorDurbin reaffirming America’s commitment to democracy, justice &amp; human rights in #Cambodia https://t.co/BkXRCfGdyF"]["8 years ago today, Sergei Magnitsky was murdered at the hands of Vladimir Putin. We must draw strength from his example &amp; stand with those who fight for freedom around the world. https://t.co/pjDH6GrhYt"]["Vladimir Putin’s complicity in Assad’s crimes against humanity is nothing new. This veto is only the latest confirmation.\nhttps://t.co/EylmDCA9Lu"]["I urge @POTUS to sign #FY18NDAA into law &amp; acknowledge this is the level of defense spending necessary to confront challenges of a dangerous world. Huge bipartisan majorities of both House &amp; Senate agree!"]["FY18 started nearly 2 months ago. We cannot delay any further in appropriating these vital resources for our military -- it would be an abdication of our responsibility."]["We must not delay in appropriating these vital resources for our military. Any further delay would be an abdication of our responsibility."]["Bipartisan support for the #FY18NDAA authorizing $700B for defense shows Congress is committed to rebuilding our military."]["To my #Vietnam comrade Tom Ridge - get well soon! https://t.co/f9srGOckTx"]["I'm proud the Senate overwhelming passed #FY18NDAA, which will provide our Armed Forces the resources, training &amp; equipment they need to keep us safe. https://t.co/fZ2HbOD7dw"]["#Cambodian Court dissolving the opposition party is an attack on democracy. The Trump admin should sanction officials responsible for violating human rights &amp; subverting freedom. https://t.co/AJbBkpyVBk"]["My opening statement at #SASC hearing to consider two @DeptofDefense nominees today: https://t.co/NvAVK8FJPl"]["As #Putin moves to designate international media outlets as foreign actors, the US must make clear there is no equivalency between @RT_com &amp; TV networks like @CNN, @BBC &amp; @VOANews https://t.co/B1OO5FXqGi"]["Deeply disturbed by a new @ASU study showing in 2016, #Arizona veterans were 4 times more likely to commit suicide than non-veterans. Strong action is needed to end this national tragedy. https://t.co/S4hCMiUlDr"]["Great news. We're all pulling for you @krauthammer! https://t.co/oCm8npfyNs"]["Honored to be recognized with @AzCapitolTimes' Lifetime Achievement Award - thank you for this undeserved honor! https://t.co/IBc4SeV06s"]["I was deeply honored to receive the Outstanding Civilian Service Medal from @ArmyChiefStaff, the highest award the Army Chief can bestow upon a civilian. I'm humbled &amp; grateful for this tremendous honor. https://t.co/4SME00GV3r"]["Sad to hear about the loss of Tom Hudner, a true American hero. Every Naval aviator knows his story &amp; every American should. RIP. https://t.co/dwkFRGcKvg"]["I'll be speaking on the Senate floor supporting the nomination of Mark Esper to be Secretary of the Army - watch: https://t.co/XyevwrA02L"]["Thank you @ArmyChiefStaff &amp; @MDW_USARMY for the wonderful \"Salute from the Chief\" Twilight Tattoo performance last night. We are so proud of our service members! https://t.co/EBfZ1JOf0e"]["I will not support a nominee who justified the use of torture. Our enemies act without conscience - we must not. https://t.co/lHSbDXpaG5 https://t.co/IiWTVRSE9G"]["Congrats Torey on an outstanding season leading an outstanding team! #Dbacks https://t.co/g5bnON6IVB"]["Grateful to be honored by @ArmyChiefStaff at tonight's @MDW_USARMY Twilight Tattoo performance, starting shortly. Watch the livestream→ https://t.co/whxI7v45o5"]["Deeply honored to be with @ArmyChiefStaff &amp; @USArmy for tonight's \"Salute from the Chief\" Twighlight Tattoo. Watch live at 6:30pm ET: https://t.co/whxI7v45o5 https://t.co/2WcsrRSg4i"]["Congrats @MayorStanton on this well-deserved honor! https://t.co/N8u2YplyxF"]["I'm humbled to be honored by @ArmyChiefStaff &amp; @USArmy at tonight's special Twilight Tattoo @MDW_USARMY. Watch the entire performance tonight at 6:30pm ET/4:30pm MT: https://t.co/whxI7v45o5"]["Today I opposed the nomination of Steven Bradbury to be General Counsel of DOT. I will not support any nominee who justified the use of torture by Americans. Our enemies act without conscience - we must not. https://t.co/4HG8YVhY84"]["I'll be speaking on the Senate floor at approx. 4:15pm ET/2:15pm MT on my opposition to the nomination of Steven Bradbury to be General Counsel of DOT - watch live: https://t.co/op4fZB98DF"]["Must-read @washingtonpost: \"The accord about #Syria puts too much trust in #Putin\" https://t.co/UmmmXf0sSM"]["Heading to a #SASC hearing on @DeptofDefense nominations.\n\nBe sure to watch live→ https://t.co/CV5QJfBLCX"]["Birds of a feather! https://t.co/1N0r7wr4tk"][".@LarryFitzgerald is not only an @AZCardinals legend, but also selfless leader off the field. Be sure to watch \"A Football Life\" on @nflnetwork tonight at 8:30PM ET! https://t.co/VwVA5hdhyT"]["Must-read @WSJ: \"A #Nafta Recession? The biggest threat to the Trump economy is his trade agenda\" https://t.co/CcNshLqd3m"]["@POTUS And human rights obviously not a priority in @POTUS’s meeting with Duterte – again, sad."]["Remarkable trip down memory lane @jonkarl @ABC! \"Inside the 'Hanoi Hilton' prison that housed John McCain\" https://t.co/mzBU9iBrcB"]["Close - October 26, 1967! https://t.co/gQGwQGuoB1"]["There's nothing \"America First\" about taking the word of KGB colonel over US intelligence community. There's no \"principled realism\" in cooperating w/ Russia to prop up murderous Assad regime. To believe otherwise is naive &amp; places nat'l security at risk. https://t.co/SYiVHtHXPX"]["Our veterans’ valor &amp; devotion to duty have earned the country’s abiding concern for their welfare. #VeteransDay https://t.co/TazCzm6jh1"]["Must-read @BretStephensNYT: \"Trump in the Age of the Strongman\" https://t.co/0ZZXRz7Nbw"]["Congrats Goldy! #Dbacks https://t.co/EQIgUd0L3V"]["The sacrifices made by veterans deserve to be memorialized in something more lasting than marble or bronze. God bless our vets #VeteransDay https://t.co/Rgkg54rc3z"]["Important @Reuters: \"Opioid abuse crisis takes heavy toll on U.S. veterans\" https://t.co/90oCAAMcM0"]["Must-read @FreemanWSJ: \"An American Soldier\" https://t.co/WBxLbDwUMF"]["Must-read by David Petraeus in @WSJ: \"To Thank #Veterans, Help Them Build Civilian Careers\" https://t.co/eMYLxJX5u4"][".@POTUS in #Danang &amp; no mention of human rights - Sad"]["It’s a privilege beyond measure to live in a country served so well by selfless patriots. God bless our veterans &amp; protect them #VeteransDay https://t.co/4cyPaX0W0K"]["Pleased to see #TaxReform is moving through the regular order w/ hearings, markup, debate &amp; amendments. I've long believed we need to fix our burdensome tax system &amp; am reviewing the Senate bill to ensure it benefits the people of #Arizona."]["The allegations against Roy Moore are deeply disturbing and disqualifying. He should immediately step aside and allow the people of Alabama to elect a candidate they can be proud of."]["Must-read by Bob Gates in @nytimes today: \"Ending #DACA Will Hurt Immigrant Troops\" https://t.co/Z2ia9fPF3A"]["Wonderful to see the @USNavy Ceremonial Guard rehearsing for #VeteransDay activities at the @NavyMemorial! https://t.co/sFjKJ2SpVK"]["My opening statement at #SASC hearing on @DeptofDefense nominations: https://t.co/f1zbbCLVbg Watch: https://t.co/dmAobdv13Z"]["Holding #SASC hearing on @DeptofDefense nominations - watch live: https://t.co/0NCiCYSfJH"][".@washingtonpost: \"Senate and House negotiators strike defense bill deal that outspends Trump\" https://t.co/zu0LMydGCj"]["Glad to see Secretary Mattis taking seriously this important issue https://t.co/ffLrV3Aca6"][".@dcexaminer: \"House and Senate reach deal on budget cap-busting $700 billion defense bill\" https://t.co/oMOZzJQGSB"][".@starsandstripes: \"Lawmakers agree on defense bill deal featuring 2.4 percent military pay raise\" https://t.co/qpFlgfG45m"][".@AP: \"House, Senate Negotiators Agree on $700 Billion for #Pentagon\" https://t.co/S7AwsxGqcX"]["Great seeing some Mississippians in the Capitol today! Generations of McCain's lived in #Mississippi &amp; I served as a flight instructor at NAS Meridian where a field is named for my grandfather. https://t.co/YdymRFcWI5"]["I'm very proud #SASC &amp; #HASC have completed conference on the #FY18NDAA, a vitally imp't bill that will rebuild the military &amp; give our troops the resources they need. https://t.co/nKmZq6cgzR"]["Must-read @WSJ: \"#SouthKorea’s Bow to #Beijing\" https://t.co/Bgyse45hUm"]["Must-read @WSJ: \"A Strategy for the Post-#ISIS #MiddleEast\" https://t.co/D6X065Hs3i"]["Intro'd bipartisan bill today to reform fedl sugar prgm &amp; lower artificially high sugar costs for American consumers https://t.co/aLYouyafhD"]["I'll be speaking on the Senate floor shortly on the need for a comprehensive #MiddleEast strategy - watch: https://t.co/ya7YkeY1Kr"]["My opening statement at #SASC hearing to consider @DeptofDefense nominees: https://t.co/M8PAcCnGHX Watch: https://t.co/tD3vRizPk4"]["Heading to #SASC hearing to consider @DeptofDefense nominees - watch live: https://t.co/nHLE1231Ka"]["#SASC will conduct rigorous oversight of DOD investigation into failure to report to FBI conviction of #TX shooter https://t.co/MlSXGgp6L5"][".@MacTXPress &amp; I welcome @POTUS's amendment to his initial defense budget request - our full statement: https://t.co/Oe8lUgrAGx"]["I can't tell you how much I hate wearing this boot! https://t.co/W6zClDRpFb https://t.co/x3mDC4n11H"]["Must-read @washingtonpost: \"Satellite photographs reveal North Korea’s crimes against humanity\" https://t.co/VxjHBLM8p6"]["Must-read @USATODAY: \"Pass the bipartisan Alexander-Murray health care fix\" https://t.co/4NkkKiYbp4"]["Praying for all impacted by horrific shooting in Sutherland Springs #TX &amp; grateful to officers &amp; 1st responders for their courageous action."]["I'll be sending an early Christmas card to Jacob Thompson &amp; I hope you will too! https://t.co/czGd533QaL"]["Remarkable! https://t.co/Ms1BxhJ991"][".@PaysonRoundup: \"McCain, Flake send letter to Forest Service on Fossil Creek\" https://t.co/DiUVPhCtOC"]["Intro'd bipartisan bill today to hold #Burmese military officials accountable for atrocities against the #Rohingya https://t.co/7Xmzy9NWvp"]["Congrats @MeghanMcCain &amp; @bdomenech on announcing your engagement! We are so happy for you &amp; thrilled to welcome Ben to our family. https://t.co/wNt1506SJc"]["I sat down with @tombrokaw on @TODAYshow to discuss my speech @NavalAcademy, my service in #Vietnam &amp; the political turmoil in our country. https://t.co/mU6tH15OAU"]["Holding #SASC hearing on @DeptofDefense nominations - watch live: https://t.co/kr8KWiOMMm"]["Be sure to watch my interview with @tombrokaw on @TODAYshow @nbc this hour where we'll discuss service &amp; American leadership"]["I believe in Americans. We’re hopeful, compassionate people who have upheld the values that have made our nation a beacon to the oppressed. https://t.co/3iNWJhkfuX"]["It's always a special privilege to listen to @NavalAcademy's wonderful men's &amp; women's glee club. https://t.co/bLU2xTvuR9"]["Must-read @weeklystandard: Why Is This Law Still on the Books?\" https://t.co/tQD7Mz87D5"]["Agree w/ @AEI: \"After Canada, it is time for the EU’s Magnitsky Act\" https://t.co/AoQoT4cSv0"]["#NYC terror suspect should be held &amp; interrogated as an enemy combatant consistent with the Law of Armed Conflict. https://t.co/lBfWa2PPvM"]["Praying for all those impacted by the tragedy in #NewYorkCity. Thanks to first responders &amp; law enforcement for their quick action."][".@capgaznews: \"John McCain at Naval Academy: 'It's time to wake up'\" https://t.co/ivQVkGI7hd"][".@wbaltv11: \"Sen. McCain returns to U.S. Naval Academy to speak with midshipmen\" https://t.co/JSSQIm4tjN"]["We must see Putin's attack on our election for what it is: a campaign to weaken &amp; destabilize democracies everywhere https://t.co/RC8XfrFZsU"]["Informative briefing today on @USNavy collisions at sea - #SASC will continue oversight to prevent future tragedies. https://t.co/dShPOGzkS1"]["Speaking on Senate floor soon to thank @NIH &amp; @MayoClinic for the great work they do for all cancer patients- watch: https://t.co/1WlE2GdeJo"]["ICYMI: Watch my full address to the Brigade of Midshipmen @NavalAcademy last night in Annapolis, MD → https://t.co/tZJv8KjE2C"]["Wonderful night speaking to the impressive Brigade of Midshipmen @NavalAcademy - read my full remarks: https://t.co/k3J1I4crQz https://t.co/mwOigdvyrE"]["Wonderful spending tonight with @RSwiftMcCain &amp; our grandson John McCain V! https://t.co/7oEX8kPtri"]["Our sailors will always know to serve this country is to serve its ideals. It is a noble cause that's worth living &amp; dying for. https://t.co/xwv1rlFhHV"]["Honored to address the Brigade of Midshipmen @NavalAcademy, a place that taught me lessons that have guided my life https://t.co/wTwBzkYyQZ https://t.co/OEIT6rBsne"]["Deeply honored to address the Brigade of Midshipmen @NavalAcademy today. I'll never forget the lessons imparted on me during my time there. https://t.co/e6HrfZeTJM"]["I believe in Americans and the American dream, but it’s time we wake up. https://t.co/QmSIqP0TEs"]["I'll be addressing the Brigade of Midshipmen @NavalAcademy shortly about importance of service.\n\nBe sure to tune-in: https://t.co/AeTEHRR1Bk"]["Tonight, I'll be returning to @NavalAcademy to address the Brigade of Midshipmen. Be sure to tune-in at 7:00PM ET https://t.co/AeTEHS8CZU"]["Must-read @anneapplebaum @washingtonpost: \"#Russia is furious. That means the sanctions are working.\" https://t.co/IysHJ3swjf"]["Privileged to honor the 10 sailors whose lives were lost aboard USS McCain. We'll always remember their sacrifice. https://t.co/2Udt1r1a2l https://t.co/AMPcIHhhkC"]["Must-read @MaryAnastasiaOG @WSJ: \"Trump’s States Need #Nafta\" https://t.co/0HI8hUTVs3"]["Must-read @washingtonpost: \"Trump needs to say something — and do something — about the assault on the #Rohingya\" https://t.co/qpLcLkUhDV"]["Must-read @washingtonpost: \"Trump administration stalled on whether to arm #Ukraine\" https://t.co/1aIxgax0NE"]["Must-read @latimes: \"Want to attack foreign election meddling? Hold internet ads to the same standard as radio &amp; TV\" https://t.co/63dJRUyKHZ"]["Happy #NavyDay! Saluting America's brave sailors, whose patriotism &amp; sacrifice make our country so proud. cc: @USNavy @NavalAcademy https://t.co/3O5znjKJk9"][".@KVOA #Tucson: \"McCain asks for help for red squirrel\" https://t.co/cvn7AAj04x"]["Must-read @SenAlexander &amp; @SenatorRounds: \"Health Care Needs a Bipartisan Fix\" https://t.co/SyYPfoTGRX"]["Must-read @NRO: \"What #NAFTA Does\" https://t.co/ecj9SqWEip"]["Must-read @jaynordlinger @NRO: \"Vladimir Putin's Consolation Prize\" https://t.co/8qT1bFeQK4"]["Must-read @WSJ: \"#PuertoRico’s Backlog: Much-needed supplies pile up while the #JonesAct delays delivery\" https://t.co/WaqavPkzo0"]["Arizona is proud to welcome its tallest Christmas tree, an 80 ft. beauty that just arrived in Anthem #Arizona! https://t.co/8Z30T50Oup"]["Admin guidance on #Russia sanctions implementation good 1st step in holding Russia accountable for election attack https://t.co/pePmC7sTGe"]["Glad to have @ASU’s support &amp; look forward to working together on the Rio Salado project. https://t.co/E5JhsbpjsP"][".@USATODAY: \"John McCain's 50-year anniversary: Since #Vietnam plane crash, an exceptional life\" https://t.co/X14QLGM96G"]["Good briefing from #Pentagon on #Niger operation today - look fwd to receiving regular updates from admin in future https://t.co/jc267ftLNQ"]["Wonderful must-read by my son @McCainJack on family, legacy, service &amp; sacrifice via @USNHistory https://t.co/tAwp8gmHwn"]["Must-read @joshrogin @washingtonpost: \"Time’s up for Trump to implement new #Russia sanctions\" https://t.co/xYHW07kPJr"]["Hard to believe 50 years ago today my plane was shot down in Vietnam. The honor of my life was to serve in the company of heroes in Vietnam. https://t.co/UhKff5HYzP"]["Looking forward to #SASC briefing from #Pentagon on #Niger operation this morning to get the answers Congress needs."]["Sent bipartisan ltr urging @POTUS to demand Pres Erdogan to stop harassing American diplomats &amp; respect human rights https://t.co/lCrQ0cOYKR"]["Heading to \"pass the gavel\" meeting to formally kick off #FY18NDAA conference w/ @SenJackReed @MacTXPress &amp; @RepAdamSmith"]["Important @WSJ: \"Bipartisan Senate Health Bill Would Reduce Deficit by About $4 Billion Over Decade\" https://t.co/lrPqLJpmLK"]["ICYMI: My op-ed in @nytimes today: \"We Need a Strategy for the Middle East\" https://t.co/CXBKYAVmoz https://t.co/dJabdyCkaX"]["My piece in @TXNatSecReview: \"Overcoming Gridlock to Reassert Congress’s Role in Deliberating National Security\" https://t.co/pqfKl8rCN3"]["Read my op-ed in @nytimes today: \"We Need a Strategy for the Middle East: We can start by supporting our allies.\"\nhttps://t.co/CXBKYAVmoz"]["It’s been one of the great honors of my life to serve w/ @JeffFlake– a man of integrity, honor, decency &amp; commitment to Arizona &amp; the nation https://t.co/DOHAoHx0d2"]["I'm speaking on the Senate floor honoring the great leadership &amp; service of my dear friend @JeffFlake - watch: https://t.co/rsVKwR3bTa"]["Thank you to my dear friend @JeffFlake for your honorable service to the state of #Arizona &amp; the nation."]["Must-read @azcentral: Alexander-Murray \"is a quick fix. But it is what we need now.\" https://t.co/6TJW9MvExx"]["Must-read @LaurieRoberts @azcentral: \"Roberts: John McCain and Meghan McCain provide us a moment\" https://t.co/gzIBzAtDn4"]["It's time we lift the national dialogue, stop insulting each other &amp; start respecting each other. @TheView https://t.co/SdE3e7hQam"]["Congratulations to Japanese PM Shinzo Abe &amp; the LDP on their election victory. #Japan remains an indispensable ally to the United States."]["Bill Browder is a champion of anti-corruption in #Russia. DHS must immediately review decision to revoke his visa. https://t.co/j0Pzt8t9QH"]["I'll be joining my daughter @MeghanMcCain live on @TheView this morning for her birthday! Be sure to tune-in now!"]["Getting ready to join @TheView @ABC on @MeghanMcCain's birthday! https://t.co/8Hy7hyfC1N"]["Happy birthday to our wonderful daughter @MeghanMcCain - grateful to be celebrating with you on @TheView today! https://t.co/97I3mSPSsj"]["Must-read @hiattf @washingtonpost: \"The point McCain and Bush made is much bigger than Trump\" https://t.co/FBn1LM7vww"]["Must-read @RHFontaine @CNASdc: \"A Tale of Two Speeches\" https://t.co/MVqZSGlLY2"]["Get well soon Carson Palmer! @AZCardinals"][".@JRubinBlogger @washingtonpost: \"Distinguished Pol of the Week\" https://t.co/n0zvxQbyMv"]["Must-read @washingtonpost: \"Trump shouldn’t repeat Obama’s mistake in #Iraq and #Syria\" https://t.co/PhbZpGqRLP"][".@nytimes: \"McCain in Twilight\" https://t.co/uEwSszUBPM"]["Pleased the VA's Veterans CARE Act proposal solidifies Vets Choice Prgm &amp; incorporates reforms I've long advocated https://t.co/dnhxPrK8Kg"]["Pleased Senate approved language in the Budget Resolution to allow a boost to #FY18NDAA funding levels. Now let's get to work on a cap deal."]["Glad to cosponsor short-term bill w/ @SenAlexander &amp; @PattyMurray  to stabilize individual health insurance markets https://t.co/qLSJx0WDS5"]["Thank you @nytdavidbrooks: \"The Essential John McCain\" https://t.co/Cmrqj5KlOD"]["Great to see our friends in #Canada pass the Global Magnitsky Act to fight corruption &amp; stand up for human rights https://t.co/SOCzQWBz9E"]["Russia's attack on our election was an attack of enormous proportions. @DeptofDefense must play lead role in defending against cyberattacks. https://t.co/HqD4DYcYa2"]["Important speech by my friend, President George W. Bush today, reminding us of the values that have made America a beacon of hope for all."]["Speaking on the Senate floor on the budget resolution &amp; the important work ahead to fully fund the military - watch: https://t.co/FMxh0pd7cw"]["Heading to Senate floor to discuss importance of fully funding military &amp; giving troops resources they need- watch: https://t.co/FMxh0pd7cw"]["Introd bill w/ @amyklobuchar &amp; @MarkWarner to safeguard our elections &amp; improve transparency of online political ads https://t.co/iN8wbwvyUi"]["For years we have lacked policies &amp; strategies to counter our adversaries in cyberspace. Unfortunately, we still do. https://t.co/CInCcS8S8t https://t.co/7v4vyL4FqP"]["Current structure of responsibilities for cyber defense is too convoluted &amp; siloed. We must have a strategy to defend against cyberattacks. https://t.co/broaC7b8ht"]["Heading to #SASC hearing on roles &amp; responsibilities for defending the nation from cyber attacks - watch: https://t.co/Gp4AVJFuuc"]["Must-read @BretStephensNYT: \"McCain the Hedgehog vs. Bannon the Honey Badger\" https://t.co/MrdvsbxKsT"]["@JeffFlake Intro'd amdt w/ @JeffFlake to fully fund wildfire management as catastrophic wildfires grow in frequency &amp; intensity https://t.co/OjVpborJTH"]["&gt;20% of AZ pine forests have been consumed by wildfire. @JeffFlake &amp; I want to boost resources to fight fires &amp; restore forest ecosystems. https://t.co/ofX1JZrhcP"]["Congratulations to Parker, #Arizona native Mariah Jordan Sharpe on becoming the next Miss Indian Arizona! https://t.co/X69zqcm3Tj"][".@johnfkirby63 @CNN: \"Everyone should read John McCain's speech\" https://t.co/dGNk21nI3V"]["My #LibertyMedal speech in @WSJ's Notable &amp; Quotable Today: \"The Most Wonderous Land\" https://t.co/3EUjEs4kGE"]["I want to commend @SenAlexander &amp; @PattyMurray for reaching an agreement to stabilize health insurance marketplace https://t.co/DdqAX70hZg"]["I support the budget resolution so we can get to #taxreform. But, we must negotiate a deal to lift caps on defense. https://t.co/z6WOoHAFMk https://t.co/PgHXPmHry6"]["I congratulate US &amp; coalition forces for retaking #Raqqa, which represents a major victory in the fight vs #ISIS. https://t.co/DDwV2rwYxN"]["It was a tremendous honor to receive @ConstitutionCtr's #LibertyMedal from my friend @JoeBiden. Watch our interview on @6abc #Philadelphia. https://t.co/IV5lHIjp2l"][".@azcentral: \"Sen. John McCain receives #LibertyMedal from Joe Biden\" https://t.co/N0PVVhQ7xy"]["Must-read @WSJ: \"Assault on the Kurds: Defeat for the U.S. allies in northern #Iraq is a victory for #Iran\" https://t.co/N6IumXwxD7"]["I look forward to working w/ my colleagues in the House to conference &amp; pass the #FY18NDAA so we can get our troops the resources they need. https://t.co/qDSjxyb6nG"]["Deeply humbled to receive @ConstitutionCtr's 2017 #LibertyMedal from my dear friend @JoeBiden. Thank you for this great honor. https://t.co/iNypjDAiQM"]["To refuse US leadership for half-baked nationalism is as unpatriotic as any dogma consigned to ash heap of history https://t.co/Y07Sxa1b7V https://t.co/Jf1nit7X3n"]["I’ve had the good fortune to spend 60 yrs in service to this wondrous land &amp; I’m so very grateful for the privilege  https://t.co/D7Yj3Yq1G8 https://t.co/Qr4EQBJL6x"]["May God bless America &amp; give us the strength wisdom generosity &amp; compassion to continue to do our duty for the country we love #LibertyMedal https://t.co/ldztxaNoKy"]["I've been blessed to spend my life serving something more important than myself, of being a bit player in the story of America #LibertyMedal https://t.co/lHi0MpeaLW"]["Join me live at the @ConstitutionCtr’s #LibertyMedal awards shortly. Be sure to watch my speech here: https://t.co/17gSsjgA16"]["Grateful to be @ConstitutionCtr with my dear friend @JoeBiden for the #LibertyMedal Award Cermony in #Philadelphia https://t.co/kNqjpycouk"]["Be sure to tune in tonight to @ConstitutionCtr's Liberty Medal ceremony at 7PM. I'll be delivering a speech live: https://t.co/17gSsiYYCw"]["I'm humbled to receive @ConstitutionCtr's #LibertyMedal from my friend @JoeBiden. It's an honor I'll always treasure https://t.co/zm37QgrR2B https://t.co/JZFarezrTN"]["Must-read @WSJ: \"Trump’s #Nafta Threat: Ending the pact would be the worst economic blunder since Nixon\" https://t.co/66SPnsNXAO"]["Deeply concerned by reports of military advances by Iraqi government forces against Kurdish positions near Kirkuk https://t.co/ckBDwkKyVf"]["Must-read @WSJ: \"America Out of Unesco: The U.S. shouldn’t finance the anti-Israel U.N. agency\" https://t.co/kP8ZPSxWkz"]["Glad to hear my friend @SenatorCollins will remain in the Senate. She's one of the finest senators I've ever known!"]["Happy Birthday @USNavy! Honored to be part of a Navy family &amp; proud of our brave sailors who serve &amp; sacrifice every day. https://t.co/BZp7f1unBT"]["Admin's decision to withdraw from #UNESCO is the right decision at a time when anti-Israel bias is increasing. https://t.co/O86iYQ0Bcb"]["Thank you to #Arizona's courageous firefighters who have deployed to assist #California https://t.co/1MdCngALrc"]["Cindy &amp; I are praying for everyone impacted by the wildfires raging in #California &amp; our brave firefighters battling the blazes."]["Absolutely horrific. @nytimes: \"#Rohingya Recount Atrocities: ‘They Threw My Baby Into a Fire’\" https://t.co/7H15iGnMHp"]["This is a direct result of cuts to defense spending @NavyTimes: \"Surveys reveal disastrous morale on cruiser Shiloh\" https://t.co/J6dtxQ66Fh"]["Glad @POTUS supports $700B for defense, but anything &gt;$549B is currently illegal. Work w/ Congress on a budget deal! https://t.co/Wd4ZySN4kW"]["Must-read @WSJ: \"An Outrageous Prosecution: #Turkey convicts a Journal reporter of promoting terrorism\" https://t.co/XfAPqIMcwS"]["Disturbed Turkish court falsely convicted @WSJ reporter Ayla Albayrak - adds to #Turkey's crackdown on free press https://t.co/ahMIaQcQhQ"]["Strongly agree with @AAF @thehill: \"America should repeal the #JonesAct\" https://t.co/1WlHlAwAQ5"]["Congratulations to the @Dbacks on an outstanding season - #Arizona is very proud!"][".@USArmy's new acquisition &amp; modernization plan is an example of the bold steps necessary to fix a broken system https://t.co/Q4MmJUquur"]["I applaud @EPA's decision to repeal onerous Clean Power Plan, which would have crippled #Arizona's economy https://t.co/pNLYtRB8z6"]["Where's Meghan? https://t.co/RLGc31amY7"]["Must-read @WSJ: \"Pruitt’s Clean Power Break\" https://t.co/vyAEsQ4UME"]["Must-read @MilitaryTimes: \"Demanding details on #Afghanistan strategy\" https://t.co/dcGv7W0MCy"][".@AP: \"Lawmakers Seek #PuertoRico Exemption to Law That Slowed Aid\" https://t.co/RnORZFhXfo"][".@HuffPost: \"#JonesAct Waiver For #PuertoRico Just Expired... PR will go back to paying double shipping costs\" https://t.co/we73BelJDJ"]["Saddened by passing of Navajo Code Talker David Patterson. Our nation is forever indebted to these WWII heroes. https://t.co/XfyH315OM1"]["Now that #JonesAct waiver for #PuertoRico has expired Congress must pass my bill providing PR w/ permanent exemption https://t.co/TTU5FYgc42"][".@MilitaryTimes: \"Senators want more oversight of VA budgets, spending\" https://t.co/m2LqPa0Aqk"]["Must-read @BillKristol @weeklystandard: \"A Republican Crackup?\" https://t.co/1cHdxvcxuW"]["Congratulations @MeghanMcCain on your first day on @TheView. Our family couldn't be prouder of all that you continue to accomplish. https://t.co/75RwGQsZcq"]["Watching @MeghanMcCain's first day on @TheView @ABC - we are very proud!"]["Appreciate the kind words by Matthew Scully @NRO: \"John McCain: Appreciating America’s ‘Imperfect Servant’\" https://t.co/xxs8YpvOXr"]["Must-read @WSJ: \"Why a Nobel Peace Icon Chose to Stay Silent Amid a Crackdown on a Muslim Minority\" https://t.co/Vx056lPjZ3"]["Must-read @WSJ: \"A #JonesAct Head Fake on #PuertoRico\" https://t.co/klDagjCzja"]["Must-read @WSJ: \"Pacific Trade Advances Without US: #TPP is moving ahead in ways that will cost American exporters.\" https://t.co/eD0LYpifkl"][".@Heritage's 2018 Index of US Military Strength underscores our readiness crisis &amp; the need to rebuild the military https://t.co/OgIS4FqISy"]["#Russia's disinformation campaign is part of #Putin’s long-term goal of sowing chaos &amp; undermining democracies https://t.co/Mwiec0ynSp"]["I strongly agree with @MacTXPress &amp; @HASCRepublicans: \"153 House Republicans Support POTUS Call for Defense Budget\" https://t.co/6NlnZong0Y"]["Must-read @business: \"Five Facebook Ads Designed to Divide America at #Russia’s Behest\" https://t.co/3zMTz3Avsa"]["Must-read @Heritage @FoxNews: \"US remains world's most dominant military power. But that power is dwindling rapidly\" https://t.co/kgYUf27huJ"]["Must-read @washingtonpost: \"Let the #Rohingya return to #Burma — immediately\" https://t.co/Z3HoBi3PR2"]["Going into tonight's @Dbacks Wild Card game like... #OurSeason https://t.co/j5EDWSAL5U"]["Proud Senate Committee passed my bill to improve the deployment &amp; management of border security technology https://t.co/lkP3hz4GYF"]["Praying for the recovery of Savannah Sanchez of Tucson who remains in critical condition after the #LasVegasShooting https://t.co/x9jkHGFw9s"]["I join the @UofA community in remembering alum Christina Duarte who was senselessly killed during #LasVegasShooting https://t.co/qk6tYudCRI"]["Praying Jovanna Calzadillas of Salt River #Arizona makes a full recovery following the horrific #LasVegasShooting https://t.co/PyOYxS3wBX"]["Must-read @BillGalston @WSJ: \"The Immigration Reform Americans Want\" https://t.co/qvHpN05fVF"]["Moving ceremony at Yokosuka Naval Base honoring the brave sailors lost aboard the #USSJohnSMcCain https://t.co/aFu6oDGpIV"]["Gerrymandering increases partisanship, paralyzes governance &amp; weakens trust in democracy. SCOTUS should end this practice in #GillvWhitford. https://t.co/qsAPf2VMWj"]["6 wks after @POTUS announced #Afghanistan strategy, we still don’t know the plan for success. Congress &amp; the American people deserve better. https://t.co/B0HpkFdp35"]["Intro'd resolution w/ @SenatorDurbin today promoting democracy, human rights &amp; rule of law in #Cambodia https://t.co/b9Jhn2asbf"]["My opening statement at #SASC hearing on #Afghanistan: https://t.co/pTZ3eIus24 Watch: https://t.co/g77HhXJVpf"]["Very proud of @cindymccain for being honored by @USHCC! https://t.co/ZlIy2JwnWo"]["Chairing #SASC hearing this morning on #Afghanistan w/ @DeptofDefense Sec Mattis &amp; @GenDunford - watch: https://t.co/cLJelvYNCT"]["Must-read @MJGerson @washingtonpost: \"How we should pray after Las Vegas\" https://t.co/sggBu0kymy"]["My heart goes out to families of 2 Navy pilots who died in T-45 crash in TN. We must address mil readiness crisis. https://t.co/VasFZ3z2Tq"][".@phxbizjournal: John McCain’s legacy: a flowing river for economic development\" https://t.co/EcNzIpKqr2"]["If you are trying to locate a loved one, please call: 1-866-535-5654. #LasVegasShooting"]["Cindy &amp; I are praying for the victims of the terrible #LasVegasShooting &amp; their families. We appreciate the bravery of all first responders."][".@LarryFitzgerald - he's the man! https://t.co/N0ncNI3AGJ"]["Outstanding @bobschieffer intvu on @FaceTheNation - one of America's wise men. Look forward to reading his new book! https://t.co/FHHrCcAisP"]["Must-read @USATODAY: \"#JonesAct is a swamp creature that's strangling #PuertoRico\" https://t.co/3tqsdAlRvx"]["Must-read @Peggynoonannyc @WSJ: \"Partisanship Is Breaking Both Parties\" https://t.co/ZBDel4eiFd"]["I agree @dcexaminer: \"#PuertoRico's 'temporary' waiver from the #JonesAct should be permanent\" https://t.co/J5Wf70EGeI"]["Marine helicopter crash is more evidence that we must get our military the training and resources they need. https://t.co/J7uAYEovlz"]["Important statement by Lt. Gen. Silveria @AF_Academy. I agree, there's no place for racism or bigotry in our military or this great nation. https://t.co/B5nNlGFmwE"]["Must-read @washingtonpost: \"The #JonesAct and the perils of political ignorance\" https://t.co/OGjAteNOxg"]["Julia, you're in our thoughts &amp; prayers. We love you! https://t.co/I0LWu0jS4j"]["ICYMI: @cindymccain notes, accurate reporting on human trafficking #s remains one of largest problems for law enforcement in Indian Country https://t.co/cjd1gwfQug"]["Appreciate the kind words of support @JoeNBC! https://t.co/IL11fxzoep"]["Sent letter w/ @SenatorCardin urging admin to apply full US diplomatic influence to resolve the #RohingyaCrisis https://t.co/Pk3xTnWWUD"]["Another recognition from my friends in the Kremlin! https://t.co/VMmgcR0ZA7"]["Intro'd bill w/ @SenMikeLee today to permanently exempt #PuertoRico from the #JonesAct &amp; aid long-term recovery https://t.co/d4OmmNJ1zO"]["Great to have @SteveScalise back in Congress. His perseverance is an inspiration to us all! https://t.co/Hv3jtSwi8o"]["Proud of @cindymccain's effort to end human trafficking. Ystdy @IndianCommittee she addressed the need to stop this crime in Indian Country. https://t.co/XigMFy7AeV"]["Trump admin has finally waived #JonesAct for #PuertoRico. Now Congress must repeal this law to aid long-term recovery."]["Sent letter urging @SecShulkin to address yet another potential funding shortfall for the Veterans Choice Program https://t.co/hXRA0bLVaH"]["Encouraged @SenateFinance is moving #TaxReform thru reg order. Reviewing bill to make sure it boosts jobs &amp; economy. https://t.co/DC1nwXKWy1"]["Glad @PhRMA supports my bill w/ @SenGillibrand limiting supply of opioid prescription for acute pain to 7 days https://t.co/kNaWd79r5l"]["Shipping industry supports #JonesAct b/c it's protectionist. #PuertoRico deserves better than policy decisions driven by special interests."]["Very proud of @cindymccain's dedicated leadership to ending human trafficking. Watch her @IndianCommittee testimony: https://t.co/aUHh4SfQxU https://t.co/OArw5qEqyd"]["Attending @IndianCommittee hearing where @cindymccain is testifying on combating human trafficking in Indian Country https://t.co/aUHh4SfQxU"]["A well-deserved corn maze tribute to @ArizonaCoyotes legend Shane Doan https://t.co/Jl7mhEJNnK"][".@TIME: \"Help for #PuertoRico Is Being Delayed by the #JonesAct\" https://t.co/eUAhdZlUA8"][".@NBCNews: \"What Is the #JonesAct? Opponents to 1920 Law Argue It’s Worsening #PuertoRico’s Crisis\" https://t.co/bR6HNAGbdX"]["I intro'd bill earlier this year to repeal the #JonesAct, which is more imp't than ever for hurricane-ravaged areas https://t.co/Y31u2BE8Ji"]["Must-read @WSJ: \"Second-Class #PuertoRico: Trump declines to waive the #JonesAct for hurricane relief\" https://t.co/yBLJ9TuCoy"]["Today I urged @DHSgov to waive the #JonesAct for #PuertoRico, which is critical for speeding up recovery efforts https://t.co/W7GTROJ8Pz"][".@SenBobCorker is a great friend &amp; Senator. I join the people of #TN in thanking him for his service in the Senate &amp; wishing him the best. https://t.co/R5qG1Ti5pH"]["A step in the right direction, but much more work still needs to be done. https://t.co/fn72khS9bK"]["Now let's return to regular order - hearings, open debate and amendments. https://t.co/NlTmMn79cX"]["Too often, Congress learns about major national security decisions in the media rather than from the administration. This must change. https://t.co/CuXLivzdad"]["My opening statement at #SASC hearing on the reappointment of @GenDunford: https://t.co/VLks8cF3i1 Watch: https://t.co/iwAy5bF4zd"]["Holding #SASC hearing on the renomination of @GenDunford to be Chairman of @thejointstaff - watch: https://t.co/iv5hrAxRZy"]["Must-read @NelsonADenis @nytimes: \"The Law Strangling #PuertoRico\" https://t.co/K9JzkqGzhL"]["Kicking off the morning @TheStudyofWar with my friend @gen_jackkeane to discuss American global leadership #ISWsc17 https://t.co/WE0hHW6V7Z"]["Congrats @Dbacks! #OurSeason https://t.co/74HDi2NvaZ"]["Tune-in to the season-opener of @60Minutes on @CBSNews tonight at 7:30pm ET/7pm PT to watch my interview https://t.co/TO6m3akqC3"]["Thanks for the shoutout last night Stevie Wonder! https://t.co/hxgTh6rJFb"]["Congratulations to Angela Merkel &amp; the @CDU on their election victory in #Germany. The US-German alliance is critical &amp; must remain strong."]["Last night, #VietnamWarPBS featured my capture in #Vietnam &amp; other stories of POWs. Be sure to watch tonight’s episode on @PBS at 8pm ET. https://t.co/Tysq0I8XqI"]["I cannot in good conscience vote for Graham-Cassidy. A bill impacting so many lives deserves a bipartisan approach. https://t.co/2sDjhw6Era https://t.co/30OWezQpLg"]["Wishing a speedy recovery to my dear friend &amp; true American hero @SenatorDole! https://t.co/7K6VZWW1Zc"]["Be sure to watch my interview on the season-opener of @60Minutes @CBSNews Sunday at 7:30pm ET/7pm PT #50yearsof60 https://t.co/VwVZOrCIU5"][".@axios: \"60 Minutes' 50th Anniversary features star-studded cast\" https://t.co/7bje2tJAf0"]["A great day for @USMC! \"Marine Corps to have 1st female infantry officer\" https://t.co/rHaVxcN9nG"]["Sad to hear about the death of Jake LaMotta - one of the great champions of boxing! https://t.co/usGoz8jHpO"][".@nytimes: \"Navy Leaders Pledge to Solve Problems Stretching Limits of Sailors\" https://t.co/3nZxFOn1WL"]["Thank you to my Legislative Director Joe Donoghue for 30 years of loyal service to the Senate &amp; people of Arizona! https://t.co/scDDtW7oPq"]["When I asked @secnav76 what sequestration &amp; continuing resolutions do to the military, he called their impact \"stunning.\" https://t.co/GyeGcmbMh8"]["I agree w/ @MacTXPress - great to see consensus that after years of neglect, our military needs real investment https://t.co/mKgFhztwnn"][".@CNN: \"Navy secretary on recent fatal accidents: 'We have a problem'\" https://t.co/E8NhKQHixq"]["In the last 3 years, fatal training accidents have taken 4 times as many lives than our enemies have in combat. This cannot continue. https://t.co/y3NJ40NRGb"][".@washingtonpost: \"‘You must do better’: McCain puts Navy leaders on notice over deadly sea collisions\" https://t.co/bae7jaQzqP"][".@AP: \"Navy chief: Budget cuts strain force amid ship crashes\" https://t.co/k9roYruCre"][".@Reuters: \"Senate backs massive increase in military spending\" https://t.co/JCaU6KQ0jR"]["Our deepest condolences are w/ families of the brave sailors lost at sea. Our solemn obligation is to look after all who serve in military https://t.co/QboCmTrGps"][".@WSJ: \"Senate Passes Defense Bill to Boost Military Spending\" https://t.co/A8LcDjlVnO"][".@nytimes: \"Senate Passes $700 Billion Pentagon Bill, More Money Than Trump Sought\" https://t.co/xiw7qcalOq"][".@dcexaminer: \"Senate passes $700 billion defense policy bill, heads to conference with House\" https://t.co/mzP5WjS8c4"]["Recent Naval accidents at sea &amp; needless loss of life are unacceptable.We must learn from these tragedies &amp; fix them https://t.co/EqRzx2jR3K"]["Happening now: #SASC hearing on recent @USNavy incidents at sea - watch live: https://t.co/FBaN893yr5"]["Now that #FY18NDAA passed, Congress must appropriate the vital funding we just authorized, starting with a bipartisan budget agreement. https://t.co/zSF33edA3t"]["The Senate's overwhelming &amp; bipartisan passage of the #FY18NDAA delivers America's men &amp; women in uniform the support they need &amp; deserve. https://t.co/OobVOkLIF5"]["Proud the Senate voted 89-8 to pass the #FY18NDAA to rebuild the military &amp; give our troops the training, equipment &amp; resources they need."]["By identifying &amp; eliminating troubled programs, the #FY18NDAA reins in unnecessary defense spending &amp; reinvests savings in our warfighters https://t.co/F8FoCREgy9"]["I'll be speaking on the Senate floor shortly on the Senate's vote to pass the #FY18NDAA, a vital bill for troops: https://t.co/nzqhGvh5mM"]["By authorizing $8.5B in new homeland, regional &amp; space missile defenses, the #FY18NDAA works to counter #NorthKorea’s provocations. https://t.co/nqd5Bgy4ud"]["The #FY18NDAA strengthens our ability to deter &amp; respond to attacks in cyberspace by increasingly aggressive #Russia &amp; #China. https://t.co/cdJOZI7zBn"]["The #FY18NDAA provides a 2.1% pay raise for all troops, improving quality of life for service members &amp; families. https://t.co/byBMaHCb9D"]["Cuts to the military have eroded readiness &amp; put troops' lives at risk.  #FY18NDAA will rebuild the military &amp; give troops support they need https://t.co/G0VBhnDY5j"][".@CNN: \"Why you should care about the NDAA\" https://t.co/xCV3swlRo9 #FY18NDAA"]["Be sure to tune-in to @KenBurns &amp; @LynnNovick's remarkable #VietnamWarPBS tonight on @PBS at 8pm ET/5pm PT https://t.co/w4gfEkvxUm"]["Spending cuts to the military put our service members' lives at risk. We must rebuild the military, starting by passing the #FY18NDAA. https://t.co/KW70YuMQXa"]["I'll be joining @jdickerson @FaceTheNation this morning to discuss the #FY18NDAA &amp; more - tune in to @CBSNews at 10:30am ET"]["Visiting the @USNavy Memorial in DC with my sons Jimmy &amp; @McCainJack https://t.co/gw4uZhsXAQ"]["Saddened by passing of Bishop Henry Barnwell - a civil rights icon who left an indelible impact on #Arizona https://t.co/7bStNLuB54"]["Cindy &amp; I couldn't be more proud of our daughter @MeghanMcCain &amp; all that she has &amp; will continue to accomplish!"]["Must-read @GeorgeWill @washingtonpost: \"‘The Vietnam War’ is a masterpiece — and a model for assessing our history\" https://t.co/nAV1XhH217"]["Must-read @nytimes: \"Ken Burns’s ‘Vietnam War’ Will Break Your Heart and Win Your Mind\" https://t.co/tL0ABGztEF"]["Introd bipartisan bill to protect transgender troops currently in military &amp; require DOD study on future recruitment https://t.co/Cn9Ayi4nJc"]["Thank you to all those @ResoluteSupport for honoring our POWs &amp; MIAs w/ a 24-hour Remembrance Walk #2017POWMIASalute @RSSalutesPOWMIA"]["This #POWMIARecognitionDay, I'm thinking of my cellmate Col Bud Day who could never be broken in spirit no matter how broken he was in body. https://t.co/7Nb1HeDleW"]["On #POWMIARecognitionDay, we honor all POWs &amp; those still missing. Our nation &amp; the families left behind will never forget their heroism. https://t.co/vDz69pux5n"][".@NPR: \"Amid Cancer Treatment, McCain Releases Battle Cry For A Functional Congress\" https://t.co/w3s78GBSey"]["Congratulations to Arizona's own @BASISScottsdale for being ranked as one of the top 15 best high schools in the US! https://t.co/8FmcRmv6xO"]["Congrats to @Dbacks' Goldy on 1000th career hit! #Goldy1000 https://t.co/sT6rzdgadH"]["Vladimir Kara-Murza is a Russian patriot who will never stop fighting for a future in which his beautiful children can live in freedom. https://t.co/BLD9zVWoB1"]["Honored to speak @NEDemocracy on Vladimir Kara-Murza's documentary about Boris Nemtsov, an inspiration to all fighting for freedom in Russia https://t.co/x1ugkkhidw"]["We're also praying the 15 Marines injured at Camp Pendleton &amp; 8 soldiers injured at Fort Bragg make a full recovery https://t.co/DkHAkdscU3"]["Cindy &amp; I extend our deepest condolences to the family of Staff Sgt. Sean Devoy who was killed during helicopter training at Fort Hood #TX"]["Very proud the Senate voted 84-9 to advance the #FY18NDAA - one step closer to final passage so we can give our troops the support they need"]["While I'm disappointed the Senate could not take up a vote to repeal sequestration, I'm proud we're moving toward final passage #FY18NDAA"]["The #FY18NDAA is more vital than ever. As #Russia, #China &amp; #NorthKorea escalate threats, we must have a military that’s ready &amp; able. https://t.co/OtU74lzHDd"]["America's now losing more troops in training than in combat. This is madness. We must repeal sequestration &amp; rebuild the military. #FY18NDAA https://t.co/g3AJfZIjHa"]["Cindy &amp; I are praying for the Marines injured yesterday during a training exercise at Camp Pendleton #CA &amp; wishing them a full recovery."]["I'm speaking on the Senate floor urging the Senate to take up @SenTomCotton's amd't to repeal sequestration - watch: https://t.co/horv5gxI99"]["I'll be speaking on the Senate floor shortly on #FY18NDAA &amp; to encourage the Senate to take up sequestration repeal: https://t.co/horv5gxI99"]["I'm proud the Senate has incorporated 104 bipartisan amendments to the #FY18NDAA to strengthen the bill &amp; reflect all members of the Senate."]["In last 3 yrs, 4x as many service members died in training than combat. #FY18NDAA restores military readiness to help prevent future tragedy https://t.co/AuHYwjvan2"]["Always happy to say hello to Arizonans visiting the Capitol – even if they are West Point grads #GoNavy https://t.co/kK4EB9EMYt"]["Saddened to hear about the passing of Senator Pete Domenici, a gentleman who always behaved in the highest tradition of the Senate."][".@BV is right - the best thing to do with the archaic &amp; protectionist #JonesAct is to scrap it. https://t.co/1tLN3KnFM7"]["The threats to our security have never been more complex. We must have a ready &amp; capable military to rise to those challenges. #FY18NDAA https://t.co/A0deZNJs2d"]["For 55 consecutive years, the NDAA has been signed into law. In our partisan climate, the #FY18NDAA is a bill that can make both sides proud https://t.co/4OybI5R189"]["The #FY18NDAA reduces wasteful spending by terminating troubled &amp; redundant programs, identifying inefficiencies &amp; reining in spending https://t.co/DKeZkwx5gl"]["The #FY18NDAA reforms the #Pentagon to strengthen accountability, streamline #Pentagon processes &amp; spur innovation in defense tech https://t.co/DwUO1qtmjR"]["The #FY18NDAA authorizes $8.5B to strengthen homeland, regional &amp; space missile defenses to counter provocations from #NorthKorea https://t.co/8jVhST013O"]["The #FY18NDAA strengthens our ability to counter threats in the information domain as #Russia &amp; #China escalate attacks in cyberspace https://t.co/MXCqwzjLko"]["The #FY18NDAA improves quality of life for service members &amp; their families, including a 2.1% pay raise for all troops https://t.co/xptXFiQgBZ"]["The #FY18NDAA addresses the military's readiness problem, modernization crisis &amp; our eroding military advantage. https://t.co/PHZfLAfuD5"]["I'm speaking on the Senate floor about the #FY18NDAA, a vital bill for America's Armed Forces - watch: https://t.co/crjWwuycsw"]["America asks our service members to sacrifice on our behalf. We must pass the #FY18NDAA to give our troops the support they need to succeed. https://t.co/CtdZRNcvYt"][".@washingtonpost: \"McCain, Kerry, Hagel find modern-day lessons from Vietnam at preview of Ken Burns’s new doc\" https://t.co/NiNy8ZM9qR"][".@washingtonpost: \"McCain and Kerry outline lessons from #Vietnam after watching new Ken Burns documentary\" https://t.co/lWI7wRy7Qq"]["Glad to be at the launch of @KenBurns &amp; @LynnNovick's remarkable #VietnamWarPBS - watch our convo at 7:55pm: https://t.co/F0eJ3cdp9W https://t.co/lWmF8PbGfQ"]["Given human rights abuses against Rohingya, I will seek to remove military cooperation w/ #Burma from #FY18NDAA https://t.co/n1cyCx9M6s"]["#FY18NDAA ensures our military is prepared to achieve the missions of today &amp; rise to the challenges of tomorrow https://t.co/pTDPPxcUFq https://t.co/tIlaBTSp1B"]["Sec Mattis' letter underscores that starting year on another continuing resolution is detrimental to the military https://t.co/KHLGbpfE8w"]["The decision to suspend #JonesAct for #Harvey &amp; #Irma relief shows why we must repeal. Let's make this permanent! https://t.co/YsUASviT46"]["Important read by @SecAFOfficial &amp; @GenDaveGoldfein @WSJ: \"The Air Force Needs a Budget That Aims Higher\" https://t.co/yfHrlA0cdh"]["Must-read @NavyTimes: \"Budget extension will hurt training and readiness, Mattis warns\" https://t.co/FmxnOoFXHr"]["Releasing Mehman Aliyev is step in right direction. Azerbaijan should drop charges vs him&amp; others wrongly imprisoned https://t.co/QptAUWjvHp"]["Wishing @DavidJohnson31 @AZCardinals a speedy recovery! https://t.co/Vgu3ow8i9Y"]["Congrats @ASU &amp; @michaelcrow on well-deserved recognition! \"ASU named most innovative school 3rd year in a row\" https://t.co/q7CbQZDAPD"]["Important @washingtonpost: \"Textbook example of ethnic cleansing: 370K Rohingyas flood Bangladesh as crisis worsens\" https://t.co/h4pPQfsFqV"][".@LaurieRoberts @azcentral: \"John McCain fights cancer and finds ... joy?\" https://t.co/IOgYLIoSeG"]["Not only does #FY18NDAA provide our men &amp; women in uniform w/ resources they need &amp; deserve, it's a product of an open &amp; bipartisan process https://t.co/wNQdIaAmjI"]["Proud the Senate voted 89-3 to open debate on the #FY18NDAA. We must pass this bill to rebuild the military &amp; support America's troops."]["Proud to open debate on #FY18NDAA, a bipartisan bill that gives our brave troops the training &amp; resources they need https://t.co/DJgFsQckiH https://t.co/NTXP6qDWYZ"]["Will be speaking on the floor shortly to open debate on the National Defense Authorization Act - Tune-in https://t.co/0Sim6eShHY #FY18NDAA"]["A thorn between four roses! https://t.co/B8lzpynfwH"]["Congress must pursue comprehensive immigration reform to fix our broken immigration, secure the border, grow the economy &amp; protect Dreamers https://t.co/DHb1gSYYqo"]["The continuing resolution Congress passed last week shortchanges our service members &amp; deprives them of the training &amp; resources they need https://t.co/Ac2ggl1zn8"]["Must-read @nytimes: \"#Cambodia’s Democracy Betrayed\" https://t.co/15GpFxMnt4"][".@azcentral: \"McCain on health: Prognosis 'pretty good,' but 'every life has to end one way or another'\" https://t.co/WUENPlL0qZ"]["ICYMI: I sat down w/ @jaketapper @CNNSotu yesterday to discuss my health challenge &amp; top issues of the day - watch: https://t.co/B0doV3pWOx"]["On 9/11 we must #NeverForget the Americans who died that day &amp; our service members who continue to sacrifice to keep us safe #911remembrance https://t.co/Hvei8GWaiV"][".@WSJ: \"Sen. John McCain Says He ‘Will Be Grateful for Additional Time’ He Has\" https://t.co/jdvlAiqftP"]["Joining @jaketapper @CNNSotu in a few - lots to discuss, tune-in"]["Cindy &amp; I are praying for all those in the path of #HurricaneIrma. We thank the brave volunteers &amp; urge all to listen to local officials."]["Great news for #Arizona - proud of our state's many contributions to national security! https://t.co/y4IKmgtIrZ"]["Monitoring investigation into A-10 crash in #Nevada - glad the pilots ejected safely https://t.co/RWQiCbS6XM"]["#Equifax breach underscores the need for a #cyber strategy: \"Equifax Data Breach Possibly Affects 143M US Consumers\" https://t.co/LCUJrurate"]["Must-read @washingtonpost: \"Another cyberattack alarm is going off. We need to start paying attention.\" https://t.co/Wb5fScIQO4"]["Important op-ed by @HASCRepublicans Chairman @MacTXPress: \"Congress keeps holding military funding hostage\" https://t.co/hK1Kr5bpl5"]["Disturbed by GAO report on @USNavy readiness shortfalls. For too long we've asked the military to do more with less. https://t.co/dX2RMsvAqo"]["Proud to support @WingmanFound, which supports the families of injured &amp; fallen Naval Aviators—ensuring their sacrifices are never forgotten https://t.co/tOZPqMQxqX"]["Intro'd resolution w/ @SenatorDurbin condemning violence against #Rohingya &amp; urging Aung San Suu Kyi to take action https://t.co/I82wzwCvgk"]["Great show by the @Dbacks! Make sure everyone gets out to support our outstanding team! https://t.co/RqUELpIkwV"]["I cannot support a CR that will harm our men and women in uniform. https://t.co/QOJw8gmqGE https://t.co/VLc7acP5DH"]["As global threats grow - from #NorthKorea to #ISIS - our military commanders have all warned a CR will inhibit military readiness &amp; power"]["CRs are no way to fund the government &amp; inflict harm upon the Americans we are constitutionally obliged to provide for—our service members."]["Attaching emergency funding for hurricane relief to a must-pass CR &amp; debt limit increase is a dereliction of Congress's most routine duties. https://t.co/nH5q6FXmMe"]["Speaking on the Senate floor shortly on the continuing resolution &amp; its impact on our men &amp; women in uniform- watch: https://t.co/RHeHe0iglf"]["Must-read @WSJ: \"Burmese Powder Keg: Persecution of the Rohingyas may fuel Islamist radicals\" https://t.co/Lhyz4W6QKR"]["Imp't @USATODAY: \"Alleged Russian political meddling documented in 27 countries since 2004\" https://t.co/yMKlIzcHpa"]["Must-read @NickKristof @nytimes: \"Google and Sex Traffickers Like Backpage dot com\" https://t.co/ZAaR5fZT06"]["Must-read @washingtonpost: \"#Cambodia’s ruthless leader is stepping up his authoritarian game\" https://t.co/jGjujkcxPO"]["Disturbing stat from GAO: 37% of warfare training certifications for @USNavy ships based in #Japan are expired \nhttps://t.co/ZW1ziwVHvJ"]["Our #Arizona @Dbacks are on a roll! \"The surging Diamondbacks are closing in on an all-time record\" https://t.co/nvACLgIpLt"][".@starsandstripes: \"Air Force Secretary expresses support for A-10s at Whiteman AFB\" https://t.co/NbEEZfdJC2"]["Yesterday, I urged Aung San Suu Kyi to use her remarkable voice to condemn the atrocities against the Rohingya https://t.co/Wjh5sJzAS2 https://t.co/B8Wf813oPX"]["I'm live on @facebook this morning - tune-in &amp; tweet me your questions: https://t.co/owCmXbidln"]["Disappointed to see #Moldova's President veto their participation in #NATO country exercises https://t.co/iE6AwlimnJ"]["Must-read @WSJ: \"A Missed Warning on the McCain?\" https://t.co/PCNtgIsT6T"]["Imp't @nytimes: \"#China’s Rights Crackdown Is Called ‘Most Severe’ Since Tiananmen Square\" https://t.co/mzEG1xf24c"]["Closely monitoring F-16 crash in #Arizona as search and rescue efforts continue https://t.co/u99MxzXpZH"]["Sent letter to Aung San Suu Kyi today urging adherence to human rights obligations amidst gross atrocities in #Burma https://t.co/5lSUHxBCwQ"][".@washingtonpost: \"John McCain is back on Capitol Hill — and not planning to go anywhere\" https://t.co/0cS7xo3rKr"]["Filed amicus brief w/ @SenWhitehouse calling on #SCOTUS to reassess constitutionality of partisan gerrymandering https://t.co/JOl3cPD4TE"]["The unacceptable repression of democratic leaders in #Cambodia underscores the alarming growth of authoritarianism https://t.co/pEOMcQPagB"]["Encouraged #Phoenix received grant to hire more firefighters– Congress must pass my bill to reauthorize this program https://t.co/HBcsU7JBey"]["Allowing brutal #Venezuela regime address @UNHumanRights is disgraceful &amp; makes a mockery of the institution. https://t.co/oEnEUGOHb7"]["Sen. Olympia Snow in @washingtonpost today: \"A return to order in Congress\" https://t.co/wAznCCfTDt"][".@POTUS's decision on #DACA is wrong approach at a time when both sides need to compromise on #immigration reform https://t.co/kPBCUhJ2m4 https://t.co/5stY5spxOC"]["Must-read @WSJ: \"Trump’s Korean Trade Folly: Protectionist threats undermine U.S. geopolitical goals\" https://t.co/FCAVCPKKRy"]["Must-read @washingtonpost: \"In #Azerbaijan, some journalists get free apartments. Others get jail cells.\" https://t.co/gizajYUQBN"]["Cindy &amp; I send our condolences &amp; heartfelt prayers to the friends &amp; family of SSgt Rivera-Lopez of #Tucson. RIP. https://t.co/PkrGM6G7Gr"]["I spoke at the Ambrosetti Forum in #Italy on the need for strong US leadership in the world - read my full remarks: https://t.co/vf8GceyJl5 https://t.co/420TQEI4ij"]["Great to join my friends @LindseyGrahamSC &amp; DNI Dan Coats on a panel discussing America's role in the world at the Ambrosetti Forum in Italy https://t.co/awlkeNo01i"]["Enjoying stunning Lake Como #Italy! https://t.co/NUun8M5RlK"]["Great to be at the Ambrosetti Forum in lovely Lake Como #Italy - look forward to discussing the need for strong American leadership tomorrow https://t.co/EnuRvKn8DH"][".@AP: \"McCain, undergoing cancer treatment, to attend Italy forum\" https://t.co/ZDArPW805K"]["Great to see @DavidJohnson31 @AZCardinals on the cover of @SInow - looking forward to a big season! #BirdGang https://t.co/1DmrDTkyzE"]["My op-ed in @washingtonpost today: \"It’s time Congress returns to regular order\"\nhttps://t.co/fBR4NRg2y9"]["Good visit to Chase Field to support the @Dbacks &amp; chat w/ @ToddWalsh @FOXSPORTSAZ https://t.co/vrrQR4xdTA"]["Dropped by @TGen to thank Dr. Trent &amp; his team for all their great work! https://t.co/YXN1VhY5rb"]["Sent letter to @SecretarySonny urging him to delay implementation of wasteful &amp; duplicative USDA catfish inspection https://t.co/NDX5lHQNn9"][".@business: \"A-10 Warthog Attack Jet Drops Most Weapons on Islamic State\" - glad we saved the A-10! https://t.co/GPmoPpHDES"]["Must-read by James Baker &amp; Andrew Young in @WSJ today: \"Identity Politics Are Tearing America Apart\" https://t.co/mhAr5qbN0H"]["#ShaneDoan is a model of leadership &amp; sportsmanship - both on &amp; off the ice. Congrats on a remarkable career! https://t.co/f5nIGXl1Ma https://t.co/8uqc33Uvs4"]["Sent letter w/ @SenJackReed to Sec Mattis requesting information on a continuing resolution's impact on our military https://t.co/E7wEeHG04x"]["Continuing to pray for the people of #Texas impacted by #HurricaneHarvey. Here are ways to support those in need. https://t.co/y2Wr3cLTOj"]["Must-read @WSJ: “The Hurricane Learning Curve” https://t.co/cCjXz8GThS"]["Must-read @WSJ: “Turkey’s Authoritarian Reach” https://t.co/FBsEjDbh4v"]["Must-read @WSJ: “Nuclear Missiles Over Tokyo” https://t.co/kz5oAXhQXz"]["Bittersweet congrats to AZ legend #ShaneDoan on an incredible career w/ @ArizonaCoyotes. You will be sorely missed! https://t.co/fCdnoRXAdv"]["Again, many thanks to the wonderful Iranian-American community in #Arizona for the birthday wishes! https://t.co/kCaJ8GkRs2"]["Thank you for all the birthday messages! It's been wonderful celebrating with family in #Arizona doing the things we love most. https://t.co/QLe4f2tROR"]["Incredible shot of a baby black hawk at our home in Cornville #Arizona. Black hawks still come back here year after year! https://t.co/qXrhTLv3Oq"]["Glad to see @PHXSkyHarbor flight path issue addressed - I encourage the FAA to engage w/ communities moving forward. https://t.co/tDOnFGQT7g"]["Thank you @MeghanMcCain! https://t.co/zMvJ1AI0Mw"]["Thank you to our Iranian American friends from #Arizona for the birthday wishes! https://t.co/52gWxX5SlI"]["Cindy &amp; I are praying for the people of #Texas impacted by #Harvey &amp; appreciate all those working around the clock to help those in need."]["Thanks to the brave men &amp; women of the @AZNationalGuard &amp; @PHXFire for aiding the people of #Texas-we're praying for all impacted by #Harvey"]["Must-read @WSJ: \"The #Arpaio Pardon\" https://t.co/jW07kBJ1rK"]["Last night in beautiful #Arizona with @MeghanMcCain https://t.co/jv1VTZxWZv"]["Must-read @washingtonpost: \"Deadly Navy accidents in the Pacific raise questions over a force stretched too thin\"\nhttps://t.co/ZOFP5znUBC"]["Must-read @washingtonpost: \"The #Afghanistan heroes who haven’t even gotten a thank-you\"\nhttps://t.co/XJL3dQwfqO"]["Had a great time dropping in on the final #CardsCamp yesterday with the @AZCardinals! They're looking strong already https://t.co/IFMuAa6Hzn"]["Excellent meetings this week with @dougducey &amp; @ASU leaders &amp; students about the Rio Salado project! #Arizona https://t.co/oCO3bxGO6P"]["Must-read @washingtonpost: \"These are the 10 sailors lost from the USS John S. McCain\" https://t.co/IpqL2bj2zL"]["Until the butcher #Assad goes, the war in #Syria will grind on https://t.co/LW9ARBuOTJ"]["Must-read @CNORichardson @USATODAY: \"Adm. John Richardson: 'This requires urgent action’\" https://t.co/mCvVAk1vd6"]["Must-read @USATODAY : “The Navy hits dangerous shoals” https://t.co/T86lAe05DN"]["Fun trip down memory lane to my 2000 campaign on the Straight Talk Express w/ some young journalists who clearly didn't amount to much... https://t.co/4sWKflhEUs"]["Sent letter urging @POTUS to keep pressure on #Egypt for human rights violations &amp; demanding release of US prisoners https://t.co/cb3HS69aBz"]["Disgraceful that #Cambodia has expelled @NDI from the country. The US must stand for democracy &amp; human rights. https://t.co/r5R0PQFfTn"]["Thank you Michael Bidwill &amp; the @AZCardinals for having me at the final #CardsCamp practice today - looking forward to a strong season! https://t.co/tVnymNafFI"]["Congress must pass bipartisan bill led by @senrobportman to bring all who facilitate human trafficking to justice https://t.co/xRscVaN9uQ"]["Must-read @WSJ: \"Has the Navy Reached Its Breaking Point?\" https://t.co/wnJ7ATku0u"]["Sec Mattis's visit to #Kiev provides opening for US to correct #Ukraine policy &amp; provide lethal defensive assistance https://t.co/WyA8u9ODVp"]["Congrats @GCU_Lopes on achieving Divison I #NDAA status - #Arizona is very proud! https://t.co/6vNz6mqKbm"]["I spoke @ASU today about the top cyber challenges facing the nation - read my full speech here: https://t.co/7UtpTHtryH"]["Great seeing @ASU President @michaelcrow today - a great leader of an outstanding #Arizona institution! https://t.co/zOfCOHjJqD"]["Glad to see @GOPHELP consulting governors as Congress moves forward with bipartisan health care reform https://t.co/MmfUF8uvl7"]["Important @Reuters: \"US to withhold up to $290M in #Egypt aid b/c of failure to make progress on human rights\" https://t.co/UQbKyWgG7K"]["Cindy and I extend our deepest condolences to the families of the brave USS John S McCain sailors whose lives were tragically lost. RIP."]["Must-read @washingtonpost: \"Navy ships keep getting into accidents. Time to find out why.\" https://t.co/j6St5Cfgru"]["Must-read @WSJ: \"The Navy's McCain Moment\" https://t.co/1FL6pgEqPo"]["Congrats @AZCardinals great @AnquanBoldin on an incredible career and thanks for the memories! https://t.co/QAVz8pCVf4"]["I commend @POTUS's new strategy for #Afghanistan. We must move past last admin's failed policy of postponing defeat. https://t.co/ExDC4JqkHi https://t.co/zZGqrkSD9i"]["Burma at her best! https://t.co/nooIluyJ6S"]["My staff captured a view of the #SolarEclipse17 from the Capitol - where did you watch? https://t.co/P357O37lqB"]["Watching the #SolarEclipse17 with @meghanmccain on a hike in #Arizona! https://t.co/pKG7pl8Qqk"]["If you're in Phoenix, peak #SolarEclipse17 viewing time is in just a few minutes! Get all the info you need here: https://t.co/oaL0CXbK2R"]["Agree w/Adm Richardson that we must ID &amp; correct causes of recent Navy ship collisions. Our sailors deserve no less https://t.co/FpqPO7dNfY"]["Watching the #SolarEclipse17 in #Arizona? Here's everything you need to know https://t.co/gsietCy9uy"]["Cindy &amp; I are keeping America's sailors aboard the USS John S McCain in our prayers tonight - appreciate the work of search &amp; rescue crews https://t.co/jzk9giXbfg"]["Wonderful time with the Liebermans in #Arizona this weekend https://t.co/AFtuFz2gSW"]["Family reunion in #Arizona! https://t.co/IXvYm8XKmH"]["Where's Lindsey? https://t.co/VtG7pl9Ku8"]["Having a great weekend in Cornville #Arizona with @JoeLieberman @MeghanMcCain &amp; @LindseyGrahamSC https://t.co/1qmLM4bhMK"]["The three amigos together again! https://t.co/IciasfFaPJ"]["Thank you to the wonderful team @MayoClinic - we appreciate everything you do! https://t.co/2eMV6NMSV8"]["Pleased admin elevating Cyber Command to unified combatant cmd - still more work to secure nation from cyber threats https://t.co/2DbDXZ1Tcl"]["Saddened by passing of Terri Cruz, cofounder of Chicanos por la Causa &amp; tireless advocate for #AZ's Hispanic cmty https://t.co/1HPZZz54ZV"]["Must-read by @JeffFlake in @nytimes: \"We Need Immigrants With Skills. But Working Hard Is a Skill.\" https://t.co/q25ZgngNCt"]["Praying for the victims of the #BarcelonaAttack &amp; their families - the US stands with the people of #Spain"]["Great meeting with my friend @GlennHamer @AZChamber about the Rio Salado project! #Arizona https://t.co/rDz4OrCMwi"]["Must-read @washingtonpost: \"The U.S. cannot abandon #Afghanistan now\" https://t.co/rB3aeaPvnJ"][".@JeffFlake is a principled legislator &amp; always does what's right for the people of #AZ. Our state needs his leadership now more than ever."]["Great meeting w/ Salt River Pima-Maricopa Indian Community about the Rio Salado project &amp; grateful for the beautiful Native American art! https://t.co/mbfXpjhd4Q"]["Good meeting w/ Gila River Indian Community about the Rio Salado project - appreciate the beautiful necklace made by a member of the cmty! https://t.co/2qeBlWC1S7"][".@DailyMiner #Arizona: \"Tribal council, McCain honor memory of the Navajo Code Talkers\" https://t.co/r20QiHzolF"][".@dcexaminer: \"Jim Mattis calls looming stop-gap budget 'as unwise as can be' for military\" https://t.co/3pZ7tzzKhx"]["There's no moral equivalency between racists &amp; Americans standing up to defy hate&amp; bigotry. The President of the United States should say so"]["As #NAFTA talks begin, admin should focus on strengthening &amp; modernizing this agreement, which has significantly benefited #Arizona &amp; nation https://t.co/XzOtv9Ya2X"]["Good meeting with Tempe @AZMayorMitchell today about the Rio Salado project https://t.co/ynGwagCAfC"]["Great meeting with @MayorGiles, @MesaAzgov &amp; @ASU about the Rio Salado project today https://t.co/VCAvVHpDtA"]["Must-read @MaryAnastasiaOG @WSJ: \"Imperialists Invade #Venezuela\" https://t.co/qNJ1M92FUD"]["Must-read @WSJ: \"Can the VA Fire Anyone?\" https://t.co/hPiCxgmkTu"]["This #NavajoCodeTalkersDay, a grateful nation honors the brave Navajos who saved countless American lives in WWII https://t.co/MeoO7ordD4"]["Glad our bill preserving Vets Choice Program signed into law - our vets deserve flexible, quality care in their cmty https://t.co/GJqvOgZo67"]["Must-read @azcentral: \"The 8 truths of #Charlottesville\" https://t.co/49WpsQ64Yw"]["Black hawk at sunset last night in Cornville #Arizona https://t.co/c1o8l7VQSX"]["Great weekend in Cornville #Arizona with @MeghanMcCain! https://t.co/fFp7lr564N"]["Enjoying Oak Creek with @cindymccain! #Arizona https://t.co/WOE5IyGF2v"]["White supremacists aren't patriots, they're traitors- Americans must unite against hatred &amp; bigotry #Charlottesville https://t.co/Zr1Jg9jBXu"]["Saturday in Oak Creek with @MeghanMcCain &amp; Jimmy McCain #Arizona https://t.co/Pz6QLXXH23"]["Must-read by @cindymccain in @azcentral today: \"Why is it OK to sell kids on websites like Backpage?\" https://t.co/DVzjPOTanH"]["Must-read @washingtonpost: \"This journalist imprisoned in #Syria must be freed\" https://t.co/w21lLdSfXU"][".@dcexaminer: \"John McCain follows through on threat to Trump by adding #Afghanistan strategy to defense bill\" https://t.co/n35LebcgR1"][".@USATODAY : \"McCain proposes own #Afghanistan strategy in absence of White House plan\" https://t.co/meDw9XlgGK"][".@WSJ: \"McCain’s #Afghanistan Plan Calls for More Troops in Open-Ended Mission\" https://t.co/i3hXcc7TFh"]["Having fun at the @Dbacks game with @MeghanMcCain &amp; @cindymccain - let's go #Dbacks! https://t.co/S8YOuJcyKH"]["Please consider helping our friends @UnitedFoodBank #Mesa - more info on how to donate: https://t.co/mvSriK3go0"]["Good meeting with Maricopa County Supervisors Steve Chucri, Clint Hickman &amp; other #Arizona leaders at my office in #Phoenix today https://t.co/zQsL7KCuuP"]["America’s Armed Forces in Afghanistan deserve leadership from Washington worthy of their service &amp; sacrifice https://t.co/hMIH1P3f9H https://t.co/8aYfyVd1EG"][".@CNN: \"John McCain announces his own strategy for #Afghanistan\" https://t.co/XORwUmjeeg"]["Great to see the USS John S McCain aka \"Big Bad John\" conducting freedom of navigation operation in South China Sea https://t.co/UshE0cMhqh"]["7 mos into new admin, still no plan for Afghanistan- that's why I filed amdt to NDAA providing strategy for success https://t.co/5LfpCVLmKu"]["I commend Navajo Nation Council for passing law expanding tribal criminal jurisdiction over human trafficking cases https://t.co/NZxTEzpIcr"]["Excellent lunch meeting today with West Valley #Arizona mayors about the Rio Salado project! https://t.co/69PgjlotsV"]["Good news @starsandstripes: \"American aircraft carrier to visit #Vietnam next year, #Pentagon says\" https://t.co/EnuO2f3c91"]["\"By the time I get to Phoenix\" - thanks for the memories! https://t.co/ieVKfQ7Bte"]["Join me now on Facebook where I'm answering your questions live. Be sure to ask your questions in the comments: https://t.co/Qhr0WdfTtS"]["Must-read @stavridisj in @BV today: \"The Key to Countering North Korea Lies Offshore\" https://t.co/6DNAY9W8dF"]["Imp't @WSJ read: \"#Putin’s Goal: Revenge and Restoration\" https://t.co/3J8T0FsG84"]["Must-read @WSJ: \"McMaster and the Commander\" https://t.co/VgmfMThNse"]["Thank you @Cookies_inBloom for the delicious &amp; life-like cookies! https://t.co/jlpxW4TbeL"]["Saddened by the passing of Glen Campbell, a great entertainer, a great man &amp; a great Arizonan - thanks for the memories!"]["Lots to discuss with @MacandGaydos today on @KTAR923. Tune-in now to hear my interview: https://t.co/144k8bK8Qc"]["Congrats @MayoClinic Phoenix, a world-class hospital! \"Mayo Clinic Hospital in Phoenix among top 20 in natl ranking\" https://t.co/dNGrRpPiBa"]["Must-read @washingtonpost: \"The U.N. has placed more sanctions on North Korea. That’s not enough.\" https://t.co/OOTDGIZMrK"]["Must-read @WSJ: \"The Latest North Korean Sanctions Show\" https://t.co/6Cyc4zkZ5j"]["This #PurpleHeartDay, we remember the courage &amp; heroism of America’s service members who have sacrificed life &amp; limb so that we may be free. https://t.co/vOD3u7vBzZ"][".@cronkitenews: \"As McCain begins treatment, fellow POW reminisces, expresses hope\" https://t.co/wPxjCRgcbU"]["Leopoldo Lopez should never have been imprisoned in the first place, Maduro must now let him free https://t.co/NFfV1JrYpv"]["Must-read @WSJ: \"The Guns of #Venezuela\" https://t.co/pZ0iGRqjjn"]["ICYMI: Editorial in @azcentral: \"McCain's right on our biggest threat\" https://t.co/LzLtKVPLgq"]["Lead editorial in @azcentral today: Russia probe isn't about Trump - it's about our country, election system &amp; democracy https://t.co/gY236egoOg"]["Must-read @krauthammer: \"The guardrails hold\" https://t.co/J6WnHp7nFM"]["Congrats to @AZCardinals great @kurt13warner on being inducted into the Pro Football Hall of Fame! https://t.co/943t4e44PA"]["Praying for all impacted by Osprey crash off coast of #Australia - thanks to search &amp; rescue crew for swift response https://t.co/yC8MiosKyN"]["Incredible rainbow in Cornville #Arizona! https://t.co/AmZOLbV3YO"]["Happy birthday @USCG! Thank you for your 227 years of service. https://t.co/FXdhJYiX82"]["Must-read @washingtonpost: \"Duterte’s lawless regime claims more victims\" https://t.co/1Z3UShqd2S"]["Prayers are w/ family &amp; friends of Spc Christopher Harris &amp; Sgt Jonathon Hunter whose lives were lost in Afghanistan https://t.co/URFpqalB4h"]["The @Dbacks never one to let a rain delay go to waste! #Dbacks https://t.co/mlr4Fko8bN"]["Must-read @WSJ: \"Where Is Liu Xiaobo’s Widow?\" https://t.co/iwIJF0YzYA"][".@azcentral: \"John McCain and Jeff Flake are right to tackle Backpage dot com\" https://t.co/3DYL95xL6R"]["Heavyweight champ @Klitschko retiring from boxing - one of the greatest, thanks for the memories! https://t.co/koG3hed9va"]["Imp't assessment by @phxchamber: https://t.co/KzgeFyIvST"]["Congrats to former @IRIglobal President Amb Mark Green on being confirmed as @USAID Administrator! https://t.co/WYyKBj1dK4"]["Thanks to the Army Corps &amp; @dougducey for your quick response &amp; all those who helped address this emergency https://t.co/Bz3djTfHcz"]["Glad Senate passed resolution awarding my friend @SenatorDole w/ Congressional Gold Medal - a deserving honor for a true American hero"]["I'm talking with @azcentral on @facebook live - tune-in: https://t.co/giHxUl1tFY https://t.co/H3Dh1CCO3p"]["Tune-in shortly for my live Facebook Q&amp;A with @azcentral. Click here to watch→ https://t.co/wz4m7CtoKG https://t.co/trAUnMem3B"]["Great talking with @azcentral editorial board today about top issues facing #Arizona &amp; the nation https://t.co/bqb7BAFYLs"]["Prince Philip, the Duke of Edinburgh, retiring - thanks for the memories! https://t.co/4rWhiEhkrt"]["I applaud the Senate for passing #ForeverGIBill, which I proudly cosponsored, to expand veterans education benefits https://t.co/VDRd5ej7Ks"]["Our commanders-in-chief, not our commanders in the field, are responsible for the failure in #Afghanistan https://t.co/OcDMDs4G87"][".@tucsonweekly: \"Beating cancer how you live: Senator McCain fights like hell for his principles\" https://t.co/6uGOT9hlFQ"]["Must-read @azcentral: \"Our View: Can #Obamacare be fixed? Yes, and #Arizona knows how\" https://t.co/vk31bknDzr"]["Must-read @nytimes: \"Mr. Maduro’s Drive to Dictatorship\" https://t.co/PumhaJVE8p"]["Must-read @WSJ: \"Tillerson’s Korea Confusion: The Secretary of State offers happy talk about Chinese cooperation\" https://t.co/bSsUrYtU4p"]["Not surprising @WSJ: \"Venezuelan Officials Tampered With Election, Voting-Software Firm Says\" https://t.co/52bRD3THQr"]["Thanks to @cindymccain for tireless work to #EndTrafficking! https://t.co/2y4uw6Vlwg"]["Our relationship w/ Russia is at dangerous low. You can thank Putin for attacking our democracy, invading neighbors &amp; threatening our allies"]["Glad Senate passed my bill w/ @SenatorTester @SenatorCollins &amp; @SenatorCarper to support fire depts &amp; 1st responders https://t.co/pcXfEGwrKR"]["Great joining @broomheadshow @KFYI #Phoenix today w/ @MeghanMcCain - listen to the full interview here: https://t.co/4tTg5lDvSr https://t.co/J8nvFHHPKR"]["Great work by @VP in the #Balkans: \"Go West, VP Pence tells Balkan leaders\" https://t.co/w5q8qWoZ5N"]["Thanks @broomheadshow @KFYI for having me in-studio today - catch my full interview here: https://t.co/8sPTBmUxYB"]["Glad @POTUS signed #RussiaSanctions- hope he'll be as vocal about Russian aggression as he was about concerns w bill https://t.co/4Wul2UNECG"]["I'll be joining @broomheadshow @KFYI #Phoenix in-studio shortly - lots to discuss, listen live: https://t.co/rdzUlcFRKT"]["New @DeptofDefense report is imp't step toward improving defense acquisition system &amp; implementing #FY17NDAA reforms https://t.co/3CcTQ6yMkL"]["Good news @SenAlexander &amp; @PattyMurray to hold hearings on #Obamacare - may be a step in the right direction https://t.co/HQNyw9WCj9"]["Must-read @WSJ: \"Can the ‘Problem Solvers’ Fix #ObamaCare?\" https://t.co/oIM8vPtTlV"]["Must-read @WSJ: \"A Trump Card in #Ukraine\" https://t.co/KvC1eTCMNM"]["Pleased Senate passed 8 @DeptofDefense noms tonight - hope WH will quickly send noms for unfilled defense positions https://t.co/0mHRttNK1q"]["Glad Senate passed bill to preserve the Veterans Choice Prgm &amp; ensure vets have access to care in their communities https://t.co/9yuNn6mYC2"]["Great job @VP in Georgia! \"Pence Says U.S. Backs Georgia in NATO Over Russian Objection\" https://t.co/jQvqtgBoA3"]["Glad to cosponsor @senrobportman's bill to hold Backpage accountable &amp; ensure justice for victims of sex trafficking https://t.co/zz9ssgdMD2"]["Disgraceful that #Venezuela opposition leaders once again detained - US should demand their immediate release https://t.co/bFCG0to9Jz"][".@Reuters: \"Senator McCain says he will offer #Afghanistan strategy in September\" https://t.co/WDbJiIGVs9"]["Must-read @washingtonpost: \"We’re on the road to a new Cold War\" https://t.co/ELFCfjcnHY"]["Must-read by my friend @JoeLieberman in @WSJ: \"HillaryCare Lessons for Today\" https://t.co/7wU62xTiGk"]["Congrats #Phoenix VA whistleblower Brandon Coleman on new VA job to enhance accountability &amp; protect whistleblowers! https://t.co/nNKP61MVop"]["Good work - the United States stands with the people of #Venezuela https://t.co/hqVVYLQuK6"]["More than 6 mos after inauguration, there's still no strategy for #Afghanistan - my stmt: https://t.co/bNE0n6Eytr"]["It's about time. @WSJ: \"Pentagon Offers Plan to Arm #Ukraine\" https://t.co/JoOyRv5U63"]["Good #Arizona news @azds: \"Recreation growth ripples north of Grand Canyon National Park\" https://t.co/If9nZQczqt"]["Not surprising Putin throws out US diplomats, but he &amp; his cronies will still pay price for attacking our democracy https://t.co/HfKsZwaq7K"]["Must-read @WSJ: \"#Putin’s Advances in #Syria: The Kremlin solidifies its strategic gains for backing Assad\" https://t.co/0lTlcMqzLu"]["Must-read @WSJ: \"#Russia Sanctions Breakthrough\" https://t.co/Jz8OIGWJpq"]["Old man and his daughter on the mountain #Arizona https://t.co/X3ndck2oFq"]["Congrats @USNavy on USS Gerald R Ford's 1st catapult launch&amp; arrested recovery- proving new capabilities is critical https://t.co/QIynYxQy6B"]["We stand with the people of #Venezuela today, who deserve democracy — not sham elections and Maduro’s repression https://t.co/JXA9PfVWlT"]["Enjoyed hiking this morning with @MeghanMcCain in beautiful Cornville, #Arizona! https://t.co/dgtpDBV5OA"][".@azcentral: \"Sen. John McCain barely escaped death 50 years ago in the USS Forrestal disaster\" https://t.co/uYrp2tgsYD"]["Congratulations, General Kelly! We all have the highest confidence in you."]["On the 50th anniversary of the USS Forrestal fire, we honor the brave American heroes who perished that dark day https://t.co/inuuPN1jzZ https://t.co/S8kEFi9cEo"]["I urge my colleagues to trust each other, stop political games&amp; put health needs of American ppl 1st. We can do this https://t.co/3gKeGcHNQH"]["Congress's highest obligation is to provide 4 common defense- unfortunate 1 senator blocked defense bill troops need https://t.co/Nkzep8JuFE"]["Loss of 16 service members in KC-130T crash reminds us of sacrifices our men &amp; women in uniform make on daily basis https://t.co/vwxHVBpaDj"]["Must-read @washingtonpost: \"#Venezuela’s lawless regime staggers toward a coup\" https://t.co/sI96mJKlIQ"]["Skinny repeal fell short because it fell short of our promise to repeal &amp; replace Obamacare w/ meaningful reform https://t.co/tZISIvccOO"]["Senate's 98-2 vote to sanction #Russia shows America will respond to election attack w/ strength, resolve &amp; action https://t.co/JlxQFBvele"]["The USA must send a strong message to Putin &amp; any other aggressor that we will not tolerate attacks on our democracy #RussiaSanctions https://t.co/g3v5IP8CDY"]["I'll be speaking on the Senate floor shortly on the Russia sanctions bill - watch: https://t.co/dRXzTO324N"]["I'm speaking on the Senate floor regarding the #FY18NDAA, imp't bill to rebuild the military &amp; support our troops: https://t.co/3EJyhe3aqx"]["Great dinner w/ my friends @LindseyGrahamSC &amp; @SpeakerBoehner last night! https://t.co/hyIuSzkFhr"][".@dannowicki @azcentral: \"McCain wants these 3 things in the Senate health bill\" https://t.co/BcPgiuZWNN"][".@azcentral: \"John McCain puts the Senate (and Obamacare) in its place\" https://t.co/72ZPiY6jeU"]["That snake never stood a chance! https://t.co/58NSJ9nHzg"]["Glad to hear my friend @SteveScalise has been released from the hospital - look forward to seeing you back at work soon!"]["Intro'd 3 amendments to health care bill to address concerns about the bill's impact on #Arizona's Medicaid system https://t.co/elICoEX7HM"]["Any American who meets current medical &amp; readiness standards should be allowed to continue serving - my full stmt: https://t.co/6rHm5OWQzc"]["I hope we can rely on humility, cooperation &amp; dependence on each other to better serve the people who elected us https://t.co/QbaZvUwkfE"]["I'm grateful to the ppl of Arizona for the privilege to serve&amp; play a small role in the history of the nation I love https://t.co/7j00J2Rilz"]["I'll be speaking on the Senate floor following today’s vote – watch live: https://t.co/nwZIRZ18Dk"]["Look forward to returning to Senate tomorrow to continue work on health care reform, defense bill &amp; #RussiaSanctions https://t.co/VQBtovnwF1"]["Thank you for the great cartoons from around the country! https://t.co/Gn8B1W1lxD"]["\"#Taliban Claim Kabul Explosion That Killed Dozens\" - Disgraceful we still have no strategy for #Afghanistan https://t.co/3SBO8oMAuf"][".@AndrzejDuda’s veto shows Poles have been heard - US &amp; #Poland must honor commitment to democracy &amp; rule of law https://t.co/zpMgRW2gv0"]["Must-read @joshrogin @washingtonpost: \"The Trump team is repeating Obama’s mistakes in #Syria\" https://t.co/OlJ13hcJWh"]["Must-read @WSJ: \"Trump’s #Syria Muddle\" https://t.co/UC8OfxGmgF"]["Must-read @phxbizjournal: \"Pork barreling on: Report shows ‘pork barrel’ spending continues rise\" https://t.co/G7REQcAVZD"]["Enjoying Zebra Falls in beautiful Oak Creek, #Arizona today with my friend Joe Harper https://t.co/4Gk0KR1oj8"]["Glad deal finally reached for sanctions on Russia, Iran &amp; North Korea - I'm reviewing details closely to ensure strong, effective sanctions"]["Appreciate the nice editorial by @washingtonpost: \"What we can all learn from John McCain\" https://t.co/zuzEiNhgFX"]["Thank you @jdickerson @FaceTheNation: \"John's Notebook: Fight like John McCain\" https://t.co/OqacNYzxu8"]["Great trip down memory lane! @danbalz @washingtonpost: \"For John McCain, character comes through\" https://t.co/KPwOLlEdAo"]["Happy birthday to my dear friend @SenatorDole - a true American hero! https://t.co/PK6Nw7SDwu"]["\"#Poland's Senate Approves Law Giving Politicians Influence Over Judiciary\" - one step back for #democracy https://t.co/UgIf4ZFL4a"]["Great news @BruceArians - looking forward to a great season for the @AZCardinals! #BeRedSeeRed https://t.co/kT8bbQubJX"]["Talking healthcare w/ governors on call organized by @LindseyGrahamSC &amp; @BillCassidy - it's vital we listen &amp; heed advice of our governors"]["Thanks @GeraldFSeib for the nice piece @WSJ: \"Raising hell is what McCain has always been willing to do\" https://t.co/Uy0zldieDz"]["Must-read @MJGerson @washingtonpost: \"Trump’s breathtaking surrender to #Russia\" https://t.co/SkWocuF8dM"]["Must-read @WSJ: \"Trump’s #Nafta Stakes: How to renegotiate the treaty without blowing up the economy\" https://t.co/AKSxheODGN"]["Must-read @pkcapitol @washingtonpost: \"What John McCain learned from Ted Kennedy on challenging his own party\" https://t.co/AN9Wkrwq4Q"]["Couldn't agree more @azcentral: \"John McCain's legacy is in good hands\" cc: @MeghanMcCain https://t.co/O5v2rRL5XL"]["Must-read @azcentral: \"Meghan McCain on father, Sen. John McCain: 'He is the toughest person I know'\" https://t.co/s4joInukPV"]["Reports admin ending prgm to assist Syrian opposition irresponsible, short-sighted&amp; plays into Russia, Assad's hands https://t.co/N7KVqn1VD6"]["I greatly appreciate the outpouring of support - unfortunately for my sparring partners in Congress, I'll be back soon, so stand-by!"]["Disappointed to miss this year's #PigBook press conference - thanks @GovWaste for keeping up the fight against pork-barrel spending! https://t.co/we4xQHWr9V"]["US must develop strategy to escalate price Russia will pay until it honors Minsk agmt - starting w/ #RussiaSanctions https://t.co/YeVKyFlCyv"]["Glad Senate confirmed #DepSecDef Shanahan - now Dems should allow votes on other @DeptofDefense noms &amp; give Sec Mattis nat'l security team https://t.co/TIP0raHQfm"]["Must-read @WSJ: \"America’s Summer Labor Shortage\" https://t.co/I1M9K7ZUEz"]["Thanks @InhofePress for chairing this week's #SASC nominations hearings - tune-in to today's hearing at 9:30am ET: https://t.co/d31K1hJGaa"]["Congress must now return to reg order &amp; listen to govs on bill to provide access to quality, affordable healthcare https://t.co/kMdW7fqOQz"]["Praying for all impacted by tragic flash flood in #Payson- imp't for Arizonans to take caution during monsoon season https://t.co/2EIIvnEFdg"]["Must-read @WSJ: \"#Putin’s Dangerous New #Ukraine Doctrine\" https://t.co/GXHRAqVRsT"]["Must-read @hiattf @washingtonpost: \"Why #China’s leaders are so terrified of dissent\" https://t.co/4E7BAuo2t3"]["Must-read @WSJ: \"#China’s Empty Nobel Chair\" https://t.co/b8W0oC2kxn"][".@dannowicki @azcentral: \"McCain is not happy with the new Senate health bill. Here's what he wants\" https://t.co/KPkQC1RA2V"][".@defense_news: \"Shanahan pole vaulting Senate healthcare quicksand to confirmation vote\" https://t.co/9KFeMOag4V"]["Today I reintroduced bill to repeal the outdated &amp; protectionist Jones Act to promote free trade &amp; economic growth https://t.co/QdEXrkxo9E"]["There simply is no more time to delay in moving the nomination of Deputy Sec of @DeptofDefense Patrick Shanahan- the obstruction has to stop https://t.co/lgsJe39yaO"]["Read my full statement on the revised Senate health care bill here: https://t.co/kXor3CQp8c"]["Liu Xiaobo's death in Chinese prison is egregious violation of human rights for which Dr Liu spent his life fighting https://t.co/BbBEkQQFbb"]["I'll be speaking on Senate floor shortly on the nomination of Patrick Shanahan to be Dep @DeptofDefense Sec - watch: https://t.co/6LMVNHWYFn"]["#Russia invaded #Ukraine, worsened #Syria's civil war &amp; attacked our election - what else is Putin up to? @CSIS's Lisa Sawyer Samp discusses https://t.co/kCls7VIJoY"]["Russia’s goals in Montenegro are clear: to prevent it from joining NATO, reverse its aspiration for EU integration &amp; end sanctions vs Russia https://t.co/mBLPvUFVeA"]["What's #Putin's ultimate goal? @JBugajskiUSA @cepa says 1 goal is to reverse US influence in Europe &amp; coerce states to oppose Western values https://t.co/vN6vp0BH89"]["Holding imp't #SASC hearing on #Russia's attempt to overthrow democratic gov't of #Montenegro - watch live: https://t.co/ATwZNQtdU3"]["Russia's attempt to overthrow Montenegro govt is case study in Putin's plan to undermine democracy- watch #SASC hrg: https://t.co/vfK8bjBM46"]["Must-read @washingtonpost: \"This is what makes #Russia a hostile power\" https://t.co/H1OViCaQE3"]["Must-read @WSJ: \"U.S. Marines and Risk: The increasing rate of aviation mishaps deserves attention\" https://t.co/mjH0JFZh0h"]["#RussiaSanctions passed the Senate 98-2 - it's past time the House passes bill &amp; punishes Russia for election attack https://t.co/qIcpSBP8h6"]