["Great news from one of West Virginia’s largest employers—made possible by #TaxReform. Excited for all the West Virginia families and workers who will benefit from this announcement. https://t.co/zsSz4C29hE"]["There is no doubt West Virginia is headed in the right direction, and tonight it was nice to hear @WVGovernor Justice's vision for what's ahead. Excited to work with our state leaders to build on the momentum of the past year and keep West Virginia moving forward."]["Proud to join @POTUS today at the @whitehouse where he signed the #INTERDICTAct into law – anti-fentanyl legislation I introduced to help fight the opioid epidemic. Learn about it here: https://t.co/FXzd15uqYx"]["Great to catch up with @IvankaTrump – a strong female leader who is really engaged on the issues. https://t.co/fsElR7zlOn"]["Excited to see the RAISE Family Caregivers Act pass the House and head to the president’s desk. Family caregivers deserve a national strategy to recognize and support the vital services and care they provide. https://t.co/xemQ8aczan"]["Congrats to @WVUhoops on their #2 ranking! #HailWV #PressVirginia https://t.co/Ls9Fq2OftV"][".@SenJohnBarrasso and I sent a letter to @EPAScottPruitt today asking him to withdraw the punishing “once-in-always-in” policy, which discourages emissions reductions. Read the letter here: https://t.co/sb95oCFA1c"]["Thrilled to rejoin @EnergyGOP and guarantee West Virginians a seat at the table when it comes to shaping policy related to #energy resources and development. MORE: https://t.co/p3oTJZ6dRJ"]["@ywcacharleston With efforts like my Stop Enabling Sex Traffickers Act &amp; @POTUS declaring January National #HumanTraffickingAwarenessMonth, we can stand up &amp; put a stop to this horrible practice. It’s time to provide support to victims &amp; hold offenders accountable."]["#Humantrafficking is an unconscionable crime that is happening across the country, including right here in #WV. I’m glad @ywcacharleston is hosting this discussion to raise awareness about an issue that impacts millions. https://t.co/WSVDJ6CDuz"]["Thrilled that higher ed institutions like @marshallu &amp; @WVStateU are leading efforts to help attract businesses to southern WV &amp; create jobs through the Alliance for Economic Development of Southern WV. Glad my staff was on hand for this exciting announcement. #HigherEdMeansJobs https://t.co/ZgbjDeA3G9"]["We want our businesses to be more competitive globally so they can expand. That’s exactly what #taxreform will do for businesses like Allevard Sogefi in Wayne County. https://t.co/VjMc1kJj0L"]["Working to deliver real results for West Virginians like #taxreform, expanding our #energy #infrastructure &amp; fighting for our miners remain top priorities in 2018. Looking forward to a productive year! https://t.co/NkSWpz6xXr via @rusty_marks"]["Saw the latest #manufacturing procedures in action during my Friday visit to Allevard Sogefi’s Pritchard factory – another manufacturer that will benefit greatly from #taxreform. @heralddispatch has the scoop: https://t.co/W5putP8a3C https://t.co/9XvBiZ3XOo"]["Did you know that most U.S. ticket sales for venues across our country are fulfilled at two of @Ticketmaster’s main fulfillment centers, one of which is located in #CharlestonWV? I had the chance to visit the facility Friday &amp; learn more about their operations. Thx for the tour! https://t.co/FUVMJzrFj8"]["Caught up with @WSAZnews on Friday during my visit to @Ticketmaster in #CharlestonWV and outlined a few priorities for 2018. Learn more here: https://t.co/tgbHfIb7Ky"]["Kicking off 2018 with some exciting news for West Virginia, including #taxreform and #energy #infrastructure development. Read all about it in my newsletter here: https://t.co/SP9pOwTaQk https://t.co/4JV8wi54zC"]["Allevard Sogefi’s Pritchard facility provides good-paying jobs for more than 300 hardworking West Virginians. Today, I had the chance to visit the facility, learn about their operations &amp; hear directly from employees about how they will benefit from #taxreform. https://t.co/kLSmRksQnh"]["Enjoyed meeting employees and touring @Ticketmaster’s Charleston fulfillment center - one of only two in the nation. Thank you for making West Virginia home! https://t.co/14jpYrBNVb"]["#Taxreform is a historic and substantial victory for West Virginians and for Americans across the nation. More in my op-ed for @DM_opinion: https://t.co/ugY7w0v48v"]["Great to hear that Appalachia Development Group has advanced to the next phase of consideration for @ENERGY's Title XVII Loan Program. This is a great next step &amp; I will continue working to make this idea a reality."]["It has been and continues to be a privilege to serve with such a fighter and a gentleman. You will be missed in the Senate, @OrrinHatch! https://t.co/lRKCmw7VQj"]["Thinking of all those we lost 12 years ago today during the tragic Sago Mine incident and continuing to pray for their loved ones. We should never forget all that our miners have sacrificed and done for West Virginia families and communities."]["Wishing all West Virginians a very Happy #NewYear! I’m looking forward to continuing our good work together to better the lives of West Virginians like you."]["Fun read by @WBOY12News about the longest sled run on the east coast located right here in West Virginia. Check it out sometime this winter! https://t.co/wZNLKFxaAX"]["West Virginia families, workers and small businesses were counting on #taxreform and we delivered in a big and bold way. @WVBIC agrees: https://t.co/Xasn2MZLp0"]["Combatting the drug epidemic requires a spectrum of solutions and strong leadership. This year, the Senate confirmed 2 of WV’s U.S. Attorneys who will play an instrumental role in creating a #DrugFreeWV https://t.co/3sfxyOGtrz"]["Was so sorry to learn about the passing of Pete Thaw. As a member of the Kanawha County School Board, Pete served his community with real leadership, passion, &amp; resolve. He was also a dear friend, &amp; our thoughts and prayers are with Pat and the entire Thaw family."]["West Virginia miners like Thurman Watts put a lot on the line to power our country and provide for their loved ones, and it's always heartbreaking to hear about this kind of loss. Thinking of and praying for the Watts family today. https://t.co/01nven77im"]["While much has been accomplished in 2017, I look forward to accomplishing more for West Virginians in the year ahead. https://t.co/x3TnMGnmZB"]["Michael Stuart’s impressive career and his commitment to honorably and ethically upholding the law make him qualified to serve as our next U.S. Attorney for the Southern District. Proud to have supported him throughout this process: https://t.co/JHIXxtk1ss"]["My thoughts and prayers are with Fire Chief Tim Blake’s family and the entire Craigsville Fire Department during this difficult time: https://t.co/Ah23UMa9Kc"]["West Virginians shouldn’t be taxed if they decide not to purchase health insurance. https://t.co/dsWDhXsPxB"]["I promised to do what’s best for West Virginia families, workers and small businesses; and I believe that the #taxreform bill Congress passed &amp; @POTUS signed last week is absolutely what’s best for our state. More details in my op-ed for @DM_opinion here: https://t.co/ugY7w0v48v https://t.co/tStrBNOKqu"]["We’ve tackled challenges head on and delivered real results this year, and I’m looking forward to accomplishing even more for West Virginians. https://t.co/bYOv75eGpS"]["Recently spoke with @GrayDCnews about a new bill I introduced that will direct more funding to states hardest hit by the #opioidepidemic like West Virginia. WATCH: https://t.co/ulGpoHKsZC"]["Good editorial in last week’s @DM_opinion highlighting the benefits West Virginia families and workers will see as a result of #taxreform. Read it here: https://t.co/7JW55jTM8e"]["From my family to yours, Merry Christmas! I look forward to working together to accomplish more great things for West Virginia in the year ahead. https://t.co/uWCpo6IwVF"]["Democrats had an opportunity to do what’s best\nfor West Virginians and the country. Instead, they sat on the sidelines. CC:\n@wchs8fox11 https://t.co/q9ikTF2IMx"]["Sexual harassment under any circumstance and in\nany setting is simply unacceptable. I spoke with @WSAZnews on my leadership in\nmaking needed changes. WATCH: https://t.co/oh7pI4cPj4"]["From delivering #taxreform and connecting our rural communities to hearing directly from West Virginians like you, it’s been an exciting year! Don’t miss my last newsletter of 2017 here: https://t.co/JbY71mmrju"]["This week, Congress delivered the first comprehensive #taxreform legislation in more than three decades. More on how this will help West Virginians here: https://t.co/vSNLsD3MDP"]["Signed. Sealed. Delivered. President Trump just made it official—West Virginians and Americans across the country are getting tax relief this holiday season and will enjoy the many benefits for years to come. Very exciting day!"]["Democrats had a chance to take big and bold action by voting for pro-growth #taxreform that will help all Americans. Doing nothing is just not an option, and West Virginians deserve better. https://t.co/V2XIdgOpxQ via @DM_opinion"]["ICYMI: A recent editorial by the @IntelligencerWV sets the record straight about #taxreform. Read the piece here: https://t.co/MtsQP0Ss0H"]["Looking forward to @POTUS signing this #taxreform legislation that will bring much-needed relief to all West Virginians. https://t.co/kcqiCybTfF"]["From passing #taxreform to rolling back burdensome regulations, the Republican majority has brought positive change to the American people. I’ll be highlighting some of these accomplishments shortly on the @SenateFloor. WATCH LIVE: https://t.co/bhlzgllFrE"]["Many West Virginians continue to recover following last year’s floods. My staff was on hand to dedicate more homes in Hope Village in White Sulphur Springs. https://t.co/HbLJ4zJClJ"]["Glad the Senate confirmed Michael Stuart to serve as\nthe U.S. Attorney for the Southern District of WV. I was proud to\nrecommend him for this position &amp; I have no doubt that his skill &amp; his\ncharacter will make him an effective &amp; respected U.S. Attorney. https://t.co/zMt29pR70z"]["On behalf of the thousands of middle-class families in West Virginia that will benefit from #taxreform, I’m proud to join my Republican colleagues and @POTUS at the @WhiteHouse today to celebrate the first tax reform in more than three decades. https://t.co/FBpionijJt"]["Within hours of passing #taxreform, we're already seeing announcements that companies plan to give back to their employees and invest more at home. Good news for workers and the economy! https://t.co/PXhtTh6qSh"]["From @SquawkCNBC and @NewDay to @Talkradiowrnr and @WVMetroNews Talkline with @HoppyKercheval, it was great to talk this morning about all the good things pro-growth #taxreform will do for West Virginians. https://t.co/mJtm2ZZpP8"]["Today, @ENERGY is releasing the first study that I requested regarding the new ethane storage hub. Details here: https://t.co/pHgSU99HWX"]["Tune in to @WVMetroNews this morning around 10:05. I’ll be talking with @HoppyKercheval about last night’s #taxreform vote and how this legislation will jumpstart #WV’s economy. LISTEN: https://t.co/FlG6wf77YI"][".@wvmanufacturers support #taxreform because it will make American businesses more competitive: https://t.co/mtYXSXB3SS"]["Recapping last night’s historic #taxreform vote on @Talkradiowrnr this morning. Listen live at 8:45: https://t.co/3QPH1T4AnI"]["Next up, I’ll be on @NewDay talking all things #taxreform and what this means for West Virginians. Tune in to @CNN now: https://t.co/Nzia5jGhHd"]["The Senate just passed pro-growth #taxreform, a historic &amp; substantial victory for West Virginians &amp; Americans across the country.  Read my full statement to learn why I voted for these important reforms &amp; the many ways they will benefit our state: https://t.co/Chf5zpt0DC https://t.co/Np5U6o6Ice"]["Early childhood education is important &amp; gives #WV children a leg up. Glad new @HeadStartgov funding is coming to our state. https://t.co/zdxZPnguTv"]["Highly encouraged and strongly support the efforts behind today’s #WV #Veterans Warriors to Agriculture Symposium in Charles Town. Glad my staff could attend and show our support. https://t.co/3BWZtNPYnT"]["#Taxreform will boost our economy, promote business investment and create good-paying jobs. The #WV Oil Marketers &amp; Grocers Association agrees: https://t.co/BZ3UHCTjEJ"]["On Friday, I joined members of the Point Pleasant community to remember the 46 lives we lost in the Silver Bridge collapse 50 years ago. We will never forget this tragedy and its everlasting effect on West Virginia and the world. https://t.co/FwfXcdwn4g https://t.co/V535BfjQgZ"]["ICYMI: Spoke with local stations back home about how #taxreform will provide West Virginians tax relief and create new economic opportunities for workers and small business owners. https://t.co/59ENnw2AbM"]["Over the weekend, Shepherdstown Fire Department held their time-honored tradition of housing the unit’s new Ladder Truck 3, which will serve @ShepherdU, the local community and parts of Berkeley and Jefferson Co. https://t.co/ZGU5oVMHGY"][".@WVaChamber agrees -- #Taxreform will deliver much needed relief for West Virginia businesses: https://t.co/giW7oB0qx4"]["#Taxreform is the big and bold change we need. @AFPWV agrees: https://t.co/4G9RS0V9y3"]["More jobs. Higher wages. Economic growth. These are just a few ways #taxreform will benefit our state. WATCH: https://t.co/QjWU89Oa87"]["It takes a community effort &amp; a comprehensive approach to beat the drug crisis. Recovery is a big part of this &amp; @FruthPharmacy’s Bridge of Hope Scholarship announcement yesterday will provide those recovering a bright future. #DrugFreeWV https://t.co/wylKnQq3fG"]["#Taxreform will help middle-income workers and families across West Virginia. Earlier this week, I caught up with @wtaptelevision to explain how: https://t.co/5NSdurANSR"]["#Taxreform, #broadband and meeting with West Virginians at home. All of the details are in my weekly newsletter here: https://t.co/aYGl3Pb0j4 https://t.co/5wu5u8vmHH"]["The House &amp; Senate conference committee released its #taxreform agreement tonight. This proposal will provide #WV families &amp; small businesses the tax relief &amp; new opportunities our state needs. I look forward to supporting it on the @SenateFloor. https://t.co/Cwa4iDuqi2"]["It’s time for Congress to seize this important once-in-a-generation opportunity and move #taxreform across the finish line. @AFPWV agrees: https://t.co/Xb6s3HwkJR"]["We are closer than ever to delivering much-needed tax relief for WV families and small businesses. Learn more in my weekly update: https://t.co/FlkPU2StRV"]["Families, workers and small businesses in West Virginia and across the country are counting on Congress to get #taxreform done."]["It’s time to seize this important once-in-a-generation opportunity. It’s time to get #taxreform across the finish line. It’s time to send this pro-growth legislation to @POTUS’ desk."][".@AFPWV supports #taxreform because it will make our businesses more competitive. https://t.co/YfwBAJWMOV"][".@WVaChamber supports #taxreform and calls it a win-win: https://t.co/HGWhXNOr4s"][".@nfib_wv says that #taxreform will provide much-needed relief for businesses to grow and compete: https://t.co/cKOJrUCPFZ"]["West Virginians want #taxreform because they know what it will do for our state."]["Today, we are closer than ever before to getting comprehensive, pro-growth #taxreform across the finish line. So many West Virginians are rooting for this effort because it will make a positive difference in their lives."]["#Taxreform will also increase the #ChildTaxCredit for families, make American businesses more competitive globally and lead to higher wages and more opportunities for our workers."]["#Taxreform will nearly double the standard deduction that is already used by 83% of West Virginians."]["On the @SenateFloor now talking about #taxreform and the small business owners, manufacturers, families, and individuals all across #WV who support it. WATCH: https://t.co/l6whfR8e0y"]["Great to see @senjudiciary advance Mike Stuart’s nomination today. He is an excellent choice for U.S. Attorney for the Southern District of WV. That's exactly why I recommended him for the position &amp; plan to vote for him on the Senate floor."]["Tune into @WVMetroNews Talkline around 10:30 this morning. I’ll be talking about the agreement that has been reached on #taxreform and more. LISTEN: https://t.co/Gzo2m54YQN"]["#Taxreform is a once-in-a-generation opportunity that will provide much-needed relief for West Virginians in every income category. That’s why @AFPWV is urging Congress to support this reform: https://t.co/rt4KkoDT9M"]["Thank you @POTUS for supporting our #military by signing #NDAA into law yesterday. This important bill funds our military and key national security priorities, gives our troops a pay raise and supports service families."]["Happy 381st Birthday to the @USNationalGuard. Thank you for your dedication to our country."]["#Taxreform is the change we need to get our economy growing again. @AFPWV agrees: https://t.co/myyv7EmKem"]["#Taxreform means more jobs and more investment. That’s why @wvmanufacturers support this long-overdue reform: https://t.co/Q9oQDgm4qI"]["Tomorrow’s mobile office will be in Mineral County at the Frankfort District Senior Center from 11:30 a.m. - 12:30 p.m. MORE: https://t.co/sk1nDOAwBk"]["Thousands of #WV children &amp; families rely on #CHIP, which is why I’m urging my colleagues to #extendCHIP and fund this important program. MORE: https://t.co/ipFQKMaIxl"]["Directing resources to those who need the most help is critical to tackling the #opioidepidemic. MORE: https://t.co/oveTev2fxF via @IntelligencerWV"]["Final mobile offices for 2017 have been announced for Mineral, Hampshire &amp; Pendleton counties. MORE HERE: https://t.co/sk1nDOAwBk"]["Recovery centers like @RecoveryPointWV in Charleston offer so many West Virginians a chance for a better future. Thrilled they have opened a new housing facility that will provide recovering women with a supportive community to call home. https://t.co/HNKihHW0kQ"][".@WVaChamber agrees that #taxreform is a key component for a strong economy. https://t.co/evx05ih6AD"]["Connecting West Virginia requires an all hands on deck approach and my #CapitoConnect plan is helping us take the right steps to tackle this problem. @WVTelegram has more: https://t.co/bwrb4YmKfu"]["Last week I introduced legislation that will authorize a new @USPS #Alzheimer’s stamp with revenue to support @NIH's research efforts. MORE: https://t.co/CpTHlXO4Iu https://t.co/bIB1AgiRpN"]["Saddened by the loss of Ridgeley Mayor Lynn Carr who worked tirelessly for the city and was a devoted member of the local volunteer fire company. Thinking of his friends and family during this difficult time."]["#Broadband is an essential tool we need to compete in a global digital economy. In an op-ed for @wvstatejournal, I explain more, including how I’m working to bridge the #digitaldivide. Read it here: https://t.co/RBhmTyYxm8 https://t.co/mZVLC6gbkr"]["We must continue our work to combat the #opioidepidemic in the hardest hit states like West Virginia. #drugfreeWV https://t.co/6pNTlckSQi"]["ICYMI: I was on @WDVMTV discussing my long-standing support for CHIP since my time in the @wvlegislature. WATCH: https://t.co/ast14ho0eX"]["Proud to join the @UCWV community today to celebrate the graduates and all of their achievements. Congratulations and good luck! 🎓 https://t.co/f0ObVPTUVX"]["This week, my staff helped celebrate West Virginian General McLaughlin’s 99th birthday, which included a plane dedication in his honor. Happy birthday General McLaughlin! May “The General Mac” live long and fly high! https://t.co/mmHDQMx3X4 https://t.co/WBzGvPviK9"]["To effectively combat the #opioidepidemic, we must direct funding to the states that need it most like West Virginia. WATCH: https://t.co/CmWKl9ZEQB"]["#Taxreform will provide the economic boost our country so desperately needs. https://t.co/6qpRV4gZ0K"]["ICYMI: Spoke with @WOAYNewsWatch about the need to #extendCHIP. This is absolutely critical. https://t.co/pnY1qsSaqX"]["My e-newsletter is hitting inboxes now! Catch up on the latest from the Senate and share with a friend --&gt; https://t.co/2yV3GYk4NH https://t.co/Let9EsEXv8"]["For decades, our tax code left hardworking West Virginians behind. Last week, the Senate voted to change that. #taxreform https://t.co/IGLLxIzRVp"]["Pleased @SecShulkin heeded my call to ensure we keep our promises to our homeless #veterans by continuing to support programs that assist them with housing needs &amp; other services. MORE: https://t.co/ADW91K7YGy"]["ICYMI: urged my colleagues to act swiftly and #extendCHIP – a program thousands of West Virginia children and families rely on. https://t.co/IAHCPZz2to"]["Have a minute? https://t.co/dsJ9KwZBQa"]["It’s great to see our #WV communities coming together to help one another. @JCAntiDrugCoali has grown into a county-wide effort to reduce drug use among youth in communities throughout Jackson County."]["Please join me in remembering and honoring the brave #PearlHarbor heroes today on #PearlHarborDay."]["Through #CapitoConnect, I am improving broadband and bridging the digital divide. Recently, I announced that 3,600 new homes, businesses and facilities in WV would be coming online. I'll continue to lead efforts to improve deployment. https://t.co/gpmzXaxckI"]["The need to #extendCHIP is essential for the thousands of children and families in West Virginia who rely on it. https://t.co/TtSPqBH7LZ"]["Since the very earliest days of my political career in the @wvlegislature, I’ve been a strong champion for the CHIP program. #extendCHIP https://t.co/xT31XY756j"]["Spoke with @WSAZnews about my continued support for CHIP in a letter to @GOPSenFinance. MORE: https://t.co/yo0fO4HniH"]["Proud to join this bipartisan group to introduce the STAMP Act to support research for #Alzheimers, an issue that is deeply personal for me. https://t.co/dBvVw3LCBU"]["REMINDER: my staff will be at the Paw Paw Senior Center today hosting a mobile office. Stop by from 11:30 a.m. – 12:30 p.m. to receive one-on-one assistance with casework. RSVP here: https://t.co/IIS06TgcxI https://t.co/lcWfg3BmsN"]["For so long, our miners have helped power America. Please join me in thanking them as we mark #NationalMinersDay. Their hard work and dedication is truly appreciated! https://t.co/nXA4yd7110"]["The Senate just voted to go to conference with the House on #TaxReform legislation. Now it’s time to reconcile our differences &amp; produce the very best bill we possibly can for West Virginians &amp; the American people."]["Last mobile office of the week happening tomorrow in Morgan County. Details here: https://t.co/v0GrB6pWFC https://t.co/Z6dChLoM2I"]["HAPPENING NOW: on the @SenateFloor talking about #taxreform and the need to #extendCHIP. WATCH LIVE: https://t.co/bhlzgllFrE"][".@DM_opinion highlights why #taxreform passing in the Senate is a step in the right direction. Read it here: https://t.co/fEfidWKLrx"]["Great news that #HeroineNetflix is in the running for an Oscar! West Virginian and filmmaker @elainemsheldon has done a great service by highlighting this important issue. Congratulations! https://t.co/8YsGP6knFZ"]["Charlie and I enjoyed the @WhiteHouse Christmas party tonight. Thanks to @POTUS and @FLOTUS for hosting! https://t.co/2LS8QFdtqM"]["Members of my staff attended the @BridgeValleyWV grant announcement yesterday! Students in Kanawha County will now be able to explore careers in #STEM and earn high school credit. https://t.co/ppWVe6LnBg"]["I was on @SquawkCNBC yesterday discussing the importance of #TaxReform. WATCH: https://t.co/svucA85hAi"]["Voted to confirm Kirstjen Nielsen to be our next @DHSgov secretary. I look forward to working with her to keep our homeland secure, fight terrorism &amp; address disaster readiness. My statement: https://t.co/fujOyv3d0g"]["Thousands of West Virginia kids rely on CHIP. That’s why I’ve been calling on my colleagues to #extendchip and fund this important program. https://t.co/ipFQKMaIxl"]["Questioning leading government officials on the opioid crisis’ impact in West Virginia at today’s Appropriations hearing. WATCH LIVE at 10AM: https://t.co/dF9aAokP8b"]["Talking #taxreform this morning on @WVPanhandleLive – tune in at 9:05 if you can! https://t.co/vP3B5Byb74"]["Just announced my mobile offices for this week. Check out the schedule and sign up for a one-on-one session here: https://t.co/IIS06TgcxI https://t.co/A5xvgq3NED"]["Recapping last week’s historical #taxreform vote with @HoppyKercheval. Tune into @WVMetroNews this morning at 10:06: https://t.co/Gzo2m54YQN"]["In the @CNBC studio this morning ready to talk #taxreform and how it will help all Americans. Tune in to @SquawkCNBC now to watch the interview."]["On set with the @foxandfriends crew this morning. Tune in now to hear about #taxreform and more."]["One of the most important jobs I have as a U.S. Senator is nominating young West Virginians to our nation’s prestigious service academies: https://t.co/3Wqk15RfVB via @InterMountainWV"]["ICYMI: spoke with @wtaptelevision earlier this\nweek about how #taxreform will help West Virginians. WATCH: https://t.co/aVFcoJHmya"]["Congrats @ucwv_msoccer on winning the first @NCAADII national championship in school history! #FlyUC https://t.co/fuWErHtLQO"]["The days of an outdated and complicated tax code\nare over. WATCH for more: https://t.co/4cKZTBI4mu"]["I helped secure funding to support development opportunities for Mid-Ohio Valley Regional Airport. Airports like these play a major role in #WV’s economic development. https://t.co/qcpWNykcWz via @NewsandSentinel"]["Want to know how #taxreform will help you? All of the details are in my newsletter here: https://t.co/D9BLnRdY5b https://t.co/N7igZFjWCZ"]["Thankful for #veterans like the ones in this photo who shared their stories at @MuHSApplemen’s Take a Veteran to School Day event where my staff presented certificates of congressional recognition. MORE: https://t.co/C1jI4auGPl via @HeraldMailNews https://t.co/5ZrAI0PEBH"]["Today we had an opportunity to vote for the kind of pro-growth reform that will provide relief to so many and make a real difference in the lives of working families across the country. My statement: https://t.co/KHLCxi2U2U"]["Took a moment today to thank and honor our #veterans by writing notes to send this holiday season. Thanks @RedCross for organizing the #HolidayforHeroes event. https://t.co/4TvY70VeD4"]["Working hard to get comprehensive #taxreform across the finish line. This is a once in a generation opportunity to boost the economy and provide middle-class tax relief."]["My staff attended the US-China Clean Coal Industry Forum this week in Morgantown to discuss the growing partnership between the U.S. and China on energy exploration and R&amp;D. https://t.co/l8rXhN3ILv"]["Look who I ran into on the way back to my office! Great to see @MineWorkers members who I continue to fight for each and every day. https://t.co/vcllpbA6aV"]["The @GrnBnkTelescope is important to Pocahontas County, to West Virginia, and to our nation. Glad @NSF will be hearing from citizens tonight at the public meeting, my letter is here: https://t.co/ca2DdaVIKk"]["ICYMI: joined American workers &amp; @SBALinda today to discuss how #taxreform will help small businesses. WATCH: https://t.co/OuyrlFmIfw"]["Hardworking West Virginians like Matt from the small business @YourHobbyPlace in Martinsburg are counting on us to act. WATCH him explain how passing #taxreform will make a difference in his life: https://t.co/FhTP7Uw4cg"]["This is a no brainer for West Virginia. WATCH: https://t.co/nEHMZhUhxi #taxreform"]["Catching up w/ local stations back home &amp; updating them on the latest from the U.S. Senate. Stay tuned for a few of the interviews tonight. https://t.co/FyIag5M1gk"]["I’m all in on #taxreform. https://t.co/NzRhbd6vJq"]["Small businesses are counting on #taxreform. https://t.co/OOamrCxmwI"]["Joining @SBALinda, small business owners, and my @SenateGOP colleagues for a press conference highlighting importance of #taxreform. WATCH LIVE @ 10: https://t.co/fK45xihN6h"]["A few ways #taxreform will help West Virginians like you: https://t.co/AZ5Xv41uqP"]["After voting tonight to begin formal debate on #taxreform, we are one step closer to delivering much-needed relief to West Virginians. https://t.co/77KAA4P5Yr"]["Small businesses play a major role in #WV’s economy. Today I sat down with @WVaChamber to discuss the positive impact #taxreform will have in WV. https://t.co/I0MiFHxkJ7"]["I am saddened and sorry to learn about Zachary’s death and extend my heartfelt condolences to his family and friends. Coal mining is a proud West Virginia tradition, but it is not without risks, and creating a safe environment for our miners is critical."]["HAPPENING SHORTLY: I’ll be on @FoxNews in a few minutes discussing #taxreform with @TeamCavuto. Tune in if you can! https://t.co/kGhU28QUFW"]["If you want to help the middle-class benefit from tax cuts, higher wages and more job opportunities, then you should vote for #taxreform. WATCH: https://t.co/KLyUYIOebw"]["Enjoyed chatting about leadership and my experience in Congress with our future leaders from @WVWesleyan. https://t.co/2ZHGVEBlvX"]["Tune into @WVMetroNews this morning at 10:06 where I’ll be talking to @HoppyKercheval about #taxreform &amp; more. LISTEN here: https://t.co/Gzo2m54YQN"]["Thanks to Dr. Footo-Linz for sharing the great work her team at @marshallU is doing to increase access to behavioral health services in #WV. https://t.co/hasijCtvgb"]["I’ll be live soon on @AftertheBell with @DavidAsmanFox to talk about #taxreform and today’s lunch with @POTUS. Tune in to @FoxBusiness. https://t.co/Uh9GPxwrKh"]["#Taxreform will make America stronger – it will make our families stronger. https://t.co/t4JenVzaQm"][".@POTUS &amp; his administration are bringing the change to regulatory policy that West Virginians voted for. MORE in my @DM_opinion piece here: https://t.co/0EbxMLvKQm https://t.co/rh9mfrwK7m"]["Glad the @EPA is in #CharlestonWV today hearing directly from West Virginians – including members of my staff – about the impacts of the #CleanPowerPlan. https://t.co/KrL5Cc6ZNg"]["70. That’s the number of #taxreform committee hearings that have taken place in @GOPSenFinance since 2011. There is no doubt that this has been a transparent process. https://t.co/UruVl6ram4"]["#Taxreform will create more opportunity for every working American, business and family. https://t.co/8M3pQCv1Cg"]["For the first time in decades, we have an opportunity to make our complicated &amp; outdated tax code simple, fair &amp; more competitive. Learn more here ➡️ https://t.co/5hVc7DuxdU https://t.co/AX3nQb0GQJ"]["Spoke with @WOAYNewsWatch recently about my latest effort to help strengthen opioid therapy safety and pain care for our #veterans. WATCH for more: https://t.co/1IKbgZTcqu"][".@WestVirginiaU professors take steps to help combat opioid addiction in #WV. @IntelligencerWV has more: https://t.co/lobuoXBVpi"]["ICYMI: China Energy’s plan to invest $83.7 billion in #WV will transform the state’s economy. Learn how our state will benefit: https://t.co/Qv2WAgpm4s via @PIHnews"]["Small businesses generate economic growth throughout communities across the country, and make up 95% of #WV businesses. Get out and support a local business today. #SmallBizSat #ShopSmall"]["We need to have economic security for our families. #TaxReform can make that happen: https://t.co/90wXhPDPie"]["This #Thanksgiving, I am blessed to be surrounded by my wonderful family. Happy Thanksgiving from my family to yours. https://t.co/tZDOKv0h5o"]["#Taxreform is a once-in-a-generation opportunity that will improve the lives of so many WVians &amp; Americans. I outlined the reasons why in an op-ed I penned for the @Register_Herald. Read it here: https://t.co/5hVc7DuxdU https://t.co/iaOIOxD69P"]["Working with my colleagues to prioritize funding for states affected by the #opioidcrisis: https://t.co/kFocSh4H41 via @BDTonline"]["#TaxReform will spur more growth and more opportunity for hard working families. https://t.co/4oOU48tL9m"]["Last week, my staff joined in on the #Thanksgiving celebrations at the Hansford Center. Looked like a fun time! https://t.co/DfB7R9UEQr"]["Many thanks to @AppServProject's efforts following #wvflood to help our state rebuild. Yesterday, they dedicated 8 new homes &amp; have already helped 50+ families in #WV! https://t.co/jVY7NLzBBP"]["A recent @IntelligencerWV editorial explains why the @SenateGOP #taxreform proposal would be good for West Virginians. Read it here: https://t.co/6kLDvV39qR"][".@taxfoundation found that #taxreform would result in approximately 4,700 new jobs. https://t.co/tRNYQjiMP5"]["Celebrating 41 years of marriage with my husband Charlie. Here’s to 41 more years of happiness and fun with you! ❤️ https://t.co/rqJQrMTdHf"][".@elainemsheldon is a talented director whose skills shined in new #heroinenetflix documentary featuring @huntingtoncity. It was an honor to be w/ her last week! https://t.co/X2YGPoP11K"]["Caught up w/ @GrayDCnews this morning about my new bill to get resources to states hardest hit by the #opioidepidemic. Stay tuned for the interview on local stations. https://t.co/NIW5JZaM1I"]["#Taxreform will create job opportunities and make our companies more competitive. https://t.co/jYbn1iw4B6"]["This is something big for our economy. #taxreform https://t.co/RU81LNlGf4"]["#Taxreform will make our country stronger and our families stronger. https://t.co/nNiK0qD8P5"]["Read about the latest on #taxreform and how I’m supporting our military and @WVNationalGuard: https://t.co/S9gHUC3tGc https://t.co/7Ijpb87npD"]["Our #taxreform efforts continue to gain steam. Find out more in my weekly update: https://t.co/svq3DqC7Q8"][".@WOAYNewsWatch says @SenateGOP #taxreform plan would grow the economy while simplifying the tax code and reducing marginal rates: https://t.co/5OAR9rsnzB"]["Was proud to vote today to pass a bill that will fund key national security priorities &amp; support our service members &amp; their families. It also includes my amendment to provide health benefits for mobilized reservists. Read more here: https://t.co/6vuGhLF1Kr"]["Another step closer. Congratulations to @RepKevinBrady, @SpeakerRyan, &amp; all of my colleagues in the House who voted today to deliver the tax relief our country needs. Looking forward to continuing our tax reform efforts in the Senate."]["Tonight the Senate passed a resolution honoring the new USNS Hershel “Woody” Williams. This ship is a true testament to @WoodyWilliams45's bravery and unwavering commitment to serving others."]["My staff will be in Mingo and Grant counties tomorrow hosting mobile offices. Stop by to meet with a member of my staff one-on-one. Sign up here: https://t.co/IIS06TxNpg https://t.co/BIMpKYtLdC"]["@DeptVetAffairs Today, @SenatorBaldwin &amp; I led a bipartisan group to take our efforts a step further, introducing a bill named in honor of WVian Andrew White that would strengthen @DeptVetAffairs community care programs. MORE: https://t.co/8Jx6qH41T0"]["#JasonsLaw was a significant step in preventing opioid overprescribing at @DeptVetAffairs, but it’s clear more can be done to prevent addiction &amp; opioid abuse among our #veterans."]["Was proud to cosponsor the Jason Simcakoski Memorial Opioid Safety Act to help provide safer &amp; more effective pain management services to our #veterans. Today, I’ll hear from Jason’s father at an Appropriations oversight hearing. WATCH LIVE: https://t.co/ow5uuL3pyM"]["@SenateGOP @CityofWheeling My Democratic colleagues should join @SenateGOP and @POTUS to enact #taxreform legislation in the coming weeks."]["@SenateGOP @CityofWheeling #WV’s economy is poised for growth, and #taxreform is a major opportunity to give it a boost."]["@SenateGOP That’s people like the 70-year old retired postal worker from @CityofWheeling who wrote to me saying, “the Senate needs to get these tax cuts and tax reform done, and done quickly.” I couldn’t agree more."]["The average middle-income family in #WV would gain $1,952 in after tax income because of @SenateGOP #taxreform bill and approximately 4,700 jobs will be created."]["This is about growing small bizs, raising wages, making American companies more competitive globally and creating more jobs in the U.S."]["The goals we’ve outlined for #taxreform are shared by many Americans and will make a real difference for West Virginians."]["Joining my colleagues on the @SenateFloor to discuss the need for #taxreform. WATCH live here: https://t.co/l6whfQQCBY"]["Took my fall interns to lunch today in the @uscapitol to thank them for their hard work and dedication. https://t.co/chMmJuZODM"]["Spoke at the screening of Heroin(e) w/ Fire Chief Jan Rader and other amazing women from the film. Glad the good work in @huntingtoncity to address the #opioidepidemic is being highlighted. https://t.co/kkP4SsfFlm"]["#WV is one of the states hit hardest by the opioid epidemic, but we don't always receive an appropriate share of the resources provided to fight it. A bill I just introduced would change that. Learn more --&gt; https://t.co/glFzzQEyMI"]["For West Virginians, #taxreform means more money in their own pockets. https://t.co/55NBxvQOZ5"]["Excited that the groundbreaking research at @WestVirginiaU is represented at the 47th annual @SfNtweets annual meeting in DC. #SfN17 #Neuroscience https://t.co/DZRyqGuFvO"]["This 82-year-old Charleston native cares for and rocks NAS babies at @ThomasHealthWV. Read his inspiring story here: https://t.co/tAvVv74Ol7"]["The outsized costs of @EPA rules &amp; actions are threatening family businesses, workers &amp; customers. Today I chaired an @EPWGOP subcommittee hearing on bills that would provide them relief. And here's how: https://t.co/wSvN2jd1Qs"]["#Taxreform will allow hardworking West Virginians to keep more of their hard-earned income. WATCH: https://t.co/kVknQuCbow"]["I’ll be live with @TeamCavuto shortly discussing the @SenateGOP #taxreform proposal and the positive impact it will have on West Virginians and Americans. Tune in to @FoxBusiness if you can!"]["Today we remember the 75 @HerdFB players and coaches, members of the @marshallu community and others who we tragically lost in the 1970 plane crash. #WeAreMarshall"]["Excited to join @BobCusack &amp; @TheHillEvents this morning to discuss how #CapitoConnect is helping to build a #SmartInfraFuture. Watch the event live at 8:30 here: https://t.co/zlwTBsPCsJ"]["Charlie and I extend our sympathies to his family and twin brother John."]["Jim was a wonderful man and will be missed. His compassion and love for West Virginia was unsurpassed. \n\nhttps://t.co/GpBbu5TLrC"]["Middle class biggest winners in Senate tax plan: https://t.co/wIkqlERHlJ"]["#Broadband is an absolute necessity for schools and local businesses. Learn more about an announcement I made earlier this week to connect more than 3,600 homes, businesses &amp; community facilities in #WV: https://t.co/WBIO8DVAq2"]["Proud to walk with our #WestVirginia #veterans in the #VeteransDay parade today in downtown Charleston. Honored to be with them as we celebrate all those who serve our country &amp; have sacrificed so much for us. 🇺🇸 https://t.co/Zdkk9f9dY2"]["Today and every day, I am so grateful for our veterans in West Virginia and across the country. Thank you Veterans! https://t.co/EYhvK9RCWY"]["This was an exciting week for West Virginia for two reasons – find out what they are in my weekly video message: https://t.co/zFDJa8cVW3"][".@SenateGOP took an important and bold step\nforward in delivering the pro-growth #taxreform our country needs. My full\nstatement: https://t.co/oaKn7n7XkK"]["Sexual harassment has no place in society, the workplace, and certainly not in the Senate. Was glad to help build momentum for and pass bipartisan legislation to make training mandatory w/ @amyklobuchar @ChuckGrassley @SenShelby @SenCortezMasto"]["Speaking w/ @HoppyKercheval this morning about #taxreform &amp; news of a major #energy #infrastructure investment in WV. Tune into @WVMetroNews at 10:05 to learn more about how this will improve WV’s economy, security &amp; future: https://t.co/fJH6GNetyG"]["My statement: https://t.co/pXwsjzJoMZ"]["Thanks to @POTUS and his cabinet for working with me to see this through. Expanding Appalachia’s energy infrastructure will transform our economy and bolster our security."]["From driving growth and creating jobs to maximizing America’s energy potential, the benefits for West Virginia and the country from this new $83B investment will be significant and long-lasting."]["Have a minute? Take this quick test to see if your #internet connection is up to speed: https://t.co/SizSaz63o3 https://t.co/psVm0L2Xjg"]["Joined @SenateGOP colleagues &amp; advocates like @stevenmnuchin1 to reinforce the need for #taxreform. We have an opportunity to make a real difference in so many lives in #WV &amp; across the country. WATCH: https://t.co/vOlpOPRuwp"]["For WVians &amp; Americans, the status quo isn’t working &amp; #taxreform is our opportunity to change it."]["#Taxreform also provides us a chance to give our small bizs the resources they need to expand, to create jobs &amp; to raise wages."]["#Taxreform will put more money in their pockets so they can decide the best way to spend it."]["#Taxreform provides us an incredible opportunity to make a real, tangible difference in the lives of American families."]["Many in #WV have been hit hard by a struggling economy &amp; we aren’t alone. Roughly ½ of American families are living paycheck to paycheck."]["#taxreform is important for anyone who has dreamed of owning a small biz &amp; for every American trying to get ahead."]["Joining colleagues &amp; advocates to discuss how #taxreform will help families, small bizs &amp; the economy. WATCH @ 11: https://t.co/O022UVANDk"]["I’ll be live on @SquawkCNBC talking about the need for #taxreform. Tune in now if you can!"]["Speaking on the @SenateFloor shortly about the benefits of increasing #energy #infrastructure in #WV. WATCH: https://t.co/B78ZDHukws"]["@USDA This announcement was made possible through my #CapitoConnect plan - proud of the progress we’re making! https://t.co/gpmzXaxckI"]["Today is a great day for thousands of WVians in Upshur, Barbour &amp; Randolph Counties. @USDA is bringing these communities &amp; bizs online. https://t.co/EdzqzqXisx"]["#Opioidepidemic is impacting far too many. Appreciate @POTUS' commitment by declaring nat'l public health emergency https://t.co/OtT4zd3DJ1"]["Heartbreaking to learn about the senseless violence in Sutherland Springs. Praying for all those affected."]["Spoke w/ @wtaptelevision this week about the progress we are making in the fight to end the #opioidepidemic. WATCH: https://t.co/1dQudT4iBt"]["One of the most important aspects of #taxreform is simplification. @WBOY12News has more: https://t.co/kZBdS4KI9S"]["Just sent out my newsletter - read it here for updates on #taxreform, #drugfreeWV efforts &amp; more: https://t.co/B8p9qVggm9 https://t.co/oWIozg7pk0"][".@EPA to hold field hearing in #WV Nov 28-29. Glad they will hear directly from those impacted by #CleanPowerPlan: https://t.co/rsuz0kGw3b"]["Our current tax code is a big, complicated mess. #Taxreform will help simplify our system. https://t.co/8w3kK2WXXd"]["November is National #HospiceMonth. Learn more about alternative care &amp; how you can help raise awareness: https://t.co/1TXjFrStOd https://t.co/oGIG2HrUkg"]["Supported 4 @POTUS judicial noms who will decide cases fairly based on Constitution and law, not personal beliefs https://t.co/3uYV123aSA"]["Calling on @FCC to fulfill its commitment to bring affordable &amp; reliable #broadband to rural communities. https://t.co/GSN7om7pqi"]["It’s time to simplify. #TaxReform\nhttps://t.co/3UXevQ6lo9"]["House #taxreform proposal marks an important step. Thanks to @SpeakerRyan &amp; @RepKevinBrady for their leadership. https://t.co/c729zLVzUw"]["November mobile offices kick off today in Mason &amp; Morgan Counties. Details here: https://t.co/IIS06TgcxI https://t.co/Ah300ICDFd"]["Talking #taxreform on the @SenateFloor now. Watch here: https://t.co/bhlzgllFrE"]["When it comes to figuring out your taxes, it’s far too complex. Let's make it easier for Americans to comply."]["ICYMI: urged my colleagues to confirm well-qualified judicial nominees so we can act promptly to fill more vacancies https://t.co/mZNa144dsQ"]["Glad legislation named in honor of WVian Jessie Grubb was referenced in opioid commission’s final report. MORE: https://t.co/h7l2DVThvM"][".@CDCgov is a critical partner in our efforts to combat #OpioidCrisis &amp; Dr. Fitzgerald is committed to helping us achieve this. #drugfreeWV https://t.co/7Dhx6r6xhP"]["Discussed the value of historic preservation in areas such as Fairmont &amp; @CityofWheeling this morning w/ Sandra Scaffidi &amp; Jack Dougherty. https://t.co/P2xDqOiVGe"]["#HappyHalloween! 👻🎃Check your local paper for #TrickOrTreat 🍬🍭info. @heralddispatch has a few details here: https://t.co/PWI3bsgMJX"]["Our tax code should reflect the current reality that most parents work. This is why the child tax credit is so critical. https://t.co/9sNPVdNb6E"]["Surprised Winfield Middle School teacher @eklose w/ the #MilkenAward. She’s the only recipient in #WV &amp; we couldn’t be prouder! https://t.co/5OvUVUOFIH"]["Just announced new mobile office dates for this week. Check out the schedule &amp; sign up for a mobile office near you: https://t.co/IIS06TgcxI https://t.co/GdOh5GDOIA"]["Our current tax code makes it hard for middle-class Americans to support their families. #Taxreform can change this: https://t.co/0s9l42U50E"][".@huntingtoncity’s Jan Rader highlighted the city’s efforts to fight #drugepidemic on @MeetThePress. Her leadership is truly inspiring."]["We need to create a more fair &amp; competitive tax system. https://t.co/70lMlhrKXF"]["Fostering new &amp; innovative partnerships between public &amp; private sectors is key to helping WVians succeed: https://t.co/tpTzsa4cjX"]["Enhancing the child tax credit can provide needed relief for middle income WVians. @PositivelyBrie has the story: https://t.co/AwosiMycQ2"]["Stopped by the @marshallu shop on the way into the @HerdFB game. Rain gear was a must today. 🏉 https://t.co/yR0ksIlxat"]["If we invest in our workforce, it’s a win-win for everyone. This is why we need #taxreform. https://t.co/RAELCAtaIl"]["Dropped off an old Rx in Winfield w/ Police Chief Starcher, Ed Covert &amp; Bill O’Dell who work to make Putnam Co. #drugfree. #DEATakeBack https://t.co/dR9sriPeRF"]["Learn about the ways I am working to help WVians. Details in my weekly newsletter here: https://t.co/wmUGR04Clm https://t.co/YLwpCf4GHx"]["Reminder that today is National #DEATakeBack Day. Find a drop-off location near you: https://t.co/6oLCCb5zzb"]["Honored to welcome VADM Thomas Moore to Allegany Ballistics Lab this week. We couldn’t be prouder of the work the men &amp; women do at ABL! https://t.co/xUPltvuPRV"]["Good read in the @Register_Herald about New River Gorge Bridge &amp; its importance to WV. Fun to be there last weekend! https://t.co/qFtCBQZfzz https://t.co/bv9ZC0WeWB"]["Help create a #drugfreeWV by participating in #DEATakeBack day tomorrow from 10-2. Find a drop off location: https://t.co/6oLCCb5zzb"]["WATCH for the latest updates on #taxreform &amp; how the Senate is working to deliver relief for middle-class families: https://t.co/SV8nvquqnJ"]["I support &amp; encourage the work being done today to develop a strategic plan to combat opioid abuse by HIDTA &amp; partners meeting at @ShepherdU https://t.co/LNRY5OKxt9"]["Final mobile offices of the month are happening today in Gilmer &amp; Roane Counties! Be sure to stop by! https://t.co/UVd1iAtTIL https://t.co/5eeLr2dZFm"]["I’ll be on @WVMetroNews at 10:06AM talking to @HoppyKercheval about #taxreform &amp; @POTUS’ opioid declaration. Tune in https://t.co/FlG6wfoJni"]["First responders go above &amp; beyond to serve our communities. Glad my staff could honor them at the Salute to Public Safety event in CRW. https://t.co/k5H8Mu4Y56"]["#Taxreform will help middle-class, #WV families keep more of their hard-earned dollars &amp; create opportunity. WATCH: https://t.co/kfQzJluLSh"]["Get involved in the 18th annual #LightsOnAfterschool event &amp; celebrate the success of afterschool programs: https://t.co/AgC0Buourr"]["@POTUS My full statement on @POTUS opioid declaration: https://t.co/r5gpRB4SBA"]["@POTUS Declaration prioritizes federal response, will help improve access to treatment, and draw attention to urgency of crisis"][".@POTUS took a step forward in helping #WV fight the growing drug epidemic by declaring it a national public health emergency today. https://t.co/9tLgWAasEx"]["Caught up w/ Martinsburg @ProcterGamble plant managers yesterday while they were in DC. Great to see you! https://t.co/VgO06bcefA"]["HAPPENING SOON: Speaking on the @SenateFloor about how #taxreform will help working families in #WV. WATCH LIVE: https://t.co/bhlzgllFrE"]["My staff will be in Taylor &amp; Mineral Co. today hosting mobile offices. Stop by to learn how my office can assist you https://t.co/UVd1iAtTIL https://t.co/n0e9bPcglo"]["Met w/ @WVDeptofAg members this week about growth opportunities in #WV for ag &amp; #broadband capabilities. https://t.co/YrU3eos2fc"]["Productive conversation w/ @IvankaTrump today about increasing the Child Tax Credit &amp; how this would help working families in #WV. https://t.co/tu5Pt6n2n2"]["Joining @IvankaTrump to talk #taxreform &amp; our efforts to help middle-class WVians. WATCH LIVE: https://t.co/zDpMv3k1Fb"]["Today’s mobile office will be in Fayette Co. at 10:30AM. Great opportunity to meet one-on-one w my staff. DETAILS: https://t.co/UVd1iAtTIL https://t.co/xRBAnkDrvX"]["Talking all things #taxreform on @FoxBusiness shortly. Tune in now if you can! https://t.co/3rPoQKF3XG"][".@Register_Herald has the scoop on a bill I introduced that encourages more girls to pursue #STEM. Read it here: https://t.co/tEywtSaw0o"]["Need assistance w/ casework? Stop by the Frankfort District Senior Center today &amp; meet w/ my staff. DETAILS: https://t.co/UVd1iAtTIL https://t.co/CTtSfk5rPh"]["New mobile office details released for this week! Check out the schedule here: https://t.co/IIS06TgcxI https://t.co/cVpEtAFoOI"]["Today, #WV lost one of its own, miner James Adkins. My sympathies go out to the Adkins family during this difficult time."]["We all stand ready to help affected residents and the surrounding communities"]["My staff was in the area and received an update at the emergency meeting this morning"]["My staff and I are in touch w/ federal, state and local officials regarding Wood County fire."]["#TaxReform means providing certainty for small business owners. https://t.co/OUkBmBxgyO"]["Too many WV business owners feel like they can’t get ahead. Reforming our tax code will change this. https://t.co/4O3fmmfjF3"]["#TaxReform will allow small business owners—like the one I met in Kanawha County—to expand &amp; increase wages. https://t.co/dpHJNYao6M"]["#LegacyAct can prevent overdose deaths. That's why I urged @POTUS' Opioid Commission to include it in final report: https://t.co/sygfYGyaMJ"]["Beautiful day to celebrate #BridgeDay today in Fayette County! #almostheaven ☀️ https://t.co/3wdkHk6vgO"]["Boosting local economies &amp; creating opportunities in #WV requires efforts from both public &amp; private sectors. MORE: https://t.co/CaPHHTRx5J"]["My weekly newsletter is back &amp; there is a lot to report! Catch the highlights here: https://t.co/zvA2uS5tt1 https://t.co/WA6UIoRFqq"]["Today, the USNS Hershel “Woody” Williams will officially be christened by the @USNavy. Congrats @WoodyWilliams45! https://t.co/XMZ9B5zA3Y"]["#taxreform is needed to bring confidence to our economic future. @amandabarren at @WSAZnews has more: https://t.co/2yiwGWXSBJ"]["RT if you agree: Americans deserve a tax system that is fair. https://t.co/rcj0pGRIKn"]["Budget resolution ✅. Next stop ➡️ #taxreform. WATCH for more: https://t.co/u0nqEVbr28"]["Also outlined how #WV can benefit from partnerships that encourage investment &amp; diversify &amp; strengthen local economy https://t.co/CaPHHTRx5J"]["Hard-working WVians deserve a tax system that works for them. I outline how this would help small bizs: https://t.co/xiQrnr9DaQ"]["Reminder that my staff will be in Clay, Calhoun and Tyler counties today. Times and locations here: https://t.co/IIS06TgcxI https://t.co/4Aj7Usrp3Q"]["Voted to pass a reasonable budget resolution, an essential step toward comprehensive #taxreform. My statement: https://t.co/uxNwiLgxxh"]["Thanks to @WhiteHouse for hosting our excellent county commissioners &amp; legislature. Working together we will continue to strengthen WV. https://t.co/uPhSSrThVo"]["As long as we have the right tools to succeed, WVians can compete: https://t.co/CaPHHTRx5J"]["This week, I announced funding to support resources that promote economic development &amp; strengthen #WV communities: https://t.co/py7gbmkrJz"]["With #taxreform, we can strengthen #WV’s economy. My take in @DM_opinion: https://t.co/xiQrnqS1Mg"]["@SecretaryPerry This would be a huge boost for our domestic energy and manufacturing potential - and that's why I'm working hard to make it a reality."]["Spoke to @SecretaryPerry today about standing up a new energy storage hub to Appalachia."]["ICYMI: Spoke w/ @TeamCavuto on @FoxBusiness about the need for comprehensive pro-growth #TaxReform. WATCH: https://t.co/QYUcy0bkmO"]["Passing this budget resolution is an essential step towards #taxreform. https://t.co/AdtXLn3FCb"]["A vote for the budget resolution is a vote for tax relief and job creation. https://t.co/p2WQ97JrBT"]["Today’s mobile offices are happening in Cabell &amp; Wetzel counties. Stop by to learn how my office can assist you: https://t.co/IIS06TgcxI https://t.co/oHuE6MQsVF"]["Great to see our West Virginia County Commissioners at the National Association of Counties today. @NACoTweets https://t.co/63O3lCjxtT"]["Joining several of my colleagues on the @SenateFloor shortly to talk about the importance of #taxreform. Tune in: https://t.co/bhlzgllFrE"]["About to go live on @FoxBusiness where I’ll be talking #taxreform &amp; the budget w/ @TeamCavuto. Tune in if you can! https://t.co/1Su5BuBdNj"]["Skyping w/ @EasternWVedu leaders today &amp; sharing the latest from the Senate. https://t.co/4ZxcGWy8iO"]["#TaxReform means more opportunity for West Virginians. https://t.co/0xBNoVeex5"]["My staff will be making stops in Webster Springs &amp; Petersburg tomorrow to host mobile offices. Details below: https://t.co/2JTLMZqLuj"]["Glad to see @WVUHealth’s @claymarsh telling the #WV story on Capitol Hill &amp; sharing our efforts to combat the #opioid epidemic. #drugfreeWV https://t.co/e8ihzBEBIy"]["Teamed up w/ @SenCortezMasto to encourage young girls to pursue careers in computer science. MORE: https://t.co/BTy12PgQ6C"]["I’ll be on @WVMetroNews talking w @HoppyKercheval about the need for #TaxReform &amp; other updates. LISTEN LIVE @ 10:06 https://t.co/fJH6GNw4qe"]["First mobile office of the week happening today in Harrison County. Schedule your 1-on-1 meeting w/ my staff here: https://t.co/IIS06TgcxI https://t.co/lqo3fDsQLB"]["Announced new funding from @USDA to improve safety &amp; health of WVians. MORE: https://t.co/TkJ1FbEdK9"]["Just posted the new dates &amp; locations for mobile offices this week. Check out the schedule &amp; sign up here: https://t.co/IIS06TgcxI https://t.co/TS8JdbQRrP"]["Next week @SecAFOfficial will join me in West Virginia, we’ll visit @guard_wv bases &amp; meet the brave men and women who serve in @usairforce."]["Our tax code is too complex and costs too much. The time for #TaxReform is now. https://t.co/v3fzJvL2Wo"]["Thrilled to be in @JeffCoWV today for the groundbreaking of their new center. Glad to have helped make this center possible. https://t.co/sC2aE9h8sB"]["Highlighted the important role #innovation &amp; research play in #WV’s economic growth during @ResearchAmerica forum at @ShepherdU. https://t.co/diDiTNFoNp"]["WVians know best how to spend their hard earned dollars. https://t.co/PmmElIYAI5"]["HAPPENING SHORTLY: participating in @ResearchAmerica's panel discussion on economic growth in #WV. WATCH LIVE: https://t.co/eshQLHfV5x"]["Tune into WEPM @WVPanhandleLive at 8:30AM–I’ll be previewing my visits today in the Eastern Panhandle. Listen here: https://t.co/vP3B5BPLYC"]["ICYMI: @US_EDA grant I announced this wk will add $16 million to regional economy. @smail5news has the scoop: https://t.co/4OOQnwkPxw"][".@BDTonline: @cityofbluefield's Commercialization Station receives federal boost. Read the story here: https://t.co/Ceg2deS1Cx @cartinc"]["An #energy economy is a jobs economy. Good to hear @FERC approved 2 pipeline projects that represent critical #infrastructure for #WV."]["I have no doubt that these 5th graders are prepared to take on the world. Read more about #WVGirlsRiseUp: https://t.co/hdnyIixoug https://t.co/o1ZHH5shUV"]["Lucky to be with our oldest son Charles on his birthday. Seems like yesterday he was the little boy in the first photo! 🎉🎂🎈 https://t.co/YAFbgGJ6hI"]["#WV has beautiful hardwoods, which is why I was glad to play a role in @ArmstrongFloor's announcement to expand: https://t.co/1c8GKE07G2"]["Congratulations to @WVWesleyan’s new president @WVWCPrez! Glad my staff could join you to celebrate your inauguration today! https://t.co/d1OZnagOs7"]["From #broadband to #TaxReform to creating a #drugfreewv, I enjoyed hearing from WVians like you. A few highlights: https://t.co/178lFydPgk"]["This week, Beverly Elementary students joined me in committing to the #WVGirlsRiseUp challenge. @WDTV5News has more: https://t.co/yjcdhefDyD"]["Last chance to attend a mobile office this week! My staff will be in High View &amp; Elizabeth today at 11:30. Details below: https://t.co/Ox0UGaaTpz"]["Putnam County Drug Court graduate Joe Walker serenaded the crowd – what a treat! https://t.co/Pc8W5q51Gc"]["So proud of the Putnam Co. Drug Court graduates today. It wasn’t easy, but they took control of their lives by committing to this program. https://t.co/NhNjDQObZ1"]["New executive order from @POTUS is a first step to help make health insurance more affordable and accessible for all Americans."]["Last mobile offices of this week happening tomorrow in Wirt &amp; Hampshire counties. Sign up here: https://t.co/IIS06TgcxI https://t.co/f1FeoIyyt9"]["#WV was 1 of 4 states @USGAO visited for its study on treating babies born addicted to drugs. MORE: https://t.co/e61YoXFwMN via @WVMetroNews"]["Heard from #WV small business owners about how #TaxReform can help them expand, add jobs. https://t.co/AjGax9bpQT"]["#WV small businesses deserve a fair tax system – don’t you agree? I explain why in my op-ed for @DM_opinion: https://t.co/xiQrnr9DaQ https://t.co/GLmkVqdNey"]["Great turnout this morning at #WVCoding event where WVians are learning about tech industry opportunities &amp; how to pursue them. https://t.co/IqS5gldLPf"]["#TaxReform is key to the success of our small businesses in #WV. https://t.co/x0wq3NHybF"]["Reminder that my staff will be in Ritchie, Putnam &amp; Morgan counties tomorrow hosting mobile offices: https://t.co/IIS06TgcxI https://t.co/22GfRjUQ5t"]["#TaxReform means more opportunity for everyone. It’s a win-win. https://t.co/wiaIxaaEWK"]["Made several major economic development announcements that will improve our economy. Learn about each award here: https://t.co/zqvFmljrKZ https://t.co/pgtboJ5bpW"]["Whether its #manufacturing, #entrepreneurship or #tourism, vibrant communities are vital to our economic strength."]["My op-ed for the @InterMountainWV outlines how partnerships with @US_EDA can revitalize communities &amp; grow economies https://t.co/j4dPcqkH9Q https://t.co/kZ6LLengqQ"][".@USDA funding headed to Gilmer Co. Sheriff Office &amp; Capon Bridge Police Dept to purchase new police cruisers. MORE: https://t.co/WaGlecawcA"]["Recently spoke about how #WV bizs like EH Chocolates &amp; More can benefit from #TaxReform. https://t.co/lxqqqhJi64 via @WVMetroNews"][".@FLOTUS visit to WV signals a commitment to making opioid crisis a nat’l priority &amp; is a testament to WV's efforts: https://t.co/c5gJuwqPTg"]["More mobile offices happening this week across #WV. Check out the updated schedule here: https://t.co/GSFOA147PU https://t.co/p4sr7ITDyT"][".@EPAScottPruitt's plan to withdraw from #CleanPowerPlan shows our energy strategy is headed in right direction: https://t.co/EZoWdo2UbC"]["Did you catch my op-ed in Sunday’s @heralddispatch? If not, read it here: https://t.co/eVJF9c16eh https://t.co/yJERymG6DJ"]["#TaxReform is the change hardworking Americans &amp; West Virginians are hungry for. https://t.co/e4XWk5sTCJ"]["Always good to see my friend @MarshalluPres Dr. Gilbert. Enjoyed hearing about the latest at @marshallu during his visit last week. https://t.co/NGVvQuTCeB"]["Wishing all West Virginians a safe and happy #ColumbusDay!"]["#TaxReform is about simplifying Washington’s tax code so #WV businesses can succeed. https://t.co/O5bvCJygiN"]["New study outlines road map to treat babies w/ addiction and combat the drug epidemic: https://t.co/bU4NcCOs5y via @heralddispatch"]["Every 25 minutes, a baby is born w drug exposure. Spoke w @WSAZnews about a new study that calls for federal action: https://t.co/ROZ430X1Zj"]["#TaxReform is the key to economic growth  and vibrancy for future generations. https://t.co/Ut0Me5saew"]["A lot of updates for you this week – check them out in my weekly newsletter! https://t.co/xWHtFaKyMm https://t.co/bU9em5hk6X"]["Don’t miss my last Academy Day this afternoon. Stop by Woodrow Wilson HS in Beckley from 2-4PM &amp; learn about attending a service academy https://t.co/OmmYVdaoFn"]["@SenatorShaheen I’m so glad @POTUS just signed our bipartisan bill into law!"][".@SenatorShaheen &amp; I introduced the Women, Peace &amp; Security Act to promote women’s inclusion in peace processes."]["We're natural &amp; effective problem-solvers &amp; should have the opportunity to be more involved in these critical international discussions."]["When it comes to peacekeeping and mediation, it just makes sense for women to have a seat at the table."]["My staff joined the #WV Marine Corps League for a monument dedication this week, a fitting tribute to their service. https://t.co/AoYWsmiFev"]["On #MFGDay17, we highlight manufacturing’s value to the economy and products that are #madeinWV"]["Announced the next step in the fight to protect our retired miners &amp; their families. WATCH for more: https://t.co/jqROrWSkUi"]["#TaxReform will provide needed relief for small business that employ so many West Virginians. https://t.co/cdo6qJ4Jcv"]["Inspired by Elkins’ Skyler Moats for her positivity &amp; commitment to raising awareness about kidney research. Great to meet you! https://t.co/Xr6NArOyAF"]["#TaxReform will help small businesses like EH Chocolates &amp; More in Kirby, West Virginia: https://t.co/Tfz7W0l1cy"]["Our tax code is too complicated. It’s time to simplify it, and create more opportunity and higher wages for Americans."]["Small businesses are a major economic driver in our economy–95% of businesses in the U.S. are small businesses. This # is even higher in WV."]["HAPPENING NOW: Speaking on the @SenateFloor about the importance of #TaxReform for our small businesses. WATCH LIVE: https://t.co/B78ZDHukws"]["Great news: 5 WV counties to receive funding to support fire safety efforts. DETAILS:  https://t.co/iX1YS18Qix"]["Touched to hear @NALC_National award winner &amp; WVian Holly Allen’s story of helping an elderly woman. Read it here: https://t.co/vvJYjx7R0Z https://t.co/kZV1xKDWx6"][".@USGAO releases new study @RepEvanJenkins &amp; I requested on how we can better treat babies exposed to opioids. MORE: https://t.co/vPr41SDcvp https://t.co/2YlangwrXu"]["Pleased @GOPSenFinance Cmte just approved a bipartisan funding package for the Children's Health Insurance Program, a good step for WV kids"]["JUST ANNOUNCED: new funding headed to Harrison Co. to support the area’s response to the opioid epidemic. MORE: https://t.co/ji49hbm0pH"]["Bumped into my friend and fellow WVian @ChrisStirewalt last night – a TV star! https://t.co/hmLHfZoAo2"]["Congratulations to Bill Powell, northern West Virginia's new U.S. Attorney. Was honored to recommend you."]["#TaxReform is critical to growth &amp; jobs, which is why Congress must act now. @wtaptelevision has the details: https://t.co/DzlHuHplJj"]["The AMP Act ensures that hardworking miners receive the pensions they have rightfully earned. Learn more: https://t.co/noJqZqBsLP"]["Stood with @MineWorkers retirees to announce new steps to address the pension crisis facing America’s miners https://t.co/YYDyskRNJG"]["ICYMI: I spoke in support of @AjitPaiFCC on the @SenateFloor before the vote. WATCH here: https://t.co/Ur4UmmSFw9"]["Proud to vote to reconfirm my friend @AjitPaiFCC. He’s been a great partner in my efforts to bring #broadband to WV: https://t.co/uBSZt2L0T5 https://t.co/J5qXe38HsA"]["Happiest of birthdays to @WoodyWilliams45! Hope you enjoyed my birthday note! https://t.co/RlTIcTPqFO"]["I’m confident that rural America will see more progress w/ @AjitPaiFCC’s continued leadership &amp; I’m proud to support his nomination."]["Under @AjitPaiFCC’s leadership, the @FCC has made significant investments to deliver #broadband service to underserved parts of the U.S."]["I’ve had the pleasure of hosting @AjitPaiFCC &amp; his staff multiple times in #WV &amp; he has witnessed these difficulties firsthand."]["Our small towns &amp; bizs lack broadband &amp; lack access to vital opportunities as a result-No one understands these issues more than @AjitPaiFCC"]["Connecting #WV is one of my top priorities."]["From starting a business to digital learning &amp; telemedicine, #broadband access is critical to our economy &amp; communities."][".@AjitPaiFCC has been an important partner in my quest to bring rural America &amp; WV online."]["Ahead of @AjitPaiFCC’s confirmation vote, I’ll be speaking on the @SenateFloor in support of him. WATCH LIVE: https://t.co/B78ZDHukws"]["My last Academy Day is coming up this Saturday in Beckley from 2-4 p.m, don’t miss it! DETAILS: https://t.co/bUzGwZb9Jx"]["Had a big turnout at my Academy Day in South Charleston on Saturday! Enjoyed meeting so many students and future leaders! https://t.co/I3MSK8RrqT"]["Very proud of the West Virginia @NavalAcademy Midshipmen that I met today! https://t.co/uDxSeA9NFm"]["My statement on the #LasVegasShooting: https://t.co/J0nYoeuZze"]["Great to see GWHS Principal Aulenbacher &amp; congratulate him on being named WV’s 2017 Secondary School Principal of the Year! https://t.co/Fy5pMkRGcS"]["#Broadband doesn’t just connect our communities, it improves quality of life. @PositivelyBrie has the scoop: https://t.co/SJCy0JbxYE"]["Reminding all WV students &amp; families to stop by University High School for the Academy Day I’m hosting w/ @RepMcKinley. Details here: https://t.co/ygIhWmuedG"]["Where does the time go? Happy birthday Shelley! 🎉🎂🎈 https://t.co/sII7WjYzVI"]["Have some downtime this morning? Take a look at this week’s news from Washington and West Virginia: https://t.co/GwCatY4tke https://t.co/c87hTJIee0"]["Today is the day! Come visit my Academy Day at South Charleston High School from 2-4. Details below: https://t.co/zYFlqY6cc6"]["Happy to announce funding for @CoalfieldTweets to support their successful job-training initiatives. DETAILS: https://t.co/f4eDNwkaEs"]["Introduced a resolution w @SenAngusKing designating September as Nat’l Alcohol &amp; Drug Addiction Recovery Month. MORE https://t.co/1Dz0sBkDYz"]["Really enjoyed meeting the Lineweaver family during their tour of the @uscapitol. It's always nice to see friendly faces from back home. https://t.co/CZ65KmXR30"]["Hope you’ll come out to my Academy Day tomorrow at South Charleston High School. @WSAZnews has the details: https://t.co/H1V1JpLkCx"]["It’s been decades since our last tax overhaul. The time for pro-growth #TaxReform is now. WATCH for more:  https://t.co/V5qb8zM6YY"]["Honored to be recognized by @SCOREMentors as a #BizChampion for the small businesses that are truly the backbone of WV’s economy. https://t.co/LYmCZOsW3L"]["Announced funding from @TheJusticeDept that will be key in helping fight against opioid crisis in #WV. MORE: https://t.co/CTswoO5F5M"]["Back-to-back Academy Days happening this weekend in South Charleston &amp; Morgantown. Details on my website: https://t.co/bUzGwYTykX"]["Announced funding to help @CampusBeautiful &amp; @davisandelkins student vets working to continue their education. MORE: https://t.co/GOEqovyNxd"]["Glad to hear @senjudiciary advanced Bill Powell's nomination. He's uniquely qualified to be the next U.S. Attorney in the Northern District."]["Just got back from a packed @HouseFloor where we welcomed &amp; honored our friend @SteveScalise. Gave him a thumbs up to show our WV support!👍🏻"]["My full statement on Wood County’s HIDTA designation: https://t.co/2Oze9kqiw1"]["This federal designation will give Wood County more resources to further coordination &amp; development of #drugfreeWV efforts."]["NEWS: Wood Co. received HIDTA designation to help fight drug epidemic. @ONDCP's Richard Baum called me to deliver the news earlier this week"]["Welcome back to my friend @SteveScalise, a true hero and inspiration to us all. https://t.co/24tpfb97vN"]["More good news for WV’s economy. Great to hear Hino Motors plans to bring more jobs &amp; investment to our state! https://t.co/KnF2bThH4c"]["Honored to receive @Aging_Research's Distinguished Public Service Award at the #alliancedinner17. So grateful for the important work they do https://t.co/0Mo56Y91Jp"][".@CAMC_HS made the trip to DC to show how broadband is needed to advance health innovations. Glad to have them at the Broadband Caucus expo! https://t.co/Rf1sTgcOJp"]["Let’s create an environment that leads to more investment in #WV &amp; continued job growth. Let’s make it happen with #TaxReform"]["WVians deserve relief from the complexity of the current system &amp; they deserve to keep more of their hard-earned income."]["By modernizing the tax code, we can achieve a simpler system w/ lower rates that is good for bizs &amp; workers."]["#TaxReform is the change WV needs to revitalize communities &amp; increase economic growth that creates opportunity for future generations."]["#TaxReform will enhance growth &amp; provide more job opportunities for Americans."]["Speaking on the @SenateFloor now about the need for comprehensive #TaxReform &amp; how WV can benefit. WATCH live: https://t.co/B78ZDHukws"]["Hosting a #Broadband Caucus Telemedicine expo today from 12-3PM – WATCH LIVE at 2PM here: https://t.co/wPvgfljd4Q"]["#Broadband access is critical to advancing health innovations. Join exhibitors from #WV &amp; other states today from 12-3PM in 216 Hart. https://t.co/2BW6X0w7RK"]["The Senate Broadband Caucus is hosting a telemedicine expo tomorrow in 216 Hart from 12-3PM. Hope you’ll swing by. https://t.co/BTXrQEu7Ey"]["JUST IN: @Toyota WV is investing $115.3 million to expand operations at its Buffalo facility. More information here: https://t.co/sOR9VOl0vk"]["We’re expanding WVians’ access to the natural splendor of WV in Tucker, Summers, Wayne, Marshall &amp; Berkeley counties https://t.co/DpTyW7bY1t https://t.co/5SFsNP8lLO"]["Excited to see how @marshallu will use new resources I announced to build a better, stronger economic future for WV: https://t.co/RJwF7i5HWl"][".@huntingtoncity has set an example in the fight to end the drug epidemic. MORE on new funding to continue efforts: https://t.co/1Bq8uo7arl"]["Offered a few pieces of advice to the future leaders at Spring Mills High School last week: https://t.co/fgoXnsdV62 via @TheJournalWV https://t.co/6aIgMouhUL"]["Glad so many WVians made it out to my Academy Day at Spring Mills High School yesterday. Check out upcoming dates: https://t.co/bUzGwZb9Jx https://t.co/3L9Kg2Jklq"]["Great news: more funding announced to support community efforts to combat drug epidemic. Learn more: https://t.co/BMe5KIgatJ"]["Catch up on the latest from the Senate in my newsletter: https://t.co/CLNQYDPgrl https://t.co/psFp2wJr2E"]["Our community health centers provide critical care for WVians. That’s why I’m requesting HELP committee extend funds https://t.co/YnHgS9ddhE"]["Good read in @TheJournalWV about need for hope in creating a #drugfreeWV. Witnessed this during a recent visit. https://t.co/z9aYg43XGE"]["Reminder that my 1st Academy Day of the fall is happening tomorrow in Martinsburg at 2 p.m. DETAILS: https://t.co/bUzGwYTykX https://t.co/6z1Fr7UIhm"]["Thanked Spring Mills High School Principal Myers &amp; his staff for hosting my 1st Fall Academy Day this Sat. Details: https://t.co/bUzGwZb9Jx https://t.co/w8PXE8p6bU"]["NEW: funding announced to support law enforcement efforts in the Mountain State. Details here: https://t.co/hulcec9vkk"]["The #LegacyAct reduces barriers, improves communication and reforms out-of-date regulations to help prevent overdose deaths. https://t.co/cCkfFQueFO"]["New #LegacyAct honors WVian Jessie Grubb and will help those suffering from addiction receive quality care: https://t.co/xGquy2MBkq"]["Ran into a group from Bridgeport &amp; Hurricane before my staff took them on a @uscapitol tour yesterday. Always love meeting WVians! https://t.co/ogyBIz1pn9"]["My fist Academy Day of the fall is this Saturday in Martinsburg. Come check it out! https://t.co/pZOPTOJtp3"]["Met w an impressive group of @WVHOSA members &amp; discussed how career technical education is helping WVians in the changing job market. https://t.co/rNLT4iJqkm"]["Appreciate the commitment of @ThinkAnthem &amp; @PCORI in fight to curb #OpioidCrisis. Efforts like theirs will bring us closer to a #drugfreeWV https://t.co/xs5FZz8Gm9"][".@WVNationalGuard is vital to our nat’l security &amp; deserves equal pay &amp; benefits - #NDAA makes Dual Status Technicians eligible for Tricare"]["#NDAA strengthens our military &amp; my amendment ensures reservists deploying under 12304b receive health benefits."]["Announced funding to support @ywcacharleston's efforts in helping sexual assault &amp; domestic violence victims recover https://t.co/53A25au34q"]["Teachers like Jefferson Co’s Katlin Thorsell help students succeed-Congrats on being named WV’s Teacher of the Year! https://t.co/BTgISewxUD"]["Many thanks to @NTIAgov for hosting their #BroadbandUSA workshop in Charleston today. Wish I could have been there! https://t.co/GuWRumR97G"]["HAPPENING NOW: @SenateCommerce hearing examining a bill I support to stop sex trafficking. WATCH LIVE: https://t.co/wHuSM1MUIc"]["Looks like a great turnout at @NTIAgov's #BroadbandUSA workshop today in Charleston. Glad so many WVians attended! https://t.co/DbgCGSlm4S"]["It’s Congress’ responsibility to ensure our military is prepared. Proud to support a bill that will do just that: https://t.co/YgeBJTLpmm https://t.co/ALis4UcqVC"]["#TaxReform will enhance growth in our state and provide more job opportunities for West Virginians. Here's how: https://t.co/pL0eEDnV7N"]["WVians like Jan &amp; Sheena are leading their community’s fight to curb the drug epidemic. Honored to recognize them at Recovery 4 a Change. https://t.co/7LZI9j363T"]["Last week, my staff explained how my #COREAct can help spur investment, revitalize communities &amp; strengthen the economy. https://t.co/qSNnwTsMLK"]["Scroll through my newsletter to catch up on what’s happening in the Senate: https://t.co/5BlNfoJ0uM https://t.co/774boVE0cf"]["Great news! @NTIAgov's #BroadbandUSA Workshop in CRW this Tue. has additional space. Details here: https://t.co/AKVWPC7jmJ"]["I’m working to make sure our reservists have proper health care &amp; retirement benefits. @WOAYNewsWatch has the story: https://t.co/LQRR2uWRGl"]["My staff stopped by the Bluefield Coal Show to see hundreds of exhibitors showcase new innovative coal technology &amp; equipment. https://t.co/txsJgbvZZr"]["#AcademyDays are right around the corner! Interested students &amp; families find out more here: https://t.co/FPOi988Krs via @Register_Herald"]["Maintaining roads &amp; bridges is essential for a strong economy. Details on new funding for transportation programs: https://t.co/qiuBRmGLFe"]["The Senate tackled one of its top priorities this week: funding our military. WATCH for a quick rundown of the bill: https://t.co/JjlSk6AIbD"]["Glad #CapitoConnect has been part of the discussion at @wvcommerce's development summit as @rob_hinton4 talks closing the #digitaldivide. https://t.co/OaPmO4IcIt"]["Earlier today I spoke to a group about the benefits of an Appalachian Storage Hub &amp; how it can rejuvenate our region’s economy. https://t.co/svZONJ0ARA"]["The United States has an opportunity to be a leader when it comes to carbon capture technologies. WATCH for more: https://t.co/2qgaGhZPRf"]["It’s never too early to start planning for the future. More on my latest effort to help middle schoolers succeed: https://t.co/WeRb0XLRtM"]["Big news: WV health centers like Cabin Creek are getting nearly $3.7M for substance abuse &amp; mental health services. https://t.co/ixWMnQjcHK https://t.co/NkXT6DWnW3"]["Heard about @NASA Astronaut @astro_kimbrough's recent mission aboard @Space_Station. After that mission, he’s now logged 189 days in space! https://t.co/5ayEklK8jh"]["Had the pleasure of recommending Michael Baylous to @POTUS as nominee for US marshal. @BDTonline has more: https://t.co/Zm64oSSu7f"]["#Entrepreneurs &amp; innovators in the #energy sector are key to growing WV’s economy. Find out how I’m supporting them: https://t.co/1Lq9H53suU"]["Many thanks to WV’s @AmericanCancer volunteers like these for their efforts to eliminate cancer. Enjoyed meeting you today! https://t.co/eS33k1YwHq"]["The #WV Nursery &amp; Landscape Association stopped by to talk about #taxreform &amp; how it will help #smallbiz around the state. https://t.co/l7oYkfNRhc"]["ICYMI: New funding for @YeagerAirport will improve safety &amp; increase business development. WATCH for more: https://t.co/agYzf3bMKJ"]["New funding headed to @WestVirginiaU that will help increase production &amp; performance of #manufacturing. MORE: https://t.co/sMsg0SR5PM"][".@marshallu &amp; @WestVirginiaU to receive funding to support workforce training programs. Great news! Learn more here: https://t.co/bffAkF7vYc"]["Northern WV bizs: the @SBAgov Business Recover Center in Fairmont will close Wed. at 6PM. Stop by before 9/13 if you need assistance."]["Join me in praying for the families of 9/11 victims &amp; give thanks to those who keep us safe. https://t.co/CIkbuiZOoa"][".@YeagerAirport is WV’s largest airport &amp; plays a significant role in our economy, which is why I worked hard to secure this funding. https://t.co/B3Q5LLfUqd"]["At @YeagerAirport to announce much-needed funding to repair landslide damages. https://t.co/neO6oWNSyX"]["We haven’t had a tax overhaul since 1986. Now is the time to reform our tax system. https://t.co/isSoFieoKc"]["My newsletter is back! Check out some photo highlights from my visits across #WV: https://t.co/5vntG3QUo0 https://t.co/SqyeifCQ8g"]["Since @YeagerAirport's landslide, I’ve worked to secure funding for repair efforts. Glad this is now a reality: https://t.co/V7Y9C5jOPI"]["WV small businesses are the backbone of our economy but need tax relief to grow. More in my interview w @WBOY12News: https://t.co/tsy9G8507N"]["My statement on @POTUS nomination of Mike Stuart to be U.S. Attorney in West Virginia's Southern District: https://t.co/abvBuYOJgn"]["Here’s how tax reform can help West Virginians: https://t.co/EbXUanTY7t"]["Just announced my upcoming Academy Days for #WV students &amp; their families. Check out the schedule here: https://t.co/bUzGwZb9Jx https://t.co/EOuc1SYojX"][".@WoodyWilliams45 has dedicated his life to serving others. Thrilled the Huntington VA will be named in his honor: https://t.co/GPg02SONUF https://t.co/C2zLxck3QE"]["Had the chance to thank @BGCA_Clubs WV &amp; national members for their great work. Enjoyed meeting you all! https://t.co/cKZ1YNUVep"]["Continuing to push for WV priorities on the Approps committee. Great wins in bills the committee passed today ➡️ https://t.co/VmIG4oIpXT"]["@Sen_JoeManchin Thanks @Sen_JoeManchin!"][".@YeagerAirport funding &amp; my #drugfreeWV efforts are a few topics I’ll discuss w @HoppyKercheval. Tune in at 11:06: https://t.co/tEyyY27VsB"]["Our natural gas reserves were a key reason US Methanol chose Institute as their plant location. My staff helped them break ground today! https://t.co/LGSfVNGTJ7"][".@NTIAgov will be hosting a #broadband workshop in Charleston on Sept. 19. Don’t miss this opportunity &amp; RSVP here: https://t.co/AKVWPC7jmJ"]["Wishing a very happy birthday to 2 members of #TeamCapito – Baxter and Cam! 🎉🎈 https://t.co/caCkHFKKNI"]["Seeing a small town like Worthington come together to tackle a goal like their riverbank project is inspiring. MORE: https://t.co/eMqKdG4XIu https://t.co/ijL0gCwKl6"]["Had a great time with family and friends supporting @WVUfootball last night in their season opener! #Mountaineers #HailWV https://t.co/njyiJf1D3i"]["This #LaborDay, please join me in thanking the hardworking WVians who help make our state so strong. https://t.co/AFazyHTrzI"]["Ready to cheer on the #Mountaineers tonight against @VT_Football. Let's go @WVUfootball! #HailWV 🏉 https://t.co/rNNBd1T1UC"]["ICYMI: Find out more about the WV counties that were recently awarded grants for fire safety: https://t.co/CSfu2WFYoB"]["Allegheny Wood Products is a true leader in the community &amp; it’s been exciting to see them grow. Congrats on 25 yrs! https://t.co/RGGDP6nEIg https://t.co/OjgL1XzTRQ"]["This August, I’ve been meeting w/ WVians all across the state. Learn more about one of my stops here: https://t.co/eQsN0dXpIS https://t.co/HzmniJGGTC"]["Enjoyed the 45th annual @chardistrun this morning with Susan, Sarah and Kim. https://t.co/8VaZi1JRbC"]["Glad to see more funding headed to #WV to keep our communities healthy. Read about them here: https://t.co/KbHk6gYNmm"]["ICYMI: Hosted @ONDCP's Chip Muir in WV last week to highlight the work we are doing to combat the opioid epidemic. https://t.co/SremMNbAXy https://t.co/CUH6r0oY7k"]["Joined chemical industry leaders for a roundtable discussion this AM about advancing the industry &amp; its impact on WV’s economy. https://t.co/eop9he63CJ"]["At @WVaChamber Business Summit today updating biz leaders on the progress I’m making for #WV in the Senate. https://t.co/IFsu82Z4K7"]["New @ARCgov funding I announced today will drive tourism and strengthen our local economy. Learn more here: https://t.co/I4U2BYbuvU"]["Great to be with @VP for @WVaChamber Business Summit and discuss tax reform, Appalachian storage hub and disaster relief. https://t.co/yvJ86cX3KT"]["Hosted Secretary @stevenmnuchin1 to show why tax reform is a necessary step to growth &amp; expansion for WV businesses https://t.co/vpTzJkqdlQ"]["Enjoyed spending time in WV's beautiful mountains with Weyerhaeuser, a leader in our timber industry &amp; a critical component of our economy https://t.co/XhFFLXB2u6"]["Yesterday’s celebration at Allegheny Wood Products made clear that we have products that serve customers around the globe. 2/ https://t.co/QYqZuOK0oy"]["Celebrated new streambank restoration Tues. This collaboration between Army Corps &amp; Worthington will support rivers, streams &amp; waterways. https://t.co/tSRpoqyzqP"]["Wishing @SenJohnMcCain a very Happy Birthday!"]["This family-owned textile company sells products around the globe from its Parkersburg HQ. Great to meet the folks at Kreinik today. https://t.co/LOIIBV9Uk9"]["Praying for those in Texas who have been impacted by #Harvey and sending strength to those who are leading response and rescue efforts."]["We also visited the more than 2,000 people that work at the Bureau of Fiscal Service in Parkersburg. 4/ https://t.co/JlqeBhOepM"]["Today’s roundtable demonstrated that tax reform is a necessary step to growth and expansion for West Virginia businesses. 3/ https://t.co/uOOHi0LuGB"]["I led a discussion with the @USTreasury Secretary about the need for comprehensive tax reform with local leaders 2/ https://t.co/aEbNcoUnmB"]["Pleased Secretary @stevenmnuchin1 accepted my invitation to visit West Virginia &amp; hear directly from business &amp; other leaders 1/ https://t.co/OhhjPNhTwl"]["West Virginians like @WoodyWilliams45 deserve our highest praise. Glad I could be with him and others to dedicate new Medal of Honor Wall. https://t.co/xW9JEyyTbC"]["@WVHHOMA Wonderful to be with you!"]["Wonderful to see Dr. Katherine Johnson and Dr. William White at last night's celebration. https://t.co/tHZAye4iHa"]["Happy 99th Birthday to WV pioneer Katherine Johnson. Please join me in honoring her unyielding curiosity, ingenuity and bravery."]["Yesterday we lost one of our own in Randolph County. My heartfelt condolences are w/ the Jones family &amp; all of West Virginia’s brave miners."]["Sharing what I learned on my tour through the Bluefield region today on @WVVA at 5. Tune in for the latest."]["Also learned about a residence hall project at @blfdStsteColl that would be positively impacted by my #COREAct: https://t.co/qeZF5qQqb0 4/ https://t.co/zNZbaWX7VI"]["At @blfdStsteColl met President Krotseng, heard about how its manufacturing engineering center is retraining workers for new careers 3/ https://t.co/OerljH6rGv"]["The Mercer County Airport and new Elgood water project exemplified the impact that #infrastructure can have on economic development 2/ https://t.co/5ulQrvRdaO"]["Made several stops in the Bluefield area today to see how West Virginians are spurring job creation and workforce training there 1/ https://t.co/8QxNi18uqu"]["Visited @DISH and its 500+ employees in Bluefield, took their questions and learned how satellite #broadband can help close digital divide https://t.co/bBXWZOG18n"]["Last week, I was fortunate to take a powerful trip to Israel w/ @CharlestonRabbi. Read about our inspiring visit --&gt; https://t.co/z69wnElx8o"]["Great to see firsthand how @TWMetals has successfully diversified its business and hear from the hardworking employees there today. https://t.co/ZOeTSsdBv7"]["Great to visit with you in Charleston @maryanntierney, thanks for your work getting help to West Virginians who are recovering from #wvflood https://t.co/zofKlmkKqN"]["Williamson, WV will soon be online, just announced funding for new Wi-Fi hotspots in that community: https://t.co/juPW6QMX4M"]["@sbagov will also open a Business Recovery Center at 1000 Technology Drive in Fairmont on 8/25 to help bizs impacted by July’s severe storms"]["@fema is in Harrison, Marion, Marshall &amp; Wetzel Counties to assist with registration for flood assistance following July's storms. https://t.co/occabxlzYu"]["Thanks for the great discussion about broadband &amp; more. As broadcasters, you understand importance of reliable, high-speed internet access. https://t.co/KkIPGqsj6Z"]["I support the direction @POTUS laid out on Afghanistan/S Asia &amp; remain forever grateful to our service members. More https://t.co/tK173ivIjH"]["3 things you need to know about the B-CROP Act - my latest effort with @SenGillibrand to connect rural communities https://t.co/PzczQAfs1h"]["As we continue our work to prevent &amp; treat addiction, @WestVirginiaU research is finding solutions: https://t.co/aZrQlrGoov"]["Heartbreaking to learn about the #USSJohnMcCain accident. Please join me in praying for the crew and rescue team as the search continues."]["Last week I announced my latest effort to make funding available for rural #broadband projects: https://t.co/YanWkmo06b https://t.co/HU94bB9qJ3"]["Economic development goes hand-in-hand with #broadband access. This piece by @WDNnews for more on my efforts: https://t.co/YGAPpIFCjY"]["Harrison, Marion, Marshall &amp; Wetzel Cos, you can now register for assistance  following July's floods. Here's how: https://t.co/MKdmyCOLV1"]["Investing in our airports is important to our economy &amp; the safety of travelers. Details about new funding for #WV: https://t.co/9baPCJzpX4"]["Some welcome news for WV's tourism economy, enjoyed my visit to the Hatfield-McCoy trail last summer: https://t.co/nf77hPnbmD"]["More than 1/3 of rural Americans don’t have high-speed internet access. Here’s how I’m working to change that: https://t.co/YanWkmFAXJ"]["Thank you @netanyahu for being such a strong U.S. ally. https://t.co/wLUTeYIrTh"]["If you haven’t already, swing by my booth at the @SFWV. My staff will be located on the porch of the WV Building, ready to answer questions."]["Great news that @ENERGY is investing in @WestVirginiaU research project that will benefit WV &amp; entire nation. MORE: https://t.co/Cue26qPREf"]["Saddened to learn about the terror unfolding in #Barcelona. Praying for the victims and sending strength to the first responders."][".@WSJopinion: Coal is showing signs of revival &amp; breathing economic life in West Virginia &amp; other coal states. MORE: https://t.co/GC0pVFX07q"]["Don’t forget to visit Team Capito at the @SFWV.  My staff will be available on the porch of the #WV building. Stop by! https://t.co/x8y04hpW2x"]["Former @WVcourts Justice Cleckley will be missed by all of WV. Thinking of his family &amp; friends during this difficult time. https://t.co/J46eXaZQ7K"]["Heading to the @SFWV today? Visit my staff on the porch of the West Virginia Building &amp; ask about our latest efforts to connect #WV."]["Beginning tomorrow, my office will have a booth at the @SFWV. Stop by the WV Building porch to learn more about our constituent services."]["Last week’s Purple Power Night was an all-around success. Great community support for @PanCAN awareness &amp; a @wv_power WIN! https://t.co/tbyQyQGTKZ"]["South Charleston buried a time capsule (w/ a letter from me) to help kick off its 100th yr. Join the celebration! 🎉 https://t.co/G3PaTSH5g6 https://t.co/ESAXY4Lhu0"]["Asked @POTUS for his support as northern #WV rebuilds &amp; recovers following the flood last month. Read the letter: https://t.co/D7CmsP5Hm7"]["Grateful for #WV #veterans like Paul McCue of Clarksburg who served during WWII in the @USNavy &amp; received the Combat Action Ribbon. https://t.co/wE0yfZKprT"]["This tragedy was domestic terrorism &amp; should be treated as such. It is incumbent upon all of us to reject this type of racism &amp; bigotry."]["The hate &amp; violence expressed by Neo-Nazis &amp; other white nationalists groups in #Charlottesville has absolutely no place in America."]["We might not be able to repay first responders for all they do, but we can honor them through a nat’l memorial. MORE https://t.co/nF5jwf0UQO"]["Jessie Grubb’s story is heartbreaking, but it has inspired action. Glad the Senate passed this important bill: https://t.co/cIiK0HKshH"]["Acts of hate and violence like what we're seeing in #Charlottesville have no place in our country."]["Rehabilitation of Upper Deckers Creek in Preston Co. means improved safety &amp; research opportunities for @WestVirginiaU students https://t.co/BfpI8KFImt"][".@TheJournalWV has more on my recommendation to nominate Bill Powell to serve as US Attorney for northern district: https://t.co/eBrxeKMtPm"]["Congrats to Hino Motors on 10 yrs of success in WV! Can't wait to see what the next decade holds for this biz: https://t.co/lrQCADf1BW https://t.co/4kNDx8eux8"][".@nytimes: WV is leading the way in turning vocational education into a fuel source for state’s economic revival: https://t.co/x282kQCOhU"]["By declaring opioid epidemic a natl emergency, @POTUS is signaling that his administration wants to get more help to those who need it most."]["Not a day goes by that I don’t hear another tragic story of a young person battling addiction."][".@SenateMajLdr is uniquely qualified to lead Senate GOP, look forward to continuing to work with him to advance policies that benefit WV"]["I'm focused on creating better economic opportunity for West Virginians and fixing an outdated tax code for families &amp; small businesses."]["Great news that service members, veterans &amp; family members receiving TRICARE will now be eligible for new care plans https://t.co/h5FvxBXtCf"]["@POTUS Read my full statement on @POTUS decision to declare opioid epidemic a national emergency here: https://t.co/xbVEyumfr4"]["Today is the day! The @SFWV kicks off today w plenty of fun events for everyone. Check out the schedule: https://t.co/cQMvsmvFwl #sfwv2017"]["Good to hear @POTUS say he plans to declare the opioid epidemic a national emergency. It will be an important step in this ongoing fight."]["@BDTonline highlights need for more action in fighting opioid epidemic that’s devastating so many WV communities: https://t.co/r2XIAU0k4a"][".@Register_Herald has more on how Beckley &amp; Oak Hill will soon benefit from new @HeadStartgov funding I announced: https://t.co/qv8cUisWX3"]["Received an update on the happenings at @EasternWVedu including how they're encouraging #entrepreneurship &amp; economic development in #WV https://t.co/SueamMZSXX"]["We owe so much to first responders who answer countless calls for help every day. Here’s one way we can honor them: https://t.co/jzXvV42fCz"]["ICYMI: announced funding to help create bright &amp; happy futures for next generation of WVians. Learn about it here: https://t.co/iQkoKluHCi"]["Last wk, the Senate passed legislation I supported that protects #PurpleHeart medals. Here’s how: https://t.co/YHwTS3RgNX"]["Today on #PurpleHeartDay, please join me in remembering the selfless men &amp; women who have fought hard to keep our nation safe and free."]["Proud to support a bill promoting women’s meaningful inclusion &amp; participation in peacemaking &amp; mediation efforts: https://t.co/rEdzxdw73g"]["Enjoyed meeting the @NASAIVV Fairmont summer interns who were in DC presenting their projects at @NASA HQ. https://t.co/XTckkH09gW"]["Important updates in my weekly newsletter! Check it out here: https://t.co/MTp7SwpJ6K https://t.co/Xw9TCWkeWS"]["Congratulations @Sen_JoeManchin and Gayle! https://t.co/GM0eKsUc0E"]["Great news! This bill includes legislation I supported that encourages #broadband deployment during road construction projects. https://t.co/k6lrTcZpGf"]["Have a minute? Watch my weekly message for a quick update from the Senate: https://t.co/REFSkVFZ89"]["Great news - @POTUS accepted my recommendation &amp; nominated Bill Powell as US Attorney for Northern District of WV https://t.co/NU31kkRgCP"]["Plsed the Senate confirmed Robert Powelson and Neil Chatterjee to the @FERC. Important step in advancing #energy #infrastructure projects."]["Please join me in extending our heartfelt thoughts &amp; prayers to his loved ones &amp; members of WV's 130th Airlift Wing https://t.co/dAGMxxROVz"]["Tech. Sgt. David Board of Barboursville served his country honorably &amp; with courage, making the ultimate sacrifice to defend our freedoms"]["Announced new funding to support cancer prevention programs in #WV. Details here: https://t.co/Q5mgrfAFH3"]["Enjoyed meeting the @ALAGirlsNation &amp; @ALBoysNation members recently who are representing #WV as Senators this year. Keep up the hard work! https://t.co/OyCFHSrgq2"]["I agree w opioid commission that @POTUS should declare opioid crisis a nat’l emergency &amp; increase resources: https://t.co/Kf8qpefZnQ"]["Today we passed Jessie’s Law, an important and meaningful step to honor the life of Jessie Grubb. MORE: https://t.co/XoZFjF9d9o"]["First responders put so much on the line to serve communities. More on my efforts to honor these brave men &amp; women: https://t.co/dFKcGZjJEK"]["Happy to hear @USAGSessions is continuing his push to fight the opioid epidemic in WV w/ a new DOJ initiative. MORE: https://t.co/4XoQuRlL83"]["NEWS: Lincoln County to receive expanded cellular service. DETAILS here: https://t.co/OIgbMqH7uO"]["Proud to cast my vote in support of our next @FBI Director Christopher Wray. Confident he'll do a great job. MORE: https://t.co/9LD7w0xs5F"]["Announced more funding to support 500 wrkers assisting w recovery in 18 counties impacted by the '16 #wvflood. INFO: https://t.co/a3WeVHSi1S"]["Supported a bill to help protect victims of sex trafficking &amp; fight back against criminals taking advantage of them: https://t.co/hkeAeXVAM0"]["Good to see @POTUS’ opioid commission’s interim report endorses several solutions to drug epidemic I’ve pushed. MORE https://t.co/m4M6BDSwGd"]["WVians always take care of one another &amp; this was clear during my visit to Marion County today following the flood. https://t.co/hvoC1x05CD"]["Proud of WVian Annelies Stephans for her involvement w/ @JDRF as a Children’s Congress Delegate. #JDRFCC17 https://t.co/UAnAipSisn"]["My weekly newsletter is hitting inboxes now. Check it out here &amp; share with a friend! https://t.co/xXUlhu77me https://t.co/h9KVBWZB2G"]["Latest on the road closures can be viewed here: https://t.co/RaWAxp1MoR via @WVDOT &amp; @WVMetroNews"]["Thinking of those impacted by the flooding in #WV. My staff &amp; I have been in touch w/ state officials &amp; will keep you updated. Stay safe."][".@NewsandSentinel has more on how funding I helped secure will benefit @ParkersburgCity. Read it here: https://t.co/2dVD1llvFY"]["Met w/ @FarmCreditVAs members about the importance of passing a strong farm bill that meets needs of ag producers https://t.co/hS13QW29W5"]["My statement on this morning's health care vote: https://t.co/hBOmeVKvQ3"]["Supported Appropriations bills to improve infrastructure, fight the opioid epidemic &amp; promote economic development: https://t.co/EjAn6W6XLv"]["Tonight, the Senate sent a clear message that the U.S. won’t stand for threats to our nat’l security. MORE: https://t.co/wdKfATEDOc"]["More details: https://t.co/W2PMcpfl7m"]["I urged @SecretaryCarson to make this a priority because the CDBG program is making a huge impact to help West Virginians rebuild."]["NEWS: Just learned that because of my efforts WV will receive another $42M for flood relief."]["Also chaired @EPWGOP hearing this week on clean energy technology. Many thanks to @WestVirginiaU’s Brian Anderson for testifying. https://t.co/f2yHisPQbj"]["ICYMI: Advocated for a number of #WV priorities during Approps hearing I chaired today w/ @stevenmnuchin1. MORE: https://t.co/3Jv8NaL3lz"]["Skyping w/ #WV4H biz camp students this afternoon &amp; chatting about the many economic opportunities #WV has to offer. https://t.co/FyTw071aYR"]["Excited Senate VA Cmte unanimously approved a bill I am sponsoring to improve ed benefits for our veterans. More: https://t.co/8oUDd2xksA"]["Announced grants to ensure safe &amp; effective transportation of our energy products. Learn more: https://t.co/gA2GzWqyx9"]["My statement on motion to proceed: https://t.co/j7sdmIW79L"]["Proud Appropriations THUD subcmte reported out bill that includes many WV priorities. Now onto full committee: https://t.co/7CbcTqjkMS"]["Hope @BetsyDeVosED will put the needs of WV students above bureaucratic technicalities. Read my letter to her here: https://t.co/vARZP18Q68"]["Talked politics with future West Virginia leader, John Mace. Remember that name! https://t.co/BO5FQ8NxLd"]["Great to meet Kayleigh from Williamstown while she was in D.C. for a journalism &amp; media conference @GeorgeMasonU. https://t.co/akVhxrRviI"]["Repealing, replacing Obamacare is the best solution for West Virginia. Read more in my weekly newsletter: https://t.co/8w9wyrHAE8 https://t.co/uShU2QWKUh"]["By repealing &amp; replacing Obamacare, we can fix problems created by this failed law, put reforms in place that work https://t.co/a4Y8N1eu2k"]["Extended a warm WV welcome to Mark Gracy who is planning to move his company @BullyTools to the northern panhandle. Great decision! https://t.co/aHy8h70fLf"]["Excited to welcome @POTUS to the Mountain State Monday. Will join him at the Boy Scout Jamboree to celebrate our country’s future leaders."]["Good to hear how @NSF is leading the way in research, innovation and education in the science &amp; engineering fields. This is the future! https://t.co/dq6UHEdG3d"]["I remain committed to repealing Obamacare &amp; replacing it w a system that provides access to affordable care for WV https://t.co/a4Y8N1eu2k"]["Teamed up w/ my colleagues to recognize Nat’l Youth Sports Wk to encourage kids to lead active &amp; health lifestyles: https://t.co/xck5m159DI"]["Looking to the future of coal by working w/ a bipartisan group senators to encourage clean coal technologies. https://t.co/qYxxgRj8H1"]["Time flies! Took our summer interns to lunch in the @uscapitol today to thank them for their hard work. https://t.co/95jldw4MvI"]["So sad to hear the heartbreaking news about my friend @SenJohnMcCain. My prayers are w/ the McCain family and w/ John, a true fighter."]["Trump Administration has been a great partner in helping revitalize coal country. More in my interview w @WVNS59News https://t.co/2vjOMLixvh"]["Just announced additional funding to support four airports in WV. Details here: https://t.co/Ky1JlACCcO"]["Programs like @usnistgov's SURF play an important role in inspiring WV’s youth to pursue careers in #STEM.Proud of these dedicated students! https://t.co/GUIYd1KlfP"]["I’m glad @POTUS agrees that we cannot move to repeal Obamacare without a replacement plan that addresses the needs of West Virginians."]["Working w a bipartisan group on a bill to encourage clean coal technologies. @DominionPostWV has more: https://t.co/3G6N0KfnYa"]["ICYMI: Helped secure funding for terminal &amp; runway repairs at 2 #WV airports. Learn more: https://t.co/3LJDKIaDZu via @WVMetroNews"]["Skyped w/ students in the Energy Express program at Bradshaw Elementary, which keeps kids reading in summer. Great group of young scholars! https://t.co/59KmVRcRyV"]["Read more about a project I’m working on to create a regional ethane storage hub. @wvstatejournal has more: https://t.co/YuHbTyHcw0"]["Thinking of my friend @SenJohnMcCain &amp; wishing him a speedy recovery. Keep Tweeting your progress - we miss you! https://t.co/IqVF0njCzm"]["MORE: I will only vote to proceed to repeal legislation if I am confident there is a replacement plan that addresses my concerns."]["My latest statement on the Senate health care bill &amp; planned vote to repeal Obamacare: https://t.co/yAVIxgptCu"]["Wrking w/ a bipartisan group of sens. on a bill that encourages clean coal technologies. @DominionPostWV has more https://t.co/3G6N0JXMzA"][".@wvlegislature broadband council recently launched their new website. Check it out here: https://t.co/JVF1ciVWz1"]["ICYMI: helped secure funding from @USDOT for @YeagerAirport &amp; @huntingtoncity tri-state airport. Details: https://t.co/qzN6nToEC8"]["More @HHSgov funding headed to #WV community health centers. This is great news! https://t.co/Lak6LY1MGJ via @Register_Herald"]["We’re making progress on connecting #WV, but there is still more work to be done. WATCH for more:  https://t.co/92pZrFq3V4"]["A few important updates: https://t.co/eVERtcWwp3 https://t.co/iOfcU6VKRF"]["Learn about new funding I announced that will provide WVians access to important health services: https://t.co/nyHrgqs9QZ"]["Thinking of Mom today on her birthday. Always so grateful for her love &amp; support. https://t.co/f0ppfRx1an"]["Working w/ my colleagues to create a diverse energy mix, while protecting coal jobs. @WSAZnews has more: https://t.co/U0IO7eqLpv"][".@InterMountainWV has the scoop on how I’m supporting health centers in WV: https://t.co/B1kfYJ5PCg"][".@IntelligencerWV has more on how a bill I intro’d this wk will help us lead the way w/ carbon capture technologies: https://t.co/xbWl95yLLi"]["Passed a bill out of committee that provides resources for servicemen &amp; women, including agritherapy pilot program https://t.co/R35s6QlG3R"]["Chatted w/ Jackson Co. Superintendent Hess this wk about setting our students up for success. Always great to talk about the future of WV! https://t.co/I5TMRmVT1S"]["Proud of Chelsea Carter who continues to share her story and  the good work of Drug Courts at their annual conference this week in DC. https://t.co/pQzfU43U07"]["Recently met Dylan from @CabellMidland who was a National Youth Delegate at #WYSE2017 – great to meet you! https://t.co/bm6k2P9div"]["It was clear during my meeting today w/ @FBI nominee Christopher Wray that he is committed to keeping Americans safe. https://t.co/8iFQWBzIky"]["ICYMI: Spoke on the @SenateFloor about #energyFUTURE &amp; how I’m wrking w others to promote clean coal technologies: https://t.co/1fl3fDyDsF"]["https://t.co/FRopwPuwCm"]["Sat down w/ @FCC nominee Brendan Carr yesterday &amp; stressed the importance of one of my top priorities - closing the #digitaldivide in #WV. https://t.co/h9x5sgkNkU"]["Good editorial by @BDTonline applauding the repeal of #WOTUS – an overly burdensome rule. Read the piece here:  https://t.co/LSsebDeQoI"]["Proud to support the FUTURE Act w @SenatorHeitkamp @SenWhitehouse @SenJohnBarrasso @timkaine @LindseyGrahamSC. MORE: https://t.co/FhFov9wc2x"]["The FUTURE Act is a key component of any strategy to implement an all-of-the-above #energy strategy. #energyFUTURE"]["Carbon capture will allow us to prevent waste emissions &amp; provide a valuable resource as we expand America’s #energy dominance"]["#WV coal provides the nation w/ baseload power and this is the backbone of our industrial economy."]["The FUTURE Act will help us expand oil production, reduce emissions &amp; compete internationally."]["Proud to join other sens to intro the FUTURE Act, which spurs domestic investment in advanced carbon technologies that support coal https://t.co/XWWWxwt00f"]["Joining a bipartisan group of senators to announce a bill to further clean coal technology. WATCH LIVE NOW: https://t.co/OfZFfBoRpg"]["W/O connectivity, bizs can’t thrive. @WVMetroNews has more on my visit to Hardy &amp; Hampshire Co. w @AjitPaiFCC: https://t.co/JvXplOQihp https://t.co/UYDZv2eP0G"]["Up next on @WVMetroNews Talkline w/ @HoppyKercheval. Listen live at 10:20 here: https://t.co/jehbgFfRY8"]["This morning, @SenateCommerce is meeting to examine how we can better combat human trafficking. WATCH LIVE NOW: https://t.co/lQTSY9mjME"]["Read about the trip &amp; project, which could be a real game-changer for our economy and national security ---&gt; https://t.co/VrpviRpX9T (3/3)"]["Thrilled he is so enthusiastic after the events I hosted in WV last week &amp; excited to work together to explore ideas discussed further (2/3)"]["Just spoke w/ @SecretaryPerry about an exciting regional energy infrastructure project I'm championing. (1/3)"]["Glad to have @AjitPaiFCC as a partner as we work together to bridge the #digitaldivide. Enjoyed our visit! MORE: https://t.co/TzAqjztZQr https://t.co/ROMKR1RZeu"]["Good luck to long-time @CharlestonPDWV Chief Brent Webster in your new city gov. position. Thanks for your service! https://t.co/6SpuF2mM3K"][".@WVMetroNews has the details on how I’m working w/ others to establish a regional ethane storage hub. MORE: https://t.co/ypTZNifWCr"]["Had a great discussion w/ @AjitPaiFCC &amp; others about how efforts like my #GOAct &amp; #CapitoConnect can help bridge the #digitaldivide https://t.co/LRmvleGhlP"]["In Hampshire Co touring Capon Springs Resort &amp; learning about its rich history. Improving #broadband here will help tourism thrive even more https://t.co/8ve4jsZPgS"]["Heard from @LstRvrTrdngPost owners about how #broadband is key to revitalization initiatives. https://t.co/0Z9565ZpPT"]["ASC Services in Hardy County is one of the many bizs relocating to Wardensville bc of the #broadband availability in that area. https://t.co/FUm6fhkxgS"]["Great to have Chairman @AjitPaiFCC back in #WV today highlighting the need for #broadband in rural communities. https://t.co/YiFYRCpkP0"]["I’ll be previewing my visit to the Eastern Panhandle w/ Chairman @AjitPaiFCC on @Talkradiowrnr. Listen live at 8:15: https://t.co/CGFaCskwFB"]["Many thanks to @WVONGA for this resolution of support &amp; for joining today's discussion. Great to be working together to make this a reality. https://t.co/EFu7dTePOq"]["From Longview Power to @NETL_DOE &amp; a productive energy infrastructure roundtable, it was wonderful to host @SecretaryPerry in WV. Thank you! https://t.co/CY256CKOJk"]["Productive discussion this AM on what a regional ethane storage &amp; transportation hub would mean for #WV. MORE: https://t.co/VrpviRpX9T https://t.co/zOSM7Tr9IE"]["Brought together @SecretaryPerry &amp; great group to discuss how regional energy storage facility &amp; infrastructure can be a game-changer for WV https://t.co/yEO7pMfdfX"]["Enjoyed having @SecretaryPerry w/ me in Monongalia Co. today to see WV's #energy potential firsthand: https://t.co/kAwyaPohEt https://t.co/tSG0ZWi6Xs"]["Proud of @WestVirginiaU's Experimental Rocketry team for winning 1st place in @Spaceport_Cup. Way to go! #SACup17 https://t.co/OhjwZ1XmY5"]["ICYMI: Announced new @HHSGov funding that ensures our miners have the best medical resources available. Details: https://t.co/Hz93jnjYLG"][".@WVMetroNews has the details on new funding I announced to support local #WV airports: https://t.co/AZTwbn2xed"]["Wishing all West Virginians a happy &amp; safe #IndependenceDay! https://t.co/lh41Pgcq1Z"]["Proud of WV’s 2017 @NYSCdotORG Camp delegates Isabel &amp; Joseph who are the future innovators of our state! #STEM https://t.co/Ugrc9EEVmW"]["Just sent out my weekly e-newsletter! You can read it here: https://t.co/pISvkfQ8Wx https://t.co/0XLfwNjSR3"]["Had a visit from members of @WVMEA and chatted about the importance of music education for #WV’s youth. 🎶🎶 https://t.co/iXaIqwsEz1"]["ICYMI: announced new funding to support our local fire departments in five WV counties. Learn more here: https://t.co/OhInuVACi0"]["Recent @SPACEdotcom article highlights @WestVirginiaU Team MIDAS’s big win at the @NIARASCAL Mars Ice Challenge: https://t.co/Q2TkjL3iwj"]["WV’s airports connect communities &amp; strengthen our economy. Learn about new @USDOT grants announced today: https://t.co/Arlr0QGCI2"]["Appreciative of the hard work Senate pages like Katherine do here at the @uscapitol. Great to meet you! https://t.co/Y2b0hEmrOL"]["Enjoyed hearing about the cutting-edge work #WV women are doing in tech to help transform the state. #womenintech https://t.co/4YA7ZyMTKV"]["Loved meeting future West Virginia Senator and current Jr. Miss Monongalia Kaitlyn Frisk. Enjoy your visit! https://t.co/1tDrYfdwzv"]["Great event yesterday promoting #STEM careers for women – this is the future! Thanks to @girlscouts for putting this together! https://t.co/Qk7gXFPGNL"]["Susan Jack was recognized by @SBAgov for her volunteer efforts after #wvflood. Had the chance to see this firsthand during a recent visit. https://t.co/w3QB6bbKyx"][".@EPA's decision to roll back the flawed #WOTUS rule is the right move &amp; will protect many WV jobs. MORE: https://t.co/qiTc0AZn67"]["Listen in if you can: https://t.co/jehbgFxtmI https://t.co/wOotyABC3Z"]["My concerns will need to be addressed going forward. Full statement w @senrobportman:  https://t.co/wYqfowtc4x 7/7"]["The draft Senate health care bill is not the right fix for West Virginia, and I cannot support it. 6/7"]["As drafted, Senate bill doesn't result in affordable access to health care for many WVians, including those covered on Medicaid expansion4/7"]["At the same time, many WVians benefit from expanded coverage through Medicaid &amp; access to substance abuse treatment. 3/7"]["Obamacare’s steep costs &amp; limited choices have hurt WVians. I have consistently looked for opportunities to improve this broken law. 2/7"]["I came to Washington to make the lives of West Virginians better. 1/7"]["Chairing an Appropriations subcommittee hearing examining @SEC_News &amp; @CFTC budget requests. WATCH live now: https://t.co/65OGzB4T5M"]["Spoke w/ @Your4State about how I’m helping to deliver #broadband to nearly 9,000 #WV residents &amp; employers: https://t.co/sUKoLyEBVC"]["#CapitoConnect Update: made a big announcement last week to help close the #digitaldivide in WV. Watch for more: https://t.co/2E4EY0ZZ9U"][".@WVMetroNews has the rundown on my latest efforts to increase #internet access in #WV. Read the piece here: https://t.co/hMp7mdTKYr"]["Had the chance to thank @JeffersonAwards winner Jim Jarrett for his dedicated service to the community. Thanks for all you do! https://t.co/Vv1xKB8Qhk"]["Take a look at my e-newsletter for some key updates from this week: https://t.co/5QaQioc1hd https://t.co/NoPFsHMKb5"]["Three unserved WV counties will soon have access to #broadband thanks to #CapitoConnect. Find out the details: https://t.co/YedGMdyVJX"]["Neighbors helping one another in times of need is what our West Virginia spirit is all about: https://t.co/UfYZXDJrgs"]["Always good to see @ABU1871 President Barry! Thanks for stopping by the office this week. https://t.co/S9P8WvIjKh"]["Efforts like #wvlegis flood prevention committee are the kinds of steps we need to take to rebuild after #wvflood https://t.co/FydBMewtNb https://t.co/OVFl4dZfSC"]["#CapitoConnect is working! Find out how in my weekly message: https://t.co/a0RrLsVXDM"]["Today marks 1 year since #wvflood. Thousands were impacted, but our WV spirit continues to withstand this tragedy. https://t.co/WDamnTlQ06"]["ICYMI: @POTUS’ commitment to expanding rural #broadband access is the next step in closing the digital divide in WV: https://t.co/5zG7BAXbB8"]["My statement on the Senate health care discussion draft: https://t.co/hlC90OCrSo"]["Just announced I’ll be hosting @ENERGY @SecretaryPerry in WV this summer. Looking forward to his visit! https://t.co/4GrR6XBHeW"]["Big thanks to my staff for cheering me on at the @CWSoftballGame tonight! #CWSG #BeatCancer ⚾️ https://t.co/qtlUV8uDdR"]["Glad @RepEvanJenkins is supporting the #GOAct - #Broadband can lead to so many opportunities &amp; this bill will help connect #WV."]["Looking forward to tonight’s #CWSG where I’ll be playing in honor of my friend &amp; colleague, @maziehirono. Can’t wait to #BeatThePress!"]["Thanks to the WVians who traveled to DC to share their stories on health care reform today. https://t.co/hG0Td1OF3V"]["My #CapitoConnect plan is paying off! Thrilled to announce $3M in funding to expand #broadband in three WV counties https://t.co/UtKJJGRcbF"]["Glad @ChrisCoons is on board w my #GOAct. Let’s work together to bring #broadband to low-income &amp; rural areas https://t.co/yDqBKueTsK"]["Chairing Appropriations hearing examining @FCC budget &amp; highlighting need for expanded rural #broadband. Watch now: https://t.co/xMXHw2gGr5"]["Happy 154th birthday to wild and wonderful West Virginia! #AlmostHeaven #WVDay https://t.co/Al20dW56ew"]["Ravenswood Police continued drug free efforts by uncovering more than $500K of heroin during weekend traffic stop: https://t.co/tPxYXmjGwm"]["A lot of good news to report this week, and my newsletter has all the details. Check it out here: https://t.co/xBgJh0muBZ https://t.co/AXiIODfewP"]["Wishing all of the wonderful West Virginia dads a very #HappyFathersDay!"]["Warm morning for @CAMCFoundation's Run for Your Life race to support cancer awareness &amp; screening. Thanks #festivallcwv! #cwv #almostheaven https://t.co/HtSMa2ovQg"]["Dropped by a meeting w/ @afspnational WV members this wk. Good to hear about their efforts to prevent suicide in WV. https://t.co/5fQDFiwRDV"]["All smiles during my meeting w/ @AGDadvocacy's Dr. Ghareeb this week. Great to see him while he was in D.C.! https://t.co/IjueyeXgXB"]["@JeffBezos West Virginia sadly leads the country in opioid-related deaths. You can save real lives in real time. 2/2"]["@JeffBezos .@jeffbezos, here's an idea: invest in rural Appalachian towns impacted by opioid crisis. @amazon has role in tech &amp; treatment. 1/2"]["Have a minute? Watch my weekly message for a quick update: https://t.co/pRVhFayxX8"]["Took my summer interns to lunch in the @uscapitol yesterday to thank them for their hard work this summer. Great group! https://t.co/7YXe7X7Y7q"]["Everyone deserves a place to call home. Heard from a group of home builders about the challenges they face &amp; discussed solutions. https://t.co/egBSbsAnuq"]["Yesterday our @CapitolPolice officers showed great heroism. I am so grateful every day for their selfless service &amp; protection. Thank you!"]["We're so lucky to live in a state as beautiful as WV. Today I announced grants that will preserve its natural beauty https://t.co/EAlIKqOD7t"]["I’ve been an advocate for @ARCgov's role in growing WV’s economy. Learn about new grants  to support these efforts: https://t.co/c6Ya9VufCw"]["Learned a thing or two from Raleigh County @NationalHistory competitors who were in town for the national competition this week. https://t.co/z9q3urshYN"]["My heartfelt condolences go out to the family &amp; friends of Rodney Osborne who lost his life in a Boone County mine. https://t.co/j0pNNopJnO"]["The @USArmy is celebrating 242 years of service today. Happy birthday, and thank you for all that you do for our nation!"]["Thinking of my colleagues, their staffers &amp; @CapitolPolice members who were at @thehillbaseball practice this AM. Praying for their safety."]["#IGoPurpleFor my parents. Join me in raising awareness during #AlzheimersAwarenessMonth. #EndAlz 💜 https://t.co/DyfDsVvqLu"]["New grant for @WestVirginiaU to help researchers find ways to utilize fossil energy more innovatively &amp; efficiently: https://t.co/Is5Sjj4jDC"]["It was great to be back at @WVGirlsState yesterday w/ many accomplished young women. Can’t wait to see what the future holds for this group! https://t.co/MWzZ7TxPXy"]["ICYMI: Funding headed to @CAMC_HS to support education &amp; training for our nurses that keep WVians healthy. Details: https://t.co/M3zVaYiCGm"]["Excited @RepDougCollins introduced companion bill to my GO Act. Look fwd to advancing important broadband reforms. https://t.co/au5hG5edzQ"]["Also teamed up with @Sen_JoeManchin on another bill related to Appalachian energy hub. More on that measure here --&gt; https://t.co/a6mMw6naRe"]["An Appalachian energy hub would be a game-changer for WV. More on a new bill I intro'd today to make this a reality. https://t.co/IBdAXKsEaL"]["Spoke about the importance of leadership to an impressive group of young men at @wvboysstate this morning. https://t.co/vBqBwK52Xn"]["Best part of my day is hearing from WVians. Thanks to all who came out for #WVWednesday last week! https://t.co/8sbpwvMT7o"][".@WVStateU's Upward Bound program has helped so many in WV. We can’t afford to lose this program, @BetsyDeVosED. https://t.co/ElmQZ2ewYb"]["Have a moment? Read my newsletter for a quick update &amp; share w/ a friend. https://t.co/AwLnAaISb4 https://t.co/FYx7sWBIey"]["Sad to hear of Circuit Judge Yoder's passing. He was a good friend &amp; fun to be around. https://t.co/XA2lZ4jkG8"]["Ran into some WVians in the hallway on Thursday and had the chance to show them around the office. Great to meet you! https://t.co/fMFyVrROCQ"]["Always enjoy talking w/ @Talkradiowrnr's Rob Mario &amp; Dave Welch. Catch my interview from earlier this week here: https://t.co/4rUVOy1GR9"]["Great to meet Tyrone Brandyburg – the newest addition to the @HarpersFerryNPS team. Looking forward to working together! https://t.co/a4xE3wcrQD"]["My weekly video message is back! Stay up to date with my work in the Senate. WATCH: https://t.co/SRmoZNmZsg"]["Thrilled @IBM “New Collar” partnership will include WV colleges. Great opportunity for students to acquire IT skills https://t.co/RfnTjyqOTM"]["Supporting a new bill to help WVians recover from natural disasters like the #wvflood. More details here: https://t.co/i1s6J7DjWa"]["I’ll be on @Talkradiowrnr this AM to discuss new @AmeriCorps funding, #ParisAgreement &amp; more. Listen @ 9 if you can! https://t.co/CGFaCskwFB"]["Met w/ @matricinnovates's Steve Hedrick re: benefits of Appalachian ethane storage hub. Working to make it happen. https://t.co/sYqBYcsCsA https://t.co/RjzkVahK13"]["My new bill w/ @SenGaryPeters aims to help stem the ⬆️ rate of diabetes &amp; ⬇️ the cost of treatment: https://t.co/pm6u6DuAnl"]["Thanks to @WV_CAN's leadership, they have helped more than 3K WV kids affected by abuse. https://t.co/oqSaJQjmCv"]["My statement regarding @EPA's intent to delay implementation of the 2015 ozone standards: https://t.co/VMouwmfaKW"]["Had some tough funding questions for @BetsyDeVosED today. I will continue working to protect #WV priorities. https://t.co/4MWV5NPg9Y"]["Helped pass a bill that protects our veterans’ interests &amp; those who assist them. More on the #VAaccountability Act: https://t.co/WUx84lRZsQ"][".@BetsyDeVosED: ending the Upward Bound program at @WVStateU is unacceptable. Don’t throw away this important relationship. https://t.co/Aa58Zfkcx7"]["Congratulated the #WV @BorenAwards recipients today while they were in D.C. Keep up the hard work! https://t.co/jKxnvdVcBN"]["On the anniversary of #DDay, join me in honoring the brave heroes that fought to preserve freedom on the beaches of Normandy. https://t.co/nKuCxHt62F"]["Strengthening our next generation is an investment worth making. Learn about new @HeadStartgov funding headed to WV: https://t.co/pcaHdh0yRD"][".@Register_Herald has the scoop on funding I announced to support continued @AmeriCorps efforts that help WVians: https://t.co/nEi2slcBhW"]["The new jet service in CRW came in handy this rainy morning on my trip up to DC. Thanks @YeagerAirport for providing safe transportation! ✈️ https://t.co/9zHKyum26P"]["ICYMI: chaired a @EPWGOP hearing &amp; discussed bills intended to put an end to reg uncertainty. @WVMetroNews has more: https://t.co/lFWET4R9rZ"]["Good to see @SBAgov's #WV #Smallbiz Person of the Year Matt Knott from @RiverRiders. Hoping to make it back for another bike ride! https://t.co/BguphScKnk"]["ICYMI: Glad the @WhiteHouse listened to my request to reverse cuts to important anti-drug programs: https://t.co/cDFsRG0i1v via @politico"]["Beautiful evening at the Haddad Riverfront Park yesterday to kick off the @sowv Summer Games. Good luck to all athletes competing! https://t.co/mt6wzgJe3t"][".@WVMetroNews has the details on @WVNationalGuard's new entrance for McLaughlin Air Nat’l Guard Base I supported: https://t.co/UDgWirH0Li https://t.co/h2nGg0xmAd"]["What a game! Congrats @WVUBaseball on today's victory over @TerpsBaseball in the 1st @NCAACWS game. #HailWV #RoadToOmaha https://t.co/9XE6RZXnP7"]["Joined students from the Ambassador Christian Academy in Elkins on the Senate steps last week. Great to meet you! https://t.co/F9CRMRAP9B"]["My staff recently joined #HomesForWV &amp; new homeowners for a dedication at Hope Village. Grateful to all who made this a reality. https://t.co/U2NQBR00vi"]["Offered some words of advice to Buckhannon-Upshur High graduates last week. @InterMountainWV has more: https://t.co/LKZWyTkNqk https://t.co/bKyOIQjmVf"]["Who’s watching @WVUBaseball take on @TerpsBaseball at 2PM in the @NCAACWS Regional’s? The #RoadtoOmaha starts today! #HailWV"]["Chatting w/ @HoppyKercheval this AM about @POTUS’ decision to withdraw from the #ParisAgreement. Listen at 10:06: https://t.co/jehbgFxtmI"]["WVian Chelsea Carter’s inspiring story shows what we can accomplish in fighting the drug epidemic. https://t.co/dei7L9NlOs"]["My full statement on @POTUS’ #ParisAgreement decision: https://t.co/C6tiogh7Sw"]["Today’s actions further demonstrate @POTUS is standing w/ #WV workers &amp; businesses to keep jobs in our state."][".@POTUS' decision to withdraw the U.S. from the #ParisAgreement is the right decision for the economy &amp; #WV."]["Glad to announce that #WV has been awarded funding to support various @AmeriCorps efforts. Find out more: https://t.co/7CZqup3c7O"]["Just announced new grants to help strengthen communities &amp; create a jobs-friendly environment in #WV. Details here: https://t.co/xXHoaccdTA"]["Maintaining safe communities is essential. Learn about new funding announced for WV’s firefighters &amp; 1st responders: https://t.co/efAi8jKBoF"]["Jan Vineyard was a good friend, a hard worker &amp; loved WV. Thoughts &amp; prayers to Gary, Craig &amp; Jan’s entire family. https://t.co/GRJpGv2hO4"]["Next up I’ll be on @WVMetroNews talking w/ @HoppyKercheval about health care reform. Listen live at 10:06AM: https://t.co/jehbgFxtmI"]["I’ll be on @WVPanhandleLive at 9:30 this morning. Tune in if you can! https://t.co/GlkzSjubPN"]["Wishing all West Virginians a happy and safe #MemorialDay https://t.co/sGVCn6s77J"]["Spoke w/ @WVNS59News to discuss my efforts to convince administration to reverse decision on cutting drug programs:  https://t.co/grz5FP7pvU"]["Find out this week’s scoop in my newsletter: https://t.co/JtZZWBlL8c https://t.co/Vnrx32YFKH"]["That’s a wrap! Congratulations to the grads at @pendletoncomshs. Wishing you a bright future! 🎓 https://t.co/F2dptxNggK"]["Spoke to @WVVA about my efforts to curb the drug epidemic in WV. Watch for more: https://t.co/k4PZMhQwjr"]["Best of luck to Buckhannon-Upshur High School’s class of 2017! https://t.co/Sdk0p0W1Ow"]["Good to be home today to participate in @WVNationalGuard's ribbon cutting for the new entrance to the Joint Forces Headquarters. https://t.co/hMYjwWgiSl"]["Before heading out for #MemorialDay weekend, find out what we accomplished this week in the Senate: https://t.co/vosjYyZ7gD"]["Glad a VA Accountability bill I supported is heading to the @SenateFloor. It's time to change @DeptVAffairs' culture https://t.co/HWpz5R0pgD"]["Congratulations again to all WV students attending service academies in the fall. You are America’s future leaders! https://t.co/JsgEVTwRXx"]["I’m proud to support Nat’l #DrugCourtMonth &amp; even prouder of all the #WV graduates on this tremendous accomplishment!"]["Thanks to the work of Mayor McCourt and many others, Baker's Island is back and ready for the Woodchopping Festival! https://t.co/wiOr57Cn2O"]["My staff attended the EcoCar Ride &amp; Drive event @ENERGY today w/ @WVUEcoCAR3 Team. Good luck to @WestVirginiaU tonight in the competition! https://t.co/ZfIy8al0B0"]["Keeping Americans safe is absolutely essential. Find out more about my efforts to counter threats from N. Korea: https://t.co/vcfw5tD8Up"]["HAPPENING NOW: Speaking on the @SenateFloor about combatting drug abuse &amp; a WVian who is on the frontlines. Watch: https://t.co/B78ZDHukws"][".@heralddispatch has the details on my efforts w @Sen_JoeManchin to rename @huntingtoncity's VA for @WoodyWilliams45 https://t.co/dcAtzAa9YR"]["Welcomed a group of WV #veterans in town for the Always Free Honor Flight. Grateful for their service to our country. https://t.co/lccm7Yb4zG"]["Find out more about a game-changing #energy #infrastructure project that has potential to transform WV’s economy: https://t.co/f0eepCsTY6"]["ICYMI: Chaired @EPWGOP hearing on air quality standards. Watch my opening statement here: https://t.co/UkfDC7rVVp"]["Glad @SGottliebFDA is making the opioid epidemic a priority at @US_FDA with new policy steering committee. MORE: https://t.co/P7Aru5tdLA"]["My full statement on @POTUS' 2018 budget proposal: https://t.co/kGOKPxqIZj"]["Chairing @EPWGOP's hearing focused on how @EPA sets &amp; implements standards, including ozone regs. WATCH live at 2:30 https://t.co/IUBFGlFKuO"]["It is essential that we remain fully committed to fighting the drug epidemic. We need to be doing more—not less. https://t.co/HBzSlraML3"]["Having led the charge to convince the administration it should rethink cutting these programs, I’m happy to see @OMBPress reversed course."]["Federal anti-drug programs play an important role in combatting the opioid epidemic. Eliminating them would be unacceptable."]["Thankful for the opportunity to stand w/ #veterans at the much anticipated Greenbrier CBOC opening today. Exciting day for our vets! https://t.co/DnihEJILxg"]["Honored some of #WV’s future leaders yesterday. Congrats to all students heading to a U.S. Service Academy this fall. We are so proud! https://t.co/9ahR7bLTgl"]["More funding is headed to health centers in @huntingtoncity &amp; Baker to help them continue keeping WVians healthy: https://t.co/3h8ibc0aDq"]["Received an update last week on the great work happening at Toyota’s WV Plant located in Buffalo https://t.co/7iuxzXUI3B"]["Honored to receive @OppFinance #CDFI Champ Award. Let’s keep working together to help create jobs and economic opportunity in #rural WV. https://t.co/AdsDMEtIBs"]["From #Infrastructure to flood recovery &amp; helping our most vulnerable, lots to report. Read about it in my newsletter https://t.co/yiLWhG1U7L https://t.co/5AOt2rtIKp"]["Caught up with @wtaptelevision to talk about my effort to help infants recovering from withdrawal. Here's the report https://t.co/of4TgvwsDU"]["Always great hearing about WVians making a difference. Natalie Spaid stopped by this wk to discuss how her non-profit benefits #veterans. https://t.co/eMx54TScEe"]["Good editorial by @Register_Herald this week about my efforts to protect funding for anti-drug programs: https://t.co/W6wHGLBdqQ"]["Met w/ #WV Members of @NATA1950 this wk to discuss a bill I’m supporting to help our student athletes, teams &amp; trainers. https://t.co/u72V8aedM3"]["Pausing to remember and honor fallen WV miner Luches Rossner. My thoughts go out to his family and friends during this difficult time."]["Had the opportunity to thank @AppServProject for their volunteer efforts in Greenbrier County following #wvflood. https://t.co/TVLYIweqhj"]["Happy to announce Bluestone Health Assoc in Princeton is getting more than $2.3M to continue delivering care --&gt; https://t.co/Kzx5iuXVmz"]["Trying to rename the Huntington VA after West Virginia’s very own @WoodyWilliams45. Learn more: https://t.co/MKRp6JtfFi https://t.co/P1qEr42X0W"]["Met up w/ Ruffner Elementary students today on the Senate steps. Have a great field trip! https://t.co/57v1XLJWQY"]["WVians rely on roads &amp; bridges to access hard-to-reach places and transport goods across the nation. #TimetoBuild https://t.co/5RTE9AUUXv"]["ICYMI: Learn about my efforts to help provide care like @LilysPlaceWV for babies born addicted to opioids: https://t.co/3acO6gBuLe"]["My staff was all smiles at last week’s Mother’s Day celebration at the Hansford Senior Center! https://t.co/dzYejchPfu"]["I’m working to expand access to substance abuse treatment for Medicaid beneficiaries in WV &amp; across America. MORE: https://t.co/SUu8o1ZxPs"]["Improving our #infrastructure can bring new jobs &amp; opportunities to #WV. #TimeToBuild"]["Proud to be a Congressional co-chair for #InfrastructureWeek. This is an important issue to #WV &amp; has the power to transform America."]["Had a blast running in the @ACLINews #CapChallenge w/ my staff. Great showing by Team Capito! https://t.co/lhN2OIrh5I"]["Great meeting w @NASCAR’s @KyleBusch to hear how he &amp; @SamanthaBusch are helping couples through IVF &amp; their work with children and families https://t.co/WC2WNPwwzN"]["Proud to support our law enforcement officers by co-sponsoring the Back the Blue Act today. Learn more: https://t.co/c0WQfDiiFg"]["An ethane storage hub in Appalachia would be a vital #infrastructure project &amp; enhance our energy potential. MORE: https://t.co/AZWfXMKlCf"]["Just announced new funding to support health care services in northern #WV. MORE: https://t.co/4I8a2YpNst"]["During #PoliceWeek, we remember First Sgt. Joe Portaro who died during a fitness run at the WV Police Academy in 2016 after 17yrs of service"]["Good conversation yesterday w/ former U.S. Attorney @IhlenfeldWV &amp; David Grubb regarding substance abuse education &amp; treatment resources. https://t.co/0l6xJ6Zh4g"]["Learn about funding headed to @WestVirginiaU to help improve sustainable agriculture &amp; help WV communities thrive https://t.co/IXmW275haZ"]["Wishing my grandson Charlie a very happy birthday today! 🎉🎈 https://t.co/uLfB91Ell5"]["ICYMI: Announced additional funding to assist w/ #wvflood recovery efforts. Learn more here: https://t.co/GMMkjkWAEf"]["Chatted with Dave Bassage of #WV Professional River Outfitters last week about preserving our national monuments. https://t.co/vnNTuFmRTV"]["ICYMI: Urging @POTUS to reconsider funding cuts to ONDCP, an essential resource to end drug epidemic https://t.co/55MOosdNf6 via @BDTonline"]["Chatted about the importance of volunteer work w/ this year’s @PruSpirit top youth volunteers in #WV. Congrats &amp; keep up the good work! https://t.co/Le4r8zyXqS"]["We need everyone working together to end the drug epidemic. https://t.co/lsqOtPOV6I"]["Mom before she was the best Mom ever! Miss her. Happy #MothersDay to all the mothers. https://t.co/BhE3P93TBK"]["Signed, sealed, and delivered – the weekly newsletter is out! Read it here: https://t.co/YRKLlGojuP https://t.co/IivCy9HK2N"]["Wishing all the wonderful, hard-working mothers a Happy Mother’s Day today! #HappyMothersDay"]["#HIDTA designations provide resources to fight the drug epidemic. Learn about my new efforts to help Wood County https://t.co/DpPaydcv9Z"][".@wvstatejournal has the details on my new bill to utilize our #energy resources &amp; improve #infrastructure: https://t.co/2Cjel8jPrM"]["I stand ready to work w our state universities to spur economic development. Glad my staff joined @marshallu to discuss this important issue https://t.co/tU4Pd2SLMs"]["Intro’d a bill w/ @SenatorHeitkamp to protect American mothers. Learn about our efforts here: https://t.co/NKRrSzeIb4"]["Registered nurses make up more than 3M of health care professionals. Proud to support nurses by intro'ing the Nat’l Nurse Act. #NursesWeek"]["Met the team at Cenergy in Milton, WV &amp; took a closer look at how this oil &amp; gas service biz is helping grow WV’s economy. https://t.co/gukmvGcLmq"]["Catch up on the latest in the Senate w/ my weekly video message. Check it out here: https://t.co/KAv9M9RD8j"]["Sat down w/ the leadership team of @FiscalService located in WV’s own @ParkersburgCity. Thanks for visiting this wk! https://t.co/yHd6fok5B5"]["Securing permanent health care for miners was only half the battle, now we must work to secure pensions https://t.co/Kn0o9R30wm"]["ICYMI: Learn more about my new proposal to maximize #WV’s domestic #energy &amp; #manufacturing potential: https://t.co/sYqBYcsCsA"]