["We cannot grow desensitized. President Trump’s racist remarks – unworthy of the office he holds – demand outrage and outcry from Americans everywhere."]["Trump’s racist remarks threaten our national security and diminish our standing around the world as a beacon of tolerance. He owes every single American an apology."]["Connecticut and America are stronger because of hardworking immigrants – from all countries – who call this country home. We see Trump’s remarks for what they are: a brazen betrayal of American values."]["President Trump’s remarks smack of blatant racism – odious and insidious racism masquerading poorly as immigration policy. He does not speak for me as an American."]["#HumanTraffickingAwarenessDay reminds us of our shared obligation to deliver accountability for perpetrators of trafficking – and justice for victims and survivors. Inaction in the face of these heinous crimes is intolerable."]["As long as the government fails to disclose data that could lead to the prosecution of human traffickers, it will remain a silent partner in this unconscionable scourge. Our bill will bring much-needed transparency and accountability."]["Proud to introduce the Visa Transparency Anti-Trafficking Act w/ @SenTedCruz, @RepLoisFrankel &amp; @RepTedDeutch. This bipartisan bill will strengthen reporting - helping authorities end visa exploitation &amp; combat horrific #humantrafficking."]["Abusive employers lure foreign workers to the United States with false promises of jobs - only to coerce them into the sex trade and domestic servitude. Reporting gaps in temporary worker visa programs help traffickers get away with it. Today we say: No more."]["If the President has nothing to hide, he should have no reluctance to answer questions about collusion between his campaign and Russian interference, and obstruction of justice."]["The US v. Nixon case established the principle that the President has a duty to comply with subpoenas for documents or other evidence. In line with that precedent, four recent Presidents have provided interviews or grand jury testimony. Trump is no different."]["Pres. Trump’s statement about potentially avoiding a Special Counsel interview seems to disregard both fact and law. https://t.co/s1BC5W6Nkx"]["A federal judge has struck down Trump’s #DACA order as unconstitutional, but a #DreamAct is no less necessary. Congress should swiftly pass clean legislation to protect these young people."]["We must redouble our determination to protect 800,000 #Dreamers from draconian mass deportation - a continuing threat as long as Pres. Trump refuses to reverse his cruel, unconscionable policies."]["Once again, the courts have been a bulwark for basic rights and the rule of law - but this #DACA reprieve is no final remedy. https://t.co/QDB3JWRXjU"]["Time is now to declare that we will not politicize the pursuit of justice. Defending the rule of law in the face of baseless, biased attacks must be a bipartisan goal."]["The Senate should leave no question that the Special Counsel will be protected from interference or firing. My bipartisan legislation would do just that, and we should pass it now."]["Hopeful that the Judiciary Committee investigation’s pace will intensify, and that we will use our powers to investigate effectively and comprehensively."]["The Special Counsel and his team will not be distracted. Our Committee investigations should be just as focused on uncovering the facts about Russian meddling, Trump campaign collusion, and possible obstruction of justice."]["@SenWhitehouse Efforts to distract and deflect, including attacks on law enforcement and FBI, are divisive and dangerous – threatening to demean credibility of the investigation before it reaches a potentially incriminating conclusion."]["Joined @SenWhitehouse on the Senate Floor because like so many Americans, we are fed up with dangerous distractions and deflections from the investigation of Russian election meddling and Trump campaign collusion. https://t.co/JnWsIXnajo"]["Glad to have @SenatorCollins with us in the bipartisan fight to reinstate #NetNeutrality and defend our free, open internet – a cause that should unite us all. https://t.co/OagHueGgcs"]["Disclosing this transcript will prevent its use as a dangerous distraction from the critical work our Committee should be focusing on. Now more truth must be told about Russia's attack on our democracy and Trump campaign support of it."]["Releasing Glenn Simpson's interview w/ Judiciary Committee advances the American people’s right and need to know the full truth. I applaud @SenFeinstein’s leadership in using her proper authority as Ranking Member to serve this public interest."]["With bipartisan momentum building, now is the time to pass #SESTA and hold enablers of sex trafficking accountable. We owe it to survivors and victims who have waited far too long for justice. https://t.co/Lj5NLWC2rp"]["#SESTA is our path to holding sex trafficking enablers accountable – not inadequate House bill that keeps courthouse doors shut to survivors."]["As CT Attorney General, I saw firsthand how challenging it was for law enforcement to develop cases against sex traffickers. #SESTA would bring real reform that puts victims and survivors first."]["Right now, websites that facilitate trafficking are unconscionably and intolerably immune from legal action by survivors. That’s unacceptable in America. https://t.co/jSBvMKbRvf"][".@SenRobPortman and I believe human trafficking victims deserve their day in court. I’m grateful more than 60 of our colleagues agree and have become cosponsors on much-needed #SESTA. https://t.co/gKIuaLcYWF"]["Grateful to everyone at @AccessHealthCT for helping families across #Connecticut make the most of #OpenEnrollment. We are a stronger, healthier state because of your invaluable work. https://t.co/6LNaZm0IoJ"]["Now is the time for Congress to work in a bipartisan way to bolster our healthcare system and make this year’s enrollment even more successful than the last."]["Heartened to see 114,134 #CT residents sign up for healthcare during last year’s #OpenEnrollment – despite the Trump Administration's ceaseless efforts to sabotage the #ACA."]["Proud to stand with @SenMarkey and countless grassroots activists in this incredibly important fight. I will resist this all-out assault on #NetNeutrality at every turn. https://t.co/nW9geux6nD"][".@SenMarkey’s #NetNeutrality resolution means Senate Republicans must choose between siding with constituents or big telecom companies. No more hiding."]["It takes 30 Senators to force a vote restoring the #NetNeutrality protections consumers, innovators, and small businesses need to thrive. Thanks to the efforts of so many, we have 40 cosponsors!"]["Less than a month ago – despite massive public outcry – @AjitPaiFCC recklessly repealed the #NetNeutrality rules underpinning our free and open internet. But this battle is nowhere near over."]["@SenWhitehouse There is simply no reason to keep Fusion GPS CEO’s testimony hidden. @SenWhitehouse and I call on Chairman Grassley to let Americans see the transcripts of our Committee’s interview with Glenn Simpson."]["We didn’t become the greatest nation on earth by targeting people and communities that have strengthened us for years. Americans – and history – will see Trump’s action for the cruel, cowardly betrayal that it is."]["An unconscionably cruel decision. By ending #TPS for Salvadorans, Trump Admin abdicates America’s role as safe harbor for those fleeing danger and death. https://t.co/4ftDNLxwXW"]["Joined @Morning_Joe to discuss latest developments in the Russia investigation and what could come next. Watch here: https://t.co/jLZ3ib2lIP"]["Today's disappointing step seems to deflect from the genuinely urgent and critical topics of our Committee's inquiry: Russian meddling in our democracy, Trump campaign collusion with it, and possible obstruction of justice."]["One point of indisputable fact is that the FBI investigation of Russian election interference – and Trump campaign collaboration with it – was triggered by information completely independent from the dossier, Christopher Steele, or Fusion GPS."]["These vaguely stated, secret allegations seem designed more to distract from the investigation's priorities, and even discredit the FBI and other law enforcement."]["Sadly, the first major action taken by the Republican majority on @SenJudiciary seems to be aimed at someone who reported wrongdoing, rather than committed it - and was taken without any bipartisan cooperation or consultation. https://t.co/J8eKaa9Ajg"]["Thanks for taking the time to have this important discussion. I’ll continue to press for full #CHIP and CHC funding reauthorization that puts patients – especially kids – first. https://t.co/Y1n16JECPS"]["Visited #Meriden Community Health Center to hear from @CHCConnecticut staff about the immense impact of Congress’s abject failure to pass long-term #CHIP and CHC funding. https://t.co/A7LAoIcbSP"]["Atrocious and appalling. Why would Trump’s DOJ want the right to expose a teen’s private medical information, putting her safety at risk? https://t.co/JMvA1jT1T3"]["No personal henchman (Roy Cohn) for Donald Trump - the US Attorney General works for the American people. Republican colleagues must join our outcry against Trump’s threats to fire AG or Special Counsel after latest explosive obstruction evidence."]["Threat of AG Sessions firing as means to shut down Mueller. Republican colleagues must sound the alarm and support bipartisan legislation protecting Special Counsel."]["Explosive evidence of obstruction -  and imminent danger to Special Counsel. White House Staff need to testify before grand jury. https://t.co/8ekaT2Ev6M"]["This penalty shows why we need a Passenger Bill of Rights, as I've advocated, to hold airlines accountable for blatant abuse."]["Glad Southwest has accepted this penalty and agreed to cooperate in efforts to address airline collusion. All airlines must be held accountable for anti-competitive practices, and DOT and Congress must reaffirm commitment to protecting consumers. https://t.co/JeE9tRWeXC"]["It’s long past time to match the resilience and resolve of Puerto Rico’s people with a bipartisan recovery effort that puts our fellow Americans first. https://t.co/lekbORSTge"]["More than repair and rebuilding, Puerto Rico and USVI need full recovery with vision for the future – a Marshall Plan like what I’ve introduced w/ @SenSanders and others. https://t.co/MkIeuw0VrP"]["Congress must address Puerto Rico’s needs – with adequate Supplemental relief package and reforms of discriminatory tax/healthcare codes."]["Relief workers in Puerto Rico are making progress, but Washington has not matched their valiant efforts. Lack of federal commitment is shameful and disgraceful."]["We walked a San Juan neighborhood that was dark because of a lack of electricity, with generators providing the only power. 100+ days after #HurricaneMaria, this is simply unconscionable. https://t.co/GmBYtRavlp"]["Fellow Americans in Puerto Rico – friends and family to many in CT – have been denied the basic help that this great nation owes each one of its citizens. They are furious and so am I. https://t.co/hIz7jofgFq"]["Spoke on the Senate Floor about my latest visit to Puerto Rico w/ @ChrisMurphyCT – a heartbreaking, gut-wrenching experience that laid bare the Administration’s shamefully inadequate response. https://t.co/qFrwjTEBsh"]["Regretfully and outrageously, Pres. Trump seems again to be subverting legitimate investigations into his own potential criminal wrongdoing, including collusion with Russian election interference and obstruction of justice."]["Appointment of Geoffrey Berman, especially w/o Congressional approval, is unprecedented and inexcusable - raising serious questions about the integrity of this highly esteemed office and our system of checks and balances."]["Trump’s appointment of a prosecutor - after a personal interview - who may well be prosecuting him is absolutely abhorrent to the rule of law. https://t.co/cUoQmCKr27"]["Warming centers are open across Connecticut. @211CT has a list of locations, including operating hours and contact information. https://t.co/LoS7Xnv3l2"]["I hope everyone in CT stays safe during the impending storm. Before it hits, take a moment to review these winter weather safety tips: https://t.co/iDFOZPAdNQ"]["As Congress returns to work, I will make a fact-based case for why recovery aid for our fellow Americans must be a bipartisan priority. We wouldn’t accept this crisis on the mainland, and we can’t accept it here."]["Puerto Rico deserves an immediate Supplemental that will match its needs with robust federal resources – and a long-term Marshall Plan to ensure full recovery. I won't rest until both pass Congress."]["The new tax bill treats Puerto Rico as a foreign country by imposing burdens on manufacturing - only the latest insult, injury, and injustice. I will fight to right this wrong."]["Fellow Americans in Puerto Rico should be angry - I am furious - at shamefully inadequate federal recovery aid. I will fight for a major Supplemental package, beginning today."]["Joined Gov. @ricardorossello in San Juan to demand Congressional action on Puerto Rico relief package – a message I will reiterate forcefully back in DC. With island still in triage, this help cannot wait another day. https://t.co/iw0pGh30UC"]["Still triage- in Puerto Rico's electricity, medical care, water, &amp; other necessities. @ChrisMurphyCT and I are bringing back compelling facts to support expanded rebuilding aid for the island."]["We're witnessing a humanitarian and economic crisis in Puerto Rico, 104 days after Maria. Outrageously, we are failing our fellow Americans. https://t.co/0iV2ScLMcM"]["Hospital UPR suffered $2.5 million in hurricane damage &amp; had to pay for its own generator when FEMA didn't meet urgent needs. Healthcare providers are fleeing to the mainland, putting further stress on delivery of care to Puerto Ricans &amp; doing long term damage to PR's economy. https://t.co/SbioWwBM5k"]["Great meeting with the Foundation for Puerto Rico, a nonprofit investing in economic development, solar energy, &amp; hurricane relief- &amp; engaging with partners on the mainland. Together with #NH4PR, the Foundation brought 90 mattresses to a PR community in need. More must be done."][".@ChrisMurphyCT and I received updates from @USACEHQ on status of rebuilding in Puerto Rico. Numbers are staggering: nearly 4 months after Maria, more than 1/3 of PR is without power, 60% of Puerto Ricans still need temp. roofing, and over half of storm debris needs to be removed https://t.co/ejiT0uXSTf"]["@ChrisMurphyCT With half of Puerto Rico still in the dark, clean drinking water unavailable, and thousands living in temporary shelters, we must redouble our fight for humanitarian relief and long-term rebuilding aid."]["Heading back to Puerto Rico tomorrow with @ChrisMurphyCT to get a firsthand look at recovery efforts and shine a spotlight on the ongoing humanitarian crisis impacting millions of our fellow Americans. https://t.co/vETPJM6Q7D"]["This year, Congress should resolve to break the gun lobby’s deadly grip, honor victims of gun violence with action, and end its complicity in mass murder."]["Heartbreaking. America just ended its deadliest year ever for mass shootings - a devastating and disgusting result of Congressional inaction. https://t.co/DndziluLbf"]["Happy New Year, Connecticut! Wishing you and your loved ones a happy, healthy, and safe 2018."]["Trump denial of Russian collusion rotten at core and doomed to unravel. Expect more serious convictions and indictments early in 2018 as Special Counsel climbs ladder of criminal culpability - and more panicky, preemptive attacks from Republicans. https://t.co/XnF1Jf16jP"]["Americans will rightly see through these insidious attacks as political pandering and preemptive ambush. Republican slandering squanders all pretense of high ground and respect for rule of law."]["Republicans will reap what they sow - and rue their demagogic broadside backstabbing of FBI and American law enforcement. https://t.co/D3DfSpLlwM"]["Sorry, Mr. President, your campaign’s collusion with Russia would be a crime - conspiracy to violate campaign finance laws, or defraud the US, just for starters. Courts of law will decide. https://t.co/siBaWWbmb7"]["Resolve against Chinese must be relentless - more than one-off rhetoric - as they secretly sabotage sanctions meant to stop North Korea nuclear weapons program. Aiding &amp; abetting must be met with real pressure &amp; penalties, not just tweets. https://t.co/9RYo4dYCqP"]["Aging infrastructure strikes again - as power failure causes MetroNorth cancellations and delays. Trump and Congress seeming to say: Not our problem. But it is. https://t.co/GqgSCJUH1Y"]["Saddened to hear of the death of Fran Schneidau - a consummate professional whose passion for asking the right questions served @WCBS880 listeners so well for nearly four decades. She will be sorely missed."]["Russians must be stopped from insidiously attacking our democracy - reversing past inaction. Trump must face this urgent danger. https://t.co/czf54wf07u"]["Merry Christmas to everyone celebrating in Connecticut and around the world! Wishing you a warm, wonderful holiday surrounded by family and friends."]["I call on Republicans to join in rejecting Trump’s reprehensible attack on law enforcement. Unacceptable and un-American. https://t.co/zZSMwFMHMT"]["Connecticut kids covered by #CHIP deserve long-term certainty, not a meager stopgap. I’ll keep pressing for Congress to lift the cloud of uncertainty over funding. https://t.co/mwebU0Gkir"]["As Russian subs rise as severe threat, US must more than match by expanding our own undersea fleet. https://t.co/AIccI7TW4q"]["Meeting with Puerto Rican families in #Hartford, I heard their stories of loss and sacrifice after escaping the ravages of #HurricaneMaria - spending weeks and now the holidays in temporary housing away from loved ones. https://t.co/VmE8hKDoHI"]["Last night’s Continuing Resolution left so many national priorities undone:\n\n❌ Protection for #Dreamers\n❌ Disaster relief for Puerto Rico, the Gulf, and California\n❌ Long-term funding for #CHIP and Community Health Centers\n \nThat's why I voted NO."]["Sen. McConnell said ‘we have plenty of time’ to address DACA. I dare him to look into the eyes of a Dreamer – who goes to sleep every night filled with anxiety about their future – and deliver that cruel message."]["I could not in good conscience support a short-term funding extension that lacks protections for #Dreamers. Congressional Republicans have sentenced 700,000+ young people to another holiday spent wondering if it will be their last in the country they call home."]["I voted against last night's Continuing Resolution. There's no excuse for Congress's abject failure to meet our most basic obligations. Lurching from crisis to near catastrophe is no way to govern and certainly no way to lead."]["Behind these statistics are grieving families and shattered communities, including so many in Connecticut. We need immediate federal funding and resources to curb the #OpioidEpidemic. https://t.co/JgJfxrTP0t"]["Splitting families and spreading fear - Trump’s inhumane immigration initiative is a shameful new low for this administration. Not in America. https://t.co/eu6WEecrRM"]["I’ll keep fighting to ensure that law enforcement and the judicial process move forward without political interference. No one is above the law – not even the President. https://t.co/6B11ufeldK"]["It’s never been more important for us to stand united against any attempts to smear or derail the vital investigations by the Special Counsel and Congress."]["As the investigations deepen, the Senate must demonstrate an unwavering commitment to protecting the Special Counsel and countering interference threats from the White House."]["Firing Mueller would provoke a firestorm and outcry every bit as vehement as the response to the Saturday Night Massacre. It’s our job to make that clear now, before it’s too late. #ProtectMueller https://t.co/wKq0GgoQoD"]["Pres. Trump has promised to stand with law enforcement. Apparently those promises only apply as long as they aren’t investigating him. https://t.co/8DRVouzL7O"]["The Senate must unite against the sycophants slandering the Russia investigation and FBI officials with baseless conspiracies. What’s at stake here is nothing less than the rule of law. https://t.co/y66PEHoKDE"]["We are watching a calculated, concerted, and coordinated effort to discredit the Special Counsel – led by a chorus of Pres. Trump’s defenders. That should worry every American. https://t.co/sBysuCouNx"]["This afternoon, I spoke on the Senate Floor to raise the alarm about the looming Constitutional crisis we face – one that threatens the very foundation of our democracy."]["How many deadly wake-up calls will it take? Railroads need to stop the foot-dragging and implement Positive Train Control without delay – inaction puts lives at risk. https://t.co/k1khfgKMrx"]["Republicans moved heaven and earth to pass tax cuts for the rich, but won’t lift a finger for 9 million kids on #CHIP. Every American should be outraged."]["Instead of looking out for sick children, Republicans are celebrating the passage of tax breaks for the wealthy. Shameful."]["Because of Republican inaction, thousands of CT families could spend the holidays worried about their kids’ healthcare. What a complete disgrace. https://t.co/AEY3G11Djk"]["America promised #Dreamers protection and peace of mind for coming out of the shadows. A great nation keeps its promises. #DreamActNow"]["Congress cannot wait to keep America's promise to 700k+ #Dreamers. The only way to morally pass an extension, the only way we can go home, is by passing the #DreamAct."]["We must keep faith with the dedicated #Dreamers who make this great nation even greater - and that means passing the #DreamActNow. I will vote against any Continuing Resolution that fails to include the #DreamAct. #NoDreamNoDeal"]["Congratulations to Geno and Chris on your 1,000th win - and being teacher and mentor to so many. #Geno1000"]["The #GOPTaxScam is an abomination. Congressional Republicans have revealed their true selves: partisan zealots who care more about political promises to their wealthy donors than the lives of the people they are elected to represent."]["Instead of enabling local governments to balance their books, this bill punishes their taxpayers for investing in their communities."]["Instead of encouraging college student aid, this bill taxes higher education endowments used for scholarship funds and rewards the heirs of the wealthiest with no estate tax."]["Instead of helping American wage-earning workers, this bill benefits real estate tycoons and foreign shareholders."]["Instead of helping families buy their first home, the #GOPTaxScam gives breaks to millionaires purchasing their third mansion."]["A tax bill is a moral statement. This one betrays basic American values. It funds burgeoning tax breaks for the wealthiest one percent – who receive 83 percent of the bill’s benefits – by burdening our children with trillions in debt."]["We are fighting for #Dreamers across America - on the side of fairness, decency, and justice. History is watching. Let’s pass the #DreamActNow! https://t.co/zrUq82PASc"]["It is stunning that anyone would force hardworking young people - who know no home but here - back into the shadows. Now is the time to keep our promise and pass the #DreamAct."]["Republicans in Congress should be focused on relief for 700,000+ #Dreamers, not gift-wrapping a tax break for corporations and wealthy donors. #DreamActNow"]["Imagine spending the holidays racked with fear of deportation. That’s the reality for thousands of #Dreamers right now. We cannot wait any longer to pass the #DreamAct."]["Sabotaging programs vital to America’s most vulnerable, like Social Security and Medicare, is no way to govern. The #GOPTaxScam should be roundly rejected."]["#GOPTaxScam tilts permanent benefits toward the wealthiest and corporations - throwing temporary crumbs to most everyone else. I am fighting a scam that hurts CT middle class and working families. https://t.co/kRlwDEDHvn"]["Tax bills are moral statements. This #GOPTaxScam is an immoral giveaway to the wealthiest, stealing from future generations and depriving us of funds needed for infrastructure investment. https://t.co/iDFYzEdhzz"]["Congress has moral obligation to insist on PTC implementation by 2018 deadline. We are failing Americans – and putting lives at risk – if we do not hold railroads accountable. https://t.co/22MCgxx7R3"]["Hundreds have died in train accidents since @NTSB first recommended Positive Train Control in 1970. This lifesaving technology must be fully implemented by the 2018 statutory deadline. https://t.co/W8LG1Sz0EB"]["Wildly excessive speed was a key factor in the Amtrak tragedy. @NTSB must finish derailment investigation right away. https://t.co/Wuz5yuCAzu"]["No longer can railroads irresponsibly put profits ahead of passenger safety. Positive Train Control needed now – before more lives are lost."]["Outrageous. Why was Amtrak train traveling at nearly TRIPLE the speed limit before fatal derailment? Positive Train Control might have prevented this disaster and saved lives. https://t.co/3D6H24j5M2"]["Too many lives lost while railroads failed to install Positive Train Control. Implementation is absolutely essential by 2018 deadline."]["Unconscionable delays in implementing Positive Train Control now a potential factor in Amtrak tragedy. We cannot afford more delays sought by railroads."]["Americans are right to wonder why Trump’s lawyers seem intent on discrediting Mueller investigation. Congress must act against urgent threat of interference from White House."]["Transition emails are government property – nothing untoward about Special Counsel’s review. The only unusual behavior here is the Trump legal team’s hostile response. https://t.co/TlN1pOdEeR"]["NTSB is on scene investigating derailment. Facts needed now – not months or years as investigations often take."]["After disaster in Washington State, FRA must aggressively demand accountability and full PTC installation by 2018 deadline. Inaction puts American lives at risk."]["NTSB first recommended Positive Train Control nearly 50 years ago. This proven technology can save lives and prevent injuries."]["Technology like Positive Train Control must be implemented immediately to prevent trains from speeding and flying off rails. Statutory deadline is 2018 – no excuses."]["Today's Amtrak accident demands a swift, thorough @NTSB investigation - and reminds us of the urgent need to redouble our commitment to infrastructure investment."]["My heart goes out to the victims, loved ones, and all impacted by today's Amtrak tragedy in Washington State. Grateful for the quick action of first responders on the scene."]["Matthew Petersen should never have been nominated. Time for Trump to stop insulting the public with blatantly unqualified judicial nominees. https://t.co/HU5xgBkCX8"]["Our fellow Americans cannot be a national afterthought. More and better relief urgently needed to restore power in Puerto Rico – normalcy is not too much to ask. https://t.co/nTZkEJoN3h"]["Censorship of CDC is futile and fatal - fighting disease means facing the truth, not denying it. Trump gag orders must be undone. https://t.co/nZAlEbvTfr"]["Need your voices now against this tax scam! Be loud. Republicans will rue the day they passed monstrous tax breaks for donors and mountains of debt for America."]["Like a dead fish - the longer this #GOPTaxScam sits, the worse it stinks. No wonder Republicans are rushing to ram it through before the country reads it."]["Still a massive bait-and-switch, this #GOPTaxScam skewers the middle class and enriches the wealthy and big corporations - creating mountains of debt for our children. I'm fighting it and so should you."]["A civilized society has no place for the maiming and torturing of animals. Proud to have partnered w/ @SenToomey on the #PACTAct, which just passed the Senate and would be the first ever general federal anti-animal cruelty statute. Let’s get this done. https://t.co/mie4eSzB3l"]["With @CHCConnecticut at @AccessHealthCT in #NewBritain to discuss upcoming #OpenEnrollment deadline. Sign up for coverage before Dec. 22 at https://t.co/ZTuCXlHmzd https://t.co/jU0YcK8XgT"]["At @CTChildrens w/ @ChrisMurphyCT and law enforcement announcing annual #gunbuyback hosted by @CRTCT – a safe, responsible way to get rid of unwanted firearms. https://t.co/MnyNlPPwWj"]["It’s not too late for Republicans to ditch this bait-and-switch betrayal and embrace bipartisan reform that won't threaten Medicare and Social Security - but it won't happen without you. Keep speaking out!"]["Reminder: The “party of fiscal responsibility” would burden our children and grandchildren with a mountain of debt to finance tax cuts for the rich. #GOPTaxScam"]["Republicans want to stuff the #GOPTaxScam with permanent corporate favors at working families’ expense. If only they cared this much about re-upping #CHIP health funds for 9 million kids!"]["First the #GOPTaxScam’s backers expected working families to be happy with crumbs, and now even that is too generous? Their cruelty knows no bounds. https://t.co/vo1nRNAvyx"]["The #GOPTaxScam reminds me of a dead fish - the longer it sits out, the more it stinks."]["I am disgusted that @AjitPaiFCC and the FCC have defied overwhelming public opposition and upended the level playing field so integral to the success of our internet – undercutting the accessibility and spirit that have made it a force for innovation and economic growth."]["In true Trump Administration fashion, everyday Americans will end up paying the price for the FCC’s disastrous decision to undo #NetNeutrality today."]["Undoing #NetNeutrality is an early Christmas present for internet service providers, who will now be free to block content, slow speeds, and charge higher fees for access."]["Today’s rollback of #NetNeutrality is a brazen betrayal of American consumers, innovators, students, and entrepreneurs – all of whom will suffer tremendously without a free and open internet."]["Heading to the Senate Floor to speak on the fifth anniversary of #SandyHook. Tune in live on my Facebook page: https://t.co/6dMfLp9Lh1"]["Each day it does not act, Congress turns its back on the will of the American public - continuing its complicity as 90 more lives are lost to gun violence."]["Shame on Congress for allowing yet another year to pass without action. Shame on Congress for allowing this tragic anniversary to be followed by so many more - in Sutherland Springs, Las Vegas, Orlando, Charleston, and communities big and small each day."]["I stand in awe of the #SandyHook families who have shown unparalleled courage and resilience through unimaginable grief and pain. We must never forget the innocent lives lost five years ago today."]["Today we mark five years since the tragedy at #SandyHook Elementary School in #Newtown - one of the darkest moments in our nation’s history."]["Despite Rosenstein strongly supporting Mueller investigation today, bipartisan legislation protecting the Special Counsel is still urgent and necessary. I will fight for it."]["As a federal prosecutor and state AG, I worked with FBI, state police, other professionals - all having political views, left and right. The mark of their professionalism is they parked them at the door, following only the facts and law."]["Special Counsel Mueller took swift and decisive action to remove texting FBI agents from the investigation, even though there is no evidence that their views impacted their work or the investigation."]["Rosenstein stood strong against disgraceful attacks by GOP Congressmen on Mueller inquiry today - a shameful effort to distract and sabotage the investigation with deceptive calls for second Special Counsel."]["Brett Talley was beyond unqualified for a lifetime appointment to the federal bench. The rest of Trump’s unacceptable nominees ought to follow his lead and withdraw. https://t.co/QgnMk2hNjU"]["Thanks @SenCortezMasto for bringing the faces and voices of America’s #DREAMers to the Capitol. Proud to join you in the fight to give these hardworking young people the status they have earned. https://t.co/ysIYXUDLyi"]["Grateful for @SenatorDurbin’s steadfast leadership and unrelenting advocacy on behalf of #DREAMers all across America."]["We have the power to reaffirm American values and give 700k+ #DREAMers the chance to stay in the only home they’ve ever known. Our conscience calls us to use that power now. https://t.co/QIfnuonOEF"]["Last night I told the story of Alejandra, an #AmericanDREAMer brought here at age 1. She learned English, set out to prove herself worthy of American citizenship, and went to college thanks to #DACA. It is outrageous that anyone would seek to slam the door on people like her. https://t.co/xtQ7uknZTf"]["The #DREAMers’ stories are American stories. They work hard, give back, and make our country greater. We must keep faith with them and pass a clean #DreamAct before the year is out."]["As we head into the holidays, we cannot forget the thousands of #DREAMers living in chaos and confusion because of Trump’s disgraceful #DACA rescission. They deserve our backing right now."]["Congratulations to Doug Jones - a decent man and dedicated U.S. Attorney who will stand up for working families in the Senate. We should listen to what he said last night and fund #CHIP now!"]["Wishing a joyful and bright #Hanukkah to all who are celebrating in Connecticut and around the world!"]["Trump should listen to Chairman Grassley and withdraw Talley/Mateer nominations – two of the many unfit or unqualified candidates Senate Republicans have sought to ram through on party-line votes. https://t.co/tyb7UPZx8T"]["Retweet if you agree @AjitPaiFCC should delay Thursday’s #NetNeutrality vote pending a full investigation of possible bot interference in the public comment process. The future of our internet is simply too important."]["The people of Connecticut know what a disaster it would be if @AjitPaiFCC succeeds in rolling back #NetNeutrality. I couldn’t agree more! Please keep speaking out and standing up for a level playing field."]["Latest distraction from Trump lawyers underscores urgent need for Congress to protect Special Counsel investigation. Threat of White House interference now more real than ever. Our legislation needed now."]["Trump legal team’s call for an investigation of their investigators is a direct and despicable attack on our justice system and rule of law."]["More disgraceful distraction and deception as Pres. Trump’s lawyers try to deflect resources and attention from investigation of campaign collusion w/ Russians and obstruction of justice. https://t.co/y5LHcpiNlj"]["We can’t afford the #GOPTaxScam’s anti-environment, anti-renewable provisions. I’m joining @SenMarkey and urging Republicans to scrap these blatant and baffling giveaways to special interests. https://t.co/5KQCV0u9kF"]["I stand with Sen. Gillibrand, a dedicated public servant and friend. America must reject Trump’s sexist slurs."]["I’ve urged ICE to reverse their cruel action and allow Mariano the time to pursue legal status through his U.S. citizen son. It’s not too late to do the right thing and keep this CT family together."]["#NewBritain’s Mariano Cardoso has called America home for 27 years – raising a family, paying taxes, and giving back to his community. Deporting him while his permanent residency application remains pending is simply shameful."]["#SESTA would vindicate the legal rights of victims and survivors of sex trafficking. The House’s proposal, in stark contrast, would keep the courthouse doors barred to victims. https://t.co/SmPJkFzuWb"]["Don’t be fooled. The shameful, misguided House proposal doesn’t “tweak” anti-trafficking legislation - it renders it an empty shell. No wonder it’s opposed by the very survivors it claims to support. https://t.co/gnjZg67tfg"]["Republican leaders in Congress must do their job and protect DREAMers before leaving for the holidays. There is no reason the greatest country in the world - a nation strengthened by immigrants - should fail this task. #DREAMAct https://t.co/qNXYZgLaFB"]["I am optimistic that ongoing, bipartisan talks will pave the way for action to protect 700k DREAMers (incl. about 8k in CT) from unprecedented, unwise deportation. Time to give these talented, hardworking young people the permanent solution they deserve. #HereToStay"]["Joined @RepEsty at the #NewBritain YWCA to kick off Acts of Kindness Week, as we prepare to mark the fifth anniversary of #SandyHook. https://t.co/bQF0MfUDGG"]["Grateful for law enforcement’s prompt and professional response in Manhattan this morning. https://t.co/UACmJytJpQ"]["Following deeply disturbing @nytimes report on the possible real number of deaths in PR in the wake of Maria, reminded of @drsanjaygupta's dire warning: https://t.co/CkbM4qHBMS"]["Appalling. I asked DHS IG weeks ago to investigate misreported death toll in Puerto Rico after devastation of Maria. https://t.co/rgzFB8Q8Eo"]["@CAGVNews @CTCADV My bipartisan #FixNICS Act will strengthen background checks to keep guns out of the hands of dangerous people – it’s the least Congress can do."]["@CAGVNews @CTCADV Instead of reckless and dangerous proposals that weaken law enforcement, Congress ought to focus on passing commonsense reforms to keep Americans safe."]["@CAGVNews @CTCADV Concealed Carry Reciprocity is a threat to public safety in CT, plain and simple. #StopCCR"]["I’ll continue pressing for my Passenger Bill of Rights, which would require transparency in airline pricing. This Administration may not think consumers deserve fair treatment from airlines, but I do."]["The Trump Admin’s reckless reversal is a gift for the airlines’ bottom line - and a slap in the face for travelers who deserve clarity when buying a ticket."]["Unbelievable. Pulling the plug on rules that would ensure airlines are open and honest about bag fees and other charges is about as anti-consumer as it gets. https://t.co/EXa4yhONQS"]["Had a great time catching up with #Fairfield American Little League during their team visit to DC. Keep making Connecticut proud – and thanks for the baseball! https://t.co/m0xrGUOw1B"]["Trump Jr.’s absurd claim of attorney-client privilege is precisely why I’ve asked Chairman Grassley to subpoena him for a public hearing. He should explain his evasiveness to the American people."]["Donald Trump Jr. is apparently taking lessons from AG Sessions when it comes to invoking bogus “privilege” in Congressional hearings."]["This completely bogus claim of lawyer-client privilege leaves no question that Donald Trump Jr. must be subpoenaed to testify publicly and under oath. His defiance of Congress is an insult to elected officials on both sides of the aisle. https://t.co/Px7igY4NN4"]["Thanks to all who courageously shared such moving tributes to lost loved ones this morning. Your determination gives me hope that we will end Congressional complicity in gun violence and finally #HonorWithAction."]["In memory of those lost at #SandyHook nearly 5 years ago – and the thousands taken from us since – we must redouble our efforts to pass commonsense gun safety reforms."]["Powerful words from dozens of survivors and loved ones whose lives are forever changed by the scourge of gun violence. Congress must heed their pleas and #HonorWithAction. https://t.co/5Mhj99gUAP"]["My statement on Senator Franken: https://t.co/ShPYo3u25G"]["With gun violence claiming 90 American lives daily, we can’t afford a step backward. I’ll fight tooth and nail to #StopCCR in the Senate and pass desperately-needed reforms like the #FixNICS Act."]["The House could have passed our bipartisan #FixNICS Act on its own to strengthen background checks. Coupling it w/ the Concealed Carry Reciprocity Act, which will do nothing for public safety, is the height of cynical legislative fraud."]["Deeply disappointed by House passage of the Concealed Carry Reciprocity Act – an appalling bill that will hamper gun safety measures and endanger law enforcement in states like Connecticut."]["Proud to stand w/ gun violence prevention advocates who know we must #StopCCR and pass commonsense reforms like #FixNICS. Let's strengthen background checks and reject reckless bills that won't make us safer. https://t.co/yBRMfFbB99"]["Spoke on @NewDay about why Congress needs to protect the Special Counsel from White House interference and intimidation. Watch here: https://t.co/HKliEMHIHg"]["Congress must advance legislation I introduced w/ @SenSanders and others that ensures Puerto Rico/USVI can get back on their feet and be rebuilt stronger than before."]["Nearly 3 months after #HurricaneMaria, fellow Americans continue to suffer amid shamefully slow federal response. I’ll continue fighting for the robust relief Puerto Rico &amp; U.S. Virgin Islands deserve. https://t.co/CHuINCwAzc"]["As Mueller investigation follows the money w/ Deutsche Bank subpoenas, Senate Judiciary Committee must advance legislation to guard against threat of political interference."]["With Deutsche Bank subpoenas, Special Counsel scrutiny now reaches one of Trump organization’s largest lenders – already under investigation for Russian money laundering scheme. https://t.co/MkqRFTbooZ"]["Just spoke to a great crowd of DREAMers and advocates on Capitol Hill. I’ll tell you what I told them: Congress must pass the #DREAMAct before year’s end. Any less is a slap in the face to hundreds of thousands who know no home but here. https://t.co/jfTDTU4RX1"]["Pres. Trump’s action in Utah sets a dangerous precedent that threatens environmental treasures everywhere. We must protect our natural heritage for future generations. #MonumentsForAll"]["The #GOPTaxScam isn’t law yet – and only an unparalleled public outcry can stop it. Retweet if you’re all-in to fight this monstrosity."]["As Republicans work to rush their #GOPTaxScam onto Trump’s desk, we must expose this bait-and-switch betrayal at every opportunity. Our children and grandchildren will bear an unconscionable burden of debt."]["Reminder: The Republican Senate majority passed this 500-page abomination in the dead of night, without even bothering to read it. They’re hoping you won’t either. https://t.co/yeIwgXBN5x"]["Discussed the urgent need to shield Special Counsel from possible White House interference on @Morning_Joe today. Watch here: https://t.co/D1UXSrbs89"]["Trump’s tweets are HIS words - no disavowal from him, no admission of “mistake.” He knew about Flynn’s FBI lies when he fired him, and when he asked Comey to stop investigating, and when he fired Comey too. Stunning evidence of obstruction of justice. https://t.co/YJLGyH0IJB"]["Top military commanders defending our nation against the national security and safety threat of gun violence - an enemy and epidemic that must be defeated. https://t.co/wOO8KQOJnQ"]["Today's Trump tweet about knowledge of Flynn lies adds evidence of Presidential obstruction of justice - after pressure on DOJ to stop Flynn investigation, firing Comey and Yates, calls to Senators, etc."]["Obstruction of justice in the Oval Office unfolding before our eyes in real time - as Trump seemingly admits to covering up Flynn's lies to FBI about Russian contacts."]["Trump's claim today that he fired Flynn because of lies to FBI, as well as Pence, shows knowledge of lawbreaking he concealed - never before disclosed."]["The people of Connecticut are particularly harmed by this malicious, malign bill - which eliminates critical deductions of state and local taxes and casualty losses for home repairs like the crumbling foundation homeowners."]["The #GOPTaxScam promises relief for all, but massive permanent tax cuts go mostly to corporations and the wealthy, while the crumbs to the middle class are small and temporary. It imposes a mountain of debt on our children and grandchildren."]["Americans will remember this day - and the Senate Republican majority will rue it - for the catastrophic scam foisted on the American people in the dead of night. It is a bait-and-switch, promising a simpler and fairer tax code, and actually making it more complex and unfair."]["Bottom line: Republicans expect Connecticut’s working families to bear the burden of their morally bankrupt #GOPTaxScam. What an utter disgrace."]["With the #GOPTaxScam, the wealthiest get tax cuts they don’t need, while everyday people get higher premiums they can’t afford. A stark reminder of who Republicans really work for."]["There can be no delay. Senate Judiciary Committee must issue subpoenas for documents and witness testimony – in public and under oath – as I have repeatedly urged."][".@SenJudiciary is investigating obstruction of justice directly relating to Pres. Trump’s firing of James Comey after Comey refused to drop the very investigation of Michael Flynn now culminating in this conviction. We must pursue with new urgency."]["Congress must now match the Special Counsel's courage by approving legislation to shield him from the very real threat of improper political interference, as I and others have proposed."]["Make no mistake, #Flynn’s betrayal of national security is an enduring black mark on our country’s history and a stunning violation of his oath of office. Incredibly, he lied to the FBI while he was the President’s chief national security adviser."]["This charge sends a bombshell signal: It’s about the Russians. #Flynn lied about issues of preeminent Russian interests – sanctions, the United Nations, and Russian exchanges."]["#Flynn must continue to cooperate - completely and candidly - if he hopes to avoid even more serious criminal convictions."]["The Special Counsel's investigation has breached the White House gates, reaching one of Pres. Trump's most trusted confidants and unmistakably implicating other top officials."]["#Flynn's fall is staggeringly significant - the tip of the iceberg for him and Pres. Trump - as Special Prosecutor continues to pursue justice."]["A stunning, sobering moment as Mueller investigation reaches Trump inner circle. https://t.co/GNeySLoT5S"]["Republicans just postponed the #GOPTaxScam vote until tomorrow. We cannot let up now! Please keep raising your voices against this unconscionable bill."]["25 years after we first sued Big Tobacco, the industry is still doing everything possible to minimize the deadly toll of its products. Here’s why their recent anti-smoking ads don’t cut it. https://t.co/V5iZUhnqp5"]["My Passenger Bill of Rights w/ @SenMarkey would ensure travelers caught in this outrageous mess receive a full refund, compensation, and flight on another carrier at no cost - because consumers shouldn't pay for airlines' mistakes. https://t.co/9JYYq1prpC"]["@nnedv #FixNICS Act will save lives, prevent injuries, and reflects powerful bipartisan cooperation. Now is the time to pass this urgently-needed bill."]["Proud to stand w/ @NNEDV and advocates supporting #FixNICS Act - our bipartisan bill to bolster background checks and keep weapons from violent abusers. https://t.co/9SzPTtWCCX"]["Grateful for your courage and advocacy on behalf of so many, and proud to stand with you in the fight to save lives. https://t.co/YiFJ8VgMgs"]["My Republican colleagues have a moral responsibility to condemn the President’s absolutely abhorrent tweets. Silence in the face of his disgraceful behavior speaks volumes."]["Amplifying a far-right hatemonger’s propaganda isn't just beneath the presidency - it's beneath humanity. https://t.co/8aYwar76Fi"]["As Flynn falls, the key question becomes: What did the President know about concealed conflicts of interest and foreign contacts, and when did he know it?"]["Flynn confronts overwhelming evidence of criminally concealed conflicts of interest - hidden lobbying for special interests while at the White House, undisclosed work for Russians and Turks. The legal vise tightening."]["Indefensible. Why in the world was Flynn using his White House position to push foreign business deals backed by a former client?https://t.co/TA45fmDkMz"]["We need to raise the alarm on the #GOPTaxPlan right now. Keep speaking out - this shameful scam doesn't deserve a single vote, much less a majority."]["Connecticut isn’t fooled by the GOP’s spin and neither am I. We deserve better than a bait-and-switch #GOPTaxPlan that will leave many working families paying more."]["Unconscionable that #GOPTaxPlan would open Arctic Nat’l Wildlife Refuge to oil/gas drilling in a desperate ploy to finance permanent corporate tax cuts."]["I can’t understand how anyone can look their kids in the eye while backing a #GOPTaxPlan that will betray future generations and break the #ACA – all to benefit the wealthiest."]["Today, every last Republican on the Senate Budget Committee voted (with no debate) to advance huge giveaways for the wealthiest and stick everyday Americans with the tab."]["The people of Puerto Rico &amp; U.S. Virgin Islands have endured the unthinkable. We must promptly pass this urgently-needed bill and provide the help they need to recover. https://t.co/sYpAtgcFuL"]["Our bill has the makings of a Marshall Plan – providing vital funds to rebuild islands’ housing, electricity, health care, and basic government operations."]["Proud to represent a state that has welcomed so many who fled Maria’s devastation. States like Connecticut need help to ensure public schools can accommodate the surge of displaced students. That’s exactly what our bill does."]["Relief is not enough. Puerto Rico and USVI must rebuild with resilience to better withstand future disasters."]["In the 10 weeks since #HurricaneMaria, the Administration’s response has been anemic and inadequate – a national disgrace that betrays all Americans."]["#DREAMers in Connecticut and across America deserve peace of mind - not betrayal. RT if you agree: We must #ProtectDREAMers and pass the #DREAMAct by year’s end."]["A key moment for Special Counsel. Overwhelming evidence against Flynn, but he must be truthful and forthcoming about all he knows - otherwise no deal. https://t.co/PFCeHAnC5u"]["Joining my colleagues in opposition to the disastrous #GOPTaxPlan. Watch the livestream here: https://t.co/TOZAlncYQo"]["Time is running out to defeat this monstrous #GOPTaxPlan. We must continue standing up and speaking out in this critical fight. https://t.co/AHpRrPeYsv"]["If Republicans truly wanted to help everyday Americans, they wouldn’t have let CHIP health funds for millions of kids expire. Their priority is, and always has been, giveaways for the privileged few."]["My constituents are right to be outraged by this reckless and rotten #GOPTaxPlan, which would end state/local deductions families use to save thousands."]["Connecticut’s working families deserve far better than a tax plan that would steal from the middle class and wreak havoc on our economy and healthcare system."]["Heading back to DC and ready to fight tooth and nail against the malicious and misguided #GOPTaxPlan – which could get a vote as soon as this week."]["I’m fighting cruel, counterproductive ICE enforcement at sensitive locations like courthouses – because in the United States of America, no one should be afraid to seek justice. https://t.co/M9m7NbYZ9j"]["@CFPB Showdown in court over @CFPB benefits no one. Better for Mulvaney to stand down. Let CFPB do its job without political bullying."]["Mulvaney isn't interested in helping consumers - only rich WallSt bankers. Strong leadership @CFPB means commitment to consumers over corporate profits."]["Turning a consumer watchdog into a lapdog for big WallSt banks is not what American people need or deserve. CFPB must remain a vigilant protector of consumer &amp; economy. https://t.co/tYSnQ1LLdi"]["CFPB Director Cordray’s job should be filled by his deputy, as Dodd-Frank clearly requires. It supplants the older Vacancies Act. The President wants a dismantler, not a leader."]["Congress had great foresight to mandate that the CFPB deputy fills the Director’s vacancy - to stop a bullying, tyrannical President from crippling the agency and undercutting consumers. That more recently passed provision trumps others. https://t.co/6HLb5WEMR9"]["Revelations about Trump’s foreign business deals underscore urgency of our Emoluments legal action. We need full disclosure and compliance with Constitution - no excuses."]["Trump must come clean to the American people about his partners and funders in foreign ventures. Our Emoluments lawsuit would force it."]["Sleazy and corrupt investors in Trump foreign deals show urgency of full disclosure that Emoluments lawsuit would require."]["New evidence suggests why Trump avoids the transparency that the Constitution requires - our Emoluments suit would hold him accountable. https://t.co/j1rLPdsR0Y"]["Joined by Hartford Police &amp; St. Francis Hospital staff to discuss my Imitation Firearms Safety Act - a simple, commonsense fix that will help keep our law enforcement officers &amp; the public safe. https://t.co/UkFG2xpNEa"]["Flynn must cooperate - for himself, and his country - he must be open and honest about ALL contact between Trump campaign and Russia, holding nothing back. https://t.co/4EOli9vr6I"]["Flynn comes closer to facing justice - and hopefully cooperating - as Special Prosecutor gaining momentum and reaching higher ranks. https://t.co/e7cAPnyKII"]["Great news that Pres. Trump has become a believer in the F-35. He was ready to abandon it. https://t.co/dDpfuNtoKz"]["Not “invisible” Mr. President, but the finest fighter in the sky by far and key to America’s air superiority. You almost scrapped it a year ago. https://t.co/QX4AbGRSp3"]["Fugitives shouldn't get guns. The NICS list only works if DOJ uses it. This move by DOJ puts people in danger, plain and simple."]["Fugitives wanted for arrest should be barred from buying guns - reinstate them ASAP to background check database."]["Why bar gun buys only to fugitives who cross state lines? This new policy makes no sense. Reverse it now. https://t.co/4XZZMrbJIG"]["From our family to yours, Happy #Thanksgiving! Wishing you a wonderful holiday surrounded by family and friends."]["Uber should immediately provide all consumers with free credit monitoring and credit freeze services as well as identity theft insurance."]["Senate Commerce Committee should hold hearing to demand Uber explain their outrageous breach - and inexplicable delay in informing its consumers and drivers."]["I urge Federal Trade Commission to take swift enforcement action and impose significant penalties in response to Uber breach."]["Consumers and drivers deserve better than Uber’s appalling contempt for their personal information. This corporate malfeasance should be swiftly and strongly punished."]["Uber put its customers and employees at serious risk by not only failing to notify the public of the data breach but by taking affirmative steps to bury the news and paying off the hackers."]["I urge everyone to read this new report on the dangerous toys still widely available in stores. It could save you a trip to the ER this holiday season. https://t.co/sbkCVzpZig"]["Toy safety goes beyond physical hazards. Increasingly popular internet-connected toys can become a tool for trolls to target kids – or for trackers to sell their personal info to advertisers. I’m fighting to strengthen laws."]["Holiday celebrations can turn tragic in an instant thanks to dangers found in items as simple as balloons and magnets. Understanding the risks now could save a child’s life."]["I joined @ConnPIRG at @CTChildrens to highlight this year’s \"Trouble in Toyland\" report – a must-read on hazardous toys available across America. https://t.co/DKMlfOL920"]["Every year in America, hundreds of thousands of kids are treated in hospitals for preventable toy-related injuries. Parental vigilance can often make a world of difference."]["Unbelievable. First the Trump Admin violated court orders during Muslim ban rollout, now it wants to bury its wrongdoing from the public. Not on our watch. DHS must release Inspector General's report now. https://t.co/PBhB30JeQR"]["I remain appalled by Pres. Trump’s attempts to weaponize antitrust law because he disagrees with CNN’s coverage, and I’ll continue to oppose any improper influence by White House and any attempts by Administration to chill freedom of speech."]["DOJ can anticipate a tough battle, but it deserves support for the goal of protecting against undue power and possible abuse that harms innovation and consumer choice."]["Department of Justice suit blocking AT&amp;T/Time Warner merger is highly significant as an apparent effort to protect competition and consumers."]["We need real, robust relief to tackle this humanitarian crisis, not the paltry package the White House has requested. I'll fight as long as it takes for Puerto Rico and USVI to get the help they need."]["Two months after #HurricaneMaria, help urgently needed to get health, education, and economy of Puerto Rico and US Virgin Islands on track – plus long-term Marshall Plan for lasting recovery."]["This morning, fellow Americans in #PuertoRico and #USVI awoke to their third month without power or access to basic necessities."]["Informative conversation this afternoon w/ @HispanicFedCT and @PeaceCenterofCT on steps we can take to end #GunViolence in #CT and nationwide. Grateful for all who joined and asked such thoughtful questions."]["@ChrisMurphyCT @RepEsty We can leave no stone unturned when it comes to curbing gun violence. That's why we must pass Fix NICS Act and take a bipartisan step toward the reforms Americans demand."]["@ChrisMurphyCT @RepEsty Hopeful that the powerful alliance united behind Fix NICS Act is a prelude to more bipartisan collaboration on gun violence prevention."]["@ChrisMurphyCT @RepEsty Our background check system is only as good as the information in it. Fix NICS Act will help close potentially lethal reporting gaps - helping prevent gun sales to people who are a danger to themselves or others."]["Joined @ChrisMurphyCT, @RepEsty, and advocates in #Hartford to discuss Fix NICS Act - a bipartisan breakthrough that will address fatal flaws in America’s background check system. https://t.co/ScUazVJ1UG"]["Report showing $95 billion economic burden reminds us that the opioid epidemic’s impact goes beyond the incalculable human toll. We cannot accept this. https://t.co/gLebf2wjOt"]["This holiday - talk turkey, and taxes. Only public outcry and outrage can defeat this monstrosity."]["Stopping this mean monstrosity of a bill means mustering the same energy that beat #Trumpcare. Retweet if you're ready to fight #GOPTaxPlan with all you’ve got."]["#GOPTaxPlan shows Republicans will do anything to hand giveaways to those who need them least. Raising taxes &amp; premiums on working families is just the cost of doing business."][".@HouseGOP bill was bad, but what Senate Finance rushed through in the dead of night is worse. On top of raising healthcare costs and kicking millions off coverage, it would hike taxes for middle class."]["It's absurd that the “party of fiscal responsibility” would grow the deficit by $1.5 trillion – and abhorrent that they stuck Connecticut's middle class with the tab."]["As I have repeatedly urged, subpoenas for both documents are necessary - now! https://t.co/4XuBQ2oR1j"]["The @HouseGOP tax bill is a classic bait-and-switch - and the proof will be in middle class Americans' paychecks, where many will see higher taxes. This giveaway to the wealthiest should be dead on arrival in the Senate."]["Brett Talley’s apparent defense of the KKK is disgraceful. Why on earth would we reward him with a lifetime appointment to the federal bench? Time to reject his nomination and end this embarrassing episode. https://t.co/jo0DWuVvi8"]["Proud to join @SenGillibrand in reintroducing key legislation to protect servicemembers from the scourge of sexual assault - and hold perpetrators accountable. We can and must do better. https://t.co/3JuR3IvrHv"]["My GOP colleagues should remember that we are judged by the company we keep. All of us should resist the Trump administration's brazen bid to stack our judiciary with extreme, unqualified nominees. https://t.co/ukbroETvqT"]["Here's an idea: If you want to make it harder for Americans to vote, organize, breathe clean air or drink clean water, you aren't fit for a lifetime judicial appointment."]["How can any of my colleagues back nominee Brett Talley, who says the answer to Newtown is to “stop being a society of pansies and man up” and hasn’t tried a case in his life?"]["Jeff Mateer calls transgender children “Satan’s plan” and proudly says “we discriminate” based on sexual orientation. Handing him a lifetime appointment is beyond inexcusable. #StopMateer"]["The Trump administration has tried its level best to ram through nominees that would boost their destructive, deeply unpopular agenda. I won’t stand for it. https://t.co/tLPZicKtCf"]["We can’t hand lifetime appointments to nominees who would seek to undo decades of precedent on everything from reproductive rights to LGBT equality. https://t.co/kt0ytv2Eqf"]["Our laws are only as effective as the judges who implement them. The far-right views of Pres. Trump's nominees put our independent judiciary at risk. https://t.co/H8JOIr9qAW"]["I won't stand by while Pres. Trump floods the zone with extreme, unqualified judicial nominees. We need scrutiny here, not speed. https://t.co/FLyC8llANC"]["Cooperation and compromise are not four letter words - helping here to save lives, literally."]["Powerful alliance across the aisle could be a step toward more effective measures against gun violence."]["With the Fix NICS Act we can bolster our background check system, keep guns away from would-be killers, and save lives. Grateful for my colleagues on both sides of the aisle for confronting this crisis with action."]["Our bipartisan Fix NICS Act will incentivize states, and hold federal agencies accountable, to build robust reporting systems that can prevent gun sales to people who are a danger to themselves or others - including convicted domestic abusers."]["From Sutherland Springs to Charleston to Blacksburg, we’ve seen what can happen when gaps in the National Instant Criminal Background Check System (NICS) let guns fall into the wrong hands. Enough is enough."]["Americans have waited long enough for commonsense reforms to curb gun violence. Today, we are taking bipartisan action."]["As if eliminating money-saving deductions for working families wasn’t vile enough, @SenateGOP now ready to hike premiums and kick millions off insurance. This isn’t #TaxReform – it’s an all-out assault on the middle class. https://t.co/OQ6x1oXX0h"]["Again and again, we’ve seen guns turn dangerous disputes into deadly ones. My commonsense legislation would end Congress’s cycle of complicity in gun violence by helping to keep firearms from domestic abusers. https://t.co/aOCUJFQEBV"]["Thank you for your unwavering efforts on behalf of so many. It is an honor to stand with you. https://t.co/fcPPZIHxs1"]["Rail passengers and workers are all threatened when railroads let safety take a back seat. Amtrak and FRA must take immediate action on safety board’s findings. https://t.co/G7V2wiuLro"]["Yesterday we learned there were 130 reported hate crimes on the basis of gender identity in 2016 – up 10% from 2015. This Transgender Awareness Week, I urge my colleagues to support the NO HATE Act &amp; redouble the fight against hate &amp; violence in all forms. #TransWeek"]["Transgender Awareness Week is a vital reminder that diversity strengthens us - especially when it comes to the Armed Forces. That's why Pres. Trump's transgender military ban has no place in America. https://t.co/KmgHMS7N36"]["More children struck by the scourge of gun violence. We cannot be numbed or accept such atrocities as a new normal. I'm furious at Congress's complicity. https://t.co/KftdycOeEx"]["Tip for AG Sessions: Please read the letter we sent you last month about your bogus invocations of executive privilege at Congressional hearings – attached here if you don’t recall. https://t.co/ZcDPF0RADf"]["Office pool question: How many times will AG Sessions say “I can’t answer that” during this hearing?"]["Unresponsive and unaccountable. AG Sessions repeatedly refuses to answer, invoking bogus executive privilege."]["Americans deserve the full truth about Sec. Ross's finances and possible conflicts of interest. Glad to have @SenatorHassan @CoryBooker @SenatorCantwell @SenatorBaldwin @SenDuckworth joining my call for an Inspector General investigation. https://t.co/wMBSin4GIE"]["We should stand up and say no to nominee Brett Talley - who says the solution to gun violence is to \"man up\" https://t.co/looCbTNPRp"]["There seems to be no reasonable innocent explanation for these messages. Chairman Grassley must issue a subpoena immediately for Donald Trump Jr.’s public testimony, full documentation of his communications w/ WikiLeaks and any other Russian agents, and all other relevant docs."]["These messages seem to indicate Pres. Trump’s son was actively engaged and may have coordinated strategy with a known agent of the Russian government, WikiLeaks. We cannot know the full extent of these communications unless and until they are subpoenaed by Chairman Grassley. https://t.co/EFoLiIiY63"]["We cannot accept a deportation system that needlessly breaks apart families and diverts federal resources from true threats to public safety and national security. Connecticut’s Rondos family – and all of us – deserve better."]["Deportation stay for #Cheshire’s Denada Rondos is a temporary victory for reason and justice. I am grateful that the Rondos family can now pursue a fair and full hearing while remaining together in Connecticut. https://t.co/wJ2Bk8qhiT"]["Non-disclosure disqualifies Brett Talley ethically from judgeship - already unqualified professionally. Opposition should be bipartisan now."]["I oppose Brett Talley’s nomination because he lacks the temperament and experience to be a judge. Non-disclosure of his wife's White House role underscores his unfitness for the bench. Will my GOP colleagues join me in opposition? https://t.co/MJxEjdBgVo"]["I’m standing with education advocates in #Hartford because teachers should be saluted for their public service - not saddled with a mean, misguided tax plan that will hinder their ability to help students in need. https://t.co/WSMoeVzqPZ"]["Great news that my friend Selim Noujaim is home. Wishing you a swift, sound recovery! https://t.co/bltwWE35v1"]["This list of mass shooting victims—&amp;thousands more lost one by one—is an indictment of Congress&amp;its unconscionable complicity in inaction. https://t.co/PwVqZm2CcT"]["Honoring Connecticut’s veterans with @CTVetsAffairs: thank you all for your service to our country. https://t.co/9doCJRqlNW"]["Beautiful day for today’s #VeteransDay2017 parade in Naugatuck https://t.co/FlzLmBbAoA"]["Thanks to the vets at Charles W Wood VFW Post 10321 for inviting me to join your #VeteransDay celebration w/Mayor Leng&amp;State Senator Logan"]["Stood w/ @MayorHarp and the @cityofnewhaven today to thank the brave men&amp;women who have served or are now serving now around the globe"]["Honored to join @MayorOBrien &amp;the City of West Haven to recognize&amp;remember the service&amp;sacrifice of our nation’s veterans https://t.co/H3czOeMBb2"]["President Trump shld put American nat’l security first instead of being solicitous of a KGB thug who attacked our democracy&amp;elections."]["Russia bullying American media like CNN endangers press freedoms everywhere—encouraging other threats."]["Resistance necessary against Russia's threats of crackdown on American media including CNN. Abhorrent&amp;unacceptable. https://t.co/JELH75WbDg"]["Pres Trump’s dangerous denial of Russian meddling in 2016 undermines U.S. intelligence community&amp;threatens security of future elections"]["No President of the U.S. shld trust Putin more than the American intelligence officers that risk their lives for our country&amp;nat’l security https://t.co/cJyA9YPhcj"]["#VeteransDay reminds us of our obligation to keep faith w/ all who have served. We are a stronger nation because of your selfless sacrifice."]["On #VeteransDay we honor the men and women who have worn the uniform of our great country – and the families who have sacrificed with them."]["Today we express our unending gratitude to all whose service to our nation has helped make it the greatest on Earth. #VeteransDay"]["The American workforce is our country’s greatest asset. So why isn’t the GOP tax reform bill investing in it? https://t.co/5T4Vx4jvbZ"]["By giving the wealthiest a tax write-off while slashing benefits for the vulnerable&amp;middle class, GOP tax bill betrays American values."]["Republican tax plan is a betrayal of the goal of tax reform: simplicity&amp;fairness."]["GOP is celebrating #VeteransDay by eviscerating tax credit that supports hiring our nation's heroes."]["As we recognize the service&amp;sacrifice of all who’ve served, we must keep our promise to Puerto Rico’s vets through action&amp;commit to support full recovery on the island"]["Thanks to 32BJ SEIU &amp; the Hispanic American Veterans Association of CT for hosting today’s #VeteransDay2017 celebration https://t.co/Ily81NcDOU"]["Enjoyed celebrating #VeteransDay2017 at the #IAVAHeroesGala last night. Thanks to @IAVA for all you do to support vets nationwide! https://t.co/2rH9H5XCEq"]["Recommitting to CT’s Doug Walker, son of MIA Brigadier General Kenneth N. Walker lost on San Antontio Rose, our promise to bring home every hero missing in action https://t.co/rZIRBY6dYk"]["As we pause today to recognize the service&amp;sacrifice of those who have dedicated their lives to defending our country, the crew of the Rose must never be forgotten."]["Joined @JohnBoozman &amp;10 colleagues honoring&amp;remembering the crew of the San Antonio Rose—eleven heroes lost 75 yrs ago defending our shores in WWII https://t.co/1LPPmCO52n"]["True tax reform shld help all Americans get ahead-Republicans shld commit to responsible, transparent&amp;bipartisan process to reach that goal"]["America is fed up with malicious and misguided policies that target middle class families."]["Tax plan is fundamentally unfair&amp;fiscally irresponsible-a massive tax cut for the wealthy that leaves the rest of America holding the bag"]["Gutting #SALT deduction will devastate families who save thousands each year&amp;communities that benefit from the support for local services."]["Completely eliminating the state&amp;local tax deduction is a partisan ploy to punish states like Connecticut."]["If the House tax bill was bad for Connecticut families, the Senate plan is worse: https://t.co/DVIM1H5LWe"]["Join &gt;600K Americans who have already signed up for healthcare coverage under the #ACA: https://t.co/QXALAiyDw6"]["Record enrollment numbers for #ACA even in the face of political efforts to stymie sign-up: https://t.co/oEFL4thoCM"]["The millions of Americans who saw false&amp;inflammatory posts generated by foreign agents here on @Twitter should know how they were exposed to Russian propaganda."]["Manufacturers issue recalls. Newspapers print corrections. Social media giants should notify users how they’ve been exposed to Russian lies on their platforms."]["I’m calling on @Facebook @Twitter @Google to tell every one of their users if they’ve been exposed to Russian propaganda online and how. https://t.co/wS60GB4vzI"]["I’ve closely questioned DOJ officials abt assuring the independence of CNN during review of AT&amp;T/TW merger."]["I’ve long opposed AT&amp;T/TW merger b/c of its impact on competitors&amp;consumers—DOJ must continue its thorough&amp;exacting review. https://t.co/ADy7XXMnj9"]["As we continue our fight for passage of SESTA, I am buoyed by the steadfast support from diverse stakeholders committed to giving victims of sex trafficking their day in court, and bringing online sex traffickers to justice."]["Momentum is building for our bipartisan bill, due in large part to the growing chorus of voices – including key figures in the technology sector – calling for an end to the shameful, shocking practice of selling children for sex."]["This critical step forward in our fight to end online sex trafficking is thanks to the tireless work of advocates, survivors, and a diligent bipartisan coalition of my colleagues. https://t.co/VZpSo09roW"]["The Stop Enabling Sex Traffickers Act - bipartisan legislation I sponsored with @SenRobPortman - was approved by the Senate Commerce Committee this morning."]["We cannot accept the inevitability of gun violence. Numbness is not the answer - now is the time to honor victims with action."]["Gun violence touches communities of all sizes in all states. Curbing this senseless scourge can and should be a bipartisan priority."]["We cannot allow ourselves to become desensitized to the gun violence gripping America. We cannot lose hope that action is possible."]["Connecticut knows the horror of gun violence all too well. We grieve with the brave souls in Texas enduring unspeakable pain."]["DOD must determine why Air Force failed to add gunman’s conviction to background check database - and take action to prevent future errors."]["Current DoD procedures don't explicitly identify those who belong in background check database. I'm calling for urgent process changes."]["If there is a systemic failure to report court-martial indictments or convictions to background check system, America needs to know."]["We need to know why TX gunman's conviction wasn't reported to background check system &amp; if others slipped through. My letter to Sec. Mattis: https://t.co/2VbwBfOBRT"]["Time now for Sec. Ross to be honest and straightforward about what his assets are, where they are held, and who is benefiting from them."]["More questions about Sec. Ross's assets &amp; obligations - especially concerning in light of what we learned this week. https://t.co/m0374don5l"]["Domestic abusers should be barred from gun buys. I'm trying to toughen law. https://t.co/9ILoujpMYQ"]["Law requires military felony convictions to be reported to database, but that didn't happen. Why? How many others?"]["As a member of Judiciary &amp; Armed Services Committees, I'll call on DoD/DoJ to provide clear picture of where, why &amp; how this process failed."]["Air Force failure to report gunman's domestic violence convictions seems to violate statutory duty. How many others unreported? https://t.co/MrVR9zBxBy"]["Broad consensus on #SESTA should speed its passage and enactment. Survivors of trafficking have waited long enough for justice."]["#SESTA will allow survivors of trafficking to seek justice in the courts by strengthening ability to hold online enablers accountable."]["Pleased that the tech industry has accepted the need for legal change &amp; accountability when it comes to combating trafficking. #SESTA https://t.co/7iM1vR89AH"]["My bipartisan legislation with @SenRobPortman to combat sex trafficking is set to be considered by the Commerce Committee this Wednesday."]["We do have \"a guns situation\" - one that claims scores of American lives every day. Addressing it demands leadership, not excuses."]["Any link btwn mental health &amp; gun violence in a particular situation cannot be an excuse for inaction on commonsense gun violence measures."]["We aren't the only country with mental health issues, but we are the only one with this unmatched magnitude of gun violence. https://t.co/4MwTxGn4eX"]["Commerce Dept. Inspector General must immediately open an inquiry into the nature &amp; scope of Sec. Ross's financial relationship w/ Russians."]["Sec. Ross’s stake in company so closely tied to Putin inner circle raises profound question: Can he put America's interests before his own?"]["Stopped by @Morning_Joe to discuss urgent need for investigation of Sec. Ross ties to Russian oligarchs. Watch here: https://t.co/GOi3tJ00lW"]["Enough is enough. Now is the time for commonsense gun violence prevention steps. Congressional complicity must end."]["Horror, heartbreak, shame. Prayers are important but insufficient. After another unspeakable tragedy, Congress must act - or be complicit."]["Heartbroken for victims, loved ones, and all affected by the horrific tragedy in Sutherland Springs, Texas."]["Only after a thorough investigation can Americans be sure Secretary Ross really has their best interests at heart."]["With Wilbur Ross revelations, question must be asked - whose interests come first in this Administration?"]["Inexcusable and intolerable. Americans are owed answers on this Cabinet's troubling failure to disclose links to Russian interests."]["Why do so many Trump associates have such trouble disclosing relationships with Russia? https://t.co/VUChe0vcFt"]["Wonderful time at #Stamford Public Education Foundation's \"Reading is FUNdamental\" event this afternoon. Great seeing everyone! https://t.co/eR2fumUILc"]["No red or blue when it comes to safeguarding our children online. Pleased to see bipartisan PROTECT Act become law. https://t.co/x4owynkP5B"]["How many reports will it take for the Trump Admin to drop its #ClimateChange denials &amp; treat this global threat with the urgency it demands?"]["The reality of #ClimateChange has never been clearer. When will the climate-denier-in-chief open his eyes? https://t.co/sRxQaI8VhC"]["Visited @MoheganSun this morning to kick off 3rd annual #VetsRock celebration saluting service orgs &amp; veteran-own businesses. Great spirit! https://t.co/8zBzLE88mP"]["Joined @AC360 last night to discuss Special Counsel probe and why AG Sessions needs to come back before Judiciary Committee. Watch here: https://t.co/2a5LKoR38P"]["I demand AG Sessions immediately explain his past Trump/Russia statements - before Judiciary Committee &amp; American people. We need the truth. https://t.co/6lVbn1nDVR"]["In light of this week's news, AG Sessions needs to explain what he really knew about Trump campaign communications with Russia. Now."]["Until Republicans scrap this shameful tax plan and commit to a bipartisan effort that protects the most vulnerable, they can count me out."]["By making massive corporate tax cuts permanent, it's never been clearer who Republicans really work for."]["Nixing the student loan interest deduction throws graduates already struggling with debt further under the bus."]["Repealing state and local tax deductions will devastate Connecticut families, who rely on them each year to save thousands."]["This GOP plan hands a massive tax cut giveaway to corporations, leaving middle class families to pick up the tab."]["True #TaxReform would help all Americans get ahead. That's not even close to what the Republican plan does."]["The Republican tax plan is fundamentally unfair and fiscally irresponsible – a massive giveaway to special interests and the wealthiest."]["For America’s middle class, this monstrously regressive Republican tax plan gives “mean” new meaning."]["Thrilled to see #NewBritain’s George Springer named #WorldSeries MVP! You’ve made @UConnBaseball and CT so proud. https://t.co/2ptuuz3Srs"]["We must loudly resist any attempts to curtail resources, mandate or independence of Special Counsel. The stakes are too high to stay silent. https://t.co/CYBP2o4q6P"]["Special Counsel’s work will take time - this is end of the beginning, not beginning of the end. Let's make sure it proceeds w/o obstruction."]["At this historic moment, Congress needs to tell President Trump it will not tolerate any interference or intrusion in Special Counsel probe. https://t.co/95BKZTfCFn"]["I urge Congress to send a message and pass bill to prevent Pres. Trump from firing Special Counsel. Inaction risks Constitutional crisis. https://t.co/1CMza0h0EM"]["Specter of political interference underscores urgent need to shield Special Counsel. Congress must move proactively against any malfeasance."]["We must unite across party lines to support the Special Counsel and ensure he can follow the facts and evidence wherever they may lead. https://t.co/kDWOFTu31F"]["Hearts and prayers are with our wonderful friend and great public servant, Selim Noujaim. https://t.co/lI4w4GecQU"]["My heart is with all affected by the tragedy in Manhattan. Grateful for the efforts of brave first responders and law enforcement on scene."]["Couldn't ask for a nicer day to meet visiting @goChoate students on the Senate steps. Enjoy the rest of your trip! https://t.co/4MfJawyLj8"]["A long-term Marshall Plan is essential for the robust recovery and renewal Puerto Rico needs to thrive."]["I welcome an investigation of the now-canceled Whitefish Energy contract. Any criminal wrongdoing must be met with swift prosecution."]["Lack of leadership at the top means potentially deadly delays in recovery. Puerto Rico needs a disaster relief czar to coordinate response."]["Nearly six weeks after Maria, it is beyond intolerable that 70% of our fellow Americans in Puerto Rico still lack power."]["UN experts raise the alarm about our failing federal response in Puerto Rico. When will the White House listen? https://t.co/kLqYCWc75Y"]["No doubt Mueller will continue to do his job. Congress must follow his example and act now to shield probe from political interference."]["Now more than ever, the Special Counsel needs legislative protection. I'm working with my colleagues to make that happen."]["Message from Special Counsel to lawbreakers: Cooperate now (Papadopoulos) or risk indictment (Manafort)."]["Joined @Morning_Joe to talk Manafort/Gates indictments, Papadopoulos bombshell, &amp; what could come next. Watch here: https://t.co/uf05WjJ1MJ"]["I'll keep pressing for my bill to protect Special Counsel from political interference - something that can and should be a bipartisan goal."]["With Special Counsel probe moving into critical new stage, we must defend Mueller team's ability to follow the facts wherever they lead."]["We now know Trump's campaign was run by an accused Russian foreign agent charged w/ conspiring against US &amp; laundering payments from Moscow."]["I couldn't agree more. Thank you for bravely sharing your story, @bre_stewart30. Your powerful words will undoubtedly help so many others. https://t.co/zwHzHOrNsi"]["Bipartisan bill to shield Special Counsel from WH interference more necessary than ever. Independence sacrosanct. https://t.co/syz3xUbFDT"]["Judiciary Committee must move forward w/ public hearings, witnesses under oath, and full report, making sure no conflict w/ Special Counsel."]["Strong bipartisan support for Special Counsel now critical. We must come together behind the rule of law."]["Conspiracy indictment is a chilling story of blatant lawbreaking - need to know which others involved."]["Special Counsel upholding rule of law must be protected against possible White House political interference."]["This is a major step toward answers and accountability - which America needs and deserves now."]["A sobering, shattering moment as Special Counsel moves to the courtroom. https://t.co/f0E5UEy6bf"]["Blumenthal v. Trump lawsuit says the President violates the Constitution with foreign benefits to his private interests."]["I'm leading Emoluments Clause suit because foreign payments and benefit to Trump-owned properties violate law."]["Projects raise profound question: What comes first for Pres. Trump, America's interests or his company's bottom line? https://t.co/XRlSbHnhDm"]["No matter who is indicted now, Mueller investigation must continue, with protection against likely impending Trump political interference."]["Special Counsel investigation at critical serious stage - end of the beginning, not beginning of the end. https://t.co/au87UUQkBD"]["Deeply humbled to receive @NewtownAction \"Honor With Action\" award along w/ my colleagues. Together we can curb gun violence and save lives."]["It's National Prescription Drug Take Back Day. Visit the DEA’s website to find the nearest drop-off site: https://t.co/J0YRgKvHmB"]["The American people deserve the truth about any collusion, obstruction of justice, and related wrongdoing that may have taken place - now."]["White House should turn over docs related to Trump/Comey interactions - as well as docs related to Kushner contacts w/ foreign nationals."]["Judiciary Committee has unique oversight role concerning DOJ &amp; FBI - potential targets of obstruction &amp; interference by President &amp; others."]["I welcome Sen. Feinstein's letters - a vital step in investigation of obstruction of justice &amp; Russian interference. https://t.co/eqIcChiRSp"]["Significant new evidence of top Russian leadership relentlessly reaching out to Trump campaign - key to investigations."]["More chilling evidence of Kremlin’s direct involvement in seeking Trump campaign collusion in attacking our democracy. https://t.co/5BL2Be8Dzc"]["You don't get to lecture anyone about \"fiscal responsibility\" if you support exploding our debt to finance tax cuts for the rich. Period."]["Fact: The man who griped about the cost of lifesaving Puerto Rico aid wants $1.5 TRILLION in deficit-busting tax cuts for him &amp; his cabinet."]["Despicable that Republicans want CT's working families to foot the bill for giveaways to top 1%. This is #TaxReform only Trump could love."]["GOP #TaxPlan is a middle class sucker-punch - jacking up taxes on 428K Connecticut households to pay for giveaways to the wealthy."]["No one is immune from the opioid epidemic - here in Connecticut or across America. We have an obligation to confront this crisis head-on."]["I have urged Pres. Trump to allow the federal government to negotiate lower prices for naloxone, a lifesaving opioid overdose reversal drug."]["The $45bn my colleagues and I have proposed is only a start, but it will bring immediate relief to communities ravaged by the opioid crisis."]["With dozens of Americans dying from opioids daily, we need an immediate emergency declaration - accompanied by resources, funding &amp; action."]["Trump's declaration falls far short of needed action on opioids, freeing up a mere $57K in funding &amp; pulling resources from other programs."]["Americans deserve real leadership on the opioid epidemic, not the empty rhetoric and half-measures we heard from the President yesterday."]["Pres. Trump is right that we face an opioid crisis of epic proportions, but he has failed by reverting to the worn out \"Just Say No\" mantra. https://t.co/cFBZ6xAUJo"]["Dismantling key State Dept office a signal Russians can defy and mock America and world with impunity."]["Trump admin mocks sanctions enforcement - giving Russia a pass. https://t.co/IWljRg6GKw"]["Dreamers help make America the greatest nation on earth - and great nations keep their word. Let's pass the #DreamAct now. #WeAreAllDreamers https://t.co/yONgwDielM"]["Under Pres. Trump, ICE &amp; border patrol are emboldened. Agents have arrested immigrants in sacred places like schools, churches &amp; hospitals."]["Horrifying. Why are immigration agents going after a 10-year-old girl seeking gallbladder surgery? https://t.co/IngSM46EXd"]["Mr. President, how many more Americans will die from opioids before you decide to take the bold steps this crisis demands?"]["In the three months since Pres. Trump called for an emergency declaration, hundreds of thousands have been touched by the opioid epidemic."]["The Trump administration’s opioid declaration falls drastically short of the sustained, robust action American communities desperately need."]["CT families suffering from the opioid crisis deserve better than half-measures and empty rhetoric offered seemingly as an afterthought."]["@ChrisMurphyCT We have it in our power to curb gun violence. No more excuses. Let's pass the Background Check Expansion Act and make America safer."]["@ChrisMurphyCT Vast majorities of Americans support background checks for guns. Congress should listen to them and pass the Background Check Expansion Act."]["@ChrisMurphyCT Thousands of guns trade hands every year without the basic safeguard of a background check. Closing this loophole will save lives."]["Proud to join my colleague @ChrisMurphyCT on the Background Check Expansion Act - a commonsense reform to keep guns out of the wrong hands."]["We weren't elected to shut the courthouse doors on Americans &amp; let wrongdoers off the hook. I'll keep fighting for justice &amp; accountability."]["@CFPB Republicans voted in favor of predatory lending, wage theft, sexual harassment and malpractice. They voted to deny millions a day in court."]["Repealing @CFPB rule means bad actors can rip off consumers with immunity. Most Americans won't notice until after they are cheated."]["@SenateGOP By undoing @CFPB arbitration rule in the dead of night, GOP sent a clear message: corporate power means more to them than your day in court."]["Last night, @SenateGOP and VP Pence voted to take power from you and hand it to corporations like Wells Fargo and Equifax."]["No excuse for denying a young woman’s right to make her own reproductive choices. Period. #JusticeForJane"]["This ruling is a major step toward #JusticeForJane and a stern rebuke of the Trump administration’s appalling abuse of power. https://t.co/2ctuCxtxgu"]["CDC must engage now to prevent an epidemic of mosquito-borne illness that could wreak havoc on Puerto Rico's recovery. https://t.co/C8nzbGDRxR"]["Puerto Rico needs a disaster relief czar to cut through red tape, empower local leadership, and get this massive job done right. https://t.co/UJMXIhDFRg"]["Long-term Marshall Plan is crucial for Puerto Rico to build resilient infrastructure and restore the stability citizens need to thrive."]["Stronger, substantive relief must follow today’s short-term supplemental. More than repair, Puerto Rico needs real investment &amp; renewal. https://t.co/AU7G63acrk"]["What's at stake in Puerto Rico is our humanity. We wouldn't accept this crisis if it happened in Connecticut, and we can't accept it now. https://t.co/AAUgwD64uk"]["Puerto Rico destruction unlike anything I ever thought I'd see in America. Towns flattened. Power lines down. Homes razed to the ground."]["Puerto Ricans are patriotic Americans who have fought in our wars for generations. They deserve better than our failing federal response."]["Don't let Trump's cruel crusade against the ACA prevent you from getting coverage. Open enrollment starts 11/1 - https://t.co/fbJj9oLabW"]["Here is what sabotage looks like - with ordinary Americans paying the price. https://t.co/5qE801AKdD"]["It shouldn't need to be said, but healthcare for vulnerable kids cannot fall by the wayside. Congress must right its wrong &amp; renew CHIP now."]["Reminder: CHIP health funds for 9M kids (inc. 17K in CT) expired 23 days ago. Instead of fixing, @SenateGOP is focused on tax cuts for rich."]["I will fight for a larger, long-term plan that goes well beyond the meager Supplemental to be voted on this week. PR &amp; USVI deserve no less."]["No excuse for Congress putting Puerto Rico/USVI on the back burner. Need real and robust relief, not half-measures that add to debt."]["Puerto Rico needs a relief czar and immediate CDC action to guard against public health emergency and avoid preventable deaths."]["Firsthand accounts from fleeing Puerto Ricans show disgraceful double standard in disaster relief. All Americans must be treated equally."]["Connecticut families with loved ones in Puerto Rico are raising the alarm. This humanitarian crisis demands a massive response."]["President Trump should have listened to the families I heard from in Hartford before giving his Puerto Rico response a 10. https://t.co/UfW7RvMB9Y"]["Congratulations to the accomplished authors honored at this year's Connecticut Book Awards! https://t.co/DPhDcNAbrf"]["More than 80% of Puerto Rico still lacks power. No real timetable to restore it. No recovery possible until Corps of Engineers gets it done."]["I'll vote to advance supplemental funding for Puerto Rico, but no one should consider it enough. Need relief czar &amp; long-term Marshall Plan."]["I’m voting for short term relief package tomorrow, but working on longer, larger recovery measure with real investment for PR's future."]["Trump deserves a 10 for Puerto Rico performance. But only if the scale is 1 to 100, usual for grading. Mr. President, do better today."]["This report is the last straw - has Wells Fargo no shame? DOJ prosecutors should investigate, and throw the book at culprits."]["Comptroller of Currency report shows need for criminal action as Wells Fargo continues to evade and avoid responsibility."]["Continuing to shortchange consumers, Wells Fargo mocks moral and legal accountability. Shameful. https://t.co/BtJvE1njmp"]["This #TaxReform is nothing more than a huge tax cut for those who need it least. I'll fight relentlessly to ensure it doesn't become law."]["1 in 4 Litchfield Co. taxpayers claim state/local deductions, saving avg. of $5,500/yr. Trump tax plan takes this money-saver off the table."]["Visited #Winsted to discuss Trump’s unconscionable plan to balance giveaways for wealthy on backs of middle-class taxpayers. https://t.co/ho9Sc2v3m4"]["I call on ICE to respect its rules &amp; stay out of sensitive locations. All should be able to learn, worship, &amp; receive medical care w/o fear. https://t.co/4UJkipPXKN"]["ICE should not stalk sensitive places like hospitals, courthouses, schools, or churches - spreading fear that tears apart communities."]["This year ICE agents have violated @DHSgov policy by detaining immigrants at sensitive locations like hospitals, churches, even schools."]["I will not stand by while this administration's misguided priorities put the well-being of American women and families at risk."]["Proud to join dozens of my colleagues on a bill to block Pres. Trump's rollback of birth control mandate &amp; safeguard access to coverage."]["Access to affordable contraception has saved billions, reduced unintended pregnancies, &amp; improved the health of nearly 62M women nationwide."]["Reminder: Two weeks ago, the Trump Admin gave businesses free rein to interfere in their employees' reproductive healthcare choices."]["This plan is not comprehensive #TaxReform at all. It's a massive tax cut for the wealthy - including Trump himself."]["Budget resolution is straight from Trump playbook: Guts Medicare/Medicaid, abandons infrastructure, &amp; shifts tax burden to working families."]["Mr. President - After 4 weeks, 85% of Puerto Rico lacks power. 1M households have no safe water. Not a 10 in my book, shouldn't be in yours. https://t.co/Sx3NvKSWgc"]["We need an urgent investigation into the Administration’s failing Puerto Rico relief efforts. No time to waste with lives on the line."]["It is a disgrace that the most powerful nation on earth is not laser-focused on the humanitarian crisis impacting millions of its citizens."]["A month after Maria hit Puerto Rico, diseases are spreading and a third of households still lack safe water. We cannot accept this."]["Stunning. Catastrophe cannot become the new normal in Puerto Rico. https://t.co/LCknhhwtfM"]["Congress is complicit each day it fails to address gun violence. We must honor lives lost w/ action to avert future tragedy. #LoveToLasVegas https://t.co/9hXgygrHNa"]["Deeply troubling that America's top law enforcement official would not stand up for our First Amendment freedoms today."]["AG Sessions had the chance to repudiate President Trump's disgraceful bullying of our free press. He refused. https://t.co/uUEu4Sgk4i"]["Connecticut: You can still #GetCovered under the ACA. Here’s what you should know before open enrollment begins on 11/1. @AccessHealthCT https://t.co/eKe67eCUaA"]["I'll be questioning AG Sessions at today's Judiciary Committee oversight hearing. Watch here starting at 10am: https://t.co/inMa3VwjRG"]["Instead of again demeaning or denouncing American judges, Pres. Trump should accept this ruling and rescind the order immediately."]["The Trump Administration's unconscionable attempts to discriminate based on religion violate the spirit and letter of our Constitution."]["A federal judge has again saved our nation from a discriminatory, demagogic travel ban. https://t.co/d2mkm9Dhlc"]["Senator McConnell must now bring this healthcare agreement to the Senate Floor for immediate consideration and a vote."]["This agreement is not a long-term answer, but it is a promising step forward after repeated partisan attempts to sabotage healthcare system."]["Extending vital subsidies payments ensures countless Americans will retain healthcare access, despite Trump's attempts to sabotage markets."]["This bipartisan healthcare agreement is a victory for American patients &amp; consumers, showing how we can work together across party lines."]["I won't stop fighting until fellow Americans in Puerto Rico &amp; U.S. Virgin Islands get the aid they desperately need. History is watching."]["@CDCgov @HHSGov Many still w/o clean water. Hospitals rationing supplies. Congress must confront crisis in Puerto Rico &amp; USVI before more lives are lost."]["I am demanding investigation of Admin's faltering Puerto Rico response - a grave concern for many CT families with loved ones on the ground."]["We cannot declare Mission Abandoned while American lives hang in the balance. Robust relief needed now."]["Puerto Rico’s resilience in the face of tragedy is unparalleled. Our federal relief effort should be too. https://t.co/9mPXSlPlZQ"]["It is a deep disservice to Puerto Ricans for the difficult questions being asked of federal relief agencies to continue to go unanswered."]["HHS and CDC must prioritize disease control, prevention, and treatment - to prevent worsening of crisis and allow Puerto Rico to recover."]["Without rapid action to prevent epidemics &amp; stop spread of diseases, treating sick Puerto Ricans will burden an already stressed system."]["Americans deserve to know what CDC and HHS are doing to address faltering Puerto Rico response and forestall unprecedented illness &amp; death."]["More than 1/3 of Puerto Rico lacks clean water. Infectious diseases are spreading. Americans are drinking water from hazardous waste sites."]["Nearly a month after Maria, Puerto Rico is teetering toward a terrifying collapse with deadly consequences. We cannot turn a blind eye."]["@FCC The FCC must reassure Americans that it will not be bullied by the President into abandoning our core First Amendment freedoms."]["I am urging all @FCC commissioners to stand up for our free press and reject Pres. Trump's unacceptable, un-American threats."]["Pres. Trump's recent calls to revoke broadcaster FCC licenses based on speech content are an affront to First Amendment &amp; American values."]["A robust, free press is the cornerstone of our democracy – ensuring public access to news without government meddling or censorship."]["Great to be back in #Groton for christening of 17th Virginia-class submarine - the future USS South Dakota! https://t.co/wvBTgN4UQD"]["Visited Sullivan Senior Ctr. in #Torrington to discuss my bipartisan bill w/ @ChuckGrassley to curb fraud targeting elderly Americans. https://t.co/9B6uWLxJU1"]["This victory for vets could not have happened w/o tireless work of @IAVA, @VFWHQ, &amp; so many others. Proud to stand with you in this fight. https://t.co/BPI8XgpFJj"]["No longer will vets be left high &amp; dry by abrupt for-profit school closures &amp; predatory practices that prevent them from completing degrees."]["New GI Bill means from now on, vets are not beholden to arbitrary 15-year period to use benefits - because education is a lifelong pursuit."]["Joined by veterans &amp; service orgs in #Hartford this morning to discuss vital benefits &amp; protections in recently signed Forever GI Bill. https://t.co/OD74C7WlGr"]["Congress must act immediately to spare Americans from the devastating impact of Trump’s horrific healthcare sabotage."]["Disgraceful that Pres. Trump is undercutting Americans' healthcare in service of misguided, myopic crusade against ACA. Not leadership."]["Brazen and baffling – Trump’s ending of ACA subsidies means higher premiums, destabilized markets, and pain for working families."]["ACA is law of the land. President Trump should work w/ both parties on improvements, instead of using regular Americans as political pawns."]["I urge @DHSGov Inspector Gen. to quickly investigate Trump Admin handling of Puerto Rico relief. No excuse for self-promotion &amp; subterfuge."]["We need full truth about situation in Puerto Rico, not self-promotional videos that sugarcoat catastrophic crisis on the ground."]["Americans need to know whether the Trump Administration is truly focused on helping millions of citizens suffering in Puerto Rico."]["Congress must rescue health care from Trump sabotage. Onward Sens. Alexander &amp; Murray. Bipartisan work is our only hope."]["Mean-spirited, rash, irrational - Trump's ending critical ACA subsidies shreds health care protections and shatters promises."]["Trump's sabotage of ACA seems boundless - a health care tragedy unfolding for countless Americans."]["Must do much more to hold Iran accountable for other malign actions. President has failed to do so. This misstep will make that even harder."]["Nothing changed since President twice notified Congress that preventing a nuclear-armed Iran through agreement was in our national interest."]["Failure to certify Iran Agreement today undermines America’s credibility with allies and jeopardizes ability to hold Iran accountable."]["After emergency relief and rescue, we need long-term Marshall plan crafted by disaster relief czar partnering w/ Puerto Rican leaders."]["Fellow Americans are dying. The island is devastated. Federal efforts are grossly inadequate. A disaster relief czar must take charge."]["Humanitarian crisis, calamity &amp; chaos in Puerto Rico are why I'm demanding a disaster relief czar - to cut through red tape &amp; deliver help."]["Disaster relief czar – appointed by President – vitally necessary to mobilize immediate aid and organize long-term recovery efforts."]["We need disaster relief czar to cut through red tape, work with local leaders, and ensure Puerto Ricans receive essential supplies."]["Puerto Rico deserves a disaster relief czar to coordinate federal response - on the verge of failing millions of fellow Americans."]["Pres. Trump must immediately appoint a disaster relief czar to boost federal relief effort in Puerto Rico and ensure full, robust recovery. https://t.co/xRNwsw4uYF"]["Americans spoke loud and clear: We should strengthen the ACA, not sabotage it. Pres. Trump should listen to them instead of the far right."]["Trump owes us a concerted, bipartisan effort to bolster healthcare system - not a scheme that promises more coverage but delivers far less."]["The Trump admin will stop at nothing to sabotage the Affordable Care Act, no matter how many Americans are hurt. https://t.co/2n9Pgf0Elg"]["Trump's threats to cease active aid for Puerto Rico reflect a double standard of disaster relief. America is about to fail fellow Americans."]["I saw a Puerto Rico struggling w devastation&amp;death in dire need of FEMA, military&amp;federal relief. Mr. President, it's a humanitarian crisis."]["Abandoning Puerto Rico now by withdrawing FEMA would be a betrayal of fellow Americans."]["Congress must provide aid for the millions of Puerto Rican people Trump seems intent on leaving behind."]["Puerto Ricans are AMERICANS, Mr. President. We don’t head for the exits when our fellow citizens are dying."]["Pres. Trump declares Mission Abandoned just as Puerto Rico’s humanitarian crisis intensifies. https://t.co/zzyW4d14VC"]["@ChrisMurphyCT As we mark three weeks since Maria, we must come together and do all we can to end the humanitarian crisis. Puerto Ricans deserve no less."]["Heard directly from constituents with loved ones in Puerto Rico at discussion with @ChrisMurphyCT &amp; State Rep. Rosario in #Bridgeport. https://t.co/nXrhL44cPv"]["Great countries keep their promises. Let's pass the DREAM Act and give every DREAMer the stability and peace of mind they deserve."]["We must pass a clean DREAM Act and unequivocally reject the far right's wish list of heartless immigration priorities."]["Separating DREAMers from America will do lasting damage to the fabric of our nation. We will fight for them, and we will win. #HereToStay"]["This isn't a reality show. Following Pres. Trump's path means ripping families apart &amp; ruining hardworking DREAMers' lives. Not on my watch. https://t.co/cbtC6saSU2"]["Medical oxygen is a life-and-death matter for many Puerto Ricans. We demand @FEMA ensure a steady supply for all who need it. https://t.co/dSPBZcaWsL"]["10 days ago Congress shamefully let FQHC funds lapse, putting patients at risk of service cuts. We must act ASAP to shore up this lifeline."]["Visited Community Health &amp; Wellness Ctr. in #Torrington to hear from staff &amp; patients worried about funding for Fed. Qualified Health Ctrs. https://t.co/14nbClsvEC"]["@EPAScottPruitt I’ll use every tool at my disposal to protect #CleanPowerPlan and resist the Trump admin's dangerous denial of climate science."]["@EPAScottPruitt #CleanPowerPlan would prevent 90k asthma attacks for kids &amp; 3,600 premature deaths each year. Repeal puts polluters before public health."]["Shameful that @EPAScottPruitt has abdicated his responsibility to protect Americans' health &amp; preserve environment for future generations."]["Repealing #CleanPowerPlan is just the latest example of the Trump administration walking away from science and into the arms of polluters."]["The #CleanPowerPlan was a bold step toward curbing carbon emissions, promoting public health, and embracing a clean energy future."]["In the company of heroes at RSVP Veterans Coffeehouse in #Danielson this morning. Grateful for your service and sacrifice. https://t.co/G2g6prUa4m"]["Americans overwhelmingly want to help DREAMers. My GOP colleagues should reject White House divisiveness &amp; join Democrats to pass DREAM Act."]["We must end the cruel chaos that Trump’s #DACA decision has sown - and act now to keep our promise to DREAMers."]["Trump admin’s list of immigration demands is a slap in the face to DREAMers and an affront to the values that make America great."]["We need better coordination – and robust long-term plan – to ensure Puerto Rico gets back on its feet and can rebuild stronger than before."]["If essentials delivery is failing, investigation should be federal, not just local, by FEMA Inspector General &amp; DOJ prosecutors if needed."]["My constituents are right to ask: Why aren't loved ones in Puerto Rico getting the supplies they need? How long must they wait?"]["In third week of humanitarian crisis, essential supply shortages continue to put American lives at risk. Unacceptable and unconscionable."]["Delivery disconnect seems seriously widespread - as I heard in #Hartford today from families who have just arrived from Puerto Rico."]["Essential food, water, and medicine failing to reach people in Puerto Rico - the Governor now acknowledging critical issues."]["More evidence that we are failing our fellow Americans in Puerto Rico. https://t.co/rJFGjFGOvj"]["Held summit @QuinnipiacU on measures we can take to combat sex trafficking, including my bill to hold online enablers accountable. https://t.co/DOsTaNZQtV"]["Spoke to Puerto Rican families who arrived in CT fleeing Maria's devastation about conditions on island &amp; urgent need for more relief aid. https://t.co/Y6UZ4ifBnL"]["Joined @Morning_Joe to discuss the Russia investigation and what should happen next in Puerto Rico. Watch here: https://t.co/EsBQ1GcAIh"]["In #PuertoRico w/ bipartisan group of colleagues to see relief efforts firsthand, meet local officials, and discuss ways Congress can help. https://t.co/pVndHGwtOT"]["Heading to Puerto Rico tomorrow morning to make sure our fellow Americans are getting the help they need. https://t.co/4oQVRWKmpN"]["Joined @SBALinda &amp; @ChrisMurphyCT at #Hartford's @ExpKitchens for a thoughtful roundtable discussion on helping local small business owners. https://t.co/nMyhiA74oR"]["We will not accept that gun violence cannot be stopped. Inaction is inexcusable. Let’s get to work and start saving lives. https://t.co/2hnlXfUGVJ"]["Women deserve the freedom to access cost-free contraception at their own discretion - not at the whim of an employer."]["Gutting ACA contraception mandate is another backward step by an Admin apparently unconcerned w/ women's financial &amp; physical well-being."]["Shameful healthcare sabotage – more hypocrisy from the man who promised “insurance for everybody” https://t.co/W2xRiQCn2k"]["Thanks @ConnAFLCIO for this great honor – and for all you do on behalf of Connecticut’s working families. https://t.co/DVY1PrvRL4"]["The NRA’s proposal for bump stock regulation means more delay, when immediate action is absolutely necessary."]["Lives would have been saved in Las Vegas if no bump stock was sold to the mass murderer - who had an automatic weapon b/c of this device."]["The NRA call for review &amp; regulation of bump stocks is a dangerous, deceptive dodge. Bump stocks should be banned completely - right now."]["Repealing the Protection of Lawful Commerce in Arms Act will unlock the doors of justice and give gun violence victims their day in court."]["I am introducing a bill to repeal the absurd sweetheart deal that blocks victims from seeking legal action against gun manufacturers."]["Unlike virtually all other goods manufacturers, the gun industry cannot be sued by consumers harmed by their products. That is outrageous."]["Hopeful banning bump stocks will be the first of many commonsense steps Congress takes to curb the scourge of gun violence."]["Thursday 10/12 is Passport Day in Bridgeport. Visit my website for info on applications, renewals, &amp; required docs: https://t.co/ft9jffkTnK https://t.co/1yWuZeoMib"]["Honored to meet mail carrier Clinton Parker, a true hero who risked his life to defuse a police standoff. CT is lucky to have you, Clinton! https://t.co/esDQgsj8Hy"]["@SenateCommerce @SenatorWicker Nine kids have died since I intro’d HOT CARS Act in July - nine too many. Let's pass this reform and stop these tragedies before they occur."]["Pleased that @SenateCommerce included my bill with @SenatorWicker to curb child hot car deaths in #AVSTART legislative package."]["@SenFeinstein Hopeful Congress will unite on this commonsense step to rid shelves of killer accelerators like bump stocks. https://t.co/rfK9hVfVWC"]["@SenFeinstein Bump stocks essentially circumvent strict and accepted laws against automatic weapons. What excuse can there be for their continued sale?"]["@SenFeinstein We should be furious that bump stocks - which enable near-automatic rates of fire - are sold in the United States."]["Proud to join @SenFeinstein &amp; many others on bill to ban sale of bump stocks - carnage force multipliers that have no place in our society."]["Joined CNN @NewDay to discuss the tragedy in Las Vegas &amp; new developments in Russia investigation. Watch here: https://t.co/YsMHjKHtz2"]["A harrowing look at reality on the ground in Puerto Rico. https://t.co/Up6BcqTAyI"]["I thank everyone who has spoken up for commonsense gun violence prevention measures. Your voices of reason are more vital than ever."]["Enough of the evasions and euphemisms. Vast majorities of Americans demand action – it’s long past time for Congress to deliver. https://t.co/RnhlUnIChV"]["I will introduce a measure to close the loophole that lets a buyer walk away with a gun if the background check is not complete in 72 hrs."]["We have it in our power to curb gun violence and save lives. It is that simple. Congress is complicit each day it fails to act."]["Divisive and derisive - President Trump’s attitude toward fellow Americans in Puerto Rico is a disservice to ALL Americans. https://t.co/xYdQJ2GFNq"]["No, what’s “out of whack” is leaving millions of American citizens without power, clean water, or fuel for two weeks. https://t.co/optyVTpxI5"]["Life-threatening conditions persist nearly two weeks after Maria. Puerto Rico needs military expertise to turn the tide."]["We cannot grow numb to the nightmare Puerto Rico &amp; USVI are facing. I'll fight for every ounce of relief they deserve - whatever it takes."]["Americans everywhere have rallied behind Puerto Rico. Their inspiring response must be matched with unparalleled federal action."]["Recovering from this crisis requires a long-term Marshall Plan to rebuild Puerto Rico's infrastructure and restore vital networks."]["Catastrophic conditions on the ground putting Puerto Ricans at risk. All available resources must be brought to bear on their behalf."]["We cannot forget the humanitarian crisis facing millions of Americans - on their second week without access to clean water, power or fuel."]["Pressed officials for answers on Puerto Rico/USVI relief during FEMA HQ tour in DC. Grateful for the chance to see relief efforts in action. https://t.co/pzFH67XRJu"]["Mr. President, if this senseless, cruel killing was “pure evil” then please lead to stop it - and 90 more deaths every day."]["We should pray and grieve for victims, and honor them with action - commonsense steps to save others from gun violence."]["Americans are right to be angry at Congress's inaction on gun violence - not just mass shootings, but 90 deaths in our communities each day."]["Nothing has changed since Newtown, and Congress is complicit in this unspeakable slaughter. If not now, when?"]["As Connecticut did at Newtown, we grieve and pray for loved ones - but thoughts and prayers are not enough. We must act."]["My heart breaks with sorrow for Las Vegas, but my stomach churns with anger. I am furious."]["My heart breaks for Las Vegas - prayers to families and loved ones. The nation's conscience must be galvanized."]["When crisis befalls our fellow Americans, count on Connecticut to step up. https://t.co/1X4Ihud1Jo"]["Long road to recovery ahead must unite us. President Trump is dividing Americans by demeaning and denigrating Puerto Rico."]["I'll be visiting FEMA Headquarters in DC tomorrow with colleagues to demand more and better disaster relief."]["Fellow Americans are facing dire need and danger. Response so far shamefully inadequate. https://t.co/Jk4xumDGu9"]["Double standard for disaster relief is unacceptable. Our fellow Americans in Puerto Rico deserve more and better aid."]["So inspired by the incredible resolve of Connecticut's Puerto Rican community. We must all do more to help our fellow Americans recover. https://t.co/dQHQr1XeIx"]["I'll continue fighting for Community Health Centers &amp; CHIP no matter how long it takes. There's nothing red or blue about saving lives. https://t.co/YKVZEqw1Aj"]["If this sabotage continues, the economic price will be tremendous – and loss of life will be inevitable."]["Community health centers are worth their weight in gold, providing care to thousands in Connecticut - including many from Puerto Rico."]["Republicans' inexcusable inaction on health center and CHIP funding endangers a vital healthcare network that has taken years to construct."]["Allowing health center &amp; Children's Health Insurance Program funding to lapse is political malpractice to the point of purposeful neglect."]["Proud to stand with @CTNationalGuard this morning as they deploy to Puerto Rico to support hurricane relief efforts. https://t.co/KnDvkrG2P2"]["Spoke w/ @HispanicFedCT about unfolding crisis in #PuertoRico. Our fellow Americans need not only food &amp; water but long-term aid to rebuild. https://t.co/7o0ul2zoEt"]["I won't stop raising my voice until Puerto Rico and the Virgin Islands receive every bit of the recovery help they sorely need. https://t.co/1fNPTO0UPP"]["We need a long-term Marshall plan to rebuild Puerto Rico's shattered infrastructure &amp; restore quality of life our fellow Americans deserve. https://t.co/9x8yi7qoxK"]["A week after Maria, 90% of Puerto Rico lacks power. 42% have no water. It's long past time to meet this crisis with the action it demands."]["Appointment of Lt. Gen. Buchanan to coordinate Puerto Rico military relief is an encouraging step, but much more must be done."]["I applaud the heroic, Herculean work FEMA and others are doing in Puerto Rico and USVI. Their efforts must be matched by many, many more."]["Supply shortages span Puerto Rico's cities and rural interior, while a lack of drivers and impassable roads worsen a dire situation."]["The anemic, inadequate response to Maria has become a man-made disaster – with food, water, and medical necessities in scarce supply. https://t.co/KtODnujEE9"]["This afternoon I spoke on the Senate Floor for the third time in as many days about a humanitarian crisis affecting millions of Americans."]["A major issue like #TaxReform demands an open, bipartisan process. Instead, GOP wrote it in secret without Democrats - just like healthcare."]["We should focus on proven drivers of economic growth like infrastructure, not a sham #TaxReform plan for people like Trump."]["Unconscionable that GOP #TaxReform plan nixes $1.5 trillion in revenue- equivalent to defunding a decade of veterans’ healthcare &amp; benefits."]["It's time to embrace innovative solutions to America's mass incarceration crisis. It's time to pass the Reverse Mass Incarceration Act. https://t.co/55emOVDIrq"]["In the wake of Equifax breach, Congress must act now to spare Americans from further financial catastrophe. https://t.co/JZx84pVnW6"]["Thank you for helping to ensure this crisis gets the attention it deserves. https://t.co/RMlcQ4GsUR"]["Every single American in Puerto Rico and the Virgin Islands deserves a robust, immediate response. Let’s get to work."]["Our job now is to address both immediate recovery needs and long-term financial peril that continues to put Puerto Rico’s economy at risk."]["I will continue pressing for solutions to Puerto Rico’s financial challenges – a result of unfair tax and healthcare laws."]["Puerto Rico’s debt troubles are no secret, but they cannot impede efforts to help our fellow Americans recover and rebuild."]["Neither Puerto Rico nor the Virgin Islands should be required to match or provide a share of money needed for recovery efforts."]["We must provide the kind of relief that will allow all in hurricanes’ wake not only to endure and survive, but eventually thrive."]["To our fellow citizens in Puerto Rico and the Virgin Islands: You are not alone in this humanitarian crisis. Congress will have your back."]["Follow the money - absolutely right. https://t.co/RyxFxSZk4n"]["Full aid package for those in Maria &amp; Irma's wake must be prepared &amp; passed ASAP. Anything less is an inexcusable insult to our compatriots."]["Appreciate Gen. Dunford’s assurances that @DeptofDefense is ready and able to assist in hurricane relief and recovery efforts."]["All available resources – including military support – must be brought to bear on behalf of Americans suffering in Puerto Rico."]["We cannot avert our eyes from the nightmare our fellow citizens are facing. Puerto Rico needs help - now. https://t.co/enngylEEmd"]["@NARAL #MenForChoice reject #GrahamCassidy and all threats to reproductive health - no matter what form they take."]["Today and always, proud to be one of many #MenForChoice standing with @NARAL in the fight to protect women's reproductive care. https://t.co/OtYNU39WOU"]["Rigorous investigation - both civil and criminal - necessary now, as well as more leadership accountability."]["Resignation does not excuse Smith from answering difficult questions about massive breach on his watch."]["This is no substitute for the accountability consumers deserve. Equifax must fully comply w/ regulatory authorities during transition. https://t.co/92FZPSQvZ9"]["This is a make-or-break moment. #GrahamCassidy's fate will hinge on which side fights hardest this week. Don't let up now."]["We are better than a bill that cuts coverage for millions, slashes Medicaid, and weakens women's health. We are better than #GrahamCassidy."]["Make no mistake: #GrahamCassidy is 100% rotten to the core. Desperate, last-minute giveaways cannot change that."]["With lengthy power outages likely, inaction is inexcusable. Thanks @USCPSC for joining the call for safer portable generators."]["All portable generator sales should include carbon monoxide alarms with battery backup as well as 25-foot extension cords."]["Portable generator manufacturers must implement stronger safety measures for their products – which can emit as much CO as 450 idling cars."]["I am concerned by reports of carbon monoxide deaths &amp; poisonings resulting from portable generators used after recent natural disasters."]["Congress must move swiftly on a robust aid package for Puerto Rico - one that includes urgent relief and long-term recovery support."]["We must provide immediate support for Puerto Rico, where millions face the prospect of prolonged power outages &amp; clean water shortages."]["As our fellow Americans embark on the long road to recovery, we have an obligation to do whatever it takes to help Puerto Rico rebuild."]["The heartbreaking humanitarian crisis facing Puerto Rico after #HurricaneMaria demands more than sympathy and well-wishes. We must act now."]["Keep making your voices heard! Email GCHcomments@finance.senate.gov to get on the record before today's #GrahamCassidy hearing at 2pm. https://t.co/lf6OT7yAw6"]["If Senate Republicans aren't giving up their misguided, misanthropic effort to strip healthcare from millions, we cannot back down."]["This monstrously cruel bill would be catastrophic for real people with real healthcare needs. We cannot abandon efforts to fight it."]["Sen. McCain’s characteristic courage and conviction in rejecting #GrahamCassidy should inspire my colleagues to take a bipartisan approach."]["Without essential health benefit protection, many would lose substance abuse disorder coverage. Another reason to reject #GrahamCassidy."]["Important discussion at UCFS Healthcare in #Norwich on how #GrahamCassidy would jeopardize access to crucial opioid treatment resources. https://t.co/aQ2JNz6JnW"]["Today’s announcement from @BetsyDeVosED systematically undermines critical protections for students under #TitleIX."]["This administration’s stunning insensitivity and indifference to the pervasive problem of campus sexual assault reached a new low today."]["We need a prompt, robust response to Maria's devastation - one that allows Puerto Rico to recover and rebuild stronger than before."]["Held an urgent meeting with Puerto Rican leaders to discuss ways to speed up #HurricaneMaria relief. Your government will not forget you. https://t.co/XhI5oxHe05"]["#GrahamCassidy is an insult to every American who deserves quality, affordable care. That's all of them, by the way."]["Memo to my GOP colleagues: We weren't elected to curtail coverage for millions of our fellow Americans."]["Thanks @PPact for holding the line against this unconscionable healthcare bill. I am proud to stand with you in this fight. https://t.co/wuhyt1vCCi"]["We can’t accept a bill that rolls back #ACA progress and jeopardizes maternity care for millions of women. #GrahamCassidy must go."]["#GrahamCassidy would restrict Medicaid patients from accessing vital care - incl. cancer screenings - at Planned Parenthood health centers."]["Republicans should dump #GrahamCassidy and embrace bipartisanship. If they refuse, we'll fight back every step of the way."]["Americans deserve bipartisan healthcare fixes, not a slap in the face. #GrahamCassidy shouldn't get one vote, let alone a majority."]["The GOP's plot to ram #GrahamCassidy through without a CBO score or regular order tells you everything you need to know about it."]["#GrahamCassidy would bring chaos and confusion to patients at Community Health Centers like the one I visited in #Bridgeport today. https://t.co/Hh7E7HnXm6"]["From community-based care to women's health and the opioid epidemic, #GrahamCassidy's impact would be far-reaching and devastating."]["Today I'm criss-crossing Connecticut to talk with patients, providers, and advocates about the disastrous #GrahamCassidy healthcare bill."]["This is it! Senate Finance Committee needs to hear from you before Monday’s #GrahamCassidy hearing. Email gchcomments@finance.senate.gov"][".@USCPSC decision to move toward banning hazardous flame retardants from furniture and kids' products is a big win for consumer health."]["This is a five-alarm fire. Stopping #GrahamCassidy could not be more urgent or necessary. We must give this fight everything we've got."]["We must do in the next hours &amp; days what we did the last time ACA repeal came up for a vote. Time to resist #GrahamCassidy tooth and nail."]["Millions kicked off insurance. Medicaid eviscerated. Protections for preexisting conditions slashed. That's the future under #GrahamCassidy."]["#GrahamCassidy is the king of mean. It dwarfs anything we have seen in terms of its cruelty to the American people."]["Thanks for everything you are doing to combat the catastrophe that is #GrahamCassidy. https://t.co/uHHkDSqorQ"]["We need a prompt, robust federal response to help Puerto Rico recover from Maria's devastation. Our fellow Americans deserve no less."]["My thoughts are with everyone in Puerto Rico facing down #HurricaneMaria, the second storm to affect the island in as many weeks."]["I'm ready to work on bipartisan healthcare fixes. But I won't heap more worry on families like Conner's, and neither should anyone else."]["We are better than a system that turns its back on kids like Conner and makes families choose between children's health &amp; their finances."]["Could my GOP colleagues explain to Conner's parents why Medicaid funding &amp; protections for kids w/ preexisting conditions should be slashed?"]["As Conner gets older he'll need a compassionate healthcare system to protect him when he's at his most vulnerable. #GrahamCassidy fails him."]["Conner's Duchenne muscular dystrophy will rob him of his ability to run, walk, or hug. As there is no cure, it will likely take his life."]["When I look at #GrahamCassidy, I can’t help but think of 7-year-old Conner Curran of #Ridgefield, Connecticut. https://t.co/DrQFbDNhKC"]["@jimmykimmel I won't stand silently while Republicans seek to strip #healthcare from millions. Connecticut and America deserve better than this disgrace."][".@JimmyKimmel is right. #GrahamCassidy is even more monstrous than the last #healthcare bill. It deserves the same fate."]["#GrahamCassidy would cut hundreds of billions from Medicaid and end protections countless Americans rely on for lifesaving care."]["Without question, #GrahamCassidy is the most extreme proposal we've seen from Republicans in their myopic, misguided #ACA repeal obsession."]["I am horrified that once again, we must fight back against a healthcare bill that would devastate health &amp; finances of countless families."]["Congress is complicit in the scourge of online trafficking if it does not act. Pass #SESTA &amp; deliver long-overdue justice for survivors. https://t.co/oZ2cllMSR1"]["#SESTA will bring much-needed accountability to websites that facilitate, support, or assist in human trafficking."]["We must fix outdated law that denies victims the chance to seek justice against online human trafficking hubs like #Backpage."]["So grateful to Yvonne Ambrose for bravely sharing her daughter's experience. We must curb the scourge that trapped Desiree &amp; many others."]["Proud to have testified in favor of #SESTA at Commerce Committee today. Online sex trafficking survivors deserve their day in court."]["The Senate is holding a hearing on my bill with @senrobportman to curb sex trafficking. Watch live at 10:30am: https://t.co/OVad8wqvjz"]["Millions will suffer if the latest Republican healthcare scheme succeeds. It's time to fight this disaster with everything we've got."]["Americans want Congress to improve the ACA, not rip it to shreds. #GrahamCassidy must be met with the same fierce resistance we saw in July."]["By eliminating Medicaid expansion &amp; attacking Planned Parenthood, #GrahamCassidy is every bit as reckless as the GOP's last healthcare bill."]["New name, same old story. #GrahamCassidy would jeopardize healthcare for millions of Americans - sound familiar? https://t.co/yRFz1DxAbI"]["@USDOT Here is a helpful look at some of the signs common to flood-damaged cars: https://t.co/ZNdj4dYz2H"]["@USDOT Flooded out \"zombie cars\" can be cleaned up to fool buyers, but serious dangers remain. @USDOT must act to avert further tragedy."]["Joined #CT car dealers at #Wethersfield DMV to urge @USDOT to protect consumers from unknowingly buying flood-damaged vehicles. https://t.co/xxZ4AuLoxL"]["Happy birthday to the @USAirForce, estd. as a separate branch 70 years ago today. Thank you to all the brave airmen keeping us safe. #AFBDay"]["That’s why I will be introducing a resolution marking #ConstitutionDay and calling on Americans to reflect on our remarkable heritage."]["#ConstitutionDay reminds us of our ongoing obligation to preserve the gift handed down to us more than two centuries ago."]["The rights &amp; freedoms enshrined in our Constitution have inspired millions, at home &amp; around the world, to take up the fight for freedom."]["On this day 230 years ago, our founders adopted the Constitution - a triumph for liberty that laid the groundwork for American greatness."]["Good reason for growing impatience on both sides of the aisle. Pick up pace, square with Special Counsel. https://t.co/fEZ0pkZsk3"]["@usedgov Students Before Profits Act would shield students from deceptive practices, hold execs accountable for wrongdoing, and save taxpayers money."]["@usedgov Congress must preserve protections for fraud victims and ensure for-profit schools are held to task for past abuses. Put students first."]["Appointing a fmr DeVry dean to police for-profit college fraud at @usedgov makes as much sense as trusting Dracula to guard the blood bank."]["Proposed base closure measure that could threaten SUBASE &amp; CT National Guard is the wrong approach. I stand w/ local leaders in opposition."]["Thanks Nina, Megan, and @DiscoveryEd for the chance to join in your #ConstitutionDay virtual field trip! https://t.co/myqxAnuLJV"]["We are the greatest country on Earth &amp; great countries keep their word. Must pass DREAM Act to do right by Carolina, Alejandra, &amp; many more. https://t.co/NgxPmwBlkL"]["We must keep our word to Alejandra, brought here at age 1 and now a Wesleyan graduate. Ending #DACA would be an unforgivable betrayal."]["The United States should not break the promise it made to Carolina, who works hard, plays by the rules, and gives back."]["At Monday #DACA hearing in CT, I heard harrowing stories of chaos &amp; confusion from DREAMers who trusted America to keep its promise to them."]["Yet another possible Foreign Emoluments Clause violation, underscoring urgent need to hold Trump admin accountable. https://t.co/Oa3T5SMW64"]["Millions of Americans who need and deserve treatment for addiction can’t get it now. Under #MedicareForAll, that will change. https://t.co/vLV8ESKMCQ"]["Medicare was a tremendous achievement. Everyone – no matter where you live or what you make – should have access to it. #MedicareForAll https://t.co/ob3j63zN8M"]["I’ll be talking with my constituents across Connecticut about #MedicareForAll – and I challenge my GOP colleagues to do the same."]["Women in America have been denied care for too long because of Hyde Amendment restrictions. With #MedicareForAll, Hyde is history."]["At a time when the Trump admin seems intent on dismantling reproductive rights, #MedicareForAll would protect women's health."]["For those battling addiction, healthcare access is life and death. #MedicareForAll puts crucial treatment and support services in reach."]["Proud to join @SenSanders in the fight to make quality, affordable care a reality for all Americans. #MedicareForAll https://t.co/OTB8kKdAp8"]["Every American should be able to access healthcare, regardless of where they live or what they make. That's what #MedicareForAll is about."]["It’s time all Americans find the peace of mind seniors have enjoyed for decades. It’s time we pass #MedicareForAll."]["My constituents are right. We must lower costs, expand coverage, and protect patients. With #MedicareForAll, we make progress on all three."]["Edie Windsor was a true pioneer and tireless fighter for equality. Her legacy will live on forever. #LoveIsLove https://t.co/u31PV5kGie"]["As Senate Commerce Committee looks to consider autonomous vehicle legislation, I intend to hold vehicle manufacturers accountable."]["Any manufacturer that wants to put motor vehicles on the road should be required to demonstrate it has implemented robust safety features."]["NHTSA’s updated guidance for driverless cars is a giveaway to the auto industry that will undoubtedly result in unnecessary lives lost."]["Every family in America deserves the security and stability of Medicare. That’s why I support #MedicareForAll. https://t.co/gXb2dfHfLo"]["Proud to announce my support for single-payer #MedicareForAll led by @SenSanders. Let's make healthcare a right, not a luxury."]["Tell Pres. Trump to stand with us against hate &amp; sign our resolution condemning white supremacists &amp; neo-Nazis. https://t.co/x4skoMYViR"]["If the real Donald Trump opposes white supremacists and neo-Nazis (not \"fine people\") he'll sign our resolution denouncing them."]["Is Pres. Trump acting solely in America's interests? When Trump org makes deals like this one, who can say for sure? https://t.co/yzQES0IlYl"]["Honored to amplify your voices in Washington as we fight relentlessly to pass DREAM Act, protect #DACA recipients, &amp; fix immigration system."]["Inspired by powerful voices of DREAMers and families who spoke at today's emergency field hearing - vivid portraits of courage and strength."]["Emergency field hearing in #NewHaven shows deep emotional and economic toll of Trump's cruel, irrational immigration policies. https://t.co/6o6GKdan19"]["My sincere thanks to the city of #Norwalk for hosting a moving September 11 remembrance ceremony this morning."]["We honor the heroes lost 16 years ago today, and we stand with the families of the fallen as one America. Evil will never break our spirit."]["Incredible show of support for 9/11 victims &amp; first responders at this year's CT United Ride - truly Connecticut at its best. #NeverForget https://t.co/lVhSJqNDTc"]["Congress must enact data breach &amp; security legislation ASAP. Only stronger enforcement &amp; penalties will ensure cos. protect consumer data."]["All consumers need to be on high alert and vigilant about checking their credit, banking, and other accounts for potential misuse."]["Breach could impact up to half of all Americans, many of whom have no direct relationship with Equifax &amp; may not know data was compromised."]["FTC must investigate breach to assess whether Equifax did all it could to secure systems given sensitivity of the consumer data it holds."]["No excuse for Equifax’s failure to strengthen its cyber systems after suffering several previous breaches. https://t.co/3V0XHLFCx7"]["CT's voice must be heard in the immigration fight. Join me Monday 9/11 for an emergency field hearing in #NewHaven: https://t.co/mWAmse0dKg https://t.co/l4f0VBfbaf"]["Yet another rightful rejection of Pres. Trump's unconstitutional and unacceptable Muslim travel ban. https://t.co/rztp915Osp"]["@BetsyDeVosED Any approach that does not heed voices of those who lived this issue firsthand is an insult to survivors, students, educators, &amp; parents."][".@BetsyDeVosED must put victims first - by weighing stories, advice, and experiences of assault survivors and advocates."]["We are watching this administration set in motion a process to systematically undermine crucial #TitleIX student protections."]["DeVos #TitleIX announcement is yet another example of Trump admin's stunning insensitivity and indifference to campus sexual assaults."]["Thanks @AmySchumer for speaking out on the need to amend outdated law &amp; hold sex trafficking enablers accountable. https://t.co/Chzi1TsEF8"]["Important look at the haunting landscape of online sex trafficking and why we must act to protect kids. https://t.co/yDXC3psjdY"]["Joined @Morning_Joe to discuss today’s Judiciary Committee meeting with Donald Trump Jr. Watch here: https://t.co/WJsr3EM48q"]["Tonight we demand urgent action to pass the DREAM Act &amp; keep faith with nearly 1M young #DACA recipients - incl. 10k in CT. Watch live: https://t.co/Qb3mlvtCkn"]["We can curb the tragedy of child heatstroke deaths in hot cars. My bill with @SenFranken would do just that. https://t.co/o5G91ufBpP"]["AG Sessions shamefully prejudges courts in declaring #DACA illegal. Wrong on the law, wrong to duck his DOJ duty."]["Sadly self-destructive #DACA decision is an economic nightmare for employers and job creators who depend on DREAMers’ skills and dedication."]["Trump #DACA decision already causing chaos, confusion, and cascading fear - threatening mass deportation on scale never seen before."]["Trump’s sad and outrageous #DACA action should prompt even stronger bipartisan support for DREAM Act – more urgent and necessary than ever."]["No such thing as “orderly wind-down” of #DACA. This despicable decision upends families &amp; derails hundreds of thousands of DREAMers' lives."]["Nearly 1 million young immigrants came out of shadows on promise America would let them stay. #DACA decision betrays them and our values."]["Eliminating #DACA would be the height of hypocrisy and inhumanity. Deliberately cruel and demagogic."]["To preserve American values and promises, l pledge to fight for the DREAM Act - a bipartisan act of simple humanity and common sense."]["Mr. President: There's still time to show America keeps its word. Keep #DACA and the DREAMers."]["Pres. Trump should heed his heart, not his base. As he said just last week, DREAMers are \"terrific\" kids. We \"love\" them. Preserve #DACA!"]["Wonderful sendoff to summer at the #Newtown #LaborDay parade. Great weather and an even better crowd! https://t.co/uxQ37xTgxV"]["Generations of hardworking Americans made this country the envy of the world. Today and every day, we owe them our gratitude. #LaborDay"]["Trump's #DACA order betrays American values and promises to DREAMers. The bipartisan DREAM Act is now urgently necessary."]["Trump ending #DACA is cruel and irrational - doing irreparable harm to DREAMers and America. I will fight for the DREAM Act."]["Always a treat to take part in one of my favorite #LaborDayWeekend traditions: the #Bridgewater tractor parade! Great seeing everyone today. https://t.co/TSJKS0pUcd"]["Slashing funds for ACA awareness sabotages our health care system - showing Trump's true colors. https://t.co/OWpnRvZB2w"]["#DACA recipients have spent their whole lives here. They work hard &amp; give back. Deportation would be cruel, callous &amp; counterproductive."]