["Thank you to @MassStatePolice for standing side by side with our brothers and sisters in #PuertoRico.\n\nToday, I am with the #MA delegation witnessing the resiliency of the Puerto Rican people and learning how we can best get them the long-overdue relief they desperately need. https://t.co/n6VFUR7aHh"]["The unprecedented move to allow #Medicaid work requirements reflects a fundamental misunderstanding of Medicaid’s objectives &amp; the people who rely on it. We should be expanding access to quality, affordable health care, not putting it farther out of reach.\nhttps://t.co/sHExsHYMVE"]["It appears as if the color of money isn’t the only color @realDonaldTrump cares about. These are words of hate and we must condemn them on many sides.\nhttps://t.co/SUY7Mr3TEe"]["This isn’t just un-presidential and un-American, it’s inhumane. @realDonaldTrump’s comments do not represent how most Americans feel.\nhttps://t.co/gKgIz6z2T3"]["We need to strike a balance between liberty and security, not give the government unchecked surveillance power. We should pass the #USARIGHTSAct and require the government to #GetAWarrant before spying on American citizens.\nhttps://t.co/NzqhIo7Hur"]["The INTERDICT Act gives law enforcement the latest tech to detect illicit fentanyl at the border. THIS is the kind of border security we should be investing in, not wasting $18 billion on an ineffective wall that would stand as a symbol of hate.\nhttps://t.co/hsJj3xcxmu"]["We will fight the @FCC’s decision to repeal #NetNeutrality in the halls of Congress and in the courts. And I think we’re going to win.\n \nI joined @Marketplace to discuss my push to restore a free and open Internet. Listen here:\nhttps://t.co/tgYZygAIJW"]["Thank you to my co-authors @nikiinthehouse and @RepBrianFitz, and the bipartisan coalition of lawmakers that supported this bill @SenSherrodBrown, @marcorubio and @SenCapito."]["I am proud to be an author of the bipartisan INTERDICT Act that will give law enforcement the tools they need to intercept illicit fentanyl at our borders. Today, @POTUS signed into law this important measure to battle the #OpioidCrisis.\nhttps://t.co/G7rGY8fEvz"]["Imprisonment of @Reuters reporters for investigating #Rohingya atrocities is a miscarriage of justice. Press freedom is essential for democracy. #Burma should release these reporters. #FreeWaLoneKyawSoeOo.\nhttps://t.co/X42UtEbAb5"]["Children like Dorian in #MA depend on #CHIP to get the care they need to lead long, healthy lives. Americans are tired of waiting on their government to do the right thing – lives are depending on it. Let’s end this waiting game and #FundCHIPNow.\nhttps://t.co/VLgB1bbhbk"][".@EPAScottPruitt likes to pretend there is confusion about the human contribution to #climatechange. Since the science doesn’t back him up, he’s decided to just quietly hide it. But I won’t keep quiet about this censorship of public information. \nhttps://t.co/GJhLGg5DOi"]["#MA’s coastal economy generates tens of billions of dollars each year. If #offshoredrilling is too dangerous for Florida, it’s too dangerous for Mass, and every single mile of coastline that would be opened by the Trump admin’s reckless plan."]["Playing politics with offshore drilling is appalling. @SecretaryZinke, where do other states who don’t want to be threatened with a spill sign up for the same kind of waiver that Florida got with its gator giveaway?\nhttps://t.co/lnE1484lNH"]["A limited strike on #NorthKorea would lead to a catastrophic loss of life. The “bloody nose” strategy would drag America and our allies into a bloody nightmare.  \n\nhttps://t.co/m9puZoedgk"]["High-Speed Internet Activism. #NetNeutrality https://t.co/NJTGuHXe77"]["WATCH: At 6:15pm ET I’ll be on @CNNSitRoom with @wolfblitzer talking #NetNeutrality and #NorthKorea. Tune in!"]["The repeal of #NetNeutrality transforms the Internet from a dynamic, diverse, democratic space into a digital oligarchy controlled by the broadband companies. That’s why we will force a vote on the CRA that will protect a free and open Internet.\nhttps://t.co/Jdmg8TEWJb"]["Thrilled to have the support of @SenatorCollins for my CRA. With her leadership we are on the road to 51! #NetNeutrality.\nhttps://t.co/pySqZqixAm"]["First 30. Now 41. Soon 51.\n\n#NetNeutrality https://t.co/AOOr6fFA3X"]["LIVE NOW: Momentum is building for my CRA to protect #NetNeutrality. My colleagues – 38 of whom have co-sponsored the CRA! – and I are discussing the path forward for restoring a free and open Internet. Watch here: https://t.co/7BGA7TFHRY https://t.co/jqJSEiooXy"]["Notice something missing? Once we force a vote on my CRA, @SenateGOP won’t be able to hide any longer. They will have to choose: side with the overwhelming majority of Americans who want #NetNeutrality, or side with #BigTelecom. https://t.co/R147amcLJ9"]["Energy experts—including the Department of Energy’s own staff—thought @SecretaryPerry's idea to bail out coal plants at the expense of #cleanenergy was a bad idea. Glad to see that FERC agrees. https://t.co/CyxlWmr61G"]["When we vote on my CRA to restore #NetNeutrality, every senator will have to go on record on how they see the Internet: a dynamic, diverse, democratic space that fosters innovation or just another market for massive corporations to control.\n\nhttps://t.co/B8PVfvYHWv"]["Big win in the fight for children’s privacy today. I’ll continue to make this issue a top priority.\nhttps://t.co/wjJJghNWuJ"]["Amazing momentum! @SenBobCasey is the fourth co-sponsor just today of my CRA to restore #NetNeutrality! Together, we will send a message to @realDonaldTrump, @AjitPaiFCC and the broadband companies: the Internet doesn’t belong to you, it belongs to the people. https://t.co/BbcvKK5937"]["The hits keep coming! Thank you @CoryBooker for your support for my CRA to reverse the @FCC’s historic mistake of repealing #NetNeutrality. Next up - a vote to guarantee a free and open Internet! https://t.co/4FCE69LfbX"]["Salvadoran #TPS recipients have lived in the United States for more than 21 years. Ending TPS will devastate hundreds of thousands of #Salvadorans, including more than 6,000 in #MA.\nhttps://t.co/6gWyanSqb9"]["A big step toward restoring a free and open Internet: with the support of @clairecmc, we now have the 30 votes we need to force a vote on my CRA to reverse the repeal of #NetNeutrality! https://t.co/gXtWQmeIJS"]["This is exactly the kind of environmental and public health risk local communities feared when this project was approved. The people of western #MA should not be put at risk by this project. \n\nhttps://t.co/l4CVx3ijjU"]["Thank you to the 28 senators who have joined me in the fight to restore #NetNeutrality by signing on to my CRA.\n \nKeep making your voices heard! Together we can defeat @realDonaldTrump, @AjitPaiFCC and the broadband CEOs and ensure a free and open Internet for all. https://t.co/tzDly69udf"]["The Trump admin weakening safety measures &amp; proposing to open up nearly every mile of America's coasts to #offshoredrilling makes it a question of when &amp; where – not if – another disaster like the #BPOilSpill happens.\n\nI'll use every tool at my disposal to overturn this decision. https://t.co/dRaGEpfWf2"]["We have 110,000 #MA workers in clean energy, almost 2x as many as in 2010. Bay Staters know that’s the future, not fossil fuels. #MA shouldn’t be forced to risk an offshore drilling disaster just to line the pockets of #BigOil barons.\nhttps://t.co/s5GaN7lTTo"]["At 12:30 ET I’ll be joining @mitchellreports on @MSNBC. We’ll discuss @realDonaldTrump’s reckless handling of the #NorthKorea situation, his admin’s opening up of almost all of our coastline for #offshoredrilling, and more."]["TONIGHT: I’ll be on @AC360 on @CNN talking @realDonaldTrump’s reckless #NorthKorea tweets and putting a check on his ability to launch a #nuclear first strike. Tune in."][".@FCC released the final text of the “Restoring Internet Freedom Order” that repeals #NetNeutrality. \n \n@AjitPaiFCC should know that title isn’t fooling us. We know the only way to ensure a free Internet is to restore #NetNeutrality, and that’s exactly what we’re fighting to do."]["To @realDonaldTrump and other climate change deniers: a snowball isn’t proof global warming is a hoax. That snowball might have a rough time in Alaska which is experiencing one of its hottest winters on record. #ClimateChangeIsReal #ActOnClimate https://t.co/psaMoKlMOL"]["@GOP We cannot allow Georges Bank to become Exxon’s bank. I will pursue all legislative tools to fight the Trump administration’s attempt to turn our coasts into fossil fuel free-for-alls and to #ProtectOurCoast. My full statement: https://t.co/oET6nXeMwB"]["@GOP Opening up all of our coastlines to offshore drilling at the expense of our environment and coastal economies is just further confirmation that @GOP really stands for the Gas and Oil Party. #ProtectOurCoast"]["#BigOil just sent a ‘Thank You’ note to @GOP for opening the #ArcticRefuge to oil drilling. Now the Trump admin is sending them a love letter in the form of this offshore drilling plan.\nhttps://t.co/MI2EqiKjlq"]["No family should have to choose between heating their home and paying for food or medicine. With #Blizzard2018 battering the Northeast, the #MA delegation is calling for a release of LIHEAP funds to help low-income Bay Staters pay their energy bills.\nhttps://t.co/qLWcX62d3v"]["For any reason or for no reason at all, @realDonaldTrump could launch a nuclear first strike and no one could stop him. That’s wrong. That’s why @RepTedLieu and I authored a bill to require Congressional authorization before we start a nuclear war.\nhttps://t.co/2HKsvoxiRe"]["Commonsense fuel economy standards are being dismantled because @EPAScottPruitt doesn’t answer to the American people, he answers to #BigOil who is happy to keep polluting as long as they can earn a buck.\nhttps://t.co/jEWPLjEKeE"]["https://t.co/6pqOgSvI1B"]["The @GOP has a simple choice. Pass the #DreamAct and give 800,000 young Americans the safety, dignity and opportunity they deserve. Or side with the forces of intolerance and injustice. #DreamActNow"]["Millions of lives are at stake. @realDonaldTrump must understand that the launching of insults could lead to the launching of nuclear bombs. We cannot let this war of words result in an actual war.\nhttps://t.co/xykg07zf5J"]["Proud to speak at the inauguration of Lynn #MA’s new mayor, Tom McGee. Last night's crowd of residents and state leaders goes to show how excited we are to have a leader for a growing and inclusive 21st century Lynn. https://t.co/xXwQJF9nfT"]["Worried that @realDonaldTrump could launch a #nuclear war? My bill w/ @RepTedLieu would prevent Trump from launching a nuclear first strike. No one person should have the power to decide when the U.S. will be the first to use nuclear weapons. RT if you agree."]["My partner @SenWarren and I want everyone in #MA to know that you can sign up for health coverage until January 23rd. Visit https://t.co/Nr2zUmpAV7 or call 1-877-623-6765 to apply for a plan today! https://t.co/40nIXh96GG"]["We’re up to 29! @SenKamalaHarris just signed on to my effort to reverse the repeal of #NetNeutrality rules! We only need 30 to force a vote on the Senate floor. To @realDonaldTrump, @AjitPaiFCC and the broadband CEOs: we’re not stopping until we #SaveNetNeutrality!"]["If @realDonaldTrump really wants to improve flying for air passengers, why did he eliminate the rule that forced airlines to tell passengers how much those ridiculous baggage fees really cost?  \nhttps://t.co/95GWH3B58K https://t.co/Qjvme1nd4f"]["The votes are there to pass #DACA and fund #CHIP, but @SenateGOP and @realDonaldTrump want to play political games with #DREAMers and children's #healthcare. Let's pass these bills now and stop using our young people as leverage.\nhttps://t.co/C8E57Vsf4V"][".@realDonaldTrump repealed #DACA, not Dems. @GOP keeps blocking the #DREAMAct, not Dems. Republicans are using #DREAMers for leverage, not Dems. The only dream Trump seems to care about is his empty one of a border wall. https://t.co/328UKjaaxF"]["Very proud to swear-in the great @MayorofMedford, Stephanie Muccini Burke! The people of Medford will continue to benefit from her leadership in economic development and growth. https://t.co/V6yrtdaTaY"]["Here is to a safe, peaceful, and joyous 2018. #HappyNewYears https://t.co/6K2QimyIlN"][".@UMassBand is making history today! Watch at 11 ET (ABC, NBC, HGTV) to see them march in the @RoseParade and make many, many Bay Staters very proud. #UMassRoses"]["A glaring omission from this report: any mention of new funding, the #1 thing communities suffering from the #OpioidCrisis need. @realDonaldTrump needs to put his money where his mouth is.\n\nhttps://t.co/9S87OoGpJ6"]["It hasn’t even been 10 years since the #BPoilspill and the Trump administration wants to let #BigOil drill with abandon and without safety measures. We cannot let this speed over safety mentality lead to another disaster. #ProtectOurCoast \n\nhttps://t.co/bcnGW5YmLv"]["We will not trade our #Dreamers for a wall. Period. They are real Americans with real futures that are more important than @realDonaldTrump's ineffective, mean-spirited fantasy. #defendDACA #NoBanNoWall https://t.co/QkO64ayHRP"][".@realDonaldTrump's hot air won't keep anyone warm. 2015, 2016, and 2017 were the 3 hottest years on record. #globalwarming is real. #climatechange is happening now. #MaraLago will be underwater. https://t.co/u7DPXpBd3d"]["In just 3 days, 70 million+ will witness the best of the Commonwealth when @UMassBand marches in the @RoseParade. These @UMassAmherst students are making all of #MA proud. Wish them luck today as they leave for California to make #umassbandhistory. \nhttps://t.co/SEa93QLlnL"]["The #NorthKorea nuclear threat has only increased since @realDonaldTrump took office. This administration needs to find a way to get China to cut off the crude oil flowing into North Korea. The solution is a coherent strategy, not bluster. https://t.co/lmONtyPVlM"]["How despicable. #Haiti was destroyed by hurricanes and a #cholera epidemic introduced by foreigners. They deserve our compassion and support. This President has no heart or shame. https://t.co/Fa88XJowLf"]["The only number that ever mattered to @realDonaldTrump? $11M. That’s how much he’ll personally profit from the #GOPTaxScam. Imagine how much more we'd know if he released his tax returns. #trumptaxes\n\nhttps://t.co/rsWjVR8IUe"]["Chinese crude oil is the lifeblood of the Kim regime. These new sanctions are a positive step, but to force #NorthKorea to the negotiating table and solve the crisis peacefully, we should fully choke off the oil flow. \n\nhttps://t.co/b1uU60wTf1"]["@DOIPressSec @SecretaryZinke @NatlParkService Great. What’s the ETA for them being back up?"]["The Trump administration is so determined to stick their heads in the sand and pretend like the oceans aren’t rising that @SecretaryZinke is now censoring scientists.\nhttps://t.co/iRZLbGw5CS"]["Thank you for your leadership and tireless commitment to solutions for the #opioidepidemic for Middlesex County. https://t.co/C8WAymhpqV"][".@realDonaldTrump should sign the INTERDICT Act ASAP so our law enforcement officers will have the tools they need to fight back against the #opioidcrisis.\nhttps://t.co/AGc1Ge2bP9"][".@DHSgov says in the best-case scenario, this facial scanning program will “only” wrongfully deny 4% of int’l travelers. That could be hundreds of thousands of travelers in 2017 at @BostonLogan ALONE.\nhttps://t.co/rfCaoohTAf"]["This year-end spending package is disgraceful. Congress shouldn’t be rushing to head home for the holidays while leaving #Dreamers out in the cold and the future of #CHIP uncertain. That's why I voted no on the CR."]["Americans shouldn't have to choose between traveling internationally and ensuring the security of their personal data. That’s why @SenMikeLee and I have asked @DHSgov not to expand this program until issues around accuracy and transparency are addressed. https://t.co/2aVxKHj3dB"]["#GoPats! https://t.co/SxYOxTRAX9"]["LIVE NOW: I am on the @DSenFloor demanding Congress immediately pass my INTERDICT Act which will help stop illegal opioids like #fentanyl from flowing across America’s borders. Watch here: https://t.co/7BGA7TFHRY #opioidcrisis https://t.co/qGOUhskNeV"]["My office has received thousands of calls on the #GOPTaxScam.\n \n1.4% in favor\n98.6% OPPOSED\n \nWhen you take the temperature of the American public, it’s clear that they see this bill for what it is: a con job."]["At 11am ET I’ll be on 89.7 FM @BosPublicRadio with @jimbraude and @MargeryEagan talking #NetNeutrality and the #GOPTaxScam. Tune in here: https://t.co/t4JweEWUSm"]["The @GOP and the broadband CEOs won’t be able to block or throttle the millions of Americans who stream to the ballot boxes in 2018. They’ll have to answer for supporting the repeal of #NetNeutrality.\nhttps://t.co/OIOY6pfZqK"][".@US_FDA has finally taken smart action to ban #triclosan for being toxic. This flu season, stick to soap and water.  \nhttps://t.co/zm6A7Hd4Zb"]["The destruction of #Rohingya villages in #Myanmar must stop. I urge @antonioguterres to work with the @UN Security Council to use all the tools available, including targeted sanctions, to hold accountable those responsible for human rights abuses.\nhttps://t.co/ROoBULZAMU"]["9 million children are at immediate risk of losing their #healthcare, and the @GOP’s main concern is passing enormous tax breaks for billionaires. Those are disgraceful priorities. #FundCHIPNow #GOPTaxScam\nhttps://t.co/yQQNOhDTO6"]["The #GOPTaxScam robs Peter, it robs Paul, and it will rob Grandma and Grandpa of #SocialSecurity and #Medicare just to pay for tax breaks for Donald.\nhttps://t.co/FkXvZAYITX"]["I stand with everyone who believes we must protect this most beautiful and special of places on our planet. #ProtectTheArctic https://t.co/dK3oXuI42X"]["Drilling in the #ArcticRefuge would turn this pristine wilderness into an industrialized wasteland. @SenateGOP may have won last night, but we will never stop fighting for this special place. #ProtectTheArctic https://t.co/3DLH5inZj4"]["The #GOPTaxScam is what happens when a party is captured by special interests. This is one big holiday present to @GOP campaign donors."]["In #MA, the #GOPTaxScam will take money from the bottom 40%, give it to the top 1% so that it will… trickle back down to the people who originally had it? WRONG. This scam is going to hurt working and middle class people all across America. https://t.co/4lVbLiGGr1"]["The primary objective of the #GOPTaxScam is wealth consolidation, not job creation. Tax breaks should put money in the pockets of working and middle-class Bay Staters, not the offshore accounts of the richest 1%. https://t.co/UCg6dXRtBT"]["\"We know exactly what Republicans mean when they talk about 'entitlement reform'. They mean taking a machete to the programs that working and middle class Americans rely on.\" #GOPTaxScam"]["\"Republicans are already using future deficits to justify their brutal, vicious cuts to programs for the poorest, sickest, and the neediest in our country.\" #GOPTaxScam"]["\"By 2027, the #GOPTaxScam will raise taxes on over 53 percent of American households. And at the same time, a full 83% of the tax cuts will flow to the top 1% of Americans.\""]["“The American people are waking up to the fact that they have been sold a bill of goods. They are seeing that this plan is simply a Trojan horse full of giveaways to the wealthy, corporations, and Republican political donors.” #GOPTaxScam"]["@DSenFloor \"Republicans are moving ahead with reckless speed to pass this disaster of a bill. So that is why we will be here in a few hours. Yet again voting in the dead of night on a 500 page bill that has had no hearings, no amendments, and has had no real debate.\" #GOPTaxScam"]["LIVE NOW: I’m on the @DSenFloor fighting against the disgraceful #GOPTaxScam that will force hardworking, ordinary Americans to pay for tax breaks for billionaires and massive corporations. Watch here: https://t.co/MHqiUjnrze"]["@MClyburnFCC @SenatorCantwell That’s why I am introducing a Congressional Review Act resolution, with the support of 23 of my @SenateDems colleagues, that will reverse the @FCC’s repeal of #NetNeutrality. We aren’t giving up and neither should you."]["Thank you to @MClyburnFCC and @SenatorCantwell for hosting their Twitter town hall on #NetNeutrality and to all of those who participated. It is clear the American people believe this is a fight worth having."]["The #GOPTaxScam is phase one of a larger con game the @GOP is running. Next up: the evisceration of Medicare, Medicaid and Social Security. When they come for your benefits – and they will – I pledge to fight to protect them.\nhttps://t.co/kKkzPGpgyD"]["@MClyburnFCC @SenatorCantwell How will the repeal of #NetNeutrality impact entrepreneurs and online start-ups that have relied on a free and open internet to get their businesses off the ground?"]["#ClimateChange is one of the top threats to our nation’s security – this is not up for discussion. Working with our allies through the #ParisAgreement would make us safer, stronger and more secure.\nhttps://t.co/g2H23h5Wvy"]["Every day the @SenateGOP refuses to pass a #DACA fix is another day millions of #Dreamers are forced to live in fear of being deported. We must pass the #DreamActNow to protect these young Americans. https://t.co/95FFl2RoRf"]["To all of the victims and families of this horrific #trainderailment in Washington, you are in our prayers and have our deepest condolences. Even if the President forgot to say so. https://t.co/j0gricwnpr"]["@SenateGOP No child or parent should have to put health care on their Christmas wish list. Let’s give families the peace of mind that comes with health care for their children. #FundCHIPNow #CHIPMatters."]["There are 9 million children at risk of losing #healthcare. Congress can prevent that.\n\nThis is not complicated.\n\n@SenateGOP should support immediate funding for the #CHIP program as it negotiates a year-end budget. #FundCHIPNow. #CHIPMatters."]["We are so grateful for everything @BostonChildrens does for our families. #CHIPMatters https://t.co/Ht75MxWPIN"]["“We need to reduce the amount of oxycodone and hydrocodone the DEA approves for manufacture each year and hold Big Pharma accountable for manufacturing a product that is leading to the deaths of hundreds of people every day.\"\nhttps://t.co/R72JyK7Qta"]["Thank you for your leadership in support of a free and open internet, @SenatorHassan! #NetNeutrality https://t.co/PR8gU6lbtY"]["It is outrageous that the #GOP thinks we can afford huge tax breaks for the most profitable corporations on the planet, but not even HALF of what we need to help those suffering from the #opioidcrisis.  \nhttps://t.co/3u2TcWs441"]["We are going to force a vote on the repeal of #NetNeutrality. We cannot allow President Trump, with @AjitPaiFCC and his Republican commissioners to end the internet as we know it. https://t.co/Lv30rDHCuR"]["We need to fight drilling in this special place with everything we’ve got because once the pristine beauty of the #ArcticRefuge is gone, it cannot come back. #ProtectTheArctic\nhttps://t.co/hPCoPhtoOu"]["To the millions of Americans who are speaking out about #NetNeutrality: your voices are being heard. Support for my Congressional Review Act to restore the #OpenInternet is growing in Congress. Proud to have @SenSchumer by my side in this fight. https://t.co/9Q5ckMBVUX"]["We can’t get distracted or @AjitPaiFCC and the broadband CEOs win. Stay focused, stay engaged, spread the word. That’s how we will restore #NetNeutrality"]["Drug addiction isn’t simply a bad choice, it’s a disease. Those suffering from this illness need our help, not our judgment. \nhttps://t.co/6EgKgq208j"]["The people of Massachusetts have never backed down when their liberties are under threat, and they’re not about to start now. #MA https://t.co/gmBnrzInw0"]["Keep making your voices heard! This fight is not over. and it’ll be the millions across this country who stand up and show their support for #NetNeutrality that will make the difference. Spread the word. https://t.co/H7khoPNUxw"]["Some news to celebrate today. @EPA #chemicalsafety nominee Michael #Dourson has withdrawn his nomination. Now, he needs to step down from his advisory role and leave the EPA completely. https://t.co/EhaH2ee9Tq"]["While the broadband CEOs are toasting to the repeal of #NetNeutrality, @RepAnnaEshoo and I are getting ready to file an Amicus Brief. See you in court, @AjitPaiFCC."]["@FCC My fellow @SenateDems will fight the @FCC’s repeal of #NetNeutrality in courts and in the halls of Congress. We will not allow massive broadband corporations to throttle our democracy.\nhttps://t.co/jyhYvFDZzS"]["I plan to introduce a Congressional Review Act resolution that would restore the Open Internet Order and reverse the @FCC’s historic mistake of repealing #NetNeutrality. This fight is far from over. https://t.co/FTyqf1U83X"]["Don’t let @AjitPaiFCC fool you. The ONLY people benefitting from the repeal of #NetNeutrality are massive corporations that are already reaping in enormous profits. They want to end the internet as we know it to create a digital oligarchy that serves the wealthy few."][".@MClyburnFCC is a true champion in the fight to #SaveNetNeutrality. At this morning’s Wake Up Call rally, along with other amazing #digitalcivilrights activists, we sent a message loud and clear to her @FCC colleagues: there will be a price to pay for killing #NetNeutrality https://t.co/eQcwgEE9fj"]["We hope today’s rally is a wake up call to the @FCC that they are on the wrong side of history. #SaveNetNeutrality #digitalcivilrights"]["Thank your for being a leader on #NetNeutrality! https://t.co/clUcP8QL2Y"]["The repeal of #NetNeutrality is an assault on our #digitalcivilrights. This is an issue that will define our times. #SaveNetNeutrality"]["The internet and strong #netneutrality rules are the backbone of Massachusetts's flourishing digital economy. https://t.co/g7tsZV1ONN"]["The @SenateGOP should take a cue from the people of #Alabama and make the right choice: delay any vote on the #GOPTaxScam until @GDouglasJones is seated.\nhttps://t.co/ZD4kD3YC4m"]["We must not let the destruction of the #ArcticRefuge be the legacy we leave for our kids and grandkids. Any #GOPTaxScam that also allows drilling is an unforgivable mistake. #ProtectTheArctic"]["If @AjitPaiFCC ignores the millions of Americans standing up for #NetNeutrality, I pledge to continue this fight to #SaveNetNeutrality."]["NOW SPEAKING: @SenJeffMerkley. Tune in to watch him fight to #SaveNetNeutrality: https://t.co/7BGA7TFHRY"]["The @FCC wants the Broadband Barons to establish their own #NetNeutrality policies. That’s like letting bullies develop their own playground rules. #SaveNetNeutrality"]["NOW SPEAKING: Senator @RonWyden. Tune in to watch him fight to #SaveNetNeutrality: https://t.co/7BGA7TFHRY"]["Imagine a world where a massive corporation could block your trusted news source because it published a critical article. That could happen if @FCC kills #NetNeutrality. This isn’t a left-right issue, it’s a free speech issue. #SaveNetNeutrality"]["Repealing #NetNeutrality is the Trump administration’s latest attempt to put power in the hands of the wealthy few while consumers get a raw deal. We can’t let that happen. #SaveNetNeutrality"]["NOW SPEAKING: @SenWarren. Tune in to watch her fight to #SaveNetNeutrality: https://t.co/7BGA7TFHRY"]["The internet should belong to the people, not massive corporations. RT if you agree. #SaveNetNeutrality"]["NOW SPEAKING: @SenatorLeahy. Tune in to watch him fight to #SaveNetNeutrality: https://t.co/7BGA7TFHRY"]["Rolling back #NetNeutrality will prove that @AjitPaiFCC and Trump’s @FCC serve the Broadband Barons, not the American people who overwhelmingly want to #SaveNetNeutrality."]["It would be a historic mistake if Trump’s @FCC votes to kill #NetNeutrality tomorrow morning. If we are going to #SaveNetNeutrality we need you to make your voices heard TODAY."]["WATCH LIVE: We are less than 24 hours away from @FCC killing #NetNeutrality and dismantling the #OpenInternet. I’m on @DSenFloor with my colleagues fighting to #SaveNetNeutrality. This isn’t over: https://t.co/7BGA7TFHRY https://t.co/V9aQMcF3lF"]["At 12:30pm ET my colleagues and I are taking to @DSenFloor to speak out against @AjitPaiFCC's plan to kill #NetNeutrality and fight to #SaveNetNeutrality. WATCH LIVE HERE: https://t.co/7BGA7TFHRY"]["Welcome to the @USSenate, @GDouglasJones. https://t.co/IHu0tE8ESM"]["To all those in #Alabama who made the calls, knocked on doors, carried the clipboards, got out the vote, and never gave up, America thanks you. Our democracy thanks you. #AlabamaSenate https://t.co/AprIqLY1p4"]["Ending #NetNeutrality will allow massive corporations to smother startups and innovation. If we don’t #SaveNetNeutrality @AjitPaiFCC will turn the internet into a digital oligarchy.\nhttps://t.co/deZZ87EjWB"]["If the @FCC kills #NetNeutrality, the internet will never be the same.\n\nMake your voices heard. We need to #SaveNetNeutrality. https://t.co/YarBPDaQgN"]["The #GOPTaxScam is an assault on our #cleanenergy industries. Here’s our letter demanding removal of the provisions that would threaten thousands of blue-collar jobs: https://t.co/SrX6z6qGSQ"]["If we don’t #StopTheFCC and #SaveNetNeutrality, this is what the internet could look like: https://t.co/KUVtSZ2wln"]["Polluters feel emboldened under the Trump administration because they know the Trump @EPA doesn’t care. Protecting our children from toxic chemicals isn’t about politics, it’s about public safety.\nhttps://t.co/0xVqaMLk1V"]["Thank you to @TheMeganHouse for opening your doors to talk with me and @DAMarianRyan. As we combat the #opioidcrisis, your residential substance abuse treatment program is an inspiration. https://t.co/HAL1QpMZFP"]["The people who built the internet want to #SaveNetNeutrality. To all those working to overturn #NetNeutrality rules, you are on the wrong side of history. \nhttps://t.co/XDo410r303"]["@rapid7 @FCC @AjitPaiFCC \"We are in for this fight. It is a fight worth having.\" #MAnetneutrality"]["@rapid7 @FCC @AjitPaiFCC \"So I urge the @FCC to listen to all those who submitted comments and vote down this harmful proposal. There will be a political price to pay for those who are on the wrong side of history on this issue.\" #MAnetneutrality"]["@rapid7 @FCC \"So, here’s the result of @AjitPaiFCC's plan: broadband providers get exactly what they want: an unregulated broadband marketplace where they make consumers pay more for less.\" #MAnetneutrality"]["@rapid7 @FCC \"What will replace these enforceable #NetNeutrality rules? Nothing. Absolutely nothing will be there in order to protect consumers from greedy corporations looking to take advantage of this new internet Wild West.\" #MAnetneutrality"]["@rapid7 @FCC \"#NetNeutrality serves as the foundation of our tech economy, and any disruption to it could have dire consequences.\" #MAnetneutrality"]["At 10:30AM ET I will be joining @rapid7 and other #MA technology leaders to discuss @FCC’s Thursday vote on #NetNeutrality  and why we need to do everything we can to #SaveNetNeutrality. WATCH LIVE: https://t.co/3wmk2RQNVI"]["A great crowd at @UMassLowell  tonight. Thank you for your questions, and I pledge to work for your priorities in the Senate. https://t.co/dGMgdqWxpb"]["It’s just a bad joke for @realDonaldTrump but fake news has real consequences. #RohingyaCrisis\n\nhttps://t.co/FDRDPylts2"]["Once again, the Trump administration sides with corporations over consumers. My full statement on airline bag fee rule reversal w/ @SenWarren and @SenBlumenthal: https://t.co/ESg07S6MA0"]["Are you buying a holiday airline ticket? This Trump administration decision means you won’t know about hidden airline bag fees.\nhttps://t.co/nOihIw6Jbj"]["JOIN ME: I will be holding a town hall discussion and Q&amp;A in Lowell on Sunday, 12/8. More info here: https://t.co/O704YFnXrt"][".@facebook needs to be completely honest with us on how they will use Messenger Kids to collect our children’s data. \n\n@SenBlumenthal and I want some answers.\n\nhttps://t.co/uECZUKLr4E"]["#NetNeutrality isn't just about streaming speeds, it's about our democracy. We must #StopTheFCC and #SaveNetNeutrality.\nhttps://t.co/AJd4sicvlv"]["The House of Reps. voted to loosen gun restrictions &amp; the @NRA gets what it wants again. It seems no amount of bloodshed will convince these people to do the right thing and support reasonable gun control laws that a vast majority of Americans support.\nhttps://t.co/1kUsLsfKxz"]["Tom has #Alzheimers but he isn’t giving up. And neither should we. We need to #ENDALZ so we can help Tom, his wife Peggy, and the millions like them. Watch him share his powerful story:\nhttps://t.co/WyD1JOgdpY"]["We can and will find a cure to #ENDALZ, but we need to invest in research. The new @USPS #Alzheimers stamp will raise $$ for efforts at @NIH. TY @SenCapito @RepCummings @RepMaxineWaters @VanHollenForMD for your partnership. https://t.co/uBvaUWJi3x"]["If #NetNeutrality rules go away, Internet Service Providers will be allowed to slow down videos like this one or block websites like @VICE with impunity. We need to #SaveNetNeutrality and ensure the internet remains a level playing field.\nhttps://t.co/PhGji6wOXj"]["The (handwritten) ink hasn’t even dried on their tax giveaways to the rich, and the #GOP is already using its fiscal irresponsibility as an excuse to gut #SocialSecurity and #Medicare.\nhttps://t.co/aIaEdMRvca"]["Drilling in the #ArcticRefuge would desecrate the sacred homeland of the Gwich’in Nation to pad Big Oil's bottom line. On this 57th anniversary, I’m proud to stand alongside them and fight to #ProtectTheArctic. https://t.co/qkcI8e1b2B"]["We must support a culture in our workplaces and our entire nation where individuals can come forward, without judgment or reprisal, if they have been subject to inappropriate behavior."]["I join my colleagues in calling for Senator Franken to step aside and resign. Sexual harassment is unacceptable, completely inappropriate and cannot be tolerated."]["With decades of practice, #GOP can legislate corporate and billionaire giveaways with their eyes closed. This time it looks like they literally did. #GOPTaxScam\nhttps://t.co/K0cgvUEXPA"]["@DSenFloor I urge Congress to pass the #DreamActNow and protect the thousands of young people all across our country who want nothing more than to be Americans."]["@DSenFloor \"#Dreamers are our best and brightest and are making the most of the opportunities that the United States has always provided immigrant communities.\" #DreamActNow"]["@DSenFloor \"We should not punish these young people who have no other home than the United States of America. We should not go back on the word we gave when we told these young people to come out of the shadows.\" #DreamActNow"]["#Dreamers are our friends, our neighbors, our loved ones and shouldn’t have to live in fear. The US is their home. I’m about to speak on @DSenFloor to urge Congress to pass the #DreamActNow. WATCH LIVE: https://t.co/H8vuRDEwhC"]["This bill would make getting an education at one of #MA’s world-class colleges and universities unaffordable for too many. We should be working to make advanced education MORE accessible, not putting it further out of reach. #GOPTaxScam"]["The #GOPTaxScam would make grad students foot the bill for tax breaks for the ultra-wealthy. That money should be going toward books, not billionaires.\nhttps://t.co/H73f2MUnY0"]["As you travel to visit family and friends this holiday season, take a moment to think of those who will be denied the chance to spend time with their loved ones as a result of this administration's hateful #TravelBan."]["The #TravelBan is about prejudice, not safety. It should be struck down as unconstitutional before we allow it to further corrode our nation's founding values. #NoWallNoBan #SCOTUS\nhttps://t.co/6iMkjSSr79"]["Thank you @anca_er @anca_dc for honoring me and for your leadership in advocating for the Armenian community, one of America's greatest success stories. I will always be proud to stand with you. https://t.co/rHTXvMfBaA"]["The entire U.S. tax code is being rewritten at 6:30pm on a Friday in crayon 🖍️ #GOPTaxScam https://t.co/DF6mQWAo0V"]["About to join @brikeilarcnn on @CNNSitRoom to discuss the bombshell news about Michael #Flynn and what it means for the #Russia investigation."]["The modern #GOP has a sacred obligation to their donors, to the Koch Brothers, to the massive corporations that help fund their campaigns. They promised them tax breaks, and it will be average working families who end up footing the bill #GOPTaxScam"]["On #WorldAIDSDay we should reflect on our duty to find a cure for this disease and recommit to vital programs like #PEPFAR and the Global Fund to Fight AIDS. The 37m men, women and children living with HIV/AIDS are relying on us to not back away from this challenge. https://t.co/gTlW7JAM9g"]["The #GOPTaxScam doesn’t just affect taxes. It will also gut #Medicare and strip #healthcare away from 13 million Americans. The stakes are too high to get distracted. We need to keep fighting."]["Michael #Flynn in court is big news but let's not forget the Senate is voting TODAY on the #GOPTaxScam that would make working families, students, and the middle class pay for tax breaks for the ultra wealthy and massive corporations. Stay engaged!"]["Joint Committee on Taxation Report: #GOPTaxScam would add $1 trillion to the deficit. This is not a miscalculation, this is by design. Exploding deficits are a key part of the CON GAME Republicans are trying to run on the American people. https://t.co/suZ93j2rUJ"]["Today @SenBennetCO and I secured the 41st cosponsor for our bill to protect the Coastal Plain of the #ArcticRefuge from future drilling – enough to sustain a filibuster. GOP should stop using parliamentary tricks to attempt to ram through this drilling rider in the #GOPTaxScam"]["WATCH: Hidden in the #GOPTaxScam is a corporate giveaway that will allow Big Oil to drill in the #ArcticRefuge – the wildest place left in America. My colleagues and I speak out against the #PolarPayout: https://t.co/nLEhqsfJkt https://t.co/ADVOW99S3m"]["Glitches &amp; snafus should not keep you from enjoying the holidays with family. I’m proud to join @SenBlumenthal in our fight to give passengers the fundamental rights they deserve #FAIRFees #PassengerBillOfRights https://t.co/Iw0zn3rt6B"]["It is a dangerous precedent for the President to legitimize groups that promote violence, racism and xenophobia. Someone needs to tell the President to step away from his smartphone and get serious about the challenges in our country.\nhttps://t.co/IeLfFD005E"]["President Trump’s nominee to lead a key environmental agency denies basic science and has claimed that fossil fuels ended slavery. “Under Ms. Hartnett White, CEQ would no longer stand for the Council on Environmental Quality, it would stand for Crazy Environmental Quackery.” https://t.co/TtocosaCc8"]["Thank you @DADanConley for your leadership and dedication. You will always have an ally in Washington in your efforts to fight crime, curb the opioid crisis and improve the lives of the residents of Suffolk County #MA. https://t.co/k0uaqtWcJj"]["WATCH: I join @publicknowledge for a 1:30pm EST hill briefing to explain the draft net Neutrality Order and answer your questions:\nhttps://t.co/3jNRdlF3Me"]["The sanctions @SenCoryGardner and I proposed will close #NorthKorea for business and bring Pyongyang to the negotiating table for the direct discussions necessary to peacefully denuclearize the Korean Peninsula.\nhttps://t.co/9oBiov6uCr"]["Sanctions without direct negotiations are as empty as the President’s repeated promises to “handle the situation”. #NorthKorea https://t.co/PIm0Okk56v"]["North Korea’s latest missile test reflects the Trump Administration’s failure to craft a coherent strategy. Here is my full statement on North Korea’s launch. https://t.co/O0hkKtzYon"]["In Myanmar, sexual assault is being used as a weapon of war against the Rohingya people. The UN Security Council can – and must – hold accountable those guilty of human rights abuses. https://t.co/4VnY236ZjK"]["3/3 In the season of giving, there is no better gift than the certainty of health care coverage for 9M children across the country. #ExtendCHIP"]["2/3 Without CHIP reauthorization, #MA will run out of funding for CHIP in early 2018, jeopardizing health care coverage for 160,000 children. #ExtendCHIP"]["1/3 It has been 58 days since Republicans let the bipartisan Children’s Health Insurance Program (CHIP) expire. This is legislative malpractice. #ExtendCHIP"]["American citizens in Puerto Rico and the USVI may be on islands, but we must ensure that they are never alone. We need short-term relief and long-term investment for recovery.\nhttps://t.co/KUcDdfhLRx"]["“The only way to protect a free and open internet is with strong net neutrality rules of the road – not voluntary guidelines.” #SaveNetNeutrality"]["“Do we really trust the broadband industry to resist leveraging their internet gatekeeper role and putting their online competitors at an unfair disadvantage? Of course not.” #SaveNetNeutrality"]["“Net neutrality applies the principles of non-discrimination to the internet world, ensuring that broadband providers – America’s internet gatekeepers – do not block, slow-down, or prioritize internet traffic.” #SaveNetNeutrality"]["About to hit @DSenFloor to fight to protect the free and open internet #SaveNetNeutrality. Watch my floor remarks here: https://t.co/hYB2vLlt60"]["WATCH: At 4:30pm I’ll be on the Senate floor on @CSPAN to speak about the importance of #NetNeutrality. Follow along as we live-tweet my statement. #SaveNetNeutrality."]["What @realDonaldTrump said about my partner @SenWarren is a slur. It disparages the Native American war heroes, standing right beside the President, who risked their lives to protect his right to make such a disgusting comment."]["Just like his old boss, @Scaramucci has no respect for the #FirstAmendment. Threatening @TuftsDaily because of its critical coverage is a low blow.\nhttps://t.co/QC3wUICmgk"]["This should go without saying: the leader of the CFPB must be committed to the CFPB’s core mission. Mick Mulvaney thinks it is “a joke”. Consumers deserve so much better and Mulvaney shouldn’t even be in the building."]["The next Cyber Monday may be marred with buffering and blocked websites if the Trump @FCC successfully eliminates #NetNeutrality. Join me in creating a firestorm of opposition #SaveNetNeutrality"]["The free and open internet is essential for innovators, start-ups and other small businesses.  Especially important on #SmallBizSat to call on @FCC to #SaveNetNeutrality"]["Small businesses are the economic engine of Massachusetts and the country.  Celebrate #SmallBizSat and #ShopSmall today!"]["We can't enjoy our smartphones, tablets, and Internet of Things devices we buy on Black Friday without a free and open internet. I'm calling on @FCC to stop their assault on #NetNeutrality.  #SaveNetNeutrality"]["Good news @Patriots fans! CBS and DISH dispute is resolved. Go PATS! https://t.co/rugWo60lzY"]["Today is about gratitude. Thank you @breadmalden for your work and the opportunity to serve those in need. #ThanksgivingDay https://t.co/gjjPhCyzBS"]["From the first Thanksgiving up to today's, there is so much to be thankful for in our Commonwealth. I am so thankful to serve the people of Massachusetts. Have a great Thanksgiving Day!"]["The US must show leadership in our words and our actions to stop these atrocities. #RohingyaCrisis \n https://t.co/KPETeLm3MN"]["Great @nytimestech video explaining how consumers will get hurt by @AjitPaiFCC decision to GUT net neutrality.https://t.co/nwuGpjYHSs"]["We need more competition, not more consolidation in telecommunications. This decision should be about consumers, not politics. https://t.co/RqGEXWdJZM"]["Hero is an overused word. These are heroes. https://t.co/ySOERQdk8a"]["This is the latest in a series of concerning developments that are eroding civil liberties in Turkey. I urge the Government of Turkey to promote tolerance and protect the rights of all of its citizens. #LoveIsLove https://t.co/61hHX4thc9"]["This isn’t just a health care issue, but an economic security issue. MA is yet again leading by example. The Senate should consider legislation I support to undo the president’s birth control roll back https://t.co/oyNvfrpdeB"]["Just in time for Thanksgiving. A big 🦃 #GOPTaxScam will raise taxes on HALF of American families - nothing more than a Trojan Horse for corporate giveaways https://t.co/hsKyp7YlNF"]["My full statement on @AjitPaiFCC decision to gut #NetNeutrality #Resist https://t.co/VODdEsdZ0C"]["For all of those who rely on the free an open internet – whether it’s for commerce, education, healthcare, or entertainment – I urge you to join me in creating a firestorm of opposition to this assault on #NetNeutrality"]["@publicknowledge @FCC It’s #NetNeutrality that ensures that those with the best ideas, not merely the best funded ideas, can thrive in the 21st century economy #SaveNetNeutrality"]["@publicknowledge @FCC The broadband industry can’t regulate themselves. They struggle to even show up on time to install or fix your service. We need #NetNeutrality protections #SaveNetNeutrality"]["@publicknowledge @FCC It’s #NetNeutrality that ensures that those with the best ideas, not merely the best funded ideas, can thrive in the 21st century economy #SaveNetNeutrality"]["@publicknowledge Chairman Pai’s plan would put the internet economy on dial-up. I’m calling on @FCC to #SaveNetNeutrality"]["Trump is waging an all out assault on our core protections: the Affordable Care Act, Paris Climate Accord, Clean Power Plan.  Now Trump’s @FCC has #NetNeutrality in its crosshairs. We must #Resist #SaveNetNeutrality"]["On a call with advocates right now including Chris Lewis from @publicknowledge to talk about how we #Resist Ajit Pai taking a weed whacker to #NetNeutrality"]["@FCC Chairman Pai’s plan would put the internet economy on dial-up. I’m calling on @FCC to #SaveNetNeutrality"]["Trump and @FCC Chairman Ajit Pai are planning to disrupt the hallmark of American innovation and democracy by gutting #NetNeutrality. On December 14th, they will put #NetNeutrality on the chopping block. #Resist #SaveNetNeutrality"]["The @TheJusticeDept should make the case against the @ATT @twxcorp merger through the consumer lens. My full statement https://t.co/1uBSQsbdWe"]["After weeks of urging, pleased to see Univision is back on the air on Verizon’s platform.  Win for viewers and local news.    https://t.co/ajHCu2NXY8"][".@POTUS decision to designate NK a State Sponsor of Terrorism does nothing to hold Pyongyang accountable for its nuclear/ballistic missile programs. Only pressure+direct diplomacy can help us achieve the ultimate goal of peaceful and complete denuclearization of the Peninsula"]["We need an independent and impartial @FCC https://t.co/7GMRl9hfXs"]["210,000 gallons of dirty crude oil spilled across the American plains just days ago. Today, #KeystoneXL was approved by Nebraska. My statement on this injustice https://t.co/XlAiifzI7u"]["The internet – this monumental, diverse, dynamic, democratic platform – is under attack!  @FCC likely this week to release proposal to gut #NetNeutrality We must #Resist #SaveNetNeutrality"]["The Bay State would welcome Old Dominion and the Garden State to #RGGI. Trump may want to withdraw from #ParisAgreement, but states know that like politics, all climate action is local. https://t.co/lGzLdWLAkB"]["#Keystone spill underscores why this pipeline has Americans taking all of the environmental risk, with little reward. #NoKXL https://t.co/Wvbe3EoZGk"]["We must also ensure that people throughout our country can come forward, without judgment or reprisal, if they have been subject to inappropriate behavior."]["Sexual harassment is intolerable, unacceptable and without excuse. We need the Ethics Committee to investigate this incident about Senator Al Franken fully."]["ICYMI: Markey: Fighting Against The 'America Alone' Policy On Climate Change  https://t.co/4Y5HNbstKR via @wgbhnews"]["Very important effort from @DAMarianRyan to combat the #opioidcrisis. Massachusetts continues to be a leader in finding solutions. https://t.co/2fH6zimSDJ"]["My colleagues and I went to #COP23 to say President Trump might turn his back on the Paris #climatechange accord but #WeAreStillIn! VIDEO of our @uscapitol rally: https://t.co/RebZrOos4g"]["About to join @jimbraude @MargeryEagan @wgbhnews to talk #climatechange and my recent trip to #COP23, as well as the latest on #NorthKorea."]["As long as Donald Trump has a Twitter account, the U.S. needs a nuclear #NoFirstUse policy. My bill w @RepTedLieu would put a check on this presidential authority. https://t.co/GtgTPm1eEx"]["I agree with George Shultz. It’s why we will hold the first hearing on the President’s use of nuclear weapons for the first time in 4 decades today https://t.co/N7xx6On84t"]["LIVE at 10am: At Foreign Relations hearing, I’ll be calling for limits on Trump’s authority to launch a #nuclear first strike. https://t.co/5nTsdTHKL9 #NoFirstUse"]["Our brave veterans put their lives on the line for us. We have an obligation to honor them, not just one day out of the year, but every day. #VeteransDay https://t.co/4LOaFdaQeq https://t.co/C0Bkz5oQe0"]["Press conference LIVE NOW from @COP23 w US @SenateDems @SenatorCardin @SenWhitehouse @SenJeffMerkley @SenBrianSchatz and me to say #WeAreStillIn https://t.co/whm2Lo9uEV"]["Great to be here in #Bonn for intl #climatechange negotiations w @SenBrianSchatz and #MA leaders @repjimcantwell @joshcutler. #WeAreStillIn https://t.co/WsWsUSM9Fs"]["What an honor to be inducted into the @BostonABCD Hall of Fame. Together, we can end poverty.   https://t.co/LSLShDQ19j"]["We’ll miss you tonight, but thank you for your hard work for Massachusetts families! https://t.co/Vze0dOqjJn"]["Getting ready to join @wolfblitzer @CNNSitRoom at 6pm to talk economic and diplomatic pressure on #NorthKorea as Trump visits Asia."]["Look forward to joining @mitchellreports @MSNBC at 12:35pm to talk Trump's trip to Asia and utilizing economic pressure, diplomacy and defense to avoid disaster in #NorthKorea."]["We can all agree that there are too many addictive #opioid painkillers being manufactured. My bill will shed light on the secretive process by which #BigPharma gains approval to produce these deadly painkillers. #OpioidEpidemic https://t.co/SfAFE0XqFw https://t.co/WE93RzZTsW"]["#wearealldreamers! Thanks for being fantastic leaders. https://t.co/8GIL5vDzqf"]["@SenCapito Every deaf, blind, and deaf-blind student across the country should have the opportunity to maximize their God-given abilities and succeed."]["@SenCapito More than 100 years after Anne Sullivan Macy taught Helen Keller, we are working to ensure all students today receive the best education."]["Proud to partner w @SenCapito to introduce legislation to improve educ opps for visual and hearing-impaired students https://t.co/MnZLYUiDsT"]["They serve us overseas; we should honor them here at home. Let's pass the #DreamAct and recognize the service of #Dreamers in our military."]["#Dreamers who bravely serve in the US military protect our freedoms every day. We must protect them and pass the #DreamAct. #defendDACA"]["Hundreds of #Dreamers currently serve in our US military. They deserve a real solution. It's time we pass the #DreamAct. #WeAreAllDreamers https://t.co/74CpfDDhqQ"]["Sen. Markey praised for addressing #Longmeadow railroad crossing safety issues (Letters) via @masslive https://t.co/nu5y0ZpJZq"]["My heart goes out to the victims and families of the #texaschurchshooting. Our prayers are w you and the entire First Baptist Church family."]["Our grassroots activists working to ensure a world free of nuclear weapons! https://t.co/MQ9SsHYUUG"]["MUST READ: U.S. Report Says Humans Cause #ClimateChange, Contradicting Top Trump Officials https://t.co/62z5lhfpE6 #ActOnClimate"]["A great visit today at @NECHV in Boston with CEO Andy McCawley and the fantastic staff who care for our vets with compassion and respect. https://t.co/4wh028wTMp"]["TY, Inst. for Advancement of Behavioral Healthcare for hosting today’s Summit for Clinical Excellence. Real leadership on the #opioidcrisis https://t.co/kk4JkUaJie"]["We shouldn't use the #ACA Prevention and Public Health Fund as a piggy bank as it supports critical health programs like child immunizations https://t.co/QZgZEtNsUb"]["21 senators joined me to protect the #ACA's Prevention and Public Health Fund, the nation's largest investment in prevention. #Healthcare https://t.co/KNE7dr6ZuV"]["Thank you for your leadership and support for diplomacy. https://t.co/dX5aDlChiF"]["ICYMI: You can shop and sign up for health insurance plans now at MA @HealthConnector. More information is below. Deadline is January 23. https://t.co/28SVt7QPkJ"]["Ty @ChrisMurphyCT @SenDuckworth @SenJeffMerkley @RepBarbaraLee @PeterWelch @RepJohnConyers for saying no #NorthKorea 1st strike w/o Congress https://t.co/xHQLd6Iky7"]["We’re here to say that Trump MUST come to Congress for authorization before any attack on #NorthKorea. We need #diplomacy not war. #aumf https://t.co/eBFv3Mtqx5"]["LIVE 11:30AM: Join men, @RepJohnConyers @SenMurphy to demand no war in #NorthKorea w/o Congressional authorization https://t.co/9rty1DI5x9"]["Republicans know that opening up the Arctic Refuge isn’t about raising revenue, it’s just a hand out to #BigOil. #protecttherefuge https://t.co/PfHGiAzKSg"]["Open enrollment at #MA @HealthConnector started TODAY! Sign up today and find more information at https://t.co/F09itavXhE #HelpIsHere https://t.co/GbRS11GMKg"]["Safety upgrades at #Longmeadow, MA railroad crossing get support from me, @SenWarren, &amp; @RepRichardNeal. https://t.co/tdcED72bpF"]["Today, I discussed the #Longmeadow crash that killed Warren Cowles at the nomination hearing for Amtrak board member https://t.co/ZrYSqv58vc"]["All of us in Massachusetts stand with the people of New York City after this heinous act of terror. Our prayers and strength are with you."]["The American people stand united w/ #Chechnya’s #LGBTQ community. We will not stop the call for accountability for #HumanRights violations."]["Proud that we passed my resolution w/ @SenToomey condemning the murderous treatment of @Chechnya's #LGBTQ community. https://t.co/dbkQSjHkmZ"]["Congratulations for this historic milestone. Critical work from @MIT / @Harvard's @broadinstitute and @DanaFarber to help beat #breastcancer https://t.co/3h3bf52U57"]["My legislation w/ @RepCartwright ​would help improve America's public health response to #climatechange. https://t.co/NhoU6hNpPF https://t.co/AH9yiWLkVm"]["Tonight, I told Secs Mattis and Tillerson that no one person, incl Trump, should have the sole authority to launch a #nuclear first strike."]["LIVE: I'm asking Tillerson, Mattis if they believe Trump should have authority to launch a #nuclear first strike. https://t.co/5nTsdTHKL9"]["Getting ready to join @CNNSitRoom @wolfblitzer on the #Manafort indictment and the need to protect #MuellerInvestigation from interference."]["About to join @mitchellreports @MSNBC to talk #ManafortIndictment and Special Prosecutor Robert #Mueller investigation into #TrumpRussia."]["Fantastic crowd of hundreds here tonight at my #Pittsfield town hall. The #Berkshires are ready to fight Trump’s dangerous agenda. https://t.co/nLT1H6nzmz"]["Great to be here in the Berkshires. Lots to talk about! https://t.co/Nd9apjJfG7"]["I’m honored to receive this wonderful distinction. Thank you, @BostonABCD for all your efforts to end poverty. https://t.co/7ZvkLEQhXo"]["Join me this Sunday, 10/29 for a town hall discussion in #Pittsfield. Look forward to some great audience questions. https://t.co/zqG2r8Tga1 https://t.co/MlSVoD5ePU"]["Trump's declaration of a public health emergency for the #opioidepidemic is irresponsibly inadequate. We need funding, not a border wall. https://t.co/iNpRx902Eo"]["TY @plough_shares @RepTedLieu @SecDef19 for your leadership in keeping our world safe and secure from #nuclear weapons. #nofirstuse https://t.co/tInFm7Q7N6"]["About to hit @DSenFloor to demand Congress #ExtendCHIP and protect the #healthcare of our nation's children. https://t.co/z30tfNUv9c"]["Thank you @SenBobCasey for your partnership on this legislation to provide real funding for the #opioidcrisis. https://t.co/hoguZ2c5ZG"]["Michael #Dourson has done more for the chemical industry than Mr. Clean. I'm voting NO on his nomination for @EPA #chemsafety. https://t.co/lBDpmdaqP5"]["#Chemsafety nom #Dourson defended safe level of exposure to carcinogen dioxane that is 1,000X greater than @EPA’s health based safety level. https://t.co/MtVXGQyZYO"][".@EPA chem safety nominee Michael Dourson hasn't met a chemical he didn't like. The public's health will pay the price. #ScienceForSale https://t.co/3VG7elmLm4"]["The 2001 #AUMF is not a blank check giving U.S. presidents the sole power  to decide whether, where, and against whom our troops will fight. https://t.co/1RBCierYUi"]["So proud that our great @MassAGO Healey is leading in this fight for #guncontrol. MA has some of the strongest gun safety laws on the books. https://t.co/ApgN8Q1NHl"]["#GOPBudget includes a poison pill to hand over the wildest place left in America to #BigOil. It's fossil fuel folly. https://t.co/pYYysHeIKU"]["Joining @hardball @MSNBCChris to talk #Niger and the need for a national debate on a new Authorization for Use of Military Force (AUMF)."]["Ending TPS for #Haiti would have devastating effects as it rebuilds, worsening the ongoing humanitarian disaster. https://t.co/rzASBAQRpf"]["We must offer compassion to Haitians residing in US as #Haiti rebuilds from natural &amp; man-made disasters. #ExtendTPS https://t.co/rzASBAQRpf"]["Opening the #Arctic Refuge to drilling is nothing more than a handout to #BigOil at the expense of God's creation. https://t.co/GrfcmWmqin"]["The @NYTimes agrees: We need to block the #GOPbudget being voted on today that would open the Arctic Refuge to drilling. #ProtectTheArctic https://t.co/KDPYEuK9CK"]["#GOPbudget contains more than 1 TRILLION in totally unspecified, unallocated cuts over the next decade. Tax cuts do not pay for themselves!"]["The #GOP budget reso is an immoral attack on #Medicare, #Medicaid and the middle class for the benefit of the rich. https://t.co/qRDk3rNfMr"]["New @USGAO report shows how much we need a federal research agenda for #gunviolence. My bill funds @CDCgov to do so. https://t.co/bk6wAMj8Ir"]["Dems slam Arctic drilling plan as 'polar payout' to #BigOil https://t.co/c8Avsa1xvv #ProtectTheArctic"]["Getting ready to join @wolfblitzer @CNNSitRoom to talk #NorthKorea diplomacy and de-escalating tensions, and latest in fight against ISIS."]["Three strikes, and this should be out. Forever. #NoBanNoWall \n\nhttps://t.co/bGVE0REWmM"]["Thank you @SenBennetCO @SenatorCantwell @SenatorTomUdall @SenFranken @SenJeffMerkley @MartinHeinrich for fighting to #protectthearctic. https://t.co/cGylO2QUIm"]["#GOP budget scam to hand over the wildest place left in America to #BigOil should be removed from budget and put on ice. #protectthearctic https://t.co/YIXzpZ1tcW"]["Arctic Refuge is a natural wonder, not a piggy bank to break open to pay for tax cuts for wealthy #NoArcticRider https://t.co/DiTWkw96fv https://t.co/IYco83tFgo"]["Thank you for your leadership, @SenatorCantwell! #NoArcticRider https://t.co/3Hk2b2Lzyd"]["LIVE 11:15am: Join me &amp; @SenBennetCO to say no to drilling in Arctic Refuge in #GOP budget resol. #NoArcticRider https://t.co/3aHSaXHloJ https://t.co/1cOG5O8asd"]["LIVE 11:15am: Join me &amp; @SenBennetCO to say no to drilling in Arctic Refuge in #GOP budget resol. #NoArcticRider https://t.co/9dwV2mCKZq"]["TY to @BCLAW @RappaportCenter for inviting  me to deliver the Dean’s Lecture and talk with the future lawyers who will shape public policy. https://t.co/scQ7dkulyQ"][".@DeptofDefense Sec Mattis &amp; Gen. Dunford have both stated publicly it's undeniably in US national security interest to remain in #IranDeal."]["Decision to decertify #Iran makes it harder for US to build, strengthen multilateral efforts needed to address #nuclear #NorthKorea threat."]["Trump’s refusal to certify Iran compliance w/the #JCPOA only undermines US credibility, isolates us from the world https://t.co/v7E4zb1tcF"]["Great to be w @marty_walsh, @FCC Commissioner @MClyburnFCC, host \n@DebShariff, @BNN_Television Bd Pres Justin Petty to talk digital equality https://t.co/CJMRnWh6yZ"]["Trump &amp; the #GOP couldn't repeal the #ACA, so they're sabotaging #healthcare and dismantling it through exec order. https://t.co/ZVXqXGLuDQ"]["Trump is pulling the rug out from Americans by withholding cost sharing payments, directly resulting in higher premiums. #HealthCareSabotage https://t.co/gclUQ7u1qL"]["Trump's exec order could return us back to a time when an insurance card doesn't guarantee quality health coverage. https://t.co/qb9YDtIX6j"]["Instead of creating certainty for families, Trump exec order will create chaos by sabotaging our #healthcare system https://t.co/V8lBiqV9Jj"]["One of the legacies of the great Senator Ted Kennedy is the #CHIP program. We must #ExtendCHIP to protect this lifeline for #MA families."]["186,000 #MA kids have health care coverage because of the Children's Health Insurance Program. Congress needs to #doitsjob - #ExtendCHIP. https://t.co/mxO0ltGApY"]["The Children’s Health Insurance Program (CHIP) helps ensure 99% of #MA kids and 95% of kids nationally have health coverage. #ExtendCHIP"]["MUST READ. We don't want Trump to use nuclear weapons first in the #NorthKorea standoff - not just there in Korea, but all across the planet https://t.co/PoP0UmrPU0"]["We can and will keep @fema @DeptofDefense &amp; others in #PuertoRico for as long as needed. It's un-American to threaten our citizens this way. https://t.co/WbeCis4kJY"][".@NYTopinion warns: Mr. Trump Alone Can Order a Nuclear Strike. Congress Can Change That. My bill w@RepTedLieu will. https://t.co/yu3NFRnoNN"]["Joining @wolfblitzer @CNNSitRoom at 5pm to talk defusing the #NorthKorea #nuclear crisis. We need leadership and a diplomatic strategy."][".@AjitPaiFCC should publicly refuse to challenge the license of any broadcaster because the President doesn't like their coverage. https://t.co/HPX6t8iX4z"]["It's inappropriate for Trump to propose challenging broadcasters’ licenses because he disagrees w/their coverage. https://t.co/VNl1br3MSF"]["Here's my letter calling on the @FCC to reject Trump threats to revoke the @NBCNews broadcast license or infringe on the #FirstAmendment. https://t.co/2dyUsOF1v6"]["At no point is it appropriate to undermine the #FirstAmendment, Mr. President. That isn't how freedom of the press or the @FCC works. https://t.co/I8kNsblaAE"]["Markey takes aim at gun violence, Trump via @SalemNews https://t.co/jKojMCvRES"]["Thank you for coming and sharing your voice. #Peabody https://t.co/yi4mnZluQJ"]["Having a great discussion tonight in #Peabody at my town hall. Great questions on #GunControl #Healthcare #Immigration and the #opioidcrisis https://t.co/wkVNVp7xZC"]["Glad to be here! #Peabody https://t.co/H9GiAR6wbo"]["My letter today w/colleagues calls on Pres Trump to reduce the risk of war w/#NorthKorea and include prelim talks in his diplomatic strategy https://t.co/iJOolMVgBG"]["President Trump has failed his #climate IQ test with the repeal of the #CleanPowerPlan. https://t.co/YtHWJElsKe #cleanenergy #climatechange"]["Looking forward to my town hall tonight in #Peabody. Doors open at 5:30pm. Find more information here: https://t.co/tBF1l3m9YY https://t.co/u6cJeGB4HB"]["We can defuse tensions and create the conditions necessary for successful negotiations to denuclearize #NorthKorea. https://t.co/zEAwqUPauB"]["We need Trump to immediately implement a sustained US diplomatic campaign to defuse current Korean #nuclear crisis. https://t.co/zEAwqUPauB"]["We must all stand up to Trump and his rhetoric that could lead to #nuclear war w/#NorthKorea. Congress must be the check on his authority. https://t.co/R5zB0dPgcv"][".@nytopinion says Congress must pass my no #nuclear first use bill w/@RepTedLieu to prevent Trump from causing WWIII https://t.co/2AmQzVy9fq"]["Join me tomorrow, Tuesday, Oct. 10 at 6pm for a town hall discussion in Peabody, Mass. You can find more info here: https://t.co/fi5Oc9fYom https://t.co/fCaDDXdhu5"]["Yes. https://t.co/vKXkzuewCR"]["No human being should have sole authority to initiate unprovoked #nuclear war. My bill w/@RepTedLieu would put Pres. Trump’s power in check. https://t.co/LY1E6QpsLX"]["There is no military solution to the #NorthKorea #nuclear threat. War could kill millions. Stop threatening, cut off their oil, negotiate. https://t.co/ZVvyLp6DFN"]["Proud to intro bill to honor Glen Doherty and heroes who died in Libyan consul attack w/the Congressional Gold Medal https://t.co/ofmbngralL"]["Trump contraceptive coverage rollback isn't just an attack on #womenshealth, it's a blow to women’s econ security. https://t.co/PuiuHDjkKu"]["Senate committee unanimously approves bipartisan @SenMarkey @SenToomey #Chechnya #LGBT resolution https://t.co/xEz1LGjRHI via @washblade"]["Thank you @MeghnaWBUR for a timely conversation on Congressional action on #GunControl in the wake of the #LasVegasShooting. https://t.co/W3gqOZGhJ9"]["And thank you for your leadership keeping our water, air and families healthy and safe! https://t.co/CrnUAYQf74"]["Devices like bump stocks are steroids for firearms that are powerful enough. Auto weapons are illegal for a reason. https://t.co/yolOW1y8Ko"]["#Smartgun technology is smart #gunsafety policy. My bill would ensure only authorized users could operate guns. https://t.co/PGq93vDL78"]["Thank you @CleanAirMoms for your work every day protecting the public’s health. Fight on! https://t.co/KHO5km79l2"][".@EPA #chemicalsafety nominee Michael #Dourson hasn't met a chemical he didn't like. He has no business leading this office."]["Dioxane contaminates H20 systems. Water supplies for &gt;7 million in 27 states are contaminated at level higher than @EPA standard. #dourson"][".@EPA #chemicalsafety nominee has spent his career downplaying the health risks of toxic chemicals. #Dourson is bad for public health. https://t.co/aZyVFbsX03"]["Federal investments in scientific research help open up the great mysteries of our universe. #MA is leading the way. https://t.co/f5l5Qibak5"]["A profile in cowardice. #GOP would rather bow to will of the NRA than prevent tragedies like the #LasVegasShooting. https://t.co/7xXrlPFqUt"]["Some say it's too early to discuss legislation on #gunviolence, but it's already too late for the 59 in #LasVegas. https://t.co/TMNjB9gG0D"]["Thank your for your extraordinary leadership. Together, we will #ENDAlz. https://t.co/vSap9wTOYq"]["TY @SenatorCantwell @lisamurkowski @SenCoryGardner @Sen_JoeManchin for  today's ENR hearing on my Fair RATES Act. https://t.co/SiSijzqCFv"]["#Gunviolence is a #publichealth crisis. Will be on the @DSenFloor at 2:15pm to talk about a Tx plan to prevent another #LasVegasShooting"][".@SenCoryGardner and I intro'd expanded #NorthKorea policy &amp; sanctions legislation. We need to isolate Pyongyang. https://t.co/yjlZREdOTM"]["Only malarkey is @DannyTarkanian’s NRA talking points. 92% support #backgroundchecks. #MA has lowest rate of gun deaths in US. #Inners"]["Hey, #Inners! I’ll be on @allinwithchris at 8:15pm to talk about taking action now on #gunviolence in the wake of #LasVegas mass shooting."]["I will be speaking on @SenateDems floor at 5:15pm EST on actions Congress must take in the wake of #LasVegasShooting https://t.co/sJJabKTOMU"][".@fema is encouraging those who are searching for loved ones in #PuertoRico to access @RedCross's Safe &amp; Well site. https://t.co/9NEBh4bue9"]["And once and for all, we need to make NRA stand for “Not Relevant Anymore” in American politics."]["Let's once again ban assault weapons. These are weapons of war and should be used in combat, not in our communities."]["Let’s study #gunviolence like the #publichealth crisis it is and fund the CDC’s budget. https://t.co/jbxUGhSbNS"]["Let’s repeal the Protection of Lawful Commerce in Arms Act (PLCAA) and take away the gun manufacturers’ immunity from civil liability."]["Let’s close the loophole that allows straw purchasers to buy guns and flood our streets with them."]["Let’s close the close the gun show loophole."]["92% of Americans support expanded background checks."]["The epidemic of #gunviolence in our country is not preordained. It is preventable. It is time #GOP stops blocking #guncontrol legislation."]["ENOUGH IS ENOUGH. Americans are tired of living in fear that their community will be the next victim of a mass shooting. #LasVegasShooting"]["I am praying for the victims &amp; their families of the horrific #LasVegasShootings. We all thank the brave first responders for their efforts."]["How about you do what has to be done to help #PuertoRico and let the diplomats negotiate in #NorthKorea to avoid a disaster there. https://t.co/IJE6mUcFue"]["Direct talks w/#NorthKorea are our best chance to freeze missile, #nuclear tests. Leave the bad cop routine in the movies, Mr. President. https://t.co/7t0wSP50Nu"]["Disgraceful and shameful. #PuertoRicoReliefNOW https://t.co/VYowMvwGRJ"]["After months of calling for such talks, I am encourage by news of direct lines of communication w/#NorthKorea. https://t.co/sgmVpepXts"]["First thing Trump should do on Tues when he visits #PuertoRico for the first time since #HurricaneMaria devastated the island is apologize. https://t.co/wYQoHk7Tw6"]["Whether it was the millions who would've lost #healthcare or the millions lost on private flights, #TomPrice put Americans last at @HHSGov."]["We need an @HHSGov Secretary that's going to work to stabilize the #healthcare marketplace, not continue w/doomed #ACA repeal efforts."]["The physical and fiscal health of American taxpayers is better off now that #TomPrice has resigned. https://t.co/BLf5NQkCvJ"]["This is especially important as overdoses from #fentanyl skyrocket. Fentanyl is fueling this epidemic. #OpioidAwareChat https://t.co/IFLCl6NtOH"]["Thank you @NIH for hosting today's #OpioidAwareChat. What can we do to improve data collection on #opioid overdose and deaths? #opioidcrisis"]["On the 40th anniv of #SNAP, our nation thanks @RepMcGovern for his tireless leadership in the fight to end hunger and poverty #SNAPsince77"]["Today, 1 in 10 households in Massaachusetts are food insecure. Food insecurity is still 24% higher than it was a decade ago. #SNAPsince77"]["Only 61% of #MA seniors eligible for #SNAP are enrolled. We must do more to #SolveSeniorHunger. #SNAPmatters #snapsince77"]["We hear you and we thank your for fighting to eradicate poverty and food insecurity. #snapsince77 #SNAPmatters https://t.co/4MVBC2QPvo"]["The elderly are especially vulnerable to food insecurity. Let's protect #snap so we can protect them. #SNAPsince77 https://t.co/vQKFSv9UXp"]["Every community uses #SNAP. It's a bedrock social safety net program. https://t.co/MyBTBOtrai"]["#SNAPmatters. #SNAP helps deliver nutritional assurance to those recovering from a natural disaster. #SNAPsince77 https://t.co/VfzBP2nF4k"]["Happening now: join @RepMcGovern and I for #SNAPsince77 #TwitterChat on 40-year legacy of #SNAP helping families put food on the table."]["Congrats to @JohnKClements, MA Principal of the Year! Students at Nipmuc Regional HS &amp; all of #MA are grateful for your work! #MSSAA #NASSP https://t.co/AFClJASqaX"]["From the #Berkshires to Bozeman, access to #broadband helps spur economic growth and job creation across the nation. #ABetterDeal"]["Proud to join Democrats working ensure that ALL Americans have access to hi-speed #broadband, backbone a 21st century economy. #ABetterDeal https://t.co/iOHWsdJfKI"]["A key component of @SenateDems \"A Better Deal\" economic agenda. https://t.co/Edni39SwFf"]["Heading to @DSenFloor to speak out in opposition to @AjitPaiFCC nom. @FCC needs a leader who supports #NetNeutrality https://t.co/sJJabKTOMU"]["@1199mass are our #healthcare heroes! Thank you for everything you do. https://t.co/xWHr9svAqO"]["⚡️ “Trump isn't telling the truth about his tax plan. So I am.” by @RonWyden\n\nhttps://t.co/nQ1dnzBkts"]["Trillions in tax cuts do NOT pay for themselves. #GOP tax plan means middle class stuck w/bill to create loopholes for wealthy. #TaxReform."]["More of the same from the #GOP on #TaxReform today. Massive giveaways for  the wealthy &amp; corporations, hollow words for the middle class. https://t.co/BAvWiu4e29"]["This is an important read about how we can't let our guard down on efforts to repeal the #ACA. Republicans won't stop attacking #healthcare. https://t.co/pKcsh51TFm"]["Thank you for everything you do for our patients and communities. We will #fixthecliff! https://t.co/QjlApAG4Be"]["I've called on @POTUS to make good on the promise to declare an #opioidepidemic natl emerg. States need help now. https://t.co/CQ2fVTU2wM"][".@WhiteHouse opioid commission meets today, but where's the promised natl emergency declaration on #opioidepidemic? Inaction is unacceptable"]["#PuertoRicans are our sisters &amp; brothers, and it is our moral obligation to provide them immediate help and relief. https://t.co/Zt0Z0AgE1L"]["Things @EPA needs: to make @EPAScottPruitt schedules public, more climate scientists. Not a new secret phone booth. https://t.co/cLwN5Zqpli"]["There are bipartisan #healthcare issues that need immediate attention: funding for  community health centers &amp; reauthorizing #CHIP program."]["#GrahamCassidy might be gone for now, but not for good. As long as we keep fighting, we can keep winning. #DoNoHarm #ProtectOurCare #Resist"]["Joined @SenatorMenendez @SenBooker in calling on leadership to take up legisl ASAP for #PuertoRico and #USVI relief. https://t.co/V8Pxqn79kf"]["Seoul's top diplomat calls for stern but cool-headed approach to #NorthKorea https://t.co/bLTxITwWis via @yonhapnews"]["At Markey roundtable, Mass hospitals implore out-of-state Senators to vote no on Obamacare repeal https://t.co/zCT8gU4tuu via @BosBizJournal"]["We can't allow hurling threats to escalate into hurling bombs. Another Korean war would be catastrophic. #NorthKorea https://t.co/ypOK1K1WrY"]["Great to meet w/S Korean FM Kang to reaffirm strength of US-ROK Alliance, discuss ways to reduce tensions &amp; avoid escalation w/#NorthKorea. https://t.co/d9cxjArfsC"]["#MA is one of the 4 states where @CDCgov is launching this #Rxawareness campaign. More knowledge about Rx opioids can help prevent abuse. https://t.co/K6o6HK7HK1"]["About to join @CNNSitRoom @JimAcostta to talk the latest on de-escalating dangerous rhetoric w/#northkorea and efforts to defeat #trumpcare."][".@SenJohnMcCain's opposition to #GrahamCassidy is good news, but the fight is far from over. We must defeat this heartless #Trumpcare bill."]["#GrahamCassidy is most reckless version of #Trumpcare yet. That's why pretty much all #healthcare groups oppose it. https://t.co/zT355P6XRZ"]["Congrats to #Chelsea for winning RWJF Culture of Health Prize. Innovation in public health is core #MA value. link: https://t.co/udQoUwckhT"]["Tougher sanctions on #NorthKorea need to come alongside direct talks to freeze its nuclear, ballistic missile prog. https://t.co/8FD36nQGwh"]["#PuertoRico has my unconditional support as it recovers from Hurricane #Maria. We must get it the immediate resources it needs to rebuild."]["#GrahamCassidy is #Trumpcare. It has the same cruel policies. It's a zombie #healthcare bill that must be put down. https://t.co/9XVh8UAKhR"]["Getting ready to join @ErinBurnett @OutFrontCNN to discuss how #CassidyGraham #healthcare bill will gut #Medicaid, worsen the #opioidcrisis."]["#CassidyGraham takes a machete to #Medicaid and would worsen #opioidcrisis by taking away basic coverage for treatment. We aren't fooled."]["Right now: on the @DSenFloor talking about the terrible #CassidyGraham #healthcare destruction bill. We cannot let this bill pass."]["Graham-Cassidy would decapitate #Medicaid and cut $8.7 billion in funding to #MA in 2027. We cannot let this bill pass. #Healthcare https://t.co/J2n1jnTD50"]["Thank you to a great #Newton crowd last night at my town hall, w/a shout out to Brennan! We're ready to fight on #Healthcare #climatechange https://t.co/x7nk8S7279"]["TONIGHT: Join me at 6pm in #Newton for a town hall discussion and Q&amp;A. More info: https://t.co/A6HxaY5LLs https://t.co/qPN9sguuoi"]["Honored to celebrate #Boston Harbor Dredging Project, which will help fuel the harbor as an economic engine for the entire region. https://t.co/qIQkmziB3P"]["@SenCoryGardner There is no military solution to the #NorthKorea nuclear threat. Only diplomatic and economic pressure will be effective in avoiding a war."]["@SenCoryGardner We must also immediately talk directly w/#NorthKorea in order to negotiate a freeze of its missile and #nuclear testing."]["@SenCoryGardner We must also impose sanctions on all entities implicated in #NorthKorea labor trafficking. North Korea needs a \"Closed For Business Sign\"."]["My bill w/@SenCoryGardner would increase econ pressure, cut off US financial system to enablers of #NorthKorea. https://t.co/yjlZREdOTM"]["About to join @KateBolduan @CNN to discuss need for new, stronger sanctions from @UN Sec Council to force #NoreaKorea to negotiating table."]["\"Should I spring for the new #iPhoneX, Sir Tim?\" https://t.co/hKZTLYJcVd"]["An amazing mission that @NASA and its team should be proud of. Onwards to new frontiers. #Cassini https://t.co/XO6FfDopWJ"]["We must exhaust every available diplomatic option, incl direct negotiations w/#NorthKorea, to deescalate tensions. https://t.co/RXaS1aC8Wr"]["Headed to @DSenFloor for my #NDAA amend. preventing @POTUS from launching #nuclear 1st strike w/o Congress authoriz. https://t.co/sJJabKTOMU"]["Thank you for your leadership on #cleanair and #climatechange and for your army of red t-shirts! https://t.co/Am3VhdCcj0"]["I'll be w/@RepCartwright @PublicHealth @CleanAirMoms @SierraClub to intro bill on #climatechange &amp; health. LIVE @ 11 https://t.co/nkyobzfE0T"]["Great to meet Haitian Ambassador, former #Malden resident &amp; @BostonCollege grad Paul G. Altidor to discuss extending TPS status for Haitians https://t.co/BwXPaQwM1t"]["Thank you, @SenSanders, for your leadership on #MedicareForAll. The American people deserve the justice &amp; dignity of universal #healthcare."]["#MedicareForAll Act will help ensure all Americans have quality, afford. health insurance. #Healthcare is a right! https://t.co/9j5oWGyWyP"]["Everyone deserves the chance to lead a life free of economic insecurity from  medical emergencies. That's why I support #MedicareForAll."]["Other wealthy countries provide univ health insurance coverage, except the US. That's just wrong. #MedicareForAll https://t.co/rlpl1NmD9S"]["Great to see #climate champion &amp; #MA native Gina McCarthy to talk #cleanercars #climatescience attacks #ClimateAction. We miss you at @EPA! https://t.co/Uvsum2cHvm"]["Great to see our best &amp; brightest from @MMAAdmissions helping w/ #Harveyrelief: MARAD Activation of TS Kennedy https://t.co/WVzPwXUvky"]["I'm a co-sponsor (announced last week). #Healthcare is a right, not a privilege! https://t.co/rqXWvxvBXb"]["The strength of the people of #MA and all Americans sustained us in the aftermath of 9/11 attacks. Today, we honor resilience. #NeverForget"]["Joe DeNucci brought the same tenacity that made him a great fighter to his time as State Rep. and Auditor.  Nobody fought harder than Joe."]["ICYMI: I joined @wgbhnews @jimbraude @MargeryEagan to discuss how war in #NorthKorea would be catastrophic. Tune in: https://t.co/3yIfNUSmzR"]["Thank you for raising your voice to protect clean air and climate action. #DejaReview https://t.co/h4Lg3DKfA9"]["Getting ready to speak on @DSenFloor in support of #DACA #Dreamers &amp; the American Dream. Tune in here: https://t.co/BkAUDX1xAf #DefendDACA"]["On now with @KatyTurNBC @msnbc talking strengthening #northkorea sanctions. We need to get tough with China."]["TY @EnvAm @UCSUSA @SierraClub @steelworkers @MomsAction for your work on #cleancars. We will fight @EPAScottPruitt's rollback! #dejareview"]["Will talk at 8:45am w/ @NewDay @ChrisCuomo about #northkorea #sanctions &amp; what Trump should talk about w/ Xi of China to pressure Pyongyang."]["We will not let Trump's repeal of #DACA stand. There will be a political juggernaut demanding justice for #Dreamers https://t.co/0IKEEWOlZJ https://t.co/VGWhZBlXlr"]["#DREAMers are our brightest and are making the most of opportunities we have always provided immigrant communities. https://t.co/0IKEEWOlZJ"]["Our world-renowned schools are home to #DREAMers who deserve our protection. #DefendDACA https://t.co/veKihxoHpC"]["We will #DefendDACA so that all Dreamers in Massachusetts have the same chance to succeed. #DACAWorks https://t.co/JVfeazwDuP"]["Look forward to joining @MSNBCMorningJoe at 8:40am EST to discuss increasing sanctions, diplomatic solutions for #NorthKorea #nuclear threat"]["Going to be talking w/ @CNNSitRoom @jimsciutto about options to address #northkorea nuclear threat, and passing legislation to #defendDACA."]["TY @BostonUnionCity for a #LaborDay2017 breakfast that celebrated the diversity and power of our workers. #FightFor15 https://t.co/GkSYr9YRFh"]["This group should include @StateDept and Tillerson if there is any commitment to diplomacy and peace in this administration. #NorthKorea https://t.co/Hwzt5YF0M7"]["Look forward to joining tomorrow's @BostonUnionCity #LaborDay breakfast to honor the country's greatest workers &amp; their families #FightFor15"]["We also need urgent shuttle diplomacy to end #NorthKorea #nuclear threat before it erupts into catastrophic war. https://t.co/rcvb4E9ycY"]["We must apply crushing econ pressure to bring #NorthKorea to the negotiating table, incl starving Pyongyang of oil. https://t.co/rcvb4E9ycY"]["More than 800,000 Dreamers deserve our protection. It's time Trump stops threatening their futures. RT if you join me to #DefendDACA"]["Amazing work. So proud. #HarveyRelief https://t.co/FMJUI3fMrq"]["Trump admin should monitor energy mkts &amp; consider further releases from the SPR to combat supply disruptions/gas price spikes. #Harvey"]["We should use all means nec. to protect consumers, including using SPR as a shield, as Gulf recovers from #Harvey\nhttps://t.co/OO6mibQdv1"]["Let’s be clear, Trump’s \"tax plan\" is about ensuring the rich get richer and working families get left behind. #NotOnePenny"]["#Harvey has caused refinery outages &amp; spikes in gas prices. I'm calling on Trump to tap the SPR to protect consumers https://t.co/2qoM8w4yeV https://t.co/H7jUI6USoH"]["War talking is not the answer. Tough negotiations w/increased sanctions is, including cutting off oil to #NorthKorea https://t.co/6Z3VRa2M9Y https://t.co/IJbK6sDkK4"]["Elimination of this critical position is 1 more example of Trump admin ceding #climate &amp; #cleanenergy leadership to China &amp; Germany. (2/3)"]["The Special Envoy for #climatechange was established to ensure American leadership on #climateaction &amp; our #cleanenergy future. (1/3)"]["I just returned from #NorthKorea-China border. It's time to cut off oil, impose tough, new sanctions. Full statement https://t.co/6Z3VRa2M9Y"]["At the same time Trump must stop spoiling for a fight and negotiate an immediate freeze on #NorthKorea's nuclear &amp; ballistic missile testing"]["Missile test &amp; prep for 6th nuclear test shows need for intl comm to apply econ pressure nec. to bring #NorthKorea back to negotiating table"]["Now is the time for @UN Security Council to pass &amp; US, China, Russia &amp; the entire community of nations to enforce, tough new sanctions to: https://t.co/gPGEif0LMK"]["We must exhaust every peaceful option before Trump puts “all options on the table” &amp; considers launching a preventive war. #NorthKorea"]["This catastrophe is far from over &amp; we must secure the safety of the people of Houston &amp; all areas of TX &amp; LA impacted by #HurricaneHarvey. https://t.co/XlNrT7UR7A"]["The focus right now must be to work together - at the local, state and federal levels - to save lives. #HurricaneHarvey"]["There's no military solution to a #nuclear #NorthKorea. We must immediately &amp; directly negotiate w/ Pyongyang ➡️ https://t.co/qo3qQtq9eL"]["I’m incredibly proud of Boston &amp; the entire Commonwealth for stepping up to help the people of greater #Houston https://t.co/2NwEzGQYTy"]["My bill with @tedlieu would restrict President Trump's ability to launch a #nuclear first strike. Watch Rep. Lieu explain it all here ↓ https://t.co/SAzR4bI0pk"]["#NorthKorea missile launch underscores why we must counter provocations w/diplomacy. There is no military solution.  https://t.co/MHsdOWgq9q"]["Cowardly and without conscience. There's no excuse for this disregard for rule of law and utter disregard for the emergency our nation faces https://t.co/0Fo3RvoHcT"]["Trump thinks #LGBT stands for Let's Go Back in Time. But we will move forward &amp; demand equality. We honor all those who choose to serve. https://t.co/5K2YgVxaB7"]["There should be no political interference with federal #climatechange research. We need #ScienceNotSilence. https://t.co/xGL31Y1MCZ"]["Let's raise our voices for the young people seeking a better future for themselves and their families. #DefendDACA https://t.co/D1OeXqwap3"]["My bill, the INTERDICT Act, will give our 1st responders the tools they need to fight the #fentanyl epidemic\nhttps://t.co/ryqkxP8fAj"]["#NewEngland #RGGI continues to lead the US w/new goal to cut carbon emissions by 30% btwn 2020-2030. #ActOnClimate https://t.co/MmKanmA4dL"]["I met with Korean Foreign Minister Kang (@UMassAmherst alum alert) to discuss how best to pursue diplomacy with #NorthKorea. https://t.co/GN79HAQG4F"]["Thanks to US Ambassador to Japan Bill Hagerty @usembassytokyo for hosting our congressional delegation in #Tokyo. https://t.co/DN6C1rgVWT"]["I was proud to meet @usairforce Airman Harrington of #Ludlow, Patrick McEleney of #Arlington &amp; Lt. Gen. Jerry Martinez in Yokota, Japan. https://t.co/IlkBuxF2d8"]["Memorable visit to the DMZ between North &amp; South Korea. The soldier peering in the window is North Korean. https://t.co/10RwBY86PO"]["#Pilgrim Nuclear Power Plant has 1 of the worst safety records of any nuclear facility in the U.S. via @BostonGlobe\nhttps://t.co/SjOwseA8xk"]["I spoke w/ officials in SKorea about how preventive war won't solve #NorthKorea problem &amp; would make matters worse\nhttps://t.co/CSStJKwxr1"]["Because of the availability of menthol cigarettes, 9 million Americans will start smoking between 2010-2050. It's time to ban menthols."]["#BigTobacco’s marketing continues to disproportionately target African Americans who suffer greatest burden of tobacco-related deaths"]["Menthol cigarettes pose a public health risk above regular/non-menthol cigarettes. We're pushing @US_FDA to ban them https://t.co/3bfr9Xud0v https://t.co/9dMT6o11bW"]["Mountain top removal mining threatens pollutes water, threatens communities &amp; harms health  #ScienceNotSilence #MTR https://t.co/g7yhrq7B3A"]