["As they say, \"an ounce of prevention is worth a pound of cure.\" A little extra planning (combined with prudent, targeted investments) can go a long way in saving both lives and taxpayers dollars when disaster strikes. https://t.co/PrJs5v5pZw"]["Delaware may only have 28 miles of coastline compared to Florida's 1,350 miles, but our state's beautiful beaches generate $6.9 billion each year and support 10% of our workforce. Any oil spill—\"large\" or \"small\"—would devastate our state. #ProtectOurCoast https://t.co/OPSX57gCLf"]["As head of the Texas commission on environmental quality, Kathleen Hartnett White relied so heavily on her extreme views that she failed to ensure safe drinking water for millions. She is unfit to serve as the top environmental adviser in the White House. https://t.co/ZUwYbpfWcY"]["Over 99% of our country's overseas trade volume moves through coastal channels that the Corps maintains. The Corps' inland waterways and locks form a freight network—think of it as a water highway—connecting waterways and ports and providing direct access to international markets"]["When it comes to our economic security, we need to make big, bold and smart investments in port-related infrastructure over the next decade. That's a main focus of today's EPW hearing on \"America's Water Infrastructure Needs and Challenges.\" My statement: https://t.co/6a7tD6u8mv"]["It's clearly not a matter of \"if\" the next extreme weather event is coming. It's a matter of \"when.\" https://t.co/54JOyVazPP"]["As the 2017 hurricane season illustrated, our country needs to be resilient and ready for the next storm or flood or drought. Just this week, @NOAA announced that in 2017, the total costs for extreme weather and climate events exceeded $300 billion. https://t.co/kCbxQnfjD6"]["Mr. Secretary, Delaware is home to five-star beaches and a thriving tourism industry that's a linchpin of our economy. Delawareans deserve their voices to be heard, too. https://t.co/aIAuLJ6gsP"]["Having Delaware’s neighboring Senator, @SenatorCardin, as a partner on EPW is a joy, but getting to work with both Maryland Senators to protect our shared backyard – and that of every American - is truly a gift. Glad to welcome @Chrisvanhollen to @EPWDems! https://t.co/nLgjpJXoj0"]["While the @EPA refuses to hold any public forums on the East Coast about its proposed #CleanPowerPlan repeal, earlier today I teamed up with Governor @JohnCarneyDE and DNREC Secretary Garvin to listen to Delawareans' real concerns about the EPA's proposal. https://t.co/XCKhoZUOrt"]["Ms. White’s disdain for science and basic facts poses a threat to the health of our environment and the American people. @POTUS's decision to resubmit her name to head CEQ is shortsighted, irresponsible and, I believe, will be a mistake. https://t.co/ryIgqcm1R4"]["I often say that true leaders do the right thing, not what is easy or expedient. Withdrawing Kathleen Hartnett White's nomination would have been one of the rare times a decision could be all three, but the Trump Administration refused. Well, they should expect a fight."]["For 100 days, millions of families have been facing uncertainty and waiting in desperation for Congress to #ExtendCHIP. They're counting on us to do what's right. #FundCHIPNow."]["The El Salvadorans living in the U.S. under Temporary Protected Status are contributing members of our communities. This decision will force them to live in the shadows. https://t.co/Ou0MehIRCK"]["The Trump administration's decision to end TPS for El Salvador breaks with our country's moral obligation to care for our neighbors who desperately need our help and safe refuge. https://t.co/OXeyf3M3yP"]["Time to donate! #Giveblood #netde #kentde https://t.co/Su6yZnSq1B"]["The Trump Administration's decision to open nearly all U.S. waters, including the Atlantic, to more oil and gas drilling while it attempts to weaken drilling regulations is shortsighted and unnecessary. https://t.co/XjtY0lZL4e"]["A #snowday can be tough for working parents, but getting to have Jack and Emma in our office today puts a pep in my step! https://t.co/NfhvntW2Mw"]["Democrats &amp; Republicans should be working together to renew the Voting Rights Act, to hold Russia accountable for its actions in the 2016 presidential election &amp; to protect our electoral system from cyber attacks—not entertaining dangerous falsehoods about widespread voter fraud."]["Taxpayer dollars shouldn't be spent probing baseless and politically-motivated claims of voter fraud. I'm glad this commission has been disbanded. https://t.co/aXwpNVig5B"]["Joining @PoppyHarlowCNN and @JohnBerman on @CNNnewsroom in just a few minutes—tune in!"]["The Senate is back in session today. Millions of families are counting on us to pass long-term funding solutions for #CHIP, and nearly 800,000 young men and women are counting on us to act with common sense and common decency to renew #DACA.\n\nLet's get to work."]["@EPA @EPAScottPruitt But while @EPA refuses to act, I'm proud that the state of Delaware is fighting to protect the residents of our state from dangerous, out-of-state air pollution https://t.co/vSN8dzDAVt"]["@EPA We know that air pollution doesn't respect state borders. @EPAScottPruitt should heed his own advice and allow downwind states to address harmful upwind pollution. https://t.co/VZ5Cpv38Bf"][".@EPA Administrator Scott Pruitt likes to say that the states know best. But he's been denying 18 states' request to work together to reduce regional #ozone pollution."]["I'm hopeful that the president's interest in USPS finances brings much-needed attention on this essential American service. If we don't do postal reform now, USPS will continue to twist in the wind and struggle to adjust to the new realities it faces."]["https://t.co/Ww1GIufWZP"]["We need answers. #ScienceNotSilence https://t.co/xaEK3Mid1f"]["Special Counsel Bob Mueller is working to uncover the truth. The American people need to know the truth. Special Counsel Mueller and the team he's leading must be able to complete their investigation. https://t.co/FJzT8D48AS"]["While some of my colleagues celebrate their #GOPTaxBill \"victory,\" families across the country are trying to figure out how to make ends meet with #CHIPFunding in jeopardy. https://t.co/OPBAzStZtp"]["It's been 82 days since #CHIPFunding expired. Unless funding is restored, 8,300 children in Delaware will lose their health coverage on January 31. Inaction is inexcusable—we must #FundCHIPNow. https://t.co/p26qEQhhID"]["Narrator: The GOP was never called the \"party of fiscal responsibility\" again https://t.co/ADTxd5EKpF"]["Still waiting for President Trump to explain how letting funding for #CHIP and health centers expire fits into his vision of greater and less expensive health care for all Americans. https://t.co/wLMiyfk87a"]["During economic downturns, wars or national calamities, deficit spending makes sense. But 8 years into the largest economic expansion in U.S. history, spending $1.5 trillion on tax cuts that disproportionately advantage the wealthy just doesn't make sense. https://t.co/ahXH1UrIB1"]["Parents are begging Congress to do the right thing on #CHIP. The thing is, they shouldn't have to beg. We shouldn't let them beg. We should #ExtendCHIP now. https://t.co/SNBcu5sU7A"]["The #GOPTaxBill is grossly unfair.  https://t.co/FN7FYyzPvI"]["The #GOPTaxScam provides permanent tax cuts for corporations and lacks the necessary guardrails to actually stop and prevent the offshoring of American jobs. It's not the type of tax reform Americans want or need. https://t.co/7zZhlgUSpr"]["I will object to any agreement that allows Ms. White's nomination to be held over into the second session of the 115th Congress. Let's start the new year off with a clean slate and allow @POTUS the opportunity to nominate a qualified leader for CEQ. https://t.co/mob11Sgnqd"]["Traditionally, the Senate allows unconfirmed nominations to roll over into the second session of a congress. But Kathleen Hartnett White's views are too extreme and her disrespect for science and our environmental laws is a danger to public health."]["President Trump made an assurance to the American people that the #GOPTaxPlan wouldn't further enrich the wealthiest people in our country, people like him. But the #GOPTaxPlan does indeed enrich people like him. https://t.co/H364IwpZ5N"]["In Delaware, nearly 96,000 households making less than $85,530 would face a tax hike in 2027. #GOPTaxScam #netDE https://t.co/rbrsWFRFqp"]["While Republicans focus on getting their #GOPTaxBill across the finish line at any cost, several bipartisan priorities are awaiting Congress's immediate attention and action.\nhttps://t.co/GnIkEmkyKX"]["12,762.\n\nThese young men and women know no other home than the United States. Ensuring that they may come out of the shadows to study, work and live their lives is simply common sense. More important, it's common decency. #DreamActNOW https://t.co/zcSQAtX0Qm"]["As more jobs go overseas and more corporate profits shift overseas, Americans will look back at this moment in time—at this process in Congress—and they will know who is to blame. #GOPTaxScam https://t.co/JNnGz4m5oZ"]["Yesterday @POTUS said China was our \"strategic competitor\" in the global economy. So why are we allowing China to out-innovate the U.S. to #ActOnClimate? https://t.co/KnPZI5O2AB"]["According to the National Education Association, the #GOPTaxPlan puts $15.2 billion in annual public school spending ($304 per student) at risk. https://t.co/pOSkVuFpTr"]["4️⃣ The #GOPTaxPlan has a price tag of $1.5 trillion. Couple that with the interest the federal government will owe on the money it has to borrow to pay for these tax cuts, and the price tag exceeds $2 trillion over the next 10 years. \n\nIt's an affront to fiscal responsibility."]["3️⃣ The #GOPTaxPlan does not simplify the tax code. Additional complexity results from the enormous new \"fiscal cliff\" created by the expiration of its individual provisions in 2025, which will make tax policy unpredictable for families. https://t.co/AqGbpANaQO"]["1️⃣ The #GOPTaxPlan's corporate tax cuts are permanent, while its individual provisions expire by 2025. By 2027, Americans making $75,000 or less will actually see their taxes go up. How is that fair?"]["I look at any tax proposal through a prism of 4️⃣ questions:\n\n1️⃣ Is it fair?\n2️⃣ Does it foster economic growth and job creation?\n3️⃣ Does it simplify the tax code, or make it more complicated?\n4️⃣ Is it fiscally responsible?\n\nThe #GOPTaxPlan fails each of those tests."]["Any $1.5 trillion tax bill that's purely partisan, written in the dark and rushed to the finish line is bound to be poorly designed and riddled with inadvertent errors. (Reminder: it doesn’t have to be this way.) https://t.co/olv4WaPzeH"]["We already had a plan to reduce carbon pollution that was supported by states, cities, businesses and utilities—the #CleanPowerPlan.\n\nThis move by @EPA just delays action on #ClimateChange and puts public health and our planet at risk in the meantime. https://t.co/y6BGj6wD0F"]["As I do nearly every day, I rode on an Amtrak train from Wilmington to Washington, D.C. just this afternoon. I'm praying for all the victims of the train derailment in Washington, and I'm closely monitoring developments."]["I'm asking @EPA's Inspector General to investigate Administrator Scott Pruitt's $40,000 trip abroad. Taxpayers should know why Administrator Pruitt traveled to Morocco to talk about natural gas exports—an issue EPA doesn't even oversee. https://t.co/YWnyv5co9X"]["President Trump may not recognize #climatechange as a national security threat, but you know who does? \n\n@DeptofDefense.\n@USArmy.\n@USNavy.\n@USGAO.\n@NASA.\nhttps://t.co/UF9t45uQfD"]["Vulnerable. \nEntitlement. \nDiversity. \nTransgender. \nFetus. \nEvidence-based. \nScience-based.\n\nThese words are banned from budget documents at our country’s top public health agency. This is beyond all reason. This is dangerous.\n\nhttps://t.co/YdUiX3dDiH"]["If you’re put on hold trying to #GetCovered, stay on the line until you speak with a representative! https://t.co/ov3oLN1A2T"]["Delaware is one of 16 states expected to run out of money to fund #CHIP by the end of January 2018. Thousands of Delawarean children, and millions more across the country, are counting on Congress to #FundCHIPNow. https://t.co/N7YukpH4l7"]["RETWEET to spread the word that 🚨 TODAY IS THE LAST DAY TO #GetCovered 🚨\n\nSign up for health coverage for 2018 at https://t.co/oownXhfFse or https://t.co/jQfaHDmT4x https://t.co/3p7BffKE5t"]["Delawareans, today is the LAST DAY of #OpenEnrollment for 2018. Find the right health care plan for you and #GetCovered on https://t.co/jRkgFwK9Ka! https://t.co/omxk3o5pvZ"]["We're asking the administration to help make sure that everyone who wants to #GetCovered for 2018 has the opportunity to do just that. https://t.co/447vABpYCi"]["Five years after the unthinkable tragedy at Sandy Hook Elementary School, we continue to mourn the lives lost that day, and pray for their families, friends and neighbors. But we cannot stop there—we must #HonorWithAction to #EndGunViolence. https://t.co/TkIdr5lC2j"]["I urge my Republican colleagues to listen to the American people, stop rushing ahead with this #GOPTaxScam and work with Democrats to #RenewCHIP instead. https://t.co/XUSvycIK2t"]["@EPA The withdrawal of #Dourson's nomination should serve as a lesson to the Senate - and an opportunity work together to find an independent, credible chemical safety regulator to protect our public health and lead implementation of bipartisan #TSCA reforms."]["An individual who spent his career advocating less protective chemical safety standards had no business leading @EPA's Chemical Safety office. The withdrawal of Michael #Dourson's nomination is in the best interest of all Americans. https://t.co/vtB3pqJE57"]["These young men and women are our neighbors and our friends. #DREAMers cannot wait. Congress must not wait. We've got to pass the #DreamActNow! https://t.co/L8JsW5KpgY"]["Fact check: True. https://t.co/8uZ0IyxGJP"]["If a #GOPTaxBill “deal” has come together, it has been done without even talking to the Democrats on the conference committee. Yet another affront to regular order. https://t.co/NhZDBGwtXT"]["Kathleen Hartnett White is doing everything she can to distance herself from her own extreme views, so much so that she actually used someone else's answers to respond to @EPWDems' questions! https://t.co/69O9AStipZ"]["DON'T WAIT to #GetCovered! Go to https://t.co/SicvtMpEoL or https://t.co/jRkgFx1KBI if you live in Delaware to find a health insurance plan that's right for you. https://t.co/zv9xHg2Oup"]["Michael Dourson has spent his entire career working to undermine @EPA protections for toxic chemicals. He's a danger to every American and is unfit to lead EPA's office of Chemical Safety. https://t.co/QL3a2nlUqt"]["The president's comments are beneath the dignity of the Oval Office. I stand with @SenGillibrand, and I know she will never be silenced or intimidated. https://t.co/snYzm9z4fn"]["Republican and Democratic governors from across the country are calling on Congress to #RenewCHIP as quickly as possible: \"We believe covering children and pregnant women without disruption is one thing we can all agree on.\" https://t.co/LevBu3b4Eu"]["Despite President Trump's reckless decision to leave the U.S. standing alone against the #ParisAgreement, leaders across the country are standing up to say we are #stillin – for the generations to come. https://t.co/RxCeDfdq9e"]["The Medicare Patient Access to Hospice Act would give Medicare patients better access to high-quality, compassionate care as they seek to make the best choices possible about their treatment options. It's the right thing to do. https://t.co/5NovH0jTGE"]["Tubby’s Delaware teams won 300 games under his leadership, a record that may never be matched again.  Despite his team’s amazing success, he remained humble. He was a players’ coach. His players loved him. All of us loved him! https://t.co/U9kmMThOLh"]["Have you noticed @SoFi in Claymont? This company is looking to fill hundreds of jobs in 2018, and just completed renovating its new location. Welcome to Delaware! https://t.co/BQ0bZctYEq"]["Lots of talk about jobs today. I'd like to remind my Republican colleagues that the loss of federal funding for community health centers would result in the loss of somewhere between 76,000 and 161,000 jobs. That's devastating for our communities. We need to #FixTheCliff. https://t.co/UMgHaiOUr5"]["Nine million children across the country depend on #CHIP for their health care. Since CHIP's inception, the rate of children who are uninsured has dropped from 15% to just over 5%. Congress must #ExtendCHIP and protect our kids. https://t.co/mWb05Zzz2T"]["@ASCETweets @ASCEKristina We can't afford to rob Peter to pay Paul when it comes to infrastructure – we need real investments at the federal level that will spur economic growth across the country and create tens of thousands of good-paying jobs here at home. \nhttps://t.co/TJFjk833fB"]["Great to talk to ASCE President Kristina Swallow and her team about the desperate need for investments in our country’s infrastructure. ASCE’s 2017 Infrastructure Report Card gave us a D+. That grade wouldn’t pass muster in my house! https://t.co/tRsvIg2Rj5 https://t.co/RzKVIDp4JL"]["Thanks for stopping by, Barbara! I look forward to talking to my team about @ACSCANDE's visit. We've got to do everything we can to provide support for Delaware's cancer patients and survivors. https://t.co/5KxR7LxL8f"]["It's no surprise that a deeply flawed process has created an equally flawed product. https://t.co/hfNsQ4lcod"]["Bonnie Lautenberg is a tireless advocate for strong chemical safety protections. Allowing Michael Dourson to run @EPA's chemical safety office is an insult to the bipartisan work her late husband Frank inspired to overhaul our toxic chemical laws #TSCA. https://t.co/iRlXJVKCjy"]["It's December 7. Some bipartisan priorities (still) demanding Congress's attention: \n❗️ Puerto Rico\n❗️ DACA\n❗️ CHIP\n❗️ Funding for health centers, MIECHV and other critical health programs https://t.co/S3we3wQ2hp"]["These organizations are calling on Congress to #ExtendCHIP NOW and provide badly needed peace of mind to the families of 9 million children and over 370,000 pregnant women who rely on the program. https://t.co/u8X8kUSHoC"]["In the First State, more than 8,000 children and their families rely on #CHIP for health coverage. Hundreds of thousands of children across the country are counting on Congress to #ExtendCHIP funding. Our action is long overdue.\nhttps://t.co/ORMf2RQlwz"]["Happy #DelawareDay! History was made 230 years ago today, when a group of 30 elected delegates gathered at the Golden Fleece Tavern in Dover to debate and decide the fate of our state and country. https://t.co/oKyiFMTKqT"]["Congress must act to ensure that Dreamers can live, work, study and strive for the American dream with peace of mind. Congress must pass the #DreamActNow. https://t.co/Y1Ec43Cmkr"]["#DREAMers in Delaware are some of the most impressive young people I've ever met. Just listen to the story of Kay-Dean. https://t.co/fb10AEuihh"]["Al Franken has been a friend to many in the Senate – Republicans, Democrats and Independents alike – but these allegations are deeply troubling, especially as the number has grown. I believe it's time for him to resign."]["Great to be joined by @NWF President and Delawarean @Collin_OMara at our Senate Climate Group meeting. Together, we will continue fighting to protect our sacred spaces and wildlife to #keepitpublic for future generations. https://t.co/OrFnvPDPFF"]["And we will still keep fighting. https://t.co/ozkhD23WM9"]["President Trump's announcement on #BearsEars and Grand Staircase-Escalante today will open up over 2 million acres of cherished, public spaces and cultural sites to those who want to develop the land for financial gain."]["This land belongs to you and me—not to the highest bidder. #MonumentsForAll #KeepItPublic https://t.co/1V0V2wjc8D"]["You don’t have to take my word for it. The @sltrib, the state's largest paper, makes clear: “There is no good reason for shrinking Utah's national monuments” #MonumentsForAll https://t.co/FGkiMQ20u2"]["The #GOPTaxPlan would explode our deficits, casting an enormous burden of debt upon our children and grandchildren. That's unconscionable. https://t.co/6E5ozz8SdZ"]["Without public hearings, bipartisan negotiations or even the semblance of regular order, Republicans garnered the votes needed to pass the #GOPTaxBill at any cost. In the middle of the night.\n\nThe idea that an enduring tax reform plan has come to fruition in mere hours is a joke."]["In 1986, under President Reagan, accomplishing tax reform in Congress took years of public hearings and bipartisan negotiations. That open process and fastidious work reaped bipartisan agreement and long-lasting policy.\n\nIt stands in stark contrast to what we've witnessed today."]["Winston Churchill once said, \"democracy is the worst form of government except for all those other forms that have been tried.\" \n\nWinston Churchill was a wise man, and tonight we're putting democracy to shame."]["President Trump promised tax reform that would put money back into the pockets of hardworking Americans and ensure the wealthiest among us pay their fair share. The #GOPTaxBill does nothing to keep those promises. https://t.co/caw9VSrRYv"]["Hearing from the people who hired me to represent them in Washington is the best reminder of why it’s so important to fight against this unfair #GOPTaxPlan. https://t.co/KKZIXYQ435"]["It's December 1. Some bipartisan priorities demanding Congress's attention:\n❗️ Puerto Rico\n❗️ DACA\n❗️ CHIP\n❗️Funding for health centers, MIECHV and other critical health programs\n\nInstead we’re wasting time on a #GOPTaxBill that's made a mockery of our legislative process"]["🚨 The #GOPTaxPlan is a health care bill 🚨\n\nIf this bill passes, millions of people would lose their health insurance. https://t.co/YUeLYpnENG"]["The #GOPTaxPlan would blow a $1.5 trillion hole in the debt and raise taxes on millions of Americans to pay for permanent corporate tax cuts. That's not the type of \"reform\" this country badly needs—or wants. https://t.co/Wm3CA9Ei4l"]["How the #GOPTaxPlan would create an enormous new \"fiscal cliff\" in Congress: https://t.co/BaL5eQBm4Y"]["The #GOPTaxPlan will not pay for itself in economic growth. The truth is, any economic growth from this bill would be swamped by the deficits it creates. https://t.co/ubDyOVLiQV"]["The #GOPTaxPlan's individual tax provisions are temporary while the tax cuts for corporations are permanent. How does that meet any reasonable definition of \"fair\"? https://t.co/3TYG17xO6S"]["It is completely irresponsible to sacrifice our national treasures to offset a tax cut for corporations and the wealthiest Americans. We must #ProtectTheArctic. https://t.co/pFqUm6qlWX"]["At worst, making the individual tax provisions expire is a sneaky way to increase taxes on American families—all in order to pay for a permanent and expensive corporate tax cut. \n\nEither way, the result is unconscionable and a total affront to fiscal responsibility. https://t.co/HSwsxpnZU6"]["At best, making the individual tax provisions in the #GOPTaxPlan expire is an elaborate scheme to hide the true cost of this bill, obscuring the fact it would add much more to the debt—possibly twice as much—than the $1.5 trillion that’s been advertised. https://t.co/55lWMMMWJC"]["So up to the Senate Floor the GOP flew, with their sleigh full of skinny repeal, and a partisan tax bill, too. Disguised as a Christmas gift for people like you, but with terrible consequences if the bill does go through. 💸"]["We should be working together in Congress to open more doors for our nation's graduate students—America's future leaders, experts, innovators and entrepreneurs. The House #GOPTaxPlan does just the opposite. #SaveGradEd https://t.co/Hz7RO4ACz4"]["At the same time, the #GOPTaxPlan would actually increase taxes on millions of Americans beginning next year. By 2027, most people earning less than $75,000 a year would be worse off. \n\nNone of this meets a reasonable definition of \"fair.\" https://t.co/o8hem0nFz9"]["Within 10 years, more than 77% of the tax cuts in the #GOPTaxPlan would go to the wealthiest 5% of Americans. Nearly 62% of the tax cuts would go to the wealthiest 1% of Americans. https://t.co/M38WyfCakE"]["Non-partisan @USCBO analysis: a repeal of the Affordable Care Act's individual mandate would cause 4 million Americans to lose health insurance by 2019. By 2027, 13 million Americans would lose their health insurance. https://t.co/0GBqjlZ71j"]["Kathleen Hartnett White's nomination was just reported out of the EPW Committee. If she is confirmed by the Senate, I believe we will have failed in our responsibility as United States Senators to provide advice and consent, and we will have failed the American people."]["Kathleen Hartnett White has called for the repeal of the Renewable Fuels Standard repeatedly over the past decade, stating the program is \"counterproductive,\" \"ethically offensive\" and \"destructive.\""]["Kathleen Hartnett White has said – several times – that fossil fuels ended slavery. https://t.co/THCpn6MMTx"]["Kathleen Hartnett White has compared the views of those who believe that human activity is causing climate change to those of \"pagans\" and \"communists.\" She's suggested that policies to reduce global warming pollution could lead to poverty and even concentration camps."]["Kathleen Hartnett White refers to renewable energy sources as a \"false hope\" and \"parasitic.\" She's called repeatedly for the repeal of the solar and wind tax credits."]["The Council on Environmental Quality's responsibility and influence is considerable and consequential. That's why I'm deeply disappointed in the nomination of Kathleen Hartnett White. I cannot urge my colleagues more strongly to oppose her nomination."]["In 1986, enacting tax reform in Congress took years of public hearings and bipartisan negotiations. The idea that a permanent and enduring tax reform plan can come to fruition in mere weeks is the triumph of man's hope over experience. https://t.co/pmT9pW3Fq7"]["Any tax bill that's purely partisan, written in the dark and rushed to the finish line is bound to be poorly designed and riddled with inadvertent errors. A flawed process results in a flawed product. https://t.co/LJekhM4aC8"]["The last day of #OpenEnrollment is December 15. Keep spreading the word to help more Americans #GetCovered! https://t.co/rrPnTK4Lzq"]["RT if you stand with the @UCSUSA scientists urging the Senate to vote NO on Kathleen Hartnett White's nomination to the White House Council on Environmental Quality! https://t.co/1AIrriF0oa #StandWithScience https://t.co/5QZDZt01gl"]["@EPA 1972-1973: Children played outside, breathing in toxic air. Families swam in polluted water. Landscapes were littered with waste. Communities were enveloped with choking smog. We need an @EPA #GuidedByScience—not an #EPABack2Basics. https://t.co/2W46a9tyjV"]["The @EPA's #EPABack2Basics agenda takes us back to when our air was filled with toxic smoke and our water was polluted with waste\nhttps://t.co/zKPerYa4iK"]["It's time for Congress to act. Let's better protect student veterans and taxpayers—let's close the 90/10 loophole. https://t.co/rQkNc33cza"]["We are loading up Turkeys with this little turkey for Stormin’ Norman’s Turkey Drive 2017 at the Western Sussex @BGClubsDE https://t.co/Y1lJ7Jt1uP"]["Investments into our nation’s infrastructure,\nlike the @FAANews we celebrated in Cheswold today, helps the economy, makes transportation safer, and creates jobs. https://t.co/9OispzErCa"]["@SenateFinance The #GOPTaxPlan process that's been followed over the past few days makes a mockery of the bipartisan tradition of the @SenateFinance Committee. We can—and, more important, we should—do better than this."]["@SenateFinance This week we learned that Republican efforts to pass a #BillionairesFirst tax plan would also include a sleight of hand maneuver that will begin dismantling our country's health care system."]["@SenateFinance When Republicans unveiled their tax reform proposal last Friday, we knew they'd rejected our pleas for true bipartisan negotiations, and chosen instead to force through a bill in mere days that would remake our entire economy."]["Last night, Republicans on @SenateFinance approved a bill to repeal a critical part of the Affordable Care Act, and blow a hole of at least $1.5 trillion in our federal deficit over the next 10 years in order to give millions of dollars in tax breaks to the wealthiest Americans."]["Support for the clean energy sector led to more than $507 billion in investments. Recent increases in fuel efficiency standards would cut 6 billion metric tons of CO2, and save Americans $1.7 trillion at the pump. https://t.co/WXvSWUIjcW"]["Despite what the Trump Administration may say, our reduced emissions and economic growth isn't a coincidence. Over the past eight years, the federal government used a combination of economic incentives and environmental targets to spur clean energy investments and cut emissions. https://t.co/3DcIlKZjcM"]["As more American jobs go overseas as a result of the #GOPTaxPlan, Americans will look back on this moment—at this process in Congress—and they will know who is to blame. https://t.co/5ybKJGGGR5"]["The #GOPTaxPlan would blow a hole in the debt by at least $1.4 trillion, and it would wind up costing much more as deficits grow in the years ahead. That's bad for our national security. https://t.co/nXHDjWyrVV"]["Dr. Dourson's nomination must be pulled, he should not remain in an unconfirmed role at @EPA and we must find a credible regulator who the American people can trust."]["And it's clear that many of my colleagues agree—Dr. Dourson is too extreme and the wrong choice to oversee the chemicals Americans encounter every day."]["We put politics aside to pass #TSCA reform in order to do the right thing. We need to do that again now because our constituents deserve better than Michael Dourson. https://t.co/e4fgotmMyw"]["I just offered an amendment to the repeal-without-replace-#GOPTaxPlan that would ensure no veterans or their families lose access to health care as a result of this bill. \n\nIt was defeated."]["This amendment to the repeal-without-replace-#GOPTaxPlan would protect Americans from skyrocketing health insurance premiums and death spirals in states' individual health insurance markets. It was defeated. https://t.co/ZFMErqHihI"]["Just offered an amendment to the repeal-without-replace-#GOPTaxPlan that would direct CMS to establish a permanent Individual Market Stability Fund, which would help states establish their own reinsurance programs to reduce premiums in the individual health insurance marketplaces"]["We aren't even getting the opportunity to invite @USCBO to a public hearing to answer our questions and lay out the facts on the #GOPTaxPlan https://t.co/mcyxPGaf2y"]["In my office, every day is #AmericaRecyclesDay. We all must do our part to reduce waste, preserve our precious resources and protect the one and only planet we have. https://t.co/4J8J7DRPtk"]["Glad to have @JohnBoozman as a partner in this effort! #AmericaRecyclesDay is an important reminder that #recycling helps our environment and our economy ♻️ https://t.co/uJNM7ojyrT"]["Republicans are playing with fire, forcing insurance markets to collapse. https://t.co/hHryDcuiDt"]["I'd like to remind two of my Republican colleagues on the @SenateFinance Committee that in 1993, they co-sponsored legislation that included the individual mandate. Because it's a good idea. https://t.co/BViPqmzNFk"]["A reminder to Republicans that repealing the individual mandate puts Medicare on a faster track to bankruptcy. Morally and fiscally wrong."]["The #GOPTaxBill is now a health care bill that will cause premiums to skyrocket &amp; millions of people to lose insurance. This is not a drill. https://t.co/9iU0jVV1WL"]["The Chairman's Mark was released last night. It's official. https://t.co/ughRnNfktI"]["It's not surprising that a flawed tax reform process has produced a flawed product. https://t.co/m4UCSuFgfy"]["Individual mandate repealed ➡️ healthier people less likely to obtain health insurance ➡️ risk pools less healthy ➡️ cost of premiums rise ➡️ more people do not obtain insurance.\n\nThe #GOPTaxPlan could now mean higher premiums and millions of people lose health insurance."]["It's Groundhog Day on Capitol Hill. #ProtectOurCare https://t.co/EY3l6cobi9"]["This is unconscionable. The GOP's latest effort to slip a repeal of the individual mandate through tax reform opens the door to skyrocketing premiums and 13 million Americans losing health insurance over the next 10 years. https://t.co/Nfm9lNMUji"]["Here's what @PatrioticMills Chair Morris Pearl says about the \"double taxation\" argument on the estate tax: Don't buy it. https://t.co/HB6I7Kj0wM"]["While the #GOPTaxPlan actually increases taxes on millions of middle class families beginning next year, the bill makes it easier for family dynasties to give inheritances to their wealthy heirs https://t.co/57PrTcIkXl https://t.co/5VDdosZqZo"]["Today is the start of the @SenateFinance markup of the #GOPTaxPlan. \n\nWe've had no public hearings on this tax reform proposal. No bipartisan roundtables. No bipartisan negotiations. Americans have been told next to nothing about how this legislation affects them."]["One of the best ways we can thank our veterans is to ensure their access to high-quality health care and education. My #VeteransDay message: https://t.co/qn722VOEoW"]["One veteran misled or mistreated by a for-profit school is one veteran too many. https://t.co/tredA5oEKs"]["Honored to be the guest speaker at the @UDelaware student group Blue Hen Veterans’ beautiful ceremony today and discuss legislation I introduced in the Senate yesterday to protect veterans’ education benefits from scammers. https://t.co/wa7QjEP30L"]["I've teamed with @ChrisCoons @RepBRochester to deliver an important message: #GetCovered! https://t.co/SicvtMHfNl https://t.co/jRkgFwK9Ka https://t.co/OTjkFeKH1N"]["These deadly weapons were designed for the battlefield—they have no place in our neighborhoods. https://t.co/f0XE8h4OgN"]["HAPPENING SOON: We're standing together to support student veterans and close the 90/10 loophole! Watch live: https://t.co/h1A4scQR6R https://t.co/TYPgh0HTX3"]["I encourage my colleagues to vote no on Bill Wehrum's nomination to be EPA's Assistant Administrator for Air and Radiation. https://t.co/lrwr1XPLRs"]["@EPA Bill Wehrum believes there's no justification for EPA to regulate the largest sources of mercury and air toxics pollution—even though power companies have already bought, paid for and installed control technology on all power plants without hiking electricity prices."]["@EPA Bill Wehrum believes there's no justification for @EPA to regulate the largest sources of mercury and air toxics pollution—pollution that settles in our lakes and rivers, accumulates in our fish, and makes them too dangerous to eat."]["@EPA Bill Wehrum believes there's no justification for @EPA to regulate the largest sources of mercury and air toxic pollution—pollution that pediatricians tell us damages children's brains and could affect up to 600,000 newborns every year."]["@EPA Bill Wehrum has spent most of his career fighting to dismantle the federal environmental protections that so many states, including Delaware, depend on to clean up toxic air pollution."]["@EPA Toxic air pollution gets into the air we breathe, gets into the food we eat, builds up in our bodies without our knowledge, and can lead to cancer, mental impairment and even death."]["@EPA Much of our country's ongoing efforts to clean up air pollution hinges on making sure that every state plays by the rules and does their fair share to reduce air pollution. That includes dangerous toxic pollution like mercury."]["In one of those instances, the courts faulted @EPA's lack of action to reduce mercury and air toxic pollution emissions from electric power plants. https://t.co/J8OsfFJfWy"]["@EPA The number of times courts have overturned regulations that Bill Wehrum helped to craft at @EPA? 27.\n\nThat's 27 times that the courts determined the rules Bill Wehrum put in place didn't follow the law or adequately protect public health."]["@EPA Throughout his career, Bill Wehrum has clearly shown that he's dismissive of the science at the core of @EPA's actions to protect public health"]["Kathleen Hartnett White has spent her career actively disputing facts about the environment and our public health while peddling revisionist history and wild conspiracy theories. This is #NotTheOnion. https://t.co/yKDSRM2KIx"]["We need a public health advocate to lead the Council on Environmental Quality. That's not Kathleen Hartnett White (and this is #NotTheOnion). https://t.co/W8ZXhU1tqS"]["This is #NotTheOnion. Tune in now to watch EPW's hearing to consider Kathleen Hartnett White, President Trump's extraordinarily questionable nominee for the top environmental job in the White House: https://t.co/7qlLLuoYLT https://t.co/qhQl4CE4IL"]["Kathleen Hartnett White has shown a disdain for science, a disregard for laws already on the books and a staggering disrespect for people who have views with which she disagrees. She's been nominated to hold the top environmental post in the White House.\nhttps://t.co/gqOnRJ1WWL"]["Let's keep up the momentum! Spread the word! #GetCovered! https://t.co/3KDAz9OcAn https://t.co/wJE4d6Nzft https://t.co/rLAjPLU56R"]["While the rest of the world acts on climate change, @POTUS nominates climate deniers to top environmental jobs https://t.co/7qlLLuoYLT https://t.co/anvoZDH7qZ"]["One is the loneliest number. https://t.co/hBN3nVNM8A"]["Our country's opioid epidemic claimed 60,000 lives last year. We need to provide greater funding to effectively combat this deadly epidemic. https://t.co/hHPaBWxy3l"]["ICYMI: I sat down with @soledadobrien on @matteroffacttv to discuss the #AlexanderMurray bill and bipartisanship in Congress on health care https://t.co/vEiBoGJSNC"]["It is clear that our country is plagued by an epidemic of gun violence. Congress has a moral obligation to address it."]["My heart breaks for the people of Sutherland Springs. Praying for the victims of this despicable attack."]["Tomorrow @westsidehealth will be hosting an #OpenEnrollment Enroll-A-Thon at the Wilmington Public Library. Join us and #GetCovered! https://t.co/lq1vapGouA"]["Today I have the joy of being \"Principal for a Day\" at Laurel Middle School. Thanks @DEStateChamber for organizing the #PFAD program! #netDE https://t.co/wqs1NpV9Iw"]["The #CleanPowerPlan is a public health initiative that would prevent up to 4,500 premature deaths each year. The @EPA is dismantling it. https://t.co/z4ZtyeB65b"]["The @EPA is a public health agency. @EPAScottPruitt's unprecedented secrecy continues to erode public trust and undermine the EPA's mission https://t.co/CDT4F4LqdB"][".@EPAScottPruitt should take lessons from a former @EPA administrator under two GOP presidents: transparency matters https://t.co/eiSqjkTLdY"]["This is good news for all Americans, especially those of us who care about agriculture, farming, science, public health and the environment https://t.co/zl917DK4cx"]["Las oportunidades se encuentran en la adversidad y debemos de construir una red energetica más fuerte, limpia y resistente en Puerto Rico https://t.co/H0Ld0N2mkL"]["In adversity lies opportunity—as Puerto Rico recovers, we must seize opportunity to build a stronger, cleaner and more resilient energy grid https://t.co/3ppfZtrYwZ"]["During #OpenEnrollment, Delawareans can get free help from navigators and review their options for coverage in 2018: https://t.co/JZqcDFmHMy"]["Today is the first day of #OpenEnrollment! Go to https://t.co/SicvtMHfNl or https://t.co/jRkgFwK9Ka if you live in Delaware to #GetCovered! https://t.co/nng6ojZcLc"]["This is awful news. Praying for the victims of this attack and their loved ones. https://t.co/FdTx4Flz7g"]["@EPAScottPruitt @EPA Scott Pruitt's crusade to delegitimize the work of nonpartisan scientists endangers the health of every American. It cannot be tolerated."]["@EPAScottPruitt @EPA Pruitt repeatedly silenced EPA scientists and denied science inconvenient to his agenda. Now he's trying to get rid of scientists altogether"][".@EPAScottPruitt is firing qualified scientists to make room for individuals sponsored by the very same industries @EPA is meant to regulate https://t.co/K4XXnRL0Q4"]["🚨🚨 RT to spread the word: #OpenEnrollment in the ACA marketplace is tomorrow, November 1 to December 15. #GetCovered 🚨🚨 https://t.co/Prp2c4HTek"]["Middle class Americans should not have to pay for tax giveaways to the wealthiest people in our country. https://t.co/dcg3HU4I43"]["Good news. May these brave patriots continue to serve with the dignity and respect they deserve. #LetThemServe https://t.co/5xV6z6s7b4"]["The urgent need in Puerto Rico to quickly restore power, repair homes and ensure the availability of safe drinking water can't be overstated https://t.co/33PSSqtFRw"]["Congress also needs to hear from the governors, mayors and community leaders in Texas, Florida, Puerto Rico and the U.S. Virgin Islands https://t.co/zHgXJ6NHQc"]["TOMORROW: #GETCOVERED https://t.co/3KDAz9OcAn https://t.co/82GazP9Dql https://t.co/lyjCczLF8U"]["HAPPENING NOW: @SenateHSGACDems examine the federal response to the 2017 hurricane season, with @FEMA_Brock. WATCH: https://t.co/QjpYR3oGVG"]["Taking up the @SenateHSGACDems gavel for our leader @clairecmc this AM. Praying for her family, wishing her husband a swift &amp; full recovery."]["My statement on the indictments of Trump campaign officials, including former Trump campaign chairman Paul Manafort: https://t.co/bwYWoozqkX https://t.co/aqkE2noTOy"]["Drilling down on the challenges of health and education this morning at @UDelaware @VCDelaware Conference w/ @ChrisCoons @LisaBRochester"]["It's the final countdown. https://t.co/SicvtMHfNl https://t.co/IJcJCWLmqg #GetCovered https://t.co/h8pH3UNFdP"]["Heartbreaking, but important Sunday reading. Weakening environmental protections at @EPA isn’t a talking point — it has serious consequences https://t.co/YOR3Bo3Gg7"]["The @TaxPolicyCenter analysis: #TrumpTax plan would cost the federal government $2.4 trillion over the next 10 years https://t.co/ecf8xZW2bR"]["It's Sunday—three days until #OpenEnrollment. #GetCovered https://t.co/uKqKs3ivzV"]["Did you know that 8 in 10 people looking for health insurance on the ACA marketplace qualify for financial assistance? #GetCovered https://t.co/0NnQ1wS4Sk"]["Never has a nominee to lead EPA's chemical safety office had such deep ties to industry. #ScienceForSale https://t.co/8f8zkXe77n"]["We have a moral obligation to protect all Americans from harmful pollution, regardless of race, income or zip code https://t.co/x9HVrkoDl6"]["https://t.co/WGLpQoRUre"]["75% of Puerto Rico is still without electricity. It's critical that we restore power ASAP &amp; rebuild with resilience. https://t.co/9UEOaxEs5t"]["The #TrumpTax plan is a total affront to fiscal responsibility. It would add $1,500,000,000,000+ to the deficit over the next 10 years. https://t.co/7fuypAgUtm"]["The #TrumpTax plan is a #BillionairesFirst plan. Within 10 years, 80% of the tax benefit would go to the top 1% https://t.co/WnQA6QRvKu"]["Cherry-picking data may satisfy the @EPA's paperwork requirements, but doing so will not satisfy the requirements of the law https://t.co/R2THRkvVmL"]["Skewing science, fabricating math, ignoring billions of dollars in health benefits. EPA must explain its work on the #CleanPowerPlan repeal. https://t.co/wZMUqMcnsA"]["Those deeps cuts to Medicaid put millions of people at risk of losing coverage for substance abuse prevention, treatment &amp; recovery services https://t.co/UpCTnH2NvS"]["#Medicaid provides the lion's share of payments for substance abuse and addiction treatments. The GOP budget cuts $1 trillion from Medicaid."]["It’s about time that President Trump follows through on his promise to declare a public health emergency on this worsening crisis. https://t.co/RUZ6FqjA7K"]["Delaware has not been immune to the deadly opioid epidemic that's ravaging communities across America. We've lost hundreds of our neighbors."]["Coalition for the American Dream: These businesses and industry leaders are urging Congress to #ProtectDreamers. Let's pass the #DREAMActNow https://t.co/tfsLFFNlL7"]["Under the #GOPtaxplan, thousands of households across Delaware would lose an average $9,000+ tax deduction from paying state and local taxes https://t.co/nynEjvt874"]["Help us spread the word: Today tell 6️⃣ people you know that there are 6️⃣ days until #OpenEnrollment! #GetCovered https://t.co/TP8fjwOJl5"]["I've been trying to schedule that vote for years. I'll be sure to remind my colleagues that things worth having are worth paying for. https://t.co/SqhOp2Cpck"]["Expanding background checks is a commonsense way to keep weapons out of the hands of criminals. Enough is #Enough. https://t.co/EJyVp2Nzkb"]["But your job is to protect the environment and public health, @EPAScottPruitt. https://t.co/o2My3dVcpt https://t.co/4PhWQ0VDQg"]["The non-partisan CBO on Alexander-Murray:\n✅ Reduces the deficit by $3.8 billion\n✅ Lowers premiums in 2019\n✅ Increases flexibility for states"]["It's up to us in Congress to do right by these young people. Let's pass the #DreamAct. https://t.co/EDTb9WdhK1"]["Turning our backs on these impressive young men and women is not just cruel, it’s also a self-inflicted wound on our communities and economy https://t.co/uYasnAFp4a"]["I've met many #Dreamers studying &amp; working in Delaware. They're some of the most remarkable college students I’ve ever met. #ProtectDreamers https://t.co/AcJkXk1ZVR"]["Michael Dourson is not just another Trump nominee. The EPW committee failed America today. @EPWDems will not give up https://t.co/P2rKqGbWcH"]["Whether the pollutant is silica, carbon or mercury, Bill Wehrum has sided with polluters over science and doctors almost every time https://t.co/83kUpRey4j"]["Dr. Dourson's record is clear. Throughout his career, he's sold science to the highest bidder and recommended weak toxic chemical standards https://t.co/AduwNhD6QK"]["Michael Dourson is one of the most troubling nominees I've ever considered on EPW. We'll vote on his nomination at 10:00 am. #ScienceForSale https://t.co/4Qassz0QoZ"]["Start spreading the news! ACA open enrollment begins Wednesday, November 1 and ends December 15. #GetCovered https://t.co/ixXWRRtW6O"]["There's no rhyme or reason why the Senate is voting to repeal the #RipoffClause rule instead of voting to fund #CHIP and health centers"]["Today Mexican Ambassador Gutiérrez and I discussed modernizing #NAFTA and making continued progress in stemming Central American migration https://t.co/mWlr5wdaGU"]["With our world-class workforce, in the nexus of the Northeast Corridor, the First State would make a proud home for #AmazonHQ2. #OptionsInDE"]["President Trump should take a lesson from Businessman Trump and see the serious threat #ClimateChange poses to our nation's bottom line. https://t.co/So1pCJRKVH"]["Ignoring the already devastating and growing threat of climate change is not only dangerous, but it's also a bad investment. https://t.co/1xIx7U3d7f"]["Trump blamed Puerto Rico for throwing our budget \"out of whack.\" He needs to read @USGAO's report on #ClimateChange.\nhttps://t.co/PQdbJ21CIE"]["The GOP tax plan would actually raise taxes on about 62,000 households across the First State in 2018. That’s not all: https://t.co/jP1AhOc188"]["It comes as no surprise that the trillion-dollar GOP tax plan benefitting the wealthiest 1% is bad news for Delaware’s workers and families."]["RT to spread the word: Open enrollment begins next Wednesday, November 1. Let's #GetUSCovered. https://t.co/vFEedlsyyf"]["…and health care costs for individuals with preexisting conditions. https://t.co/FtCHrMifWp"]["Until then, any proposals eroding individual market risk pools should be seen as blatant attempts to drive up health insurance premiums..."]["If someone can actually show us medical loss ratios for health sharing ministries, we can consider whether these plans should be expanded. https://t.co/gH82ZomVMm"]["It was truly an honor to award the posthumous Bronze Star and Purple Heart to an American hero, Pfc. James Davis Jr. https://t.co/GqqgCHBplx"]["Excellent reporting from @nytimes shows the chilling reality of what's happening behind the scenes at Pruitt's @EPA https://t.co/Ej0pCeu56U"]["Proud to join @SenBooker on this important bill https://t.co/o08l0RMTIb"]["The reality: a border wall is an expensive, inefficient substitute for addressing the root causes of why people come here in the first place https://t.co/7jcALqjorG"]["Congress needs more information from the DEA to ensure this agency has the tools and resources needed to combat our nation's opioid epidemic https://t.co/yJk6b8VDuU"]["Today we break ground on the future home of the National Institute for Innovation in Manufacturing Biopharmaceuticals at @UDelaware https://t.co/617ddbtcMN"]["I was governor of Delaware for 8 years. Block granting Medicaid with a massive cut would have destroyed our state's health care system. https://t.co/aE6ciPbQ6C"]["I've spoken with many governors this year—none of them have asked for Medicaid block grants and massive funding cuts https://t.co/UJxbbwMbQT"]["The first state is a great state to live and work! Check us out! #OptionsInDE https://t.co/AtGcXecTXR #netde"]["I join @SenAlexander in urging my colleagues to listen to the people of America. They're counting on us to work together and lower premiums. https://t.co/1XKpGxhKkT"]["This budget paves a path for a partisan tax package that would explode our deficits to deliver a massive tax cut to the wealthiest Americans https://t.co/TqmFLLw2ll"]["Welcoming scientists from all over the country at @UDResearch @argonne workshop to talk research collaboration on materials science https://t.co/ZwaaIYjOe0"]["10? Out of...10? Nearly 80% of Puerto Rico is still without electricity, 4 weeks after Hurricane Maria made landfall https://t.co/UXRDCuTwaH"]["Today Gov. @JohnCarneyDE, @RepBRochester &amp; Mayor @MikePurzycki will unveil Delaware's proposed sites for #AmazonHQ2! https://t.co/CkubtvzjPI https://t.co/xhQTbu9Swn"]["A more than reasonable request from Republican and Democratic governors: Let's get to work on #AlexanderMurray, lower health insurance costs https://t.co/CRFJfqv0WE"]["Our constituents are counting on us to do what's right. Let's get #AlexanderMurray and #CHIP across the finish line. https://t.co/zILf623eJB"]["Dourson is a dangerous choice to lead @EPA’s toxic chemical office. We owe it to every American family to do better.\nhttps://t.co/5eAw0WVka1"]["Michael Dourson's life's work has been singularly focused on undermining public health standards for the highest bidder. #ScienceForSale https://t.co/XQurmGzx4J"]["Congrats to Sussex Tech's Virginia Forcucci on Teacher of the Year honor! Go Ravens! https://t.co/1ICbK2eQNs #SussexDE #netDE"]["@EPA Let's be clear: @EPA research grants and advisory roles should be awarded to the most qualified and most capable candidates. Period."]["In May, Pruitt abruptly dismissed 12 scientists from an @EPA advisory board. We still haven't gotten an explanation. https://t.co/V1jjdEOkOP"]["Scott Pruitt has repeatedly tried to deny and discredit science inconvenient to his agenda. Now he's trying to get rid of the scientists too https://t.co/q5KxShUXsj"]["Glad to have your partnership @JohnBoozman in raising awareness of the benefits of #recycling to our economy and environment! https://t.co/XwyY5mAsyj"]["Today our #Recycling Caucus briefing focused on electronics recycling, which helps preserve resources, reduce landfill input and create jobs https://t.co/3SjCWxW6Qz"]["Sen. @PattyMurray and @SenAlexander have listened to the American people. The stage has now been set for us to do what's right—work together https://t.co/IMruNJSDd1"]["It is completely irresponsible to put such a pristine landscape and important natural habitat at such an unnecessary risk. #ProtectTheArctic https://t.co/I9gXNtQMQS"]["The GOP tax plan would allow oil drilling in the #ArcticRefuge to offset a tax cut for the wealthiest Americans https://t.co/wTD3rbCJRt"]["These were not difficult questions. https://t.co/t5Lk7Vc9kO"]["Beyond curious—almost bizarre—that President Trump says the #IranDeal isn't in the best interest of our security https://t.co/5JAnQ7QxQT"]["Trump's decision to cut cost-sharing reduction payments makes the successful conclusion of these bipartisan efforts more urgent than ever https://t.co/ZiQbozGqJB"]["This move will make premiums soar. President Trump must know this. He's using scorched-earth tactics on health care. https://t.co/iD0k6jXyqS"]["So many unknowns. More uncertainty. More chaos. This is just the Trump Administration’s latest move to sabotage the Affordable Care Act."]["Under this executive order, will AHPs have to cover maternity care? What about treatment for addiction and substance abuse disorders?"]["Under this executive order, will Association Health Plans (AHPs) be allowed to deny coverage to people who have preexisting conditions?"]["Short on details, indeed—and many unknowns. https://t.co/z9zrpmfBgz"]["90% of Delaware's air pollution comes from other states. We can't stop fighting for cleaner air and a healthy planet https://t.co/1GgjEcho4h"]["You can read my full statement on today's repeal of the #CleanPowerPlan here: https://t.co/e8nxVR1PhP https://t.co/luAO2GmInL"]["Repealing the Clean Power Plan isn't just a talking point. It will have serious consequences for the health of the public and our planet."]["In April, I asked Scott Pruitt how he planned to protect the public from carbon dioxide pollution. Today, I got an answer: He has no plan. https://t.co/0BpnPdtGhh"]["President Trump and Scott Pruitt are using rigged science to justify repealing the #CleanPowerPlan. They are on the wrong side of history."]["The #CleanPowerPlan would bring billions in health benefits and save lives. They've chosen to ignore these facts https://t.co/C0ist7Ip3o"]["But instead of showing real leadership, the Trump Administration is wasting time and using phony science to continue to deny climate change"]["Raging wildfires, powerful storms and record-setting temperatures are no coincidence #ClimateChangeisReal \nhttps://t.co/7L4IQWjW2x"]["In less than 1 month, 2017's catastrophic hurricane season brought devastation and anguish to millions of Americans\nhttps://t.co/hd04h4khiU"]["Wildfires are currently raging across the U.S., burning an area larger than the entire state of Delaware\nhttps://t.co/hOyDwHIxM2"]["Thoughtful discussion yesterday on @GOP #Taxreform proposal w/ @ChrisCoons &amp; @PatrioticMills. These ideas are wrong for #delaware https://t.co/p72Lq2p02x"]["Religious freedom does not have to come at the expense of women's health."]["FACT: @EPA missed the deadline for evaluating ozone levels, putting the health of 6.3 million kids with asthma at greater risk. https://t.co/rdGnkIhBya"]["FACT: The #CleanPowerPlan that @EPA may repeal this week would help to avoid 90,000 asthma attacks in children each year. #KidsEnvHealth https://t.co/rdGnkIhBya"]["Let's come together and do something historic that could positively impact every corner of this country. Let's build. https://t.co/Qcnj6GC49R"]["This nomination comes at a critical juncture for the agency and for all Americans as we confront the enormous challenge and opportunity to modernize our aging infrastructure https://t.co/MPEe8s1mtU"]["While our country debates how to address #climatechange, rising sea levels and extreme weather events are the new norm, placing extreme burdens on the American people and economy https://t.co/FpIECI8Uop"]["I'm cosponsoring a bill introduced by @SenFeinstein that bans the sale, transfer, importation, manufacture or possession of bump stocks https://t.co/E9akfli5Ca"]["@EPA Never has an @EPA nominee so consistently under-estimated the risks of chemical exposures to the most vulnerable among us—not until Michael Dourson. #ScienceForSale"]["@EPA TCE (an industrial solvent) is found in consumer products despite its universally recognized links to cancer. Michael Dourson was paid by manufacturers to say protections against TCE should be weakened. #ScienceForSale https://t.co/bLtE0l3B6X"]["@EPA Chlorpyrifos (an insecticide used on crops and golf courses) is a neurotoxin that causes nausea, dizziness and headaches. It poses a serious health threat to children. #ScienceForSale https://t.co/DEUT52W6dC"]["@EPA When Alachlor (a herbicide) contaminates drinking water, it can lead to kidney damage, liver damage and various forms of cancer. It’s banned across Europe. Michael Dourson wants to weaken protections against it. #ScienceForSale https://t.co/8jnI1QoNei"]["@EPA Acrylamide (commonly found in fried foods) is linked to various cancers. Industry paid Michael Dourson to conduct an independent review of acrylamide, and he determined that it's safe at levels 25x higher. #ScienceForSale https://t.co/VUDjRuziCf"]["@EPA 1,4-Dioxane (an industrial strength solvent used in manufacturing for greases, dyes and varnishes) can cause nausea, headaches and lead to liver and kidney damage. #ScienceForSale https://t.co/kmkLC9lyMB"]["@EPA Short-term exposure to 1-Bromopropane (used in in degreasers, cleaners and industrial lubricants) can cause developmental and reproductive harm. Long-term exposure can lead to reproductive, kidney and liver damage and lung cancer. https://t.co/2xTCbRAro9"]["@EPA Never has a nominee had such a long record of recommending chemical safety standards that are as much as thousands of times less protective than those recommended by regulators—not until Michael Dourson. #ScienceForSale"]["My statement on the deadly mass shooting in Las Vegas: https://t.co/sOhJ6uZZ17"]["Praying for the victims of this attack and the people of Las Vegas. Thankful for our first responders who jumped to action and saved lives."]["@BobbiBarends @delawaretech Thank you, @delawaretech and @BobbiBarends for your support of this industry!"]["Puerto Rico &amp; the U.S. Virgin Islands are in crisis and need their fellow Americans, especially their president, to remember the Golden Rule"]["The president's insults to the mayor of San Juan are a disgrace."]["According to reports, just hours after this letter was sent, the White House launched a review of private email use https://t.co/BNAvq27Ra2"]["But her emails!\n\nI’m asking White House Counsel to explain if White House staffers are complying with the Presidential Records Act (and if so, how) https://t.co/s5eJD9Jq9v"]["Our state found success in reducing teen pregnancy by increasing family planning education in schools and expanding access to birth control https://t.co/8s1avOhg42"]["This is big news! When I was governor, reducing teen pregnancy was a big priority for our administration. We still have more work to do. https://t.co/M86SXIsGhK"]["We're so glad to have you back, @SteveScalise. https://t.co/jOg2jwAGIB"]["Instead of following through on @POTUS's promise to deliver better health care at a lower cost for everyone, this administration is doing just the opposite by sabotaging the ACA in any possible way. https://t.co/Ud76OEfQlP"]["First @HHSGov pulls the plug on https://t.co/BfUFS7vTlh enrollment on Sundays. Now this. https://t.co/Sgygr8l2AC"]["My team and I are excited about @Twitter's change to #280characters. If you've ever heard me speak on the floor or at an event, you've proba"]["Great to meet with @stanleyspoor, principal of Howard High School of Technology and Delaware Principal of the Year—let's go @HowardWildcats! https://t.co/zxU7uevgns"]["Now let's work together to improve our health care system. We need regular order, bipartisan solutions and a victory for the people we serve https://t.co/FXMBMxrXai"]["This is because of the American people—you spoke out against this dangerous bill and your voice made a difference. https://t.co/CSaysT0w0t"]["Our fellow citizens in Puerto Rico need our help and they need it now. Please RT to spread Governor @ricardorossello's message to America. https://t.co/I7GcjALEzQ"]["The idea that states could establish new health systems in two years is not based in reality https://t.co/wFXLPrEVBV https://t.co/u57Bf6vo2r"]["Thank you, once again, @SenatorCollins. Now let’s work together to fix the parts of the Affordable Care Act that need to be fixed. https://t.co/UeM1Xw05Si"]["S&amp;P on #Trumpcare:\n\n❌ 580,000 lost jobs\n📉 $240 billion in lost economic activity\n❌ GDP stagnates;\"stuck in low gear\"\n🎲 Increased uncertainty https://t.co/0TNrZDpZjV"]["Met these folks from Delaware &amp; Philly—just some of the hundreds outside the Trumpcare hearing. Thank you for standing up to #ProtectOurCare https://t.co/T0oQffkWtY"]["Submit your comments to the hearing record. Tell generations to come why we fought #Trumpcare tooth and nail. gchcomments@finance.senate.gov https://t.co/ef4zHAUTaD"]["Praying for our fellow Americans in #PuertoRico suffering through a deadly crisis. Our neighbors need our help. https://t.co/5hvDeWLsIs"]["#GrahamCassidy goes against nearly all the advice we heard from governors in the bipartisan HELP committee hearings. States don't want it. https://t.co/uOUgdRxY85"]["This is an all-hands-on-deck moment for our country. Activate your networks and call, email, tweet. Let's come together and #ProtectOurCare!"]["In the Navy, whenever one of our ships or submarines had an emergency, we would sound general quarters and it would be \"all hands on deck\""]["For just about everybody, but especially women and older Americans, #GrahamCassidy 2.0 would make health insurance unaffordable. https://t.co/aIO2uVeUVY"]["This bill is written for those who can afford to sock away money in HSAs—for those who don't stay healthy forever, it's downright dangerous."]["#GrahamCassidy 2.0 openly violates all of the president's promises on health care &amp; puts Americans with preexisting conditions at grave risk"]["40 @CancerAdvocacy organizations representing 16 million cancer patients and survivors are asking my colleagues to vote #NOonCassidyGraham. https://t.co/0V4QiyBrRI"][".@NAADACorg represents 95,000 addiction counselors, educators &amp; other addiction-focused health care professionals—they oppose #GrahamCassidy https://t.co/dBt5BGGWs3"]["The @ACLU: The latest version of Trumpcare is devastating, \"particularly for women and people with disabilities.\" https://t.co/XliSVwslUS"][".@CF_Foundation opposes #GrahamCassidy, which would open the door to annual and lifetime coverage caps. #ProtectPatientsNow https://t.co/298ry2s5JS"][".@APAPsychiatric opposes #GrahamCassidy: the bill would hurt 1.3 million Americans with serious mental illness who are covered by #Medicaid https://t.co/FmG1ljH4YQ"][".@LLSusa opposes #GrahamCassidy: \"this bill would put cancer care out of reach for many\" https://t.co/Cp37CjFTQh"][".@AACNursing represents 800 nursing schools. Members include deans, faculty, students, clinicians, researchers. They oppose #GrahamCassidy. https://t.co/WOw1tlWboP"]["Affordable, high-quality care is vital for our loved ones who live with MS.\n\nThat's why the @mssociety @MSactivist oppose #GrahamCassidy. https://t.co/rv0dLmHk4u"]["@MarchofDimes @nnedv @WithoutViolence @NCADV .@FamiliesUSA opposes #GrahamCassidy: its cuts are \"just as harsh and extreme\" as the proposals rejected in the Senate just a few weeks ago https://t.co/zRFWVXrWrp"]["More than 53 million Americans are affected by arthritis. The @ArthritisFdn opposes #GrahamCassidy. https://t.co/yFd2gOakcS"][".@PPFA: \"#GrahamCassidy makes it harder to prevent pregnancy, harder to have a healthy pregnancy, &amp; harder to raise a family\"\n\n#IStandWithPP https://t.co/cMs3Ktm3Xf"][".@hospitals4kids opposes #GrahamCassidy: by cutting Medicaid by billions, this bill would cut off access to coverage for 30 million children https://t.co/F8WRDfZEYK"]["@aafp @AmerMedicalAssn @ahahospitals @FedAmerHospital @AHIPCoverage @BCBSAssociation \"Health care is too important to get wrong...Let’s agree to find real, bipartisan solutions that make health care work for every American.\" https://t.co/pxLHUsYyxe"]["BIG NEWS: These groups represent thousands of doctors, hospitals &amp; health plans that serve millions of patients. They oppose #GrahamCassidy. https://t.co/Q1SZ7CnkHj"][".@HRC opposes #GrahamCassidy: by cutting @PPact funding, it would \"jeopardize the ability of clinics to deliver preventive health services\" https://t.co/AfhJK3eAau"][".@MarchofDimes opposes #GrahamCassidy: affordable, adequate care is vital to moms &amp; babies—this bill rolls back essential health protections https://t.co/3iA33WiVyY"]["Tomorrow the Senate Finance committee has its hearing on #GrahamCassidy. Today I'll share what patient advocates have to say about the bill."]["Americans of all political backgrounds agree #GrahamCassidy is dangerous for patients and seriously problematic for states. Not a solution. https://t.co/uPxoTPGQrT"]["Americans don't want a cynical, partisan \"victory\" on health care. We need regular order, bipartisanship, a victory for the American people. https://t.co/kwLhk0DtRd"][".@AmDiabetesAssn opposes #GrahamCassidy. Under this bill, people living with diabetes (a preexisting condition) could see premiums skyrocket https://t.co/BeCq1HgqHu"][".@Actuary_Dot_Org: #GrahamCassidy would lead to higher premiums, shoddy protections for preexisting conditions, lower competition in markets https://t.co/rQ72to6I7S"]["My colleague @SenJohnMcCain set a great example for all of us in the Senate today. I hope we follow it. https://t.co/4iY6WTC8dy"]["What's happening w/ #GrahamCassidy takes the worst of Washington to a new level. I agree @BPC_Bipartisan—the American people deserve better. https://t.co/n5sjowZu4x"]["That's right: Republican #Medicaid directors are also sounding the alarm on #GrahamCassidy. https://t.co/8Ps7Q2jroE"]["An idea: We pass a bill prohibiting people w/ preexisting conditions from being discriminated against by insurers. Oh, wait. We already did. https://t.co/Ykt0IzgCx6"]["@statemedicaid Cash-strapped states won't have the \"flexibility\" to design, establish and implement new health care systems https://t.co/0wZMX2iIAv"]["Quite a reasonable request from @statemedicaid directors: Congress should consider outcomes before cutting #Medicaid by hundreds of billions https://t.co/k9g1KG4ner"]["@NAMIDelaware @ChrisCoons Thank you @NAMIDelaware for raising the alarm that #GrahamCassidy would jeopardize access to mental health services &amp; treatment for millions"]["@Gregs_Dad @ChrisCoons @Tylers_atTAcK Thank you for being a strong advocate on this important issue. We should be working to combat this crisis. #GrahamCassidy takes us backward."]["That's $2 billion. Year after year, our state would have to choose between keeping health care affordable and funding other programs. #netDE https://t.co/fdVItCx6C2"]["Submit a statement for the record. Make sure our grandchildren and their children know how the American people felt about #GrahamCassidy https://t.co/xYCUJjvjyh"]["🚨🚨🚨 Monday 1pm the Senate Finance committee will have a hearing on #GrahamCassidy. SPEAK OUT! Email GCHcomments@finance.senate.gov or mail: https://t.co/SsQclOqL3U"]["atTaCK addiction @Gregs_Dad explains how #GrahamCassidy would curb access to life-saving treatments. Asks, \"senators, have you no humanity?\" https://t.co/T8lz4r36LB"]["\"It’s imperative, on us, that we work together to shut down this bill.\" #ProtectOurCare #ProtectPatientsNow #NOGrahamCassidy https://t.co/X3RljN2fEP"]["@ChrisCoons @christianacare @Delaware_DOI @Delaware_DHSS @westsidehealth @HJMCdelaware @LLSdelaware @NAMIDelaware .@christianacare CEO Dr. Janice Nevin knows that loss of guaranteed protections for preexisting conditions means loss of access to coverage. https://t.co/IMPRoZVjhQ"]["@ChrisCoons @christianacare @Delaware_DOI @Delaware_DHSS @westsidehealth @HJMCdelaware @LLSdelaware @NAMIDelaware .@Delaware_DOI insurance commissioner Trinidad Navarro opposes #GrahamCassidy. Analyses show 81,000 Delawareans could lose coverage by 2027. https://t.co/ko1ZS4jb73"]["@ChrisCoons @christianacare @Delaware_DOI @Delaware_DHSS @westsidehealth @HJMCdelaware @LLSdelaware @NAMIDelaware .@Delaware_DHSS Secretary Kara Odom Walker speaks out against #GrahamCassidy, which would cut billions in Medicaid funding to Delaware https://t.co/uCP8Pln9uG"]["I'm standing with @ChrisCoons, health care providers &amp; patient groups in Delaware to speak out against the devastating #GrahamCassidyِ bill https://t.co/2PTpfBh9uu"]["When it's 196 world leaders vs. you and Bashar al-Assad, you're doing something wrong Mr. President. #ParisAgreement https://t.co/lYIoUU5wCu"]["Nearly 2 million veterans rely on Medicaid including 6,000 veterans in Delaware. #CassidyGraham would put their health care coverage at risk https://t.co/UPpruklUhZ"]["I have an idea for my colleagues struggling with the facts on #GrahamCassidy: don't vote on a bill with no CBO score https://t.co/kaKhcyBb85"]["…but the facts, unbiased analyses, health care wonks, governors and health insurers say otherwise. https://t.co/6Mgkiu5AAh"]["Thread: https://t.co/ybKH44gtZ4"]["@dmcgurgan @ChrisCoons Thank you for your fax, Dave. I oppose #GrahamCassidy. Please keep speaking out to #ProtectOurCare!"]["#GrahamCassidy would force cash-strapped states to choose between keeping health care affordable and funding for other areas, like education https://t.co/atXCqsQBM8"]["The devastating consequences of #GrahamCassidy. Tens of millions of people would lose health coverage by 2027, including 81,000 Delawareans. https://t.co/R5FTDr03Lv"]["BREAKING: @commonwealthfnd: #GrahamCassidy would lead to loss of health insurance for &gt;32 million people after 2026 https://t.co/5cZik3VeNh https://t.co/CtATRYyQrE"]["Respectfully, I disagree. I think @jimmykimmel and (millions more) do understand that this bill would be devastating https://t.co/NbecJReDlL https://t.co/Y154cPJ5jo"]["We could put the savings you accrue toward #Medicaid, since your administration wants to cut the program by hundreds of billions of dollars. https://t.co/kHlWgpkly8"]["Mr. Secretary, I invite you to join me on @Amtrak when you travel to Philly. I assure you it's very comfortable with shorter security lines. https://t.co/yiGq32O8qV"]["Delawareans, thank you for your calls, emails, tweets and Facebook posts. I oppose #GrahamCassidy and I'm doing all I can to #ProtectOurCare https://t.co/gg973UJYo5"][".@ahahospitals includes nearly 5,000 hospitals and other providers of care, along with 43,000 individual members. They oppose #CassidyGraham https://t.co/wgtsw5BU4o"]["America, this is a call to arms. Activate your networks. Call your senators and representatives. Make your voice heard! #ProtectOurCare https://t.co/ZR6soXwDn9"]["Trumpcare is back, and it's still \"thoughtless, partisan, cynical &amp; injurious to the most vulnerable in our society\" https://t.co/VcSrxy62mv"]["Ironic. #GrahamCassidy cuts state budgets by billions, making inevitable the rationing and waitlisting of patients that need lifesaving care https://t.co/NYBsE2Nfal"]["Bipartisan group of governors reject the latest version of #Trumpcare, #CassidyGraham. They're calling for bipartisanship and regular order. https://t.co/O1DjLj2lrW"]["@MarchofDimes @American_Heart @LungAssociation @mssociety @ArthritisFdn @alsassociation @AmDiabetesAssn @ACSCAN @JDRF @Vol_of_America From @AARP: should #CassidyGraham come to the Senate floor for a vote, \"we strongly urge senators to vote NO\" #ProtectOurCare https://t.co/dz9LxHbMLj"]["No surprise that cutting hundreds of billions of dollars from state budgets can't actually give states \"greater flexibility.\" #GrahamCassidy https://t.co/GBOxnIDXYs"]["Bipartisan bill to stabilize insurance marketplace, protect care for millions &amp; save taxpayers billions of dollars = red line for House GOP? https://t.co/4xN1sF8MjE"]["@ChrisMurphyCT Under #GrahamCassidy, Americans with preexisting conditions could see their premiums and deductibles skyrocket: https://t.co/PaDRZe1ZQu https://t.co/IGNAY3uhDt"]["97% of scientists agree #climatechange is man-made. Instead of wasting resources debating clear science, let's prepare for climate change https://t.co/SLf99gAAkI"]["#CassidyGraham dismantles Medicaid. States would have to choose between covering fewer people, reducing care or cutting other state programs https://t.co/7md7L43CSP"]["@Lizzard899 Hi Lizzy, please call my D.C. office at 202-224-2441 and ask to speak with Joe. He will be expecting your call and can assist you."]["GOP will have to cheat and deceive to push through #GrahamCassidy without a CBO score. The same tactics would get kids expelled from school. https://t.co/Cg2NNGQOXh"]["#GrahamCassidy fails the @jimmykimmel test with flying colors. https://t.co/uhm1gSNXfI"]["BREAKING: These patient groups are taking a stand against #GrahamCassidy, urging Congress to #ProtectOurCare and continue bipartisan efforts https://t.co/qZaxxncHsZ"]["Our governors know that if one state gains funds at another state's expense, they can lose those funds and more when political winds change https://t.co/23loUoad6z"]["Our governors are not so cynical a bunch that they can be bought off by empty promises. https://t.co/B30OOKlAbo #GrahamCassidy https://t.co/dFqIkTKOty"]["#GrahamCassidy bill \"goes perhaps even further than its predecessors in eroding basic insurance protections and providing for poor people\" https://t.co/Grak7JEWLz"]["Trying to destroy Medicaid under the guise of asking states to be more fiscally responsible is hypocritical. States need to balance budgets. https://t.co/ZfY3mpIWNI"]["We had a great time at Festival Hispano this weekend. It was nice to run into Rosalia, Charlie and Patricia representing La Esperanza! https://t.co/wELRaIJrRk"]["🚨 Our fight to protect health care for millions of families is not over. https://t.co/mfOkVpjQb7"]["This POW/MIA Remembrance Day, I joined fellow veterans to open the new POW/MIA Parkway in Dover. https://t.co/rZhfoXXwd6"]["On #POWMIARecognitionDay we honor and thank the brave Americans who served our country and never returned home. You are not forgotten. https://t.co/wLt8JYYme2"]["Joining the @DelStateUniv community in prayer this morning to help our country, our students and our #Dreamers https://t.co/L6XltWfmDp"]["@EPA @SenWhitehouse @USGAO .@UCSUSA has shown that Trump's @EPA is actively working to erode \"the ability of science, facts, and evidence to inform policy decision\""]["@EPA So @SenWhitehouse &amp; I asked @USGAO to investigate reported plans to replace @EPA scientists with industry officials: https://t.co/2ji3DHqdRK"]["Scott Pruitt has refused to answer my questions about his abrupt dismissal of @EPA scientific advisers back in May: https://t.co/0iTOgNB5aY https://t.co/TSSvvbZHja"]["Ignoring #climatechange won't prevent devastating storms. People's lives depend on all of us acknowledging that #ClimateChangeIsReal https://t.co/Ipq0gVbJQQ"]["Congress, we need to get our heads in the game on #databreach legislation. https://t.co/y3ju0cA0kl"]["Floridians are ready to talk #climatechange. Why isn't @EPA Admin Pruitt? @EPWDems are happy to host a roundtable. https://t.co/dvfhBwDVxu"]["It’s up to us in Congress to do right by these young people. We need to pass the #DreamAct. https://t.co/Cb0l60CJqO"]["For Juan and for hundreds of thousands of #DREAMers across the country, America is home—their only home. #HereToStay\nhttps://t.co/wlhFBM9WjS"]["@DelStateUniv @TheStateNews Indira goes to @DelStateUniv &amp; is studying to become a doctor. She wants to find a cure for cancer. #ProtectDREAMERS https://t.co/CwQG3fFwhp"]["Last week I met with #Dreamers at @DelStateUniv. We need to ensure these promising young people are #HereToStay. https://t.co/rPqgUtDwed https://t.co/6FtgAKO2OF"]["Failing to address #climatechange is a failure in our duty to protect the lives and livelihood of every American\nhttps://t.co/N69kfHNKvW"]["On #September11 we also remember that in the face of evil and in the wake of tragedy, Americans pulled together &amp; emerged stronger than ever https://t.co/PlQPvT2o5Y"]["On #Sept11th we come together and mourn the loved ones we lost that fateful day. With solidarity, we resolve to #NeverForget. We never will. https://t.co/ufuvranNPd"]["As #IrmaHurricane2017 bears down on Florida, @POTUS must reinstate commonsense extreme weather resiliency programs https://t.co/TrvhsHfaAg https://t.co/XRrpznL2g9"]["My message for the 800,000 #DREAMers living across the United States in big cities and small towns, from California to Delaware: We need you https://t.co/fGagA79sX6"]["What does my bill with @timkaine, the Individual Health Insurance Marketplace Improvement Act, include? Reinsurance. https://t.co/5xg6XBB26p https://t.co/p99O6TcWIH"]["@DelStateUniv One #DREAMer told me how he proudly said the Pledge of Allegiance every day since he was 5 because America is the only home he's ever known"]["Yesterday at @DelStateUniv I spoke with some of the most incredible, hardest working young people I've ever met. They were all #DREAMers."]["Erasing economic data of the Clean Water Rule doesn't erase the harm to Americans' health. @EPA must show their work to the American people https://t.co/EcFGWp79lf"]["We stand with Dreamers. We'll do everything we can to #ProtectDREAMers. https://t.co/43Pzns6uRm"]["La decisión del Presidente Trump de darle la espalda a los #DREAMers es una decisión cruel que daña nuestras comunidades y economía."]["President Trump’s decision to turn his back on #DREAMers is a senseless and downright cruel decision that harms our communities and economy."]["#DREAMers in Delaware are some of the most impressive young people I’ve ever met. #DACA helps them stay in the only home they've ever known."]["I agree. To the #DREAMers sitting with me today and to all those across the country: know you're not alone. https://t.co/7yoVKYGoTB"]["Meeting with some of Delaware's #DREAMers at @DelStateUniv. POTUS decision to end DACA is cruel and senseless. Together we will #DefendDACA. https://t.co/KWDXdFAOrw"]["@BPC_Bipartisan For ideas to jack up insurance costs and reduce access to health coverage, see: https://t.co/9bNTDWofOQ"]["For bipartisan ideas to get better health care at lower costs for everyone, see @BPC_Bipartisan, governors' proposal, Problem Solvers Caucus"]["Welcome Lieutenant Colonel Kristen Dahle, @USACEPhilly's new commander. Today we're touring renourishment projects along Delaware's beaches https://t.co/yau9t68ju8"]["With DNREC Secretary Shawn Garvin and officials from @USACEPhilly this morning, touring the Harbor of Refuge Lighthouse and breakwater https://t.co/PQ2z9wxWOB"]["#DREAMers are our friends and neighbors. They contribute to our communities and our economy. They know no other home. We must #DefendDACA!"]["In the First State we have a long tradition of helping our neighbors—whether they live down the street or beyond our borders. #HoustonStrong https://t.co/VFV6MYeVOt"]["I dropped in on these @delawaretech #nursing students' study session. I worked to help expand this vital program 16 years ago! https://t.co/rGUBqnQEib"]["Vets and their families looking to give back to DE can join the @DEStateParks Veteran Conservation Corps. They maintain our beautiful parks! https://t.co/7VNSY77xzI"]["The new @HistoricLewes museum is full of interesting treasures that tell the tales of the Lewes and the First State. #MuseumMonday https://t.co/H33yOfYuM3"]["@HistoricLewes @AAMers I had an excellent time learning about the history of one of my favorite towns in Delaware!"]["Proud to join @JohnCarneyDE as he signs an executive order to start an offshore #wind working group in Delaware. #energy #netde #Jobs https://t.co/1JALTsNDCc"]["In the midst of disaster, we see Americans pulling together⚡️ “The heroes behind Hurricane Harvey relief and rescue” https://t.co/mp7QrJ3aPG"]["I'm closely monitoring Harvey and the devastating floods in Houston. Praying for the safety of everyone in the path of this disastrous storm"]["As a Category 4 hurricane approaches our shores, President Trump pardons Joe Arpaio and puts a presidential stamp on racial profiling."]["Welcome home to the 261st Theater Tactical Signal Brigade of the @DelawareNG https://t.co/nR0hBlywUt"]["I ran into the @TatnallSchool Cross Country team at our First State National Historical Park. It's a great day for a run! https://t.co/mlCY5H071w"]["A shameful act of hatred and prejudice. There's no room for it in our city or our country. https://t.co/eyzkaJPLIQ"]["This land belongs to you and me—not to the highest bidder. @POTUS, the American people want to #KeepItPublic https://t.co/h9t3EpuYHV"]["Traveling through DE and met this young man who can't wait for school to start next week. #backtoschool2017 https://t.co/Sda6h8B7Wz"][".@POTUS is willing to shut down our government over a #borderwall that would:\n\n❌ be ineffective\n❌ destroy natural habitats\n❌ cost billions https://t.co/MJzvNDhU1O"]["Oil companies and elected leaders denying #climatechange—which is already affecting every corner of the globe—may prove even more dangerous. https://t.co/r9NgndmD6W"]["@voxdotcom For decades, the tobacco industry misled the public about the dangers of smoking—which still kills 7 million people every year."]["If you're a veteran in need of a job, come to the Job Fair at Wilmington University's Dover Campus. We will be here until 2pm today! https://t.co/xtl4tAUQoK"]["President Trump's #Afghanistan speech was heavy on what we need to do, but light on how we do it. My full statement: https://t.co/jeRbcGUj9I"]["A quick #eclipse break today with my staff. https://t.co/BO9QhhukYc"]["Free #jobfair for #veterans tomorrow, 8/22, 10 a.m. - 2 p.m. in Dover. More: https://t.co/hkVNTt3FRM"]["Those who went to #Charlottesville to spew hate are cowards and those who maintain neutrality in the face of such clear evil are cowards too"]["Those of us elected to serve have a great responsibility to show leadership in trying times. @POTUS' failure to do so is beyond shameful"]["Would @POTUS knowingly build a golf course in harm's way? Not factoring in #climatechange is shortsighted &amp; wasteful https://t.co/3oowGjV4BC"]["President Trump, bipartisanship is on the horizon. Please don't sabotage this chance for the American people."]["The numbers don't lie. Cutting off #ACA payments would cut millions of Americans from their #healthcare https://t.co/x8ndvGjYHw"]["Following the Golden Rule means we must #DefendDACA and provide certainty to these kids who are American in every way, except on paper"]["But allowing 800K Dreamers to continue leading productive lives in the U.S. doesn't just make common sense. It's a matter of common decency"]["Dreamers contribute to our communities and our economy. In Delaware alone, ending #DACA would cost over $84 million annually https://t.co/jQAumtaOtZ"]["Thanks to #DACA, these young immigrants can go to school, work and pay taxes without living in constant fear of deportation"]["For 5 years now, #DACA has protected and provided certainty to young #Dreamers, most of whom know no other home than America https://t.co/beHDyIapqG"]["@AlexGangitano Thanks for joining me in Delaware!"]["Kudos to CHEER &amp; La Red for partnering to improve senior health in #SussexDE #NHCW17"]["Hatred will not tear us apart. It will only serve to bring us together, to stand taller together against bigotry. https://t.co/2dqApTX2pB"]["The hatred &amp; violence in #Charlottesville is sickening. We all have a moral obligation to unambiguously condemn this &amp; bigotry in all forms"]["Here's another fact: 2016 was the hottest year on record. We can't wait any longer to deal with #climatechange. https://t.co/NEzI2yAH6F https://t.co/zLOnQh1Bbo"]["Great to visit @Siemens new manufacturing facility on Centerpoint Blvd where they're employing new technology to improve train reliability https://t.co/FJ345vltA6"]["@ChrisCoons I’m lucky to serve with @ChrisCoons and @RepBRochester. Together, we’ll get this right for Delaware."]["Facts are stubborn things. Despite its best efforts, this administration can't change the facts about #climatechange https://t.co/q5hGnqZ6li https://t.co/ydWqNaIr4Y"]["Working together - Democrats, Republicans, governors, doctors, insurers, advocates and patients - we can make sure no one is left behind"]["The stage is set for us to do the right thing on healthcare - come together and get a win for the American people https://t.co/X3TROLvgpu"]["@EPA I encourage Delawareans to submit their comments on @EPA's Newark #superfund proposal here before October 2nd: https://t.co/wCMztZKqc3"][".@EPA has proposed listing the Newark South Groundwater Plume site as a federal Superfund site, making it eligible for federal cleanup funds"]["Actions speak louder than words. Despite what he says, @POTUS abandoning #ParisAccord damages America's credibility https://t.co/6oV3P60q7E"]["Happy #CoastGuardDay! Thank you to the thousands of men and women who serve or served our country in the @uscoastguard. #SemperParatus https://t.co/nrLu9Gd8Ub"]["My statement after voting to confirm Christopher Wray to serve as FBI Director: https://t.co/61PfqHEab3"]["Thank you @SenAlexander and Sen. @PattyMurray for your leadership https://t.co/tp8wiwnj8L"]["A wise man once said that insanity is doing the same thing again and again and expecting different results. https://t.co/bKiw6MlB73"]["I may not look it, but I'm excited to join @AliVelshi and @SRuhle on @MSNBC in just a few moments. Tune in! https://t.co/oWI3FOi0BT"]["My bill with Senator @timkaine, the Individual Health Insurance Marketplace Improvement Act, would create a permanent #reinsurance program https://t.co/2I6wdCIRRy"]["BREAKING: Minnesota has released premium rates for 2018. These numbers show that #reinsurance works to reduce costs. https://t.co/eoPzmUelSn https://t.co/j7xq98U7aN"]["Thank you @uscgmidatlantic for Friday's tour and demonstration at the Port of Wilmington! #USCG #GoCoastGuard https://t.co/VQXMSQDtGL"]["We've tried working against each other. Now let's try working together. https://t.co/SSN7ccriPw"]["I couldn't have said it better, @SenJohnMcCain. https://t.co/ueon0oLxNO"]["Tobacco is one of the most addictive and deadly products sold legally in our country. This is welcome news. https://t.co/VlDNSSuysT"]["My statement after 3 Republicans and 48 Democrats came together to vote down #SkinnyRepeal. It's time for regular order. Let's get to work. https://t.co/ktbuU4q9Q4"]["#SkinnyRepeal aside, we still have lots of work to do to provide every American with higher quality care at a lower cost. Let’s get to work."]["Thank you @SenatorCollins, @lisamurkowski and @SenJohnMcCain for putting your constituents and your country above all else"]["Since Sen. Enzi won't yield for comments or questions from @SenateDems, we have to take to Twitter. #AmericaSpeaksOut"]["POTUS has a warped sense of \"great healthcare.\" #SkinnyRepeal = 20% higher premiums, higher deductibles and 16 million kicked off insurance. https://t.co/pqeHuhF6yE"]["Sen. Enzi is complaining about high premiums and deductibles, neglecting to mention the #SkinnyRepeal would make them much worse. https://t.co/fRwL9XFqVK"]["I agree with @LindseyGrahamSC that the Health Care Freedom Act is disastrous policy. That's why I will #VoteNo. https://t.co/FLI5KinMMi"]["To my Republican colleagues: the only way to make sure the #SkinnyRepeal doesn't actually become law is to #VoteNo. https://t.co/AWygEnWtV2"]["Perhaps he could share those deets with the American public and the other 48 senators who'll soon be forced to vote on it https://t.co/49E497Kz6E"]["The \"#SkinnyRepeal\" is not skinny for the First State. More than 40,000 Delawareans would lose coverage. Premiums would increase by $1,000. https://t.co/pzRJfL5xns"]["Another reason why we need #RegularOrder! Patients deserve a seat at the table and a voice in this debate. https://t.co/C5YIdGJoye"]["Bravo Zulu. #LetThemServe https://t.co/JA9E1i0WEP"]["States, our laboratories of democracy, have tried plans like #SkinnyRepeal. They saw higher prices and fewer choices. https://t.co/iF60ukablH"]["Meanwhile, the Senate is considering a bill that would throw 16 million Americans off health insurance and raise premiums by 20% https://t.co/ivG54F66wj"]["Republican governors agree: lasting reforms to our health care system can only be achieved in an open, bipartisan way. #RegularOrder https://t.co/XQry57OLIs"]["Shortly I'll be joining Jon and Melissa on @HappeningNow. Tune in! https://t.co/0XkbKPe9GG"]["The brave Americans who took an oath to defend our country and Constitution deserve our utmost respect and support. #ProtectTransTroops"]["Health care for millions of Americans is at stake. We're going to fight like hell to protect them. @SenateDems https://t.co/j10UCGL3w1"]["Last month I shared my thoughts on leadership. As a former Boy Scout, they feel particularly relevant today. https://t.co/AlkcNAIH5z"]["Delawareans are speaking truth to power about the GOP's devastating #HealthcareBill. I'm encouraging my colleagues to #VoteNo, too. #SaveACA https://t.co/Zp0eLuYwt9"]["Touring @DelStateFair with our nation's ag leaders of today and tomorrow, @SecretarySonny and @DelawareFFA students from chapters across DE https://t.co/x0XKgTHJjg"]["Welcome U.S. Department of Agriculture @SecretarySonny Perdue to the Delaware State Fair! https://t.co/Hb00jArvho"]["My friend @SenJohnMcCain is about as tough as they come. Praying for his recovery."]["These young men and women know no other home. They contribute to our communities and economy. They're our neighbors and friends. #defendDACA"]["Mr. @POTUS, is there room on the bus for us? cc: @SenateDems https://t.co/FP7oAneRCE"]["Molly was a great role model for everyone who is a journalist and, frankly, for everyone who was not. I'm sure going to miss her. https://t.co/ZocRWgXdcx"]["We don't need a Democratic or GOP \"victory\" on health care. We need a victory for our country. For that, we need governors at the table. https://t.co/MeDPdJVSSv"]["Heading to the Senate floor now to talk about moving forward and working together to improve our health care system: https://t.co/QZZRWTVeNl https://t.co/tDzip8Tm18"]["We need to hit the pause button, stabilize #healthcare exchanges, follow regular order &amp; work on a bipartisan plan w/ governors at the table"]["This provision would put the individual market into a death spiral and force people to pay more for poorer coverage https://t.co/NhcNqN7NI2"]["@USGAO To ensure a successful 2020 #Census, President Trump should nominate an experienced and qualified individual to be our next Census Director."]["The 2020 #Census is facing serious challenges, as highlighted by @USGAO’s High Risk List: https://t.co/ODmplTgUzD"]["The #Census allocates seats in the House of Representatives and shapes congressional districts. It's central to our future."]["The Census Bureau's work is a cornerstone of our democracy, enshrined in the Constitution. It cannot be undermined. https://t.co/6yghR7942W"]["Goodbye old station! Today we're breaking ground on the Newark Regional Transportation center. https://t.co/74Ezi9jKzN"]["In Rhode Island with NGA. Many governors here—Republicans and Democrats—agree we need to work on a bipartisan plan. https://t.co/rMSMCuERIj"]["Thanks Sam for making it possible for me to talk health care with @kellymcevers @npratc this afternoon. Tune in tonight to hear our convo! https://t.co/9mJehwTAcE"]["Ready to roll up my sleeves and work with you @SenatorCollins. Our country depends on it. https://t.co/WC3pFeAkzg"]["Millions of Americans feel otherwise. Senator @RandPaul, you might be surprised at where we could agree. https://t.co/XgppVqYhea"]["Our country's #DrinkingWater system consists of one million miles of pipes—the majority of those pipes are 50+ years old. We need to invest. https://t.co/QtoNu8VmqS"]["Yet another drinking water crisis could happen in thousands of communities in all 50 states. We must do better. https://t.co/cnnKzX5Fdg https://t.co/DQx7SAF5T8"]["I believe the #GoldenRule is embodied in the Delaware Way. We should all try to invoke that spirit each and every day #NationalDayofCivility"]["I was a P-3 aircraft mission commander during the Vietnam War. We didn’t trust the Soviets then and, frankly, don’t trust the Russians today https://t.co/3R8D0aDhqO"]["Great to have Appoquinimink Schools Superintendent Matt Burrows with me to see our pal @JoeBiden. Almost convinced him to join me on @MSNBC! https://t.co/nxkmMk2Pvk"]["Praying for the loved ones of the 16 service members whose lives were lost in the USMC KC-130 accident yesterday https://t.co/QdbDLCzfeP"]["@OfficeGovEthics An excerpt from Walter Shaub's testimony to @SenateHSGACDems in 2012—a reminder of the important role OGE Director serves in our government https://t.co/hcWZqRpavf"]["Thank you @OfficeGovEthics Director Walter Shaub for your work to protect and fortify Americans’ trust in our democracy"]["Delawareans, I hope you'll be able to join my friend @ChrisCoons for his Facebook LIVE discussion on health care tonight! https://t.co/bqErFY1DpA"]["The GOP health care plan would hurt our rural hospitals, cutting $2 billion from DE's Medicaid funding over the next decade. #ProtectOurCare https://t.co/IsnVDaKRNC"]["Fist bumping a fellow Blue Hen. Kaylee was just awarded a full scholarship to attend @UDelaware in the fall. #Delaproud https://t.co/v8VZRWzkea"]["My tour of the new Primeros Pasos Early Childhood Learning Center today was led by sisters and former graduates Evelyn, Ashley and Kaylee https://t.co/Nojd3heAfR"]["Rural hospitals often have operating margins of &lt;1%. #Trumpcare's deep Medicaid cuts would threaten the sustainability of these facilities. https://t.co/a7YCRDK8vR"]["Today I joined Terry Murphy, CEO and president of Bayhealth Medical Center &amp; Milford Mayor Bryan Shupe at the Bayhealth Sussex Campus site https://t.co/UTwVnD30Sv"]["@6abc we are having a great time in Delaware at the parades! #6abcAction #HappyIndependenceDay https://t.co/HudTqIkz0m"]["I had a great time today at the Clayton, Bethany and Hockessin parades. Happy Fourth of July! #HappyBirthdayAmerica https://t.co/zyCr5ob5Ow"]["Wishing you and your family a happy #IndependenceDay. Today we celebrate America's promise of life, liberty and the pursuit of happiness. 🇺🇸"]["The law requires that Americans be protected from harmful pollutants like methane. Scott Pruitt can't ignore the law https://t.co/JNJXBISoLi"]["I sat down with @BillCassidy @chucktodd for an open and bipartisan conversation on improving our health care system: https://t.co/DPzrhAUBQw"]["Tune into @MeetThePress on Sunday for my conversation with @chucktodd and @BillCassidy on health care reform. #MTP https://t.co/FM9JgYtkss"]["The Bennett family uses sustainable farming methods to grow delicious blueberries and peaches. Thank you @BennettOrchards for my visit! https://t.co/W2BDk5YtWs"]["For every federal dollar invested, the National Estuary Program leverages $19 in our local economies. Cleaner water, stronger economy. https://t.co/HqtnqKGDSJ"]["POW&amp;R offers supported employment and other services. It relies on Medicaid for 90% of its funding. #Trumpcare would wipe out that funding. https://t.co/DI6DsUjHKW"]["Heard from @AutismDelaware POW&amp;R staff and parents about its important mission and services for Delawareans with autism spectrum disorders https://t.co/O2rmMcxpkL"]["This morning I'm meeting with @AutismDelaware in Lewes to discuss the programs and services at risk under #Trumpcare's deep cuts to Medicaid https://t.co/iyKO1o44LJ"]["@boyscouts @USNavy Let's all work hard to be examples for young people learning from us about how to treat one another and how to talk about one another."]["@boyscouts @USNavy Leaders surround themselves with a great team and they serve as an example to all who are watching."]["@boyscouts @USNavy Leaders treat other people the way they want to be treated. Leaders don't disparage others to elevate themselves."]["It's important to remember what makes a good leader. From my time in @boyscouts &amp; @USNavy to my job in Congress, the qualities don't change."]["Proud to join my friend @SenSherrodBrown on this Senate Resolution. https://t.co/X4BnPMwpfN"]["Americans want better health care and lower costs—not less access to health care, worse quality care &amp; higher costs. https://t.co/5NuSBGvhJe https://t.co/BTrnI9pBzU"]["I agree with @JohnKasich: Let's put the country first. https://t.co/yIIwsJJWxP"]["We cannot guarantee life, liberty and the pursuit of happiness without access to health care. Celebrate the 4th by making your voice heard. https://t.co/UE5bBfYrSb"]["We're standing up for the millions of Americans who will suffer under #Trumpcare. We must do better. #AmericaSpeaksOut https://t.co/VTy2thxbv8"]["Where is the president's invitation for @SenateDems? https://t.co/YxLzRLoBv8"]["Happy to join the conversation. https://t.co/goorayCQsc"]["\"These bills are inhumane. It would devastate our ability to provide addiction treatment services.\" -DE Public Health Director Dr. Rattay"]["\"Treatment is cost-effective way to treat addiction &amp; mental health. Medicaid is cheaper alt. to incarceration.\" Chris Duvaney, Connections"]["\"We lose a Delawarean every day to overdose. Under these bills never have so few been so cruel to so many.\" Dave Humes, AtTAck addiction"]["\"Give us the resources we need to help our communities. We can't solve this through policing only.\" Cecilia Ashe, Wilm PD, on #healthcare"]["Who gets hurt by more than $800 billion cut from #Medicaid? Millions, including seniors in nursing homes and people suffering with addiction https://t.co/PBRfeIvZg6"]["As founding vice-chair, I was proud to meet with the next generation of @truthinitiative leaders who are working to help reduce tobacco use https://t.co/XxrW87vaNx"]["While defunding @PPFA, the Senate GOP's #HealthcareBill would increase unhealthy pregnancies, birth defects and rates of infant mortality https://t.co/GPmoEPmBIn"]["The Senate GOP #HealthcareBill defunds Planned Parenthood for a year and allows insurers to skip out on maternity care"]["No matter where someone is in their job search, they still need health care. Their children still need health care. https://t.co/DxodBFOJnF"]["Under the Senate GOP #HealthcareBill, states could kick people off Medicaid if they’re struggling to find a job\nhttps://t.co/tA2JLh3UmW"]["Under the Senate GOP #HealthcareBill, Americans will pay more in premiums and deductibles for skimpier benefits"]["What do we know about the Senate GOP #HealthcareBill? That it's even \"meaner\" than the House GOP health care bill https://t.co/YjUh8xQHL6"]["Behind the scenes of my convo with @soledadobrien on health care reform. Check your local listings and watch Sunday: https://t.co/DoXg12Gxa9 https://t.co/vTOG30AyBp"]["The next class of #TFAS students are our nation's next generation of leaders. Great to be with @senrobportman to celebrate them last night. https://t.co/euev6H3gTa"]["Great evening celebrating @TFASorg's outstanding students! https://t.co/YnU1zlkJ8W"]["We can't allow insurance companies to decide who can get health insurance, what coverage includes and how much it costs. #AmericaSpeaksOut https://t.co/rIgeVepM2Q"]["Thank you for meeting with our team about this important issue @PanCANdelaware, and a very special thanks to Morgan for her note. #WageHope https://t.co/I2cqzoxGH1"]["Under #Trumpcare, older Delawareans could pay 800% more for less care. #AmericaSpeaksOut https://t.co/ghXg4KjW14"]["By kicking 23 million people off their health insurance, AHCA would put families one illness away from financial disaster. #AmericaSpeaksOut https://t.co/D2MNu3EvKJ"]["#Trumpcare breaks with our moral obligation to care for the most vulnerable people in our society. Yes, Mr. President, it's just plain mean. https://t.co/2mYmxzPPhB"]["Under #Trumpcare, Delaware would lose $2 billion in Medicaid funding over 10 years. Thousands will lose coverage. We must #SaveMedicaid. https://t.co/sOc5pZgQ3h"]["Medicaid coverage gave Greg's family the freedom to pursue happiness. AHCA would rob that freedom from millions of people. #AmericaSpeaksOut https://t.co/FZIy9pwz3F"]["#ShowUsTheBill! https://t.co/ihVqGBWKJ5"]["Press conference in Dover about the #AHCA's impact on Delawareans https://t.co/PLwJ3ijVfC"]["Under the #AHCA, older Delawareans could pay 800% for skimpy health insurance plans. We must do better. https://t.co/6Yz02paLrS"]["Happening soon: I'll be with @DE_DOJ @Delaware_DHSS @Delaware_DOI and Delawareans to discuss how the #AHCA will impact families in our state https://t.co/XeISHmE8rZ"]["President Trump's decision on Cuba reflects a backward-looking view on U.S.-Cuba relations https://t.co/fbkdvpqyMq"]["Thank you American Association of University Women for visiting me at the Capitol this week. https://t.co/H95LMdHoXu"]["For Michael, #ACA's protections for preexisting conditions ensure his family has access to affordable, high quality, life-saving health care https://t.co/i2yeaqUYab"]["Michael Davis is an extraordinary young man. In any given week, this Delawarean overcomes more adversity than most of us face in a lifetime. https://t.co/fDG4VnmHgo"]["What a #TBT! Good luck to those playing in the #CongressionalBaseballGame tonight. No matter what side you're on, we're all on the same team https://t.co/Bu6VZjtR3I"]["&amp; these revelations bring new questions, which is why I'll keep pressing @EPA to respond to inquiries from Congress \nhttps://t.co/4QNurfWT9U"]["It's revelations like this that make members of Congress feel like we're not getting the full story from Mr. Pruitt\nhttps://t.co/llhcQ1rYCn"]["Thank you for what you do! Those of us in Congress need to work together to #KeepKidsCovered—that means protecting Medicaid. https://t.co/WGLuSwKn4Q"]["The poultry industry thrives when U.S. products have access to markets abroad. Glad to work together to bolster poultry farmers &amp; processors https://t.co/lhzxAtUXXl"]["Proud to be on a bipartisan team of senators urging @USTradeRep to support poultry farmers, processors and exporters in NAFTA renegotiation: https://t.co/krZG1FMzcC"]["Praying for Steve Scalise and all those affected by the horrible attack in Alexandria, including our brave officers with U.S. Capitol Police"]["@ChrisMurphyCT Americans rely on journalists to shine a light on what's happening in Congress"]["Just ran into my friend @ChrisMurphyCT. I agree. https://t.co/4plcOGAq0B"]["Enjoying the Pride of the Capital, the Dover HS marching band, at the Delaware Veterans Home 10th anniversary celebration this AM! https://t.co/rlfDUoBdyf"]["The \"greatest bill in the history of the world on health care\" would not destabilize 1/6 of the insurance markets"]["The \"greatest bill in the history of the world on health care\" would not cause an 800% premium increase for older Americans"]["The \"greatest bill in the history of the world on health care\" would not cut more than $800 billion from Medicaid"]["The \"greatest bill in the history of the world” would not cause 23 million to lose their health care coverage"]["Mr. President, the AHCA isn't even in the same ballpark as the \"greatest bill in the history of the world on health care.\" https://t.co/o33B58sgIV"]["The First State will continue to lead by example. Proud that Delaware is still committed to smart emissions standards for cars and trucks https://t.co/Ca7R7okt7o"]["Even if President Trump and Scott Pruitt try to gut smart environmental standards, progress won't be stopped https://t.co/1rwdCufUX2"]["And for the #AHCA? No public hearings. No real efforts to communicate, collaborate or compromise with Democrats. https://t.co/H7NXxCcjkq"]["Spoke with @6abc @sarahbloomquist about today's #ComeyHearing. Congress needs to get to the truth. Americans deserve the truth. https://t.co/wGiVOGY23m"]["Today I voted against a procedural measure moving forward legislation to impose sanctions on Iran. Here's why: https://t.co/cQRHtyFP3U"]["President Trump can call @SenateDems all the names he wants, but the reality is that his White House is dropping the ball on nominations https://t.co/0KlNSrnXuh"]["People in Pittsburgh know that moving our country forward can't mean going backwards on #CleanAir and climate rules https://t.co/TfSiz4ELfK"]["#CleanAir Act regulations and protections have driven investments in clean energy technologies that create and support American jobs https://t.co/kuC1fum46C"]["We're talking about the economic opportunities created by past Clean Air Act regulations and protections. Tune in: https://t.co/ooLn8hljhb https://t.co/vYQz0hCAgK"]["Since President Trump refuses to lead in tackling the greatest environmental challenge of our time, it is now up to all of us. #ActOnClimate https://t.co/YgDrqL6ZPT"]["Proud that Delaware has joined the U.S. Climate Alliance, affirming the First State's commitment to #ActOnClimate https://t.co/Y9v7ezXJY5"]["To me, the Golden Rule means we have an obligation to care for all of the living things that share this planet with us. #WorldEnvironmentDay https://t.co/SPrYZE2ukH"]["On National Gun Violence Awareness Day #WearOrange for the people and families who have suffered the tragic consequences of gun violence https://t.co/nSri07rvK9"]["In the words of @Alanis Morissette, \"Isn't it ironic? Don't you think?\" https://t.co/k5Fn916kQf"]["The EPA Administrator and his staff should be able to read and keep up with the latest science. #ClimateChangeIsReal https://t.co/YeNtxHi8TT"]["#ClimateChangeIsReal https://t.co/VDpTfDk0Va"]["President Trump has decided to withdraw U.S. from the Paris Climate Agreement, abandoning economic opportunity and potential to create jobs https://t.co/rhQOOXwipX"]["The Paris Agreement is a good deal for America. President Trump's decision to withdraw U.S. is a good deal for China https://t.co/iieJSVd19X https://t.co/Z3MWXRe0UD"]["No one nation can overcome global warming alone. We must work together and #ActOnClimate to protect this planet for future generations https://t.co/vvgkJpsof7"]["Scott Pruitt has long history of standing with industry over doctors. No surprise he’s been pushing President Trump to leave #ParisAgreement https://t.co/UGdV8sGBiQ"]["Withdrawal from #ParisAgreement means we'd stand with Assad instead of leading global efforts to #ActOnClimate and overcome global warming https://t.co/ROZLpJ2cdx"]["Last year, one in 50 jobs created in the U.S. were in the solar industry. We should stay on a clean energy path and stay in #ParisAgreement. https://t.co/yRgEMDk1TH"]["#TBT to 2009 when Donald Trump urged President Obama to lead the world by example &amp; #ActOnClimate. Will President Trump heed his own advice? https://t.co/ypjAJi4GpB"]["Climate change is bad for businesses. That's why American businesses are urging President Trump to keep the U.S. in the #ParisAgreement. https://t.co/ddk32zHduN"]["Thomas Edison once said that, \"opportunity is missed by most people because it is dressed in overalls and looks like work.\"\n\n#ParisAgreement"]["Please share! https://t.co/XtpaLUk4C4"]["Withdrawing U.S. from #ParisAgreement would \"cause serious diplomatic damage\" &amp; diminish America's global leadership https://t.co/7VmYCZ6OAo"]["#ClimateChangeIsReal and we must act now. The U.S. should lead the global fight against climate change, not withdraw from it #ParisAgreement https://t.co/orL1uBARiA"]["On #MemorialDay we also remember veterans still with us—they are living testaments to the sacrifices made to protect the freedoms we cherish"]["Congratulations #UDGrad2017 on your commencement today! @UDelaware https://t.co/SNWVrrff0X"]["Thanks to Jay &amp; his family for the tour of Baxter Farm's conservation practices they do w/help from @NRCS_DE #fridaysonthefarm https://t.co/txRAycQNaH"]["Postal reform is an important part of getting @USPS the resources they need to partner with CBP to detect and intercept illicit drugs https://t.co/VgHuKQk5z2"]["Over the past 3 years, as the opioid epidemic has worsened, CBP seizures of fentanyl have dramatically increased https://t.co/bc9U9ICrDU https://t.co/SqzgsORFAg"]["My statement on the #CBOscore for the House GOP health care plan, AHCA: https://t.co/s1fIJZP7w2"]["The House Republican health care bill isn’t about health care at all, it’s about politics. https://t.co/ZdQEAAi2B8"]["It's clear House GOP wanted a political victory at any cost, even if it meant passing a bill that would take health coverage from 23 million"]["The first #CBOscore sunk the AHCA's chances of getting a vote. Now we know why House GOP rushed to pass this version—it’s just as bad."]["Tomorrow at 9:30am @senrobportman and I will hold a PSI hearing to examine drug trafficking and the opioid epidemic https://t.co/bc9U9ICrDU https://t.co/EhE0tkSXIN"]["He's out of the country but I hope he gets our message. President Trump, stand with these 195 signers and stay in the #ParisAgreement. https://t.co/c8nu5fA650"]["The White House is ignoring questions they don't want to answer. That's not how it's done. cc: @SenateDems https://t.co/K64U0v2SiH"]["Communities can't ignore rising seas and the vestiges of climate change. President Trump, #ClimateChangeIsReal. Stay in the #ParisAgreement. https://t.co/aJckqafaXZ"]["Walking away from the historic #ParisAgreement will have real costs to our economy https://t.co/xNQABMzULW"]["If President Trump withdraws the U.S. from the #ParisAgreement, he will cede global leadership and thousands of clean energy jobs to China https://t.co/HVGWhJnmRx"]["President Trump shouldn't allow the U.S. to stand down and China to take the lead in global efforts to #ActOnClimate https://t.co/D52nLELu7X"]["I often say government's role is to create a nurturing environment for job creation and job growth. #TrumpBudget would do just the opposite."]["Save two scoops for me and @JoeBiden! https://t.co/p0usi28hF8"]["I'm praying for the victims of the Manchester terror attack. The perpetrators of this evil attack must be brought to justice."]["This recklessness flies in the face of President Trump's promise to ensure that all Americans have better, less expensive health insurance. https://t.co/Ef0GkgOibo"]["Threatening to stop cost-sharing reduction payments will cause insurers to jack up rates or leave the markets https://t.co/knIvMbJf8e"]["The Trump Administration's continued assault on the ACA's insurance marketplaces is sowing confusion and fear https://t.co/7nAA9BEOSh"]["Welcoming HS students from all over Delaware this AM at @DelStateUniv for the Congressional Youth Conference w/ @ChrisCoons @RepBRochester https://t.co/ifVQJuCknQ"]["Proud to join @AmericanLungDE and @YourDNREC to talk about federal protections for clean air in Delaware and across the nation. https://t.co/QSHnYAPh65"]["Glad to work with you @SenPatRoberts, our amendment will help to improve care coordination and patient health outcomes https://t.co/AqbzZKS9Dd"]["If President Trump disclosed classified information to Russian officials, @ODNIgov must conduct an intelligence damage assessment https://t.co/V387VCbomN"]["Very encouraged by the news. This appointment is a tremendous step toward giving Americans the truth they deserve. https://t.co/XloJaua80T"]["We asked Scott Pruitt how @EPA will curb harmful emissions without the #CleanPowerPlan. \n\nHe sent us press releases. https://t.co/FXRCAwh1m1 https://t.co/nleAOYhOTQ"]["Thank you for meeting with our team @godelata! https://t.co/e1FQIkfhaH"]["Grateful to meet @ALSphiladelphia's advocates &amp; families from Delaware. We must ensure those with ALS have access to quality care they need. https://t.co/3Qii42uMhR"]["We have a saying in the U.S. Navy: Loose lips sink ships. https://t.co/3RecQEXoYV"]["It's #TimeToBuild a 21st century infrastructure system. That starts with smart and strategic investments. #InfrastructureWeek https://t.co/e2fuWZyDrR"]["Excited to announce this morning that Bethany, S. Bethany and Fenwick will get beach renourishment this fall to protect our towns https://t.co/HojVJMk18t"]["Hey @daveweigel. Despite its size, the First State packs a big punch. But I've never heard of Delaware punch. Usually stick to @dogfishbeer. https://t.co/23FFCjskmg"]["For more than 45 years, the Limen House in Wilmington has provided Delawareans with a safe place to recover from addiction &amp; substance abuse https://t.co/J5l6jmRjxb"]["This morning I sat down and spoke with Delawareans at the Limen House who are working to rebuild their lives in recovery from addiction https://t.co/pfP6bl3ImZ"]["Congratulations to the residents of Sacred Heart Village II on your new home. #seniors #inwilmington #netde https://t.co/q5lISOHa6I"][".@EPA #TBT to Washington, D.C. in 1973. Raw sewage flowed into the Potomac River, fouling the waters outside the #Watergate. #EPABackToBasics https://t.co/yW4yQEdzvf"]["Aetna is pulling out of all ACA marketplaces in 2018, leaving Delaware with only one insurer in its individual health insurance market. https://t.co/xIH9Mj7QgN"]["\"The only thing new in the world is the history you don’t know.\"—President Harry S. Truman \n#ComeyFiring"]["Congress must appoint a special counsel to ensure that findings on Russia's influence in the 2016 election are not clouded by partisanship."]["What changed since the president took office for him to lose confidence in FBI Director Comey’s ability to do the job?"]["Shocked and deeply concerned by President Trump’s firing of FBI Director James Comey. This decision raises more questions than it answers."]["@EPWDems @EPA We need an @EPA #GuidedByScience. Anything less is unacceptable."]["@EPWDems @EPA Scott Pruitt's aggressive denial and dismissal of scientific principles will not create clean water and “beautiful, immaculate air.”"]["@EPWDems @EPA Scott Pruitt's aggressive denial and dismissal of scientific principles will not cause toxic chemicals to suddenly become safe"]["@EPWDems @EPA Scott Pruitt's aggressive denial and dismissal of scientific principles will not prevent the seas and temperatures from rising"]["A message to President Trump from businessman Donald Trump in 2009. Let's continue to \"lead the world by example\" &amp; stay in #ParisAgreement https://t.co/OJTpQd66Hn"]["Under AHCA, insurance companies can look to their bottom line to decide who deserves health care—and at what cost. https://t.co/VVc012HtVn"]["The AHCA's $800+ billion cut to Medicaid would cause millions of people to lose Medicaid coverage. That's the truth. https://t.co/FjbZOvzx4s"]["@H3ath3rBlock Heather, you can count on me to vote no on AHCA."]["Before the ACA, more than 150,000 Delawareans could be denied health insurance due to preexisting conditions. We can't go back. https://t.co/617HbGRq0n"]["Law enforcement process into @DEStatePolice service for Cpl. Ballard. A sad day for DE &amp; country, but a beautiful service for a great man. https://t.co/FtO9ZyotAt"]["House GOP playing \"Rocky\" theme song to get amped for #Trumpcare vote. Lives are at stake. We are better than this. https://t.co/HFImjKmySL"]["Please take a moment to read this thread https://t.co/mViZkSZBuJ"]["All Americans deserve that peace of mind. https://t.co/kMLuBX6vDF"]["Can House GOP explain why members of Congress are the only people entitled to protections for preexisting conditions under AHCA?"]["What we don’t know is the damage AHCA will have on middle class families and our economy because House GOP plan to vote without a CBO score."]["We know that AHCA puts Americans back at the mercy of insurance companies, which will choose who can get covered &amp; what that coverage costs."]["We know that AHCA will kick more than 20 million Americans off their health insurance plans."]["Happening soon in the Senate: a vote on a CRA that will make it harder for Americans to save for retirement. I'm voting NO. #SaveRetirement"]["Put lipstick on a pig &amp; it’s still a pig. The Upton amendment doesn't change that people with preexisting conditions will suffer under AHCA."]["No amount of money changes the fact that #AHCA lets insurance companies decide who gets health care and for how much https://t.co/EY7M7NG809"]["Talk about conflict of interest. Administrator Pruitt owes us answers. https://t.co/HRq4W1RlDT https://t.co/HabbbDyqWo"]["Scott Pruitt is leading @EPA’s efforts to rewrite ozone standard, #CleanPowerPlan and #CleanWaterRule—the same rules he tried to sink as AG."]["Thank you for introducing this historic bill, @SenJeffMerkley. Proud to be a cosponsor. #EqualityForward https://t.co/JpjznyiwZo"]["Investing in fuel cell tech, which powers this #zeroemission car, will help us protect clean air and #ActOnClimate https://t.co/uaH8oRFW8D"]["Thanks for letting me take a spin in the #zeroemission Clarity! https://t.co/rE6vF0rzOp"]["On #WorldAsthmaDay, let’s all urge Administrator Pruitt to help make #CleanAir4Kids. https://t.co/zs6WEKpB33"]["Air pollution is dangerous, but it’s life-threatening for the 6.2 million American children who suffer with asthma"]["Well, this is welcome news! https://t.co/nmHCSlPaCF"]["Mr. President, please read your bill. It puts Americans with pre-existing conditions back at the mercy of insurance companies. https://t.co/BVetqiEKpq"]["Proud to stand with @CleanAirMoms, champions for climate action and #cleanair4kids https://t.co/yUgG4rOcJj"]["Delawareans at the #climatemarch are speaking truth to power, loud and clear: the First State can't wait to #ActOnClimate https://t.co/L1UGHxEWtd"]["We stand to lose so much if we fail to act now on climate change. We won't back down. #climatemarch https://t.co/I6E4P9a82g"]["Happy to stand with Massachusetts Attorney General @maura_healey at the #climatemarch https://t.co/HEKO3D0gDm"]["Need a reason to join us at the #climatemarch today? https://t.co/v4V1tV7Stw"]["In DE on this sunny day to celebrate Arbor Day at Dover Air Force Base. https://t.co/NgC0NmySSU"]["We should be working together to make sure that our children and grandchildren have clean air to breathe, air that's free from air pollution https://t.co/NfWMkm7xyu"]["Incredible to see the innovative tools and technologies available to Delawareans at  @DoverLibrary_DE and the First State's public libraries https://t.co/juBcV7wrkN"]