["There is no place in our nation for attacks on large groups of people based on their race, religion or country of origin, especially from the President of the United States. America is better than this and President Trump should be too."]["The President’s remarks were wrong, hateful and divisive. Unfortunately, this kind of poisonous rhetoric is part of a pattern from President Trump that dates back decades, occurred during the campaign and continues to this day."]["America is better than this and our president should be too. https://t.co/RIhRpMd7If"]["When it comes to the opioid crisis, the Administration has been all talk, no action. They should support my legislation to invest $45 billion in programs that provide treatment and prevention. https://t.co/soWJYNtUZV"]["Allow me to translate, \"Under the Trump Administration, HHS has been and remains committed to sabotaging health care for all Americans and hiding it from members of Congress and the American public.” https://t.co/uu3f2Isij9"]["The Trump Admin made a slimy deal w/ extreme Congressional Rs to sabotage the ACA. They refused to release the secret deal. Read here how I made them do it. https://t.co/h5spD87TJn"]["During the health care debate, Republicans in Washington said they support $45 billion in funding. It’s far past time the federal government stop paying lip service to the opioid crisis and start investing in treatment and prevention."]["Thus far, the Administration and congressional Republicans have advocated steps, like decimating Medicaid, that would worsen the opioid public health emergency and reduce access to treatment."]["Congressional Republicans should give sustained focus to this problem and take up my legislation."]["Now, the federal government must do its part so that states don’t have to deal with this alone. I have introduced legislation that would invest $45 billion in programs that combat opioid addiction and provide treatment for those who need it."]["This declaration will bring additional resources to bear on this horrific public health emergency that has ripped apart far too many families. https://t.co/BrFay44ScT"]["Remembering Gov. Casey today on what would have been his 86th birthday. We pay tribute to his life of commitment to his family, his faith and honorable public service to our Commonwealth. https://t.co/fRWVwz0284"]["On the floor speaking about the importance of #CHIP. WATCH LIVE: https://t.co/Wblbgq3fmj"]["Or the equivalent of $1,478 for every American in the workforce."][".@CNNMoney reports that companies are projected to spend $450 billion in stock buybacks this year. https://t.co/Uy75GH0p3A"]["Joining @SenMarkey’s CRA to reverse the @FCC's repeal of #NetNeutrality. We must ensure a free and open internet for all. https://t.co/HCHLXaIacj"]["@CDCgov @USCG @TSA @fema Republicans must stop with the games and pass #CHIP now."]["@CDCgov @USCG @TSA @fema The parents of 9 million kids are worrying about whether their kids will have health insurance, while Republicans rammed $36 billion in tax cuts for millionaires through Congress."]["@CDCgov @USCG @TSA @fema The top 1% will see an average tax cut of $51,140 – or about $4,260 a MONTH (TPC)."]["@CDCgov @USCG @TSA @fema Under the GOP tax plan, over 57 million households making under $100,000 a year will see a tax increase or a tax cut of less than $9 a month in 2019 (JCT Table D-17-58)."]["@CDCgov @USCG @TSA @fema Larger than the annual appropriated budget for WIC – food assistance for women, infants and children;"]["@CDCgov @USCG @TSA Larger than the annual appropriated budget for @FEMA."]["@CDCgov @USCG Larger than the annual appropriated budget for the @TSA;"]["@CDCgov Larger than the annual appropriated budget for the @USCG;"]["The tax windfall for these 6 big banks is larger than the annual appropriated budget for the @CDCgov;"]["$13 billion could also fund 2.2 million maximum Pell Grant awards of $5,920 – Pell Grants help low-income kids pay for college."]["Altogether our nation’s 6 biggest Wall Street banks stand to net at least an additional $13 billion in tax cuts this year. That’s 16 times larger than the cost of the CHIP reauthorization."]["Goldman Sachs could also gain hundreds of millions in tax cuts this year;"]["Morgan Stanley stands to gain $833 million in tax cuts this year – that’s about the same as the cost of the CHIP reauthorization;"]["Bank of America stands to gain $3.5 billion in tax cuts this year – that’s more than 4 times larger than the cost of the CHIP reauthorization;"]["JP Morgan stands to gain $3.3 billion in tax cuts this year – that’s 4 times larger than the cost of the CHIP reauthorization;"]["Citibank stands to gain $1.4 billion in tax cuts this year – that’s almost 2 times the cost of the CHIP reauthorization;"]["This tax bill is a massive tax giveaway to the super-rich and big profitable corporations. Let’s look at what the billions in tax windfall to Wall Street banks could buy us."]["Meanwhile, Republicans rammed $9.5 trillion in tax changes through Congress in 49 days."]["Republicans are holding the healthcare of 9 million kids hostage over the “cost” of the CHIP reauthorization - $800 million."]["#CHIP legislation has now been held up for 100 days."]["A hero indeed. https://t.co/NA3ikQIOzi"]["Tragic news out of North Philly and a stark reminder of the risks our first responders face every day to keep us safe. My deepest sympathies to his family, friends, and fellow firefighters. https://t.co/KlbEoTPKlF"]["It’s an honor to be back once again to the PA Farm Show. Not only is the Farm Show an opportunity to enjoy excellent Pennsylvania-grown and made products, but it’s an opportunity to hear directly from the individuals behind Pennsylvania’s number one industry- agriculture. https://t.co/jS0DwgZy8K"]["The Administration’s “commission on election integrity” was always a scheme to suppress certain groups of Americans from exercising their right to vote. Good riddance https://t.co/y02pnX49Tf"]["This is exactly the kind of reckless behavior I was hoping we would avoid in 2018. Please Mr. President, no more diplomacy via twitter. https://t.co/EH2kot3kHX"]["Our nation must always stand up for human rights. I will continue to press for the basic human rights of individuals throughout the world https://t.co/PmeFib5cv7"]["The Iranian regime’s response to protests is a reminder of their terrible human rights record and repression of dissent"]["Congratulations to @PennStateFball on winning the 2017 @Fiesta_Bowl!"]["@PennStateFball @UW_Football @Fiesta_Bowl @psucreamery @SenatorCantwell Well that was fast! Great start #PennState!"]["Good luck to @PennStateFball as they take on @UW_Football in the @Fiesta_Bowl. I have a case of @psucreamery ice cream 🍦 riding on this game with @SenatorCantwell! #WeAre #FiestaBowl"]["To all those celebrating tonight, my family wishes yours a Happy Kwanzaa!"]["My thoughts are with everyone in Erie and northwestern PA who are impacted by this snowstorm. Please listen to directions from local officials. Thank you to all the first responders and others who are dealing w/ this storm."]["Our entire state is thankful for the work of law enforcement in Harrisburg last evening. Our brave law enforcements officers took extraordinary risks last night, as they do daily, to keep us safe"]["Instead of passing a bill, which stiffs kids, our law enforcement officers and fails to protect the Dreamers, members of Congress should stay in town and address these issues."]["Rs who run Congress had all the time in the world to cut taxes for the super-rich and big corporations &amp; now are urgently skipping town before families who rely on CHIP have peace of mind in knowing that their kids’ health care will continue beyond a matter of weeks"]["It’s outrageous that Republicans in Congress are rushing to go home for Christmas instead of fully reauthorizing the Children’s Health Insurance Program and addressing other vital priorities"]["Republican Leaders’ Broken Promises on Taxes, the Budget, and Health https://t.co/e5su8pLraA"]["Joined my fellow @HELPCmteDems to press @HHSGov on whether they are banning experts from using certain words or phrases. https://t.co/ktM0L7l5xM"]["Important speech by @MarkWarner. The coordinated attacks on Robert Mueller are an effort to undermine the rule of law &amp; our system of justice. The unhinged attacks on Mr. Mueller &amp; our law enforcement have been shameful. We must reject them."]["I will not stand by as Republicans in Washington plot to cut these vital programs for the middle class, especially after they passed into law these tax giveaways for big corporations and the super-rich."]["This whole scheme is a gut punch to the middle class. And now, Republicans in the House and the Senate are saying their next step is to go after Social Security, Medicare and Medicaid."]["The 90 million American households making under $50,000 a year will only see a fraction of that. By 2027, the Republican tax plan gives 83% of the cuts to the top 1%. To make matters worse, the GOP tax plan creates an incentive to offshore jobs."]["Instead of reauthorizing CHIP, which has now expired, or investing in infrastructure, congressional Republicans have passed a tax plan that gives over $36 billion dollars in 2019 to the country’s richest 572,000 households – those making over $1 million a year."]["The GOP tax scheme is a raw deal for Pennsylvania families. The middle class is getting the short end of the stick while the super-rich and big corporations get a windfall."]["I will never understand the pleasure that the @SenateGOP takes in ripping health care away from millions of Americans. https://t.co/VctmmFQV7q"]["At the end of the day, Republicans have the bill they set out to pass. One where ungodly amounts of money are redistributed to the wealthiest, and far too little goes to where it is truly needed. WATCH LIVE: https://t.co/5S68HSSF1C"]["If you had any doubt about what’s most important to Congressional Republicans, consider this- We’re voting tonight on tax giveaways to the wealthiest, instead of funding the children’s health insurance program. https://t.co/tXD6hS35o3"]["So let me get this straight, the GOP agenda for the coming year includes cuts to Social Security, Medicare, Medicaid &amp; taking away health care from millions of Americans? What happened to fighting for the forgotten American? https://t.co/jR1EtTmq3X"]["As Republicans celebrate their massive tax giveaways to big corporations, the Children's Health Insurance Program is faltering due to their inaction. https://t.co/qKvX0y4sNf"]["I’m ready to fight like hell to protect Social Security, Medicare &amp; Medicaid.  https://t.co/X8BQxQlto1"]["After increasing the deficit by at least $1.5 trillion, congressional Rs will move to cut Social Security, Medicare and Medicaid and blame it on “out of control spending\" of their own making. https://t.co/jJkkzyXt4Q"]["Bob Casey and Tom Ridge: Don’t disempower fellow citizens https://t.co/CgrUf79IXa via @PittsburghPG"]["Thus far, the Trump Administration has been all talk and no action when it comes to fighting for Pennsylvania families. Theirs is a corporate agenda which benefits the super-rich. https://t.co/sBREfnUryQ"]["Welcome to the cause. How about we put children and families ahead of the super-rich &amp; big corporations by reauthorizing CHIP instead of taking up the GOP tax scheme? https://t.co/rML5LXDyjI"]["The GOP tax scheme puts funding for Pennsylvania schools at risk by decimating the state &amp; local deduction. It’s not fair to our families. https://t.co/R3SvbcZcEW"]["This is an American Territory. These are American citizens. Further delay in getting Puerto Rico and the U.S. Virgin Islands the aid they need is unconscionable. \nhttps://t.co/2x0CdcCv7K"]["Trump promised ‘America First’ would keep jobs here. But the tax plan might push them overseas.  https://t.co/tvdDCnFdRR"]["Must be some really great stuff in there if Republicans don’t want to show anyone what’s in the bill until 5:30pm on a Friday. https://t.co/RtVCHTwSXu"]["We have a bipartisan bill ready to go: the KIDS Act reauthorizes CHIP for five years. @SenateMajLdr call for a vote. https://t.co/AbRVW0GFgx"]["President Trump insulted our American values by announcing his cruel decision to end the DACA Program. Congress must move immediately to pass the bipartisan DREAM Act, a bill Senator Casey was proud to vote for in 2007 and 2010. https://t.co/hez1ptBHP4"]["So let me get this straight: permanent tax giveaways to big corporations and even shorter temporary tax cuts for individuals? What a scam.  https://t.co/6armKqWQjm"]["Five years later, these faces still hold a place on my desk. Five years later, and I’m appalled by our failure to act. We must pass commonsense reforms to prevent more gun violence before I have to add another headline to my desk. https://t.co/FHYzKEN6ID"]["The FCC commissioners are scheduled to vote on #NetNeutrality rules TODAY at 10:30am. You can make your voice heard by contacting the FCC at 1-888-CALL FCC (https://t.co/3wwtZDJkj4)."]["#NetNeutrality helps ensure that the Internet is free and open, so consumers can access the content and services they want, and web services and content creators have an equal shot at reaching Internet users."]["Strong #NetNeutrality protections are critical to ensuring that all Internet content is transmitted with the same speed and quality—whether you’re streaming movies, using email services or visiting a small business’s website."]["It is unbelievable that, due to inaction by a Republican Congress more intent on giving tax breaks to the wealthy than health care to kids, CHIP has expired. https://t.co/tRMu5GHiqv"]["Republicans told the public the tax conference today would “be an opportunity for the conferees to discuss our best, most pro-growth tax reform ideas”; apparently they couldn’t wait for anyone’s input and just struck a deal amongst themselves. https://t.co/vrsEMYt28D"]["Rushing through a tax scheme that the American people don’t want after the people of Alabama have elected a new Senator would be wrong."]["The people of Alabama have spoken; there should be no more votes on the GOP tax scheme until Senator-elect @gdouglasjones is seated."]["Wishing everyone celebrating tonight a joyful Hanukkah filled with light, health and happiness."]["Members of both parties agree that we must reauthorize the Children’s Health Insurance Program. @SenateMajLdr call for a vote. https://t.co/nF6Tl7Z2GA"]["39 Democratic Senators Call on FCC Chairman Pai to Abandon 'Reckless' Plan to End Net Neutrality https://t.co/oBwM7WXlHD"][".@realDonaldTrump CHIP not reauthorized.  Dreamers without protections.  Government funding not settled.  None of these challenges will be solved by attacking an honorable Senator for standing with victims. Less tweeting and more governing, please."]["“Precision sacrificed for speed” - also known as jamming massive tax giveaways to the wealthy down the throats of Americans with little oversight or accountability. https://t.co/GEkDSmnzjG"]["I’ve heard from many Pennsylvanians who are concerned about losing the medical expense deduction. Taking it away to give tax cuts to the super-rich is cruel. https://t.co/7TQjjJUV1t"]["And rightfully so. No amount of Mnuchin-math can spin this tax scheme as anything but a deficit-busting, massive giveaway to the wealthy and big corporations. https://t.co/8NEQpxoOjV"]["Under Scott Pruitt, the EPA has abandoned its basic obligation to protect our clean air and water. Special interests are dictating the agency’s actions. https://t.co/F7QWio1ZpE"]["@realDonaldTrump Robert Mueller has always served our nation with distinction. The attacks on him and his work are not only obscene but undermine the rule of law. It must stop."][".@realDonaldTrump and Congressional GOP like to talk a big game on “law and order” and then they openly attack law enforcement (Mueller &amp; FBI) and propose budget cuts to their programs."]["I commend FBI Director Wray for standing up to @realDonaldTrump and Congressional Rs’ bullying of our law enforcement. The FBI is doing its job, it’s not in “tatters”"][".@realDonaldTrump and Congressional Republicans must stop their partisan attacks on our law enforcement. FBI agents risk their lives for us; the continued attacks by the President and Congressional Rs are outrageous."]["College students: Here's why you could pay more in the Republican tax bill https://t.co/8gzsrcauva via @usatoday"]["Ryan says Republicans to target welfare, Medicare, Medicaid spending in 2018 https://t.co/Jn9kHabnmc"]["I tried to amend the tax bill to guarantee that if shareholders and CEOs benefit from corporate tax cuts, workers would too. Every single one of my Republican colleagues voted no. Wonder why… https://t.co/A3H8b1PHVJ"]["I agree with my colleagues who have stepped forward today and called on Senator Franken to resign. We can’t just believe women when it’s convenient."]["We need to #ExtendCHIP before a single child loses health coverage. It’s shameful that Congress hasn’t acted; the program expired on October 1. https://t.co/S6lCHsyzKq"]["“It’s crazy,” said one Republican lobbyist. “I don’t think anyone could explain it, let alone comply with it” by Jan. 1. https://t.co/5fihfNf1qr"]["\"it is hard to find a tax plan that has done less for the middle class.\" https://t.co/w06z5OYdmu"]["@RonniePhilly She also highlights the need for more programs like @sparcphilly to create competitive integrated employment for people with disabilities. https://t.co/4E2RjTZ7Tk"]["This series from @RonniePhilly sheds needed light on the systemic impediments persons with disabilities face in their daily lives. https://t.co/R9qJH1rcun"]["@USICD @tillerson_w To retain U.S. leadership in the arena of disability rights we also need to restart efforts to pass the Convention on the Rights of People with Disabilities #CRPD"]["@USICD I urge @tillerson_w to retain the Special Advisor for International Disability Rights in the State Department."]["Proud to recognize the achievements and contributions of people with disabilities across Pennsylvania and throughout the world on the day @USICD celebrates International Day of Persons with Disabilities."]["Talking tax reform with KQV, listen live. https://t.co/bKJDeP7TQc"]["CC: @SenateMajLdr I'll even take a handwritten analysis at this point... https://t.co/OSCguYngyw"]["The Republican tax scheme is a tremendous giveaway to the wealthy &amp; big corporations. The only thing Senate Republicans have accomplished is meeting the demands of their donor class. https://t.co/XcxRjxn5zg"]["There it is at 1:51am: a tax scheme written hastily behind closed doors has passed the Senate. The super-rich &amp; corporate donors get their tax cuts while many middle class families will pay more. Obscene"]["The Republican backslapping you're seeing on the Senate floor right now is a celebration of a bill that's a bad deal for the middle class. Their corporate donors are getting what they demanded though"]["Well it’s 1:30 in the morning and we’re voting on final passage. Were any of you able to make it through all 500 pages? I doubt my colleagues did. https://t.co/2mwuRnhb1J"]["We're now voting on amendments to a bill that no one had time to read. https://t.co/gE2ZagfLn8"]["So much for draining the swamp... https://t.co/7wqYmQn5RD"][".@SenateGOP How about we take a break until you can type at least this thing up? Maybe read it and get some nonpartisan analysis?"]["GOP wants to vote on this monstrosity tonight, and it's still 'evolving.'\n\n\"As tax bill evolved, benefits for corporations and the wealthy grew.\" https://t.co/IAzry68ucs"]["They're now making handwritten changes to their handwritten changes... https://t.co/e3Pfci3PQT"]["To all the students who are about to lose their deductions, have you ever turned in a paper with handwritten edits in the margin? What was the grade? https://t.co/AV88cN1Fcf"]["Any handwriting experts out there? I'd like to know what this says before they call for a vote. This is absurd. https://t.co/6UkiJmuY9T"]["Here’s the GOP substitute that we’re expected to read, analyze and vote on later tonight. Start reading now and let me know if you can get through it all before the GOP calls for a vote. https://t.co/n866nrIHJT"]["So much for regular order. This is just plain reckless. https://t.co/MfRMSYTogs"]["The @SenateGOP continue to negotiate their substitute amendment behind closed doors, essentially rewriting their entire tax bill. They're holding a vote tonight on legislation that even members of their own party have yet to see. https://t.co/XLqPbtU5uT"][".@SenateGOP tells their members who are concerned about the deficit that individual provisions of their tax scheme are temporary while telling the public they will never expire. It’s a scam. https://t.co/YOFRVjNgKE"]["The nonpartisan Joint Committee on Taxation has already shown that this tax plan won't pay for itself. The GOP is blowing up the deficit to justify cuts to Social Security, Medicare and Medicaid. https://t.co/rAUb8nJEaz https://t.co/nizs31qtyN"]["Quite simply, it states that if companies are giving executives a raise and giving more money to shareholders through dividends and stock buy backs because of this tax windfall – then workers who helped make those profits possible also need to see their wages go up."]["Introducing an Amendment to the GOP tax bill to ensure any tax windfall to profitable corporations goes to worker wages. https://t.co/i4taOfpNUI"]["\"By 2027, people making $40,000 to $50,000 would pay a combined $5.3 billion more in taxes, while the group earning $1 million or more would get a $5.8 billion cut, according to the Joint Committee on Taxation and the Congressional Budget Office.\" https://t.co/KoEt5ZNJAB"]["Make no mistake, the GOP tax bill is just a prelude to cutting Social Security, Medicare, and Medicaid. If you don't believe me, take it from them. 👇 https://t.co/cegZ21cu7R"]["Senate Bill: Millions of Older Americans Could See Higher Tax Bills https://t.co/eZoX2bmY0k via @aarp"]["We’ve been warning for weeks that this corporate giveaway of a GOP tax bill was just the first step in going after Social Security and Medicare. If this bill passes, Republicans will suddenly be worried about the deficit AFTER they vote to add $1.5 trillion to it. https://t.co/rbB6xngHlo"]["He said the same thing to me. It’s unconscionable what Senate Republicans are doing to this program. CHIP has bipartisan support; we could pass it today if @SenateMajLdr would call for a vote. https://t.co/gznMIXg8ct"]["Current Tax Reform Bills Could Encourage US Jobs, Factories and Profits to Shift Overseas https://t.co/4EYKCdPHWa"]["Congressional Republicans have a maniacal obsession with decimating health care.  https://t.co/H6a5rozF5q"]["CEOs of major corporations aren’t playing along with the GOP’s tax scheme fabrications. They’re admitting up front that tax giveaways won’t raise wages for workers. https://t.co/nLDyKNvILc"]["Joining moms and family advocates to discuss how the GOP tax bill would be disastrous for working families. Watch live: https://t.co/mfzXNPbk3G"]["Senate Republicans are selling snake-oil and economists aren't buying.   https://t.co/a57iQ2Jasw"]["La Colombe founder: What every CEO knows but won't tell you about the proposed tax bill https://t.co/zmlgbpTlH9 via @phillydotcom"]["JCT Estimates: Amended Senate Tax Bill Skewed to Top, Hurts Many Low- and Middle-Income Americans https://t.co/cNg8yvN8au https://t.co/l2DpTyB56C"]["Because that's how the \"world's greatest deliberative body\" should operate. 🙄 https://t.co/1PvSOJdM7A"]["Congress created the @CFPB in the wake of the financial crisis to protect consumers from deceptive and unfair practices perpetrated by banks and financial institutions. How short is the memory of the GOP that they are already working to gut the @CFPB? #DefendCFPB https://t.co/bJv7Qf8JRb"]["My thanks to everyone who came to my office this morning to express their opposition to this GOP disaster of a tax bill. I will continue the fight back in Washington but I can’t win it without you- make your voices heard. https://t.co/HfOxdi2PnW"]["According to the @USCBO, the GOP tax bill would add $1.4 trillion to the deficit and by 2027, \"most people earning less than $75,000/yr would be worse off.\" https://t.co/fFvwMLVzsO"]["The GOP tax plan would make it harder for workers to get new skills, writes @loladefadulu  https://t.co/YKFFOcF6Iv"]["Thank you to all of our servicemembers &amp; a happy Thanksgiving to all https://t.co/FJEgw6oeTY"]["My thoughts are with these servicemembers &amp; their families. Our entire nation prays for the rescue of the remaining personnel https://t.co/517kkTJIhs"][".@AjitPaiFCC’s decision to roll back net neutrality protections is disappointing and puts the open internet at risk. While I urge the FCC to reject this plan, we must work on a bipartisan legislative solution to ensure net neutrality principles are upheld and enforced. https://t.co/F7w7MuWN2h"]["Glad to hear that Verizon and Univision have reached an agreement to keep providing critical Spanish-language programming, particularly in light of the ongoing relief efforts in Puerto Rico. https://t.co/s6bQ2ygbxe"]["Today, we mourn the loss of Patrolman Brian Shaw, who lost his life after being shot in New Kensington Friday evening. I'm praying for him and his family. Thank you to all who serve &amp; sacrifice on our behalf. https://t.co/RFFLrpVNY7"]["Just one of the many reasons the U.S. cannot and should not trust Putin. Russia is protecting Assad regime from scrutiny into war crimes and chemical weapons use against innocents in Syria. https://t.co/juZjUH60ht"]["The GOP tax/health care scheme was just passed out of committee: massive giveaways to the super-rich &amp; big corporations, higher taxes for 13.8 million households making under $200K, higher premiums for PA families, 13 million fewer Americans w/o health care. It must be defeated"]["We are trying to work with the @SenateGOP to make this bill better but they have yet to approve a single one of our amendments. https://t.co/l5hp4peIZ6"]["The 572,000 people who make more than $1,000,000/yr get a combined $39 billion in tax cuts while the 90,000,000 taxpayers who make less than $50K split $14 billion. https://t.co/r1l6TZg2cf"]["Higher taxes for many in the middle class, higher premium for PA families all in the service of pleasing the GOP donor class with giveaways to the super-rich and big corporations. https://t.co/5pwD5V20Ct"]["New analysis undercuts the White House argument that tax reform benefits the middle class https://t.co/EIMU1YR1yY"]["Well, @SenateGOP finance members chose: big corporations first, Pennsylvanians get double taxed by ending state and local deduction. https://t.co/HsJiDnLKTH"]["We’re about to vote to reinstate the deduction for state and local taxes by limiting the giveaways for big corporations. The middle class first of big corporations first? Pennsylvania first or big corporations first? @SenateGOP must choose."]["Written by the swamp, for the swamp. https://t.co/OCvuStwrbv"][".@SenateDems keep offering amendments to protect the middle class and the @SenateGOP keep voting them down. Now they claim the hearing has gone on long enough and they want to go home. So much for regular order.  https://t.co/mfGWCqu8Oc"]["Why the hell do people making over $1,000,000 need $39 billion in tax cuts? Why don't we take all of that and give it to the middle class? Millionaires have been doing quite well in this country since about 1980- why do they need tax relief? https://t.co/thBUJSvGF7"]["Praying for Governor Ridge and his family. Wishing him a speedy recovery. https://t.co/ewDjdDvOEK"]["Now a GOP Senator said they can't support my amendment protecting all of those who make under 50k/yr because the bill would be derailed if even one of those people got a tax increase… admitting that it may happen, which is exactly my point."]["The Republicans have promised that if they get their corporate tax cuts, wages will increase by $4,000. Yet they just voted against my amendment that would reverse the corporate tax cut if that's not the case. I guess they're not confident that they can keep that promise..."]["My friend @SenSherrodBrown is right, this markup is a farce. It's impossible to get accurate estimates because they keep changing the underlying bill. We didn't get this version until late last night. https://t.co/788eEoBf8F"]["Senate Rs just voted down my amendment to ensure an open hearing when Republicans reconcile the House and Senate version. I wonder what they’re planning on hiding in that back room behind closed doors..."]["Unlike other amendments voted on tonight, the Republicans didn't even bother to offer an explanation. They just put their heads down and voted no. Telling."]["Every Republican on the Senate Finance Committee just voted against my amendment to ensure individuals with disabilities would not be harmed by their health care/tax scheme. https://t.co/EDvkPEN4F4"]["Senate Republicans’ new $2,000 child tax credit helps them — but doesn’t really help the poor https://t.co/TE3D0TxVxH via @voxdotcom"]["The changes made late last night will rip health care away from millions of people while simultaneously jacking up their taxes. https://t.co/yp30U46tkY"]["If Republicans get their $1.5 trillion tax cut for the super-rich and big corporations, they'll have to make up that deficit somewhere. You can bet they'll go after Medicare, Medicaid, and Social Security next. https://t.co/G8Sk3O3iMc"]["Nearly 1.5 million people sign up for ACA plan in the first 11 days of open enrolment, yet the maniacal obsession from Republicans to sabotage our health care system continues. https://t.co/lpQf3ykxqD"]["Today marks the 100th anniversary of the \"Night of Terror\"--the brutal imprisonment of American women who fought for the right to vote. We honor those women and everyone who fights for Americans of every gender, race, ethnicity and creed to have a voice in our democracy."]["As the demand in #STEM related fields grows, we have to make sure that our students can rise to the occasion.  I’m pleased to see the #IgniteMyFuture in Schools program working to help teachers develop 21st-century skills in their students."]["Just received: a new version of the @SenateGOP tax scheme which is scheduled for markup in 12 hours. This rushed, partisan process is wrong https://t.co/443gWlHgYo"]["To be perfectly clear: The @SenateMajLdr is admitting to a room full of CEOs that in order to make their corporate tax cuts permanent, Senate Republicans will gladly take health care away from 13 million people. https://t.co/t3ObKLPxUp"]["Senate Republicans just decided to rip health care away from 13 million people over lunch...\nhttps://t.co/ueNf5BWaBX https://t.co/ueNf5BWaBX"]["According to the non-partisan @USCBO, repealing the individual mandate will increase both the number of uninsured and the cost of premiums.  https://t.co/hNc4xl1FEZ"]["In order to finance tax giveaways to the wealthiest and biggest corporations, Republicans are willing to raise taxes on many middle class families, eliminate vital deductions for Pennsylvanians and bring our health care system crashing down. It’s wrong and I will fight against it"]["According to the Congressional Budget Office, this latest decision will cause 13 million Americans to lose their health care while driving premium costs up by about 10% for many families across Pennsylvania."]["In addition to being a giveaway to the super-rich and big corporations, it now appears that the congressional Republican tax scheme will also sabotage our nation’s health care system. https://t.co/yBVw9V81hW"]["\"the Senate Republican tax overhaul actually would increase taxes for some 13.8 million moderate-income American households, a bipartisan analysis showed Monday.\" https://t.co/2LTn362Oyy"]["More than 400 millionaires tell Congress: Don't cut our taxes https://t.co/O5Xwo8CZzG"]["We have been given 4 days to read over 247 pages of proposed changes to the tax code and to understand the potential impacts on the businesses and residents of our state. This is not only the height of irresponsibility. It is an impossible task. https://t.co/57KFxR2HZ8"]["Every day, but especially on Veterans Day, we are grateful for our servicemembers, past and present. Thank you to our Veterans, those still serving, and those who have ever loved or supported a servicemember. Our Nation is stronger for your service."]["In Congress, we have bipartisan cooperation to ensure every Veteran gets quality, timely healthcare, have their disability claims processed quickly, have the support and resources to pursue their educational or employment goals."]["On Veterans Day, we come together to honor the courageous actions of our brave men and women who have served to defend our nation. Our Armed Forces have always answered the call to duty, and Veterans should have every opportunity and resource they need when they return home."]["To paraphrase what my father once said, “we pray for military families and their loved ones serving around the globe; but we also pray for ourselves that we may be worthy of their valor.”"]["Veterans represent what’s best about our Nation, and we need their continued leadership and service. We owe it to our Veterans to ensure that the Federal government delivers on the promises we’ve made and the benefits Veterans have earned through their service."]["Today I’m honoring the courageous actions of the brave men and women, past and present, who have served to defend our nation. Pleased to join Media Mayor Bob McMahon and locals for the annual Media Veterans Day Parade. https://t.co/GWoOqdKJvs"]["I was encouraged by President Trump’s words on China’s behavior on trade during the campaign, but 10 months later, needless delays out of this administration have only caused further harm. Enough. It’s time for action to protect our workers and their wages."]["I have been critical of administrations of both parties, including the Obama Administration, for failing to protect our workers and take on China’s trade cheating."]["The Commerce Department has worked diligently on this issue but the White House is delaying their work in order to push a tax scheme that puts the wealthy first."]["The Administration can protect Pennsylvania workers today by taking action on China’s illegal subsidies and dumping of aluminum and steel."]["Instead of giving China a pass, President Trump should be holding China accountable. For months, the Administration has talked about taking action against China’s cheating but all we get is delay."]["Trickle-down economics has failed our workers &amp; families over and over again but that’s exactly what the GOP tax plan is. https://t.co/2avLKFIeDi"]["Apparently, massive tax cuts for big corporations wasn’t enough- \"Under pressure from businesses, House Republicans have gutted a plan to crack down on corporate tax avoidance\" https://t.co/G5DaEBJIwD"]["Bruce Bartlett, Domestic Policy Adviser to President Reagan on the GOP Tax Bill. https://t.co/LmoVxN5zQL"]["\"Nearly half of all middle-class families would pay more in taxes in 2026 than they would under current rules if the proposed House tax bill became law\" https://t.co/DyGzg0ozLA"]["Eliminating the medical expense deduction is an attack on seniors and those with disabilities. It’s wrong to end deductions that help them while giving massive tax cuts to the super-rich and big corporations. https://t.co/iHncZZQLhN"]["GOP priorities... https://t.co/QLL8eBS2t7"]["Praying for the Pennsylvania State Police Trooper who was shot during a traffic stop this morning."]["⚡️ “Redlining the GOP tax bill”\n\nhttps://t.co/LIli9fp6Oa"]["The tax would be repealed completely starting in 2024, at a cost of $171.5 billion (over 10). JCT explanation Page 100."]["Some middle-class Americans would pay higher taxes under GOP bill, despite Trump's promise https://t.co/NWPGfRvoaB"]["House GOP’s Child Tax Credit Expansion Excludes Millions of Children in Lower-Income Working Families https://t.co/bkkVKvejEQ"]["@odonnell_r This was an unfortunate change with the NYTimes headline. This tweet was in reference to the changes in moving fees and selling your home."]["Pg 166 and this is where they double the estate-tax exemption. Unless you’re a millionaire, this does not help you. https://t.co/XV1A5D7WGn"]["Pg 89 This repeals the Lifetime Learning Credit - a $2,000 Tax Credit for those seeking to acquire or improve job skills. https://t.co/y4o3HeuRqk"]["Striking sec 221 also eliminates the deduction for tuition and other education related expenses – currently allows up to a $4,000 deduction."]["These deductions can be taken by anyone paying off their student loans who makes less than $165,000 (married) and $80,000 (single)."]["Current law allows up to a $2,500 deduction against interest paid on student loans."]["This eliminates the above-the-line student loan interest deduction. https://t.co/wj6fkHUEfl"]["Pg 233 eliminates the deduction for domestic manufacturing. - JCT explanation pg 142 https://t.co/uw0VhrR1eU"]["The JCT explanation for this is on pg 65 of their description but read this for more: https://t.co/57GRVKMWG0"]["Pg 132 Repeals the $250 above the line deduction for teachers to help offset their out of pocket school supplies. https://t.co/hfU9KO1anO"]["Pg 252 Repeals the Work Opportunity Tax Credit, including for disabled vets and low income families- JCT explanation pg 158 https://t.co/ge3vnUQCFC"]["Page 103 - This eliminates the deduction for state and local income taxes. https://t.co/j59ple5RFm"]["This will hit military families particularly hard. https://t.co/WwUEt6cXVR"]["Pg 135 This is a new moving tax on anyone who has to relocate frequently for work. - JCT explanation pg 61 https://t.co/9Ly9pCh1OB"]["Pg 72. This repeals the Adoption Tax credit making it harder for middle class families to adopt. - JCT explanation pg 26 https://t.co/8pgIEeSgS9"]["Essentially creating a GOP Chronic Care Tax. Why is this bad? Start here: https://t.co/E3ZI11XGLC"]["This eliminates the deduction for people with high medical expenses. - JCT explanation pg. 60 https://t.co/MVqjGgJbsy"]["This means a family of four gains $11,700 in standard deduction and simultaneously loses $16,200 in personal exemptions. JCT expl. Pg 10"]["Pg 24 Repeals the $4050 (per family member) personal exemption. https://t.co/vWZYaOhiiN"]["What follows are a few lowlights and where to find the explanation in the Joint Committee on Taxation description: https://t.co/fx5JE61lxT"]["Now that we have actual bill text for the GOP tax plan, my staff and I spent the weekend going over all 425 pages. https://t.co/RDVbayUEfx"]["The new pass-through loophole created by the GOP tax bill is a massive giveaway to the wealthiest. https://t.co/r7AxL9nglI"]["“How a Tax Cut Turns Into a Tax Increase” by David Kamin https://t.co/KsoF2Zqc4b"]["In addition to offering my prayers and thoughts I also believe Congress must take action on gun violence (2/2)"]["I’m thinking of and praying for all those impacted by the shooting in Texas (1/2)"]["Today we remember these women who helped change our nation for the better https://t.co/FCdtkGVBWi"]["Instead of promoting this scheme in PA, I urge @VP and congressional GOP to start over and work on a bipartisan plan for the middle class"]["Tax giveaways to the wealthiest shouldn’t come at the expense of deductions that help middle class families"]["In 2018 a PA family of four would gain $11K in standard deduction but simultaneously lose $16,600 in personal exemptions"]["While the GOP plan doubles the standard deduction it also eliminates personal exemptions"]["Vital deductions eliminated under congressional GOP plan: state and local income taxes, medical expenses and interest on student loans"]["The tax scheme @VP is pushing in PA lavishes the super-rich w/ obscene tax giveaways while vital deductions for middle class are eliminated"]["Middle class families deserve a tax cut but @VP came to PA today peddling a massive giveaway to the wealthiest and biggest corporations"]["Paul Ryan's poster family for middle-class tax cuts would ultimately get a tax hike https://t.co/Cei9maZ0uk via @voxdotcom"]["Teachers spend nearly $1,000 a year on supplies. Under the GOP tax bill, they will no longer get a tax deduction https://t.co/57GRVKMWG0"][".@HouseGOP scrap this obscene plan and start over with a bipartisan process that raises incomes for the middle class and creates jobs."]["But the congressional Republican outline does the opposite, providing massive giveaways to the super rich and large corporations."]["Make no mistake, we need to reform the tax code for the middle class and small businesses."]["Today, the GOP released their tax bill that provides a $1.5 trillion tax cut for corporations."]["The GOP budget that passed last week proposes $1.5 trillion in cuts to Medicare and Medicaid. https://t.co/5aOHYJal1U"]["The GOP tax bill eliminates the vital tax deductions to help middle class families adopt children and pay their medical bills."]["...some middle class families in Pennsylvania could see their taxes rise while the super-rich get a windfall."]["By eliminating key deductions like the deduction for state/local sales and income tax and the $4,050 personal exemption per family member..."]["But a few marginal changes don’t change the fact that their plan is fundamentally a giveaway to the rich at the expense of the middle class."]["Congressional Republicans have taken great pains to spin their tax scheme as great for the middle class. https://t.co/XKG1gcTtka"][".@GovernorTomWolf thank you for your support- we must face this crisis head on. https://t.co/tMPwSpwAN6"]["This tweet could have been more clear, nearly 8M families nationwide earning up to $86,100 would receive an average tax increase of $794."]["This tweet could have been more clear, nearly 8M families nationwide earning up to $86,100 would receive an average tax increase of $794. https://t.co/Nit4VZMTAT"]["Saddened by the news out of New York. Praying for the victims and their families."]["#RaiseYourHand https://t.co/yHhQQ6X89v"]["Russia attacked our democracy and anyone that aided that effort must be held fully accountable."]["I continue to support bipartisan legislative efforts to protect Special Counsel Mueller’s independent investigation."]["The independence of Special Counsel Mueller’s investigation must be respected."]["Today’s indictments make clear the very serious nature of this investigation. https://t.co/V1VB3MbXe3"]["This bill would invest the $45 billion in the opioid fight without eliminating coverage for substance use disorder. https://t.co/AHgKOd87OM"]["If President Trump is serious about confronting this crisis then I urge him to endorse my legislation, the Combating the Opioid Epidemic Act"]["I am pleased that the White House has come out in favor of a $45 billion investment in the opioid crisis."]["New @KaiserFamFound reveals sabotage surcharge in every state courtesy of @realDonaldTrump &amp; Congressional Rs. https://t.co/RJ3njjde7w"]["…because tax cuts for the 1% are more important to them than reducing the deficit. https://t.co/8MeCcKldHr"]["I just sent this letter to the Trump Administration and congressional Rs to tell them: no retirement tax to pay for giveaways to wealthiest. https://t.co/O0tmdz06ky"]["Proud to see Taylor Dumpson at today’s hearing continuing to bravely speak out against hate speech and racial discrimination."]["The opioid epidemic is a national emergency and we must respond with real investments in treatment."]["The GOP must also stop pursuing health care schemes to decimate Medicaid, which would deny Americans’ coverage for substance use disorders."]["Good treatment, over a sustained period of time, gives those with an opioid dependence the best shot at overcoming this challenge."]["Since March, I’ve held nine meetings across Pennsylvania to discuss the need to address opioid dependence."]["This bill would invest $45 billion over 10 years to fund opioid treatment and prevention, as well as research on pain and addiction."]["Just yesterday, I introduced legislation, the Combating the Opioid Epidemic Act"]["While I commend the Administration for taking this step, the federal government must do more than issue declarations. https://t.co/HvWtB1a1XH"]["Obscene: Congressional Rs insist on double taxing the middle class to pay for giveaways to the super-rich https://t.co/WYVNuOQKEn"]["A budget that cuts $1.5 Trillion from Medicare and Medicaid to pay for a giveaway for the top 1% is nothing to celebrate. https://t.co/o2IxbM7Nor"]["It seems Betsy DeVos is on a mission to decimate basic protections for students at all levels. https://t.co/BKeqksYU2z"]["What's causing this increase? The deliberate sabotage of our health care system by the Trump Administration. https://t.co/uKKGnQsWHr"]["You think this would go w/o saying but we shouldn’t tax the retirement of middle class workers to finance obscene giveaways to the rich. https://t.co/Wto2FJQBzJ"]["What the White House is claiming about their tax plan is just not true. https://t.co/HDAiFRAnTl"]["CBO underscores the benefits of Alexander-Murray health care compromise. @realDonaldTrump- back it. @SenateMajLdr- call for a vote. https://t.co/0TlJpMtaoF"]["Russia's refusal to hold Syria accountable for chemical weapons use must be condemned. Vladimir Putin is complicit in Assad's war crimes."]["When @SenateGOP talks about standing up for “forgotten Americans,” they must mean those big corporations seeking to avoid accountability https://t.co/JCcTnZCLVr"]["Once again, @SenateGOP is selling out the middle class in favor of big corporations https://t.co/kqhKKFQURk"]["In Pennsylvania, 3.4 million dependent exemptions were claimed in 2015 https://t.co/IMxOyGUOrG"]["Under current law, the personal exemption deducts $4,050 for each taxpayer and dependent on a return. The GOP plan eliminates this deduction"]["These estates are worth $5.5M for an individual or $10.98M per couple. Unless yours is worth that much, this doesn’t benefit your family."]["The GOP plan also eliminates the estate tax, creating a huge windfall for the super-rich. This only helps 140 total estates in PA."]["But the 14,260 PA millionaires would receive 53.6% of the tax cuts in GOP plan."]["The PA families making between $41,200 and $64,900 who do benefit see only 8% of the total benefits of the tax plan. https://t.co/dtoiZJt2vo"]["That $794 in increased taxes could have paid for 1 month of child care, 6.8 months of electric bills, or 2.1 months of health care premiums."]["In PA, 1.3 million households deduct mortgage interest. The GOP plan makes this deduction less useful unless your house is worth over $800K."]["In PA, 1.8 million households use the state and local tax deduction. Average deduction =$11,248. The GOP plan eliminates this deduction."]["@SenateDems @IRSnews @iteptweets @JECDems The GOP plan would RAISE taxes on 967,000 PA households next year- that’s 15.6% of all households in 2018."]["Data curated by @senatedems from @IRSnews @iteptweets @JECDems https://t.co/za3HU1D1pR"]["The GOP tax plan is a bad deal for the middle class. Let’s look at the impact on PA families."]["Tax giveaways for the wealthy should not take precedent over cracking down on countries that cheat on trade https://t.co/KjQEO97g5m"]["Cheaper Health Plans Promoted by Trump Have a History of Fraud https://t.co/tVfMEEZcN0"][".@realDonaldTrump sabotage of our health care system is preventing more Americans from getting covered. https://t.co/sWpduF5Sk4"]["Well @iamjohnoliver, I thought the Scranton train would be bigger, but it’s a fine addition to the Electric City. cc @WNEP https://t.co/W3eATByIJc"]["Trickle-down economics has always failed the middle class. Most recently, it failed in Kansas https://t.co/XG6AoCgKEk"]["Here’s a rundown of how counties in Southeastern PA would be impacted by the elimination of SALT. Thank you @NACoTweets for data. https://t.co/w6sOuZ8RkH"]["The GOP tax plan eliminates the state and local tax deduction (SALT). This deduction prevents double taxation of the same income"]["Today, I was in Conshohocken, PA to call out the GOP tax plan, which places a double tax on Pennsylvania families. It’s a bad deal."]["@jordanreiter I support Murray-Alexander"]["This GOP budget will cut Medicare and Medicaid to finance a tax plan that gives 80% of the cuts to the top 1% by 2027"]["The Senate just passed a GOP budget that cuts vital programs for the middle class to finance massive tax cuts for the wealthy. I voted no."]["Congressional Rs are racing to pass a tax plan that’s a bad deal for the middle class. Also drafting in secret. \nhttps://t.co/h2re4tH0pO"]["The GOP budget cuts $1.5 trillion from Medicare and Medicaid to provide tax giveaways to the super-rich. It’s wrong."]["Order issued by @realDonaldTrump was an insult to women. No private employer has the right to deny women access to birth control"]["I just introduced legislation w/ @PattyMurray to rescind @realDonaldTrump’s recent order that undermines access to birth control"]["Wishing a happy Diwali to all those celebrating!"]["GOP rhetoric on taxes does not match reality. They are not pushing tax reform, but tax cuts for wealthy at the expense of middle class."]["Further, I told @realDonaldTrump that the GOP tax plan should not give 80% of the tax cuts to top 1% as GOP plan does by 2027"]["I also told @realDonaldTrump that it was wrong to cut $1.5 trillion from Medicare and Medicaid to fund tax cuts for the wealthy"]["This constituent continued, “It obviously provides significant tax breaks to the high income earners at the expense of the middle class.”"]["Another letter I gave to @realDonaldTrump from a 73yr old PA resident. “My wife and I have a fixed income in middle range....”"]["Constituent continued, “Why should high income families get a tax break when we will likely get a tax hike?” I agree."]["One constituent said, “we have been responsible and doing our part.”"]["I brought w/ me letters from middle class Pennsylvanians who would be adversely impact by GOP’s tax plan https://t.co/K1BerbMIFe"]["Coming up on @hardball at 7:30pm to talk about how GOP tax plan is a massive giveaway to wealthy at expense of the middle class"]["This compromise is an opportunity for Rs to end their pursuit of repeal and work in a bipartisan way to improve our health care system."]["In order for this legislation to benefit PA families, @realDonaldTrump must stop the sabotage of our health care system."]["Agreement reached by @PattyMurray &amp; @SenAlexander is a bipartisan compromise that will improve our health care system."]["New study from @avalerehealth shows PA is one of hardest hit states by @realDonaldTrump health care sabotage\nhttps://t.co/SovrJM9wS0"]["Soon: event w/ @MomsRising on how GOP budgets cuts middle class programs to finance tax cuts for wealthy.  https://t.co/PldgkxrDDg"]["Thank you @SenJohnMcCain for always answering the call to service #LibertyMedal https://t.co/sp9mCPbH0b"]["It’s an honor to be in attendance tonight as @SenJohnMcCain is recognized for his lifetime of service https://t.co/0VRVW6l3O8"]["Today, I’m issuing a new report on how @realDonaldTrump has sabotaged our health care system from day one:  https://t.co/5ms1FlaDrR"]["This @realDonaldTrump premium tax will make it harder for middle class families to make ends meet."]["So far Rs refuse to serve as an independent check and balance on @realDonaldTrump sabotage of our health care system"]["These premium increases are a direct result of @realDonaldTrump’s sabotage of our health care system. This sabotage must be stopped. https://t.co/xd6m13kRNA"]["Thank you @JoshShapiroPA for fighting @realDonaldTrump’s sabotage of our health care system. https://t.co/qCppowHXi8"]["I will review @realDonaldTrump strategy &amp; legislative proposals but will not support something that would violate the Iran nuclear agreement"]["The U.S. should not walk away from Iran nuclear agreement"]["JCPOA represents best available option for preventing Iran from acquiring nuclear weapons capability &amp; enhancing visibility of program"]["While I look forward to reviewing @realDonaldTrump Iran strategy, his decision not to make certifications could imperil JCPOA"]["This decision by @realDonaldTrump means higher premiums &amp; higher deficits. It’s a middle class wrecking ball. https://t.co/CDMTRozkaT"]["Congress must act to reverse this sabotage. If @realDonaldTrump is unwilling to follow the law then Congress must force him to."]["The Administration’s decision will raise premiums, cost middle class families more of their hard-earned dollars and cause havoc in markets"]["These payments ensure health care is affordable for millions of Americans. This cruel act will only harm our families."]["The Administration just confirmed this act of sabotage. @realDonaldTrump is placing a 20% premium tax on PA families. It is wrong. https://t.co/Y1UjmVDVXQ"]["It’s clear @realDonaldTrump &amp; Congressional Rs have a maniacal obsession w/ repeal. Taking this step would directly harm PA families. https://t.co/vgBb1DXWre"]["If @realDonaldTrump takes this reckless act, premiums for PA families will skyrocket. The sabotage of our health care system must end. https://t.co/vgBb1DXWre"]["This destructive act by the Administration threatens to undermine those bipartisan efforts."][".@PattyMurray and @SenAlexander have been making progress toward bipartisan legislation that would improve our health care system."]["Instead of hurting families and seniors, they should work in a bipartisan way to improve our health care system."]["These schemes have been soundly rejected, yet the Administration is now trying to enact them via executive order."]["They have put forth legislative schemes that would drive up premiums, increase costs and reduce protections."]["They have a maniacal obsession with repealing the Affordable Care Act. That obsession is harming families across the nation."]["This executive order is trying to return us to the days when you could buy junk insurance – it was cheap, because it didn’t cover much."]["Instead, @POTUS and Republicans in Congress have engaged in a sabotage of our health care system, which has driven up premiums and costs."]["For nine months, the Admin &amp; congressional Republicans have abdicated their basic obligation to make sure our health care system works."]["This is a sabotage of our health care system by executive order. https://t.co/s6uIsQXxh4"]["@realDonaldTrump These are Americans. You are their President. Help Them. Protect them. Do not abandon them."]["@realDonaldTrump Only 15% of their 1,113 public schools have reopened, leaving many children without a safe place to learn. https://t.co/DClwpKAJol"]["@realDonaldTrump Much of the island is still without power and clean water. https://t.co/6SXaNC9Ayl"]["These are Americans. FEMA, the Military, &amp; First Responders should stay as long as it takes to ensure their safety &amp; wellbeing. https://t.co/Js8y70mHPK"]["My response to @realDonaldTrump’s remarks on the GOP tax plan. https://t.co/3Ou6zek9Xo"]["Nearly 90% of lower tax rate cut would go to the top 1%, this is because most small businesses don’t pay anything close to the top tax rate. https://t.co/epTymKXIsd"]["Small business can already write off $500K in investments b/c of work @SenatorCollins &amp; I did in 2015 to make the 179 deduction permanent"]["Republican plan gives $1.5 trillion in tax cuts to corporations; their budget cuts Medicare and Medicaid by $1.5 trillion."]["Fact Check - According to non-partisan @USCBO, profitable corporations have an effective tax rate of 18.6%."]["Worth more than $11 million? No? Guess what, the estate tax does not apply to you."]["Repealing the estate tax would give $27 billion a year to America’s 5,500 richest families."][".@POTUS says tax cuts go to the middle class. Fact Check: top 0.1% (income above $3,439,900) get an avg tax cut of $747,580 in 2018."]["Under the Republican plan, a family of four would gain $11,300 in standard deduction, and simultaneously LOSE $16,200 in personal exemptions"]["Tax on a single piece of paper? We already have it. It’s called the 1040EZ"]["Fact Check: Average tax cut for the top 1% is $146,470. Plan INCREASES the tax rate from 10% to 12% on family income below $18,650."]["Oh and increasing the tax rate on family income below $18,650 from 10% to 12% 🙄"]["How do they make up the rest? With $1.5 trillion in cuts to Medicare and Medicaid. https://t.co/fVLsVVyWZg"]["Their own budget reconciliation bill allows them to increase the deficit by $1.5 trillion. That’s a lot of zeros. https://t.co/7deyiHKzZw"]["So does the GOP place any value in reducing the deficit? Let’s take a look at their budget."][".@JoeBiden has said \"Don’t tell me what you value, show me your budget and I’ll tell you what you value.\""]["In total, the GOP tax plan gives almost 3 trillion in tax cuts to wealthy Americans and profitable corporations over the next 10 years."]["That’s equivalent to the total annual funding for Pell grants ($22.5 billion FY17) and WIC ($6.35 billion)."]["That’s equal to entire FY17 budget for the @CDCgov ($7.2B), the FAA ($16.4B), the @TSA ($7.78) and the @USCG ($10.45B)."]["The GOP’s purposed changes to the top individual tax bracket will reduce revenue by about $42 billion/year."]["That’s equal to the entire FY17 budget for the @NIH ($34.1 billion), @CustomsBorder ($14.3 billion), and @FEMA ($11.6 billion) combined."]["The purposed GOP cuts for Pass-through/S-corps will reduce revenue by roughly $60 billion/year."]["That’s equal to our military’s annual personnel costs (salary, healthcare, retirement contributions, etc) PLUS NASA’s entire annual budget."]["Let’s start with the proposed cut to the corporate tax rate: $1.5 trillion over 10 years or $150 billion/year."]["So just how much would we have to cut to keep the deficit the same? Take a look at the numbers."]["How, you ask? By definition, tax cuts reduce revenue. If you don't make cuts equal to that reduction, you increase the deficit."]["Republicans are now proposing to wipe that away with a budget and tax plan that will drastically increase the deficit."]["In 2011, under the Budget Control Act Republicans and Democrats came to an agreement on $1 trillion in deficit reduction measures."]["There are only two ways to reduce the deficit: bring in more revenue or decrease spending."]["Thread #2: The GOP talks a lot about the importance of reducing our national budget deficit."]["The only ones who benefit from the GOP pass-through rate reduction are the super-rich hedge fund managers and real estate developers. https://t.co/C0rJPTdqYV"]["Most small businesses using pass-through already pay less than the proposed GOP rate. https://t.co/dpn7TfYRho"]["GOP tries to sell the ‘pass-through’ loophole as being good for small business, yet 90% of the benefits go to the top 1%."]["This is why @realDonaldTrump's budget is \"out of whack,\" not because a hurricane devastated Puerto Rico."]["That’s right, this hedge fund manager loophole dwarfs the entire budget of the primary department responsible for responding to emergencies."]["In context, this new loophole = FY17 budgets of NIH, Customs &amp; Border Protection &amp; FEMA COMBINED."]["Changing the pass-through rate will lower taxes for hedge fund managers &amp; real estate developers, adding $600B to the deficit over 10 years."]["First up, a look at how this plan creates new, special loopholes for super-rich hedge fund managers &amp; wealthy real estate developers."]["And throughout the day on Twitter, I'll address some of the more egregious flaws in this tax plan."]["Today in Philadelphia, I'll highlight how the GOP tax plan also RAISES taxes on the middle class to help fund these same giveaways."]["Yesterday, I met with seniors in Lancaster to highlight how this plan cuts Medicare to fund giveaways to super-rich. https://t.co/hXUba0oZWn"]["Today, @realDonaldTrump will come to Pennsylvania to push tax plan that gives 80% of benefits to the top 1% of the county."]["Elyse and Michael- may your love protect you and persevere through all of your tomorrows. https://t.co/19966NgX4R"]["...but allowing a private employer to deny a woman access to birth control treats women like second-class citizens."]["As it related to religiously affiliated institutions, the original order was imperfect..."]["An employer has no right to deny a woman access to birth control. This order is an insult to women."]["Denying women access to birth control is wrong and that's exactly what the Trump Administration did today. https://t.co/38aeoeAfMM"]["This administration is doing everything they can to sabotage our health care system, and @realDonaldTrump is leading the charge. https://t.co/DqJ0HAhAC9"]["Republicans Won’t Rule Out Tax Hikes for Some in the Middle Class https://t.co/RC0bOWyphq"]["Thank you to first responders who reacted quickly. An example of why we need to keep guns out of wrong hands. https://t.co/uiCjOHOHXw"]["@USUN This is a free pass for countries – and groups, like ISIS – who want to put people to death for their gender identity or sexual orientation."]["The death penalty is a punishment for violent crimes, and being LGBT is not a crime @USUN."]["On the Senate floor to speak about this morning's events in Las Vegas. Watch live: https://t.co/rjN3Rv2VS2"]["If Congress continues to fail its most basic obligation to keep America safe, then these mass shootings will continue to occur."]["...limit the size and capacity of magazines, which contribute to deadly mass shootings, and put in place universal background checks."]["Congress should take up and vote on legislation to ban military-style weapons..."]["Congress must engage in a robust debate about commonsense ways to keep guns, particularly military-style weapons, out of the wrong hands."]["The nation’s security continues to be at risk because Congress refuses to take real, meaningful action to curb gun violence."]["While we pray for the victims of this horrific attack and their families, it is not sufficient to just offer thoughts and prayers."]["Praying for the victims, their families, and all those who responded to this horrific shooting in Las Vegas."]["How you can help hurricane victims in Puerto Rico https://t.co/kRsRpbMZQG via @NewsHour"]["Just take a look at this graph. Who would you say this plan favors, the middle class or the top 0.1%? https://t.co/riSIO16lQL"]["@TooterTwetter @SenateDems @realDonaldTrump Because the also eliminate the individual exemption. https://t.co/OdpPongUOj"]["Instead of helping the middle class, this plan leaves them worse off while funding giveaways to the super-rich. How is that fair?"]["25% of middle class families would pay more while the wealthiest Americans get a massive tax cut. That’s just wrong."]["The non-partisan @TaxPolicyCenter has released its first analysis of the GOP tax plan. This is no miracle. https://t.co/qjbjr3P3Aq"][".@realDonaldTrump Raising taxes on 25% of middle-class families does not sound like \"a miracle for the middle class.\" https://t.co/fWcet3TKii"]["Treasury should make this study available so the American people can have the facts about who benefits from tax cuts for big corporations. https://t.co/NeEUb4644Q"]["The @latimes came to the same conclusion: \"the standard deduction won't be a windfall for some average Americans\" https://t.co/tDkQQlON3t"]["A rundown of how the GOP tax plan will actually raise taxes on some middle-class families https://t.co/OdpPongUOj"]["Unable to win his ideological trophy from Congress, @realDonaldTrump is systematically destroying our health care system from the inside. https://t.co/JalYBKjUXX"]["Questions on how exactly the Trump Admin is sabotaging our health care system? Here's a good rundown. https://t.co/uXIDR3YjvT"]["Looks like I took too simple of an approach with my earlier estimation... https://t.co/2Mc2pNrD6d"]["@thiswayjose @GovernorTomWolf @PatToomey I'll continue to urge the @SenateMajLdr to call up relief legislation and support it with my vote once he does. https://t.co/WW23U8g3da"]["Yet, the cuts for the wealthiest are guaranteed in the text of the plan. https://t.co/A9unH4I5am"]["It’s not “fine” if workers don’t benefit. Tax reform should help workers, grow incomes and make it easier for middle class to make ends meet https://t.co/C47u7Y03WY"]["They can guarantee that taxes will go down for the ultra-rich but can't guarantee that taxes won't increase for the middle class?"]["At WH press briefing Gary Cohn once again failed to guarantee that no middle class family will see their taxes go up under Admin’s plan."]["Under the Republican plan, a family of four would gain $11,300 in standard deduction, and simultaneously lose $16,200 in personal exemptions"]["Take this example for a married couple with two kids and a household income of 70K. They end up paying $288 MORE under the GOP plan. https://t.co/smyyYsSHx6"]["However, there’s always a catch: the GOP plan also eliminates the “personal exemption.\""]["In the coming months, you will hear a lot from the GOP about “doubling the standard deduction.”"]["Let’s examine how a middle class family could pay more under the GOP tax plan."]["9 ways Trump’s tax plan is a gift to the rich, including himself https://t.co/N4hT8ZXtEQ"]["How many times do we have to prove this wrong? Tax cuts don’t pay for themselves. https://t.co/ofhK99i8OH https://t.co/Usn0okWdpN"]["@steveliesman @CNBC How many times do we have to prove this wrong? Tax cuts don’t pay for themselves. https://t.co/ofhK99i8OH https://t.co/ab3blya1fU"]["Glad to hear it! https://t.co/o57w3Sy2JD"]["My sincere thanks to the @PANationalGuard for their invaluable contributions to hurricane relief efforts.  https://t.co/HwB9bVHDRQ"]["Despite the failure of their latest repeal effort, this Administration continues to sabotage our health care system. https://t.co/34qnu6tZGx"]["Trump Tax Plan Benefits Wealthy, Including Trump via @NYTimes https://t.co/YbNRaLKs3N"]["So if the GOP pass their tax plan, what will they do to offset the deficit increase? Move to cut Social Security, Medicare &amp; Medicaid."]["In their healthcare scheme, Congressional Rs pushed to decimate funding for Medicaid."][".@SpeakerRyan and the @HouseGOP have repeatedly tried to end Medicare as we know it by turning it into a voucher program."]["They've tried this before- In the early 2000s, the GOP moved to privatize Social Security following a massive tax cut for the wealthy."]["The GOP tax plan would also rack up massive deficits which could lead to cuts to Social Security, Medicare &amp; Medicaid."]["They preserve tax deductions for big business &amp; sheltering corporate profits while eliminating one of the biggest for the middle class."]["The GOP tax plan also eliminates the state and local deduction, meaning middle-class families would be taxed twice on their hard-earned pay."]["Claiming to double the standard deduction is also misleading. Read @jbarro on how the middle class may pay more. https://t.co/LxuaPe2sRc"]["In fact, in a gut punch to workers and their families, they actually raise the bottom tax bracket. https://t.co/71xSL7KVWC"]["The GOP tax plan would lower the top tax bracket, meaning a massive tax cut for those at the very top."]["From the @CenterOnBudget \"Contrary to repeal proponents’ rhetoric, the estate tax affects very few small farms and businesses\""]["The GOP tax plan ends the Estate tax, which only helps 5,200 of America’s wealthiest families. https://t.co/o0pD3H22VP"]["The GOP tax plan contains a new loophole for real estate developers, hedge fund managers, etc to lower their taxes \nhttps://t.co/C7EZDUnQ97"][".@realDonaldTrump Based on your 2005 return, reducing the top income rate to 35% would personally benefit you to the tune of ~$7 million."]["This is simply not true. Instead of looking out for middle class families, this tax scheme cuts taxes for the super-rich &amp; big corporations. https://t.co/UM7fc9xrXg"]["Cutting taxes for the super-rich won’t create jobs or grow incomes for middle class families. https://t.co/5fzjDXr9jm"][".@SenateMajLdr We have bipartisan solutions to health care, call for a vote on @PattyMurray's and @SenAlexander's work. https://t.co/ZCTzyo3zGf"]["Casey, Colleagues to GOP Leadership: Puerto Rico and U.S. Virgin Islands Need Congressional Help Now https://t.co/nykXgnniCM"]["Watch Live: Cassidy-Graham Proposal Would Devastate Life For People With Disabilities  https://t.co/UnkaL4oW4Y"]["Page 4: Pennsylvania will lose billions of dollars in federal health care funds. https://t.co/1AVD6fKqxl"]["Page 8: no way will state be able to implement a replacement in two years. https://t.co/OMQ5P7LiOx"]["This is where @USCBO says coverage for pregnancy, mental health care and opioid addition treatment can be taken away. https://t.co/1OFhko4bw7"]["@USCBO Talk about a death spiral... https://t.co/vEX3p5HFrK"]["@USCBO Bottom of page 8 \"Not only would enrollment decline, but the people most likely to remain enrolled would tend to be less healthy\""]["New @USCBO report on the latest version of Graham-Cassidy https://t.co/j9nJ0WPtdI https://t.co/kAie0aBWeV"]["The one and only Graham-Cassidy health care hearing continues, watch live: https://t.co/unsoW7J66m"]["The one and only hearing on Graham-Cassidy, watch live: https://t.co/hkleVb1btL"]["If only we anticipated this level of interest and formally requested a larger room to accommodate. Oh wait, we did. https://t.co/BOYoklypi4 https://t.co/2jJeLt48O7"]["We must be there for our fellow Americans."]["3.5 million Puerto Ricans and 100K US Virgin Islanders are in the midst of incredible suffering and devastation."]["Congress must work quickly to put together an aid package for the American Territories affected by hurricanes, including the US VI and PR. https://t.co/Uy2K4z0PGD"]["Live Now: Senator Casey On Cassidy-Graham Health Care Bill https://t.co/1g99xRK7PI"]["A single hearing on a bill they revised last night and plan to vote on this week is not 'regular order' https://t.co/1g99xRK7PI"]["If you truly wanted to 'turn the tide' on the opioid crisis, you wouldn't be pushing a scheme that will decimate treatment through Medicaid. https://t.co/BMzDVMqu6p"]["A pathetic, awful piece of legislation that will devastate families https://t.co/fiFHyiOINo"]["Important info from @larry_levitt. This thread reveals the deliberately misleading numbers being used to spin the \"new\" Graham-Cassidy bill https://t.co/DATpaEA0NG"]["Still a bad deal for PA cc: @GovernorTomWolf https://t.co/lxv0ID3LTB"]["The pre-existing conditions fig leaf is now non-existent https://t.co/jgRwbK7XwT"]["Graham-Cassidy has always been about chasing the ideological trophy of 'repeal.' It will hurt families and is deepy shameful."]["But Graham-Cassidy isn't about improving health care for Americans and never has been."]["The sham process underway for Graham-Cassidy would be inexplicable if the purpose was to actually improve our health care system"]["Can they guarantee that PA seniors won't be impacted by cuts to nursing home care? How about the impact on  individuals w/ a disability?"]["Can the backers of Graham-Cassidy guarantee that Pennsylvanians won't lose their insurance under their scheme? That premiums won't rise?"]["As a member of @SenateFinance I have been preparing for a hearing on Graham-Cassidy tomorrow, but now there's a wholly new bill"]["In fact, according to @washingtonpost, the latest Graham-Cassidy version is even more extreme than the previous version."]["The Graham-Cassidy scheme will still  increase premiums for the middle class &amp; decimate Medicaid"]["According to reports the latest Graham-Cassidy scheme contains legislative bribes designed to gain votes"]["It appears there is a new Graham-Cassidy scheme being put forth tonight. @SenateGOP planning a vote on this new bill Wednesday"]["The majority of PA counties rely on their rural hospitals for both care &amp; jobs. This is a threat to their survival. https://t.co/VGYLYjhnKY"]["Sadly, this has never been about improving our health care system, @SenateGOP just wants to put political points on the board. https://t.co/d3Y4RfBsae"]["More analysis on the devastating effects of #GrahamCasiddy https://t.co/ctIUFuCkdc"]["This reckless action by \n@usedgov will make it harder for schools to hold violent perpetrators accountable."]["This is not just a betrayal of the victims of campus sexual assault-  it also discourages future victims from coming forward &amp; seeking help."]["Secretary DeVos and this Administration have betrayed the victims of campus sexual assault with this decision. https://t.co/1PDviuJVgn"]["Thank you Governor, #GrahamCassidy puts the care of far too many Pennsylvanians at risk. I will emphatically vote no on this bill. https://t.co/pOJu7yhKcA"]["Every. Single. One. https://t.co/icMGfaPIJ2"]["If you promise to fight even half as hard as my new friend Claire, we'll defeat Graham-Cassidy and save Medicaid together. Keep it up. https://t.co/uzBQkhKBJW"]["Graham-Cassidy would decimate Medicaid, worsen the opioid crisis, and raise premiums in every county in Pennsylvania. It must be stopped! https://t.co/Fy6FEMdZib"]["Here's one more: 202-224-3121. That's the number to the Capitol switchboard."]["20%: Next year's estimated increase in premiums under Graham-Cassidy https://t.co/XwOTwaZcBS"]["31%: The cut in funding over the next 20 years for kids who receive care through Medicaid. https://t.co/GAEixCBIan"]["$17,320: The estimated insurance premium surcharge for having a child under Graham-Cassidy. https://t.co/qYIc5hAClQ"]["$4.1 Trillion: the amount of health care funding states would lose over the next 20 years. https://t.co/GAEixCBIan"]["32 Million: The number of people who are likely to lose health insurance under Graham Cassidy over the next 10 years https://t.co/gTakwYWmAn"]["Time for some numbers: 32 Million, 4.1 trillion, 17,320, 16,174, 31% and 20%. Any guesses as to what these numbers mean?"]["There’s nothing ‘moderate’ about Graham-Cassidy. It’s a truly radical “plan” that would decimate health care. https://t.co/b0O8xQJxGG"][".@SenateMajLdr torpedoed a bipartisan health care fix in order to pass a bill that will raise premiums, reduce coverage &amp; decimate Medicaid. https://t.co/7N7EC1i1iy"]["32 million reasons to vote no on Graham-Cassidy. https://t.co/NHdLPu8Tkw"]["Every major patient advocacy group disagrees with you. https://t.co/gHZ4w8bmGt https://t.co/iKUEMjcwTQ"]["The most frustrating thing about this (besides, you know, the actual policy) is that we were making progress on a bipartisan fix to the ACA. https://t.co/zCwMCkERfm"]["The lies coming from @SenateGOP are being exposed. Under Graham-Cassidy, those with pre-existing conditions will lose their protections. https://t.co/r7ltLpcdKi"]["Your advocacy is working, but don't let up until we defeat this travesty of a health care \"plan.\" https://t.co/QmttLoQ8Kj"]["To all those celebrating #RoshHashanah tonight, L'Shanah Tovah!"]["This is a crooked, shameful pursuit of an ideological trophy, no matter who gets hurt along the way. https://t.co/pOM62i3n10"]["Huge losses for PA, which is why @GovernorTomWolf is also leading the charge against this scheme. https://t.co/JiZodVmryn"][".@SenateGOP: Put your constituents first- don't cut health care funding in your own states. https://t.co/8qZk1X5XB2"]["Almost like it’s a political stunt and not a genuine attempt to improve our health care system. 🤔 https://t.co/rOrfOahQ9j"]["No legislative bribe will change the fact that Cassidy-Graham will jack up premiums, reduce coverage and end basic protections. https://t.co/I7USEYu6EA"]["Get ready. The @SenateGOP will try to pass their scheme next week. This terrible bill must be stopped. https://t.co/3molZwhxMX"][".@NPR seems to have read and understood the Graham-Cassidy bill, the @SenateGOP should give it a try. https://t.co/004kgdKU5J"]["You know all those lies the GOP told about the ACA process? It turns out they’re true about the Graham-Cassidy bill. https://t.co/QPKu1pLVBC"]["An essential read from the Secretary of Health of Senator Cassidy's home state. https://t.co/R2swwxLUvI"]["Turns out that when independent experts are allowed to examine the @SenateGOP bill, they find it's destructive to Americans’ health care. https://t.co/tGGezxU4pb"]["@SenateGOP I guess it’s OK because their health care &amp; that of their families won’t be impacted by their scheme. 🙄"][".@SenateGOP doesn’t even know what their bill does to the American people, but they’re for it. https://t.co/7q4ranhIrO"]["@SenateGOP They’re not serious, just chasing an ideological trophy. https://t.co/O4vWSO0GPx"]["If  the @SenateGOP was serious about health care, they would engage in the existing bipartisan process."]["A breakdown of the lies being used to sell the @SenateGOP's health care scheme. https://t.co/BExqYttMZx"]["Graham-Cassidy: higher costs, fewer protections, less coverage. https://t.co/QoNTCN7Z2p"]["Finding out how many people could lose coverage under Graham-Cassidy is not “just a detail” https://t.co/3w2SC2S3mo"]["Sometimes the truth slips out, your @SenateGOP health care beliefs right here. https://t.co/HSqfTR1pRy"]["75 disability groups oppose Graham-Cassidy https://t.co/deA7Sj5rH0"]["This is exactly what the @SenateGOP is up to: sham, farcical hearings https://t.co/9SaXAu4Lhq"]["How about…the American people? https://t.co/9mFjPAJPvr"][".@SenateMajLdr wants to move quickly before the American people find out how much this bill will hike their premiums https://t.co/RgMEEucphE"]["In Louisiana, health officials are warning that Graham-Cassidy would undermine residents’ health care https://t.co/FIGAet3aEQ"]["Yet… this is exactly what the @SenateGOP wants to do. https://t.co/bGuDITOaq8"]["The Graham-Cassidy bill cuts nursing home care for seniors by decimating Medicaid. It must be stopped. https://t.co/PXZvxynCnA"][".@SenateGOP says some @SenateDems will have trouble voting against their bill that will hike premiums and decimate Medicaid. https://t.co/ThZUlHok7Y"]["Shorter version: Graham-Cassidy is a scam. https://t.co/9a7A5NTdBS"]["Are you listening @SenateGOP? https://t.co/26cO0bhuX5"]["@AlecMacGillis  https://t.co/HWukBCA2Kn"]["A bipartisan group of Governors are rejecting the latest GOP health care scheme. Thank you @GovernorTomWolf for helping lead this effort. https://t.co/JpjWK9obev"]["There’s a bipartisan process underway to improve our health care, yet @SpeakerRyan &amp; Admin are desperate for a partisan, ideological trophy. https://t.co/Cme9Ard0fj"]["Bob Casey and Josh Shapiro: Prevent campus sexual assault https://t.co/k9ejIn16qI via @PittsburghPG"]["Another GOP Governor makes clear that the @SenateGOP scheme will devastate Americans’ health care https://t.co/stR7OkbEmc"]["The @SenateGOP are rushing to pass a bill that will undermine Americans’ health care, hoping no one notices before it's too late to stop it. https://t.co/TCdhePFc2F"]["Under Graham-Cassidy \"Insurers would charge about $142,650 more for patients with metastatic cancer.\" https://t.co/qYIc5hAClQ"]["Under Graham-Cassidy \"Insurers would charge about $26,580 more for rheumatoid arthritis and other autoimmune disorders\""]["Under Graham-Cassidy \"Insurers would charge about $17,320 more in premiums for pregnancy\" https://t.co/qYIc5hAClQ"]["Graham-Cassidy ACA Repeal Bill Would Cause Huge Premium Increases for People with Pre-Existing Conditions https://t.co/qYIc5hAClQ"]["@AuntJaneMarie There is always value in making your views known to your elected representatives."][".@SenateGOP is trying to ram through a scheme to decimate Medicaid &amp; undermine protections behind the backs of the American people."]["Will now come 5 days before the reconciliation deadline with no CBO analysis in order to give some false pretense of “regular order.”"]["A hearing on a measure that would impact 1/6 of the economy and hasn’t had serious debate or review... https://t.co/ywazTQVc73"]["The same House Rs who loved their last premium-hiking, job killing health care \"plan\" are all in on this one too. https://t.co/FKfp7BtFBp"]["When the American people reject the GOP's extreme health care bill &amp; they come back with one that's more extreme... https://t.co/AWCq1yXcxC https://t.co/4tNXh2AggR"]["CC: @SenateGOP https://t.co/9HPsNjwqMJ"]["@SenateGOP No wonder they're trying to rush #GrahamCassidy through..."]["The @SenateGOP is well aware that CBO analysis would likely show higher premiums, fewer protections &amp; increased costs for PA families. https://t.co/NDF9OyJga8"]["Further indication of this rushed process: CBO score on Graham-Cassidy won’t even have coverage numbers or premium impacts. https://t.co/NDF9OyJga8"]["Once again Republican Governors are opposing the Republican health care scheme. It’s time for the @SenateGOP to listen. https://t.co/iFO9k4nKMN"]["🤔 https://t.co/RCnWq1cRet"]["The American people deserve to know what harms the new Congressional Republican health care scheme will cause. https://t.co/ftsZoITri1"]["Cassidy-Graham: The last GOP health plan left standing, explained https://t.co/G3ojF2jW3H"]["Sixteen Patient and Provider Groups Oppose Graham/Cassidy Bill https://t.co/jxRCJVjXcs https://t.co/AHEW55z5KS"]["The #GrahamCassidy Obamacare Repeal Bill Still Covers Fewer People https://t.co/OEkolXS5kd via @TheAtlantic"]["New name, same basic \"plan.\" #CassidyGraham ends the Medicaid expansion as we know it, rolls back protections for pre-existing conditions. https://t.co/9ScMULCvQy"]["Under #CassidyGraham, PA would lose $36.7 billion in federal Medicaid dollars from 2020-2026. https://t.co/xrU243bGys"][".@CenterOnBudget: #CassidyGraham would add millions to uninsured, destabilize individual insurance market: https://t.co/XwOTwaZcBS"]["@ElizaJBooth Senator Paul’s proposal sets up a potentially bad scenario https://t.co/OYelHBsB8a"]["PA families will pay for this sabotage with higher premiums &amp; costs. https://t.co/vz33eBdpZT"]["PA residents are paying higher costs because the Trump Admin &amp; Congressional Rs are undermining &amp; sabotaging our health care system. https://t.co/FDpI4JWsxC"]["@realDonaldTrump's refusal to hold white supremacists fully accountable for Charlottesville continues to be an insult to our nation."]["We remember those who lost their lives, those who were injured, those who live, still, with the mental and emotional trauma of that day."]["Our nation is profoundly grateful for your service and sacrifice and that of your families."]["And in a particular way, to those who went into the darkness and the danger following the 9/11 attacks."]["Praying for everyone in Irma's path. It is a devastating storm- please take precautions and do not underestimate its impact."]["@RandPaul Children simply shouldn't be locked up for status offenses."]["@RandPaul A status offense—e.g., breaking curfew or missing school—is conduct that’s only unlawful because the offender is underage."]["I’m proud to have worked with my colleague @RandPaul on legislation to fully end the detention of status offenders."]["There’s still progress we need to make to ensure we’re doing what’s best for our nation’s kids."]["The Juvenile Justice &amp; Delinquency Prevention Act, which made critical reforms to our juvenile justice system, was signed 43 yrs ago today."]["Today, Sec DeVos made the work of holding violent perpetrators accountable more difficult."]["The current regs under Title IX, &amp; the law &amp; regs under my own Campus SaVE Act, already ensure a fair &amp; impartial process for all students."]["Secretary DeVos’ decision to revisit existing campus sexual assault protections is an insult to survivors of sexual assault."]["I traveled over 4,300 miles and visited 32 PA counties this past recess. Here's the recap: https://t.co/9RqHL9sm7X"]["Congress should move immediately to pass the bipartisan Development, Relief, and Education for Alien Minors (DREAM) Act,"]["Instead, their only plan is to deport 11 million individuals, including 790,000 Dreamers."]["It’s clear that the GOP is not serious about fixing illegal immigration, securing our border and reforming our immigration system."][".@ITEPtweets estimates that the 1.3 million young people enrolled in or eligible for DACA pay $2 billion each year in state and local taxes."]["@CatoInstitute And would result in a $280 billion reduction in economic growth over the next decade."]["According to the @CATOInstitute, deporting DACA recipients would cost more than $60 billion."]["Tearing apart the lives of these young people will make our nation less safe, and harm our economy."]["President Trump’s action today is an insult to America and our values. It is unjust, immoral and without regard for basic fairness."]["Our government promised them that they would be protected if they came forward and now President Trump is breaking that promise."]["They have been law-abiding residents who have learned English, paid taxes and secured jobs that support themselves and their families."]["The ‘Dreamers’ are young people who have lived in our country since they were children."]["It'll cost us jobs, it'll hurt our security. It's a total betrayal of the trust of the federal government."]["If the president ends DACA, it's not only wrong and immoral and insulting, it's really bad for our economy. https://t.co/0D65pHWV0e"]["The job of making sure our workers have a level playing field and receive a fair shot."]["On this Labor Day, we remember the work of the past but recommit ourselves to the work of today."]["And too many families lack basic protections like paid and sick leave."]["Too many workers are denied their right to organize and work in a safe environment."]["We have a lot of work to do to raise wages and create good-paying jobs that can support a family."]["...we have much more work to do."]["And we need that inspiration. While there’s no doubt we have made substantial progress for workers since that first national holiday..."]["Those workers, their struggles and sacrifices,  are a source of inspiration for all of us today."]["n 1894, Labor Day first became a national holiday; workers had few protections in the workplace and their voices were often drowned out."]["Who worked and sacrificed to build the middle class and help move our country forward."]["On this Labor Day we’re thinking of so many hard working Americans and in particular, the women and men of organized labor."][".@realDonadTrump The Affordable Care Act is the law of the land. Instead of sabotaging our health care system, work with us to improve it. https://t.co/xS2RYmkhzV"]["The Administration continues to sabotage our health care system, driving up premiums &amp; costs for families. https://t.co/vcgMualy4m"]["Wishing Pennsylvanians celebrating Eid al Adha a happy and blessed holiday. Eid Mubarak!"]["Continuing the discussion on ways the federal government, local leaders and law enforcement can work together to combat the opioid crisis. https://t.co/ImtYxx9s0u"]["While progress has been made, we must continue to fight for that dream Dr. King told us about 54 years ago today."]["Eight years later, A. Phillip Randolph and Pennsylvania native, Bayard Rustin, chose this day to March on Washington for Jobs and Freedom."]["This horrific hate crime should serve as a stark reminder of what happens when hate and bigotry go unchecked."]["On this day in 1955, Roy Bryant and J.W. Milam lynched a 14-year-old boy by the name of Emmett Till in Mississippi."]["My thoughts are w/ all those impacted by #Harvey. Thank you to all emergency officials responding. https://t.co/x6TDl4cJHf"]["I stand w/ @SenJohnMcCain. The opposition to this abuse of the pardon process is bipartisan. https://t.co/MkZ7ST1xYB"]["Another purveyor of discrimination who did not belong in the White House. https://t.co/2h7dLbKXm7"][".@realDonaldTrump thought he could do this during a hurricane &amp; nobody would notice. We did &amp; must hold him accountable."]["This is an abuse of the pardon process &amp; an endorsement of racial profiling. It is wrong. https://t.co/Wu4jmGYi9S"]["PA built the @USArmy Chinook fleet. Celebrating aircraft coming home for upgrades, supporting jobs for decades. https://t.co/nH55LTRTxo"]["Thank you for your work to keep our nation safe, and thank you to the military families that support them at home."]["Thank you to @panationalguard Soldiers deploying to Afghanistan this week. You consistently answer the call to serve."]["Neo-Nazis et al. @realDonaldTrump should condemn &amp; hold accountable those whose ideology led to violence in #Charlottesville"]["Instead of relitigating his failed response to a domestic terror attack, @realDonaldTrump should unequivocally condemn white nationalists &amp;"]["Today, I called on the Administration not to backslide on affirmative action. You can read my letter: https://t.co/UYnuJHhQPA"]["My thoughts are with all those impacted by this incident as our state prays for speedy recoveries. https://t.co/TNYO8HpbPT"]["You can read my full statement here:  https://t.co/PpaawE5UBh"]["We owe our servicemembers a rigorous debate on a new authorization for the use of force in Afghanistan and Iraq."]["The truth is that conflicts in Afghanistan &amp; Iraq have changed significantly since 2001/2002."]["I urge @POTUS to engage Congress to enact a new authorization for the use of military force in Afghanistan and Iraq"]["Afghanistan's future must be decided by the Afghan people, not the U.S. military"]["That such a significant decision was made at a time when state department lacks Senate-confirmed leaders in many critical roles"][".@POTUS proposal deserves a thorough review. I'm pleased military leaders were consulted, but concerned ..."]["I'm praying for the U.S. sailors missing from the USS John S. McCain. Our nation's thoughts are with them and their families."]["@realDonaldTrump must clearly reject and unequivocally condemn white nationalism and those who promote it. Thus far, he has not."]["Apparently white nationalist violence is only scenario that requires @realDonaldTrump \"a little while to get the facts\" before a judgement. https://t.co/UN7zJpPVsp"]["My thoughts are with the two PA State Troopers who were shot in Fayette County last night. All of PA will be with them as they recover."]["Rejecting Steve Bannon is just one step, @POTUS must unequivocally condemn and reject the so-called \"alt-right\" and their hateful ideology."]["He never should have been in the White House to begin with and his departure is welcome news."]["As the head of Breitbart, Steve Bannon was a purveyor of white nationalist propaganda."]["We must fight this together, so I'm interested to hear your ideas- what are you doing in your community to fight intolerance and hate?"]["But, \"the only thing necessary for the triumph of evil is for good men to do nothing.\""]["It's easy to feel discouraged or defeated when you hear of another attack or hate crime..."]["No country or community is immune from violence and terrorism, and this week has been particularly heartbreaking and challenging."]["Yesterday I took a tour of AK Steel to see their work firsthand and to hear how we can improve our trade policy to support their business. https://t.co/bW0rOSk06e"][".@realDonaldTrump should follow this bipartisan example- unequivocally condemn this hateful ideology and Saturday's attack. https://t.co/cHTiTQjoso"]["@realDonaldTrump There are not “many sides” to a terrorist attack. White nationalists fueled this attack and they must be held accountable."]["It appears @realDonaldTrump is back to “many sides” on the Charlottesville terror attack."]["This sabotage is fiscally irresponsible, costing the federal government billions of dollars each year. https://t.co/z4QZjiFtqQ"]["If the Administration continues with this sabotage, premiums could increase by 20% next year, and 25% by 2020. https://t.co/z4QZjiX4Pq"]["Governors from both parties have urged the Administration to fund CSRs. https://t.co/MsrajNS1O7"]["Republican leaders want the Administration to fund CSRs. https://t.co/TyNS4XylBO"]["Halting CSR payments will cost the federal government $2.3 billion MORE, not less. https://t.co/SzYpuaoXH1."]["Today’s @NYTimes report details the consequences of halting CSR payments. https://t.co/PaM3dIs3dn"][".@PAInsuranceDept estimated that halting CSR payments would cause premiums to increase by 20.3% on average statewide https://t.co/HmOoMUGrRv"]["I also wrote the administration and asked them to end this game of chicken with health care. https://t.co/r9XUpHuBH1"]["Yet President Trump has repeatedly threatened to halt CSR payments. https://t.co/ykG2v7Deh7"][".@KaiserFamFound has a good summary of how CSRs help consumers and what’s at stake. https://t.co/rixMH1qCyY"]["Some background: Over 6 million Americans and 200,000 Pennsylvanians have lower health care costs due to CSR payments."]["Specifically, the report examined the impact of cutting off payments that make coverage more affordable. These payments are called CSRs."]["Today @USCBO issued a new report that examines the details the consequences of the Trump Administration’s threats to our health care system. https://t.co/GVPgk8DFLW"]["Hosting a forum on Trade policy with local labor leaders in Wilkes-Barre. https://t.co/SLB93Kh1Sq"]["Or this? https://t.co/O0iUwyL0Fv"]["Don't you agree with this Mr. President? https://t.co/N9mBdcgyvu"]["@realDonaldTrump Call out these white nationalists by name and hold them accountable."]["@realDonaldTrump Mr. President, it's not \"many sides,\" just one. It's time you show some backbone."]["Our nation should never tolerate their racism or their violent acts."]["All of us have an obligation to clearly state that hateful, racist, white nationalist groups were responsible for yesterday’s terrorism."]["The terrorist who committed yesterday’s violent act must be held fully accountable."]["I’m also praying for the law enforcement officers who lost their lives as well, Pilot Lt. H. Jay Cullen and Trooper-Pilot Berke M.M. Bates."]["Today our nation mourns for Heather Heyer, who was murdered in yesterday’s domestic terror attack in Charlottesville, and her family."]["Our nation must stand together and condemn this racism and those who promote it."]["Those marching to promote \"white nationalism\" are promoting a blatantly racist ideology."]["I will continue to fight against cuts to Meals on Wheels and other programs that support senior nutrition and prevent senior isolation."]["I also want to thank Irene G and Irene M for inviting me into their home and sharing their stories with me."]["These volunteers do incredible work supporting our seniors and it was a privilege to see that work first hand."]["This morning I joined Meals on Wheels volunteers to help prep and deliver meals to homes in Allentown. https://t.co/EHOOa329Mh"]["Visiting Village Acres Farm in Mifflintown to get their thoughts on the FARM Bill and hear how we can help farms across PA https://t.co/9RRl7dNDA3"]["Visiting with veterans at American Legion Post 66 in Clarion. https://t.co/Elx6meBXUY"][".@BetsyDevosED is considering undoing the progress we have made to tackle campus sexual assault. I will oppose her efforts at every turn. https://t.co/JqPKMzR4uo"]["My staff and I are closely monitoring the derailment in Bedford County and have been in contact with local authorities."]["We're announcing #ABetterDeal on Trade and Jobs. Watch live now. https://t.co/7d9BgB6G0W"]["This morning, we're announcing #ABetterDeal on Trade and Jobs. Watch live at 11:30. https://t.co/cODTYlxFrz"]["Tonight we also commend @SenatorCollins &amp; @lisamurkowski for their votes in favor of protecting health care for Americans"]["Thank you @SenJohnMcCain for your courageous vote"]["It’s now time for us to work together on commonsense solutions that will make our health care system more affordable and bring down costs."]["The Senate Republican health care plan was a terrible bill for the middle class and that’s why it was rejected on a bipartisan basis."]["There's a tragic irony that on the 52nd anniversary, the @SenateGOP will vote to undo much of the good you and that gavel achieved. https://t.co/G9p3dfGXjt"]["On a day we should be celebrating Medicare/Medicaid's 52nd anniversary, the @SenateGOP will vote to take health care away from millions."]["The @SenateGOP won't even yield for questions about their own bill. Maybe because it’s indefensible?"][".@SenateGOP is refusing to allow additional time to speak on this bill even though it was just released a little over an hour ago."][".@SenateGOP said “we’re not trying to hurt anyone.” Try telling that to the 15 million who will lose their insurance."]["Take in all of table 3 on this @USCBO analysis of the @SenateGOP scheme. What a terrible bill for the middle class https://t.co/XTdh46zUkW"]["Think you're safe from @SenateGOP scheme if you have employer based coverage? Nope, 2 million fewer w/ employer based care by 2026 https://t.co/0O1Ix6lpkN"]["2026 under @SenateGOP scheme 6 million fewer insured in health care marketplace https://t.co/D4cWwrKRmG"]["Fast forward to 2026 and @SenateGOP scheme means 7 million fewer w/ Medicaid https://t.co/jhMHMmIdSk"]["Under @SenateGOP scheme 15 million Americans will lose their coverage next year https://t.co/XZaUpIKtou"]["We've got a CBO score on this obnoxious @SenateGOP bill and I've got my red pen. Let's go through it together https://t.co/bLeqIsgd12"]["We have more work to do tonight. More work to do tomorrow and in the days ahead. I'm grateful you're with us morning, noon, and night."]["7yrs later @SenateGOP health care plan is nothing but an 8 page wrecking ball for middle class families https://t.co/wbC2hDkWoO"]