["After months of bipartisan negotiations, we have reached an agreement on the #DreamAct: https://t.co/gFsBNeoFKO"]["It is unacceptable that in the 21st century so many families have to worry about drinking tap water. Admin should make this a priority to ensure safe, clean drinking water for our kids. https://t.co/kpM8oU6YJR"]["Colorado's family caregivers dedicate countless hours of unpaid care so their loved ones can continue to live independently. Great news for families across our state &amp; country who will get the boost they need now that the #FamilyCaregiversAct was signed into law. https://t.co/Ouq8Blc4v4"]["For your #WednesdayWisdom, follow the work of this new initiative by scientists to better understand the consequences climate change has on your family and community: https://t.co/8BkCAVqG21"]["Taking a moment tonight on #LawEnforcementAppreciationDay to think of all the brave law enforcement officers across Colorado. Thank you for working tirelessly day in and day out to keep our communities safe."]["Important decision out of North Carolina. Partisan gerrymandering erodes one of our most fundamental rights as American citizens. We will not tolerate any effort to threaten our democracy. https://t.co/GoHhrBUhaX"]["Studies continue to show that ACA's Medicaid expansion has helped insure more than 400,000 Coloradans while simultaneously keeping hospital doors open across the state. Important findings as we look to the future of Medicaid and access to care. \nhttps://t.co/HhKTR4BPHJ"]["It was also encouraging that @POTUS expressed his interest in passing comprehensive immigration reform after we pass the #DreamAct."]["To the extent the WH meeting helped narrow the scope of negotiations &amp; prioritize #DreamAct, this was a positive first step. I'm pleased there seemed to be acknowledgement of urgent need to pass a bipartisan bill, so DACA recipients stop losing status &amp; having their lives upended"]["We’re starting to see some real, negative consequences of the worst snowpack in decades—including concerns about water supply. Yet another reason why it is so important to #ActOnClimate. https://t.co/CZvL26gP5H"][".@ENERGY's own regulators rejected @SecretaryPerry's plan to bail out retiring power plants that would've undermined competition &amp; left customers to foot the bill. Instead of slowing #cleanenergy growth, let's invest in smart &amp; innovative 21st cent economy https://t.co/JtEGXE4BFr"]["Look forward to representing Coloradans by protecting a free &amp; open internet. #SaveNetNeutrality https://t.co/0ixP1cic8s"]["For nearly 20 years, 200,000 Salvadorans in the United States – including 2,200 in Colorado – have worked, paid taxes, &amp; supported our communities through TPS. Sending them back to a country still facing high levels of poverty &amp; violence is wrong &amp; potentially destabilizing. https://t.co/g4DU16x6yN"]["The SAFER Act was signed into law today—bipartisan legislation that will help reduce the nationwide rape kit backlog. This progress puts us one step closer to ensuring survivors of sexual violence receive the thorough and fair investigations they deserve."]["The caliber of the WWII Aviation Museum blew me away, and I was honored to help secure congressional recognition for this Colorado Springs museum. https://t.co/ZMDajJNyq7"]["Colorado kicked off the @NationalWestern Stock Show in #Denver this week.\nHere’s a guide to the fun: https://t.co/unYINeSHEW #NWSS2018"]["Introduced legislation earlier this year to ensure legal #marijuana businesses can access banking services. AG Sessions’ actions yesterday will make this even more difficult and may raise significant public safety issues.  Another reason why DOJ must rescind #marijuana guidance."]["Attorney General Sessions’ decision to rescind the Cole Memorandum completely disregards the steps Colorado has taken to regulate legal #marijuana dispensaries and retail stores.  \n\nRead my letter to the Attorney General: https://t.co/qx0DvobMUi"]["In rescinding the Cole memo, the Attorney General failed to listen to Colorado, and will create unnecessary chaos and confusion. https://t.co/vSQuhlkv4D"]["Thousands of Coloradans cancelled their registrations because they knew this voter fraud commission lacked any objectivity or credibility. @DHSgov should end this taxpayer-funded fishing expedition aimed at validating @POTUS's conspiracy theories about the 2016 election. https://t.co/PAZCkw710K"]["Just because it's a new year does not mean we've forgotten about last year's repeal of #NetNeutrality. Coloradans are still speaking up &amp; we are listening. That's why I'm working with @SenMarkey &amp; my colleagues to #SaveNetNeutrality. https://t.co/K4PLhlML4W"]["As of today, 14,586 Dreamers have lost their DACA status. Finding a bipartisan solution for Dreamers should be a top priority on our first day back in session in the new year. #DreamActNOW"]["Congratulations Doug Jones &amp; Tina Smith. Welcome to the Senate! Look forward to working with you as we begin this important year. https://t.co/vfCCOok9EM"]["It’s inexcusable that CO has to find emergency, short-term fixes bc the federal gov has not passed a long-term solution to fund health insurance for our nation's kids. We must #ExtendCHIP. This is a bipartisan issue that deserves our immediate attention.\nhttps://t.co/ZGT4soyNYr"]["As the Senate comes back in session today, we are as determined as ever to stand up for Colorado's families. Starting the year off fighting for #CHIP, #DACA, #NetNeutrality, #CHCs, a government funding bill, and more."]["2018 is going to be another eventful year. Spent today with family &amp; thinking about the important work we have ahead of us. Wishing you all a Happy New Year!"]["Grateful for the bravery of our law enforcement in Douglas County. ​Our prayers are with the families of the deputy who was killed and the other officers injured in the line of duty."]["Getting in the holiday spirit this year. To all who celebrate, wishing you and your families a very merry Christmas. https://t.co/8Ed4TqAfXX"]["Tonight I voted against the temporary government funding bill. We should stay here and finish our work to protect #Dreamers and fund #CHIP, rather than abdicating our responsibility and leaving so many Coloradan families in the lurch. https://t.co/sp3Q2EKjcs"]["LIVE: On the Senate floor talking about why we need to protect #Dreamers — Watch live here: https://t.co/LTXrQ3Z7Nf"]["Sent letter to Senate leadership urging that we include #CHIP in end-of-year funding. CHIP is critical to too many families in Colorado for us to wait. https://t.co/B3GU9IhKFo"]["The #DreamAct already has bipartisan support. @SenMajLdr: If you are serious about protecting #Dreamers, why not bring the bill to the Senate floor today for a vote?\n \nhttps://t.co/1a9wnh4vQf"]["House REPUBLICANS want a SHUTDOWN for the holidays in order to distract from their very UNPOPULAR, just passed, Tax Cuts for the wealthiest and corporations. https://t.co/12mUsLYWfO"]["Republicans are celebrating a hollow political \"win.\" Meanwhile...\n9 million kids are waiting for health care funding. Dreamers are waiting for protections. And middle-class families in Colorado are STILL waiting for real, lasting tax relief. https://t.co/vjfXI1oPHl"]["As soon as American people see what’s in #GOPTaxBill &amp; that it borrows from their children to pay for it, they will reject it. This is a tax cut for the wealthy masquerading as a middle-class tax cut, and not terribly well. The costume is torn. https://t.co/hQzeOipJuK"]["We’ve continued to hear from Coloradans about the @FCC’s decision to repeal #NetNeutrality. That’s why I signed onto @SenMarkey’s resolution to restore a free &amp; open internet. https://t.co/jI13WZsbBm"]["I voted against the #GOPTaxBill last night, and I would do it again. It is so inconsistent with the fundamental promises @realDonaldTrump and Republicans in Congress have made to the American people. https://t.co/61C44qJFfO"][".@SenateGOP just passed #GOPTaxBill – yet another appalling example of how profoundly decoupled the Republican priorities in Washington are from the priorities of the American people. https://t.co/iiLmPsjOPs"]["Tonight the Senate is voting on a radical tax bill that bears no resemblance to  the talking points Republicans are using to sell it. This bill will not benefit the middle class and will add over a trillion dollars to our national debt. Coloradans deserve better. https://t.co/JFWLOclJEZ"]["GOP is about to vote for a tax bill that opens #ArcticRefuge to drilling to “offset national debt.” This will have next to no effect on budget but many negative consequences for tribes, wildlife &amp; national heritage. This fight isn’t over. #ProtectTheArctic https://t.co/yBSIxX4K7e"]["Last week, oil companies had the chance to bid on 10.3 million acres open for drilling in Alaska. In the end, less than 1% of the land was leased. \nWe’re not even using all of the land now available for drilling. It defies reason that we would open up even more. #ProtectTheArctic"]["The House just passed #GOPTaxBill that will increase our nation’s debt by $1.4 trillion. For the same cost, we could provide funding for #opioidcrisis, #EarlyChildhoodEducation, #cleanenergy R&amp;D, #affordablehousing, #infrastructure, &amp; more. \n\nWhich plan do you prefer?"]["For the same cost as the #GOPTaxBill, we could provide funding for #opioidcrisis, #EarlyChildhoodEducation, #cleanenergy R&amp;D, #affordablehousing, #infrastructure, &amp; more. \nRT if you prefer this plan over $1.4 trillion in tax cuts for the wealthiest Americans. https://t.co/lCqzr5Oli2"]["LIVE: On the Senate floor talking abut the #GOPTaxBill— one of the most irresponsible pieces of legislation during my nine years in the Senate. Watch live here: https://t.co/02aS1OQ8BO"]["Intro'd bill with @SteveDaines to reward farmers &amp; ranchers for improving wildlife habitat and providing access for the next generation of sportsmen &amp; women. We’ll continue to prioritize this important program in the next #FarmBill. https://t.co/kMm2com2Dj"]["ICYMI: This is the latest of the administration’s attacks on science. Nothing subtle or vague about it. \nhttps://t.co/35TGIoOESg"]["One topic noticeably missing from #NationalSecurityStrategy: Climate change. Bipartisan group of lawmakers have acknowledged #climatechange as a national security threat. @POTUS silence is cause for serious concern."]["As of today, 12,519 #Dreamers have lost their status. #DACA gave hundreds of thousands the opportunity to attend school, receive a work permit, get a driver’s license &amp; contribute to our communities. We must stop ripping this away &amp; find a bipartisan solution. #AmericanDreamer https://t.co/LiQCSzMZWG"]["What will #GOPTaxBill do to Colorado? Middle-class families won't see any real benefit, while their sons &amp; daughters will have to pay back this $1.4 trillion of debt. Instead, let's invest in solutions to address challenges we are facing in CO, like infrastructure &amp; #opioidcrisis https://t.co/mSa3nihjkd"]["If you need health insurance to start January 1 in Colorado, today is the last day to sign up. Head to https://t.co/WBmr4ffngv for more information. \n\nOpen enrollment for private insurance through @C4HCO continues until January 12. Don’t wait—enroll today! #GetCovered https://t.co/33Apfjad0b"]["#SandyHook—an unspeakable tragedy—should never be normal condition of American life, yet it’s 5 yrs later &amp; we’ve taken no action. We cannot lose belief that it’s within our power to protect our kids at a school—or night club or concert. It’s well past time to #HonorWithAction."]["If we worked in a bipartisan way, we could write a #TaxBill that actually cuts taxes for the middle class, expands the #ChildTaxCredit, makes our economy more competitive, and invests in our future. It’s not too late to scrap the #GOPTaxBill. https://t.co/cc3azpWFLx"]["TUNE IN: Last minute chart review before speaking on @MSNBC about the #GOPTaxBill https://t.co/ZpuPB6XL1G"]["Our office has received nearly 25,000 letters &amp; calls from Coloradans on #NetNeutrality. The consensus could not be clearer: We must protect a free &amp; open Internet. This morning, sent a letter to @AjitPaiFCC in final attempt to #ProtectNetNeutrality. https://t.co/53taLNckxC"]["#GOPTaxBill Conference Committee: Throw out the #ArcticRider. It is shortsighted, expensive, and deeply unpopular. We should protect our greatest national treasure, not exploit it. #ProtectTheArctic"]["Great news: Nearly 1200 companies are aligning their emissions reduction plans with the #ParisAgreement by 2019. This is a clear sign to this administration and countries across the globe that #climatechange is threatening or economy &amp; the future of our planet--and we must act. https://t.co/dAvRkg73oe"]["Then-Maj Leader @SenatorReid said in 2010: \"We’re going to wait until the new senator [Republican Scott Brown] arrives until we do anything more on health care.\" It was the right thing to do. We should follow suit &amp; wait to vote on #GOPTaxBill until Sen-Elect Doug Jones is seated"]["Welcome to the Senate, Doug Jones."]["ICYMI: Colorado businesses are up in arms about potential energy tax provisions in the #GOPTaxBill—as they should be. It's imperative to continue raising your voices &amp; demand removal of these provisions to save #cleanenergy jobs. \n\nWatch full remarks: https://t.co/58BxOq7ctg https://t.co/ZieSEmOxUb"]["Colorado’s #CHIP program will end in January if Congress does not act. Why are Republicans treading their feet on 9 million kids’ health insurance? Surely this is a bipartisan issue. It’s time to #RenewCHIP. https://t.co/aL7rXeTr8L"][".@realDonaldTrump: Our kids are watching. How do we explain this? \n\n@SenGillibrand: Thanks for showing our kids how to stand up to bullies. https://t.co/M8OGKFJRm8"]["Governors on both sides of the aisle are speaking up today in defense of the millions of children &amp; pregnant women who will lose health coverage if we don’t extend funding for #CHIP. @SenMajLdr: Bring #CHIP to the Senate floor for a vote. We must act now. https://t.co/QZpemCHg2a"]["“I grew up thinking I was American, still feel like I’m American, and my kids are national born citizens,” one #Dreamer told me in DC while advocating for the #DreamAct. We must pass a bipartisan deal to protect Dreamers. #AmericanDreamer https://t.co/6ywjZmHpTh"]["If @SenateGOP can find money to add $1.4 trillion to our nation’s debt with #GOPTaxBill, then surely they can fund CHIP–a critical program that provides health insurance to 90,000 kids in Colorado. https://t.co/pzifgtUoay"]["Still shopping around for the right health insurance plan? Take some time today to get covered with Connect for Health Colorado. Open enrollment in CO ends January 12th, so don’t wait. https://t.co/lFhO5AuDJA"]["Alamosa-San Luis Valley Regional Airport is essential to local economic development. Had a great visit Friday, looking at plans for future development and improvements. We’ll keep working with county officials to maintain Essential Air Service funding for the airport. https://t.co/8Oi4yWRDiU"]["With DACA students from the Adams State University Migrant Education Program. They shared powerful stories &amp; expressed fear of what may be in store for them &amp; their families. We must pass a bipartisan deal to protect #Dreamers now. https://t.co/xjJtgCdopG"]["After working for the U.S. Senate for 12 years as a tireless public servant, Charlotte Bobicki retired this week. At yesterday's farewell, I thanked her for serving Colorado &amp; our nation. Charlotte, our team won't be the same without you! https://t.co/xoyXFUWzp4"]["#Climatechange threatens the outdoor recreation jobs &amp; physical safety of Coloradans. We should accelerate transition to clean energy. Instead, #GOPTaxBill slows it down by slashing incentives for solar &amp; wind power. There's still time to stop this.\n \nhttps://t.co/6W49NNGzkt"]["It’s almost game day. Excited to see 10th Mountain Division represented on the field tomorrow. #ClimbToGlory #GoArmyBeatNavy https://t.co/BdQ69zZGIG"]["For people in Colorado, health care is about caring for a sick child or an aging parent. It has nothing to do with politics. It's not too late for @SenateGOP to work on bipartisan #taxreform that would not strip millions of health coverage."]["The day that will live in infamy changed the lives of every American—including in Pueblo &amp; throughout Colorado. A brief look at what this day 76 years ago meant for our state: https://t.co/qKEyhu9AmI cc:@ChieftainNews"]["My statement on President Trump’s announcement to recognize Jerusalem as the capital of Israel and move the United States Embassy in Tel Aviv to Jerusalem: https://t.co/6i1Y5VGvbz"]["Sexual harassment and misconduct are never acceptable. I understand Senator Franken will make an announcement tomorrow morning, and I'm confident he'll do the right thing and step aside."]["A serious solution would be responsive to local leaders around the country who have called for the #DreamAct. We received this letter today from 50 current &amp; former Mayors across Colorado who know how important #Dreamers are to our communities. https://t.co/cIyzEfVZcC"]["Cornyn-Grassley is not a serious proposal to protect the hundreds of thousands of #Dreamers who are in danger of losing their status if Congress fails to act. I will continue working toward a bipartisan solution to pass the #DreamAct before the end of the year. https://t.co/PpRhSDTKCd"]["Spoke with @KDVR's @JoeStGeorge about what the #GOPTaxBill will mean for Coloradans. Tune in this week to find out. https://t.co/GnYxmHqe2e"]["The @CFPB needs a leader who believes in its mission to protect consumers. It has already helped 29 million Americans. We’re urging @POTUS to nominate a director who will put working families ahead of Wall Street. https://t.co/iUkPf35Q2k"]["In Colorado, letters are being sent to families to notify them that #CHIP may soon end. Millions of kids are counting on us to extend funding so they can retain access to health care. @SenMajLdr: We must not delay any longer. https://t.co/oC4zEf5eNb"]["I agree we need to expand the #ChildTaxCredit, make our #CorporateRate more competitive &amp; repatriate overseas funds—but there is a way to do it that lifts up working &amp; middle-class families instead of the top 1% and that does not blow a hole in our nation’s debt."]["As #GOPTaxBill works its way through conference, it’s worth noting again that there are bipartisan issues on which GOP &amp; Dems could work together to bring real tax reform to Coloradans."]["Earlier generations would be disturbed to know that their legacy of protecting wild and sacred places is under assault by @POTUS and his administration. We will fight this attempt every step of the way. #StandWithBearsEars #MonumentsForAll https://t.co/9pB90XCctJ"]["With @POTUS announcement today to diminish #BearsEars &amp; #GrandStaircase, he explicitly:\n1. Disregarded wishes of tribes\n2. Ignored overwhelming public comments from Western leaders\n3. Dismissed @USDA guidance regarding @forestservice lands"]["As we pointed out last week, @USDA did not recommend that @POTUS shrink #BearsEars. Yet, he is set to remove protections for this &amp; other #NationalMonuments today. Unacceptable. #StandWithBearsEars #MonumentsForAll \nhttps://t.co/vqXladMxgs"]["Sunday morning listen: On NPR this weekend, Gretchen Hammer—who oversees CHIP in Colorado—says children may be at risk of losing health coverage because Congress has not extended funding. We must act. \n\nhttps://t.co/m7VtBfLVL6"]["My statement on the passage of the #GOPTaxBill: https://t.co/jMRS86ioXc"]["Offered amendment with @SenSherrodBrown to increase #ChildTaxCredit. We could cut child poverty nearly in half and strengthen middle-class families, but #GOPTaxBill misses the mark."]["For 10 years, Republicans have said, \"Read the bill! Read the bill!\"\n\nWe're expected to vote momentarily. Don't you think we should take time to #ReadTheBill? https://t.co/ZpOQtIHEdc"]["As a former school superintendent, I know that a term paper submitted like this would never pass. Neither should this #GOPTaxBill. https://t.co/ehuKT6UsoU"]["Republicans claim #GOPTaxBill pays for itself, but really it is the sons and daughters of teachers, firefighters, and police officers who will have to pay back that bill. https://t.co/6O0o2Mbh2h"]["@SenateGOP #GOPTaxBill’s misplaced priorities are clear. We need tax reform that lifts up middle class, not that helps top 1%. 3/3 https://t.co/dBJZKAya7b"]["@SenateGOP You can’t eat percentages. Here are the actual dollars Americans will get from #GOPTaxBill. And this is the BEST YEAR; middle-class tax hikes grow over time. 2/3 https://t.co/VkAtoqAbqm"]["THREAD: Here is the chart the @SenateGOP keeps showing you. Looks great, right? But it’s misleading. 1/3 https://t.co/gR4iOGwebe"]["LIVE NOW on the Senate floor talking about the #GOPTaxBill. Livestream: https://t.co/idA4KnmSlS"]["NEWS: The administration is shrinking Bears Ears National Monument, despite the fact that @USDA did not recommend to do so. With @SenStabenow, sent letter to @POTUS requesting explanation. #StandWithBearsEars https://t.co/vqXladMxgs"]["RT if you agree we should scrap this #GOPTaxBill. \nRT if you think we should hold at least a single hearing with input from experts. \nRT if you believe tax reform that will affect our entire economy should be bipartisan."][".@SPBombaci, keep speaking up about this important issue. Yesterday we secured the 41st cosponsor for our bill, which would #ProtectTheArctic if the Senate was operating under regular order. You voice is more important now than ever. https://t.co/StAY8JKqVo"]["RT: We need to slow down, work in a bipartisan manner, hold hearings, and craft a tax reform plan that does not add at least $1.5 trillion to our national debt. https://t.co/76B4dFNNwy"]["Secured 41st cosponsor for bill to #ProtectTheArctic from drilling. This means if Senate was operating under regular order, we could block #GOPTaxScam Arctic rider from passing. Let's listen to American people &amp; protect a national treasure.\ncc: @SenMarkey \nhttps://t.co/eDvoX8A6K1"]["Wait times are too high for Colorado veterans. We need to improve VA system so Coloradans get the timely care they deserve. https://t.co/3uQtaHLMRz"]["There are several bipartisan issues—improve #ChildTaxCredit, make #CorporateRate more competitive—that would form basis for a deal. Borrowing money from middle class to finance tax cuts on wealthy is not basis for a deal. American people are too smart to be fooled by #GOPTaxBill. https://t.co/b2r3XC8hvb"]["Voters thought @POTUS would help the forgotten person, not bestow gifts on the wealthiest Americans. #GOPTaxBill is a disgrace. https://t.co/yGNOF8qmoL"]["TUNE IN: Soon speaking with @KatyTurNBC on @MSNBC about #GOPTaxPlan https://t.co/afKsKsMcbp"][".@POTUS’ retweets of an extremist hate group are irresponsible and disgraceful. Hate groups should be condemned, not promoted."]["Grateful for this team that remembers a cake even on the busiest of days. 🎉 https://t.co/DF2cb9tSTM"]["Have a question about the #GOPTaxPlan? Watch our Facebook Town Hall live now and comment with your questions: https://t.co/uFsiIoydve https://t.co/ZXqXJ1tUsi"]["I'm LIVE on Facebook for a #townhall talking about the Republican tax plan. Tune in and ask a question: https://t.co/pdhUkir00j"]["Let the countdown begin: Less than one hour until we go live on Facebook Town Hall. Tune in tonight at 5:30pm MT / 7:30pm ET to ask questions about tax reform. https://t.co/fC4Dkbq9Qr"]["TUNE IN: Speaking live with @chucktodd to discuss why we must scrap this partisan #GOPTaxPlan &amp; work together to create responsible, bipartisan tax reform. #MTPDaily"]["This year, @SenateGOP tried 4 separate times to repeal the ACA and replace it with a proposal to cut taxes for those w/ yearly incomes over $1 million &amp; slash health care for most vulnerable. We stopped them then, and we must stop them again this week."]["LIVE NOW: Talking about the harmful GOP attempt to repeal the ACA coverage requirement in #GOPTaxPlan in order to cut taxes for top 1%. Press conference with @PattyMurray &amp; @SenatorHassan: https://t.co/kSH2zPsETu"]["Let’s slow down, put aside this flawed #GOPTaxPlan, and come together to deliver a bipartisan plan to address the real challenges in our economy. https://t.co/JQHkgCubiX"]["Every day, more #Dreamers are losing DACA protections &amp; put at risk of deportation. We must #ProtectDreamers &amp; pass the #DreamAct before the end of the year."]["Don’t forget to submit questions for tonight’s Facebook Town Hall on the Senate #GOPTaxPlan. \n\nYou can comment your questions on FB: https://t.co/utophs3hqE\n\nOr you can email questions to townhall@bennet.senate.gov. https://t.co/bvmKwkn0Qa"]["LIVE TOMORROW: Hosting a Facebook Town Hall on Tuesday at 5:30pm MT / 7:30pm ET to answer your questions about the Senate Republican tax bill. Submit questions ahead of time here: https://t.co/utophs3hqE  \n\n#TownHall #VoicesOfCO https://t.co/L1jG0Vhyq0"]["Families whose children are covered under #CHIP started receiving letters today notifying them that their health insurance will soon end if Congress doesn’t act. We must extend funding for this critical program. https://t.co/kWFDFrP3AE"]["Thank you to every Coloradan who marched, showed up, wrote letters &amp; gave back to our community. From my family to yours, #HappyThanksgiving https://t.co/wqqnXERjYI"]["Coloradans have spoken &amp; the consensus is clear: A free and open internet is essential to our democracy and economy. We need enforceable #NetNeutrality rules to ensure every citizen has fair access to information. https://t.co/aPAfROO2sq"]["The census is a vital part of our vibrant democracy. We need a director who is committed to acting impartially and ensuring full participation. https://t.co/aC0IyxQBmW"]["While GOP is trying to slash taxes at top &amp; leave our kids to foot the bill, intro’d amendment to lower #HigherEd costs by:\n-increasing tax credit for college by $500/year\n-eliminating taxes on Pell Grants\n-exempting AmeriCorps award b/c taxes shouldn't be a barrier to education"]["Great news: Our bill with @BillCassidy to ensure EMS professionals can administer life-saving drugs to patients was signed into law. A bipartisan effort that will benefit Coloradans and ensure access to emergency care.\n https://t.co/BrPfPouark"]["@telemundodenver Thank you @telemundodenver for hosting an informative call session for Coloradans to ask questions about immigration casework. We will continue to make every effort to support CO's Latino community and pass a clean #DreamAct."]["Our team is taking calls about immigration policy at @telemundodenver for 10 more minutes. Call in with any questions: https://t.co/FEcTU72FM6"]["Have questions or concerns about immigration, #DACA, the #DreamAct or more? Some of our staff who focus on immigration policy are taking questions at @telemundodenver until 5:30pm MT. Call in: 1-844-200-5336 https://t.co/a93vKIGxVO"]["The application for spring internships in our Washington, D.C. office closes this Friday, November 24th at midnight. If you’re interested, find out more and apply. Looking forward to reading applications: https://t.co/Fw65HTf3oC"]["Your Sunday Read: Americans rightly expect their Senators to carry their voices to Washington &amp; craft policy that is responsive to their health care needs. That's why @timkaine &amp; I introduced #MedicareX. https://t.co/BfTUMd69PF"]["This week, sent a letter to @SecretaryZinke in support of National Parks. Raising park entrance fees would hurt Colorado’s economy &amp; create barriers to access. Instead, let’s engage more communities in the outdoors. #NationalTakeAHikeDay https://t.co/J7k9TkHyc7"]["It’s #NationalTakeAHikeDay and we’re recounting some of the amazing places across Colorado we’ve hiked. Follow on Instagram to see more: https://t.co/KjqcG6YTGe https://t.co/HMXlzS3ZJA"]["Our children &amp; their children don’t have a vote in the Senate. They’re counting on us to provide them with a future free from the burden of our debt. My amendment last night was simple: Millennials would not have to pay for the $1.5 trillion debt created by #GOPTaxBill. https://t.co/ztx6eVe5qS"]["Led effort to save PACE financing &amp; reached a bipartisan compromise last night. PACE creates jobs, saves energy, decreases pollution &amp; reduces costs. Now homeowners of all incomes can keep using PACE to install solar energy &amp; make efficiency upgrades: https://t.co/lBvKCa0xTC"]["In the late hours of last night, @GOPSenFinance jammed a tax plan through committee that will cut taxes for Americans making more than $1 million/yr &amp; leave our kids to foot the bill. \n\nThis is not over yet. We have to stop this terribly misguided legislation."]["This is the math at the heart of the #GOPTaxPlan. How is this a plan for the middle class? https://t.co/17UABbmwix"][".@GOPSenFinance had the opportunity to vote for Brown-Bennet-Casey bill that actually would have helped working families. Instead, they just shut it down. Here’s the problem with the #GOPTaxPlan compared to our #ChildTaxCredit bill:  \n \nhttps://t.co/kRKliAmeV7"]["@realDonaldTrump @POTUS @SenSherrodBrown If my colleagues vote for the #GOPTaxPlan, they forfeit any right to claim that they are fiscal conservatives."]["@realDonaldTrump @POTUS One way to help middle-class families is American Family Act introduced w/ @SenSherrodBrown to expand #ChildTaxCredit: https://t.co/V1UKTNbEpE"]["@realDonaldTrump @POTUS Received letter from Erin in Thornton, CO. She has 2 kids, earns middle-class income, pays her mortgage—yet still struggles to get by. “How are the pieces not fitting together?” she asked. A real tax plan would focus on families like Erin’s, not on slashing taxes for millionaires"]["@realDonaldTrump @POTUS Met mom at early childhood center in Rifle, CO who told me: “I’ve got a job so I have health insurance &amp; every dollar I make goes to pay for this early childhood center so I can have a job.” Too many Americans are caught in this cycle. https://t.co/vLVK7eM7Fh"]["@realDonaldTrump @POTUS Challenge with our economy is not that millionaires &amp; businesses don’t have enough money—it’s that incomes for everyone else haven’t kept pace with rising costs of housing, health care, &amp; education. #GOPTaxPlan is solving for wrong problem. https://t.co/3SUfosxyx7"]["During the campaign, @realDonaldTrump said:\n\n-everybody's got to be covered\n-no cuts to SS, Medicare, or Medicaid\n-you'll get great health care for fraction of cost\n\nHow does #GOPTaxPlan, which would strip 13 mil of coverage &amp; increase premiums by 10%, square w/ @POTUS promises?"]["LIVE NOW on the Senate Floor to raise the voices of Coloradans who will be harmed by the senseless Republican tax plan: https://t.co/3TPEnfdWMZ"]["With the #GOPTaxBill, we are giving our children the short end of the stick. We are telling the next generation, “We’re going to live in the house, but you have to pay the mortgage.” https://t.co/470hQaJbkz"]["GOP attempts to drill in the #ArcticRefuge will have little influence on our budget but huge negative consequences for tribes, wildlife, and our national heritage. #ProtectTheArctic https://t.co/aeO07NJoyB"]["With #COP23 taking place this week, it’s time we reassess our approach to #climatechange. Ds need to fight smarter &amp; Rs needs to rejoin the debate. Read my latest op-ed in @USATODAY: https://t.co/i2b6S2hTWF"]["@KyleClark Was fixing my tie as you ordered your sub. https://t.co/NF3uBxajb1"]["First, Republicans tried to sneak tax cuts into a health care bill. Now, they’re trying to sneak health care cuts (stripping coverage from 13 million to be exact) in a tax bill. Stop. Be transparent. Work on bipartisan policy that will actually help Americans. https://t.co/VSpEHAW82J"]["A single mom working as a waitress in Rifle, Colorado with 2 kids would receive nearly $1000 less in Child Credits than a U.S. Senator with 2 kids in Washington under the #GOPTaxPlan. How does that make sense? https://t.co/e3GimjL41U"]["Just now in @SenateFinance: Aside from @ChuckGrassley, @POTUS administration &amp; GOP experts refused to commit to keep tax credit extensions for wind &amp; solar energy in #GOPTaxPlan."]["Not only will @USGAO investigate @POTUS “Voter Fraud” Commission because of our letter, but now a member of the Commission is suing the panel due to lack of transparency. #ShamVotingCommission https://t.co/2GtdvjBdsP"][".@SenateFinance markup of #GOPTaxPlan has begun. Delivering opening remarks LIVE now on the hypocrisy of this partisan process that will add to the deficit &amp; hurt middle class families: https://t.co/cb1Q4oFLGK"]["Finally have #GOPTaxPlan analysis &amp; couldn't be more clear: Tens of millions of families earning &lt; $200K/year will see tax increases. Should spend time in today’s @SenateFinance markup on real plan to help middle-class families—not giving tax breaks to those who need them least. https://t.co/1unqKbXNYQ"]["Thank you to the U.S. cities, states, and businesses in America's Pledge for supporting the #ParisAgreement at the UN #COP23 this past weekend. We applaud your leadership &amp; recommit ourselves to #ActOnClimate.  https://t.co/GbZ3yuFL8r"]["Facts and truth are not the adversary; those who interfere in our elections are.  Believing Putin over our intelligence community is not putting America First. https://t.co/DGYOGlpnzv"]["Thank you to all of the #Dreamers serving our country in the armed forces. Your sense of duty to your country will never go unnoticed. #VeteransDay https://t.co/GHtBhflV1L"]["Celebrating #VeteransDay weekend installing solar panels in low-income communities with a great team from GRID Alternatives, including four veterans. Thanks for all of your hard work in our CO communities. https://t.co/oqWRtYTb7V"]["Today we honor the invaluable contributions of our veterans &amp; reaffirm our commitment to support them &amp; their families. In Colorado, we strive to make our state the best place for veterans to live &amp; work. Thankful for our brave men &amp; women this #VeteransDay &amp; everyday."]["It is 1:30 ET on Thursday afternoon and we have not seen the GOP tax plan. We have not had a single hearing. Not a single economist has given their opinion. This is not the way to legislate. Every hour that goes by is one more hour Americans are not getting the truth."]["Speaking LIVE to protect the #ArcticRefuge. In Colorado, we know we have a responsibility to protect public lands. Watch here: https://t.co/IRRdrYGmRs"]["LIVE now with @SenSherrodBrown discussing our #ChildTaxCredit ahead of the Senate GOP tax plan: https://t.co/hqrUxh65YC https://t.co/QvZE2eaOZJ"]["Sat down with @politico's @ddiamond to ask: Why should people have to pay for insurance that's of no use to them? Listen to the latest #PulseCheck to learn about the answer from @timkaine and me to give Americans more health care options. Hint: #MedicareX\nhttps://t.co/ccgRaqOF1v"]["GOP Tax Plan relies on the tired notion that huge giveaways at the top eventually trickle down to everyone else—even though no good evidence supports this. We need real, bipartisan #taxreform. https://t.co/ROKv5o3MvB"]["Not only must we ensure background check system has information it needs, we also must implement universal background checks across country. https://t.co/L0UKlnbIU6"]["It's time we update laws to address unique needs of #LGBT elders—aging baby boomers who deserve more targeted care. https://t.co/plIVdnsDO8"]["Our background check system relies on complete info to keep communities safe. Calling for complete review of records https://t.co/HJriXKB7cq"]["Even Syria will join #ParisAgreement. This doesn't make America great. It makes us the only country denying the reality of #climatechange."]["Applications are now open for our spring internships in Washington, D.C. Find out more and apply before November 24: https://t.co/Fw65HTf3oC"]["Great visit to see how the partnership between @coloradowheat and @ColoradoStateU researchers strengthens our agriculture economy. https://t.co/RxRc3XCs4w"]["Tailgating before @AFFootball game this wkd w/@SecAFOfficial, @GenDaveGoldfein, @AF_Academy Superintendent, &amp; our 2 cadet CO Springs interns https://t.co/uUM0FC0DuI"]["Devastating news of another mass shooting. Our hearts are w/ victims in TX. Americans should not live in fear of gun violence. We must act."]["Happy #NationalBisonDay. Cosponsored a resolution to celebrate our national mammal—a historically important part of culture in the West. https://t.co/8VhrvaXr3c"]["Glad to see the administration is finally catching up with what Colorado has long-known.\nhttps://t.co/E56asyG39b"]["Signed brief w/@RepDianaDeGette @RepPerlmutter @RepJaredPolis. All Americans should be protected from discrimination https://t.co/S2Wr1IbeOC"]["As we think holistically about health care, #dialysis bill is practical step to improve outcomes for some of CO's most vulnerable patients. https://t.co/Xkj4BEBSjo"]["#Dreamers are counting on us to pass #CleanDreamAct &amp; provide certainty for their futures. We will do everything we can to pass by end of yr https://t.co/LFrpSgnLCT"]["#TaxReform is hard—and only way hard things get done right is through bipartisan consensus. GOP should work w/ Dems to create lasting reform https://t.co/1ds5t6VRFz"]["In failing to renominate Janet Yellen, @POTUS missed an opportunity to keep a proven leader at the helm of important American institution. https://t.co/e591sEzrNO"]["Too bad GOP had unbalanced panel at #ArcticRefuge hearing. Won't stand for selling #PublicLands or Arctic drilling to pay for #TrumpTaxScam. https://t.co/Zl3hUeyeA0"]["Our ag &amp; rural communities deserve best &amp; brightest at @USDA. Sam Clovis was not that person (or even a scientist). Glad to see he withdrew. https://t.co/VOlp83zgNj"]["Heading to speak at press conference on similarities bn failed Kansas tax cuts experiment &amp; new GOP tax plan. LIVE: https://t.co/Nkht9Edr8j"]["Grateful to law enforcement for arrest of suspect in Thornton shooting &amp; to all first responders. Thoughts are with victims &amp; their families https://t.co/EOgKAPyFkB"]["Waiting for more information, but praying for the victims of tonight's shooting in Thornton. Thank you to all the first responders."]["A visit from an old friend, Bishop Peter Eaton, who used to serve as dean of St. John’s Cathedral in Denver. https://t.co/Ss6d9f0zoV"]["Attacking science is not an act of independence, @EPAScottPruitt. We must fight #climatechange, not skew data for industry interests. https://t.co/509RNygQgz"]["Fed funding should be used to build more resilient, efficient energy systems after disasters in PR, USVI, TX, FL: https://t.co/6LgLRP4BZf"]["Good to hear from these Colorado emergency medicine providers who applauded Senate passage of #EMS bill &amp; had ideas to fight #opioidcrisis. https://t.co/QozcuINpQz"]["Congratulations on a successful mission. Great to see the American flag you brought back &amp; discuss importance of assured access to space. https://t.co/6ZpOZnG7FI"]["Met Jack “2Fish” Fischer today, a Colorado #astronaut who spent 136 days in space aboard the International Space Station on Expedition 51/52 https://t.co/tlGWMnj7na"]["Open enrollment for health care begins TODAY. Go to https://t.co/uzNy0UhpLy now to compare plans &amp; RT so everyone can #GetCovered. https://t.co/qSBZiZGg1K"]["@LittleLobbyists Grateful for all of the time &amp; work these @LittleLobbyists &amp; families dedicate to advocating for kids across country https://t.co/OLJyufNtzA"]["How are you celebrating Halloween? I spent time w/ @LittleLobbyists—who despite complex medical conditions—were so joyful. #TrickOrTreatment https://t.co/KV3zvZf9gd"]["Our thoughts are with everyone affected by this senseless attack in New York City today. https://t.co/OKnmzAtHiU"]["Which sounds more urgent: cutting child poverty rate with #CTC bill or sending $130,000/yr to wealthiest households? https://t.co/kbVuqYPAIm"]["Instead of claiming tax cuts trickle down, GOP should help families that need it most with my #ChildTaxCredit bill: https://t.co/i3aoRHMEqN"]["Jefferson understood value of #freespeech. While @POTUS attacks media, we must teach our students importance of free press &amp; edited content. https://t.co/RmAd8l11NS"]["Admin is trying to undermine #sagegrouse conservation plan. We're urging @SecretaryZinke to extend comment period→https://t.co/nwhjB8QKJH"]["To abolish #BearsEars against will of tribal leadership &amp; stakeholders disrespects those who've had a deep connection w/ land for centuries. https://t.co/BqbEIsmVFD"]["New #ChildTaxCredit bill is essential to our economic future—families like one I met in Rifle, CO need greater economic security to thrive. https://t.co/pqKyOs0SXB"]["Expanding #ChildTaxCredit would lift millions of kids out of poverty. More on why we intro'd a bill to do just that: https://t.co/2asTJmEFH1"]["Discussing new American Family Act to expand #CTC. More stability for parents improves kids’ educational outcomes, health &amp; income as adults https://t.co/MSCSGChY6p"]["NEWS: The American Family Act, introduced with @SenSherrodBrown today, would cut child poverty nearly in half by expanding #ChildTaxCredit. https://t.co/gsSYdxRQ2Z"]["@SenSherrodBrown Bill triples #ChildTaxCredit to $250/mo per child &amp; $300/mo for kids under 6— dramatically more effective tool to support working families."]["Introduced American Family Act with @SenSherrodBrown to support middle-class families &amp; cut child poverty in half: https://t.co/WbHEF8zJ2M"]["@USGAO @POTUS @CoryBooker @amyklobuchar The @USGAO investigation will uncover the #ShamVotingCommission’s motives and influence of its work: https://t.co/mW4ZHIxMt3"]["@USGAO @POTUS @CoryBooker @amyklobuchar Just last week, members of the bipartisan Commission sent letters to leadership noting concerns about its mission: https://t.co/jTDsLGCBcw"]["@USGAO @POTUS @CoryBooker @amyklobuchar The Commission’s lack of transparency is unacceptable—and even its own members are questioning its integrity: https://t.co/KEVHUTGQWH"]["@USGAO @POTUS @CoryBooker @amyklobuchar A little background: \"Voter Fraud\" Commission has been partisan &amp; questionable since conception: https://t.co/zMpL7Nfgys"]["BIG NEWS: @USGAO accepts our request to investigate @POTUS “Voter Fraud” Commission. https://t.co/7u3PTeeN6b"]["Nothing could brighten our days and give us hope more than these @LittleLobbyists! #trickortreat https://t.co/M66tjb5qdd"]["#OpioidCrisis claims 142 deaths/day. We're calling on @POTUS to allow gov to help lower prices for life-saving drug: https://t.co/0x7HTnvXVi"]["In CO, we closed gun show &amp; online loopholes &amp; implemented reasonable background checks. It’s past time for Congress to follow our lead. https://t.co/qQyG89toub"]["Introduced Background Check Expansion Act with my colleagues today to reduce gun violence in our communities: https://t.co/BT1R3QW4kG https://t.co/g6gzbJk4H8"]["Bill will allow #EMS professionals to administer life-saving drugs while creating safeguards to track substances: https://t.co/oWfTUytsAq https://t.co/lzpHWs7opT"]["Applaud Senate passage of #SAFERAct so law enforcement has access to resources &amp; training to process rape kits.  https://t.co/ntkOSGWxkC"]["#AlexanderMurray CBO highlights benefits to American taxpayers &amp; cuts to deficit. Senate should swiftly pass bill &amp; @POTUS should sign it. https://t.co/hVJgBnxfi8"]["Wildfire funds are a bandaid &amp; won’t provide needed fix. Time to end fire borrowing so @forestservice has resources to mitigate future fires https://t.co/QBFF3HGaH6"]["Agree “election integrity is a worthwhile goal that shouldn’t be sullied by partisan tricks.” #ShamVotingCommission https://t.co/qeU1YQp9Ll"][".@POTUS should listen to @USGAO directive to #ActOnClimate bc disasters are costing tens of billions to our economy. https://t.co/4NhmDoJuTe"]["This yr, met addiction experts in CO w/@SGottliebFDA to learn ways to address #opioidcrisis. Important first steps: https://t.co/WGlsrght9k https://t.co/jttJaK30xF"]["\"@POTUS Commission on Election Integrity has integrity questions of its own.\" Precisely why investigation is needed. https://t.co/KEVHUTGQWH"]["14 rural counties in Colorado only have one health insurance option on the individual market. #MedicareX would provide the plan they need. https://t.co/PIwe4y8nJH"]["Listen to my latest interview on @SXMPOTUS radio for more on lowering costs through #MedicareX: https://t.co/Dx5nbTQlI6"]["National Rural Health Association supports #MedicareX because it knows our rural communities deserve more options and lower costs. https://t.co/XKidDdwHth"]["Agree with @dailycamera that health insurance should not be a \"privilege attached to wealth or employment.\" It's time for #MedicareX. https://t.co/fHRVovMEq3"]["Inspiring to see the funding we fought for is being used to transform this Northern Colorado community after 2013 floods. #ResilientStVrain https://t.co/MnFkVqqSu2"]["Your Sunday read: Why we think #MedicareX is the best way to stabilize markets without adding to the national debt https://t.co/f2xO4ejA6c"]["Why we are urging Senate leadership to include bipartisan #wildfire funding fix in future disaster aid bill: https://t.co/aFDebe7dQp https://t.co/6sjIjMiEbl"]["Impressive work after 2013 floods. Community is investing in projects like #ResilientStVrain to make us more resilient for future disasters. https://t.co/WMImwEAigQ"]["ICYMI: @voxdotcom asks @timkaine and me about #MedicareX – Here’s what we envision for the public plan and the country’s health care system. https://t.co/m4GE0Xi6gI"]["We must do more to increase voter participation, not suppress it. One reason we're asking @USGAO to investigate WH voter fraud Commission. https://t.co/Y1b2MfPUnv"][".@SenateGOP just cleared the way for tax cuts for the wealthy and $1.5 trillion in more debt that our children will have to shoulder: https://t.co/gG9g7540o4"]["5,000 Coloradans unregistered because of @POTUS Commission efforts. This among other questionable actions requires full @USGAO investigation https://t.co/t1l9LiNSJk"]["Trying to open #Arctic to drilling by way of #budget resolution is political stunt masquerading as energy plan—and we will fight to stop it. https://t.co/HiacuovQSK"]["Bipartisan #AlexanderMurray responds to testimonies @timkaine &amp; I heard in HELP cmt &amp; will help stabilize markets in places like Colorado. https://t.co/TKeeSyVwPV"]["RT if you agree that a public option is important step to lower costs &amp; provide more choices for rural communities. #MedicareX cc: @timkaine https://t.co/vFAykz9N7h"]["LIVE now on @Morning_Joe with my friend &amp; colleague @timkaine to talk about our plan to lower costs &amp; increase competition with #MedicareX. https://t.co/foDiMFwdQ3"]["Tune in this morning at 7:20 am ET to hear more from @timkaine &amp; me about #MedicareX on @Morning_Joe https://t.co/Efo70xwNYE"]["14 of Colorado’s 64 counties only have one health insurance option on individual market. #MedicareX would change that. https://t.co/A6DWUsZ1m7"]["Read more about why we're calling on @USGAO to review \"voter fraud\" Commission's questionable motives &amp; objectivity https://t.co/GFjWk2NHlK"]["Sent letter to @USGAO urging investigation of WH \"voter fraud\" Commission's motives with @amyklobuchar @SenBooker. https://t.co/Kcsng1t5ym https://t.co/MrKepPtI2v"][".@timkaine &amp; I want to establish #MedicareX so individuals &amp; families have more health care choices &amp; lower costs. https://t.co/UfooE6lTDX"]["#MedicareX is \"significant step\" to universal coverage, lower costs &amp; proposal w/ most \"realistic chance of becoming law in the next decade” https://t.co/DsCFRUSYH3"]["45,000 Coloradans rely on the #CSR payments that @POTUS ripped away. #AlexanderMurray is a bipartisan way to fix this chaos."]["So what is Medicare-X? @timkaine &amp; I explain what it means for you and your family: https://t.co/mGrofAtVgl"]["LIVE: w/@senmarkey rejecting GOP effort to jam language in budget to allow drilling in Arctic Refuge #NoArcticRider https://t.co/gvm0jnTpfF"]["In rural communities, limited competition is leaving many Coloradans with fewer choices and, in many cases, only one high-cost option. https://t.co/Npl4ANOb3a"]["NEWS: Introducing bill w/@timkaine to create Medicare-X to provide meaningful &amp; affordable #healthcare alternative https://t.co/q21xHLOvxk"]["On final day of #HispanicHeritageMonth, we continue to demand that every member of Congress support the #DreamAct: https://t.co/HK6W7YwzlG"]["Celebrating 5 yrs of breakthrough therapies &amp; the most resilient proponent of legislation, Friends of @CancerResrch: https://t.co/2PPW6Fqw2p"]["Read in full why @POTUS decision not to certify #IranNuclearDeal is wrong move: https://t.co/BiuIusIqBT"]["Not certifying #IranNuclearDeal undermines US security by risking credibility &amp; leverage w partners needed to address Iran's malign behavior https://t.co/a3ws9RmOIw"]["@POTUS .@POTUS should be encouraging bipartisan negotiations to strengthen health care for millions of Americans--not undermining them"][".@POTUS decision is a cruel move that will raise premiums for those who can least afford it. https://t.co/QN5rYMi6RN"]["Always enjoy meeting farmers &amp; ranchers across our great state of CO—especially for #FarmBill listening sessions. Happy #NationalFarmersDay https://t.co/ortVp6ZRau"]["Read my latest op-ed: Why walking away from #IranNuclearDeal would isolate U.S. &amp; severely damage our credibility https://t.co/BiuIusIqBT"]["Melissa’s story is why we must speak up, share experiences, &amp; fight for bipartisan health care fixes. Share your own story with #VoicesOfCO. https://t.co/7T50xEcQla"]["This is not a tradeoff @POTUS should be willing to make. Instead, he should look to HELP Cmt for bipartisan fixes: https://t.co/i1AFs8NrLO"]["POTUS claims EO will increase comp &amp; lower costs, but really will weaken consumer protections to create skimpier plans &amp; higher health bills https://t.co/90Alpjm5Sa"]["Resurfacing this video. @POTUS should work to strengthen our #FirstAmendment rights, not tear them down. https://t.co/ymylWEq6P7"]["@POTUS .@FCC &amp; @AjitPaiFCC: Please clarify FCC’s independence so @POTUS’ threats don’t have chilling effect on free speech."][".@POTUS continues his effort to undermine the #FirstAmendment and freedom of the press. https://t.co/J9YuAy1qRG"]["@EPAScottPruitt Admin should reverse shortsighted &amp; damaging decision. Clear its priorities are not in line with those of American people. #ProtectCPP 5/5"]["@EPAScottPruitt Proof we need #PollutionTransparency &amp; why we intro'd bill last week to standardize cost of climate pollution: https://t.co/XpFqbF75gq 4/5"]["What’s more: In #CPP revision, @EPAScottPruitt only accounts for 14% of scientifically-developed value of cutting carbon emissions. 3/5"]["In CO, we already committed to meet carbon standards set under #CPP &amp; will continue to create jobs, save money &amp; protect our air quality 2/5 https://t.co/IIGCX7mgUE"]["#CPP repeal—which admin justifies w/ alternative facts—threatens thousands of new jobs &amp; billions in revenue while sacrificing clean air 1/5 https://t.co/iIgkMNBGW2"]["Impressed by @Solar_Decathlon students in Denver. They’re studying STEM &amp; helping build #cleanenergy economy for the future. #EducationDay https://t.co/RgltaUsxTU"]["Proposal is unnecessarily cruel &amp; wasteful, focuses on wrong priorities &amp; undermines values. Dreamers should not be used as bargaining chips https://t.co/qvyUhqpTU0"]["With CO Home Building Academy’s Pat Hamil talking apprenticeships &amp; internships to train students for future in construction industry. #CTE https://t.co/EfzdMffUJo"]["Good governance bill to strengthen American assistance around world will ensure transparent &amp; effective investments: https://t.co/EbGBVp0TTd https://t.co/s0bZtGAwty"][".@SenateGOP cannot get away with using budget process to circumvent debate about #ArcticRefuge drilling. We must #ProtectTheArctic."]["Thanks to these @CleanAirMoms for important advocacy to protect the planet for our kids &amp; grandkids. #ActOnClimate https://t.co/f7L76H4Q7O"]["#CleanPowerPlan repeal would be another @POTUS action to roll back protections for America’s children. Wrong priorities. https://t.co/oce0zWaYMd"]["Always encouraged by engagement from Coloradans—see it in town halls &amp; in reactions this week. Thank you: https://t.co/kdsTkAPzLV"]["Intro'd bill to help #wildfire recovery &amp; prevention efforts with @MikeCrapo @SenatorTester @SenatorRisch @RonWyden: https://t.co/9KikC50oF3"]["We need a #cleanenergy future, and our bill is an important step to making that happen: https://t.co/XpFqbF75gq"]["Resolution we passed ystdy marks October National Energy Awareness Month. On same day, admin began process to rollback the #CleanPowerPlan."]["Admin blatantly disregarded science &amp; economics by undoing carbon pollution metric. Why intro'd bill to standardize→https://t.co/t57o7LnlOy"]["Thanks today &amp; everyday to educators around globe giving kids gift of knowledge &amp; creativity. There's no more important job #WorldTeacherDay https://t.co/ttkmqcWgu4"]["When did this become normal? \n\nRead &amp; watch my full remarks on gun violence in America: https://t.co/p8HcP4yZOl #EndGunViolence"]["Heard someone say mass shootings are “price of freedom.” What a shame—what a surrender that represents to our kids &amp; victims of these crimes https://t.co/sp4YAX4ZHn"]["@SenFeinstein @SenKamalaHarris @RonWyden @SenWhitehouse @SenatorHassan @BenCardinforMD @SenJeffMerkley @MurrayCampaign @ChrisVanHollen @SenWarren @POTUS CO industry &amp; community leaders have spoken: They’re standing up for our future &amp; supporting #PollutionTransparency https://t.co/Ss8vdubhgA"]["@SenFeinstein @SenKamalaHarris @RonWyden @SenWhitehouse @SenatorHassan @BenCardinforMD @SenJeffMerkley @MurrayCampaign @ChrisVanHollen @SenWarren We won’t let @POTUS undervalue the costs of #climatechange that are harming our kids &amp; economy. RT if you agree. https://t.co/Md2V1OOAMB"]["We can't stand by idly as admin blatantly disregards science. Intro'd bill to standardize cost of climate pollution: https://t.co/XpFqbF75gq https://t.co/Z2bjHRAcWB"]["Closing this gap is the least we can do to try and reduce gun violence in our communities. #EndGunViolence"]["Cosponsored bill to fix glitch in law that lets ppl avoid restrictions on converting firearms into murder weapons: https://t.co/csEy7En7FH"]["NEWS: Court finds admin's delay of #BLM #methane rule unlawful. Let’s return to important work of protecting kids &amp; grandkids. #ActOnClimate https://t.co/8KgeLxtVPg"]["Game on @Dbacks (&amp; @SenJohnMcCain)\n\n#Rocktober https://t.co/Q1hNBieABv"]["Standing strong with Colorado’s #Dreamers &amp; urging my colleagues to pass the #DreamActNow. https://t.co/vQd9Ck5rLD"]["This is why we are fighting so hard for immediate extension of #CHIP. Colorado’s kids &amp; expecting mothers deserve certainty of care. https://t.co/dQfgHxmaxi"]["#CHIP extension in @SenateFinance is step in right direction. @SenateMajLdr should put #KidsAct on Senate floor for vote immediately. https://t.co/r6ak17bXLY"]["#BLM #methane rule delay is step in wrong direction. Should be addressing climate change &amp; protecting CO health—not delaying implementation. https://t.co/hQ1L2rIBaN"]["Cosponsored bill w/ @SenCoryGardner to extend funding for #CHIP. It's too essential to CO families to delay further: https://t.co/IFBR4B6X1X"]["@POTUS Much of Puerto Rico is still without power, water, food, and medical attention. Here is how you can help: \n\nhttps://t.co/TYcPnYxqch https://t.co/A9g3KIL6DT"]["When TX and FL needed aid, did @POTUS also complain about the budget? Puerto Ricans are our fellow Americans. And they need our help. https://t.co/yXo8yJXfdx"]["#DACA deadline is in 2 days. If you are applying, your renewal request must reach the @USCIS office by Oct 5—so send in ASAP. #DefendDACA https://t.co/izGm0acfbc"]["Thanks to Kevin Heiner from SW Conservation Corps for testimony on #21CSC to increase natl service opps for youth &amp; vets to restore outdoors https://t.co/EVx71m3mfG"]["W/ @POTUS traveling to PR tomorrow, reiterating call for swift action &amp; aid, among more requests in letter last wk: https://t.co/VJAmgCGw6d"]["Cosponsored bipar KIDS Act to extend CHIP funding for 90,000 kids in Colorado. Unacceptable that we’ve let this funding lapse. Time to act. https://t.co/IEHAmNiNhS"]["Thanks to tireless first responders &amp; law enforcement for work you continue to do to help victims &amp; comfort community from #LasVegasShooting https://t.co/n3XZzMnQNn"]["Devastating news. Our hearts go out to all of the victims and their families in Las Vegas."]["Unacceptable that funding for CHIP &amp; community health centers expired last night. We can't leave Coloradans in limbo https://t.co/dfdAiJW7wR"]["Using budget process to circumvent debate about #ArcticRefuge drilling is unacceptable. Will continue fight to protect this iconic natl gem. https://t.co/ctHnZcjENT"]["Asked @SecretaryZinke for rapid response to invasive mussel species in CO Reservoir w/ @RepJaredPolis &amp; CO lawmakers https://t.co/GETVMjQQeu"]["Hateful act stands contrary to all that makes us strong. Grateful for example Academy leaders set by making clear this will not be tolerated https://t.co/OdQnV0JHB4"]["Have long called for bipar process on #healthcare reform. Hopeful deal will be reached that’s responsive to testimonies we heard in HELP cmt https://t.co/ZGV1D8BtuF"]["Sent @POTUS bipartisan letter requesting robust refugee admissions goal; exact opposite of today's announcement. https://t.co/1PBIlXgmPO"]["This betrays American values &amp; does nothing to strengthen security. Admin must reconsider &amp; consult with Congress. https://t.co/ppySa2Az66 https://t.co/72i8NyjQOB"]["Our fellow Americans need us. We will push in Congress &amp; @POTUS must do everything in his power to help PR recover.\nhttps://t.co/nIY0xVBGp9"]["Worked with @SenatorEnzi to ensure continuation of successful &amp; cost-effective program to improve health &amp; safety in workplaces across CO. https://t.co/hNFHOkcYmW"]["Committed to work on fiscally-responsible #taxreform to boost competition &amp; paychecks, but GOP plan doesn't come close to this standard. https://t.co/gLayeGxOE5"]["NEWS: #CHRONICCare Act just unanimously passed Senate. Modernizing Medicare will reduce costs &amp; strain on families: https://t.co/0VnzWQDsks"]["TOMORROW: Speaking at @amprog at 1pm ET about range of incentives that distort Congress &amp; feed dysfunction. Details: https://t.co/z4rd3HYcit https://t.co/01MeQv4csu"]["Good to hear from @SecretarySonny about immediate need to end penny wise, pound foolish practice of fire borrowing: https://t.co/7x8cTRdvH8 https://t.co/yj3TPS5GI6"]["Speaking LIVE now on the Senate floor about what comes next for #healthcare reform: https://t.co/syxVjyZiu3"]["Why I've urged @POTUS to disband Voter Commission that spews voter fraud conspiracies &amp; stifles voter participation. https://t.co/4NXMMDok1Z"]["#NationalVoterRegistrationDay is a great reminder that ALL Americans should have access to ballot &amp; trust that their information is secure."]["It's #NationalVoterRegistrationDay. Make your voices heard in our democracy. Take 2 minutes &amp; register to vote. \nhttps://t.co/xgJEZNpv9E https://t.co/kHWDTEHSae"]["A testament to those who showed up &amp; spoke out. But our work is far from over—time to return to bipartisan process to fix health care system https://t.co/MvLHytJmTH"]["Tune in to watch @USDA @forestservice briefing on fixing #wildfire funding. More on our legislation here: https://t.co/Vzy9t1a7Qf https://t.co/8yBEonKUiv"]["#MenForChoice day is a reminder that health care is personal &amp; women should be empowered to make their own choices on what's best for them. https://t.co/e0CgNqh4Pg"]["ICY(somehow)MI: #GrahamCassidy would harm millions. Period.\nhttps://t.co/JPBUFGlGRx"]["In Colorado, we #ValueCHCs because they are critical to our state. Will continue to push for funding extension: https://t.co/xMhkEOHVZS https://t.co/qk1y9u005N"]["Our fellow Americans in PR &amp; Virgin Islands face devastation from #HurricaneMaria. Congress must step up &amp; provide resources for recovery."]["Under #GrahamCassidy instability would dramatically increase over next 2 yrs bc every state must create new health care system w/o resources https://t.co/2HMCfRtqXq"]["#GrahamCassidy would throw ppl off Medicaid w/ no suggestion for how they'll be covered. @SenateGOP: Why are we here making matters worse? https://t.co/64fRiUGUbx"]["TL;DR: #GrahamCassidy would mean 580k lost jobs, $240 bil lost econ activity &amp; more uncertainty in insurance market https://t.co/68eBaHUV68"]["SOON: Pressing @SenateGOP colleagues on how they expect Colorado to maintain access to health care after losing billions in federal funding. https://t.co/tB7qcAc8Go"]["Just met hundreds in line to attend @senatefinance #GrahamCassidy hearing. Thank you for coming. We are listening. https://t.co/hX2thMLhTH"]["Last minute giveaways make no improvements to deeply flawed bill. Let’s resume bipartisan talks—the only way to fix our health care system. https://t.co/LRgU0fJoFU"]["Instead of threatening effort, admin must work w/ West to keep conservation plan intact for Greater Sage-grouse &amp; sage-brush ecosystem. 2/2"]["Today marks two years since the decision to keep the Greater Sage-grouse off the endangered species list. 1/2"]["Senate Republicans should listen and return to the bipartisan process that was already underway in the HELP Committee. #NoGrahamCassidy https://t.co/ctXGgCMoKF"]["CO leading way w/ 13 states on track to meet #ParisAgreement target. Regardless of admin decision will #ActOnClimate https://t.co/7RlTpeJIzO"]["ICYMI: In Colorado, nearly 470,000 would lose coverage in 2027 under #GrahamCassidy. We won’t stop fighting this harmful bill. https://t.co/8VslR5KHyh"]["Calling for immediate action to extend critical funding for Community Health Centers before it runs out this month https://t.co/xMhkEOHVZS https://t.co/vDy0J8YHuD"]["#NDAA amendment we secured this wk will officially recognize museum in Colorado Springs as America's National World War II Aviation Museum. https://t.co/n18aFBXLFJ"]["#GrahamCassidy would raise premiums for Colorado...\n+ It won't stabilize insurance market\n+ It does nothing to fix our health care system https://t.co/wux9EQNQ0r"]["Dreamers strengthen our families, boost our economy, and make our communities safer. We must pass the #DreamAct."]["Bill w/ @SenCoryGardner would end fire borrowing, allowing @forestservice to restore forests &amp; prevent future fires. https://t.co/Vzy9t1a7Qf"]["NEWS: Colorado could lose up to $78 billion (that’s BILLION with a B) in next 20 yrs if #GrahamCassidy becomes law. https://t.co/sKgmBWfkQg"]["@politico @SenBrianSchatz @ChrisCoons A constructive step toward refocusing Congress’ priorities away from partisan squabbles &amp; onto real challenges. https://t.co/LoMtCsdUBB"]["@politico @SenBrianSchatz @ChrisCoons Here's the truth: The debt limit has nothing to do with fiscal responsibility. Why I intro'd a bill to eliminate it→ https://t.co/QgwL7TFyT3"]["FIRST LOOK in @Politico’s #Huddle &amp; #MorningMoney: Introducing bill with @SenBrianSchatz &amp; @ChrisCoons to eliminate the debt ceiling. https://t.co/DSS66msDyG"]["We should have learned our lesson by now on #Trumpcare. The latest #GrahamCassidy is partisan attempt that cuts funding &amp; threatens coverage https://t.co/D4b9yoWAS4"]["#MiningReform bill to help clean up CO mines, improve water quality &amp; prevent future disasters like Gold King spill https://t.co/bWy3go77Rc"]["Losing $823 million in federal funding is not a health care plan; it’s a massive cut that hurts Coloradans who need care most #GrahamCassidy https://t.co/ksyFZu75B3"]["Once again: Repeal &amp; replace bill that would be devastating for Americans. Will continue to fight #GrahamCassidy &amp; protect care for Colorado https://t.co/w1ggQrMXdI"]["Consumers should know their info is safe. Calling on @FTC to review data security at @Equifax @TransUnion @Experian https://t.co/qc26rQeDjF"]["Wrong priorities: admin continues on path to dismantle natl monuments, despite their enormous value to our heritage &amp; economy #KeepItPublic https://t.co/xEI3T2mO3q"]["Amendments we secured in #NDAA will benefit CO—from supporting transitioning troops to bolstering innovation to protecting our space assets."]["#NDAA passage ensures servicemembers are equipped to defend US &amp; is testament to bipartisan work that's possible. https://t.co/5757w0zKCH"]["Happy #AFBday to the @usairforce. We are honored to be home to you &amp; your families in Colorado. Thank you for serving our country for 70 yrs https://t.co/K0LqjfZUax"]["This #HispanicHeritageMonth we're celebrating the integral role Hispanic Americans play in CO’s history and culture. https://t.co/QY7AVoC1ns"]["This wkd we celebrated #ConstitutionDay. Why is the Constitution important to you? Send in your answers &amp; we'll feature some in coming weeks https://t.co/HXIqJswKkt"]["Must continue bipartisan work to stabilize ind insurance market. This is path forward—not #GrahamCassidy that would strip 32mil of coverage."]["In Denver, @DPSNewsNow was first school district in America to hire &amp; train #DACA teachers—now they are invaluable. We must pass #DreamAct. https://t.co/DWbO4DAIBH"]["With no evidence of US voter fraud, calling on @USGAO to audit activities of @POTUS Voter Commission cc: @CoryBooker https://t.co/uVOaMnHJsQ"]["Wish I could pull off that jacket @Lin_Manuel https://t.co/vQFO1IY5Wi"]["Saw In The Heights twice last week at Denver School of the Arts &amp; shared this with @Lin_Manuel to celebrate #ArtsEdWeek. #BecauseOfArtsEd https://t.co/9Mwu2dx5gs"]["@Tomas_Regalado Mayors who deal with #climatechange firsthand know we cannot wait another moment to take action. If not now, when? https://t.co/6fTlqQYIzJ"]["Encourage all my colleagues—Democrats and Republicans—to take seriously Mayor @Tomas_Regalado’s call to action on #climatechange."]["As recovery and cleanup continues in face of #Irma and #Harvey, important statement from Mayor Tomás Regalado. https://t.co/filHLv6fl7"]["About to join @chucktodd on #MTPDaily. Tune in soon. https://t.co/GUlBVeaMya"]["Tracking the first game from my office tonight. #BroncosCountry #BeatTheChargers https://t.co/qud7jIFf6D"]["Solar farm turned community program is now a model for the country. CO is at the forefront of climate innovation. https://t.co/h6Q4ZajQz5 https://t.co/GrOqEKYsdQ"]["#Dreamers are more than statistics of potential economic loss. Compelling case from @msudenver author for #DreamAct https://t.co/bIJ3wigz90"]["On this we can all agree: With start-up scene, outdoor benefits, thriving labor force &amp; culture of inclusion, Denver is like no other. https://t.co/J6MDCZcfSB"]["We will #NeverForget the innocent lives lost, heroism of nation’s first responders, or indefatigable American spirit #September11 https://t.co/CuvkQ49EK2"]["To every Dreamer in Colorado &amp; around the country: We see you, and we know how much you deserve to be in this country. #DreamAct #DefendDACA https://t.co/WRd6vJIgWk"]["That’s why we’ve worked for years to ensure 100% of CO counties can access reliable broadband &amp; we won’t stop working until this goal is met"]["Expanding access to #broadband is critical to closing the digital divide, creating job opportunities &amp; building a 21st century economy. https://t.co/6wcZCTjNFC"]["All young ppl deserve to feel safe on college campuses. @BetsyDeVosED's threat to roll back Title IX protections puts them even more at risk https://t.co/9MZKUy3j6w"]["Defending DACA is about doing right by young people—like Marissa and Marco—who in every sense are our fellow Americans #DreamAct #DefendDACA https://t.co/uZ93P3UPVD"]["Honored to introduce my old boss &amp; @GovofCO in Senate HELP cmte. Important discussion on fixes to health care system with bipartisan govs. https://t.co/GUMUqWOgvx"]["Admin should provide long-term certainty for CSR payments to minimize damage it's already caused. Full statement: https://t.co/jKB30P9wyo"]["Another reminder of what we discussed in first bipartisan hearing—must increase competition, transparency, and affordability to fix system. https://t.co/9NANBG2l7f"]["Intro'd bipartisan SAFER Act to reduce our nation's rape kit backlog &amp; ensure justice for sexual assault survivors.\nhttps://t.co/DdftZO43mB"]["Heading to our first bipartisan #healthcare hearing in the HELP Committee. Ready to work to find ways to lower costs for Coloradans."]["Read my full remarks from tonight on the Senate floor in defense of #DACA &amp; in support of the #DreamAct. https://t.co/zGZ7xjFbRq"]["@SenCoryGardner #DreamAct offers promising solution amid time of uncertainty for hundreds of thousands of young immigrants. https://t.co/uB0n3Pi3R1"]["@SenCoryGardner Speaking LIVE now on the Senate floor to #DefendDACA and support the #DreamAct. Watch: https://t.co/L2jwcjKg94"]["Heading to the Senate floor to speak about @POTUS' cruel decision today to rescind #DACA. Tune in LIVE on Facebook: https://t.co/fC4Dkbq9Qr"]["POTUS decision is height of cruelty: attempt to score political points by separating families &amp; disrupting schools &amp; workplaces. #DefendDACA https://t.co/umeJejPtoQ"][".@POTUS must acknowledge gravity of situation, demonstrate leadership &amp; articulate strategy to address threat alongside int'l partners. 2/2"]["North Korea poses a grave threat to our nation's security and to global stability and norms. 1/2"]["@POTUS We value the DREAMers in CO, and we stand with them to #DefendDACA"]["@POTUS Ending DACA isn't just cruel, it also hurts our economy. DREAMers work hard, pay taxes, and are invaluable in our communities. #DefendDACA"][".@POTUS might end DACA and send thousands of DREAMers back into the shadows. This is the height of cruelty. We must #DefendDACA."]["Ready to work with Senate colleagues on real tax reform that benefits all Americans. (2/2)"]["#TaxReform should cut taxes for lower and middle income families and not add to our national debt. This is common sense. (1/2)"]["Pleased to see power companies, labor unions, + environmentalists come together to develop a plan to transition CO to clean forms of energy https://t.co/HTTwzX18Gq"]["CO schools are making improvements and proving that where you live or who your parents are shouldn't determine a child's academic success. https://t.co/Jn0vrNFTaC"]["Hope everyone had a great first week back at school. Looking forward to see what Colorado's students accomplish this year. https://t.co/xVPuG6S0qu"]["Our aging infrastructure hurts our economy and threatens driver safety. Ready to work towards a bipartisan deal to invest in our future. https://t.co/MvubZEzB6x"]["Toured Eisenhower Tunnel w/ @ColoradoDOT last week to learn more about urgent need for infrastructure improvements in CO. https://t.co/P6k12KtmJt"]["Celebrating the anniversary of women’s suffrage on #WomensEqualityDay &amp; committing to fight until we achieve full equality."]["Arpaio unrepentantly targeted Latinos, violated their civil rights &amp; ignored court's order to stop. Pardon is desperate, shameful &amp; unjust. https://t.co/wTGH9gTq2I"]["Great hosting @SGottliebFDA in CO. We met w/ families, bioscience leaders &amp; health experts, &amp; gained insight on fighting the opioid crisis. https://t.co/JwfOxumiUs"]["Happy Birthday @NatlParkService! Colorado is grateful for everything you do to maintain our beautiful #publiclands. #FindYourPark https://t.co/YrRmynvK0h"]["At #COGA2017 with @SenCoryGardner today answering questions from oil &amp; gas leaders about how to address climate change &amp; grow our economy. https://t.co/cGdzCgfJvM"]["Met with the CO legislative committee tackling the opioid crisis. We all have more to do to address this growing problem. https://t.co/VIhIrX4O8n"]["Tune in to watch our Steamboat Springs town hall LIVE now: https://t.co/PllnK26k5G https://t.co/ZnTSBxvwA2"]["Speaking at Water Congress in Steamboat Springs about the importance of fighting #climatechange &amp; protecting our #watershed. https://t.co/e0iHDXTz0V"]["Kids w/ cancer deserve access to the best, most innovative treatments. RACE for Children Act will help more kids like Carver. https://t.co/vyDBoVRSNv"]["Still time left for this great program from @COParksWildlife--a small way to thank those who are serving or have served our country. https://t.co/N42kwxzKYX"]["REMINDER: Holding a town hall TODAY in Steamboat Springs. Details here: https://t.co/Vx9Q9EJTDY"]["W/ @SGottliebFDA, @cobioscience &amp; @CUMedicalSchool, holding roundtable on progress &amp; future of bioscience w/ industry leaders from across CO https://t.co/J0136UaXlx"]["Hosting @SGottliebFDA today in Colorado to meet with @cobioscience, @uchealth &amp; @ChildrensColo to discuss innovative approaches to medicine. https://t.co/HZtC2Xsg3b"]["Not only did Alisson get to see a solar eclipse on her first day of school, but she also made sure I didn't miss it. #SolarEclipse2017 https://t.co/bdkR7HJOsA"]["Climate change is real, and ignoring it won't make it go away. We need to listen to scientists so we can minimize the impacts. https://t.co/RiAZTTxJ6e"]["ANNOUNCEMENT: Holding a town hall in Steamboat Springs this Wednesday from 2-3 PM MT. Click here for more details: https://t.co/Vx9Q9EJTDY"]["Watching the #SolarEclipse2017 at Newlon Elementary with principal Rob Beam, @SuptTomB, &amp; State Rep Susan Lontine. Thanks for having us DPS. https://t.co/wLiOlm68b0"]["It's starting... #SolarEclipse2017 https://t.co/5bjLsd2spH"]["We're getting ready...Do you have your glasses? If not, watch a live stream of the solar eclipse here: https://t.co/y1wCJ6lc1F"]["Welcoming students and teachers back to school at Goldrick and Castro Elementary. #WelcomeBackDPS https://t.co/5p4ApcLl7x"]["Happy Eclipse Day! Enjoy this once-in-a-lifetime event, but make sure you stay safe by following these tips. https://t.co/nyuFIVW3qe"]["Thinking of the sailors and families of the USS John S. McCain. Praying for the safety of the missing sailors."]["Starting the day with @SuptTomB at Goldrick Elementary. Excited to kick off the first day of school. https://t.co/INjq1Ic1PP"]["We strongly condemn the horrific attack in Barcelona &amp; stand by Spain, our European ally. Our thoughts are with the victims &amp; their families"]["Nothing beats traveling around our beautiful state. Follow my Instagram for more photos: https://t.co/NNyxTi5p8V​ #thatssocolorado @NewsCPR https://t.co/PaUn0bd0xo"]["Congratulations to @emmajcoburn from Crested Butte for breaking the world championship record. We are proud fellow Coloradans. https://t.co/geY6OSAUQj"]["Thankful to @AIEnvironment @AspenInstitute for hosting an engaging, bipartisan forum on addressing climate change &amp; boosting clean energy. https://t.co/tWdWqTka6k"]["We'll continue to fight hate in all its ugly forms until everyone is safe &amp; feels welcome in their communities. This is a helpful resource: https://t.co/JIl6UKwP8s"]["We stand with all Coloradans who feel threatened by those spouting hatred &amp; inciting violence. Together, our voices and values will prevail. https://t.co/SYW9TkoQU7"][".@POTUS should continue payments that make it possible for families to access health care. Withholding would mean up to 20% higher premiums. https://t.co/RRMAFJDxgR"]["@POTUS White supremacy is wrong. There is no moral equivalence. We will repeat this and act against it until we stop having to."]["Teleprompter @POTUS condemns white supremacy, unscripted @POTUS blames \"both sides.\" No one should need a teleprompter to do the right thing"]["With @SenateDems, calling on @POTUS to #DefendDACA so DREAMers can keep contributing to the country they love. https://t.co/ZAVmYfyeAp"]["#DACA is under threat &amp; DREAMers are anxious for their future. We must #DefendDACA &amp; protect the more than 17,000 recipients in Colorado."]["Today's attack is not the result of “many sides”— it's an act of domestic terrorism. @POTUS should explicitly denounce white supremacy."]["The events in VA are contrary to all we stand for as a country. Embrace inclusion, celebrate differences—that's the America we believe in."]["Incredible hike from Crested Butte to Aspen along West Maroon Pass w/ my family. Reminder of how fortunate we are to live in the best state. https://t.co/5GDTbjqqbc"]["Thank you to everyone who participated in our democracy yesterday by showing up &amp; sharing stories at the Aspen #townhall. https://t.co/f9NmAw3o2S"]["Spent 11 miles exploring some of Colorado’s most beautiful terrain with my 3 girls. Doesn’t get much better than this. https://t.co/0PTTes52fS"]["Tune in to watch our Aspen town hall LIVE now: https://t.co/gBFImTt3KD https://t.co/1VLtm8Chql"]["This was a beautiful day in @RockyNPS. Thank you to these hardworking @NatlParkService rangers for showing us around. https://t.co/EmvAmLjDrX"]["Intro'd bill bc we can &amp; should create opportunities for hardworking ppl in communities dealing w/ loss of coal jobs https://t.co/kCqRMJLcE2"]["@RockyNPS Democracy is more than noise you hear on TV; It’s hard work of citizens—as imperfect as we are—working together to find common way forward. https://t.co/H6FGT7Ki9l"]["@RockyNPS What makes us American is what we believe: in free speech, worship, &amp; press; in the rule of law; &amp; in the power to determine your future. https://t.co/eGXQtw7KZK"]["@RockyNPS As citizens, we have a set of responsibilities to speak out, demand truth, &amp; question power when it falls short of our deepest values. https://t.co/wnkAvZUi4e"]["Had the honor of attending a naturalization ceremony in @RockyNPS and welcoming 48 new citizens to our country. https://t.co/aynfkXAJu5"]["It’s confirmed: Last year was Earth’s hottest year on record. Colorado knows we must address the real threat of human-caused #climatechange. https://t.co/yUAy0fKWtI"]["This will require deterrence and concerted efforts to work with countries in the region—not reckless tweets that escalate the situation."]["The U.S. must respond with a comprehensive strategy that includes clear and sustained diplomatic efforts, backed by economic pressure."]["NK is racing to pursue destabilizing &amp; dangerous nucle​ar program, which threatens our security, including personnel, partners, and allies."]["Law will ensure we start to do more to explore the potential that innovative therapies can have for kids with cancer https://t.co/YoPnTD8gFo"]["ANNOUNCEMENT: Holding a #townhall in Aspen this Friday at 3:30 PM MT. Click here for more details: https://t.co/HdQKbjVZhu"]["At MVP Feeds: startup providing feed for small livestock producers. Small businesses like this are driving rural economies across Colorado. https://t.co/LEYUHH23aX"]["Thank you to everyone in Sterling who attended our #townhall last night &amp; engaged in the great discussion on health care and the Farm Bill. https://t.co/hpHpqgBCX1"]["We also met with new teachers who are preparing for school. Thankful to see eager professionals ready to teach our young students. https://t.co/2qt6l79Ex5"]["Toured Greeley Schools kitchen facility that's helping feed kids all summer w/ fresh local produce, then ate lunch w/ some of these students https://t.co/xtpRSytXhd"]["Great talk w/ @EzraKlein about the broken state of Congress &amp; the path to making it work for Americans once again. https://t.co/b5lolONqUp"]["In another sunflower field today. Reminds me of 2009 town halls with @lynn_bartels: https://t.co/AX6CGK3eFf https://t.co/DkNzi9Y4bH"]["We have an obligation to provide our coal communities with the support they need to thrive again in today's economy. https://t.co/ayQOmz0ujK"]["Reminder: Holding #townhall today in Sterling at Northeastern Junior College. Doors open at 4:30 PM. More details: https://t.co/iS6aMzPHCV"]["Another packed house in Greeley for tonight's #townhall. Thanks to everyone who joined us to ask questions &amp; voice your concerns #VoicesOfCO https://t.co/vQ01pZ4Ni2"]["LIVE NOW: Watch #townhall in Greeley https://t.co/y6biFQthrH"]["@USDA @ColoradoStateU @SenCoryGardner Federal investments are critical for research like we saw today to improve crop yield with more efficient water use. https://t.co/Ea3HmtWZa1"]["Toured @USDA @ColoradoStateU Limited Irrigation Research Farm today w/ @SenCoryGardner. Watched how drones are helping evaluate crop health. https://t.co/jX4E1fGaJa"]["6 Colorado counties qualify—Delta, Gunnison, Las Animas, Moffat, Rio Blanco &amp; Routt—making them eligible for a powerful array of incentives."]["Introduced bill to spur investment &amp; job creation in rural coal communities through tax cuts &amp; support for high-quality worker training. https://t.co/OSewqzRufc"]["Reminder: Holding #townhall today in Greeley at UNC University Center. Doors open at 5 PM. More details here: https://t.co/iS6aMzPHCV"]["Thanks to all who came to &amp; watched #TownHall in Durango today. Great to hear from so many in the community and answer your questions. https://t.co/naj6WEGx8K"]["Enoyed my tour of Gold King Mine w/ @GovofCO. Now I'm off to talk to the community in Durango. https://t.co/Gw3TYqIh2f"]["Introing bill to help cleanup abandoned mines, improve water quality &amp; prevent future disasters like Gold King spill https://t.co/grDrrsb2yb"]["Senate passed RACE for Children Act, which will give kids w/ cancer more and better treatment options. Read more ➥https://t.co/XHtiSGZ81d https://t.co/uiLrvZEvY8"]["Holding a town hall in Durango tmrw w/ @GovofCO, @RepTipton and @SenCoryGardner following a tour of Gold King Mine. https://t.co/rZyHjPlJWK"]["The bill makes investments to improve veterans’ access to care at the VA and provides funding for the Choice program."]["Supported this bill to improve our veterans’ access to VA care and protect care in the community. https://t.co/00uO08yRVW"]["Reducing legal immigration will not fix our broken system. Need real solutions consistent with our values and that strengthen our economy. https://t.co/PP8RMKoAn7"]["Hope this will start a longer conversation to increase competition, affordability, &amp; transparency while lowering costs &amp; improving quality."]["This is a promising step toward addressing the problems in our health care system in a bipartisan way. https://t.co/pQ0Do1ipzN"]["#Startups create good jobs, especially in CO. Let's work to support their innovation so we can grow our economy. #StartupDay"]["Happy #ColoradoDay! CO has a booming economy, beautiful landscapes, and special people. Happy to call this place home. https://t.co/TcymTgPuO1"]["CO is leading the way in community solar to lower energy costs, expand our economy, and help fight climate change. https://t.co/m022LZ9mN5"]["No party—Republican or Democrat—has the votes to fix healthcare alone. Bipartisanship is the only way forward. Now the real work begins."]["Thanks to everyone who rallied to #ProtectOurCare. Your voices made the difference. Keep it up as we work toward health care reform. https://t.co/qNFWVSztew"]["Spoke at CO Lives On The Line rally today about working together to abandon partisanship and fix our health care system. https://t.co/t1GILLYFU9"]["The fight isn't over. Stay engaged. Demand that your leaders reflect your decency and common-sense. https://t.co/wk9UhkUY5w"]["Grateful to @SenJohnMcCain for his vote last night and his call for a bipartisan process."]["As a father, I'm grateful for the example @lisamurkowski &amp; @SenatorCollins set for my daughters. Thanks for standing strong throughout."]["Taking calls this morning to thank Coloradans for speaking up to defeat disastrous health care bill. This is proof our republic still works. https://t.co/aZ8DZWogVS"]["Coloradans &amp; people across the country relentlessly raised their voices to defeat this disgraceful health care bill. https://t.co/qWggr7bDTN"]["It's 9:50 and we still haven't seen the bill. #SkinnyRepeal"]["Tonight, Senate passed strong, bipartisan sanctions on Russia, Iran, &amp; North Korea. @POTUS must sign bill into law. https://t.co/T6KNMaQuJ0"]["It's 8:30 on the night we are going to have this vote and we haven't seen the bill. #SkinnyRepeal"]["Rescinding DACA would disrupt lives of over 17,000 Coloradans. @POTUS should commit to protect—not threaten—DREAMers https://t.co/ZAVmYfyeAp"]["A rational response from @DeptofDefense protecting all service members, no matter their gender identity. https://t.co/0ZBuZdLnFF"]["But really...where's the bill? https://t.co/ozXKJdW2cJ"]["Title VII is meant to protect all Americans from discrimination. Of any kind. Period. https://t.co/1faXk5yARP"]["In CO, skinny repeal could mean:\n\n-269K lose coverage\n-avg annual premiums up $751\n-uncompensated care for hospitals up $242M\n\nUnacceptable."][".@GovofCO + 9 bipartisan govs wrote letter rejecting skinny repeal. States are speaking up &amp; @SenateGOP must listen. https://t.co/RW271bRTRn"]["How would a skinny repeal affect Colorado? @denverpost explains: Hospitals could shut down &amp; insurers could bolt from market. https://t.co/SoYxumPv1E"]["So called \"skinny\" repeal would be devastating—leaving 16 million uninsured. Once again, this will not fix our health care system."][".@SenateGOP continue to be relentless in passing a harmful #healthcare bill. Now it’s crunch time. Your voices matter more than ever. https://t.co/5UWLoMzZkt"]["Voted no on @SenateGOP repeal with no replacement. Bill would've kicked millions off insurance. Relieved it failed, but the fight continues."]["Our commander-in-chief should not ban Americans who are qualified to serve in our military &amp; willing to risk their lives for our country. https://t.co/fzar4kLiby"]["Voted against #Trumpcare repeal &amp; replace that would cost 22 mil people health care. We're still fighting any repeal &amp; won't be discouraged."]["Great to have @MichelleObama in Denver speaking at @WFColorado about importance of empowering women in our community. https://t.co/wyQMTd8VTj"]["On the Capitol steps after today's shameful #healthcare vote. This is not the way to fix health care. https://t.co/xFFLsCR61U"]["Thank you @SenJohnMcCain for your call to work together. The loudest partisan voices should not drive our debate."]["It’s shameful that @SenateGOP just voted to take up unknown legislation that could harm millions of Coloradans and Americans."]["We strongly reject any effort to limit reporters’ access to senators or advocates. Restricting freedom of the press is never acceptable. https://t.co/xPioTpI4g3"]["CO businesses continue to lead fight against climate change bc they know importance of clean energy &amp; conservation: https://t.co/ev1Cq6UsHh https://t.co/lBKGeEoPEZ"][".@SenateMajLdr, the American people deserve to know what we are voting for."]["#Healthcare options appear to be repeal &amp; replace or repeal &amp; run—both hurt Coloradans &amp; are completely unresponsive to health care needs."]["Today we are voting to consider a #healthcare bill w/o knowing what it will do or how it will affect CO. Your voices matter more than ever. https://t.co/klUGNyALo9"]["CBO Director is GOP appointee. Office provides data so Congress makes informed decisions. Must stop attacking institutions &amp; ignoring facts. https://t.co/9m3XMyhpl2"]["We’re grateful for his commitment to protect CO’s public lands &amp; look forward to having him back in CO so he can put these words into action"]["We're counting on Bernhardt to uphold his commitment to protect CO’s forward-leaning methane rules &amp; ensure we're not put at a disadvantage."]["The GOP plan would destabilize insurance markets and devastate Colorado families. We need a bipartisan solution to #ProtectOurCare. https://t.co/t77PYBaCJ6"]["CO is the epicenter for outdoor rec. We must ensure all communities have the access &amp; opportunity to enjoy our great public lands &amp; waters. https://t.co/sbMVt9do1t"]["Need bipartisan health care reform with more competition and transparency to lower costs and improve care. https://t.co/jeWNAHuAPW"]["CO unemployment is at a record low. Let’s keep working to boost incomes until all Coloradans can provide for themselves and their families. https://t.co/JbgzzpR36X"]["We will never forget those we lost in Aurora 5 years ago. Today, our thoughts are with the victims and their families. https://t.co/r9DPlcJ1IV"]["Yet another CBO score showing that millions would lose insurance under #Trumpcare. It's time for a bipartisan fix for our health care system https://t.co/fEPn5FxCLa"]["My prayers are with @SenJohnMcCain as he battles through this. This American hero is as tough as they come."]["GOP repeal &amp; run plan would devastate rural hospitals, which need more—not less—resources to serve our communities.\nhttps://t.co/BF4vRsgMLe"]["This is further proof that Republicans’ repeal and run tactics will not work. A bipartisan bill is the only way to #ProtectOurCare. https://t.co/l8jy0o6Hr3"][".@POTUS should stop spreading conspiracy theories and disband the Commission. #RespectMyVote #ShamVotingCommission https://t.co/WYZVZzyJXy"]["#DACA has opened doors and opportunities for over 17,000 DREAMers in CO, and by extension for all of their families. We must #defendDACA."]["Read more about why disbanding this Commission is critical to empowering all Americans to participate in our democracy #ShamVotingCommission https://t.co/uagfjNU5Uh"]["As WH Voter Commission holds first meeting this morning, here is my letter on harm it’s already done and need to terminate it immediately. https://t.co/EW1tdENRk2"]["WH Commission is having a very real &amp; chilling effect on voters. We will keep fighting for more access to &amp; participation in our democracy. https://t.co/9rq20Qtfoy"]["The biggest takeaway from today: It’s past time for a bipartisan approach to fix our health care system. https://t.co/g5Axv64Fub"]["On air urging @SenateGOP to turn to a bipartisan solution to fix our health care system. Tune in to @CBSDenver &amp; @9NEWS tonight. https://t.co/69Xp5sIhET"]["Instead we should address actual &amp; substantial threats to our democracy, including voter suppression &amp; Russian interference in our election."]["WH voter commission—the result of conspiracy theories &amp; \"fake news\"—is inciting fear &amp; driving people to unregister. https://t.co/4NXMMDok1Z"]["Americans are speaking up, telling stories &amp; demanding better solutions to fix our health care system. Don't stop now. Your voices matter."]["Our thoughts are with my friend @SenJohnMcCain and his family &amp; we wish him a speedy recovery. https://t.co/D748fxOTLI"]["Eating w/ the \"mother of American food\" @alicewaters. Thanks to @slowfoodhq for hosting &amp; helping advance healthy lunches in our communities https://t.co/X0qshH30Wr"]["Congrats Class 23! This milestone shouldn't be the end of your service, but the beginning. On behalf of CO, thank you for your service. https://t.co/UMvcRuAZL3"]["Trump admin's threats to repeal #DACA incite fear in communities across CO. We promise to do all we can to protect DREAMers and #SaveDACA. https://t.co/rtjrhYjfDu"]["Stand with @CleanAirMoms who know clean air means better health &amp; future for their kids. That’s why we do everything we can to #ActOnClimate https://t.co/Wrt4iIyXB7"]["We can respond to the Russian attack on our elections AND work to improve our economy. They are not mutually exclusive. We must do both. https://t.co/I4uao8SKtA"]["We need to send a strong signal to Putin that election interference will not be tolerated. The only person who disagrees is @POTUS. https://t.co/C6olFXmH5f"]["@LittleLobbyists He also advocated for the #ACEKidsAct to help kids with complex medical conditions on #Medicaid receive better coordinated &amp; quality care. https://t.co/ii4ynDS8oc"]["Met this #LittleLobbyist today who's battling complex medical conditions. That didn't stop him from dancing through the hall. #SaveMedicaid https://t.co/IHAUjhPMmf"]["@KIDSvCANCER We should be able to tell parents we're doing everything we can for kids w/ cancer. Look forward to #RACE4ChidrenAct coming before Senate."]["Foundation of this bill remains deeply flawed. We should scrap #Trumpcare &amp; start over w/ bipartisan process to reform health care system. https://t.co/euxEQ5rgXC"]["@NREL Will fight against @POTUS attempts to slash NREL funding &amp; commit to provide robust support for labs to help power US energy transformation."]["Happy 40th to @NREL—one of smartest investments federal gov has made to spur innovation and create jobs, all based in Colorado. #NREL40 https://t.co/lrYxOnSi4Z"]["The internet was built to be open and free. We should work together to protect #NetNeutrality"]["Great working w/ @senorrinhatch on bill to improve potentially lifesaving clinical trials. Look forward to considering User Fees in Senate. https://t.co/VhDIhsfShO"]["LIVE NOW: Speaking on the Senate floor about our need for bipartisan health care reform.  https://t.co/bsqptVbidv"]["CO is first Rocky Mountain state to join U.S. Climate Alliance. Will strengthen environment &amp; clean energy economy: https://t.co/gLEnWcF3Qp https://t.co/VvrpZZOaUp"]["#MonumentsForAll Press Conference LIVE NOW: https://t.co/VdV3UBQC0c"]["Press conference today at 12:30 to protect #MonumentsForAll. Check back for the live stream soon. https://t.co/1T98hVw3xN"]["Today is last chance to submit comments &amp; tell @SecretaryZinke why we must protect #MonumentsForAll. Add your voice: https://t.co/9JlLJfzwdM https://t.co/6TsRvuNMYY"]["Let’s scrap this ridiculous tax cut masquerading as a #healthcare bill &amp; work together on legislation to actually fix our health care system https://t.co/p9Co6svbat"]["Thank you to all of the Coloradans who came to today’s #healthcare rally to help #SaveMedicaid and #ProtectOurCare. https://t.co/DE6K9hT1t6"]["@OutdoorRetailer @GovofCO @SenCoryGardner Grateful to host industry's biggest show &amp; work with outdoor professionals to further strengthen CO's vision for recreation &amp; #publiclands."]["Today @OutdoorRetailer announced it will move shows to Denver. Great for CO economy &amp; natl outdoor rec industry. https://t.co/Gf6fy0fewL https://t.co/3SXI4tdEuf"]["The @OfficeGovEthics is more important than ever. Administration must immediately fill this vacancy with an independent, competent chief. https://t.co/hXM8YhGNhP"]["#Trumpcare would pull rug out from under critical access hospitals, like this one in Holyoke, CO, that help patients access lifesaving care. https://t.co/NRmeB8TcbX"]["@lynn_bartels Not suggesting @COsecofstate would send SSNs bc CO law makes them private. Highlighting how ridiculous commission's fishing expedition is."]["Instead of requesting voter info, @POTUS should encourage voter participation &amp; do more to hold Russia accountable for 2016 interference. https://t.co/OtXWhY52Kc"]["Look forward to welcoming Outdoor Retailer Show to Colorado. Our commitment to #publiclands &amp; outdoor economy make it the perfect location. https://t.co/iBqRA9ydyA"]["Great to see 25 Colorado businesses commit to meeting standards set by the #ParisAgreement and fighting climate change. https://t.co/lcdjM9vCWh"]["As #opioid addiction rips through Colorado &amp; the country like wildfire, #Trumpcare would only fan the flames: https://t.co/BUR6D6565c"]["Thank you, Kelly, for telling your story, emphasizing importance of Medicaid to Colorado families, &amp; emboldening opposition to #Trumpcare. https://t.co/e82DdU3sgL"]["On this #IndependenceDay, we celebrate our democracy and our institutions that make it possible."]["Wishing everyone in Colorado and across the country a happy #July4. Thank you to all who serve and protect our great nation."]["Sat down with @PodSaveAmerica to talk #Trumpcare. We can't let Congress get away with this. Americans deserve better https://t.co/uk3mW4iE7N https://t.co/nlFiiTtoZL"]["Congress needs to hear from you right now — the coming weeks may decide the fate of health care across America. https://t.co/WXBpRoGoNc"]["Instead of broken promises with #Trumpcare, we need to work with D’s, R’s, &amp; I’s across Colorado and country to improve health care. 2/2"]["Health care should not be matter of politics—should be matter of saving lives. This op-ed explains exactly that. 1/2 https://t.co/6Kn9ohWwpS"]["Thank you to brave firefighters managing Lightner Creek Fire. Our thoughts are with Durango community, esp those evacuated from their homes. https://t.co/PD305PDk9a"]["@POTUS In CO, we're leading the way with up to 7,000 wind jobs, 6,000 solar, &amp; 10,000 natural gas. Let's keep driving growth for all #cleanenergy."]["Renewable energy is critical for energy independence. @POTUS #EnergyDominance speech is smoke &amp; mirrors to distract from devastating DOE cut"][".@POTUS's promise to \"cover everyone\" at a \"fraction of the cost\" was an abject lie. #Trumpcare raises costs &amp; forces 22M to lose coverage. https://t.co/ahHaNw9VA4"]["#Trumpcare is attack on rural America. We should strengthen—not cut—Medicaid, esp since it funds ¼ of lifesaving opioid addiction treatment. https://t.co/pbPrVrVkI0"]["Every American should use this opportunity to make sure every Senator hears your voice &amp; knows where you stand on #Trumpcare. https://t.co/trH8uLQflO"]["Democrats and Republicans ought to come together to fix our broken health care system. Here are some things we can work on. https://t.co/WyVEFzTXDO"]["We need to start over and work together on a bipartisan plan to improve the ACA and fix our health care system. https://t.co/lgDXrYYKho"]["New report shows CO outdoor rec economy continues to grow, thanks to our #publiclands, community leaders, &amp; local businesses #ThriveOutside https://t.co/sWZ1TKlJbn"]["#Trumpcare fails to address a single thing Coloradans have asked us to fix. We need a new, bipartisan bill to reform our health care system. https://t.co/ijCBaCDsyS"][".@SenateMajLdr, we are \"interested in participating\" to reform our health care system. \n⚡️ https://t.co/QFMc3xykQt"]["Joined colleagues to show faces of constituents who would be harmed by #Trumpcare. We must fix health care for every person in these photos. https://t.co/4elKQ2i4mf"]["Continuing partisan process to secure more votes won't fix #Trumpcare. We should start over &amp; work together to improve health care system. https://t.co/MWxYKGXSw3"]["A partisan meeting will not result in bipartisan solutions to fix our health care system. It’s past time for us to work together. https://t.co/EmXuT8p49p"]["A delayed vote does not change the fact that #Trumpcare would strip millions of health coverage. This is about saving lives, not politics. https://t.co/tl7ADC2L9P"]["Under @SenateGOP #HealthcareBill, a 64-year-old making $56K would pay 5 TIMES more for health insurance. #BetterCare is worse. https://t.co/CoJO8EOThb"]["Joining constituents &amp; advocates today at 11:45 AM ET to discuss GOP #HealthcareBill w/ @SenatorTester. LIVESTREAM: https://t.co/a897Fes0IV https://t.co/wdkGHv0mRL"]["We can do so much better than this Republican #HealthcareBill. Now is the time to call and make your voices heard. https://t.co/DkUEkLwgBY"]["@SenateGOP This is not a #HealthcareBill. It’s a tax cut for wealthy, Medicaid cut for vulnerable &amp; an insult to ppl who need more care &amp; lower costs."]["Fundamental problem is that @SenateGOP didn’t set out to fix the health care system, they set out to repeal the ACA. #HealthcareBill"]["But GOP bill does nothing to address any problems Americans want us to fix. Coloradans are furious, and rightly so. #BetterCare is worse."]["It's shameful that people in our country have to lay awake at night wondering if their kid is going to receive #healthcare if they get sick."]["On the Senate floor tonight discussing the GOP #HeathcareBill. Tune in to hear why #BetterCare is worse. LIVE NOW: https://t.co/4UJn6IO38E"]["On #EqualityDay we’re reminded that GOP #HealthcareBill will affect all communities. As Sam says, quality care is essential to quality life. https://t.co/majNmD3r2l"]["@POTUS #SCOTUS order doesn't change fact that #TravelBan contradicts history of welcoming ppl of all religions &amp; doesn't bolster nat security 2/2"]["Today's #SCOTUS order recognizes that @POTUS's travel ban unjustifiably harms people with a bona fide connection to the United States 1/2"]["Marched with @One_Colorado Executive Director Daniel Ramos last week at Denver #Pride. Remembering this great celebration on #EqualityDay. https://t.co/yuAqaXrAFX"]["Committed to voting NO on #HealthcareBill that threatens coverage for thousands &amp; makes it more difficult for women to access quality care. https://t.co/Ugx9Myiuus"][".@csgazette Editorial Board is right: #BetterCare does nothing to lower prices &amp; increase access to health care. https://t.co/R9N0ik66hn"]["@SenateGOP Instead of rushing to pass GOP #HealthcareBill, we should work together on a bill that gives Coloradans the health care system they deserve"]["The @SenateGOP #BetterCare health care bill is worse than the House bill and could not be less responsive to Americans' health care needs. https://t.co/RE0lJtRdID"][".@POTUS promised more predictable/affordable health insurance. Senate #HealthcareBill falls far short &amp; is just as \"mean\" as House bill. https://t.co/DtjnG8GdDV"]["The Senate #HeatlhcareBill is a tax cut for the wealthiest Americans that will throw millions of people off of their health insurance. https://t.co/9os0AxEXGI"]["Experts are sounding alarms on GOP #HealthcareBill. We need more resources—not #Medicaid cuts—to combat the #opioid epidemic. https://t.co/V8MkIJFlW2"]["Would be a bipartisan win-win: Youth &amp; veterans gain job skills while restoring &amp; maintaining #publiclands https://t.co/pAbuuP4WuR"]["This trade-off makes no sense: We cannot cut critical domestic programs to fund @POTUS deportation force/border wall https://t.co/0202xOcIRw"]["Senate bill is just as bad as—if not worse than—House #HealthcareBill. Coloradans deserve full &amp; open debate to improve health care system. https://t.co/7qFbOqExef"]["Memorable night giving tour of the @uscapitol with @SenCoryGardner to Coloradans from all over the state in town for the Capitol Conference. https://t.co/5SikTqtvpW"]["It's time we work together on a health care bill and an agenda that are responsive to the American people's priorities. cc: @mitchellreports https://t.co/bjwWnplzMQ"][".@SenateGOP are so ashamed of health care bill, they won’t even share it with GOP colleagues—much less Dems or American ppl #ShowUsTheBill https://t.co/Og9I7NSh2W"]["On #WorldRefugeeDay, thinking of my recent trip to Jordan and the important stories of these courageous, resourceful men, women &amp; children. https://t.co/xJ2bG5HNru"]["Half the world’s refugees are children. This is heartbreaking. We're committed to fight admin’s attack on humanitarian aid. #WorldRefugeeDay https://t.co/zwJmm4NLLL"]["Even @POTUS said GOP health care bill is “mean.” CO would be one of the states harmed most. So why are Republicans still trying to pass it? https://t.co/I7lwf2ly9k"]["Met patients, advocates &amp; health officials with @GovofCO to discuss harm GOP health care bill would do &amp; find real solutions for Colorado. https://t.co/m7bMusIEJV"]["Nearly half of Coloradans on #Medicaid are children. @POTUS has one thing right: Republican health care bill that slashes Medicaid is \"mean\" https://t.co/0r58roBVmA"]["Congratulations to Colorado's #PresidentialScholars for receiving one of the highest honors for high school graduates in the country. https://t.co/m4RocktK9X"]["#PancreaticCancer advocates concerned about GOP's health care bill. #Preexistingconditions should not be a barrier to coverage #PurpleStride https://t.co/vxo2XT2F49"]["Standing with over 100 CO biz to protect #ArcticRefuge. It’s why we intro'd a bill to preserve the Coastal Plain. https://t.co/AAmFScV0Wr"]["In March, #wind &amp; #solar produced 24% of Colorado's energy. We're powering our economy &amp; protecting our environment. https://t.co/gr83sOb6K2"]["On #Juneteenth we recall the injustice of slavery, the stain it leaves on our nation &amp; the work we must keep doing to ensure justice for all"]["Only in this administration is it “wise\" or \"intellectually engaged” to ignore facts and deny climate reality. #ActOnClimate https://t.co/RxrsBrhG1h"][".@SenateGOP are so ashamed of health care bill, they won’t even share it with GOP colleagues—much less Dems or American ppl #NoHearingNoVote"]["Slashing #Medicaid is an outrageous step backward from providing addiction treatment &amp; combating the #opioidcrisis. https://t.co/WdBYxSBmTr"]["Our prayers are with the families of the seven @USNavy sailors of #USSFitzgerald. Their patriotism &amp; service will not be forgotten."]["Spent #FathersDay at Denver's #Pride2017 parade. No better lesson I could teach my daughters than the importance of equality &amp; love for all. https://t.co/6V1DLf1jCz"]["Shame on @BetsyDeVosED for abdicating core responsibility to protect &amp; secure the civil rights of all students. https://t.co/Cv0AIpgCL1"]["Important record for #cleanenergy &amp; future of US economy. Good to know CO is helping lead the way as #1 wind manufacturer in the country. https://t.co/jRQ0KbdMz7"]["Critical bill passed sends message to Russia &amp; ensures Admin can't roll back sanctions without Congressional review: https://t.co/GPRmC63lp6"]["Holding roundtable w/ @GovofCO, @LtGovofCO &amp; health care advocates to discuss how we can improve &amp; protect health care system in our state. https://t.co/75YiNHZnA0"]["⚡️ #VoicesOfCO: Health Care Stories\nhttps://t.co/HSVuw2JubD\nKeep sending us stories. They are why fixing our health care system matters."]["In past 5 yrs under DACA, over 780,000 #DREAMers—17,000 in Colorado—had a chance to work &amp; study without the fear of deportation #SaveDACA"]["We must never take for granted the heroism of @CapitolPolice, who risk their lives every day to protect our nation’s Capitol. https://t.co/ThNFAGRxXe"]["Still awaiting details, but my thoughts and prayers are with Steve Scalise, Capitol police officers, and all those who were injured."]["Republicans could not have designed a LESS responsive health care bill to what the American people need. #NoHearingNoVote https://t.co/CynHDXO0rz"]["You mean \"more generous\" than cutting Medicaid by 25%, risking coverage for 23M, &amp; allowing discrimination against pre-existing conditions? https://t.co/J7x4XMRFn3"]["@SenateMajLdr At the very least, we should meet standards set by @SenateMajLdr for ACA and hold hearings on @POTUS's health care bill."]["As @SenateMajLdr said in 2010, Americans tired of bills \"negotiated in secret...jammed thru on a party-line vote in the middle of the night\""]["23 mil people may lose health insurance bc of GOP health care bill. They deserve to know what’s in the bill. Their well-being is at stake."]["Watch LIVE now: Staking out with @SenateDems to discuss harmful GOP health care bill &amp; hypocrisy of no hearings: https://t.co/GDmx8h1kPu"]["If Capitol press are not allowed in hallways, you're welcome to set-up shop in our office. We'll make our conference room a free press zone. https://t.co/ecLI8Ow6XB"]["Today’s recommendation reflects Washington interests &amp; ignores input from tribes &amp; citizens across West. #BearsEars https://t.co/0S6FSLiVzM https://t.co/bRgAhWyLHo"]["Congratulations @GabbyGiffords. There is no one more deserving of this honor. Thank you for your courage &amp; patriotism. #USSGG https://t.co/XkiuiM4Um2"]["Today, we remember the 49 lives lost &amp; #HonorThemWithAction by supporting the Equality Act &amp; other protections of LGBTQ rights. https://t.co/0zwKJyjLhC"]["Disappointed to see @EPAScottPruitt stand on the sidelines. A footnote will not make up for our carbon footprint.  https://t.co/S5hRYc25sp"]["9th Circuit confirms that @POTUS’s travel ban violates the law &amp; our proud tradition of welcoming people regardless of nationality/religion."]["We must ensure laws provide best chance for kids with cancer to live full lives by passing #RACE4Kids. @marcorubio https://t.co/yi1fJeGuRS"]["Watch our #townhall in Frisco, CO LIVE NOW: https://t.co/ge5bl8f1fb"]["Make no mistake: A 25% cut to Medicaid cannot be done without harming Colorado's kids, disabled, and elderly. https://t.co/V3ThWTf9pc"]["Statement on #ComeyHearing: Testimony makes clear @POTUS is more concerned about his own self-interest than safeguarding our democracy. https://t.co/hrDHgQiHEK"]["@POTUS Instead of self-interested rants about election results, @POTUS should hold Russians accountable for interfering with our democracy."]["The legal case for obstruction of justice is critical. Let’s also remember need for @POTUS to restore trust in our institutions. #ComeyDay"]["The GOP health care bill would disproportionately harm older and sicker Americans. #VoteNoAHCA https://t.co/s3ZLwHVSeB"]["We must protect #publiclands so all future generations of Americans can experience our natural and cultural treasures. #DefendOurMonuments https://t.co/JavdJVgkjD"]["ANNOUNCEMENT: Holding 3 central mountain #townhalls this Friday in Frisco, Edwards, and Glenwood Springs. https://t.co/z86KoJzK5N"]["73 years ago, Allied soldiers landed on the Normandy beaches. On #DDay, we honor their sacrifice &amp; bravery in the fight to protect freedom."]["70 years ago, #MarshallPlan speech changed the course of U.S. diplomacy, laying foundation for transatlantic alliance &amp; economic stability."]["Taking time to celebrate #WorldEnvironmentDay — a reminder that we share one Earth, and we all have a role to play in protecting it. https://t.co/vdTsYseOBN"]["Celebrating #NationalDairyMonth at @noosayoghurt w/ co-founder &amp; 4th gen dairy farmer Rob Graves. Great CO company w/ even better yogurt. https://t.co/GJ02k6bUgj"]["Round table discussion at Fresca Foods in Louisville, CO focused on food entrepreneurship &amp; regional #FoodSystems. https://t.co/XTki4nQ4u5"]["In the freezer during #FoodSystems tour of @USDA_ARS seed preservation facility w/ former Agriculture Secretary Tom Vilsack. https://t.co/7PLQPhexe6"]["Great regional #FoodSystems tour this week. First stop was @USDA_ARS to learn about supporting resilient agriculture. https://t.co/3Mc6WcuDUK"]["We must tackle #opioid crisis, but #Medicaid cuts in GOP budget &amp; health care bill would make this harder than it already is. @KRDONC13 https://t.co/jPJNcD6nV9"]["Thank you to the health officials &amp; community centers who spoke w/ us about how we can work together as CO faces critical #opioid crisis. https://t.co/fVnyrw63Ir"]["Meeting w/ Jason Chippeaux at @Hea1thSolutions in Pueblo about treating the whole patient when we address #opioid addiction. https://t.co/NNobGoIqpw"][".@VP Climate change affects everyone regardless of party. Just ask @realdonaldtrump circa 2009, @Secy_State_US, 17 House R's &amp; George Shultz https://t.co/wK4ptju2gJ"]["Spent last 2 days w/ recovery center, law enforcement &amp; health officials learning how communities are working to improve CO's #opioid crisis https://t.co/drUSyjzCHP"]["@POTUS @EIAgov Fact: The #ParisAgreement would lead to a $19 trillion increase in the global economy. https://t.co/lIskGaAADS"]["@POTUS @EIAgov Trump Myth #3: Losses would be $3 trillion GDP &amp; 6.5 million industrial jobs &amp; households would have $7,000 less income, in some cases more."]["@POTUS @EIAgov Fact: The United States can use clean coal technology to meet its #ParisAgreement target. https://t.co/A87Gs8tcV5"]["@POTUS @EIAgov Trump Myth #2: “The current agreement effectively blocks the development of clean coal in America, which it does.” - @POTUS"]["@POTUS Fact: Low natural gas prices are threatening the coal industry, not the #ParisAgreement. @EIAgov https://t.co/hozOHbrxOe"]["@POTUS Trump Myth #1: #ParisAgreement would effectively decapitate our coal industry, which now supplies about one-third of our electric power."][".@POTUS used many myths today to justify his withdrawal from the #ParisAgreement. Here are 3 we can debunk right off the bat."][".@POTUS made catastrophic mistake by putting a misguided campaign promise before needs of our economy &amp; credibility of American diplomacy. https://t.co/bhkQPt6cai"]["Great showing tonight in Otero County for a La Junta #townhall. https://t.co/9lzZ8j27hA"]["@SenMarkey @USFWSRefuges .@SecretaryZinke signed order to boost oil development in AK. Our bill would protect the Refuge from these attacks. https://t.co/qB0iD48pAJ"]["Today's VFW stop in Hugo, CO turned into a great discussion with questions ranging from education to trade to health care. https://t.co/0qEzWI0X2q"]["Withdrawing from #ParisAgreement would represent abdication of American values &amp; another example of Trump's 'Putting America Last' agenda. https://t.co/UPMlWLr8xT"]["Holding a #townhall in La Junta tomorrow at 6pm MT. Look forward to hearing from Coloradans on the Eastern Plains. https://t.co/7TMnms5MDt"]["Remembering all those who sacrificed for our country. We are forever in their debt &amp; grateful to them &amp; their loved ones. #MemorialDay"]["Our thoughts are with all those affected by the Anadarko oil tank explosion. https://t.co/XDBwsSWAyB"]["Important to see some leaders in @POTUS admin recognize what CO knows: clean energy is future of our economy. https://t.co/O1VfZ4bOmN"]["It's like the Grinch himself wrote this budget. #TrumpBudget https://t.co/99YqWMsNwA"]["Speaking LIVE NOW on the Senate floor about @POTUS's budget proposal. Watch here: https://t.co/dgkhkNqNbU"]["Why won’t Trump Admin state they won’t accept a tax reform bill that violates the \"Mnuchin Rule?\" @stevenmnuchin1 refuses to answer. https://t.co/jN8hU08rlW"]["Bill would name 2 San Juan Mtn peaks for world-class CO climbers to serve as reminder of their extraordinary lives. https://t.co/UMEr9Z5xqR"]["While @stevenmnuchin1 claims \"children will be taken care of,\" @POTUS budget says otherwise. Slashing Medicaid like this makes no sense. https://t.co/x2ncAbsDRe"]["We must stay in #ParisAgreement for American jobs/innovation &amp; to protect health &amp; security of the next generation. https://t.co/jRb3ZEl5oh"]["Unfortunate my colleagues don't see leaving #ParisAgreement is wrong move as rest of world grows more competitive in clean energy economy. https://t.co/cWPLtvm4zN"]["Today’s #CBOSCORE confirms what we knew: The Republican health care bill is yet another broken promise to the American people. https://t.co/wCFY7oLIxe"]["Budgets reflect values &amp; priorities. What message does a $9 billion cut to education send? #Questions4Betsy"]["Leaving the #ParisAgreement will harm our kids’ health, national security, &amp; clean energy economy. We cannot let @POTUS walk away."][".@Pontifex knows human-caused climate change is real. Encourage @POTUS to read Pope’s encyclical, stay in #ParisAgreement, &amp; #ActOnClimate. https://t.co/Y6ItmiFY4E"]["Over the past several months, I've not heard a single Coloradan ask for cuts to health care, education, or clean energy. #TrumpBudget https://t.co/c99q5VXoVz"]["Statement on the incident in Manchester: https://t.co/NFKLmZVLu9"]["Andrea asked the last Q at Fort Collins #townhall on immigration &amp; discrimination her family has faced. Read more: https://t.co/SRJ3muRl9j https://t.co/izwO8qxtOG"]["Arturo has worked in CO for years &amp; should not have been a priority target for deportation. We must fix our broken immigration system."]["Met with Arturo Hernandez &amp; family in Fort Collins after he received stay of deportation &amp; was able to attend his daughter's HS graduation. https://t.co/WNf3WarMXV"]["Had a fun time last night with my family at #RedRocksCO. No better place to celebrate our state's public lands &amp; natural beauty. https://t.co/UOvlrBnouN"]["Backstage with @ElephantRevival &amp; @ConservationCO last night at #RedRocksCO celebrating our iconic public lands. https://t.co/Pm8dnl4ZRa"]["Watch interview w/ @CBS4Shaun tonight at 10pm MT to hear about our recent work helping kids with cancer, public lands, and immigration. https://t.co/6I4Oj1hFsV"]["On first-ever #copubliclandsday we're celebrating our iconic landscapes &amp; all the Coloradans who built this great tradition of conservation. https://t.co/MCixha1Nxw"]["Full house in Denver tonight for our #townhall. WATCH LIVE: https://t.co/d7Bma1Y2zc https://t.co/QByNVZURCK"]["LIVE NOW at our third &amp; final #townhall today in Denver. Watch here: https://t.co/2p6FQxyFdQ https://t.co/DrB7Qy7KQF"]["WATCH LIVE NOW: Holding a #townhall in Boulder → https://t.co/0hQm3LSKzk https://t.co/ZG0PUyDAhF"]["Great turn out at Fort Collins #townhall. Watch LIVE NOW: https://t.co/Mf7Bi2U7Eh https://t.co/OrGoqjIxBA"][".@BetsyDeVosED: Vouchers are not the answer to a quality education for all kids. We need a serious budget that invests in our future. https://t.co/jis5POHIVP"]["Heading out to 1st of 3 town halls. Hope you can join: Fort Collins 11:30am, Boulder 2:30pm, Denver 5:15pm\n\nDetails: https://t.co/7w53ugqlHZ"]["CHRONIC Care Act unanimously passed in Finance Committee today &amp; includes our bill to expand Independence at Home → https://t.co/2cwP2h37rZ"]["Intro'd bill to ban members of Congress from becoming lobbyists. It's time we close the revolving door in Washington→https://t.co/rXzgOKEynj"]["Robert Mueller's appointment as #SpecialCounsel is critical first step, but independent commission &amp; Congressional oversight is still needed https://t.co/H22pfo3KoM"]["ANNOUNCEMENT: Holding Town Hall in Denver on Friday 5/19. Find out more details here → https://t.co/IskVtuuEH7"]["ANNOUNCEMENT: Holding Town Hall in Boulder on Friday 5/19. Find out more details here → https://t.co/eYsBmwvrcm"]["I'm fighting for kids like Evelyn who depend on Medicaid to receive life-saving treatment. #VoteNoAHCA #VoicesOfCO https://t.co/XXHPzlhDnT"]["To other congressional leaders, this is what basic oversight looks like. At a minimum, we should have access to “tapes,” transcripts &amp; memos https://t.co/07jCafoF23"]["Congress needs more information, including access to memos from Comey &amp; any tapes / transcripts from @WhiteHouse. Comey also should testify. https://t.co/2ix6cLwGYe"]["Families should never feel like a “pile of pre-existing conditions.\" The AHCA is an affront to families like Sarah’s #VoteNoAHCA #VoicesOfCO https://t.co/OgPzuVat6E"]["Health care has the power to prolong time people have with their loved ones. Coloradans like Peggy know we can’t take that away. #VoicesOfCO https://t.co/btAnBvw1aZ"]["Being “high-risk” should not determine whether you can obtain health care. Kids like Gracie depend on ACA &amp; Medicaid. #VoicesOfCO https://t.co/jRXDgkyRcz"]["Spoke to @USCRossier graduating class about the urgency of transforming how we educate all of America's children: https://t.co/3bPdJ5Rji5 https://t.co/RRlL7Eg5K2"]["If the @washingtonpost report is true, the President should explain why he divulged classified information to the Putin regime. https://t.co/ixvURHKKyk"]["Health care costs shouldn’t prevent people from starting a business. Let’s protect parts of ACA that work &amp; fix parts that don’t #VoicesOfCO https://t.co/4qsnk1k5vD"]["Max has overcome many challenges. Being denied health care due to a pre-existing condition should not have to be one of them. #VoicesOfCO https://t.co/SNMTvGyVPf"]["Adam shouldn't have to worry that his medical treatment could bankrupt his family. We must fix, not repeal, the ACA. #VoteNOAHCA #VoicesOfCO https://t.co/OTcsK6bi6I"]["Thousands of Coloradans sent us stories after @housegop voted to repeal ACA. Keep sharing your stories #VoicesOfCO → https://t.co/19KoIaAJpl https://t.co/esUup7TePO"]["Thanks to these CO moms for standing up for our climate on #MothersDay. I’m standing with you &amp; committing to #ActOnClimate. https://t.co/K5pIHqcVhl"]["Wishing a #HappyMothersDay to my wife Susan—mother of our three wonderful daughters. Grateful you are in my life today &amp; every day. https://t.co/lVlg3BdSc6"]["Looking forward to delivering commencement address @USCRossier to our country's future educators. Watch LIVE now: https://t.co/lzxEltpmFC"]["We must continue fighting to keep families like Jeanette &amp; Arturo's together."]["They've lived in Colorado for years &amp; contributed to economy. Their stories are another example of Admin's misguided immigration policies."]["Elections are at heart of our democracy. Administration should focus on supporting &amp; encouraging policies to improve—not suppress—voting. https://t.co/BcgnKXu7nA"]["Just wowing climber @tommycaldwell1 w/ stories of my own summer camp climbing glory days...\n\nThank you for your advocacy on public lands. https://t.co/iXZq3Mwh6u"][".@uscensusbureau must have strong leadership &amp; resources to conduct census w/ precision &amp; be inclusive of all. → https://t.co/yEvC2ahUVR"]["WATCH LIVE NOW Speaking on Senate floor about FBI Director Comey's firing &amp; need for independent special prosecutor: https://t.co/BmfvV2UA6y"]["Thank you Noyes Elementary &amp; @DCPSChancellor for letting me tag along this morning &amp; learn more about your school. https://t.co/KguyPAJMOr"]["LIVE NOW: Speaking on the Senate floor about today's victory protecting the BLM #methane rule → https://t.co/oCrg90dGAW"]["Honored that I could cast the 51st vote instead of the @VP. Next time call ahead...could have saved you the trip. #winning https://t.co/7VjvIzk7Ml"]["Just cast the deciding vote to block BLM methane CRA &amp; continue protecting Colorado communities from harmful methane emissions. #cutmethane https://t.co/sLMoTBrEb8"][".@POTUS .@DAGRosenstein must appoint an independent special prosecutor immediately. The integrity of our institutions is at stake."][".@POTUS The Senate must stand firm: We will only confirm an FBI Director who pledges a vigorous investigation of Russian interference &amp; connections."][".@POTUS It’s unbelievable that @POTUS woke up one morning &amp; fired Comey for actions from 10 months ago. The American people need a clear explanation"]["It's clear @POTUS cannot withstand the scrutiny. #ComeyFiring is extremely unsettling and the explanation is not believable."]["Amid the #BreakingNews, the Senate is now voting on the important BLM #cutmethane CRA. Here's why I'm voting no: https://t.co/qy0Agr2PQb"]["Comey's firing raises many questions. One thing is clear: an independent special prosecutor is necessary to investigate Russian connections."]["Thank you to all of the Colorado teachers for working hard each day to provide our children with a better future. #NationalTeachersDay"]["Kids with cancer—like Evie's sister Sadie—deserve life-saving drugs. That's what the bill we wrote with @SenRubioPress will do: https://t.co/1pGRZJE76i"][".@SenCoryGardner &amp; I have tried to ignore DC's dysfunction for the good of our state. Coloradans expect no less. https://t.co/mBRzdXrX6T"]["More evidence for why we must protect our natl monuments: @DinosaurNPS generated $20M+ in economic benefits in 2016 https://t.co/Iwp7uHUyMX"]["Dinner at Maria Empanada w/ owner Lorena, Colorado's #SmallBusiness Person of the Year. Celebrating #SmallBusinessWeek w/ great local food. https://t.co/Ez6EOxLhlR"]["Supporting innovative strategies to increase college completion for low-income &amp; first gen students w/@senorrinhatch https://t.co/42ZGt257BR"]["Helping @AmeriCorps public servants afford college w/ tax relief for Segal Education Award. @SenatorIsakson → https://t.co/XRJapKEeO8"]["Keep sharing your stories &amp; tell us why we need to fight to fix, not repeal, the Affordable Care Act. #VoicesOfCO https://t.co/h02tQIDlxo"]["Kelley, thank you for sharing your story. We are fighting for Coloradans like you &amp; will do everything to block this bill. #VoteNoAHCA https://t.co/qEtRFyxCi3"]["My statement on House passage of GOP health care bill. #VoteNoACHA https://t.co/wFo0ldL5t7"]["It's not clear what we've won since @POTUS's inauguration. But it's clear what we lost. The next #100Days must be better than the last. https://t.co/OfcG1UnOec"]["The bill in the House is not a real health care fix. It's a tax cut for the wealthy that would throw 24 million people off health insurance. https://t.co/NLfWCYKsVR"]["Great meeting Will! You have a bright future ahead. Thanks for visiting us in Washington. https://t.co/0tthHF9or1"]["The vote is at 5 PM. We can’t let Congress make it harder for Americans to save. Spread the word. #SaveRetirement https://t.co/DHR9kyQfhi"][".@POTUS should focus on what Americans need instead of attacking free press &amp; blaming “fake news” to obscure reality #WorldPressFreedomDay"]["Celebrating #CharterSchoolsWeek w/resolution recognizing students, teachers, leaders who make these schools possible https://t.co/HVo68BJI7t"]["Today, the Senate may vote to make it harder to save for retirement. We can’t let that happen. Share this video &amp; spread the word. #AutoIRA https://t.co/yfEgP1usAB"]["In @DailySentinelGJ op-ed this weekend, shared my thoughts on expanding opportunity in rural Colorado. → https://t.co/5oaLjubELQ https://t.co/RaZXRSB7QH"]["Spoke w/ celebrity chef @tomcolicchio last week about the Farm Bill, school lunches, &amp; ending hunger in our country: https://t.co/FJuZGRZ225 https://t.co/2rpJtXsuuC"]["During 2013 shutdown in CO, 53,000 workers sent home w/o pay. 30 labs closed. $24 billion lost. There’s no such thing as a “good shutdown.” https://t.co/L0Cl2BVTbV"]["Worked w/@SenAlexander to secure year-round Pell Grants. Excited it's included in budget deal &amp; will help 1 million students afford college."]["Now more than ever, we must stand together to defend immigrants, refugees, and workers’ rights. #MayDay2017"]["We #RiseUp for immigrants like Jeanette Vizguerra &amp; Arturo Hernandez to recognize their contributions to our communities. #ImmigrantRights"]["Bipartisan deal has significant investments for CO priorities in education, infrastructure, &amp; science: https://t.co/reI83Gj6Gn #CleanBudget"]["We need to fight climate change because this is the only planet our kids will ever have. #ClimateMarch #ActOnClimate https://t.co/PzmEP6EWwy"]["We can't afford to waste the next #100Days. What do you think Washington should be focusing on? https://t.co/13mC06YmwA"]["#100days in, I completely agree with what @realDonaldTrump said: https://t.co/7csdgKVYch"]["@SenMikeLee Thanks for your comments @SenMikeLee. We'll add them to our letter encouraging the Outdoor Retailer Show (&amp; its $45M) to move from UT to CO. https://t.co/mypAFUiih4"]["This was the best part of my day. #takeyourchildtoworkday https://t.co/7XQciczND4"]["Unlike the Administration, Western communities did our homework. We laid groundwork &amp; paved the way for these designations. #KeepItPublic https://t.co/stzfbPGv9l"]["I will use every tool at my disposal to protect the #AntiquitiesAct. Our character as a nation is revealed in what we choose to preserve."]["Spoke on the Senate floor today about why we must protect national monuments: https://t.co/EuT73vpo90"]["LIVE NOW: speaking about the #AntiquitiesAct on the Senate floor https://t.co/FRCOaCyBVO"]["Joined 30 other @SenateDems to send this letter to @POTUS and stand up for our national monuments: https://t.co/feyKhnyMIZ #MonumentsForAll https://t.co/kZyVQUBb7b"]["This tax \"plan\" looks too much like an unfinished homework assignment. This single page is what took over 100 experts months to write? https://t.co/Bi4TOO9OkO"]["President's tax plan is not a serious proposal. These old, bad ideas won't help working families. → https://t.co/3opjvZC6R7"][".@POTUS just signed EO that threatens #AntiquitiesAct &amp; our national monuments. Read my full response → https://t.co/TItSBNKnbp"]["We must stand together to protect #BearsEars &amp; all national monuments threatened by @POTUS EO. #MonumentsForAll #KeepItPublic"]["Public lands should remain in public hands. Let’s stand up against @POTUS EO &amp; defend the #AntiquitiesAct. #MonumentsForAll #KeepItPublic"][".@POTUS Yet another example of DC thinking it knows best for Western communities. CO treasures public lands, which help drive strong outdoor economy"][".@POTUS EO could diminish up to 40 national monuments. I will oppose any effort to dismantle the #AntiquitiesAct."]["Brought a bit of Colorado into my Washington office. Thanks to Coloradan photographer Jack Brauer for the great print. https://t.co/6QXeYehd8q"]["All kids deserve teachers as dedicated as @CraftingHeroes, CO's Teacher of the Year. Thanks for your hard work shaping the next generation. https://t.co/Sh5DEDMTTM"]["Learn more about Thompson Divide bill. Worked w/ counties &amp; local energy leaders to protect area &amp; comp leaseholders https://t.co/g5qTfy9Clx https://t.co/yHSasZHPbi"]["Good luck to East HS in the We the People Competition finals in D.C. Your impressive knowledge of the Constitution makes Colorado proud. https://t.co/TgpuW6ZE6G"]["On #YomHashoah, we honor the memory of the 6 million Jews who perished. We remember to ensure it never happens again."]["Today, we remember one of mankind's darkest periods, learn from history, &amp; treasure our common humanity. #HolocaustRememberanceDay"]["Letter to students: Immigrant story is our American story. Those who say otherwise missed history lesson on what makes America great. https://t.co/m4TaPkDb3M"]["CO natl parks contributed record $722m to our economy last year. They are essential to thriving communities. #NationalParkWeek #FixOurParks https://t.co/1sgQ4N08gR"]["Be involved in this public discourse: You can reject corrosive politics &amp; advocate for policies to protect environment &amp; our kids #EarthDay"]["We teach our kids to draw conclusions based on evidence &amp; facts. On #climatechange, Washington should go back to school. #EarthDay"]["When @DeptofDefense recognizes that #climatechange affects natl security, we should listen. Then we should act. #ActOnClimate #EarthDay"]["End the spin. Stop the squabbling. Save our planet. #Climatechange is the moral test of our generation, and we must not fail. #EarthDay"]["When did our planet's health become a partisan issue? We need bold, bipartisan action to prevent #climatechange. #ParisAgreement #EarthDay"]["97% of research says #climatechange is real &amp; humans responsible. I'm tired of politicians pretending this is a debate. #EarthDay"]["Mar-a-Lago’s golf course could be damaged by sea-level rise if we don’t #ActOnClimate now @realDonaldTrump @POTUS. https://t.co/EsdWFtrb7X"]["Tell @POTUS we must not cut budget funding for fundamental science labs. @NOAA @NREL @EPA @AtmosNews &amp; more #MarchForScience #EarthDay"]["We must fund the development of climate science that helps protect our Western environment and economy. #MarchForScience #EarthDay"]["We must not let alternative facts drive policy. #MarchForScience #EarthDay"]["Standing behind the many people in over 600 marches today fighting for science around the world. #MarchForScience #EarthDay"]["CO native Florence Sabin was pioneer in science &amp; public health. 1st woman to graduate from &amp; teach at Johns Hopkins Med School #WomeninSTEM https://t.co/y4gZcR35BB"]["In ‘98, two grad students working with an @NSF grant wrote an algorithm to rank an NSF-funded index of the internet. They called it Google."]["A strong scientific community is essential for the foundation of a strong democracy. #MarchForScience #EarthDay"]["By 2030 there won't be any glaciers in @GlacierNPS. We must #ActOnClimate to save our national treasures. #EarthDay"]["It’s very hard to enjoy Colorado’s world-class skiing if there isn’t any snow. #ActOnClimate #EarthDay"]["Climate change costs jobs. Shorter winters already threaten Colorado's $4.8B ski &amp; snowboard industry and its 46,000 workers. #EarthDay"]["Climate change means more displacement, disease, &amp; natural disasters. Rejecting the science is not just ignorant. It is dangerous. #EarthDay"]["2016=hottest year on record. 16 of 17 last years=warmest ever recorded. There is no debate. Climate change is real. #ClimateChange #EarthDay"]["On #EarthDay, standing with those who #getoutside &amp; enjoy National Parks - admission is free all weekend. #FindYourPark #NationalParkWeek"]["We benefit from leadership of Teddy Roosevelt &amp; decisions made &gt; 100 yrs ago. It's our turn to protect #PublicLands. #KeepItPublic #EarthDay"]["Our nation's character is revealed by what we choose to preserve. #PublicLands #KeepItPublic #Conservation #EarthDay"]["\"It is not what we have that will make us a great nation; it is the way in which we use it.\" - Teddy Roosevelt #Conservation #EarthDay"]["Happy Earth Day. I am committed to protecting the only planet we have. #ActOnClimate #MarchForScience #EarthDay"]["Funds passed in 21st Century Cures will be used to fight opioid epidemic, including nearly $8 million for Colorado: https://t.co/lvV8ou5Q5W"]["Yesterday sent 3rd letter to WH on @POTUS foreign conflicts. Asked for details on donating foreign gov profits: https://t.co/u3zI5kRpGe"]["Visited @DeltaCountyCO hospital &amp; saw value it brings to community. Bill would help rural hospitals like this one: https://t.co/VjtU5BD1n6 https://t.co/2s1K6qlTbe"]["Read my open letter to CO students in response to recent hate &amp; fear that has made its way into our classrooms: https://t.co/bNzlb8bRDE @mic"]["Congrats to Jeanette on her #TIME100 honor. Her determination to keep family together underscores need for comprehensive immigration reform. https://t.co/S2ofKYgfyB"]["A few years have passed since this photo, but still have fond memories from our time exploring CO's Great Sand Dunes. #NationalParkWeek https://t.co/PA2V0FuRAx"]["Day 2 of #NationalParkWeek: Kayaking at Dinosaur Natl Monument w/ my daughter. Some of my favorite family memories are spent in CO outdoors. https://t.co/Iaefrkp1Av"]["Happy #NationalParkWeek. Check out views from CO Natl Monument. This week we plan to recognize the value of preserving our public lands. https://t.co/79Kh3bembZ"][".@NOAA Visited CO national labs yesterday. Will defend funding for critical programs to support clean energy. https://t.co/LdKOcxIrzd @AtmosNews"]["Thank you @NOAA for the important discussion on clean energy. Colorado is committed to continue leading the way to combat climate change. https://t.co/0aCxNPwLTC"]["Thanks to Clinica Family Health in Boulder for giving us a tour yesterday &amp; serving patients in our community. https://t.co/jvTB9M5Kqb"]["2 months ago, sent a letter to @WhiteHouse asking if it will make Visitors Log public. Now we know...apparently not. https://t.co/WyLH86vBwP https://t.co/EEU81ANzn2"][".@EPAScottPruitt is wrong. U.S. should stay in Paris agreement &amp; help lead global fight against climate change. https://t.co/S3qaQQX1wo"]["Sent a letter with 8 other western senators calling on @POTUS to protect national monuments, like the CO National Monument I visited today. https://t.co/DWR6LdozV5"]["Beautiful views at CO National Monument today. Thanks CO Natl Mon. Superintendent, CO Canyons Association &amp; @VisitGJ for showing us around. https://t.co/cxETiVhgnb"]["Thanks @barnmedia for having me on the show to talk about importance of including Colorado farmers &amp; ranchers' input in the next Farm Bill. https://t.co/FU6NMIU4sY"]["Concerned foreign companies/govs may use @POTUS' biz connections to influence foreign policy &amp; nat sec decisions. https://t.co/B7nFZSHwXY"]["The more time people spend walking in each other's shoes, the more positive our relationships will be. https://t.co/i1KG5l3tUc @coloradoan"]["Thanks to @ColoradoStateU for showing us low-cost methane capture technologies. We all need to do our part to #ActOnClimate https://t.co/uoBV2Dq6oI"]["Congrats to the @DU_Hockey Pioneers for bringing home the trophy this weekend! https://t.co/N66LXVTbut"]["My statement on U.S. strikes on a Syrian airfield: https://t.co/uB2TJRPeBF"]["Spoke with @chucktodd today about why I tried to stop Senate Republicans from changing the rules on Supreme Court nominees. #NuclearOption https://t.co/zFIoWYahA1"]["Just spoke with @NPR about @SenateGOP invoking #NuclearOption to change the rules on SCOTUS nominees. Tune in to @npratc now to listen. https://t.co/sCMRefER8W"]["After today's events in the U.S. Senate, Thucydides is on my mind: https://t.co/SNbYVmEWRZ"][".@SenateGOP changed the rules. This nominee must be considered in that context. I voted no on cloture and will vote no on the nomination. https://t.co/Y5slwPxEEc"]["I'm concerned about Judge Gorsuch's narrow judicial philosophy. But if we lose the filibuster, we risk more extreme judges in the future. https://t.co/3SMKTBfWVH"]["LIVE NOW: Speaking on the Senate Floor about Judge Gorsuch's Nomination https://t.co/jLsi20EyCV"]["Sorry for the twitter malfunction. Hope the upcoming speech goes better than this. https://t.co/hf7BjSJG2Z https://t.co/z1IbKsgYRJ"]["Deeply disturbed by chemical weapons attack in #Syria. Those responsible must be held accountable. https://t.co/CRYWEfVFrH"]["Intro'd bill w/@senrobportman making it more cost effective for businesses to reduce carbon pollution: https://t.co/JHZPeaw6Ti #ActOnClimate"]["Shutdown is looming at end of month. Introduced bill w/ @SenCoryGardner to try to avoid or quickly end gov shutdown: https://t.co/54CpGxuQqm"]["Cosponsored Paycheck Fairness Act to help close pay gap b/n women &amp; men working the same jobs. https://t.co/2PJDQeaOMQ #EqualPayDay"]["Everyone, regardless of gender, deserves equal pay for equal work. It is unconscionable that this pay gap still exists. #EqualPayDay"]["Asked @POTUS to file financial disclosure this year for more transparency &amp; to follow actions of previous Presidents https://t.co/oN8NArgtQJ"]["Led 40 senators w/ @SenMarkey to provide permanent protection for Alaska's iconic Arctic Refuge:\nhttps://t.co/JKuLzgEP6E @USFWSRefuges"]["I agree with many of the concerns voiced about Judge Gorsuch. But here's why we should avoid the nuclear option: https://t.co/rLjfsfr2AT"]["Why is Congress making it harder for Americans to save for retirement? https://t.co/jTbH5quAo9 @coloradoan"]["This #CesarChavezDay let's honor his legacy by continuing his fight to end discrimination &amp; ensure social/economic justice for future gens."]["CO is also committed to meet its target under Clean Power Plan. Even w/o Washington leadership, world will keep moving toward clean energy. https://t.co/Cz5ENZTev9"][".@POTUS may pride himself on spotting good deals, but he’s missing the deal of the century: clean energy. https://t.co/FxxwjrpG9c @usatoday"]["Intro'd 2 bipartisan bills w/ @senorrinhatch to improve career &amp; technical education w/ innovation &amp; dual enrollment https://t.co/nxIsWMCbqj"]["You know this isn’t supported by consensus of Americans when @VP had to drive over from the White House to cast a tie-breaking vote. #TitleX https://t.co/WjCwmrjHvD"][".@VP @PPFA I urge my colleagues to vote against this measure. It will hurt many fellow Americans -- women &amp; working people. It should not pass. #TitleX"]