["It’s not enough to just respond with anger. We have to build a political movement in this country which says that that is not who we are and we will not tolerate that type of moral inadequacy."]["All over this country are decent people who tell their kids, don’t judge people based on the color of their skin or the country they came from. Judge them on whether or not they are good human beings.\n\nWe have a president telling the world that's not what he does."]["My dad came from what I guess Trump would call a \"shithole\" country. He was able to come to the U.S. and became a very proud American. https://t.co/FXbTu8i1HJ"]["Let’s be absolutely clear about what Republicans are doing by adding work requirements to Medicaid: they are attacking the poor. https://t.co/3nLO3GyTQ1"]["Astoundingly, we have climate change policies being written by the world's biggest polluters. As @KateAronoff says, it is not enough to ask whether or not people believe in global warming, but what they can do to save this planet for future generations. https://t.co/o3PJSH5Smy"]["Have you lived abroad and seen firsthand what universal health care looks like? Apply to be a panelist at the Medicare for All Town Hall in Washington on Jan. 23. \nhttps://t.co/3QbpZgTkg0"]["Please take a moment to read the replies here. Every other major country has made health care a right. The U.S. is the anomaly. Remember that. https://t.co/sGRAcCftot"]["Do you live in a country with universal health care? What does that mean for you and your family? #MedicareForAll"]["On January 23 we're going to try to do something that's never been done before. I hope you'll join us. https://t.co/RRvAMctGEz"]["The fight for net neutrality is not over. We can overturn the FCC's disastrous decision but we need your help. https://t.co/jcCqHwrF82"]["The construction of a wall to keep unwelcome visitors out makes a lot of sense — if you were living under the Ming Dynasty in China in the 15th century when the Great Wall of China was expanded. https://t.co/g98AwWbeNo"]["What kind of a country are we if we deny health care to millions of children? https://t.co/pAP1Mp4FI1"]["We must not hold the lives of 800,000 young Dreamers hostage in order to fund a wall that the overwhelming majority of Americans oppose. Sadly, it appears that is exactly what Donald Trump wants. https://t.co/hFpQ1pZByM"]["This is one of the great moral issues of our time. It cannot be kicked down the road any longer. We must pass the DREAM Act now.\nhttps://t.co/ot8Qj4LFE5 https://t.co/n5HghTK1i3"]["We don't need to spend $18 billion on a wall which, by the way, Trump said would be paid for by the Mexican government. https://t.co/j26z44BwZL"]["Last night, President Trump received a standing ovation from a group of farmers after he told them they would no longer have to pay the estate tax. He forgot to mention that less than 0.1 percent of estate taxes are paid by small farmers. https://t.co/hr5jIOh9PX"]["Kate and her family would not have been able to grow their organic farm without the help of the Children's Health Insurance Program. If Congress does not get its act together, 9 million children in working families will lose their health insurance. https://t.co/EtN6NhPIZ0"]["Maybe Trump and Republican leaders believe a government shutdown would be a welcome distraction from the ongoing Russia investigation. But a shutdown would harm working-class families who would be unable to access vital services."]["Does single-payer health care mean “government-run” health care? Canadian @docdanielle breaks it down: https://t.co/v0ZAxIcRUp"]["The American people are increasingly disgusted with a government that protects the interests of the wealthy and the powerful. We must pass a budget agreement that addresses the needs of Americans and not just billionaire campaign contributors.\nhttps://t.co/hPs4uG6x9b"]["I don't know why President Trump and Republicans want to shut down the government over a wall no one wants and an unprecedented $100 billion increase in military spending. What the American people want is to protect Dreamers and working families. https://t.co/cZ41tOWbvS"]["Today marks 100 days since Congress let the Children’s Health Insurance Program expire. \n\nLet me say that again: health care for 9 million children has hung in the balance for 100 days. \n\nWe must do better than this."]["Because the president revoked DACA, some 800,000 young people are living in extraordinary anxiety about whether or not they're going to lose legal status and be subject to deportation. We have got to deal with that decision."]["We need to get our priorities right. Not giving tax breaks to billionaires. Not throwing millions of people off of health insurance. We have got to pay attention to the working families of the this country."]["The Republicans control the White House, they control the Senate, they control the House. They will determine whether or not there is a government shutdown. I certainly hope there is not a government shutdown."]["The American people do not want to spend billions of dollars on a wall which Trump told us would be paid for by Mexico. They want to protect Dreamers and working families. https://t.co/WdiBK2scH1"]["It's not just Democrats and Independents. More Republicans support allowing Dreamers to stay in the country than support building a wall. It couldn't be clearer what Congress needs to do."]["Instead of Attorney General Sessions intensifying the failed war on drugs, states should be allowed to make their own decisions regarding the legalization or decriminalization of marijuana. https://t.co/EpXfq5HxAT"]["I'm not sure why President Trump wants to shut down the government over an $18 billion wall that no one wants, isn't needed and Mexico won't pay for. What the American people want, overwhelmingly, is to provide legal protection and a path toward citizenship for 800,000 Dreamers."]["This is a health crisis that no one is talking about it. If Congress does not act soon to fund the Community Health Center program, 2,800 health centers will close their doors. https://t.co/ERvaOMqaWg"]["When history looks back on this period, I do not want people to see a U.S. Congress which worked overtime to protect billionaires and large corporations but turned its back on providing health care to vulnerable children. https://t.co/GVuAj1w7Yp"]["Mr. Trump, listen to these Patriotic Millionaires who want their taxes raised, not cut. https://t.co/heoPX7VWkV"]["Leader McConnell’s statement is very disturbing and misleading. He conveniently ignores the fact that mandatory spending on domestic programs have been severely cut and that the Defense Department has received tens of billions in OCO funding that isn't capped at all. https://t.co/emrHXqUahS"]["The U.S. Congress has got to do more than increase military spending and give tax breaks to billionaires. We are here to protect working families."]["When Republicans want to add some $100 billion to military spending over the next two years we will not turn our backs on working families, the elderly, the children, the sick and the poor. We must have parity between defense and non-defense spending."]["Watch live here: https://t.co/G8S4LrFAmj"]["I will be speaking on the Senate floor at 12:30 PM about the budget negotiations. I'm very disappointed that the Republican Party, which controls the White House, Senate and House, is pushing us closer and closer to a very dangerous government shutdown."]["No, Attorney General Sessions. Marijuana is not the same as heroin. No one who has seriously studied the issue believes that. Quite the contrary. We should allow states the right to move toward the decriminalization of marijuana, not reverse the progress that has been made."]["Iceland just became the first country in the world to make it illegal to pay men more than women. In the United States in 2016, black women made 62.5 cents on the dollar compared to white men and hispanic women made 54.4 cents. That is a disgrace. https://t.co/y2sxSWYVrm"]["During his campaign, Trump said over and over again that he would stick it to the wealthy by closing the egregious carried interest loophole. Guess what? His disgraceful tax bill did nothing to address it and even Fox Business commentators are fed up with his broken promises. https://t.co/mz5iQY4dA3"]["This is a simple matter of priorities. With $1.5 trillion we could eliminate child poverty in America two times over. What did Trump and Republicans in Congress choose to do? Give permanent tax breaks to the wealthy and corporations. https://t.co/VnhgbaNHLH"]["Don't be fooled by Trump when he talks about boosts to the stock market from his tax plan. That money is going to the wealthy and large corporations. https://t.co/ps6VBeaPlj"]["Watch Canadian doctor @docdanielle respond to the pathetic myth that single-payer health care is a \"Big Brother-style\" government takeover: https://t.co/ZEMnABw1wo"]["Here is a New Year's Resolution I hope you will share with me. In 2018, we will not only intensify the struggle against Trumpism, we will increase our efforts to spread the progressive vision in every corner of the land."]["It is the right of all people to speak out against their government. The government of Iran should respect this right and heed the voices of thousands of Iranians who are demonstrating across the country for better opportunities and a better future."]["If Congress does not get its act together, we're going to have 800,000 bright young people with no legal status who will be subject to deportation and thrown out of the only country they have ever known. We must protect the DREAMers and move them towards citizenship. https://t.co/owIUzkw3My"]["It is astounding that we have a president who celebrates 13 million people losing their health insurance. Instead of bragging about more Americans without health care, we should be joining the rest of the industrialized world and guaranteeing health care to all people as a right. https://t.co/I27ivXxFH4"]["The United States is virtually the only country on earth that allows pharmaceutical companies to jack up the price of a life-saving cancer drug by 1,400%. This is an outrage. https://t.co/vxwmswwHe3"]["The Republicans are so desperate to spin their disastrous tax plan that they have resorted to taking comments I recently made completely out of context. Let me set the record straight. https://t.co/qPBeGOeDg1"]["My thoughts are with Erica Garner, her family and friends in hoping that she has a full recovery and rejoins the struggle for justice as soon as possible. I have had the privilege of joining with her at a number of events and was deeply impressed with her courage and insights."]["What we could do with $1.5 trillion:\n-Make college tuition-free\n-Provide universal preschool\n-Repair our crumbling infrastructure\n-Fund CHIP for 107 years\n-Rebuild Puerto Rico\n\nWhat Republicans did:\n-Give tax breaks to the wealthy and corporations\nhttps://t.co/cpuyrTkhQI"]["At least Trump is finally telling the truth about his tax bill. https://t.co/pEwx0DvRiq"]["I am a big \"no\" vote on the continuing resolution because it is unconscionable for Congress to go on break when there are so many enormous problems facing the country that need our attention right now. https://t.co/c4Q3DBkVQM"]["Doesn’t it tell us a lot about Republican priorities when the tax breaks for corporations are permanent, while the tax breaks for working families expire at the end of 8 years?"]["I received hundreds of questions from Snapchatters all over the country, from how this Republican tax bill will impact your life to my favorite flavor of Ben &amp; Jerry's. Got to the Discover tab on Snapchat and add me as a friend (bernie.sanders) to watch. https://t.co/t73WTHwXWY"]["Workers in America have earned their retirement benefits from a lifetime of hard work. We cannot allow Paul Ryan to destroy these programs. https://t.co/IU4N6TaK1C"]["It would be unconscionable to leave Washington after giving tax breaks to billionaires and large corporations, while we ignore the enormous problems facing working families. https://t.co/9PaVTLQL2J https://t.co/sTNYCSZHyp"]["Republicans are celebrating raising taxes on working families to give tax breaks to billionaires, corporations, private jet owners and themselves. Remember that. https://t.co/gZX6Iq7C4d"]["Republicans have not even signed their tax cuts for billionaires into law and they are already promising to make cuts to Medicare, Medicaid and Social Security. https://t.co/viu4gRRjec"]["Senate Republicans just passed their tax reform bill. What an utter disgrace. https://t.co/GCnWnPW93H"]["Republicans have to change the name of their tax bill because it violates Senate rules. What should we call it now?"]["Americans – Democrats, Republicans and Independents – say that we must protect Dreamers. Congress must not adjourn until we have a fix. https://t.co/jTm9oHiYiV"]["@SpeakerRyan Paul Ryan has been dreaming of cutting benefits for working families since he was \"drinking at a keg.\" That's not something to be proud of. https://t.co/QBBvTMDANH"]["What we are seeing today, in an unprecedented way, is the looting of the federal Treasury.  https://t.co/G0XjvfNwC9 https://t.co/LGvf1VhH0s"]["In the mad dash to provide tax breaks for their billionaire campaign contributors, my Republican colleagues forgot to comply with the rules of the Senate. https://t.co/6FRpAlCh3R"]["House Republicans just passed their disastrous tax bill. Congratulations to the Koch brothers, massive corporations and billionaire campaign contributors on looting the Treasury and working families. https://t.co/gS6elMdysQ"]["Republican members of Congress are rushing to pass a bill that will increase their own personal wealth at the expense of the middle class. https://t.co/m9BxFlCtmh"]["Exxon Mobil is getting a great return on their investment in the Republican Party. It will receive a $10.5 billion tax break after donating $16.8 million to Republicans since 1990."]["Johnson &amp; Johnson will get a $12.9 billion tax break to \"create jobs.\" Last time it repatriated offshore profits, the company fired people and gave executives a $32.8 million raise."]["IBM fired 12,000 workers and gave executives a $7 million raise after bringing $9.5 billion back into the US in 2004, yet Republicans want to give the company a $13.9 billion tax cut."]["Between 2008 and 2015, General Electric received more in tax credits than it paid in actual taxes and is still in line for a $16 billion tax cut next year."]["Microsoft will receive $27.7 billion in tax cuts after donating $17.9 million to the Republican Party since 1990."]["Pfizer, which fired thousands of employees and gave executives huge raises after the last repatriation holiday, will get a $38.8 billion tax break."]["Apple, which has received $726 million in corporate welfare and government handouts over the last 30 years, will get a $48 billion tax cut from Republicans."]["Today is a victory for the largest and most profitable corporations in this country who, despite record-breaking profits, will now see hundreds of billions of dollars in tax breaks at the expense of working families."]["At a time of massive inequality, the Republican tax bill will unbelievably provide 83% of the benefits to the top 1%, while increasing taxes on 92 million middle-class households by the end of the decade. https://t.co/Puj4twfWEf"]["It is a disgrace that Republicans are rushing to pass a massive tax break for the wealthy while children are about to be thrown off their health insurance.  https://t.co/rvcchpJPwb"]["I won't vote for any spending bill if we do not pass a Dream Act and guarantee that the 800,000 beautiful DREAMers in America are allowed to stay in the only country they know as home. https://t.co/TQTPftWX2e"]["This is a tax bill written for massive corporations and wealthy Republican campaign contributors, not for the average American. It must be defeated. https://t.co/hs9bOPsGpE"]["In case there are any misconceptions about who this \"middle class tax reform\" bill is really for. https://t.co/qZzRQxn4PS"]["Republicans in Congress want to spend this last week before the government funding deadline trying to pass tax breaks for the rich. What if, instead, we actually addressed the crises affecting working people? https://t.co/B7UUC5VRV8"]["Goldman Sachs alone will get a $6 billion tax break from the Republican tax bill. That is a disgrace. https://t.co/0hOr2aGDzu https://t.co/AB89dHPSOH"]["Another reminder that as soon as Republicans pass their massive tax cut for the wealthy and large corporations – running up a $1.4 trillion deficit – they will turn around and say we must cut Social Security, Medicare and Medicaid. https://t.co/EUI8Bj6hyd"]["We must act now to prevent 800,000 Dreamers, young people who were raised in this country, from losing their legal status. Any end of year spending agreement must address the fear unnecessarily caused by Trump's reckless actions, and a clean Dream Act must be signed into law."]["Congress must not break for recess unless it addresses some of the major crises facing this country. https://t.co/OefmoqflqB"]["People like @AdyBarkan are what this fight against the #GOPTaxScam are all about. We can defeat this horrific piece of legislation, but only if everyone stands up and fights back. https://t.co/CODVUYNOqT"]["This tax bill is a moral and economic obscenity. It is a gift to wealthy Republican campaign contributors and an insult to the working families of our country. No member of Congress should vote for this disastrous legislation. https://t.co/Mwt1QP8Ybz"]["Spread the word: today is the LAST DAY of open enrollment to sign up for health insurance. Go to https://t.co/GjiTq2lZbz to choose a plan and get covered. https://t.co/lr9d6c0r22"]["“The proposed tax reform package stakes out America’s bid to become the most unequal society in the world.\" – @Alston_UNSR https://t.co/s7xdejQYoQ"]["Our job: Fight back against the reactionary Trump agenda and for a progressive agenda that works for the middle class, not the 1%."]["He promised to lower the cost of prescription drugs but then nominated Alex Azar, a former pharmaceutical industry executive, as head of the Health and Human Services agency."]["He promised to stand up to the power of corporate interests, but supported the FCC decision to end net neutrality, something Comcast, AT&amp;T and other media conglomerates were begging for."]["He promised to pass tax reform that would benefit the middle class, but is now supporting legislation that gives 62% of the benefits to the top 1% and would, after 10 years, raise taxes on 83 million middle-class families."]["He promised to provide health care to \"everybody,\" but he supported legislation that would have thrown up to 32 million Americans off the health care they currently have."]["As we come toward the end of 2017, I hope and expect that most Americans know that almost every promise that @realDonaldTrump made during his presidential campaign was a lie. Just a few examples:"]["The Republican tax bill is a hole-in-one for Trump himself, who will benefit from tax breaks for real estate investors and golf course owners. This is a disgrace. https://t.co/EvfCOYiEwL"]["This is the end of the internet as we know it. In Congress and in the courts we must fight back. #NetNeutrality https://t.co/ExKx7LFZwj"]["The FCC just voted to repeal #NetNeutrality. We must do everything we can to stop this egregious decision from taking effect. https://t.co/liINH8UGh6"]["At this moment when our democratic institutions are in peril, ending #NetNeutrality protections would be devastating. The FCC must vote against ending a free and open internet. \nhttps://t.co/e4TIILhlR8"]["If you really think that Verizon, Comcast, AT&amp;T and Time Warner need more money, then you should be for repealing #NetNeutrality. - @RepRoKhanna https://t.co/yb4t5Bkp4O"]["There has not been one public hearing, no opportunity to hear from economists, governors, mayors or ordinary Americans who will be impacted by this tax bill. This is a sham. https://t.co/YBHBMXkLEN"]["This tax bill was written for Republicans’ wealthy campaign contributors. I want to congratulate my Republican colleagues for their honesty about that."]["This is not a real conference committee. It is a sham. This tax legislation has already been written behind closed doors.\nhttps://t.co/3kCt8ZQ7V8 https://t.co/7El39ye7XO"]["If the president is serious about fixing NAFTA, he must protect the interests of American workers—not the CEOs of multi-national corporations who have rigged our trade policies for the past 40 years."]["As we speak, the re-negotiation of NAFTA is being done behind closed doors with 500 corporate lobbyists and executives who are working overtime to protect their interests at the expense of working people."]["The Republican tax plan sticks it to working families and makes it harder for students to pay for college. Here's how: https://t.co/7SAKNKOr81"]["It looks like the president’s promises to help working people were just another lie. Trump is already moving to destroy safety net programs that millions of people rely on. https://t.co/o9qdVGY33g"]["It’s bad enough that the Koch brothers are able to spend unlimited amounts to buy politicians as a result of Citizens United. But to allow them to deduct the dark money they spend to influence the political process is beyond absurd. https://t.co/lNnYJvXHqc"]["Mr. Trump, watch these Patriotic Millionaires explain how to stimulate the economy. It's not by giving massive tax breaks to your billionaire friends. https://t.co/hrzvs9AMiC"]["Republicans cannot ignore millions of older workers who are about to lose the pensions they were promised, younger people burdened with outrageous levels of student debt or veterans unable to get the quality health care they were promised."]["Republicans cannot ignore the reality that 800,000 Dreamers will start losing their legal status in a few months."]["Republicans cannot ask for $54 billion more in military spending, and ignore the health care needs of our children and working families in the CHIP and Community Health Center programs."]["The Republicans, who control the Senate, House and White House, must not be allowed to shut down the government. They must work in a bipartisan way to pass a budget which reflects the needs of all Americans, not just wealthy campaign contributors."]["Buried in the Republican tax plan are hidden provisions designed to stick it to the poor and working class while the rich and corporations get billions of dollars in breaks. https://t.co/b5vvNogzBZ"]["As a member of the tax conference committee, I will do everything I can to defeat this bill. We need to rebuild the disappearing middle class, not provide more tax breaks to billionaires."]["Corporate America doesn't want to reduce their tax rate down to 20 percent. They want it down to zero. And that's a burden that will fall on the backs of the middle class. https://t.co/x4oMUK3vYK"]["Republican plan:\n1. Run up the deficit with tax breaks for the wealthy\n2. Freak out about the deficit\n3. Cut Social Security, Medicare and Medicaid to bring down the deficit"]["We have a president who acknowledged on tape that he assaulted women. I would hope that he pays attention to what's going on and think about resigning."]["We need a revolution in the way women are treated in this country. https://t.co/PRzt4nJLys"][".@realDonaldTrump Was this a lie? Do you intend to go along with Paul Ryan's plan to cut Medicare, Medicaid and Social Security, or will you keep your promises to the American people? https://t.co/AAzFKC0mzE"]["There it is. Paul Ryan just admitted that after providing $1 trillion in tax breaks to the top 1% and large corporations, Republicans will try to cut Social Security, Medicare, Medicaid and help for the most vulnerable Americans. https://t.co/vbs2p8A1Dm"]["It needs to be an ongoing movement of women and men that includes a national discussion about sexism, sexual harassment, objectification, inequality and abuse of power."]["We are finally addressing the issue of sexual harassment, and we need to get it right. But the conversation we are having now is only the tip of the iceberg."]["We are now at a crossroads in American culture. And it is an important one. The way we treat women in our country has been abysmal in almost every way."]["Sen. Franken has said that he will be making an announcement about his political future tomorrow. The right thing is for him to resign."]["Join me @SenWarren to talk about where we go from here in the fight against the Republican tax bill and what our priorities should really be.\nhttps://t.co/GkQ7cOWBTw https://t.co/nnBFaeRKoC"]["More than 6,000 lobbyists worked on the Republican tax bill - that's more than half of the lobbyists in DC. No wonder it's a gift to giant corporations. https://t.co/cxl5xv7eNx"]["There’s a reason why all past US administrations have not made this move, and why leaders around the world have warned Trump against it: It would undermine the prospects for an Israeli-Palestinian peace agreement and severely, perhaps irreparably, damage our ability to broker it. https://t.co/dEF0bloRj2"]["Our health system isn't designed to provide quality care to all in a cost-effective way. It's designed to provide huge profits to insurance and drug companies and exorbitant compensation packages to CEOs.\nhttps://t.co/eGzFkseiqk"][".@RandPaull thinks having the right to health care means you believe in slavery. Here's how Canadian @DocDanielle responded to that theory: https://t.co/OOGS3ouKzl"]["Unbelievable but true: Republicans in Congress want tax cuts for millionaires and billionaires at the same time that they want to cut Medicare, Medicaid and Social Security for struggling seniors."]["I've got a challenge for Mr. Trump: Keep your damn promises.\nhttps://t.co/Iao08E3JJl https://t.co/cNytc278kg"][".@realDonaldTrump, I have a challenge for you: https://t.co/i51O9st290"]["Mr. President, keep your promises. Today, get on the phone. Tell Paul Ryan and Mitch McConnell that you will veto any bill that cuts Social Security, Medicare and Medicaid. https://t.co/0VTSpx65Kl"]["The bottom line is: Americans do not want us to pass tax breaks for billionaires and they certainly don’t want us to cut Social Security, Medicare and Medicaid.\nhttps://t.co/7RYx7ZAc1D https://t.co/MJz6T4zgcW"]["The wealthy and the powerful want you to think you are powerless. But we know that that's not the truth.\nhttps://t.co/vq31WuKlKb https://t.co/NZTZ0O8Oss"]["Congressional Republicans and President Trump are waging class warfare. We are going to stand up and fight back! #TaxScamBill"]["Last night, trillions of dollars were stolen from the American people. Well, I have news for @SenateMajLdr and @SpeakerRyan: You are not going to get away with it. #TaxScamBill"]["The fight against the tax bill is not over. We need to stand together to protect working families. https://t.co/fSZm2Pj6Cg https://t.co/kPz5KFaklv"]["Last night, Senate Republicans passed their disastrous tax bill, but this fight is not over. I’ll be in Dayton, Ohio, shortly to rally the American people against this travesty. https://t.co/FbPjp6lZRW"]["I say to my Republican colleagues: The American people are catching on. While you may get away with this act of looting tonight, history is not on your side."]["Our extreme poverty rate is so high that it is an international concern. Why on earth are Republicans are trying to push through a $1.5 trillion tax cut for the very wealthiest, while 41 million Americans are living in poverty? This is a disgrace. https://t.co/m0oKpA5VqK"]["Someone alert the authorities: Senate Republicans are looting the Treasury.  I’m live now speaking about the Republican tax bill: https://t.co/pcPrFdrc8K"]["Historians will look back on Dec. 1, 2017 and conclude this was one of the great robberies in US history because Republicans are looting the Treasury."]["Follow me on Snapchat as we take on the GOP Tax Scam in Kentucky, Ohio and Pennsylvania this weekend. https://t.co/VMvraIUtQL"]["A vote for the Republican tax bill is a vote to take health insurance away from millions of Americans. https://t.co/9Z0brAO3d2"]["During the campaign, Trump promised to protect Medicare, Medicaid and Social Security. Now Congressional Republicans are getting ready to cut them. https://t.co/kALSgGt6rw"]["What bill? We still haven't seen what we're voting on. https://t.co/Fz6CYeiQCn"]["Mark my words: As soon as the Republican tax bill passes, Republicans are going to insist on cutting Medicare and Social Security to cut the deficit. We cannot let this disastrous bill pass. https://t.co/rqVqVtVfzN"]["Maybe I missed it, but I don't remember the need to provide tax breaks to wealthy hedge fund managers in the Virgin Islands being one of our nation's pressing crises. Yet that's exactly what Section 14504 of the GOP bill does. https://t.co/qP7VM12LNl"]["There it is! My Republican friend from Pennsylvania finally admitted it last night. After the tax bill passes, they are going to come back to cut your Social Security, Medicare and Medicaid. They must be defeated. https://t.co/CAmMxrF2go"]["We’ve seen this movie before. It was a bad movie. The last time Congress enacted a corporate tax holiday on overseas profits in 2004, the top 15 beneficiaries cut 21,000 U.S. jobs. https://t.co/j3wC518wdO"]["Today Senator Rubio tried to tell me he wouldn't cut Medicare or Social Security. That's not what he said yesterday morning. https://t.co/Dt7onRXEcD"]["Tonight I asked my Republican colleague Sen. Toomey to guarantee to the American people there would not be cuts to Social Security, Medicare and Medicaid after this tax bill. He couldn't do that. https://t.co/Svd2F8o2Ny"]["Trickle-down economics failed under Ronald Reagan, under George W. Bush and in the state of Kansas under Gov. Brownback. It is a fraudulent theory cooked up by think tanks funded by the wealthy."]["When Reagan slashed taxes for the rich in 1981, economic growth went down by 1.9% the following year and the unemployment rate increased. The 1981 tax cut was so \"successful\" that Reagan had to increase taxes 11 times after that."]["The bottom line: the American people do not want us to pass tax breaks for billionaires today and they certainly don’t want us to cut Social Security, Medicare and Medicaid.\nhttps://t.co/bqrpaQTATx https://t.co/7CZtuwbj7D"]["I will be listening eagerly for any Republican to tell me they will not come back from increasing the deficit $1.4 trillion with cuts to Medicare, Medicaid and Social Security. https://t.co/L1JDpPblpT"]["I know that Trump is not much into history or the U.S. Constitution, but he ought to know that millions of men and women have struggled, fought and died to defend our democracy and the religious freedom that our Constitution guarantees."]["Has corporate media paid enough attention to the issues affecting everyday Americans? Tune in to the discussion: https://t.co/VxFo9ZPYbb https://t.co/8H0995ByGy"]["What is the future of digital media? Senator Sanders talks with journalists from @nowthisnews, @TheYoungTurks, @ajplus and @attn:\nhttps://t.co/VxFo9ZPYbb https://t.co/aeX0tqrFWe"]["Starting soon: Facebook Live conversation on the state of politics and digital media. Watch at https://t.co/TIdQMUk3ML https://t.co/H4a6r3uHR5"]["If Republicans will not come back from passing a $1.4 trillion deficit increase with cuts to Medicare, Medicaid, Social Security and other programs—come down to the floor of the United States Senate and tell me that I’m wrong."]["Join me today at 4:45 ET for a Facebook live conversation with journalists from four leading social media news outlets about the state of politics and digital media. https://t.co/TIdQMUk3ML https://t.co/gpHzLmqPzt"]["What “entitlement reform” actually means is massive cuts to Social Security at a time when millions of older workers have nothing in the bank for their retirement."]["It is without doubt that as soon as this tax legislation is passed, Republicans will rediscover their religion about the deficit and say we need “entitlement reform.”"]["Pathetic, disgraceful, immoral. How else can I describe the Republican tax plan? It must be stopped.\nhttps://t.co/9whBKb7TTr https://t.co/n49fFnmaBT"]["Thank you to those who showed up to the Senate yesterday to protest the horrific Republican tax bill. I hope my colleagues are listening. https://t.co/46fbDZWhv1"]["Tim Scott says he wants hardworking, everyday Americans to get ahead. So I hope he will vote against the disastrous GOP tax bill. #TaxDebate https://t.co/wALxympld5"]["The GOP tax bill must be defeated. We should then sit down and develop tax policy that actually works for working families.  #TaxDebate https://t.co/0gjc7O4Nq3"]["We live in a moment in history where we have more income and wealth inequality than any time since the 1920s. The idea that 60% of the benefits in the Republican tax plan go to the top 1% is beyond absurd. #TaxDebate"]["Ted, tell the truth. Your plan raises taxes on 87 million middle class households to give tax cuts to the wealthy and large corporations. #TaxDebate https://t.co/XkJAqcCgzm"]["Ted Cruz and Tim Scott should listen to these Patriotic Millionaires instead of their campaign contributors. #TaxDebate https://t.co/GRRYwJw2IL"]["He took out the essence. https://t.co/OAWvyntY6g"]["Republicans love talking about Reagan's major tax cut in 1981. They fail to mention he raised taxes 10 times thereafter. #TaxDebate https://t.co/Sis5SWZsnl"]["Tim Scott and Ted Cruz love to say the GOP tax plan is about creating jobs, that's nonsense. #TaxDebate https://t.co/01MZmyz2uZ"]["Then why are you supporting a bill that would raise taxes on 87 million middle class households? #TaxDebate https://t.co/jeDtOFXAdV"]["37 of 38 experts agreed that the Republican tax bills would cause U.S. debt to increase \"substantially\" faster than the economy. The 38th said he misread the question. #TaxDebate\nhttps://t.co/gCF3VPgv3B"]["Repealing the estate tax will give hundreds of billion of dollars to the wealthiest people in this country. #TaxDebate https://t.co/BLgLlxEBZE"]["Republicans want to repeal the estate tax, which applies only to the top 0.2 percent. That's a disgrace. #TaxDebate https://t.co/QOJKkEcGNf"]["I’m for a tax break for small businesses and for working families all over this country. What I am not for is enormous tax breaks for billionaires. #TaxDebate"]["Here's something I wish Tim Scott and Ted Cruz would understand: Corporate tax cuts don't create jobs. #TaxDebate https://t.co/cnIvDz56Ru"]["Ted Cruz keeps saying we have the highest corporate tax rate in the world. That is false. #TaxDebate https://t.co/8Rr8cYItfA"]["The top 0.1% of Americans are already doing pretty well. But Republicans say they need even more. So they're giving them an average break of $208,000. Unbelievable. #TaxDebate"]["FACT: Under the Republican plan, a single mother making minimum wage with two kids would get only a $75 tax credit. Meanwhile, a family making $500k with two kids would get a $4,000 tax credit. #TaxDebate"]["Let's get the facts straight: 62% of the benefits in the Senate Republican tax plan go to the top 1% and 40% of the benefits go to the top 0.1% by the end of the decade. #TaxDebate"]["Who in their right mind believes now is the time to give massive tax breaks to billionaires? #TaxDebate https://t.co/g6i8Op2LGl"]["According to the Tax Policy Center, 87 million middle class households would see their taxes go up by the end of the decade under the Republican tax bill. #CNNDebateNight"]["Tune in to CNN tonight at 9 ET, when @SenatorCantwell and I will debate @SenTedCruz and @SenatorTimScott on the Republican \"tax reform” plan. #CNNDebateNight https://t.co/avGSdEdfU6"]["@GOPSenFinance @SenatorEnzi @BudgetGOP \"Hats off\" to Senate Republicans for advancing their tax scam. #KillTheBill https://t.co/HLWaCsFAGs"]["How is it a tax reform plan for the middle class if 87 million middle class households will see their taxes go up?"]["We took some American doctors to Canada to see a universal health care system up close. Here's what they learned: https://t.co/GboJ8N22DN"]["It would be absurd to rebuild Puerto Rico’s antiquated, fossil fuel-dependent grid back the way it was. We must take advantage of the abundant sustainable energy they have."]["The people of Puerto Rico and the Virgin Islands are not forgotten, they are not alone, and we will do everything possible to rebuild those beautiful islands."]["It makes no sense to simply put things back the way they were in Puerto Rico and the Virgin Islands. We have to help the islands build back stronger. https://t.co/CCPXyND7En https://t.co/COyWhbZiUn"][".@SpeakerRyan and @SenateMajLdr, how much will you cut Medicare, Medicaid and Social Security to pay for a $1.4 trillion deficit increase? How much will you cut Pell Grants, WIC and Head Start? The people have a right to know. https://t.co/SsKNLjZK2h"]["Today and every day, our workers deserve $15 an hour, decent working conditions and the right to form a union. #BlackFriday"]["The U.S. and other developed countries must develop policies to improve life for the desperately poor around the world. We should not be making a bad situation even worse. https://t.co/DzEfEv9N6c"]["I wish everyone a happy Thanksgiving. This has been a tough year, but we can move forward in a direction based on generosity and love. https://t.co/LQs1MZbOHD"]["If the tax plan is passed, giving huge breaks to the 1% and raising the deficit $1.5 trillion, Republican leaders will rediscover \"the deficit crisis\" and move aggressively to cut Social Security, Medicare and Medicaid."]["The Republican tax bill would be a major step forward in creating the kind of oligarchy long envisioned by the Koch brothers and other powerful right wing extremists."]["Trump's sanctuary cities policy is federal coercion to enforce the president’s racist, anti-immigrant policies. This is a check on an out-of-control executive branch and a victory for the rule of law. https://t.co/imUhjMrMWO"]["Once again, the Trump administration sides with big money and against democracy. If this passes, the internet and its free exchange of information as we have come to know it will cease to exist.  #NetNeutrality https://t.co/1oKLkWOpYn"]["Republicans' tax bill would throw 13 million Americans off of health insurance. Here's how: https://t.co/ZGCtEiLWht"]["Ridiculous. The idea of “clean coal” is pure fiction. It's a concept intended to keep us tied to fossil fuels when we should be embracing sustainable sources of energy. https://t.co/XvVbOTlBwH"]["Yesterday my colleagues and I sent a letter to Sec. Tillerson asking him to make it easier to send U.S. aid for Iranian earthquake relief. The U.S. has routinely offered to help the Iranian people in times of need. This time should be no different. https://t.co/k56BmPUVeu"]["While we do not need more evidence to show us that pipelines are dangerous and must be stopped, more keeps coming. https://t.co/8PelLe6fLb"]["There already is far too much media concentration in this country. We need more diversity, more local ownership, more viewpoints. @AjitPaiFCC's decision is a massive step backwards.   \nhttps://t.co/ceePYiVUD2"]["If we are going to stop Republicans from taking health care from millions and slashing Medicare to give tax cuts to the wealthy and large corporations, NOW is the time to stand up and fight back. https://t.co/7BKO2drjEx"]["Paul Ryan has been fantasizing about cutting Medicare, Medicaid and Social Security for years. Ryan's plan must be defeated. https://t.co/0Jope77lyT"]["We shouldn't throw 13 million people off of health insurance to give more money to billionaires and corporations. I can't believe we even have to say that. https://t.co/JU7SSwWvgk"]["Two months after Hurricane Maria, Puerto Rico and the U.S. Virgin Islands are still living in misery. As a nation we must do better. https://t.co/a11cjeTZUs"]["Just like we defeated Republicans' efforts to repeal Obamacare, we need to stop their tax plan. Join me and @MoveOn tonight at 8 ET at https://t.co/7MdXIJpM7O to get ready to fight back. https://t.co/OuTOg4v3na"]["Our fight against the Republican tax plan requires the same urgency as when they tried to repeal Obamacare. Health care for 13 million Americans is at stake. https://t.co/lNB2noodPL"]["Watch @docdanielle debunk one of Fox News' most pathetic single payer myths: https://t.co/ayYA4k46x7"]["Renewable energy, like wind and solar, are the kinds of projects the federal government should be focused on—not more drilling in the Arctic National Wildlife Refuge. #ProtectTheArctic"]["It is insane to open up a National Wildlife Refuge to provide more handouts to wealthy fossil fuel corporations. #ProtectTheArctic"]["The future for our country and planet is in renewable energy, not fossil fuel. #ProtectTheArctic"]["How many times do we have to defeat Republicans' efforts to take health insurance away from millions to give tax breaks to the top 1%? Apparently once more. https://t.co/yFakWQAIfN"]["Thank you, Gary Cohn, for that lesson in why trickle-down economics is a fraud and failure. https://t.co/DPVBnS2Yi3"]["A vote for the Republican tax bill is a vote to cut Medicare by $400 billion over the next decade. https://t.co/Ad06HrQKxN"]["We are the wealthiest country in the history of the world. How is it possible that 2 months after Hurricane Maria half the people of Puerto Rico don't have electricity?"]["For the last 18 years @GunnelsWarren has been by my side watching Republicans try to destroy the middle class. https://t.co/MS56gB3N2y"]["The Paradise Papers make clear that we need, in the United States and throughout the world, a tax system which is fair, progressive and transparent. https://t.co/ERa6JBUDFq"]["Trump was clearly never serious about his promise to lower drug prices. We need an HHS secretary who will take on the drug industry's greed, not someone who has financially benefitted from it. https://t.co/RM9vxicfZT"]["The essence of oligarchy is that the billionaire class is never satisfied with what they have. They want more, no matter what impact their efforts have on working people. https://t.co/TNu5uAfNkb"]["Well, at least Trump is consistent. Abroad, he has never met a leader of an authoritarian nation (Russia, China, Saudi Arabia, Philippines) that he hasn't liked. At home he shows contempt for the U.S. Constitution and democracy."]["America’s role as a global leader should be to find ways to de-escalate tensions and work with allies to find diplomatic solutions, not to support increased conflict between regional powers."]["Trump's chief economic advisor finally admitted what we already knew: big CEOs are getting incredible benefits form the Republican tax plan. https://t.co/K5RVyqVObn"]["While we set aside this day to recognize our veterans, we must commit ourselves to keep America’s promise to them every day. #VeteransDay"]["My Republican colleagues love to say the U.S. has the best health care in the world. Well, these Canadians think otherwise and so do I. https://t.co/1qQt5L8EoW"]["I’m no historian, but I think it’s fair to say that there’s probably never been a president less qualified than Trump.\nhttps://t.co/s3ebobqXRZ"]["If that were the case, I can assure you the Koch brothers, Trump and other billionaires would not be pushing so hard for this plan. https://t.co/uukh24ASlJ"]["It's nice to see Republicans in Congress looking out for the people who really matter: their wealthy donors. https://t.co/BfS5TyaTGt"]["Corporate tax loopholes have become so absurd that one five-story building in the Cayman Islands is “home” to nearly 20,000 corporations. https://t.co/L1YCapJ3qA"]["LIVE: We recently found out a terrible truth about the rapid movement toward global oligarchy. #ParadisePapers https://t.co/a22wk9yKIf https://t.co/CYxRCLbUKI"]["Canadians tell Americans the truth about health care wait times in Canada: https://t.co/Y9sreOtbVE"]["Two sisters both had breast cancer. The one in Canada focused on getting better, while her sister in America faced mounting medical bills. https://t.co/SW75lqYcaD"]["Congress must act now or 2,800 community health centers will close and millions will lose access to health care. https://t.co/mzfE8UkkdO"]["Watch @docdanielle debunk the myth that Canadians have their health care decisions decided by the government. https://t.co/0GG3fu4HAv"]["Today at the international climate talks, Syria joined the Paris Climate Agreement. Thanks to Trump, the U.S. is now the only one out. https://t.co/KgaYBGKdDK"]["There's no good reason why Americans should feel they have to leave our country in order to receive affordable medical care. https://t.co/ayRQQ6TYE9"]["Our pattern of doing nothing after mass shootings must end. Gun violence in America is a major crisis which must be addressed."]["The time is long, long past for us to put the lives of children and innocent Americans over the interests of the NRA’s corporate backers."]["How many tragedies must we witness before Republicans in Congress agree to pass legislation to end this epidemic of senseless slaughter?"]["The key issue of our time is the movement toward oligarchy, where a few billionaires control much of the economy. https://t.co/s92m3rz1mP"][".@keithellison breaks down why Trump's tax plan means more yachts, homes and political influence for the wealthiest people in this country. https://t.co/fhhegYh4q1"]["Before Congress considers a tax bill it must investigate the Paradise Papers. We must end the rapid movement toward international oligarchy. https://t.co/ygdTNiom5B"]["Trump has repeatedly reneged on his promises by supporting the wealthy at the expense of working families. https://t.co/OOwB5Ic6d9"]["Trump must make good on his promise to sign a bill protecting Dreamers. I won't vote for any spending bill without a permanent DACA fix."]["Today marks how far into 2017 Latina women must work to make what white men made in 2016. That's a pay gulf, not a pay gap. #LatinaEqualPay"]["Are Republicans telling the truth about Canadian health care? These Canadian patients have the answers: https://t.co/l8pfQs1xEu"]["Huge tax cuts for multinational corporations and the top 1%, backed by the Koch brothers. @SenWarren and I break down the GOP tax plan. https://t.co/dr5Ko1cpHV"]["The Cut, Cut, Cut Act:\n✅ Tax cuts for billionaires\n✅ Tax cuts for corporations \n✅ Forces cuts to Medicare, Medicaid and Social Security https://t.co/3sQiL8b5Qy"]["These Canadians want Americans to know: having health care as a right is real freedom. https://t.co/nAJXOekuxA"]["The top 0.1% owns almost as much wealth as the bottom 90%. Republicans say that's not enough. 40% of their tax breaks go to the top 0.1%."]["Only 12% of Americans believe the wealthy should receive a tax cut. So of course, Republicans are trying to give the wealthy a huge tax cut."]["Spread the word: You can sign up for health insurance starting today. Go to https://t.co/abvyRmbFsY to choose a plan and get covered."]["\"Women are already trickling out of the work force, and it could get worse with more unexpected pregnancies.\"\nhttps://t.co/fI1pSccJoQ?"]["President Trump must not, in any way, try to derail or obstruct Bob Mueller's investigation. https://t.co/ggjHwjJYk3"]["About 70% of Puerto Rico still has no power, as many as 900 could be dead and thousands need food, shelter and clean water. We must help. https://t.co/48cJDsHvuK"]["You know what's really scary? Millionaires and billionaires using their wealth and power to undermine our democracy. https://t.co/AEsnevWVMU"]["A new authorization must be specific about who we are fighting, the mission objectives and reporting requirements from the president."]["Amazingly, Trump is waging war against a group that didn't exist when the authorization of military force passed. https://t.co/6gF5DB7iAX"]["Unless we renew community health center funding, 70% of funds will be cut. 2,800 CHCs will close. And 9 million patients will lose care."]["Community health centers save lives, but they also save money. They’ve generated $49 billion in savings to the entire health care system."]["CHCs provide affordable, high-quality health care to more than 27 million people including primary care, dentistry and low-cost Rx drugs."]["Millions of Americans are at risk of losing health care because Congress did not renew funding for the community health center program."]["There is a lot going on, but we need to take a minute to talk about a health care crisis no one is talking about. https://t.co/nX5uvdnayf"]["Watch @docdanielle debunk one of President Trump's outrageous single-payer myths: https://t.co/hxlVxONGXx"]["Are you a student or recent graduate? Apply to be an intern in my D.C. and Vermont offices. The deadline is Nov. 18. https://t.co/EPSZUJsFvB"]["It is an honor to be with one of our great progressive leaders @NYCMayor fighting for a millionaires tax to fix our infrastructure."]["Russia’s attack on our democracy is of enormous consequence. Trump must not, in any way, try to derail or obstruct Mueller's investigation. https://t.co/3NCpFM6eHd"]["Thank you, Toronto. I’m proud to join with you in the global fight for universal health care. https://t.co/lx8MnbsGmX"]["FEMA must determine how, through mutual assistance agreements, utilities on the mainland can be of immediate help to Puerto Rico."]["Gov. Rosselló is right. We must immediately nullify Whitefish Energy’s outrageous $300 million contract. https://t.co/g6uHgx6ayK"]["Are you truly free if you work 100 hours a week because you can’t find a job with a living wage? Are you free if you have no health care?"]["How a country deals with health care for its citizens isn't just about about medicine or technology. It's about its core values as a nation."]["LIVE: Sen. Sanders speaks at the University of Toronto on what the U.S. can learn from Canadian health care: https://t.co/4ZDbc6GZ1R https://t.co/CvEfpcRR9a"]["Thank you @CarmenYulinCruz for your tireless work. We we will do everything we can to see that Puerto Rico is rebuilt. https://t.co/CsW5sLhFAQ"]["We cannot simply rebuild Puerto Rico the way it was. We must go forward to create a strong, sustainable economy and energy system in PR."]["Puerto Rico is not alone. https://t.co/EdvSyfhXru"]["65% of PR has telecommunications access, but there are concerns of a total collapse of wireless service unless enough electricity can return"]["The level of destruction in Puerto Rico is unprecedented. Rebuilding will require significant resources over a long period of time. https://t.co/foSBPixYEM"]["Only 26% of Puerto Rico has electrical power and around 90% of the U.S. Virgin Islands is still without any electricity."]["I want the people in Puerto Rico, as well as those in the Virgin Islands, to know that they are not alone, they have not been forgotten."]["Today I am in Puerto Rico to talk with families and local government representatives about the destruction they are dealing with. https://t.co/CHPidDPh84"]["Millions depends on Medicaid for opioid treatment. Trump's solution is to cut Medicaid by $1 trillion. That is a disgrace."]["Trump is right that the opioid crisis is a national emergency. Unfortunately, his announcement today was nothing more than an empty promise. https://t.co/17NIKrgGKu"]["Senate Republicans just gave a massive gift to Wall Street at the expense of everyone else in this country. https://t.co/TUiSnORbzO"]["Republicans say they don't want to hurt Medicare. Then why does their budget cut Medicare by hundreds of billions of dollars? https://t.co/45tKWxrR9N"]["The Republican budget is disgraceful. Millions will lose health care and thousands will die in order to give tax breaks to billionaires."]["For too long, drug companies and their lobbyists have bullied Congress into inaction while millions suffer. Enough is enough. https://t.co/F6s2bIlzms"]["We know we have a very serious problem when we pay far more than any other country in the world for the exact same prescription drugs. https://t.co/qR0oGowCSf"][".@keithellison has news for the GOP: raising taxes on the wealthy works much better for average Americans than tax breaks for the top 1%. https://t.co/V4CI7cnrSL"]["Senate Republicans just gave a massive gift to Wall Street at the expense of everyone else. https://t.co/9x6NHBpRun"]["LIVE: Sen. Sanders speaks on how Medicare for all would help businesses and save billions of dollars. https://t.co/BYs7LA4gT9"]["Republicans say tax cuts for the wealthy and big corporations help small businesses. Here’s the truth: They don’t. https://t.co/edar4k5wwe"]["While the United States is the wealthiest country in history, we rank 57th in infant mortality. That is an absolute disgrace. https://t.co/qm2R4iSNno"]["Republicans love to say that corporations in the U.S. are paying the highest taxes in the world. They are dead wrong. https://t.co/MxH5yKyNU9"][".@SenTedCruz said he never called Social Security a Ponzi scheme. But Ted, we got it on the damn screen. https://t.co/GZmIDgE8VO"]["This is precisely why I recently introduced the College for All Act: https://t.co/qei1xf4UzF"]["Republicans have set the stage to pass tax cuts for the top 1%. We must mobilize to demand their plan is defeated. https://t.co/tTEeo7VyVy"]["Republicans’ budget is not a bad bill. It’s a horrific bill."]["No one should die because they can't afford medication they need. But that's what happens when we let drug makers charge whatever they want."]["Gilead, one of the greediest pharmaceutical corporations in the world, is once again gouging people dealing with life-threatening illness. https://t.co/hz4GOCA58O"]["Watch this Danish conservative economist help prove my point: all people should have quality health care, higher education and child care. https://t.co/6NlBe8alFg"]["This is about our priorities as Americans. All our people should get quality health care, higher education and child care. #CNNDebateNight https://t.co/llDaT1Wp9u"]["When Bush was in office, he cut taxes for the wealthy and the national debt nearly doubled. Voodoo economics is a fraud. #CNNDebateNight https://t.co/soY4d6n1LC"]["Reagan did slash taxes on the rich in 1981. But the deficit increased so much that he raised taxes in '82, '83, '84 and '87. #CNNDebateNight"]["When we talk about our national priorities, it is not just taxes, it's what taxes do for the American people. #CNNDebateNight https://t.co/5Bi996sDDQ"][".@SenTedCruz: \"Social Security is a Ponzi scheme\" #CNNDebateNight https://t.co/C0tXsVyoUu"]["We must send a message to the billionaire class: You can’t get huge tax breaks while children in this country go hungry. #CNNDebateNight https://t.co/QG46JH0p83"]["Republicans love talking about how Reagan enacted a major tax cut in 1981. They fail to mention he raised taxes 10 times thereafter. https://t.co/jqbgfgueqw"]["Ronald Reagan's own advisors understand that giving tax breaks to the wealthiest individuals is a disaster. #CNNDebateNight"]["Not \"all\" Americans—only the top 0.2% of Americans are affected by the estate tax. #CNNDebateNight https://t.co/OvqN2ZWVfc"]["Well, @SenTedCruz makes a great speech about farmers paying the estate tax. Unfortunately, it has nothing to do with reality. https://t.co/VTp1InN3dm"]["Let's not confuse our campaigns @SenTedCruz. Mine had an average contribution of $27. You received $38 million from three billionaires."]["If @SenTedCruz doesn't come through for the Koch brothers on these tax cuts, he's going to be in trouble. https://t.co/616nCuOtC5"]["The Republican Party has been calling the estate tax a \"death tax\" for years. The truth is it affects only the top 0.2% https://t.co/rzGTEu6dZs"]["False. The effective tax rate for large profitable corporations is just 14%. Corporate taxes as a share of GDP are lower than 22 countries. https://t.co/8mOK0xCCqC"]["Does it make more sense to give tax breaks to the top 1% or rebuild our infrastructure and create 15 million jobs? #CNNDebateNight"]["The Koch brothers and billionaire donors want these tax cuts very badly. In fact, @SenTedCruz just met with them. https://t.co/P9G2bhU9vQ"]["What the entire GOP proposal is about is giving tax breaks to people who don’t need it by making cuts to education, housing and health care."]["Trickle-down economics is a myth, plain and simple. Creating massive tax cuts for the wealthy and corporations doesn't create jobs. https://t.co/Y9ynhX4pUO"]["The Republican tax plan is a massive transfer of wealth from working families to the top 1%. #CNNDebateNight"]["It's time to debate with Bernie. Tune in now. #CNNDebateNight https://t.co/qYj2NlZPkz"]["Watch this tax expert debunk some of @tedcruz's most outrageous tax theories: https://t.co/QnZPaPgShQ"]["LIVE: Sen. Sanders speaks on our priorities: no tax breaks for the top 1%. No cuts to Medicare. No cuts to Medicaid.\nhttps://t.co/F2TWPGCaGa https://t.co/UIzX3O7PHg"]["Who's pushing Republicans to pass tax cuts for the rich that only 12% of Americans support? Their billionaire donors.https://t.co/P9G2bhU9vQ"]["I have something to say to Mr. Trump: Tell your Republican friends in the Senate you'll veto this disastrous budget. https://t.co/cuO6R22RwV https://t.co/xn8GWqRvFW"]["In this budget, Republicans want to cut Medicare by $473 billion and Medicaid by over $1 trillion in the next 10 years. Disgraceful."]["Poll after poll after poll tells us the overwhelming majority of Americans don't want cuts Medicare or Medicaid."]["Why are Republicans bringing forth such an absurd budget that is diametrically opposed to what the American people want? Follow the money."]["Mr. Trump forgot to tell these truckers in Pennsylvania that only the top 0.2% of Americans would benefit by repealing the estate tax. https://t.co/MzLIYplWD9"]["Republicans' budget cuts Medicaid by more than $1 trillion over 10 years – which would throw some 15 million Americans off health insurance."]["Trump and Republican leaders claim their budget gives a \"big league\" tax cut for the middle class. Nothing could be further from the truth."]["We must end U.S. support for the disastrous war in Yemen and reassert Congressional oversight. https://t.co/tU9x5Lb31f"]["Amazingly, we have a president who is trying to destroy the American health care system. https://t.co/cVozMIygZZ"]["Senate Republican’s budget would cut $76 million from the Meals on Wheels program to give tax breaks to the top 1%. https://t.co/eUbwzLRMUj"]["Congress should listen to what virtually the entire national security community is saying – that the Iran deal is working – and protect it."]["Now that this decision has been put in Congress’ hands, it’s up to us to stop this drift toward war."]["Trump's own top security officials say Iran is meeting its commitments under the deal and that it is in the security interests of the US."]["President Trump’s refusal to certify the Iran deal is the latest in a series of reckless moves that make Americans less safe."]["This Canadian doctor has seen patients cry happy tears after finding out they would not have to pay for medical care in Canada. https://t.co/dSPuBTUGKk"]["Our full resources must be brought to bear on the humanitarian crisis in Puerto Rico, for as long as necessary, to help our fellow citizens."]["We looked into it, @realDonaldTrump. It’s called the First Amendment to the U.S. Constitution. You should check it out some time. https://t.co/ov8iR9SRJp"]["Let's be clear: the economic theory Trump has embraced, trickle-down economics, is an abysmal failure and a fraud. https://t.co/Ag5V309hnZ"]["President Trump talks about bringing back fossil fuels. It’s not going to happen. Solar is the future. https://t.co/tTo6bXJReu"]["Instead of spending another $70 billion on the military, we could be helping millions of students by making public colleges tuition-free. https://t.co/UQqJ5egM4G"]["Trump’s tax plan takes from the poor and working families in order to give to the very rich. This disastrous proposal must be defeated."]["80% of the tax benefits in Trump’s plan will go to the top 1%. This gift to millionaires will result in huge cuts to Medicare and Medicaid."]["Trump's tax plan will provide virtually no benefit to truck drivers and result in a tax increase for millions of middle class Americans."]["Donald Trump is in Pennsylvania to tell truck drivers how his tax plan will benefit them. Unfortunately, once again, the president is lying."]["Median Black family wealth: $1,700\nMedian Latinx family wealth: $2,000\nMedian White family wealth: $116,800\nThat is simply unacceptable. https://t.co/709xeujzsN"]["Trump's announced intention to decertify the Iran nuclear agreement would achieve nothing other than isolating the US."]["Thank you @USStudents for organizing students across the country to get involved in the fight for College for All. https://t.co/gS8hUVjrfB"]["Tonight at 7 PM ET, I'm holding a town hall on the need to make public colleges tuition free. Tune in: https://t.co/rCppxCNL1c"]["The economic theory Trump has embraced, trickle-down economics, is a fraud and an abysmal failure. https://t.co/SUxNVMXa8O"]["In the wealthiest nation, we must ensure all Americans, regardless of income, have access to mental health care. #WorldMentalHealthDay"]["In the richest country, everyone who has the desire and ability should be able to get a college education. https://t.co/mFGSqCWIAg"]["Tomorrow, we start our push to make public colleges and universities tuition free. Tune in at 7 PM ET: https://t.co/rCppxCNL1c"]["Making America great is not giving tax cuts to billionaires. It's making sure everyone gets the education they need. https://t.co/cd9lDF5UzI"]["We must lower the cost of electricity in Puerto Rico and take advantage of its plentiful solar and wind energy to create sustainable power. https://t.co/q6Fjd7WptP"]["Despite the Trump administration’s destructive efforts, we will not stop fighting for women’s rights and full reproductive justice."]["This is nothing less than sexism. It's the latest display of Republicans’ total disdain for women’s ability to control their own lives. https://t.co/JpsFjBphB6"]["Republicans say, \"We don't want to hurt Medicare.\" Then why does their budget cut it by $473 billion? https://t.co/0fcwwtTMaK"]["The Republican budget contains cuts that will kill people, cuts that will hurt people, cuts that should not be allowed in a humane society."]["By voting for this budget, Senate Republicans are voting to slash Medicare and Medicaid. We cannot allow this to pass. https://t.co/zZGetOTMvP"]["What are the benefits of a publicly funded health care system? This Canadian doctor explains: https://t.co/L1egTYbUOO"]["Now is the time for President Trump to stop his insulting tweets. Now is the time to rebuild Puerto Rico. https://t.co/JmCfxALg8g"]["These millionaires want President Trump to know there is nothing patriotic about shifting the tax burden onto the middle class. https://t.co/6ZmbhCGJp8"]["What happened in Las Vegas is a tragedy. But it's one we continue to repeat. We need commonsense legislation to save innocent people. https://t.co/cS6s1eoJI0"]["The Republican budget cuts Medicaid by over $1 trillion and Medicare by $473 billion over 10 years. Mr. Trump: promise to veto this budget. https://t.co/KypNYrBq82"]["Common sense suggests that we have got to do everything possible to prevent the conversion of semi-automatic rifles into automatic rifles. https://t.co/hxcu7Vzp5n"]["There is no reason for any civilian to own an automatic weapon."]["It’s too late for the victims in Las Vegas, but it's not too late to prevent more innocent Americans from becoming victims of gun violence."]["Veterans have been clear that they support strengthening the V.A., not slowly dismantling it by directing resources outside the V.A. system. https://t.co/6xMeJjIoaz"]["Disgraceful. Pathetic. I have a few things to say about Trump's tax proposal.\nhttps://t.co/f6o46SMDtm"]["Here’s what happens to cities devastated by hurricanes after the cameras leave: https://t.co/SDTWtZJOTJ"]["If you are part of the 99.8%, you wouldn’t get a nickel if Republicans repeal the estate tax. https://t.co/QWGbmOPxnj https://t.co/KimKtppTKo"]["“Unless you were alive during the 1920s, you haven’t seen inequality like this.” –Chuck Collins\nhttps://t.co/QWGbmOPxnj https://t.co/PNWe5LQag7"]["LIVE: Join me and Chuck Collins of the Institute for Policy Studies about how we can create a more equal society: https://t.co/QWGbmOPxnj https://t.co/CpqmLwManc"]["A free, open internet is critical to democracy. We can't allow major telecom companies to have greater control over the information we get. https://t.co/Uz0BiDEXRk"]["Jane and I are deeply saddened to hear that Vermonter Sandy Casey was among the victims in Vegas. Our hearts are with her friends &amp; family. https://t.co/igPQZGqn5Q"]["It is long past time for Congress to take action on gun safety to save innocent lives."]["It should be clear that we have got to do everything we can to stop guns from falling into the hands of people who should not have them."]["Last night’s attack is the deadliest mass shooting in our country's modern history. This year there have been more mass shootings than days."]["I also want to thank the first responders who did an outstanding job responding to this tragedy, saving many lives."]["My thoughts are with the families and friends of the victims and all those wounded in the horrific shooting in Las Vegas."]["Puerto Ricans are suffering. They are American citizens entitled to the same help as everyone else. We've got to do all we can to help."]["What world does Trump live in where it's acceptable to attack the mayor of San Juan while he plays golf with his billionaire friends? https://t.co/s1xXTbOdwa"]["\"Save Medicare, Medicaid and Social Security without cuts. Have to do it.\" \n–Donald Trump, June 16, 2015 https://t.co/pv9xKY8qJp"]["Republicans' budget would cut Medicare by at least $450 billion, but would give billionaires, including President Trump, huge tax breaks. https://t.co/NwbKCsvU6K"]["I will do everything I can to oppose this absurd set of priorities."]["We need a budget that reflects the needs of working families, not just the wealthy, the powerful and large campaign contributors."]["This Republican budget was written for the billionaire class, for Wall Street, for corporate CEOs and for the Koch brothers. https://t.co/o4hQpf9OF4"]["Why does Norway rank so much higher than the U.S. on health outcomes? These Norwegian doctors explain: https://t.co/zfvLEbfQKD"]["Who benefits from Trump's plan to repeal the estate tax? Only the top 0.2% — Trump, his cabinet, and other millionaires and billionaires. https://t.co/UQilM6MaRb"]["Cutting taxes on huge corporations doesn’t create jobs. It makes CEOs richer and puts a bigger burden on the middle class. https://t.co/twMl1rmd0D"]["You don’t fix a rigged economy by giving huge tax breaks to the billionaires and corporations that rigged it."]["Let’s be clear: 99.8% of Americans would not receive a nickel if Trump repeals the estate tax. But millionaires and billionaires would."]["The last thing we should do right now is provide 100s of billions in tax breaks to the wealthiest people and most profitable corporations."]["Watch this Canadian doctor discuss the difference between practicing medicine in Canada versus the United States. https://t.co/8tGzzJNPkP"]["Win Butler of @ArcadeFire sat down with a member of Team Sanders to talk universal health care. See what he had to say: https://t.co/ALUmgBymlc"]["Trump's tax plan is an absolute disaster. Here's why: https://t.co/uda4X5G960"]["Should health care be a right? Win Butler of @arcadefire answers:\nhttps://t.co/W0zAOhbnt6"]["It is particularly obscene for Trump to repeal the estate tax which would provide a $269 billion tax break to the top 0.2%. https://t.co/ehnUc0xXwe"]["At a time of massive wealth and income inequality, Trump's tax plan is morally repugnant and bad economic policy."]["I would like to thank every single American who came out to fight back and save our health care. You are why we won. https://t.co/HSw1uykCJP"]["We must act immediately to end this humanitarian crisis. https://t.co/vt8zTzUjWQ"]["Americans won a major victory. We've stopped another disastrous Republican bill. Now we must go forward and guarantee health care to all. https://t.co/TmmqiUEtsj"]["We have led the world in so many ways for so long. But we can't continue to be the only major nation where health care isn't a right. https://t.co/bkvUfYtVgu"]["Stopping Republicans' bill isn't enough. We cannot continue to be the only major nation not to see health care as a right. #HealthCareDebate"]["The Republican bill is opposed by every major heath care organization in America. Our job, right now, is to defeat it. #HealthCareDebate"]["Republicans say they're worried about the deficit. But they'll support a tax plan with $269B in breaks for the top 0.2%. #HealthCareDebate"]["2010 Lindsey Graham wouldn't be supporting Graham-Cassidy. #HealthCareDebate https://t.co/js82wVY2Fl"]["Just a few months ago, Sen. Graham said he'd like to see a health care bill that the American people actually like. #HealthCareDebate https://t.co/fQEWIs6X6g"]["Our job as a humane society is not to throw millions of people off of health care. It's to make health care a right. #HealthCareDebate"]["Republicans say they love choice. Well, 2.5 million women choose Planned Parenthood for their health care. #IStandWithPP #HealthCareDebate"]["No sane person could support the absurd process that this bill has gone through. #HealthCareDebate https://t.co/9PfJJEJRuT"]["You know what is the most popular health insurance program in the country? Medicare! #HealthCareDebate"]["The latest poll has only 20 percent support for Graham-Cassidy. #HealthcareDebate https://t.co/OzS7b8lzKj"]["@BillCassidy Only problem is that by the time you get to page 145 protections for pre-existing conditions are gone. https://t.co/jYlU2C58md"]["One in five adults in America cannot afford their prescriptions while pharma CEOs make millions. That has got to change. #HealthCareDebate"]["Let's not forget that 20 million Americans have health insurance under the Affordable Care Act who previously did not. #HealthCareDebate"]["What the American people want is for us to work together and improve the Affordable Care Act—not destroy it. #HealthCareDebate"]["We can find common ground by taking on the pharmaceutical industry and lowering the costs of prescription drugs. #HealthCareDebate"]["This bill cuts Medicaid, which covers 62% of nursing home residents, by hundreds of billions of dollars. #HealthCareDebate https://t.co/HbONIfTx0v"]["I don't think Medicare for all is an extreme idea. Every other major country on Earth guarantees health care as a right. #HealthCareDebate"]["We can start fixing the Affordable Care Act by creating a public option and lowering the Medicare eligibility age to 55. #HealthCareDebate"]["Republicans talk about choice, but they want to deny millions of women the right to choose Planned Parenthood for care. #HealthCareDebate"]["Every major health organization in this country thinks the Republican plan is a bad idea. #HealthCareDebate"]["It's time to #DebateWithBernie. Tune in now to CNN! https://t.co/fPr3BgSACv"]["The people of Puerto Rico are suffering. We must act immediately to address this humanitarian crisis. https://t.co/LzwLrRg5tI"]["It is cruel and immoral to say to millions of Americans, “We are going to take away the health insurance that keeps you alive.”"]["My thoughts are with the people of Puerto Rico recovering from Hurricane Maria's devastation. We must do everything we can to help rebuild."]["Join me live with @RBReich to talk about defeating Republicans' disastrous health care proposal\nhttps://t.co/Dfw98xPD8C https://t.co/4dpSkQbq0Z"]["Thank you, John. You have the conscience that I wish very much the rest of the Republican leadership had as well. https://t.co/pDfxnjbYx1"]["We’re not going to let Republicans pass their horrific bill that would throw millions of people off health insurance https://t.co/UsYkVUDnVk"]["It's going to be down to one or two votes. Get the word out. Flood the phone lines. We can defeat this bill if we rally the American people. https://t.co/PeuArsqKwG"]["Today is Falls Prevention Awareness Day, and today and everyday, we must focus on the needs of our most vulnerable. https://t.co/5ELBu81Fkp"]["Join me and CREDO Mobile to talk about why we must mobilize against the disastrous Republican \"health care\" bill. https://t.co/vtdsycMeIT"]["This is a disgrace and a disservice to everyone who has worked to address sexual violence. Congress must act to undo this terrible decision. https://t.co/OcuJez0Gff"]["Why is the latest Republican \"health care\" bill so immoral? My health care advisors break it down. https://t.co/Qfy1wfsEWa"]["Tell your friends: Trumpcare is back. We need to educate, organize and fight back https://t.co/M38GoPZRzd"]["We beat back Republicans the last time they tried to throw millions off of health insurance. We damn well are going to beat them back again. https://t.co/HfOdWI79sp"]["The United States must seek partnerships not just between governments, but between peoples. #BernieFP"]["If we are concerned with Iran’s behavior in the region, as I am, the worst possible thing we could do is break the nuclear deal. #BernieFP"]["We must rethink the old Washington mindset that judges “seriousness” according to the willingness to use force.  #BernieFP"]["The war on terror has caused us to undermine our own moral standards regarding torture, indefinite detention and the use of force. #BernieFP"]["We cannot speak with the moral authority the world needs if we do not struggle to achieve the ideal we are holding out for others. #BernieFP"]["Trump’s decision to withdraw from the Paris agreement was incredibly foolish and short-sighted. And it will also hurt our economy. #BernieFP"]["It's reasonably easy to overthrow a government. It's far harder to know the long-term impact that that action will have. #BernieFP"]["Dialogue cannot only take place between ministers and diplomats at the UN. It should be taking place at the grassroots level. #BernieFP"]["I say to Mr. Putin: we will not allow you to undermine American democracy or democracies around the world. #BernieFP"]["When the president spoke at the UN, he did not mention that Russia tried to undermine our democracy. Well, I will: \nhttps://t.co/WkgK8aTKdk"]["When we talk about foreign policy, at the very top of our list of concerns is the need to revitalize American democracy. #BernieFP"]["Sensible foreign policy understands that climate change is a real threat, not a hoax, and that no country can combat it alone. #BernieFP"]["Six people own more wealth than half of the world’s population. There is no justification for that. #BernieFP\nhttps://t.co/WkgK8aTKdk"]["When people in America march as neo-Nazis or white supremacists, we can have no ambiguity in condemning everything they stand for. #BernieFP"]["If we are going to expound the virtues of democracy and justice abroad, we need to practice those values here at home. #BernieFP"]["What Eisenhower said over 50 years ago is even more true today. #BernieFP https://t.co/tqR0MeU47u"]["Foreign policy is about having a defense budget of ~$700 billion when we spend more on defense than the next 12 nations combined. #BernieFP"]["Foreign policy is about 7,000 Americans killed in Iraq and Afghanistan and hundreds of thousands of those countries’ people dying. #BernieFP"]["We need to begin a more vigorous debate about foreign policy. But we also need a broader understanding of what foreign policy is. #BernieFP"]["LIVE NOW: Sen. Sanders delivers the 58th Green Foundation Lecture on foreign policy at Westminster College: https://t.co/WkgK8aTKdk https://t.co/krQK8R4jQl"]["Sen. Sanders lays out his vision of a progressive American foreign policy. Watch live now. #BernieFP https://t.co/WkgK8aTKdk"]["People who can't afford health care don't deserve to die. It's crazy that we even have to say that."]["We cannot roll back the clock on whether women can make decisions about their own bodies. https://t.co/5oCAYXJdiG"]["These flags mark all the abortion restrictions in the Republican repeal of Obamacare. This is a major rollback of women’s rights. https://t.co/kU0yJO2bcY"]["Thank you @jimmykimmel for speaking out against Republicans' attempt to take health care from 30 million Americans. https://t.co/CrW0Vwq4Qg"]["Let's demand that, just for once, Republicans listen to the American people and not their campaign contributors."]["Our job over the next five to ten days is to get the word out about this horrific legislation and do everything we can to defeat it."]["I honestly cannot explain why any Senator would vote for Graham-Cassidy, such a cruel bill. But Republicans almost have the votes."]["It would be beyond comprehension for Republicans to proceed with their health care bill without knowing its impact on the American people. https://t.co/GpEEPhp3ZQ"]["Now is the time to educate, organize and fight back. We won't allow Republicans to destroy our health care. https://t.co/teUYp4rQEx"]["Republicans are once again trying to throw millions of Americans off insurance, make huge cuts to Medicaid and defund Planned Parenthood. https://t.co/wsw63X1yrF"]["A small group of Republicans cannot be allowed to destroy our health care system while keeping the American people in the dark. https://t.co/GbcXgL8MQD"]["Republicans have until Oct. 1 to pass their new Obamacare repeal. We cannot let them destroy our health care. We need to fight back."]["\"There’s a joke we sometimes tell in Canada: What’s a Canadian? An apologetic American with health care.”\nhttps://t.co/F4TUlNH2qZ"]["#MedicareForAll means middle class families would save thousands of dollars. It’s financially smart and the moral thing to do. https://t.co/MPNxzJugz8"]["Our immediate concern is to beat back yet another disastrous Republican proposal to throw millions of people off health insurance."]["Insurance and drug companies and Wall Street will devote a lot of money to defeat #MedicareForAll. But they're on the wrong side of history."]["Medicare is enormously successful, cost-effective and popular. Now is the time to expand and improve it to cover all Americans."]["This racist act must be thoroughly investigated and the perpetrators brought to justice. No one should live in fear in their own community. https://t.co/RgpCnhLTFx"]["What is a curse is your support for throwing 23 million off health insurance. That's the curse and we won't allow you to get away with it."]["No Mr. President, providing health care to every man, woman and child as a right is not a curse, it's exactly what we should be doing. https://t.co/sNeq6YZHDw"][".@RandPaul seems to think a right to health care is akin to slavery. This Canadian doctor thinks otherwise. https://t.co/REhWJitICx"]["“If your #MedicareForAll plan passes in the U.S., you will have a better system than Canada does.” –@docdanielle\nhttps://t.co/9jZt9aKUwu https://t.co/2DFKiYWMlR"]["Why does the United States pay twice as much per capita on health care than any other nation on Earth? https://t.co/9jZt9aKUwu https://t.co/a3Wcz8jnB0"]["Is the Canadian single-payer system popular? Dr. Martin says 94% of Canadians like it: https://t.co/9jZt9aKUwu https://t.co/l4fJZTTrvR"]["LIVE NOW: Talking with Dr. Danielle Martin about the Canadian single-payer system and Medicare for all: https://t.co/9jZt9aKUwu"]["Starting soon: Join me and Dr. Danielle Martin for a Facebook Live conversation about the Canadian single-payer system and Medicare for all. https://t.co/LR6ceo2E98"]["Pharma CEOs are nervous, and they should be. https://t.co/CeXBTVNI8l"]["Join me and Dr. Danielle Martin at 11:30 AM ET to discuss the fight for #MedicareForAll.  Watch here: https://t.co/2UhhD5ROch https://t.co/f6ptJzm2hT"]["With the collapse of the effort to repeal the ACA, it’s time to try a different approach — let’s expand coverage. https://t.co/BqvvCoy7Pr"]["Why do you believe we need #MedicareForAll?"]["Health care must be a right, not a privilege. #MedicareForAll\nhttps://t.co/SbgjEIAVdB"]["Until we put patients over profits, our health care system will not work for ordinary Americans. #MedicareForAll"]["LIVE NOW: Introducing the Medicare for All Act of 2017 https://t.co/SbgjEIAVdB https://t.co/aDwehEuOdq"]["#MedicareForAll https://t.co/Zh5UPibQe3"]["Today at 2 PM: Watch the live stream of the announcement of the Medicare for All Act of 2017 https://t.co/2UhhD5ROch https://t.co/jklRjm57LY"]["Americans should not hesitate about going to a doctor because they do not have enough money. They should not be cutting their pills in half."]["Dr. Ansell is right. A Medicare-for-all system could save lives. https://t.co/wxK8Navizy"]["Thank you @SenatorShaheen. I'm proud that we're in this fight together to make health care a right. https://t.co/M6X77Xrn8Y"]["Now is the time for Congress to stand with the people and take on the special interests that dominate health care. https://t.co/svVVQbABFw"]["I'm very proud to be introducing the Medicare for All Act today, which has 15 co-sponsors in the Senate, a record level of support. https://t.co/26GimpDJoC"]["\"Health is not a consumer good but a universal right, so access to health services cannot be a privilege.\" –Pope Francis"]["Thank you @SenFranken for your support. You're right—we need a health care system that makes health care a right, not a privilege. https://t.co/fUUuybXOVH"]["Thank you @SenatorTomUdall for you dedication to guaranteeing health care to every person in America. Let's go forward together. https://t.co/k24rFqDyIl"]["Thank you @maziehirono for joining the fight. No one should have to worry about not being able to afford the care they need. https://t.co/1G6B0mu0UV"]["Thank you @SenBlumenthal for being with us in the fight to make health care a right. https://t.co/v1I3OiWiCY"]["You're right, @SenatorBaldwin: Health care should be a right. Thank you for fighting for universal health care. https://t.co/cbhUeqrEkq"]["Thank you @SenGillibrand for fighting with us to make sure all Americans can get the health care they need. https://t.co/UHhfuOuR89"]["Thank you @CoryBooker for your support for Medicare for All and efforts in our working group to make this bill stronger. https://t.co/p16K853B4S"]["Let us recommit to ending terrorist violence and conditions that give rise to it: corruption, authoritarianism, inequality and hatred."]["We should also remember how we came together as a people in those days and weeks afterward."]["Today we remember the nearly 3,000 people murdered in the worst terrorist attack in history and the brave first responders who saved lives."]["Thank you @SenWhitehouse for your commitment to making health care a right, not a privilege. #MedicareForAll https://t.co/pmCKz3U9ct https://t.co/TlZtft0XMt"]["It's about time we make health care a right. Join me and my Senate co-sponsors as we introduce Medicare for All.\nhttps://t.co/IgCOABNpuH"]["I will do everything I possibly can to protect the DREAMers from being thrown out of the only country they have ever known. https://t.co/DgeyEOFuAX"]["While AT&amp;T is making record profits of over $1 billion a month, they refuse to negotiate a fair new contract with workers. Unacceptable. https://t.co/N4OniJwA77"]["Our thoughts are with people dealing with Irma’s devastation and those who are in danger. We must use every possible resource to help them."]["This decision does a disservice to those who have worked hard to address sexual violence. Congress must now act to undo it."]["Campus sexual assault is a major problem that must be dealt with. We must do everything possible to make sure our campuses are safe for all."]["Secretary DeVos made an outrageous announcement that she plans to overturn an Obama initiative that protected women.\nhttps://t.co/4ZdQXvA5kT"]["I want to hear your personal health care experiences, and why you think it's time for a Medicare-for-all system.\nhttps://t.co/3ZfBf0GIHb"]["Trump's decision on DACA is the ugliest and most cruel decision ever made by a president of the U.S. in the modern history of this country. https://t.co/3k64uuo2XM"]["America is strongest when we come together and reject xenophobia. Congress must permanently protect Dreamers and reject Trump's bigotry. https://t.co/zn0Mk1rd11"]["We must rebuild the American labor movement and make it easier, not harder, for workers to join unions. https://t.co/VCwBsrg9bR"]["Our job is to create an economy based on human needs, not the greed of the billionaire class. #LaborDay https://t.co/9KH2pl5B2P"]["If Trump ends DACA, Congress must act immediately to restore it."]["Taking legal protections away from 800,000 young people raised in this country is absolutely counter to what we stand for as a nation."]["If Trump decides to end DACA, it will be one of the ugliest and cruelest decisions ever made by a president in our modern history. https://t.co/EXfRAy5azO"]["When I talk about moving towards a universal health care system, it is absolutely imperative that treatment for addiction be a part of that. https://t.co/NsocuJoglX"]["Cutting taxes on huge corporations doesn’t create jobs. It makes CEOs richer and puts a bigger burden on the middle class. #PayUpCorps"]["The opioid abuse epidemic in our country is a public health emergency that must be addressed. #EndOverdose https://t.co/6UYjSLJ85l"]["Thank you @KamalaHarris for your support. Let's make health care a right, not a privilege. https://t.co/hYbxTq8BVH"]["We must understand that substance abuse is a health issue, not a criminal issue. Those who need help must be treated with care and dignity. https://t.co/TIi07Bl7Gv"]["To fix a rigged economy, you demand that the top one percent and large corporations pay their fair share in taxes."]["You don’t fix a rigged economy by making devastating cuts to education, Medicaid, child care and nutrition assistance."]["President Trump, you don’t fix a rigged economy by giving huge tax breaks to the billionaires and corporations that rigged it."]["Our job today: make sure lives are saved in Houston. Our job tomorrow: understand the role that climate change has played in this tragedy."]["Here's what Trump and corporate CEOs don't want you to know: Corporate tax cuts don't create jobs. They go into the pockets of wealthy CEOs. https://t.co/NjfvdKnHVq"]["Please take a moment today to read the historic speech: https://t.co/DGjgsgICel"]["Do you live in a country with universal health care? Please share your experiences as a patient or provider: https://t.co/LIGmvkklKG"]["Thank you to all the courageous individuals who have risked their lives to save others. https://t.co/ht3RlxBTn4"]["Francisco and the thousands of other victims who were subjected to Arpaio's brutality deserve justice. https://t.co/ROWvNnh2jp"]["Today it is Texas, next month it might be Vermont, next year it might be Michigan. We are strongest when we stand together."]["This disaster reminds us that we are all Americans, and that when any community is in trouble all of our resources should be used to help."]["Our thoughts are with people in Houston and throughout Texas who are struggling with the devastating flooding brought by Hurricane Harvey."]["The thousands of people terrorized and brutalized by Arpaio's illegal actions deserve justice. No one in America should live in fear."]["By pardoning Sheriff Arpaio, Trump has again made clear he will use the powers of the presidency to defend racism and discrimination."]["The current federal minimum wage of $7.25 an hour is a starvation wage and must be raised to a living wage. https://t.co/EpY95UEfbO"]["The real crisis we face is not voter fraud. It is voter suppression. https://t.co/LtgZxz5JC7"]["If you cannot win an election based on your ideas, then get the hell out of politics."]["When times were tough, @RepJohnConyers stood up for racial, social and economic justice. This country owes you a deep debt of gratitude."]["We have the most expensive, inefficient and bureaucratic health care system in the world. That has got to change.\nhttps://t.co/qLy2Viggks"]["If Republicans are concerned about combatting racism they must end voter suppression and extreme gerrymandering.\nhttps://t.co/W1xvC2bZFu"]["The problem was never just Steve Bannon. It was and always will be Donald Trump. https://t.co/cTBqwdwZUW"]["It's important for every community in America—including those of us in Congress—to take a hard look at the historical figures we honor."]["In my view, we should not be celebrating individuals who took up arms against the U.S. and defended the horrific institution of slavery."]["Trump said he was going to \"drain the swamp.\" Appointing Steve Mnuchin to be Treasury Secretary was the opposite of draining the swamp. https://t.co/uYSXG5lMMN"]["It is not asking very much to have a president who sees neo-Nazis marching and says, “This is disgusting. This is ugly and I condemn it.\" https://t.co/pR7iH7RwXT"]["It's incredibly painful to see neo-Nazis marching in the US, but even more painful that our president hasn’t forthrightly condemned them."]["The violence in Charlottesville was caused by Neo-Nazis and white supremacists attempting to spread their hateful and racist ideology. https://t.co/eUGliACgwn"]["@realDonaldTrump The violence in Charlottesville was not caused by the \"alt-left,\" (whatever that may be). It was caused by Neo-Nazis and white supremacists."][".@realDonaldTrump, you are embarrassing our country and the millions of Americans who fought and died to defeat Nazism."]["What do you pay when you go to the doctor in Canada?  \"Nothing.\" https://t.co/UP5o2ZseyP"]["We must vigorously #DefendDACA and the young people in that program. We cannot be sweeping up millions and throwing them out of the country."]["Don't let anyone tell you that we need to cut Social Security. What we really need to do is expand it. #SocSec82"]["Our condolences go out to the family of Heather D. Heyer who was killed by a terrorist in Charlottesville...\nhttps://t.co/la1CEe6hyh"]["In America, should working class people have shorter lives because they can't afford the health care they need? https://t.co/4Naksno1uX"]["No, Mr. President. This is a provocative effort by Neo-Nazis to foment racism and hatred and create violence. Call it out for what it is. https://t.co/WibPqkLsLa"]["Now more than ever we must stand together against those who threaten our brothers and sisters."]["While this incident is alarming, it is not surprising. Hate crimes and shows of hostility toward minorities have recently been surging."]["The white nationalist demonstration in #Charlottesville is a reprehensible display of racism and hatred that has no place in our society."]["@StateDept Our job is to work with China and our allies in the region &amp; around the world on a comprehensive diplomatic strategy to address the problem."]["We need serious people at the @StateDept dealing with the issue of North Korea’s development of nuclear weapons &amp; missile capability."]["Trump’s bombastic rhetoric is not appropriate when we are dealing with the possibility of a nuclear war that could kill millions of people. https://t.co/arcCSVuxR3"]["The days of allowing drug makers to gouge American consumers after taking taxpayer money must end. https://t.co/t6ICFGfjXr"]["We desperately need to address the massive inequality that exists in America today."]["This is a rigged economy, designed by the wealthiest people in this country to benefit themselves at the expense of everybody else."]["Trickle-down economics is a fraud and we will not accept it. It is and it has always been an abysmal failure and a fraud. https://t.co/mhLcob7asU"]["Filmmakers, entertainers and even some billionaires understand that a single-payer system is the most effective way to bring down costs. https://t.co/BIYtAIlvdI"]["If it's radical to think that someone working 40 hours a week shouldn't be living in poverty, then yes, count me as a radical."]["The reality is fraud is the business model of both Wall Street and the pharmaceutical industry. It's not the exception. It's the rule. https://t.co/vfqOXJVOtF"]["God didn’t decide on 65 as the Medicare eligibility age. We should make Medicare available for every single person in this country."]["Fracking contributes to the climate crisis, increases earthquake risks and threatens our drinking water. Fracking is not the answer. https://t.co/bGVsBK69WU"]["Our challenge is to see if we have the courage and political will to make health care a right to all. https://t.co/NpIIUqMXpy"]["Vermont's Green Mountain Power continues to lead the way in transforming our energy system away from fossil fuels.\nhttps://t.co/PpiqXucjn8"]["Why doesn't a profit-driven health care system work? This Canadian businessman explains why. https://t.co/VDDaB198Xh"]["Nissan is an all-too-familiar story of how greedy corporations divide and conquer working people. https://t.co/4aydgZHIMz"]["It's never easy to stand together and try to form a union. I applaud the Nissan workers in Mississippi fighting for workers' rights. https://t.co/eLqsOrofoK"]["Wells Fargo has shown that almost a decade after the crash, fraud still appears to be the business model on Wall St. https://t.co/rUyfJhsr9g"]["Here's what happened when a Republican senator challenged a Canadian doctor on their single-payer health care system. https://t.co/eT7t7pGFWR"]["The time is long overdue to start investing in our young people and help them get the jobs and education they need. https://t.co/eXaDmDZL7U"]["The days of allowing drug makers to gouge Americana after taking billions in taxpayer money must end.\nhttps://t.co/gqLsz0oxn1"]["Progressives must get mobilized to protect the Iran Nuclear agreement, just as  we did with the Affordable Care Act. https://t.co/LDJXbjdm0b"]["The days of letting Sanofi and other drugmakers gouge Americans after taking billions in taxpayer money must end. https://t.co/gqLsz0oxn1"]["The president should stop tweeting for awhile and realize that America is the only major country not to guarantee health care to all people. https://t.co/bD4XsOCmMY"]["I do hope that one day soon Republicans finally catch on so we can join the industrialized world and guarantee health care as a right. https://t.co/JAxaVZxAEm"]["People do not deserve to die because they cannot afford health care. I cannot make it any clearer than that. Health care is a human right. https://t.co/11rloNHaEZ"]["Thank you to the folks in the disability communities, the folks in Planned Parenthood, and the millions more who stood up and fought back. https://t.co/1pcUUZJS36"]["This is only the first step. We must now move forward to guarantee health care to all people as a right not a privilege."]["Thank you to everyone across the country who stood up and fought back. Tonight was a victory for the American people."]["No one in the Senate wants to see people die but if Republicans pass their \"health care\" bill 20,000 Americans could die. That's a disgrace."]["How are you improving health care when you throw 16 million people off health insurance and raise premiums 20% every single year?"]["Following Trump's comments that he won't recertify Iran’s compliance with the nuclear agreement I worry new sanctions could endanger it."]["I am strongly supportive of sanctions on Russia and North Korea. However, I worry very much about President Trump’s approach to Iran."]["Today I finally got the chance to quote President Trump on the Senate floor on how Australia's health care system is better than ours. https://t.co/1W3rdVAzB8"]["In America, if you are rich or if you are poor, yes, you are entitled to health care as a human right and not a privilege."]["A vote for ‘skinny repeal’ is a vote to take health insurance from 16 million and drastically increase premiums for everyone else."]["Today I joined @RonWyden on the Senate floor to expose some of the most destructive aspects of the disastrous Republican health care bill. https://t.co/K3iFs4tTcg"]["Mr. Trump, you are on the wrong side of history. Discrimination has no place in our military or society. We must stand with trans people. https://t.co/pG0i5BxtT3"]["Reconciliation's function is to adjust spending and revenue, not enact major social policy changes. Republicans are abusing this process."]["Sorry Mr. President, but if you think the Democrats will be held responsible for the failure of the ACA, you've got another guess coming. https://t.co/8I7HztdOSH"]["Republicans’ health care plans:\n1-Take health insurance from 32 million.\n2-Take insurance from 22 million.\n3-Take insurance from 15 million."]["Trump giving a political speech to kids at the Boy Scout Jamboree was outrageous. https://t.co/fPZRl7G2RD"]["Advocates with disabilities from @nationaladapt protested cuts to Medicaid today in the Hart Senate Building. This takes real courage. https://t.co/UIvnj5PVXy"]["This is America, we are not going to pass legislation that allows thousands of people to die. https://t.co/oMQpOiwkFw"]["This is a disgrace. It is insulting. And it is undemocratic. https://t.co/eCgmAsvojg"]["I really don't want to be on the phone telling any parent that their child might die because of legislation that Republicans might pass. https://t.co/Xz2xaPrlgp"]["I hope Republicans understand the consequences of their vote today. When you take 22 million off health insurance, many thousand could die."]["Religious leaders have a message for Republicans who are still trying to take health care away from millions of people. https://t.co/qbm68qguZj"]["It's time to stop worrying about Trump's absurd tweets and start worrying about the dangerous legislation he and Republicans are pushing."]["The federal minimum wage has not gone up in eight years.  Nobody who works 40 hours a week should live in poverty. #FightFor15 https://t.co/tbzMSa4Fjq"]["It is beyond comprehension that we, as a nation, have not focused attention on the fact that millions of young people can't find work. https://t.co/8pPQfmO86T"]["Unbelievably, Republicans aren't content with this disgraceful situation. They want to make it even worse. https://t.co/InyhVROH6h"]["Today on the podcast: I talk to @algore about his new film and the fight to combat climate change. https://t.co/T1OuMlOXz0"]["The parliamentarian’s decision today proves once again that the process Republicans have undertaken to repeal the ACA is a disaster."][".@algore continues to educate people around the world on the planetary crisis of climate change. We thank him so much for that. https://t.co/HPionbyjzQ"]["We all know that politics is ugly, but Trump Jr.'s meeting with a Russian lawyer is most certainly not politics as usual. https://t.co/jp6oqpZADx"]["It is beyond my comprehension that we have a president who wants millions of people to suffer just so he can score some political points. https://t.co/T1R9iG7jsX"]["There is a very important issue that almost no one talks about and that is the issue of youth unemployment. https://t.co/rXm9lKEyz3"]["Thanks to @algore for not only calling attention to the crisis of climate change, but also for rallying people around the solutions."][".@algore: “So long as big money has an influence… they can force states legislatures to hold back renewables.\"\nhttps://t.co/QXYwqCEo8X https://t.co/HUiBtPaNJI"][".@AlGore: \"Solar jobs are now growing 17 times faster in the U.S. than all other jobs.”\nhttps://t.co/QXYwqCEo8X https://t.co/h7i2hJzEhd"]["\"The carbon providers have taken the playbook from the tobacco companies.” @AlGore explains the war on clean energy:\nhttps://t.co/QXYwqCEo8X"]["Live now: @AlGore sits down with Bernie to talk climate change.\nhttps://t.co/QXYwqCEo8X"]["Looking forward to talking with Al Gore on Facebook Live at 9:20 AM this morning. Tune in: https://t.co/2UhhD5ROch https://t.co/3VukATKvQy"]["Tomorrow on The Bernie Sanders Show: Former Vice President @algore. Tune into https://t.co/TIdQMUk3ML at 9:20 AM ET to watch. https://t.co/wchSrjRYAE"]["This bill is beyond pathetic. No member of the United States Senate should vote for it. https://t.co/2OGtfy2MD4"]["Today on the podcast: I speak with former Sec. of Defense William Perry about the North Korea threat. https://t.co/KSgstsVXKc"]["I want to thank the millions of people around this country who stood up and fought back against the pathetic Republican health care bill. https://t.co/jLPDoGOw5H"]["Apply to be a press intern in Sen. Sanders’ office this fall. https://t.co/qJucF3am0A"]["The American people want to proceed to health care for all, not see 22 million Americans thrown off the health care they currently have."]["I'm delighted to see the disastrous Republican health care plan won't succeed – a victory for the millions who stood up and fought back."]["As Fox News' Chris Wallace says, getting to the bottom of Trump's campaign ties to Russia should not be a Democrat versus Republican issue. https://t.co/n9zwBTZuJ4"]["Older Americans should be able to remain in their homes and communities. They deserve to live with dignity and with a sense of security. https://t.co/0nDk55WEjy"]["Remember: the change we are fighting for is not radical. On issue after issue, the majority of the American people are on our side."]["In my view, we need to guarantee health care to everyone a right, not throw millions of Americans off of health insurance."]["I hope Trump supporters in rural states understand that what he said during the campaign about standing up for working people was a lie. https://t.co/HLZhnurgEY"]["The latest Republican \"health care\" bill is out. Big surprise: it's still a disaster.\nhttps://t.co/yiCcPHy848"]["After getting diagnosed with stage 3 testicular cancer, the Medicaid expansion in West Virginia saved Rusty Williams' life. https://t.co/OKzwEqwjVE"]["My Republican colleagues just love to talk about choice, but somehow they want to tell every woman in the U.S.what to do with their bodies. https://t.co/Q1lGHnQao1"]["Make no mistake about it, thousands of Americans every year will die unnecessarily if the Republican legislation is passed."]["The Republican bill is fatally flawed and no small tweak here or there will undo the massive damage that it to the country."]["The revised Republican \"health care\" plan is an absolute disaster that will inflict severe economic pain on millions of Americans."]["At this moment when our democratic institutions are in peril, ending #netneutrality protections would be devastating. https://t.co/DVyHiKHEFR"]["@AjitPaiFCC It's time to fight @AjitPaiFCC's attempt to auction off the internet to the highest corporate bidder. Comment here: https://t.co/jgWOdzFRLr"]["The telecom industry and their friends, like @AjitPaiFCC, want to allow corporations like Comcast, AT&amp;T &amp; Verizon to control content online."]["Net neutrality means that everyone has the same access to the same information — that the internet remains free from corporate control."]["Yes. We need to improve Obamacare. But the way to do that is not to throw 22 million people off of insurance."]["Should we kick 235,900 Nevadans off of Medicaid so that Sheldon Adelson can get a $48 million dollar tax break every year? https://t.co/tUhCArR1ZZ"]["Republicans’ “health care” plan is nothing more than a massive transfer of wealth from working families to the very rich. https://t.co/6DW0AMZnP1"]["Bernie is live now talking about why we must continue to fight the Republican health care bill. https://t.co/hlwwwsgjYo https://t.co/9YKkMBdLHA"]["Republicans’ health care bill would cause devastating harm to millions of people. We will not allow that to happen.\nhttps://t.co/ab8BQGV0fZ"]["28 million Americans still don't have health care. What's Republicans' answer? Throw 22 million more Americans off health insurance."]["Republicans have constituents who depend on Medicaid to survive. To throw those people off of their health care is shameful."]["Life is not just fancy fundraisers. I urge my Republican colleagues: Listen to the health care stories of people like Georganne Koehler. https://t.co/BfXTLpjYkg"]["The only way to confront the serious challenges we face as a country is to put forward a bold progressive agenda. https://t.co/IL9Dl4WR4X"]["This is not Bernie Sanders talking. Listen to what George W. Bush's former ethics lawyer has to say about Trump Jr.'s meeting. https://t.co/Rk25t3qxwE"]["\"To constantly wake up to the news that someone is trying to take away my health care, it's just devastating.\" - Jasmine Jennings https://t.co/EW4R8vZohc"]["It is unconscionable that millions of people in the world’s richest country are one diagnosis or car accident away from financial disaster."]