["#TaxReform is helping Tennesseans — today Walmart said it will boost minimum wage to $11, hand out bonuses up to $1,000 for hourly workers https://t.co/eDTmHFfn2r"]["Senate confirms Tommy Parker to serve as a U.S. District Judge for the Western District of Tennessee. I joined Sen. Corker in recommending Mr. Parker because of his broad experience and his reputation among his peers as one of Memphis’ finest attorneys. https://t.co/WBdZnwcA2o"]["I enjoyed talking with a group of future farmers at the @FarmBureau’s Annual Convention in Nashville on Monday. President Trump is right to be focused on the needs of rural Tennessee and Tennessee farmers. https://t.co/ojV5b2ffT0"]["VIDEO: Our health committee this week held its third hearing on opioids —our biggest public health epidemic in Tennessee and across this country. https://t.co/Ngiint8vgv"]["By a vote of 97-0, the U.S. Senate confirmed Chip Campbell to serve as a U.S. District Judge for the Middle District of Tennessee. His confirmation will help bring relief to a crowded docket. https://t.co/sfhUbYsz4h"]["Thanks to Sam Quinones, author of “Dreamland,” for giving his insight based on his extensive research &amp; writing. https://t.co/NDtpIaOdVM"]["We are eager to hear your testimony and your solutions."]["And, second, if stronger communities are the ultimate solution to this crisis, as you suggest often in your book, what can a central government in Washington do that actually helps?"]["First, when 100 million Americans live with pain, 25 million of them with chronic or severe pain, is finding the so-called holy grail of medicine, a non-addictive pain medicine, not the obvious antidote to the opioid epidemic?"]["Rather than spend more time establishing the crisis, I want to focus today on what we do about it. Here are two things I am hoping to learn from you:"]["The governor told me that in our state of 6.6 million people, there were 7.6 million opioid prescriptions written in 2016."]["Yesterday I dropped by a meeting at the Tennessee Governor’s Residence in Nashville. The heads of all our state’s institutions involved in training doctors were planning how to discourage the over-prescription of opioids."]["This epidemic kills more Americans every day than car accidents. In each of our states we are reminded almost every day of the crisis."]["The challenge this crisis presents has captured the attention of every member of this committee. Your research and writing have been acclaimed for their depth and breadth."]["Mr. Quinones, it is unusual to have a single witness at our hearings. But this is an unusual topic, one you quote Washington State research professor Gary Franklin as calling the “worst man-made epidemic in history.”"]["Today we turn our attention again to the opioid crisis—the nation’s number one public health challenge. Our witness is Sam Quinones, the author of “Dreamland, The True Tale of America’s Opiate Epidemic.”"]["President Trump is absolutely right to be focused on the needs of rural Tennessee and Tennessee farmers: https://t.co/McPIr37VPC"]["Welcome to Nashville, Mr. President. #AFBF18 https://t.co/MjMUb0glVC"]["Congratulations to the @Titans on tonight’s playoff win! #TitanUp https://t.co/bo4iJNuXHq"]["Alexander: Proposed health insurance rule could lower costs for up to 11 million self-employed or small business employees https://t.co/iY8l3sEqdX"]["Check out today’s @memphisnews  story on how the #TaxReform bill is benefitting Tennesseans: Citing #TaxReform, Regions bank – a bank in Memphis – is raising employees’ pay, increasing charitable donations, &amp; increasing its capital expenditures. https://t.co/H5V7XldRCn"]["Senate confirms four of President Trump’s nominees — including Jeff Smith of Tennessee — to TVA Board of Directors: https://t.co/ymxo0mAPKu"]["READ my op-ed in today’s @Tennessean about how #TaxReform will benefit Tennesseans: https://t.co/D3pTC2x2nb"]["This is a very big day for Nashville, coming from the back to the front of the line in such an intense national competition in just one year. It is more evidence that Nashville is an attractive place to live &amp; work &amp; a real compliment to the city &amp; its leadership. #NashvilleMLS https://t.co/3CutEOciOi"]["Headed to president’s desk: Bill to reduce taxes for most Tennessee families https://t.co/svdOKdtIhJ"]["Alexander, Collins statement on bills to lower health insurance premiums: https://t.co/JOTbKZSkMx"]["My statement on Senate passage of the tax bill: https://t.co/qVMLKvbQR8"]["Great hearing from Middle Tennesseans today and talking with them about how I’m working to pass a legislative package that would lower health care premiums by 18 percent in 2019 and pass tax cuts that will mean more money in the pockets of folks across the state. https://t.co/VGstlkN629"]["Bill Giannini was a strong leader in his community and for our state, a good Republican and a good friend. Honey and I send our prayers to his family at this very difficult time."]["Eli Richardson – President Trump’s nominee to serve as a U.S. District Judge for the Middle District of Tennessee – will be a tremendous asset to the federal bench. Tennessee is fortunate to have such a well-qualified nominee who is willing to serve. https://t.co/DCWBmrpMrw"]["Joining @Hallerin on @987news at 4:15 PM ET to talk about how #TaxReform will help Tennesseans keep more of their paycheck in their pockets. Listen here: https://t.co/acTWFLuhua"]["Alexander at HELP’s 3rd oversight hearing on 21st Century #Cures: Early intervention in mental health is critical. https://t.co/ncoM7gJOv8"]["Thank you #KeatonJones for sharing your story and bringing awareness to the serious problem of bullying in our schools. There is no place for that, and as Tennesseans, we must work together to prevent bullying and harassment of all our students."]["A very good Christmas present for men and women across this country would be for this Congress, before the end of the month, to pass what we call the Alexander-Murray and Collins-Nelson legislation which will lower premiums by 18% https://t.co/2AdUK9jIAv"]["A law is not worth the paper it’s printed on if it is not implemented properly. I intend to ensure #Cures is implemented properly. https://t.co/f9QKqG0x5G"]["Alexander-Murray would fund cost-sharing reduction payments for two years, give states a fast-track to freedom from Obamacare, and allow anyone at all to buy a lower-cost catastrophic “copper” healthcare plan https://t.co/zIdwSlxPS1"]["You can watch his speech here: https://t.co/ABXP4SxvMz https://t.co/omDLaZrIqG"]["NEWS: About 3:05 PM ET Sen. Alexander will head to the Senate floor to speak on legislation that means lower premiums for 9 million Americans in the individual market who get no government subsidies, less debt, new flexibility for states, and new catastrophic health plans."]["Op-ed in the Washington Examiner today on how Congress can lower health insurance premiums for 9 million Americans who get no government subsidies https://t.co/ylEwMzL0bs"]["Great to have @NIHDirector &amp; @SGottliebFDA back in the HELP committee today to update us on their work to implement the 21st Century #Cures Act, which has the potential to affect virtually every American family by taking advantage of breathtaking advances in biomedical research. https://t.co/qR0uNj9OpH"]["It is going to be difficult to cover everything today, but I look forward to hearing about the progress being made to unleash medical innovation and bring new drugs and devices to patients."]["It is not an overstatement to say that the 21st Century Cures Act has the potential to affect virtually every American family by taking advantage of breathtaking advances in biomedical research."]["Today we are hearing from Dr. Collins and Dr. Gottlieb on the provisions related to biomedical research."]["I intend to ensure #Cures is implemented properly, and this committee began our oversight hearings on Cures with a hearing on the Electronic Health Records provisions and, we will continue our oversight with another hearing on the mental health provisions next Wednesday."]["It is especially appropriate to be having this hearing today because it marks the one-year anniversary of the Senate passing #Cures."]["When Congress passed the 21st Century Cures Act, we hoped to unleash medical innovation and give Americans more access to life-changing treatments and cures, so more Americans could experience medical miracles."]["Three days later, he began to see. His eyesight eventually improved enough to get his driver’s license back – and enough to be an effective advocate for more support for regenerative medicine, which we included in the 21st Century Cures Act."]["Doug found a regenerative medicine clinical trial in Florida, where doctors took cells out of the bone marrow in his hip, spun them in a centrifuge, and then injected those into his eye."]["The culprit was a rare form of Macular Degeneration. Doug moved to Nashville, where his doctor at the Vanderbilt Eye Institute told him that while there were no cures, Doug could search online for a clinical trial."]["In 2007, Doug Oliver, a computer programmer, began to have trouble seeing and, after a near accident, had his driver’s license taken away and was declared legally blind."]["The Senate health committee last week continued its work to address the opioid crisis. At the hearing, we heard from witnesses on what is happening at the state and local levels. Follow along as we continue to our efforts to find solutions at #HELPFightsOpioids. https://t.co/kBM306zKHB"]["The Senate took a critical step toward reducing taxes, and it will help Tennessee family incomes. #TaxReform https://t.co/0AHWyzT5aD"]["The federal government is an important partner in the fight against the opioid epidemic, but we must look at our state partners to learn from and support their innovative approaches. #HELPFightsOpioids https://t.co/cPIOWRPKVC"]["This is what #TaxReform means for Tennessee: https://t.co/ZHiB8iBnQs"]["As Commissioner of Labor Statistics, Dr. Beach, you will oversee the Bureau that is responsible for collecting and publishing the data that tells us how our economy is doing, including the unemployment rate and changes in consumer prices."]["We are also holding a confirmation hearing on Scott Mugno for Assistant Secretary of Labor for Occupational Safety and Health and Dr. William Beach for Commissioner of Labor Statistics at the Department of Labor."]["Mr. Collett has worked has a special education teacher and is currently the Director of Special Education Outcomes at the @CCSSO"]["If confirmed, Mr. Marcus, I hope you will also recognize the difference between the law, which is binding, and guidance, which is not."]["The Office for Civil Rights has the important responsibility of ensuring that Title IX and other civil rights laws, and the protections they provide to all students, are fully enforced."]["This morning we are holding a confirmation hearing on Ken Marcus for Assistant Secretary for Civil Rights and Johnny Collett for Assistant Secretary for Special Education and Rehabilitative Services at the Department of Education."]["I support the Senate tax reform bill because it is good for Tennesseans’ family incomes in two ways: First, middle-income tax cuts leave more money in the pockets of Tennesseans; Second, taking the handcuffs off job creators will grow the economy, create jobs and raise wages."]["Alexander-Murray allows anyone to buy a lower-cost copper plan, which will help draw healthier people into the markets. Source: CBO  https://t.co/pVhIVUcKkR"]["Alexander-Murray provides states with permanent new flexibility from Obamacare regulations. All of those changes here: https://t.co/gFzQ1cxsUv"]["Ending CSR payments will also increase the deficit by $194 BILLION over 10 years as taxpayers spend more on Obamacare subsidies. https://t.co/dNrgWrErfu https://t.co/MCnn6cCY3z"]["Ending CSR payments will increase premiums 25% by 2020, per CBO report in August. Alexander-Murray includes 2 years of CSR payments and should prevent those increases."]["I’m eager to hear how these programs are run in your states and if there are things that can be done at the federal level to help improve coordination and data-sharing at the state level. #HELPFightsOpioids"]["Because each state is facing different challenges in responding to the crisis, it is important that states have flexibility in how to use the money."]["What innovative approaches are states taking to address the distinct challenges they face?"]["How are different state departments – medical, public health, and judicial systems – working together in a collaborative way to address this crisis?"]["As we talk about this crisis from a state perspective, I hope to hear from our witnesses:"]["We hope to hold additional hearings starting early next year as we build on our work from last Congress – including passing the 21st Century Cures Act, which appropriated $1 billion over two years for state grants, and CARA, which created new programs to address the crisis."]["Today we will hear from those on the front lines: our witnesses represent states, communities and providers and will share what they are doing and what, if any, changes are needed to federal law to fight the crisis. #HELPFightsOpioids"]["Last month, this committee held the first in a series of hearings this Congress on the opioid crisis – a crisis that is tearing our communities apart, tearing families apart, &amp; posing an enormous challenge to health care providers and law enforcement officials. #HELPFightsOpioids"]["As Dr. Abubaker has said, “People from all walks of life…have had problems. It has nothing to do with where you live, or where you came from. You could be the president. You could be the son of a doctor.”"]["Adam developed an addiction and overdosed four years later on a mixture of drugs including heroin I am grateful Dr. Abubaker is here to tell his family’s heartbreaking story and share the work he has done to educate other doctors about prescribing opioids."]["The toll of the opioid crisis that is ravaging our country is staggering. One of our witnesses, Dr. Abubaker, has personally experienced the heartbreak that opioid addiction causes. His son, Adam, as a 17 year old, was prescribed 90 Vicodin pills for a minor shoulder injury."]["Alex Azar’s broad experience is an obvious asset in leading HHS. https://t.co/T4bLLVHotv https://t.co/ttQBqE0Iqf"]["The Alexander-Murray bill and the tax bill are completely separate and, according to budget rules, cannot be considered at the same time."]["The CBO said in August that not paying the cost-sharing reduction payments would cause a 25 percent increase in premiums by 2020. The Alexander-Murray bill pays cost-sharing reduction payments for two years, which should prevent that 25 percent increase."][".@AHIPCoverage -- \"Congratulations to Alex Azar on his nomination to serve as Secretary of Health &amp; Human Services. He has the experience &amp; expertise to combine the best from the private sector with the best of our public programs to make health care work for every American.\""]["Chairing a hearing on Alex Azar, President Trump’s excellent nominee to head the Department of Health and Human Services. https://t.co/uSV0U31VOq"][".@Commpharmacy -- \"We congratulate Alex Azar on his nomination to be the next HHS Secretary. His background in the pharmaceutical industry means he brings an understanding of supply chain issues and players that will be helpful to him in this role.\""][".@AAMCtoday -- \"The President has made a smart choice; Alex [Azar] is a tested leader in the hard-fought battles to advance health care within the Department and across the country.\" https://t.co/3g2406Ub2K"][".@FedAmerHospital -- \"We welcome and support the nomination of Alex Azar for HHS Secretary. His years of experience in government service and the health care sector makes him uniquely qualified to confront the challenges facing patients, families, and caregivers.\""]["The opioid crisis that is ravaging the U.S. is a priority for the president &amp; for every member of this committee. We are having a hearing on the state perspective of the opioid crisis tomorrow. You will be coordinating a dept.-wide effort to help combat the opioid abuse crisis."]["As HHS Secretary, there are other steps you can take to lower premiums and stabilize the market, such as approving states’ innovation waivers, which could increase access to lower cost plans and incentivize younger and healthier individuals to purchase insurance."]["Alexander-Murray has so much in it that it appeals to so many Democrats and Independents that it is hard to imagine not passing something that prevents a 25 percent increase in premiums by 2020 and offers states flexibility to further lower rates."]["Yesterday, President Trump said he supported the Alexander-Murray agreement becoming law by the end of the year."]["Senator Murray and I worked together on an agreement, co-sponsored by 11 other Republicans and 11 other Democrats, which the Congressional Budget Office says will prevent a 25 percent price increase in premiums by 2020"]["I see your broad experience as one of your obvious assets. Experience in health care should not disqualify you from leading a health care agency."]["With all of these perspectives, you should need no on the job training to lead this Department and take advantage of this exciting time in biomedical research to speed safe drugs through the system to patients more rapidly."]["And you know the private sector. You spent a decade in a leadership position at one of the country’s major pharmaceutical companies, so you know the system of how drugs get from the manufacturer to patients."]["You know the executive branch, having been HHS General Counsel for four years and Deputy Secretary for two years."]["You served in the judicial branch as a law clerk for Justice Antonin Scalia."]["I believe you are an excellent nominee to do this job. You have been confirmed by the Senate twice."]["Mr. Azar, if confirmed to lead the Dept. of HHS, you will be running a $1.11 trillion organization, which almost equals the total of the 12 Appropriations bills that Congress passes each year to fund everything from national parks to national defense to national laboratories."]["Today’s hearing is on Alex Azar, the nominee to serve as the Secretary of Health and Human Services."]["We want to make sure we do whatever we can to make sure it never happens again."]["The response was almost as incredible as the fire itself, and the overwhelming impression that I get from the community is how tough and resilient they are. A lot of heartbreak came out of the wildfires: deaths and destruction, but, today, everybody is focused on the future."]["It’s been a year since the devastating wildfires swept across Gatlinburg and Sevier County – a heartbreaking story for all of us who know and love the Great Smoky Mountains and the people who live there."]["I was encouraged when the president told Republican senators today that he supports the Alexander-Murray bill &amp; the Collins-Nelson reinsurance proposal—both of which will reduce health insurance premiums. With his support, both proposals should become law by the end of the year."]["As I’ve said time and again, I am committed to seeing ESSA implemented as it was written. I believe Secretary DeVos is doing just that—following the law in approval of state plans while encouraging states to use maximum flexibility afforded to them."]["25 years after the first #FAFSA and four years after the first hearing, it is time to bring this discussion to a result."]["Senator Bennet and I are now completing work on a bill that would reduce the #FAFSA to as few as 15 and no more than 25 questions, depending on how you answer questions about your family."]["My central focus will be to make it simpler &amp; easier for students to apply for federal aid and to pay their loans back, &amp; to cut through the jungle of red tape that federal law and regulations imposes so college administrations can spend their time and money instead for students."]["Third, this complexity wastes time and money that could be better spent helping students choose the right college or major, or develop financial literacy skills so they can understand the impacts of taking out student loans."]["I know in Tennessee, where two years of post-secondary education is now free, the complexity of the #FAFSA is the single biggest impediment to more students taking advantage of Tennessee Promise."]["Second, this complexity frustrates the goal of the Pell Grant, which is to help low-income students attend college, because it discourages them from applying for aid."]["First, nearly 20 million students fill out this form every year. This means if you receive a federal grant or a loan as a freshman, you have to fill it out again to continue to receive aid for your sophomore year and beyond."]["Let’s take a moment to talk about why simplifying this form is important:"]["If there is that much consensus on how to make it easier for nearly 20 million families to apply for federal aid, we asked, why don’t we actually do it?"]["Nearly four years ago, at a hearing before this committee, an unusual thing happened: four witnesses from diverse backgrounds agreed that almost all of the 108 questions on the Free Application for Federal Student Aid, or the #FAFSA, are unnecessary."]["I commend @ENERGY, @TNEnvironment and the Oak Ridge community for their hard work in making this new facility a reality."]["This new facility — Outfall 200 — will help reduce the amount of mercury getting into waterways and make it possible for cleanup work to begin at Y-12. https://t.co/o4RyAD89B7"]["Exciting day in Oak Ridge — breaking ground on a new mercury treatment facility, which will help ensure safer and cleaner water for Tennessee. https://t.co/WpVYK2HGkw"]["Check out my op-ed in @NRO encouraging Congress to end the quarter-century-old wind production tax credit now – not two years from now. https://t.co/UEh4kIo4EF"]["My statement on FDA’s regenerative medicine guidance #CURES https://t.co/yMskT9PTP1"]["I was glad to host Alex Azar in my office this morning and was greatly impressed with his knowledge and experience. As a former Deputy Secretary of HHS and private sector executive, Alex Azar has the qualifications to get results. https://t.co/QY1jJVSdZG"]["Preston Rutledge is nominated for Assistant Sec of Labor for the Employee Benefits Security Administration to help administer and enforce Title I of ERISA."]["Kate O’Scannlain, nominee for Solicitor of the Department of Labor, will be involved in every area of the department’s work."]["Brigadier General Mitchell Zais, nominee for the important position of Deputy Education Secretary, has an excellent and deep background for the position."]["I look forward to hearing how community level partnerships and engagement can lead to healthier individuals, higher quality health care, and lower health care costs."]["Dr. Adam’s motto as Surgeon General is “better health through better partnerships,” and I hope this committee can be one partner going forward."]["This is important because the United States spends about $2.6 trillion treating chronic diseases. This accounts for more than 84 percent of our health care costs."]["It makes sense for that to be his focus, because there is a remarkable consensus that wellness – lifestyle changes like eating healthier and quitting smoking – can prevent serious illness and reduce health care costs."]["At his confirmation hearing, he said, “I would also make wellness and community and employer engagement a centerpiece of my agenda if confirmed… Our health starts in the communities where we live, learn, work, play, and go to school.”"]["When Dr. Adams and I met before his confirmation hearing, I said to him that if, as Surgeon General, he threw himself at one important problem, he could have a real impact on the lives of millions of Americans."]["Today, we are holding a hearing with the Surgeon General, Dr. Jerome Adams, to hear his priorities on how to encourage people to lead healthier lives."]["Here’s how Alexander-Murray gives states more flexibility from Obamacare mandates: https://t.co/3UvvlKvCvq"]["The Senate Agriculture Committee has advanced the TN Wilderness Act, which would preserve Tennessee’s heritage for future generations. I hope it can be considered by the full Senate as soon as possible.  https://t.co/i4NlZ8cHL7 https://t.co/Cbgz0pNqN4"]["Today’s hearing is truly a hearing, where I intend to do more listening than talking, and I appreciate our panel taking the time to discuss this promising technology today."]["Part of our job on this committee is to learn about new technologies, to lead discussions with experts about the implications of these scientific advancements and to ensure that the NIH and others have the proper authority to oversee and conduct research."]["While CRISPR and other gene editing technologies could transform human health, it is not hard to see how we can quickly get into societal and ethical issues."]["Today, we are looking at this remarkable way to edit genes that has potential to treat devastating diseases, including those that currently have limited treatments or cures."]["Eric Lander, a leading geneticist and mathematician who was integral to the Human Genome Project, said, “it’s hard to recall a revolution that has swept biology more swiftly than CRISPR.”"]["Good to talk with @lipscomb students studying political communications. https://t.co/KzSla2gwxe"]["We’re trying to take the handcuffs off Tennessee job creators so they can hire more employees and raise family incomes. https://t.co/yKZQ6nEl3j"]["Enjoyed talking with TN chapter of @ABCNational in Nashville about how the US Senate is working to overturn harmful Obama-era regulations and keep more money in Tennesseans pockets. https://t.co/NKMU3dpK2D"]["As a former Deputy Secretary of Health and Human Services and private sector executive, Alex Azar has the qualifications and experience to get results. The Senate HELP committee will promptly schedule a hearing on his nomination."]["There are more than 500,000 brave men and women in TN who have worn the uniform of our Armed Services. We owe them more than we could repay. https://t.co/prgnXHPtOY"]["Doug Overbey will be an excellent U.S. Attorney for East Tennessee: https://t.co/YjAzC6dqbM"]["VIDEO: Healthcare is on the minds of the American people. We have a bipartisan proposal introduced by 12 Republicans, 12 Dems, to lower premiums, avoid chaos, take a step in the right direction. Let's see if we can help the American people in that way. https://t.co/d2c3IhM5hz"]["Why Republicans like Alexander-Murray: lower premiums, less tax dollars for Obamacare subsidies, less federal debt, more flexibility for states, lower-premium catastrophic plans"]["Happening now. You can watch here: https://t.co/hd92Ej3trk https://t.co/yOSkcTZFBz"]["TUNE IN to the Senate floor around 4:45 pm ET -- talking with @SenatorRounds about the bipartisan Alexander-Murray proposal to stabilize premiums and access to insurance in individual health insurance markets in 2018 and 2019. https://t.co/RPu4RodLfb"]["Walden, Alexander, and Burr request leadership delay signing of NDAA conference report https://t.co/LwmeFqytGH"]["Alexander statement on House passage of the Save Local Business Act: https://t.co/6uPCvnI9zk"]["@ORNL I thank them for 25 yrs of hard work &amp; dedication &amp; look fwd to their continued success answering some of the hardest scientific questions"]["@ORNL I am very proud of the men and women from all over the world who have made this facility a success."][".@ORNL Leadership Computing Facility is a national leader in evolution of supercomputing https://t.co/0wx3GDwe3B"]["USDA invests more than $28 million in Tennessee rural broadband, which will help local economies grow."]["Such heartbreaking news reports on this shooting in a Texas church. Praying for the victims and those responding."][".@usmayors  call the Alexander-Murray plan to stabilize the individual market a “leap forward” https://t.co/DRB5jQ6hRX"]["Bipar govs: Alexander-Murray will help achieve goals of stabilizing markets, more affordable &amp; available insurance https://t.co/pCzvTfkyS3"]["Another reason to visit the #Smokies -- Newly installed viewfinders allow the colorblind to see the autumn colors https://t.co/D76m2HVFWk"][".@USChamber urges Congress to take action on Alexander-Murray https://t.co/K1Be5RU68O"][".@BPC_Bipartisan leaders praise Alexander-Murray work “to address the real near-term challenges” https://t.co/NSScOwvpe2"]["200+ groups support Alexander-Murray short-term legislation to stabilize premiums, protect access to insurance https://t.co/tEgx0ykifs"]["Alexander-Murray will help the Tennesseans who are facing the highest premium increases in the country out of https://t.co/ruJbinEI5E states https://t.co/2R4PaOCj0A"]["Alexander-Murray helps the Tennesseans who are really getting hammered – those without subsidies. https://t.co/OyUnR42meR"]["Tennesseans buying insurance without subsidies this year have highest premium increase in the nation out of https://t.co/ruJbinWjue states https://t.co/83HAFNLDGG"]["Senator Norris has been a champion for federalism and for the separation of powers. He will be a tremendous asset to the federal bench. https://t.co/6eOA1TvkjF"]["Under Alexander-Murray, these Tennesseans w/o subsidies would get money back next year https://t.co/Iq4NmHiWYQ https://t.co/8FItq1ztQk"]["As open enrollment begins, Tennesseans buying insurance w/o subsidies this year have highest premium increase in the nation."]["TUNE-IN: I’m introducing Mark Norris at his confirmation hearing this morning at 10 AM EST. You can watch here: https://t.co/qU98oyE92Q"]["The law set clear deadlines for the administration to meet, and today I would like to hear how implementation of these provisions is going."]["For doctors and hospitals to get the information they need to treat patients. (2/2)"]["The goal of the health IT provisions in #Cures was to make it easier for patients to access their health records and (1/2)"]["This committee held six hearings in 2015 looking at ways to improve electronic health records and formed a bipartisan working group"]["The more we looked at these systems, the more we realized our nation’s electronic health records systems were in a ditch"]["We learned that in order for most areas of #Cures to succeed, it was essential that electronic health records systems work properly."]["This is the first hearing on the implementation of #Cures, which this committee worked so hard on."]["You can watch here: https://t.co/wJacmV8HIF"]["TODAY @ 2:30 PM: HELP hearing on “Implementation of the 21st Century #Cures Act: Achieving the Promise of Health Information Technology”"]["Alexander: Senate honors nation's nuclear weapons workers: https://t.co/F28aO44hMd"]["My statement on the white nationalist rallies in Murfreesboro and Shelbyville: https://t.co/mTN0wDvsi0"]["\"CBO affirmed that our cost-sharing proposal benefits taxpayers and low-income policyholders, not insurers.\" https://t.co/iUuKU16p8t"]["Great to be at the Governor’s Conference in Gatlinburg with @SenBobCorker and @BillHaslam talking economic development. #GovCon2017 https://t.co/wnwhB1oMCG"]["“President Trump has asked for a bipartisan short-term solution … so 18 million Americans won’t be hurt.\" https://t.co/3iPA7iGloM"]["TODAY in @WSJ: Op-ed w @SenatorRounds: Our health-care bill “actually could make conservative ideas law” https://t.co/jiPpifRIOQ"]["POTUS is leading on this issue. Nearly 3 out of 4 of the drug overdoses in TN are related to the opioid crisis https://t.co/Wde1gKh60i"]["Alexander: President Trump is providing important leadership in combatting the opioid crisis https://t.co/RSRz0V12Yi"]["We should listen to HELP #FreeSpeech panel &amp; remember Howard Baker’s admonition, that the other fellow may be right. https://t.co/S2eIC6JFGD"]["Full press release on @GOPHELP #FreeSpeech hearing here: https://t.co/oLSrnTyKYw https://t.co/uy71CfXxrz"]["Universities should be places where people of different views speak, audiences listen, and contrasting viewpoints are encouraged"]["Happening NOW on #FreeSpeech – LIVE senate education committee hearing on free speech on college campuses. https://t.co/EXvVyMcVMR"]["CBO finds Alexander-Murray will put rebates in Americans’ wallets, won’t bailout insurance companies https://t.co/9NhFpztLEb"]["Not only does Alexander-Murray not cost anything, it saves the taxpayer money: $3.8 billion in deficit reduction https://t.co/kXmygghLAZ"]["VIDEO: Here is why the Alexander-Murray health care bill is so important for Tennesseans https://t.co/bQVz0VRzcZ"]["CBO: “insurers in almost all areas of the country would be required to issue some form of rebate to individuals and the federal government” https://t.co/qha2DIH2lk"]["CBO on Alexander-Murray: “the legislation would reduce the deficit by $3.8 billion over the 2018-2027 period relative to CBO’s baseline”"]["CBO: Alexander-Murray will provide savings; benefit taxpayers and low-income Americans, not insurers https://t.co/eVPUj9nk5p"]["Under Alexander-Murray, states can get waivers approved in 45 days...so Massachusetts could have had its waiver approved by now https://t.co/dCfi4tBb4N"]["Alexander-Murray would allow Iowa waiver and OK, Minn, NH waivers. Haven't gotten that flex in 8 yrs of debate. https://t.co/ua3tkWsxoe"]["Iowa’s decision is further evidence that ACA is too restrictive to allow states to help people who need to buy insurance. https://t.co/4skgmoyO61"]["VIDEO: The president was right to suggest that we need a short-term agreement so people won't be hurt. https://t.co/sPEU5FnK9L"]["VIDEO: The president says there should be no bailout of insurance companies. I agree 100%. https://t.co/piZIN8bWbQ"]["Alexander votes to take first step toward tax reform: https://t.co/5crwdtilhI"]["12 Republican cosponsors: Rounds, Graham, McCain, Cassidy, Collins, Ernst, Murkowski, Grassley, Isakson, Burr, Corker, Alexander https://t.co/RUoXpnxGF4"]["24 senators cosponsor Alexander-Murray short-term legislation to stabilize premiums, access to insurance https://t.co/MVgBJBt9ow"]["The Alexander-Murray agreement has strong language to do that, and I will work with the president to see if we can make it even stronger."]["He and I absolutely agree that CSRs should benefit consumers and not insurance companies."]["The president called again today, and I appreciate his leadership on health care."]["Going to the Senate floor at 4:15 PM ET to discuss agreement on short-term health care stabilization plan. Watch: https://t.co/ruhmJwDOwV"]["I hope our witnesses here will help us understand the drug delivery system &amp; how their role in the system affects the price patients pay"]["... who then pick up those drugs at 60,000 drug stores, or receive them from doctors or hospitals, and from online pharmacies. (2/2)"]["More than 4.4 billion prescriptions are written for drugs each year for Americans ... (1/2)"]["The prescription drug delivery system – how a drug gets from the manufacturer to the patient – is complicated."]["We also need to make sure that any action we may take does not jeopardize innovation so patients can continue to see breakthroughs"]["We have all heard from patients in our states that the costs of new prescription drugs are often too much for them to afford."]["My goal for these hearings is to, in a bipartisan way, learn what goes into the price patients pay when picking up their prescriptions."]["These hearings came at the request of a bipartisan group of senators led by Sen. Cassidy and Sen. Franken https://t.co/22dKd42YT3"]["Today we are holding a hearing, the second in a series on prescription drug costs"]["Thank you, Tennessee Farmers! #NationalFarmersDay https://t.co/cQblSAEVvb"]["Holding a Senate health committee hearing today with @NIHDirector, @SGottliebFDA on the federal response to the opioid crisis. https://t.co/MIXjVBpGu0"]["I look forward to hearing how the administration is moving this important work forward."]["Congress passed CARA &amp; #21stCenturyCures in a bipar way to provide funding &amp; update pgrms to assist states &amp; help combat the opioid crisis."]["And about what policies FDA has put in place to make sure that the opioid alternatives submitted to FDA are prioritized appropriately (2/2)"]["I want to hear today about the public-private partnership that NIH is leading (1/2)"]["The most ambitious goal of #21stCenturyCures was to drive research discoveries predicted by @NIHDirector including non-addictive painkillers"]["I hope today’s panel of witnesses can give this committee an update on the federal response to the crisis – what’s working &amp; what needs work"]["Last yr., 1,631 Tennesseans died of drug overdose--12% more than the yr. before--mostly due to an increase in overdoses of synthetic opioids"]["The amount of opioids prescribed in the U.S. in 2015 was enough for every American to be medicated around the clock for three weeks"]["The opioid crisis is tearing our communities &amp; families apart, &amp; posing an enormous challenge to health care providers and law enforcement"]["I want to thank each &amp; every one of the 129 veterans on this trip for their service in World War II, the Korean or the Vietnam War #flight25 https://t.co/KOtWfrwST8"]["I was honored to welcome @honorair Knoxville’s 25th flight and celebrate the organization’s 10th anniversary today. #flight25 https://t.co/jxfA4Yc6i3"]["Saddened to hear that Tennessean Sonny Melton was killed in the Las Vegas attack. Praying for his wife, Heather, and his family. https://t.co/qfshJn91ck"]["Our prayers are with Las Vegas and all of those affected by last night's devastating attack."]["Happy #PublicLandsDay! Let's work to leave future generations a more beautiful nation to enjoy. https://t.co/pQiZ4HP1Bz"]["I was delighted to host @IvankaTrump for lunch yesterday afternoon – and to show her the Tennessee memorabilia in my DC office. https://t.co/rt8AlXBIC4"]["This week, the Senate restored the NLRB to the role of a neutral umpire after years of playing the role of advocate. https://t.co/UjSKQ8GeDe"]["Statement on @SenBobCorker announcement: https://t.co/oq3dSeAJ8N"]["Such tragic news in Antioch today at Burnette Chapel Church of Christ. Praying for the victims, grateful for the first responders."]["At @EPB_Chattanooga to announce a new battery project that is a real-world result of federal energy research. #LivingLabCHA https://t.co/7GccTNzYEA"]["Got the chance to play a little piano this past weekend at the 17th Rhythm &amp; Roots festival in Bristol. https://t.co/LMJLcuy8jW"]["Alexander votes to provide military more equipment and training, expand military families’ access to health care: https://t.co/o6naatZdY6"]["#GBO #VFL https://t.co/7Pbgx0Ekuj"]["The Amateurs perform at the Rhythm and Roots festival in Bristol -- the birthplace of country music. https://t.co/lRUtvOW3eT"]["Practicing for tonight's performance at Rhythm and Roots in Bristol -- the birthplace of country music. https://t.co/gOKFxHGuXE"]["is flexibility for states in the approval of coverage, choices, and prices for health insurance. 2/2"]["I want a result, and a part of a result that limits premium increases in 2018 and begins to lower premiums in the future ... 1/2"]["to help limit premium increases for 18 mill Americans in 2018 &amp; begin lowering them after that, &amp; to prevent insurers fr leaving markets 2/2"]["Our goal is to see if we can come to a consensus by early next week that Congress can pass by the end of the month … 1/2 https://t.co/boAu9zWu5P"]["Pete Domenici was a spectacular US Senator not just for New Mexico but for the country. My statement on his passing: https://t.co/0455WwypHi"]["Was an honor greeting 25 World War II, Korean &amp; Vietnam War veterans traveling with Honor Flight of Middle TN at the World War II Memorial. https://t.co/X4dUoBmR1e"]["Had a nice time visiting with eighth-grade students from Franklin’s @BGAwildcats last week. https://t.co/0AI8ypKvvJ"]["David Jolley, nominated for U.S. Marshal for Eastern District of TN, “will serve East Tennesseans with integrity” https://t.co/cqwCxPs43k"]["Any health insurance compromise for '18 that includes cost-sharing payments must include real flexibility for states https://t.co/TFSZMYrfBV"]["ACA waiver offers states as many options on benefit design as a menu with only 1 item or a Dr. Seuss book titled “Oh, The Place You’ll Go”"]["At today’s hearing on state flexibility, we’ll hear from experts who work in / w states as they develop plans to stabilize individual market"]["There is a danger that if we do not act – Americans in some counties literally will have no insurance to buy"]["Objective of hearings -- what Congress &amp; President can do between now &amp; the end of the month to help limit premium increases in 2018"]["Focus of today’s hearing: How Congress can give states more flexibility in approving health insurance policies"]["Great meeting with Chip Campbell Jr. &amp; talking about his nomination for U.S. District Court Judge for the Middle District of Tennessee. https://t.co/6lOCbfe92J"]["VIDEO: Sen. Alexander talks about the health committee’s work to help 18 million in the individual market https://t.co/oyCmOyjeYK"]["Talked with @hughhewitt this morning about committee’s work to help 18 million in the individual market next year https://t.co/ax580qD5DZ"]["From consuming 9% of the gross domestic product in 1980, about 40 years ago, to nearly 18% in 2015 and a predicted 20% in 2025. (2/2)"]["We should have been spending more time on the fundamental problems w/ the American health care system that have caused it to grow (1/2)"]["We've been stuck in this partisan stalemate on health insurance with most of the argument about 6 percent of insured Americans"]["Yesterday – We had a focused hearing on the individual market, where only 6% percent of the insured get their insurance."]["Our goal is to get a result in a very short period of time on a 2018 stabilization package that is small, bipartisan and balanced."]["This committee is holding hearings this week and next week on stabilizing premiums and access to insurance for 18 million Americans"]["We are holding our second of four hearings … We have 5 governors with us this morning."]["The bottom line today is that 18 million Americans need our help, and I hope we can stay focused on getting a result."]["My goal is to get a result on a small, bipartisan and balanced stabilization bill."]["This step is not so small to 18 million Americans—those who do not get their health insurance from the government or on the job https://t.co/C2hqDA2GgH"]["This hearing is about taking a small step on a big issue which has been locked in partisan political stalemate for 7 years: health insurance"]["We have 5 state insurance commissioners ... to give us their testimony on how to help the 18 million Americans in the individual market."]["We are holding our first hearing on stabilizing premiums &amp; ensuring access to insurance in the individual health insurance market for 2018."]["The fire departments in Gibson County &amp; Atoka have received grants to increase recruitment. Grateful for our first responders."]["Approval of Tennessee education plan \"puts Tennesseans back in the driver’s seat for helping Tennessee students achieve\" https://t.co/buY6cTa7IJ"]["On Friday, I hiked Rainbow Falls Trail at @GreatSmokyNPS w @SecretaryZinke &amp; park volunteers to mark 101st bday of the @NatlParkService. https://t.co/g70CJhKxYF"]["Praying for those affected by Harvey and proud of Tennesseans heading to Texas to help: \n\nhttps://t.co/doaPaLRPw7"]["Happy Birthday, @SenBobCorker! https://t.co/uSiW6fqj7I"]["In Nashville talking w/ TN restaurant owners about how Republican majority is stopping Washington threat to TN’s 15,000 franchise owners https://t.co/5GGR8PMmcQ"]["Alexander, Murray: 5 governors to testify at Sept. 7 hearing on stabilizing premiums in the individual market https://t.co/SDctGGOJhh"]["Alexander, Murray announce first two September bipartisan health care hearings https://t.co/yos7Chs5SL"]["Enjoyed watching #Eclipse2017 with my grandkids in Nashville. #MusicCityEclipse https://t.co/g7CxVFFsd6"]["If you can’t make it outside to see the #Eclipse2017, check out this live stream from NASA: https://t.co/M9eoW0mwDu"]["Planning on going out to watch the eclipse in Tennessee on Monday? Here is some helpful information: https://t.co/1nrGeIR7Wx"]["Chairman Alexander statement on President Trump’s decision to make August cost sharing reduction payments https://t.co/CAw4iMK9kH https://t.co/VmDQkGic1s"]["Good to see employer expanding in Union City: “Tyson to add 300 jobs in $80 million expansion in Tennessee.” https://t.co/ms4Ca5tJik"]["We are all Americans and we should act like it."]["The deplorable hatred and violence in Charlottesville today defaces our most cherished values and traditions."][".@SenateMajLdr is the most effective Republican leader to work with to do that. (2/2)"]["If the President wants results in the nation’s most important institution for creating consensus on tough issues... (1/2)"]["FDA user fee agreements will speed up FDA’s review of new prescription, generic &amp; biosimilar drugs, and new medical devices #DeliveringCures https://t.co/vPbz7lflOI"]["Last week, the Senate passed—by a vote of 94 to 1—the Food and Drug Administration (FDA) user fee agreements #DeliveringCures https://t.co/7qOkm00lw1"]["Good news for Nashville: “Nashville-to-London flight to launch in May of 2018” https://t.co/lc7yFDljA5"]["FDA User Fee Agreements will speed up FDA’s review of new prescription, generic &amp; biosimilar drugs, and new medical devices #DeliveringCures https://t.co/DJ6fDvvD4f"]["Patients, researchers, &amp; makers of life-saving drugs &amp; medical devices support FDA user fee bill #DeliveringCures https://t.co/eh4EXtvEqi"]["Alexander statement on unanimous Senate confirmation of Peter Oppenheim: https://t.co/WHjnpbJiou"]["The FDA user fee agreements will help move safe drugs and medical devices more quickly into patients’ and doctors’ hands. #DeliveringCures https://t.co/mn1oksfV6f"]["VIDEO: Senator Alexander yesterday greeted 136 Vietnam War veterans on an @honorair trip to DC. https://t.co/Z2oLQBiSmS"]["Tennessee class of 2018 high school students, @TNPromise is now open for applications! Apply here: https://t.co/TafNpRoL01 https://t.co/epHdwJqsNn"]["Alexander on today’s vote: “The first step was last year’s passage of 21st Century Cures ... this is the next step” https://t.co/LaN3YHShSa"]["Senate votes overwhelmingly for on-time reauthorization of the FDA user fee agreements: 94 to 1. https://t.co/qoc8xwcBm0"]["An honor yesterday to greet a group of 136 Vietnam War veterans from Tennessee who were visiting DC. https://t.co/f1uKZZT5c9"]["\"The Senate has the opportunity now to reverse the trend of an activist National Labor Relations Board ...\" https://t.co/1XNDzyeXaT"]["Via @dcexaminer | Sen. Lamar Alexander: Fill out the NLRB and restore its neutrality https://t.co/YBcRYjMqOg"]["I look forward to the Senate voting this week to begin righting the NLRB. Marvin Kaplan cloture vote today at 11. https://t.co/ZjuHNj4Tdh"]["RELEASE: Chairman Alexander and Ranking Member Murray announce health care committee hearings https://t.co/FwiWsO2yXL"]["And the fire in this case is the individual insurance market. (2/2)"]["... in up to half our states may find themselves with zero options for buying health insurance on the exchanges in 2018. (2/2)"]["The reason for these hearings is that unless Congress acts by September 27, millions of Americans with government subsidies... (1/2)"]["Committee staff will begin this week working with all committee members to prepare for these hearings and discussions."]["We will hear from state insurance commissioners, patients, governors, health care experts and insurance companies."]["... so that Americans will be able to buy insurance at affordable prices in the year 2018. (2/2)"]["HELP will hold hearings the wk of Sept 4 on actions Congress should take to stabilize &amp; strengthen the individual health insurance market"]["I was glad to meet and talk with Tennesseans participating in Girls Nation and Boys Nation. https://t.co/NjTbLI6l1E"]["On Rep. Duncan’s retirement: I'm proud Jimmy Duncan has served TN’s 2nd district &amp; been my rep. for nearly 3 decades https://t.co/rfuxT1Srb7"]["My statement on today's health care vote: https://t.co/w3eKwbXKwj"]["My statement on today’s vote: https://t.co/pFG762xsoO"]["Alexander statement on Senate’s vote to begin debate on health care bill: https://t.co/QBkZJOciz5"]["Phil Roe is a good friend, and Honey and I send our thoughts and prayers to Phil and his family for a swift recovery."]["Good news for Bledsoe County: Textile Corporation announcement is “biggest investment ever in Bledsoe County\" https://t.co/Dyg8CPmlNl"]["My statement on Senator McCain: https://t.co/oMFXEpOLAL"]["Alexander: Committee approves #NLRB nominees who can “help return NLRB to neutral umpire it ought to be\" https://t.co/YWDdMZYjA7"]["I look forward to voting for these nominees and seeing a full board."]["After years of playing the role of advocate, the board should be restored to the role of neutral umpire."]["My hope is that these nominees will help restore some balance to the labor board."]["Veterans and their families in Knoxville area can receive help at “one-stop shop” event today from 9 am to 2 pm: https://t.co/3GS8mknmmD"]["Chairman Alexander statement on Senate’s work on individual health insurance market: https://t.co/1bwZZETfKd"]["Today we remember the Chattanooga #FallenFive. Our thoughts and prayers are with their families, loved ones, and the Chattanooga community."]["Enjoyed touring the Alex Haley House and Museum, my late friend's boyhood home in Henning, Tenn. https://t.co/IZPhegNy0Q"]["Good to be in Lauderdale County with @repdavidkustoff today to celebrate the Ripley Tomato Festival! https://t.co/xEPGML0Sbr"]["“Bill Hagerty is one of President Trump’s best nominations.” https://t.co/B6LlKgYJJg"]["Alexander cosponsors bipartisan bill to provide 4th graders with free national park entry – https://t.co/5uAlw3R5Bd #EveryKidOutdoors"]["VIDEO: Alexander on Senate floor: Bill Hagerty is one of POTUS’ best nominations. https://t.co/aKue5yi9UF"]["Alexander on revisions to draft Senate health care bill: I’ll stay focused on how it affects Tennesseans: https://t.co/ezuOhle7MK"]["Alexander votes to fund military construction and veterans’ programs https://t.co/m0WJsfjAK8"]["After years of playing the role of advocate, the board should be restored to the role of neutral umpire."]["My hope is that these nominees will help restore some balance to the labor board."]["We need a full board. And I’m certainly not the only one of us who thinks so."]["It’s important to get the Dept. of Labor properly staffed, and to ensure the open seats on the National Labor Relations Board are filled"]["Today’s hearing is an important one for our nation’s workers and employers."]["In today’s Cleveland Daily Banner: “America’s ‘good’ gets Alexander’s focus”: https://t.co/J6MLfdQAdJ"]["Happy Independence Day! https://t.co/1lhb3CUuFA"]["Alexander: Army Corps of Engineers is the federal government’s most popular agency https://t.co/XLkbLIpQGJ"]["U.S. Army Corps of Engineers touches the lives of almost every American…we need to spend more, not less on water infrastructure https://t.co/wxVnkp6BVg"]["We’re here today to review the president’s fiscal year 2018 budget request for the U.S. Army Corps of Engineers &amp; the Bureau of Reclamation"]["At 2:30 PM: Alexander chairs Energy and Water Development Approps hearing on Army Corps of Engineers &amp; Bureau of Reclamation 2018 budget"]["More information about disaster loans can be found here: https://t.co/qJ89gBO7Ha https://t.co/UO8GLfn52S"][".@SBAgov has disaster loans available in Bedford, Franklin, Giles, Lincoln, Marshall &amp; Moore counties if you were affected by storms on 4/22"]["Alexander: Trump administration takes next step toward stopping regulation of Tennessee farmers’ mud puddles https://t.co/DTGyIxAPbY"]["Middle TN news: @NorthCentralTel awarded a $1.7 million federal grant to further broadband access in Trousdale Co., Tennessee."]["Sen. Alexander statement on CBO’s report on the draft Senate health care bill: https://t.co/iMDZQGkFZ4"]["Sen. Alexander statement on president's approval of federal disaster relief: https://t.co/ZhfWvilKVP"]["VIDEO: Senator Alexander talks about discussion draft of the Senate health care bill https://t.co/XP9FoG9k4N"]["Senator Alexander on discussion draft of Senate health care bill  https://t.co/g3vho1DUkY"]["Great talking with so many Tennesseans at Tennessee Tuesday with @SenBobCorker! https://t.co/rkbKaElucB"]["Sen. Alexander is working to make sure “the fed. gov't doesn’t mess up the way songs are co-written in Nashville.” https://t.co/GNlIEGXe53"]["READ in the Tennessean about Senator Alexander’s work to make sure Nashville songwriters get paid fair market value https://t.co/lmhBWsXVus"]["Sen Alexander talks about the co-writing of a Lee Brice song, “Falling Apart Together,” &amp; about outdated consent decrees hurting songwriters https://t.co/r1Zc3MvzIr"]["Sen. Alexander statement on Sen. Corker’s bill to impose tougher sanctions on Iran, Russia; Senate passed 98-2 today https://t.co/nd3kR3De2p"]["Great talking with students who are passionate about the great outdoors at the National Park Trust event last night. https://t.co/aSq19FTwzN"]["Alexander: $6.5 billion uranium processing facility at Oak Ridge is staying on track and on budget https://t.co/vwmaY6Pu8V"]["GOP senators intro bill to reverse NLRB rule that forces employees to vote before they know what's going on https://t.co/0rrT6FiLH2"]["TN members of Congress urge president to approve federal disaster assistance for TN counties affected by May storms: https://t.co/oeNcbTqBR5"]["Thank you to the Capitol Police officers who keep watch and help keep us safe today and every day. https://t.co/lvpamGxsrl"]["Statement on the shooting this morning: https://t.co/ghh2SDNgZt"]["It is important that we work together to conduct this fact-finding in a bipartisan way."]["This is a discussion that affects the well-being of every American family."]["Our focus today is on what happens to the cost of the drug after it is approved by the FDA."]["Over the years this committee has produced important laws to reduce the cost of drugs before they are approved by the FDA"]["Americans want to know who pays for prescription drugs and where that money goes."]["The purpose of this first hearing is to see if we can better understand this complex subject and agree on some basic facts. https://t.co/qBiVRGSkPv"]["Alexander: Mike Dunavant is a well-qualified &amp; dedicated prosecutor who will serve West Tennesseans with integrity: https://t.co/2BDDpzPEGV"]["Happy birthday to President @GeorgeHWBush! https://t.co/90NX5pKVMs"]["Sign-up for Sen. Alexander’s newsletter -- Latest from Lamar – &amp; find out what he is working on in TN &amp; DC: https://t.co/MCveDIW1nz"]["Acosta right to withdraw #jointemployer guidance &amp; restore wage &amp; hour investigators' focus on worker protections. https://t.co/frbRpeT3xP"]["Alexander votes to give Dept. of Veterans Affairs more authority to make employees accountable https://t.co/Tb1doXonMi"]["Alexander: Sec. Acosta begins rollback of Obama-era assault on franchise model, restores focus to worker protections https://t.co/Sv2WAWKHEl"]["Alexander: Interim private storage could be the quickest, least expensive way to break nuclear waste stalemate https://t.co/YuTUphDeYZ"]["At  2:30 PM | Alexander chairs Energy &amp; Water Approps. subcommittee hearing on Nuclear Regulatory Commission budget https://t.co/nlPm0bNvVE"]["Alexander: Francis Collins continuing to head NIH is \"good news for the country,\" one of POTUS \"best appointments\" https://t.co/sGvRrlQ0eY"]["“This is Bill Hoffman, a hero who helped free a continent and end a war.” #DDay https://t.co/AVTU0AruVH"]["This #DDay: Read about the late Bill Hoffman of Memphis who stormed the cliffs at Pointe du Hoc https://t.co/Cbay4YTAvA"]["On this day in 1796, Tennessee became the 16th state admitted to the union. Happy Birthday, Tennessee! https://t.co/pvXmtoWv33"]["The U.S. Senate owes patients and their families a prompt, bipartisan reauthorization of the FDA user fee agreements to fund the FDA. https://t.co/T5BVcMfp59"]["VIDEO: Senator Alexander on the importance of an on-time reauthorization of the FDA User Fee Agreements. https://t.co/NTAAheuHOb"]["All ages are welcome at Tennessee Tuesday! Click here to join Sen. Alexander &amp; Sen. Corker at their weekly breakfast https://t.co/wyMtDsM3EB https://t.co/uXoqdL29bS"]["On @Medium | Sen. Alexander explains what the bipartisan FDA User Fee Agreements are and why they’re important https://t.co/erx0ul7VNK"]["Congratulations to the @PredsNHL— heading to their first Stanley Cup Finals! #StandWithUs https://t.co/Az1w4vfA0m"]["Thanks to @SecretaryPerry for coming to Tennessee to visit @ORNL and @y12nsc to see all of the great work being done here! https://t.co/C980UMLVRt"]["What are the consequences if there is a delay in the reauthorization of the FDA user fee agreements? Find out here: https://t.co/aviE2aiGsp"]["Via @Medium | Q &amp; A with Senator Alexander on FDA User Fee Agreements https://t.co/IBBhEtaR1v"]["Great to welcome students from Jasper Middle School (Jasper) &amp; T.A. Dugger Jr High School (Elizabethton) to Washington D.C. this week! https://t.co/xkjfTe4scL"]["Alexander introduced Nashvillian Bill Hagerty, nominee for Ambassador to Japan, at his hearing before Senate Foreign Relations Committee https://t.co/gGDU9QubLe"]["A delay in reauthorizing these agreements would delay the reviews of drugs and devices submitted after April 1"]["If we do not move to pass these agreements in late July, the FDA will be forced to send layoff notices to more than 5,000 FDA employees"]["The FDA Reauthorization Act, sponsored by me &amp; Senator Murray, reauthorizes the four user fee agreements that expire at the end of September"]["The FDA is the agency responsible for making sure the promise of the 21st Century Cures Act actually reaches America’s patients"]["Now the next step ... is to fund the Food and Drug Administration."]["21st Century Cures became law last year and provided $4.8 billion for medical research, on top of the support Congress already provides"]["This was legislation to spur research and development of cures, devices and treatments for some of the most deadly illnesses and diseases"]["Just five months back , 94 members of this body voted for a bill called the 21st Century Cures Act."]["Happening now. Watch here: https://t.co/ABXP4SxvMz https://t.co/I2lhqamIn9"]["WATCH: Around 3:00 p.m. ET Senator Alexander will speak on the floor about the bipartisan FDA user fee agreements https://t.co/ABXP4SxvMz"]["\"Our committee took an important step in the timely reauthorization of the user fee agreements that fund the FDA \" https://t.co/qFpAnupRIH"]["Alexander: Senate Health Committee advances “critical” bipartisan FDA user fee agreements by vote of 21-2 https://t.co/HtbMGfT2gd"]["A delay in reauthorizing the user fees would threaten biomedical industry jobs and America’s global leadership in biomedical innovation"]["FDA will be forced to begin sending layoff notices to more than 5,000 employees"]["Here is the problem with missing the goal of having this to the President’s desk before August recess:"]["We need to make sure we can get user fee reauthorization done by Aug recess—meaning we need to report this legislation to Senate floor today"]["The FDA Reauthorization Act, sponsored by me &amp; Senator Murray, reauthorizes the four user fee agreements that expire at the end of September"]["We have followed the same sort of bipartisan process on how we continue funding the FDA"]["The year before that, we worked in a bipartisan way to fix No Child Left Behind."]["Happening now – Senate health committee hearing on bipartisan FDA user fee agreements"]["Sen. Alexander statement on FBI Director James Comey https://t.co/BTJAudzF77"]["I look forward to the Senate approving Dr. Gottlieb’s confirmation."]["Dr. Gottlieb has broad support from an array of patient, industry and research organizations."]["Dr. Gottlieb has impressive qualifications from nearly every perspective."]["Dr. Gottlieb is the right person to lead the FDA in its vital mission and move the agency forward"]["HAPPENING NOW: Senator Alexander on the Senate floor discussing Dr. Gottlieb’s nomination to head the FDA. https://t.co/ABXP4SxvMz"]["Congrats to the @PredsNHL on advancing to the Western Conference finals! https://t.co/5763Z4e9vK"]["READ: Sen. Alexander on goals for Senate health care bill after House passage of #AHCA https://t.co/jXP5ONLntk https://t.co/mMguv4mx7I"]["Chairman Alexander statement on goals for Senate health care bill https://t.co/mxNmBxOHtQ https://t.co/qe5WLv9wQf"]["Charter schools enable teachers to succeed by giving them the freedom to use their firsthand knowledge. #CharterSchoolsWeek"]["Charter schools enable students to learn and succeed. #CharterSchoolsWeek"]["Charter schools enable parents to help their children get a real opportunity, choose better schools for them to attend."]["Charter schools are serving over 3.1 million students. Over 6 percent of all public school students in the USA now attend charters."]["I am here to celebrate 18th annual National #CharterSchoolsWeek and thank students, parents, teachers, &amp; leaders of charter schools"]["Tune in now: Senator Alexander to speak about #CharterSchoolsWeek https://t.co/ABXP4SxvMz"]["Charters are on the forefront of helping to create new opportunities for more than 3 million public school children https://t.co/Hl7odZTNl1 https://t.co/SkGvlSBV1H"]["Alexander: New Labor Sec. “can now begin work to create a better environment to help more American workers succeed” https://t.co/jymF3NVFep"]["Congrats to Alexander Acosta who was just confirmed by the Senate 60 – 38 to serve as Labor Secretary."]["Sen. Alexander welcomed Challenger the Bald Eagle – a symbol of the spirit of freedom and sovereignty of the United States – to Washington. https://t.co/pCotNKfiwy"]["I look forward to Mr. Acosta’s confirmation today."]["We are fortunate that someone of Mr. Acosta’s intelligence and experience is willing to serve as our United States Secretary of Labor."]["Supporters of Acosta’s nomination include @USChamber, @NRFnews , @NFIB, @ShopFloorNAM, @Franchising411, &amp; @AmeriBev."]["Mr. Acosta understands that a good-paying job is critical to helping workers realize the American dream for themselves &amp; for their families."]["Mr. Acosta has excellent credentials and is well-qualified for the position."]["WATCH: Sen. Alexander heading to Senate floor soon to discuss nomination of Acosta to serve as Labor Secretary. https://t.co/ABXP4SxvMz"]["Dr. Gottlieb strikes me as the kind of nominee that is easy to support."]["He has served as a practicing physician and hospitalist as well as a former FDA Deputy Commissioner, and he is also a cancer survivor."]["He is supported by former FDA commissioners Robert Califf, Margaret Hamburg and Mark McClellan."]["I believe throughout this process Dr. Gottlieb has demonstrated that he is the right person to lead the FDA on its vital mission."]["Dr. Gottlieb has been through an exhaustive vetting process."]["WATCH HERE: @GOPHELP committee executive session on Dr. Gottlieb’s nomination to head FDA https://t.co/glFkMyZDoc"]["Happening soon: @GOPHELP committee executive session on Dr. Gottlieb’s nomination to head FDA https://t.co/glFkMyZDoc"]["HELP Committee sends 4 bipartisan public health bills to Senate floor https://t.co/JJykNmXUDh"]["READ: “Today our committee continues its tradition of working together to get results for American families.” https://t.co/dvegsPfYIE"]["Ahead this week for @GOPHELP chairman: Senate to confirm Labor nominee Acosta, committee to approve Gottlieb for FDA. https://t.co/YBcMCU0R69"]["\"If you want to see the Smokies, you’ll drive the Foothills Parkway b/c it’s the only road that gives you such a spectacular view...\" https://t.co/8MgUSb9JYC"]["Sen. Alexander was at the groundbreaking ceremony for the final project to complete the \"missing link\" of the NPS Foothills Parkway https://t.co/gX95WCH9kY"]["I enjoyed touring @BCMBristol yesterday and learning more about the 1927 Bristol Sessions! https://t.co/wSW5MaH1hl"]["Great to speak to Elizabethton Kiwanis Club today and meet with Unaka HS Key Club members who serve the community. https://t.co/T12B5XjGUf"]["This week is National Park Week! It’s a great time to celebrate what’s right with America. #FindYourPark https://t.co/NUngMHs5lS"]["Senate, Health leaders release discussion draft of FDA user fees reauthorization: https://t.co/2FQQ0G2PrY"]["Alexander: Secretary Price is taking an important step to begin stabilizing collapsing individual insurance market https://t.co/cUxrwMuIGp"]["“Next week is National Park Week. It’s a great time to celebrate what’s right with America…” #FindYourPark https://t.co/2oJ0rWnKTf"]["“Next week is National Park Week. It’s a great time to celebrate what’s right with America…” #FindYourPark https://t.co/HgHldonjuo"]["READ:Sen. Alexander writes “National Park Week: A great time to celebrate what’s right with America.” #FindYourPark https://t.co/nOvofFIpUO"]["Senator Alexander is working to make sure President Polk’s home in Columbia, TN, is included in the National Park System. https://t.co/aHUsYgZXGx"]["WATCH: Sen. Alexander was in Columbia for Mule Day and to tour President James K. Polk’s home https://t.co/FgjIcBmM3H"]["Alexander on selection of Tennessean Mark Green as Secretary of the Army: https://t.co/oQ6yQ5k7rL"]["\"Judge Gorsuch is enormously well-qualified ... He will be a superior new member of the United States Supreme Court.” https://t.co/gGKudHEtwJ"]["Sen. Alexander’s statement on U.S. missile strike in Syria. https://t.co/Zd28vxgTpZ https://t.co/yO3vSrXVnQ"]["READ Sen. Alexander’s full op-ed in the @Tennessean here: https://t.co/xWm3Sa1wOJ https://t.co/2XxtCx8Alb"]["\"The nomination of Judge #Gorsuch should be decided — as Supreme Court nominations have always been for 230 years — by a majority vote.\""]["In the @Tennessean – Sen. Alexander writes “#Gorsuch nomination should be decided by simple majority” https://t.co/SIa1ABEkKq"]["Alexander: Scott Gottlieb has impressive qualifications and is the right person to lead FDA and its “vital mission” https://t.co/jepE6j18gS"]["Sen. Alexander visited with Dr. Gottlieb and his family before heading to confirmation hearing on Gottlieb’s nomination to head FDA. https://t.co/eHwuXj3q2I"]["Alexander to Dr. Gottlieb: “You come here today with impressive qualifications from nearly every perspective.”"]["\"The FDA affects nearly every single American and regulates about a quarter of all consumer spending in the United States\""]["#Cures “will drive forward medical research – extraordinary medical miracles that have the potential to affect every American family”"]["CSPAN providing coverage of today's confirmation hearing here: https://t.co/s0bmPexXrC https://t.co/U02N3Eb0ch"]["Tune it at 10:00 a.m. ET as Sen. Alexander chairs hearing on nomination of Dr. Scott Gottlieb to lead FDA https://t.co/8eOGvOkTnX"]["“and move them to the floor in a timely manner so patients and the agency and the industry have some certainty.” 2/2"]["“I look forward to working with Senator Murray and our other members to approve these agreements here in committee … \" 1/2"]["“After reviewing the recommendations from industry and the FDA, I believe these are good agreements for patients.”"]["… a loss of 1/3 of the staff at FDA’s device center, and a slowdown of ongoing medical research. (2/2)"]["Witnesses at 1st UFA hearing said failure to reauthorize on time could mean a delay in getting cancer drugs to patients, (1/2)"]["At 1st UFA hearing, HELP Committee heard from FDA experts that timely reauthorization is integral to helping patients &amp; implementing #Cures"]["“FDA is the agency responsible for making sure that patients benefit from the promising research driven by the 21st Century Cures Act.”"]["Sen. Alexander enjoyed speaking this morning to high school students in one of @MontgomeryBell's American history classes. https://t.co/2cpOzQFh0U"]["Sen. Alexander was glad to see Columbia City Mayor Dickey at Saturday's Mule Day celebration! https://t.co/E6WmJKqdje"]["Senate committee has approved Alexander bill to take next step to including Polk Home in Natl Park System: https://t.co/9HTYKYgcur"]["Sen. Alexander visited President James K. Polk's home yesterday and met with curator Tom Price. https://t.co/kIaHuYE2BI"]["First stop of Mule Day festivities! Sen. Alexander enjoyed this morning's Farm Bureau breakfast. https://t.co/6fH8PI5ScQ"]["Glad the VA has appointed a permanent director for @MemphisVAMC to oversee care of our West TN veterans."]["RELEASE: Alexander statement on @GOPHELP vote to approve Alexander Acosta nomination https://t.co/7TxNCM1HME https://t.co/E8CJ8imaqz"]["Alexander: Senate labor committee approves nomination of Alexander Acosta https://t.co/E03z3Bnr0c"]["Sen. Alexander &amp; Corker introduced a bill to rescue Americans with zero options for insurance on the ACA exchanges https://t.co/PiMgFPpIo0"]["Alexander said Congress must act now to help the Tennesseans – “some of the most vulnerable citizens in our state” https://t.co/e7CwpqVRZg"]["I hope this will provide some peace of mind for Americans in counties across the country trapped in collapsing exchanges"]["…to help these 230,000 Tennesseans and millions of Americans in other states facing the same dire circumstances. (2/2)"]["While Congress continues work on long-term structural health reforms, we must take immediate action (1/2)"]["“Their subsidies will be worth as much as bus tickets in a town where no buses run” https://t.co/tGmQmfZAch"]["It’s a near certainty there will be zero insurance options on exchange for 40,000 Tennesseans in Knoxville area in 2018"]["Bill allows Americans w/ subsidies -- if no insurance available on exchange next yr-- to buy any state-approved insurance off of exchange"]["TUNE IN NOW: Sen. Alexander speaking on bill to address emergency on insurance exchanges in TN, other states: https://t.co/ABXP4SxvMz"]["Alexander: Legislation offers “a very simple solution to an emergency that’s bound to exist in many states” https://t.co/e7CwpqVRZg"]["Alexander, @SenBobCorker intro bill to rescue Americans with zero options for insurance on the ACA exchanges in 2018."]["\"...rate schools, set standards, and approve tests in 100K schools in 50 states.\" 2/2 #AEIESSA"]["Lesson of last 40 yrs is that ED \"doesn’t have the capacity to evaluate teachers...\" 1/2 #AEIESSA"]["\"Schools are still a national issue, but there’s a consensus that the issue is not best addressed by a federal solution.\" #AEIESSA"]["\"... restoring responsibility to states, communities and classroom teachers.\" 2/2 #AEIESSA"]["\"So we started heading in the opposite direction – reversing the trend toward a national school board...\" 1/2 #AEIESSA"]["\"And that led to Congressional efforts to fix No Child Left Behind, first in 2011, then in 2013, and finally — successfully — in 2015.\""]["\"With these waivers came the zenith of the National School Board.\" #AEIESSA"]["“Secretary Duncan used states’ need for waivers from the law as an opportunity to require states to adopt new standards...\" #AEIESSA"]["\"Congress’ failure to reauthorize No Child Left Behind allowed the law to become unworkable...\" #AEIESSA"]["\"It's very difficult to improve a child’s education from a distance.\""]["\"A federal issue is something Washington is in the best position to solve.\" https://t.co/0hMP6L4GG0"]["\"National and federal are not the same. A national issue is an urgent concern for the whole country.\" #AEIESSA"]["\"Almost everyone agrees that elementary and secondary education is a national issue.\" #AEIESSA"]["\"I’d like to talk a little today about ... the rise and fall of what I would call the National School Board.\" #AEIESSA"]["“…agreed that the best way to educate a child in a classroom was to restore decisions to the teacher and the school district” 2/2"]["Alexander asks re 22-0 committee vote on April 16, 2015 -- “How did we get that moment – where 22 senators ... 1/2"]["Senator Alexander giving keynote speech at @AEI on “The Rise and Fall of the National School Board.” Follow along for updates."]["Tune in now: Sen. Alexander gives keynote at @AEI on “The Rise and Fall of the National School Board.” https://t.co/HuRrD6iOqh #AEIESSA"]["“Sen. Howard Baker did not filibuster President Carter’s nominees. Sen. Bob Dole did not filibuster President Clinton’s nominees.”"]["“Sen. Everett Dirksen did not filibuster President Johnson’s nominees. Sen. Robert Byrd did not filibuster President Reagan’s nominees.”"]["“And until 2003, the number of circuit judges in our country’s history who had been denied their seats by filibuster was zero.\" #Gorsuch"]["“The number of federal district judges in our country’s history who have been denied their seats by a filibuster is zero.” #Gorsuch"]["“The number of cabinet members in our country’s history who have been denied their seats by a filibuster is zero.” #Gorsuch"]["“Throughout the Senate’s history, approval of even the most controversial presidential nominations has required only a majority vote.”"]["“Filibustering to death the #Gorsuch nomination — or any presidential nomination ... — flies in the face of 230 years of Senate tradition.”"]["TUNE IN at 4:15 PM ET -- Sen. Alexander delivers speech on Judge #Gorsuch. https://t.co/qbizP9NzJy"]["\"Throughout the Senate’s history, approval of even the most controversial presidential nominations has required only a majority vote.\" https://t.co/84kXMpuGso"]["“Filibustering to death the #Gorsuch nomination — or any presidential nomination ... — flies in the face of 230 years of Senate tradition.” https://t.co/gT5mMs9TyG"]["Sen. Alexander statement on #AHCA https://t.co/FgrZw22D3M https://t.co/qI5tlrstVQ"]["Sen. Alexander statement on #AHCA https://t.co/FgrZw22D3M"]["Alexander: Bill Hagerty is an ‘outstanding choice’ to be the next U.S. ambassador of Japan https://t.co/HjfnbgDGqt"]["\"TVA should continue to provide low-cost, reliable power to the region that boosts economic development throughout the Tennessee Valley.\" https://t.co/iPzG3lPwSz"]["Sen. Alexander urged the TVA not to buy unreliable wind power from Clean Line that could cost ratepayers $1 billion over the next 20 years. https://t.co/mtoGZaMLk4"]["Sen. Alexander: TVA shouldn’t raise Tennesseans’ electric bills to buy power it doesn’t need https://t.co/CFdAO2cQZJ https://t.co/iGOvA9BAz6"]["“TVA should continue to provide low-cost, reliable power that boosts economic development throughout the TN Valley.\""]["Sen. Alexander: A contract with Clean Line Energy Partners could cost TVA ratepayers more than $1 billion over the next 20 to 30 years."]["TUNE IN NOW -- Sen. Alexander speaking on Senate floor in opposition to TVA buying wind power from Clean Line https://t.co/ABXP4SxvMz"]["Sen. Alexander is chairing confirmation hearing on Alexander Acosta to serve as Labor Secretary. Tune in – https://t.co/79bKsZpPUa https://t.co/aq20IbNgaU"]["CSPAN2 is also carrying today’s confirmation hearing with Alexander Acosta. Watch here: https://t.co/cPrISVomXa"]["“ ... to helping workers realize the American dream for themselves and for their families.” 2/2"]["\"Fortunate today to have a presidential nominee for Labor Secretary who understands how a good-paying job is critical\" 1/2"]["“The Obama Administration unleashed a regulatory avalanche that held job creators back from creating jobs”"]["“… adjust to the changing world, and create, find, or keep a job\" (2/2)"]["“Too many of the federal government’s actions over the last few years have made it harder for American workers to keep up\" 1/2"]["“The issue for workers today is ... whether they have the skills to adapt to the changing marketplace &amp; to find &amp; keep a job.”"]["Sen. Alexander: The title of the job for which Alexander Acosta has been nominated should be changed to the Secretary of Workforce"]["HAPPENING NOW: 9 AM hearing on nomination of Alexander Acosta to serve as Labor Sec https://t.co/HsC6ukWoov"]["TUNE IN: 9 AM hearing on nomination of Alexander Acosta to serve as Labor Secretary https://t.co/HsC6ukWoov"]["It was great to spend time w/ Cody &amp; his family from Chattanooga while he’s on his trip to D.C. through Make-A-Wish. https://t.co/kh84gXpHUW https://t.co/lI7WQhGYQk"]["Sen. Alexander: I am hopeful that this committee, and this Congress, can work in a bipartisan manner to reauthorize the user fees"]["Sen. Alexander: The sooner we reauthorize the agreements, the better — to give patients, reviewers, and companies certainty."]["Sen. Alexander: If we do not move quickly to reauthorize (user fee agreements) ... the FDA will be forced to begin sending layoff notices"]["Sen. Alexander: the agency responsible for making sure the promising research supported by 21st Century Cures actually reaches patients 2/2"]["Sen. Alexander: Today, we are here to talk about how we continue funding the FDA … 1/2"]["Sen. Alexander: We ended last yr. passing 21st Century Cures, which Ldr McConnell called “the most important piece of legislation” that yr."]["70 business groups on Labor Sec nominee Alexander Acosta – “He is well qualified to lead this important agency…” https://t.co/8Ay0iUh1DA"]["Letter to Sen. Alexander outlines support of Labor Sec nominee Alexander Acosta by 70 business groups https://t.co/FGTxiN2h7N"]["Cheering for @LadyVol_Hoops in their game against Dayton! #GBO #VFL https://t.co/QxmR3FQRmA"]["Good luck to @GoMocsWBK in their game against Louisville! #GoMocs https://t.co/BDsVQabqqe"]["Rooting for @BelmontWBB in their game against Kentucky! #BruinSomethingSpecial https://t.co/uhBJDPbEOx"]["Cheering for @VandyMBB in their game against Northwestern! #AnchorDown #MarchMadness https://t.co/5aljzf5PuY"]["Good luck to @MT_MBB as they take on Minnesota! #BlueRaiders #MarchMadness https://t.co/RCj9WiX3Qq"]["Rooting for an @ETSU_MBB win in their game against Florida! #ETSUTough #MarchMadness https://t.co/aHv3r6psrB"][".@SenAlexander, @SenBobCorker joined President Trump at the Hermitage to celebrate President Andrew Jackson's 250th birthday. https://t.co/I3tkq5xEna"]["READ: Sen. Alexander’s op-ed in the @Tennessean on the president’s visit to Nashville and the #Obamacare emergency https://t.co/qfd7Iwe3OL"][".@SenAlexander: Republicans’ top priority in Congress is to address #Obamacare emergency in TN &amp; other states: https://t.co/qfd7Iwe3OL"]["On this day in 1982, Alexander, then TN gov., joined President Reagan to celebrate Andrew Jackson’s 215th birthday https://t.co/0qVzQGBmd0 https://t.co/73JeiYFFuO"]["“230,000 Tennesseans …will likely have zero health insurance options in 2018 if Congress does not act soon\" on ACA https://t.co/qfd7Iwe3OL"]["Sen. Alexander op-ed in today’s @Tennessean: “Trump trip to highlight urgency of #Obamacare substitute” https://t.co/qfd7Iwe3OL"]["Acosta confirmation hearing rescheduled to Wed., March 22nd at 9 a.m., b/c @senalexander is joining the president in Nashville this Wed."]["Alexander: House bill would help 40,000 Tennesseans who may otherwise have zero Obamacare insurance options next yr. https://t.co/sWpwhcaBM4"]["Alexander: The issue before us is whether Congress writes the law or the Department of Education writes the law."]["HAPPENING NOW: Senator Alexander speaking on Senate floor before vote on education regulation CRA https://t.co/BvOdqkdoac"]["Alexander: Article 1 of the United States Constitution says the United States Congress writes the law."]["Alexander: The most important question is who writes the law: Does Congress write the law, or does the Dept. of Education?"]["Alexander: #ESSA “reversed the trend toward a National School Board,” but this regulation “begins to restore the National School Board”"]["Alexander: Obama admin education regulation “is in direct violation of the law that 85 senators voted for 15 months ago”"]["TUNE IN: Sen. Alexander headed to Senate floor now to speak on #ESSA accountability CRA https://t.co/bnYQklYXyj"]["VIDEO: Sen. Alexander led 10 Senators in introducing resolution to rescind Obama administration education regulation that violates the law https://t.co/2pegKOFAnm"]["“There was no one in the Tennessee General Assembly who demonstrated integrity, courtesy and financial stability more than Douglas Henry.”"]["Sen. Alexander on Douglas Henry: \"His example will be important for years to come.\" https://t.co/NS5OHjMiId"]["Senator Alexander on Labor Sec nominee: “I enjoyed meeting today with Alexander Acosta.” https://t.co/EcBGPQKz4c https://t.co/WHBWGbdUCA"]["\"The president’s speech was hopeful and well-delivered\" https://t.co/HTbD2CI45M"][".@SenAlexander statement on the president’s address to a joint session of Congress: https://t.co/7MqNiZ6bVo"]["Alexander: I hope to hear from the president tonight on local control of public schools, tax reform, Obamacare rescue https://t.co/p02SIW0OCY"]["VIDEO: Sen. Alexander talks about what he hopes to hear the President discuss in his #jointsession address to Congress tonight. https://t.co/WDmi6gmLkV"]["Former TN gov and former chair of @NatlGovsAssoc, @SenAlexander joined @SenatorHassan in welcoming governors from around the country. https://t.co/Jpy0DtmQoT"][".@SenBobCorker is doing important work with the #enditmovement. https://t.co/pzE0lj5Lje"]["Bipartisan group of committee leaders send colleagues a letter to highlight importance of vaccines https://t.co/OoSR88L4G8"]["Sen. Alexander: The work to replace and repeal #Obamacare will help “give Tennesseans &amp; all Americans more choices of lower cost insurance.” https://t.co/4YhbI1bCZn"]["“Vaccines save lives,\" says bipartisan group of Senate and House committee leaders https://t.co/2MlsfjIVBB"]["READ in the @knoxnews about how Sen. Alexander is working to address the #Obamacare emergency in Tennessee. https://t.co/bMEpjufKli"]["On #Obamacare emergency in TN – “It’ll be just like having a bus ticket in a town where no buses run. We’re taking steps to deal with that.” https://t.co/WXMtuOJj23"]["Happy #PresidentsDay! https://t.co/747parIWCF"]["WATCH: Sen. Alexander on the #Obamacare emergency in Tennessee https://t.co/3ZWr1BDqFK"]["Alexander statement on this week’s vote to protect due process rights of people with disabilities: https://t.co/S2DO2ufhhF"]["Sen. Alexander: Humana announcement could leave 40,000 Knoxville residents w/ zero health exchange options for 2018 https://t.co/Y8Zt3b40jK"]["Sen. Alexander: HHS action this week a good first step to rescue Americans from collapsing health care market https://t.co/deuwnqzCgp"]["Chairman Alexander statement on selection of Alexander Acosta to serve as Labor Secretary: https://t.co/BshfhVHu35 https://t.co/oaFJCjSj6Q"]["Sen. Alexander’s statement on Andy Puzder nomination: https://t.co/RUQ949su84 https://t.co/jU2tkSjmFr"]["Sen. Alexander had a great meeting last week with members of the Tennessee Education Association. https://t.co/7XsUFtysqX"]["U.S. Senators Corker, Cardin, Alexander, Kaine introduce bill to award Congressional Gold Medal to Tennessean https://t.co/PZiymtw4Q8"]["Andy Puzder is \"the right man for the Labor job after eight slow-growth years...\" https://t.co/eBiJJX42ku"]["From @WSJ | “Mr. Puzder knows that workers will benefit from less government intervention…” https://t.co/D5TxTkNyfG"]["Andy Puzder started out scooping ice cream and has now created thousands of jobs. https://t.co/obQZr3MhJZ"]["VIDEO: On Thursday, Americans will get to meet Andy Puzder – labor nominee who went from scooping ice cream to CEO, knows how to create jobs https://t.co/lo26wcQFc2"]["Great to see that Sevier Co. residents have been approved for nearly $10 million in aid. https://t.co/ii6lDBjlsM"]["Sevier Co. – the Gatlinburg recovery center is closing on Fri., but you have until 2/13 to apply for aid https://t.co/7jvsmR4oTH"]["Next year, #Obamacare subsidy could be like holding a bus ticket in a town with no buses running. https://t.co/VQ5nGuwxMf"]["Sen. Alexander on Betsy DeVos: She will \"reverse the trend toward a national school board and restore local control of TN’s public schools.\""]["Alexander: New Education Secretary will restore Tennessee classrooms to Tennessee communities https://t.co/kfUAY3jImi"]["Alexander: W/ DeVos in charge of ED, “no more national school board, no Washington mandates for vouchers or common core” https://t.co/HburidyVQD"]["Sen. Alexander: I urge a yes vote #ConfirmDeVos"]["Sen. Alexander: Betsy DeVos will implement ESSA “the way we wrote it.” #ConfirmDeVos"]["Sen. Alexander: Betsy DeVos believes in a local school board, not a national school board. #ConfirmDeVos"][".@BrianKelsey on Betsy DeVos – “She is an education leader who has given her life to helping children achieve.” https://t.co/5m12aWjCqg"]["Sen. Alexander will be giving remarks on the Senate floor around 11:30 a.m. EST #ConfirmDeVos"]["DeVos – “IDEA is a wonderful example of what happens when parents are regarded as full partners” in decision-making https://t.co/MliMC0u94u"]["READ from TN State Senator @BrianKelsey: Betsy DeVos highly qualified to be education secretary https://t.co/5m12aWjCqg"]["Former Sen. Lieberman says Betsy DeVos “cares about children,” “is ready to take on this assignment and do it very well” #ConfirmDeVos"]["Happy Birthday, President Reagan. https://t.co/TuUTEMP6hC"]["On @Medium | Sen. Alexander on repairing the damage that Obamacare has caused millions of Americans https://t.co/37vQU1oxwx"]["Sen. Alexander answered calls yesterday from Tennesseans and discussed his support for Betsy DeVos. He appreciates all Tennesseans' calls. https://t.co/hll2nbhxZi"]["Sen. Alexander on Betsy DeVos – “She’ll be an excellent Education Secretary, in my judgment, and an important one for this country.” https://t.co/JymEQmM1cd"]["VIDEO: Sen. Alexander highlights Betsy DeVos supporters – including Governors and Education Secretaries. #ConfirmDeVos https://t.co/v2tYKGDc36"][".@SenatorTimScott – “The real debate is the generations of kids that are stuck in underperforming schools.” https://t.co/I7VeIbUQkp"]["Judge Gorsuch \"is an impressive individual w/ outstanding academic credentials &amp; an excellent judicial record\" https://t.co/iiV12zJYF8 https://t.co/VKUOqkJcYi"][".@SenatorBurr on Betsy DeVos’s qualifications – “qualities that we’d look for in any nominee of any president” https://t.co/oSataNgiG7"]["Alexander just now on Senate floor: I'm confident Betsy DeVos will be confirmed https://t.co/cJUMhFXXCO"]["VIDEO: Alexander: I realize #Obamacare is a contentious issue, this is a contentious time...When pple need help we’re supposed to provide it https://t.co/MTqLteSxiV"]["Sen. Alexander: Both Republicans and Democrats are going to have to do something to help these 18 million Americans. #replace"]["Sen. Alexander: Without quick action, many of these 18 million Americans may have no choices for insurance next year"]["Sen. Alexander: 18 mill Americans in individual insurance market, 11 mill in exchange--for these people, there’s an #Obamacare emergency"]["Sen. Alexander: TN state insurance commissioner in August → the Tennessee #Obamacare exchange “very near collapse”"]["Sen. Alexander to @NSBAComm: \"We don't want a national school board. We want a local school board.\" https://t.co/C4HlS0pxU2"]["Senate education committee sends nomination of Betsy DeVos to Senate floor https://t.co/gCPKnZjZgg"][".@SenateMajLdr: “Betsy has a proven track record of important work to improve the lives of children across the country.”"][".@JohnKasich: DeVos “knows that states, local school boards, educators &amp; parents should be drivers of reform, not the federal government”"]["Former Sen. Lieberman says Betsy DeVos “cares about children”, “is ready to take on this assignment and do it very well” #ConfirmDeVos"][".@SenatorTimScott says he is “looking forward to the opportunity to have Betsy DeVos as our champion for all children, for all education”"]["WATCH: Betsy DeVos said “no” to school choice mandates from Washington D.C. https://t.co/u5eT92JYkB"]["Sen. Alexander statement on refugee executive order. https://t.co/XrPPwPHuV8"]["Gov Walker urges Senate to confirm Betsy DeVos: \"She believes student success begins at the local school....\" https://t.co/38pCerbKje"]["If you’re calling the senator’s office, staff are answering phones as rapidly as they can–you can also contact here: https://t.co/NMqQKFQwEI"]["\"DeVos said in her new letter that she will 'bring a sense of urgency' to helping students with disabilities.\" https://t.co/rQkPHkP5KW"]["\"DeVos has been advocating for better schools across the board, putting children’s interests ahead of all else.\" https://t.co/RZYySVVQj7"]["Betsy DeVos said “NO” to school choice mandates, coercion -- “INDEED” to implementing ed laws to the letter of the law https://t.co/iUsEtRVald"][".@SenatorTimScott on Betsy DeVos – “Parents and students cannot ask for a better role model or a more thoughtful leader…” #ConfirmDeVos https://t.co/SRnE6tCbCN"]["Via @educationweek | “In letter, DeVos says she'll protect 'hard won rights' of students with disabilities” https://t.co/fUJF6Cd4Sn"]["DeVos – “IDEA is a wonderful example of what happens when parents are regarded as full partners” in decision-making https://t.co/YcT4qHUElK"]["President of the Memphis Chapter of the Southern Christian Leadership Conference – \"Betsy DeVos has shown dedication to education, children\""]["From @politico | “DeVos vows to enforce special education law” https://t.co/6Rr5TgSRZ7"]["Betsy DeVos says in letter – “I am committed to ... protecting the hard won rights of students with disabilities.” https://t.co/li0Sk8ubcr"]["Tune in now ↓ https://t.co/SrNsppdZLI"]["Happening Now ↓ https://t.co/AYlOGR05wa"]["LISTEN: Sen. Alexander will be on Supertalk 92.9 in the Tri-Cities at 7:45 a.m. EST"]["Tune in -- Sen. Alexander will be on @hughhewitt show at 7:30 a.m. EST: https://t.co/j6hsOcoc49"]["WATCH Sen. Alexander: Betsy DeVos has spent more than 30 years helping low-income children in America have more choices of schools https://t.co/AOcRlYFuV2"]["Republicans asked King 56 questions, compared with approx. 1,400 questions that Democrats are asking DeVos. https://t.co/5ncjsPsPrU"]["So who’s in the mainstream – Betsy DeVos or her critics? https://t.co/U5b4Aly7ud"]["Sen. Alexander spoke at the #SchoolChoice rally this week about helping students from low-income families have a choice of better schools. https://t.co/Tunubt0Es8"]["“President Obama appointed John King, he had a prompt hearing, and he was confirmed within three weeks” https://t.co/Q7aeXmj0Ry"]["Alexander cosponsored legislation this week to repeal the federal death tax &amp; “relieve the tax burden on family-owned farms &amp; businesses.” https://t.co/froPKelr9E"]["Via @WRCB Chattanooga: “Alexander: DeVos has spent 30 yrs trying to help low-income children attend a better school” https://t.co/FFXJnXJvoP"]["VIDEO: Dems asked DeVos 1,397 follow-up questions after hearing, where she spent more time than either of Obama's ED noms https://t.co/UvZICiYZk3"]["READ: Sen. Alexander on Betsy Devos – “She is on the side of our children.” https://t.co/RVkXXqsDtZ"]["Alexander on DeVos: “Few Americans have done as much to help low-income students have a choice of better schools.” https://t.co/LvtVjti4DB"]["Sen. Alexander on Betsy DeVos: \"Few Americans have done as much to help low-income students have a choice of better schools.\""]["Jan. 22-28 is National School Choice Week! RT if you support #SchoolChoice! https://t.co/rH6n9VZBYI"]["On @Medium | Sen. Alexander: “Senate should promptly confirm Betsy DeVos” https://t.co/13IW9C8Ae1"]["ICYMI: Sen. Alexander &amp; Betsy DeVos fight to give more children opportunities to attend better schools #SchoolChoice https://t.co/M1NkOgadO0"]["Sen Alexander &amp; Betsy DeVos have been fighting to give lower-income families, students opportunities they deserve https://t.co/b5PqSkHXJx"]["There are a lot of excited #Tennesseans in Washington, D.C., for today's #inauguration https://t.co/zbSwqDHprU"]["VIDEO: Alexander talks about today's inauguration https://t.co/hkrL7XegeT"]["Exciting to have the @UTKnoxville band taking part in the #Inauguration parade today! #VFL https://t.co/rwG4crRaiy"]["Alexander: “I’m ready to work w/ the Trump administration and Congress to reduce Washington’s involvement in our everyday lives.\""]["Sen. Alexander: Today we celebrate the American tradition of the peaceful transition of power. #InaugurationDay https://t.co/PNdJ95ANEp"]["Sen. Alexander is on his way to the #Inauguration. https://t.co/9jQnSWNAMN"]["Sen. Alexander: “Dr. Price I believe you are an excellent nominee for this job.” https://t.co/31MJxMTKOJ"]["Happy Birthday to fellow Tennessean and Sevier County native @DollyParton! https://t.co/hPd1VMgNuF"]["WATCH this video recap of the HELP committee’s hearing with Dr. Tom Price. https://t.co/g48TcuubRI"]["“We are fortunate that Betsy DeVos is the nominee for US Education Secretary. She is and has been on our children’s side.” https://t.co/2GVxlHGuiW"][".@RepTomPrice \"understands all aspects of the health care system, which is essential to run HHS effectively.\" – @AANSNeuro"][".@SenatorIsakson on Dr. Price: “I know he’s the right man for the right job at the right time for America.” https://t.co/io0ErXlo4f"]["WATCH: “Dr. Price I believe you are an excellent nominee for this job.” https://t.co/CbfARtDgnj"]["VIDEO – Sen. Alexander on Betsy DeVos: \"I support her confirmation and look forward to working with her.\" https://t.co/qd4r3GyJlo"]["Make sure to follow @GOPHELP for live updates on the hearing with @RepTomPrice."][".@BetsyDeVos \"knows how to fight and to make the moral case for reform.\" - @WSJ https://t.co/nyXO5NlS6F"]["\"@BetsyDeVos is a smart choice for education secretary.\" - @MittRomney https://t.co/pFY6TYRalN"]["\"Betsy believes deeply that each child should be equipped with the knowledge required to succeed in life.\" - @JebBush"]["“We strongly support @BetsyDeVos.” - @GovMaryFallin, @BillHaslam, @GovAbbott, @GovWalker"]["“We strongly support @BetsyDeVos.” - @Governor_LePage, @PhilBryantMS, @GovRicketts, @GovSandoval, @GovChristie"]["“We strongly support @BetsyDeVos.” - @onetoughnerd, @GovernorBentley, @dougducey, @AsaHutchinson, @GovRauner, @GovHolcomb, @govsambrownback"]["“We are fortunate that Betsy DeVos is the nominee for US Education Secretary. She is and has been on our children’s side.” https://t.co/izHrqDUmz3"]["Fmr Senate Majority Leader @bfrist said @BetsyDeVos “puts children at the forefront of her advocacy efforts.” https://t.co/SmMyjMXmYp"]["We’ll follow the golden rule—following same procedures we did for both of Pres Bush’s ed secretaries &amp; both of Pres Obama’s ed secretaries"][".@SenAlexander: Despite our differences, we have shown courtesy to one another and to our witnesses."][".@SenAlexander: HELP Committee knows how to resolve differences of opinion &amp; get a result—eg., bill to #fixNCLB in 2015 &amp; #Cures in 2016."]["VIDEO: Sen. Alexander previews the hearing on Betsy DeVos for Secretary of Education https://t.co/ymAAtY18by"]["Make sure to follow @GOPHELP for live updates on the hearing with @BetsyDeVos."]["Elected leaders from all 50 states support Betsy DeVos, writing, “Betsy DeVos will put children first” https://t.co/dMTxd1tvEN"]["Alexander says new rule jeopardizes TN Walking Horse tradition, urges zero tolerance for illegal horse soring: https://t.co/QQ6MXC3nsz"][".@senalexander says new Obama admin rule jeopardizes Tennessee Walking Horse tradition: https://t.co/QQ6MXC3nsz https://t.co/wfkTnKGoKr"]["One way to think about #Obamacare is as a collapsing bridge -- because that’s just what's happening with Obamacare. https://t.co/Uh7sBv02vO"]["SBA loans may be available to those affected by the Sevier Co. wildfires https://t.co/mual1RMEsE"]["Read more about Sen. Alexander’s plan for simultaneous repeal and replace of #Obamacare here → https://t.co/ESOePlTRVO"]["Sen. Alexander on @Medium: Repeal and Replace #Obamacare Simultaneously, Concurrently https://t.co/HMeDPHEE3z"]["Those in Sevier Co. affected by wildfires may be eligible to receive aid for damaged vehicles. Learn more here: https://t.co/A4JfWK8iGa"]["For those affected by Sevier Co. wildfires, legal assistance is now available to low-income survivors. Learn more https://t.co/jLDLFwQLpU"]["Gatlinburg is open for business! Great to see that \"holiday traffic was just as lively as usual\" downtown this year https://t.co/pM6V0ZlOGb"]["Sen. Alexander: That is what we mean when we say repeal and replace #Obamacare simultaneously and concurrently"]["Sen. Alexander: Finally, repeal what remains of the #Obamacare law that did all this damage and created all this risk"]["Sen. Alexander: Second, build better systems providing Americans with more choices of insurance that cost less"]["…while we build a better set of concrete, practical alternatives. (2/2)"]["Sen. Alexander:  First, offer a rescue plan so the 11 million Americans who buy insurance now on exchanges can continue to do so… (1/2)"]["How to proceed on #Obamacare: rescue those trapped in failing system, replace that system w functional markets, repeal #Obamacare for good"]["According to the Tennessee insurance commissioner, the #Obamacare insurance market in TN is “very near collapse.”"]["HAPPENING NOW ↓ https://t.co/0O12sjc7Jy"]["Congratulations to Peyton Manning on being elected to the College Football Hall of Fame! #VFL https://t.co/Hg49Wvm7sy"]["Sen. Alexander’s statement on the bill to name new Nashville federal courthouse in honor of U.S. Sen. Fred Thompson https://t.co/wA74N2EdO2 https://t.co/SnuEPmpeaX"]["BREAKING: TN members introduce bill to name the new Nashville federal courthouse in honor of U.S. Sen. Fred Thompson https://t.co/xn3v309hXo"]["Nashvillian Doug Oliver last week presented Sen. Alexander w/ the cane Doug used when he was blind &amp; thanked him for #Cures law https://t.co/YHEgIV3aPT"]["Now that Washington is not calling the shots, this story is abt what TN schools are doing with their new authority under @senalexander’s law https://t.co/0bZtOXfAHX"]["The nation’s governors created an award for respecting states’ rights &amp; gave it to Alexander for his work to fix NCLBhttp://bit.ly/2j38rcH"][".@WSJ called it “the largest devolution of federal control to the states in a quarter-century.” https://t.co/O6kQk6cuS1"]["@senalexander passed law repealing common core &amp; federal mandates, reversing the trend toward a nat'l school board &amp; restoring local control"]["2 years ago the most explosive issue in TN schools and elections was the federal mandate requiring common core academic standards."]["Sen. Alexander met w/ Energy Sec nominee @GovernorPerry yesterday &amp; showed him Sam Houston’s walking stick from 1845 https://t.co/PvPJnBk1p1 https://t.co/JOjZlxSv4i"]["Affected by the Sevier Co. wildfires? You can get help in Pigeon Forge and Gatlinburg. Click here for more info: https://t.co/BI2Hn8k69G"]["Sen. Alexander met with EPA nominee Scott Pruitt yesterday and talked with him about the importance of clean air to Tennesseans. https://t.co/TyCxM5urGf"]["ICYMI: Senator Alexander wrote about how #CURES will help people in Tennessee and across the country. https://t.co/tRx3x9yc4a"]["READ: Senator Alexander’s statement on his meeting with EPA nominee Oklahoma Attorney General Scott Pruitt. https://t.co/d51J0FZel9 https://t.co/1PnOsRb0e4"]["In the Lebanon Democrat: #CURES “will help us find cures for cancer, fight opioid addiction, treat mental illness\" https://t.co/2T5Ph25y6c"][".@senalexander talks w/ Sevier Co. Mayor Larry Waters at today's long term recovery meeting for the areas affected by wildfires. https://t.co/4RB18pIthr"]["As we celebrate this holiday season, we thank our troops for their service, especially those far away from their families https://t.co/815tgTHQ2O"]["That means \"supporting safely operating #nuclear power plants that produce carbon-free electricity.\""]["Alexander said implementing law fixing No Child Left Behind &amp; putting health care decisions in hands of consumers are top priorities next yr"]["On @hallerin today, George Korda says Tennesseans don’t hear much about #CommonCore anymore because of @senalexander's bill to #fixNCLB."]["@senalexander w/ George Korda on @987news: #Cures will provide money for lifesaving cures for diseases like cancer, Alzheimer’s, diabetes."]["We'd like to move [health care] decisions out of D.C. &amp; back to states -- putting them in hands of consumers so they make choices themselves"]["On @Hallerin w George Korda, Alexander says Republicans would like to give Tennesseans &amp; Americans more choices of low cost health insurance"]["HAPPENING NOW ↓ https://t.co/yQWkQa8S69"]["TUNE-IN today @ 5:30 pm EST: @senalexander to talk with George Korda on @987news https://t.co/ywRIQeD8hq"]["Sen. Alexander statement on President Obama's approval of federal disaster assistance for Sevier County: https://t.co/xvqXaWhAlR"]["Congrats to Beverly Davenport on being named chancellor of @UTKnoxville - she has an impressive track record in higher education."]["#Cures, called the “most important legislation of the year,” will help find cures for cancer, fight opioid addiction, &amp; treat mental illness"]["Today, @POTUS signed #Cures, a #ChristmasMiracle that will help virtually every American family"]["#Tennessee can benefit from #Cures in a number of ways via @McollinsNEWS in @Tennessean https://t.co/yzAN1ApEJ7"]["In @MemphisNews: Alexander, @SenBobCorker score big bipartisan victories #Cures #EndSlavery  https://t.co/DAxqUK1VCM"][".@BillGates has done an excellent job bringing the private sector together for #energy innovation: https://t.co/W7gdyEHxBr"]["After meeting w/ @AndyPuzder, Alexander says “Mr Puzder will be a good partner in creating an environment to help grow jobs” https://t.co/e8v31vPXUC"]["Tune-in Tuesday @2:30 to watch @POTUS sign #Cures, a #ChristmasMiracle, into law → https://t.co/6GAlBQKdnw"]["Tune-in: Alexander will be on @hallerin @5:40 ET to talk about #Cures, which yesterday passed the Senate 94-5 https://t.co/wtoQGevyHl"]["#Cures is a #ChristmasMiracle for virtually every American – including kids like Max! https://t.co/cCJqMOkHcy"]["After the Senate passed #Cures overwhelmingly 94-5, it was great to talk with #TN State Sens.… https://t.co/g18Thaqw9m"]["Alexander: “Let me tell you a story about a @vp who knows how to get things done…” https://t.co/4v4qPpFbth"]["#Cures is ready for the president after 94 to 5 Senate vote #ChristmasMiracle https://t.co/U5RAJVLdEi"]["The Senate just passed the “most important bill of the year” 94 to 5 #CuresNow"]["From @WSJopinion: “After years of thoughtful bipartisan work, Congress is now poised to pass #Cures” https://t.co/1ms3xAaix8"]["When we pass #Cures, the real winners will be the American families whose lives will be improved https://t.co/1SkcjAlpFA"]["#Cures “would be particularly significant to #TN &amp; other states where a shocking number of lives are being lost or ruined” by #opioids"]["Editorial in @memphisnews: #Cures “offers hope for relief” from #opioid epidemic https://t.co/Weysa97vDY"]["Tune-in @3pm ET: Alexander will be talking about the East #TN storms on the Senate floor https://t.co/7XkMdSNyvC"]["Pretty easy to measure character when things are going well, but much easier when things aren't. East TN character is off the charts."][".@DrPhilRoe is an outstanding choice to lead @HouseVetAffairs https://t.co/Nuy2KBojyk"]["If you need assistance after the wildfires in Sevier Co. visit this @T_E_M_A resource page  → https://t.co/JkDboO533V"]["Alexander: My heart breaks for the families that lost loved ones and homes. https://t.co/vuVOXNuRIN"]["TUNE-IN tomorrow @ 7 am EST when Alexander joins Nashville’s @WKRN to talk about the wildfires in Sevier Co."]["Tonight the House passed \"the most important legislation of the year\" by an overwhelming vote of 392-26 #CuresNow"][".@SenAlexander: Today’s real winners are American families whose lives stand to be improved by #Cures https://t.co/vtUZzeNocV"]["It’s official! New element is named after the great state of #Tennessee—element 117 is named Tennessine: https://t.co/ESLBVAYZy0"]["TUNE-IN at 3:10 pm ET: Alexander talks on the Senate floor on East TN wildfires &amp; #Cures https://t.co/7XkMdSNyvC"]["WATCH: Alexander on the @weather channel talking about the Sevier Co. wildfires https://t.co/dGXub4NVDV"]["Honey and I send our thoughts and prayers to the victims of the dangerous storms that came through East Tennessee."]["Alexander statement on House passage of legislation to name the new Nashville courthouse in honor of Fred Thompson: https://t.co/diMgLlYqxt"]["#Cures includes $1.4 billion for the president's Precision Medicine Initiative #21stCenturyCures"]["#Cures includes $1.8 billion for VP Biden's #CancerMoonshot"]["#Cures includes $4.8 billion for #NIH for biomedical research"]["#21stCenturyCures includes $1 billion to combat the tragedies of opioid abuse"]["Tune in NOW to catch Sen Alexander speaking on #Cures: https://t.co/a7FsSiYY22"]["#Cures will affect virtually every American #21stCenturyCures"]["More than 200 organizations from across the country support #21stCenturyCures #Cures"]["Here’s how to help those affected by the fires in Sevier Co. → https://t.co/zO8yv3yrIZ via @Tennessean"]["#Cures is a landmark medical innovation package that will accelerate the discovery &amp; development of new cures &amp; treatments"]["On the wildfires in Sevier County: https://t.co/c5NqjOVPzF"]