["Speaking on the Senate floor shortly about ending chain migration. Watch live here: https://t.co/EM5GtvHpdR"]["Let's be clear: The January 19 deadline to fund the government and the March 5 DACA deadline are two totally separate issues and should be different conversations entirely. https://t.co/iUZwqEB1LG"]["I’ll be live on @BloombergTV in about 5 minutes to talk about solving our country’s immigration problems and the great results we’re seeing after passing historic tax cuts last month. Hope you’ll tune in! #gapol"]["Joining @foxandfriends at 7:45AM to discuss why any DACA solution must include an end to chain migration and money for border security. Tune in! #gapol"]["Thank you to these officers and the countless others who work tirelessly to strengthen our communities every day and often don’t get the credit you deserve. We appreciate you."][".@Douglasville_PD Officer Candace Tongate delivered a baby in a parking lot after being flagged down by a frantic soon-to-be dad to 3.\nhttps://t.co/dMFhAU5bs6"][".@Atlanta_Police Deputy Chief Jeff Glazier helped a single mom and her four children get back on their feet after finding out they were living in their car. \nhttps://t.co/2Q40p3DVI5"][".@SCMPD Officer James Hurst stayed with a 16-month-old at the hospital for two hours after finding the toddler outside alone. Hurst said he simply wanted to be there for the child who, at the time, had no one.\nhttps://t.co/Yyj8bxepkk"]["On #LawEnforcementAppreciationDay, I’m reminded of a few stories about officers across our state who have gone above and beyond to protect and serve our communities. \n\n A thread:"][".@POTUS is driving consensus to fix our legal immigration system. My personal focus continues to be on how we eliminate chain migration, which is a fundamental flaw in our current immigration policy &amp; threat to our national security. https://t.co/hIWWztSP9m"]["When 2 Dawgs &amp; a Yellow Jacket watch a game together, they’re usually not pulling for the same team, but last night, even I said “Go Dawgs.” Congrats @FootballUGA on an outstanding season. You have made our state very proud. #gapol https://t.co/1OSl225zu1"]["The good news keeps on coming. The tax bill we passed last month has ALREADY put more money back in the pockets of hard-working Americans, spurred investment, and ignited economic growth. #gapol https://t.co/jj4fNvBtoA"]["NEWS: \"1,000,000 Americans (and counting) will receive special bonuses from their employer thanks to tax reform\" https://t.co/TfLFmm63Vx"]["#TeamPerdue’s UGA alumni &amp; other DC Dawgs donned their red &amp; black today for #UGAFootballFriday. Good luck to @FootballUGA in the #NationalChampionship on Monday! https://t.co/DOCZBbx7B4"]["Thanks for your hard work to keep Georgians safe! https://t.co/lp7fkRK5af"]["Not only are 4,800 @TSYS_TSS employees in Columbus starting the year off with a $1,000 bonus, they'll also see more cash in each paycheck this February as a result of our tax cuts bill. #gapol https://t.co/x0E8yWAy7U"]["\"There is no doubt that our country’s new tax structure will have positive long-term benefits for American. We will be able to invest even more in aircraft and facilities, and we will be able to do so with even greater confidence about the future.\" https://t.co/dKRxYnFX4Z"]["More good news for American workers. https://t.co/v8EfcsouGF"]["Great news for @SouthwestAir employees. Like I’ve said – these tax savings get invested in workers, equipment, training, software, etc. and will be so stimulative for our economy. https://t.co/3oAwsCWNYv"][".@realDonaldTrump’s agenda is beginning to work and 2017 was a year full of significant accomplishments.\n\nHere are a few victories you probably haven’t seen on TV or read in the paper. \n\nRT to spread the word! #gapol https://t.co/lQhJkmrh4R"]["Happy 230th birthday, Georgia! The Peach State has been named the #1 state for business 5 years in a row, has a strong agriculture sector, large military community, bustling port, universities that attract top talent. One thing’s for sure – GA is leading the way! https://t.co/MQctqQEXTU"]["From this Tech grad: Congrats @FootballUGA on a well-played game. Looking forward to watching you play for the national title in Atlanta!"]["Happy New Year! Wishing you and yours many blessings in 2018. https://t.co/GBvMgvZ85Z"]["Shared some of my favorite photos from 2017 on Facebook. Check them out —&gt; https://t.co/bruJZcrX8x https://t.co/JRXrigKF3G"]["Looking forward to discussing @realDonaldTrump's first year success and our 2018 agenda with @MikeEmanuelFox on @FoxNews' @SpecialReport at 6PM. Hope you'll tune in! #gapol"]["MUST WATCH VIDEO: 3 families thought their taxes would go up under our tax bill. @CBSThisMorning had an accountant review their returns – ALL 3 get tax cuts. https://t.co/rHaK8JPkXj"]["I come from the business world where results matter. The results we’re seeing after @realDonaldTrump’s first year are fantastic. Read more about this year of accomplishments in @SavannahNow: https://t.co/yJWvTxZfRq"][".@realDonaldTrump is moving at a business pace, not a bureaucratic pace, and as a result our economy is in the midst of a turnaround. We made real progress this year, and in 2018 we need to keep up the momentum &amp; build on @POTUS’ early success. More: https://t.co/3L20x5SyZu"]["Happy birthday to our Senior U.S. Senator from Georgia, my friend @SenatorIsakson! It is a pleasure to serve alongside you in the Senate. https://t.co/ysSDMyzvzL"]["God bless our troops serving around the world who are away from their families this holiday season. Merry Christmas! https://t.co/auDlneN0rG"]["Bonnie &amp; I wish everyone a Merry Christmas and a happy holiday season! May you be filled with joy and peace today and throughout the new year."]["Some members of #TeamPerdue had a great time volunteering at the Atlanta Community Food Bank yesterday! https://t.co/BzujXCVhqU"]["I'm joining @IngrahamAngle live on the air shortly. Hope you'll tune in! https://t.co/vKvuqNhWhR #gapol"]["Glad to celebrate this historic day with such a great group of people! https://t.co/iYn5lE67cs"]["Wishing a very happy birthday to my cousin, and our Secretary of Agriculture, @SecretarySonny! https://t.co/TbSN9BT5Wo"]["I'm joining my good friend @THEHermanCain live on the air around 11:05 am ET. You can listen live here: https://t.co/CzcAiphuXU #gapol #tax"]["This is an historic achievement. These changes to the tax code mean greater job opportunities, more capital at work in our economy, and more money back in the pockets of middle-class American families. https://t.co/WiCysnU6Sm"]["I'm speaking on the Senate floor shortly about how important it is to get these tax changes over the finish line. Watch here ---&gt; https://t.co/IettNM8qZQ #gapol"]["Last week manufacturer optimism hit a record high in anticipation of these changes to the tax code. Read more here: https://t.co/1xQZuxpi14"]["Getting our corporate rate to be competitive with the rest of the world is the best thing we can do for the American worker, and I think that’s what you’re seeing in some of these optimism numbers now. https://t.co/34Igh4sxq5"]["This is a tax cut for the middle class. A family of four, making the median income of $73,000, is going to get a 60% tax cut. A single mom, with one child, making $41,000 is going to get a 75% tax cut. https://t.co/Ffr4Grmx4Y"]["I'm joining @SquawkCNBC shortly to discuss this historic opportunity to change our tax code. Hope you'll tune in! #gapol"][".@POTUS has laid out a clear path to protect our homeland. This strategy signals America’s commitment to reengaging as a global and economic leader. https://t.co/v1TM5nbCFk"]["This week, #TeamPerdue laid wreaths at Arlington National Cemetery, celebrated  @USNationalGuard’s birthday w/ @GeorgiaGuard, &amp; met w/ community leaders at Hawkinsville Hometown Connection. https://t.co/Hlpon14oFi"]["The UN’s acknowledgement of Iran’s destabilizing actions is critical to global efforts to reign in Iran and hold them accountable for their nefarious behavior. https://t.co/mIrZ2wER4y"]["Happy birthday to the @USNationalGuard! Grateful for all you do to keep our nation safe and secure both at home and abroad. #Guard381 #AlwaysReadyAlwaysThere https://t.co/NjzuwqhjD6"]["With this tax plan, America is back in business globally. Like @POTUS said today, \"America is coming back bigger and better and stronger than ever before.\""][".@JessicaV_CIS is right: the green card visa lottery &amp; chain migration are threats to our national security. The RAISE Act would end both. https://t.co/CMGlQg3NyD"]["#HappyHanukkah to all Georgians celebrating! Hope you have a wonderful holiday. https://t.co/5XTGKukkd1"]["The defense bill @POTUS signed today includes many priorities important to GA &amp; our military:\n\n• Protects JSTARS readiness at @RobinsAFB_GA\n• Allows for public-private partnerships at @DobbinsARB\n• Encourages cyber-training initiatives like those at @ArmyCyberCoE"]["By signing this defense bill into law today, @POTUS is strengthening our military by approving a well-deserved pay raise for our troops &amp; ensuring they have the resources they need to keep our country safe. #gapol"][".@AUG_Chronicle: “The terror attack underscores the drastic need for the United States to get ahold of its immigration policies. ... It’s time for America to choose its immigrants – to have more of a say in who comes here and stays here.” https://t.co/2W4TJj9IUY"]["We must remain vigilant in protecting our homeland. The RAISE Act would END chain migration &amp; ELIMINATE the outdated visa lottery program. https://t.co/FqR44roRG1"]["Happy birthday, Senator! Proud to be on your team &amp; grateful for your leadership. –Team Perdue https://t.co/OYkl6Hil2O"]["Enjoy the snow &amp; stay safe! https://t.co/RkBv0PQ70E"]["Today, we remember those who lost their lives in the attack on Pearl Harbor and the brave service members who fought back to protect our country. #PearlHarborRemembranceDay https://t.co/91rAOaJsuS"]["Speaking on the Senate floor shortly about the the importance of cutting the corporate tax rate &amp; the benefits that will result from changing our tax code. Watch here: https://t.co/IettNM8qZQ #gapol"]["My first international trip as a U.S. Senator was to Israel to meet w/ PM Netanyahu. By recognizing Jerusalem as the capital of Israel, @POTUS is recognizing both an historic &amp; modern reality &amp; sending a strong message of support to one of our closest allies. https://t.co/0oc7Af428b"]["Major bipartisan action in U.S. Senate today to roll back significant Dodd-Frank regulations. Great for small biz, community banks, &amp; regional banks. https://t.co/MvAtjdXFA8"]["The visa lottery is tainted by fraud &amp; abuse, &amp; has been identified as a national security risk for years. It's time to stop gambling w/ national security &amp; end the visa lottery. Read my column in @NBCNewsTHINK: https://t.co/DeVw4GXtkU"]["Spent some time writing holiday cards to our troops. So grateful for all they do to keep us safe, especially during this time of year. https://t.co/QX2lEs9Bl7"]["The tax bill the Senate just passed will allow working Americans to keep more of their hard-earned dollars. A family of 4 making the median income of $73k/year will see a 60% tax CUT under this plan. #gapol https://t.co/jjgccMrCEY"]["The U.S. is finally back in business after passing tax changes that will make us more competitive with the rest of the world. @SundayFutures #gapol https://t.co/0w12OXuG87"]["Going on w/ @MariaBartiromo on @FoxNews @SundayFutures at 10AM to talk about the tax bill the Senate just passed. Tune in if you can!"]["Congrats to @FootballUGA on a big win in the #SECChampionship! https://t.co/NaKcVCWj9f"]["The United States Senate just delivered on an historic opportunity to cut taxes &amp; fix the archaic tax code. This is a major win for the American people.\n\nFull statement: https://t.co/gDUpkfXEM7 #gapol https://t.co/nSWENk05CF"]["This tax bill is going to ignite our economy. Full interview w/ @FoxNews @ShannonBream: https://t.co/XEVL53ADw0 #gapol https://t.co/Dw30Z0s3Kq"]["Mic’d up &amp; ready to talk to @FoxNews @ShannonBream about the historic tax cuts the U.S. Senate is about to pass. Tune in now! https://t.co/hn9s4wIlE3"]["Let’s get it done. 👊 https://t.co/uMv5RiXQbH"]["Speaking on the Senate floor about changing our tax code. Watch here: https://t.co/OKGDYpj0Jc"]["137 economists: \"Economic growth will accelerate if the Tax Cuts and Jobs Act passes, leading to more jobs, higher wages, and a better standard of living for the American people.\" https://t.co/q7SoLEoPEi"]["I’m confident that this tax plan will put people back to work, put money back in their pockets, &amp; make our American economy – and the people who participate in it – competitive w/ the rest of the world. #gapol https://t.co/QMxDI9VyCZ"]["Thanks to @AFPhq, @FreedomPartners, @GenOpp, &amp; @LIBREinitiative for joining @SenThomTillis, @SenDeanHeller, &amp; me to talk about the importance of changing the tax code &amp; getting it done this week. ICYMI, watch here: https://t.co/B2egOdV1mr"]["It’s critical for Republicans and Democrats to put aside any self-interests and operate with a sense of urgency to get these tax changes done now."]["This tax plan is an investment to ensure that our children &amp; our children’s children continue to enjoy economic opportunity here in America."]["Under this tax bill, the average single parent w/ one child, earning $41,000/year, will get a tax cut of $1,400. That’s 75 PERCENT less."]["Under this tax bill, the average family of 4 earning the median family income will get a tax cut of $2,200. That’s 60 PERCENT less."]["We need to change the tax code to grow the economy, make us more competitive globally, help working Americans, &amp; ultimately start to solve our $20T debt crisis."]["Holding a tax event w/ @SenThomTillis, @SenDeanHeller, @AFPhq, @FreedomPartners, @GenOpp, &amp; @LIBREinitiative at 10:15AM. Stay tuned for a live stream link. #gapol"]["Bitcoin’s market value is larger than all but 29 of the S&amp;P 500 corporations in America. Asked Fed Chair nominee Jerome Powell about this bubble &amp; its effect on the Fed’s ability to implement monetary policy. https://t.co/llpLBqlbwH"]["The late Judge Sid Smith was a dedicated public servant &amp; true leader in his community. It was a pleasure to be in Gainesville w/ @SenatorIsakson &amp; @RepDougCollins today to name the courthouse in his honor. https://t.co/ilbgTPzpRF"]["Please remember to drive safely this holiday season. #DriveSaferSunday\n—&gt; https://t.co/Rh9FVLWuJX"]["Blessed to share lots of laughs &amp; great food w/ family today. Hope everyone had a wonderful Thanksgiving. https://t.co/cMV3u51Twd"]["Bonnie &amp; I hope all Georgians have a happy and safe Thanksgiving. As we gather w/ our loved ones today, please remember our troops spending Thanksgiving away from their families. May God bless them &amp; continue to bless the USA."]["This week, #TeamPerdue hosted a veterans' event w/ @CongressmanHice's office, checked out the progress being made on @AUG_University's new cyber center, &amp; went on a farm tour in Monroe County. https://t.co/vt1SkCYCLI"]["The @USArmy’s @3rd_Infantry – stationed at Fort Stewart – is a key part of Georgia’s proud military tradition. Happy 100th anniversary!https://t.co/MKFOf4h2hJ"]["Read the simple truth about America's awful tax code I learned as a Fortune 500 CEO in @NBCNewsTHINK\n—&gt; https://t.co/CwnVjSbpc3 https://t.co/tWXO4zXP8V"]["Great to be with you! Enjoyed discussing ag issues with GA farmers and industry leaders. https://t.co/1TpGmib57a"]["#TeamPerdue enjoyed thanking veterans at events across Georgia this week. We are so grateful for your service to our nation! https://t.co/zjb9eSN2iA"]["Great news for @DobbinsARB! This year's defense bill – passed by the Senate today – allows for public-private use of the base's runway, which will help offset operating costs &amp; create jobs. #gapol https://t.co/dKa5Z1jcm0"]["#TeamPerdue toured the At-Promise Youth Center in Atlanta yesterday to get a firsthand look at all the great work they're doing for the community. https://t.co/DyB1RNGwYq"]["If we can’t immediately eliminate the CFPB or bring it under Congressional oversight, we need someone to take the helm who will help undo the damage that’s already been done."]["In a few minutes, I'm going to speak on the Senate Floor about changing the tax code. Watch here: https://t.co/IettNM8qZQ #gapol"]["Congratulations to our new Secretary of @USArmy, Dr. Mark Esper! Looking forward to working together to meet the needs of all of GA's critical Army assets. https://t.co/fGJwD18zOZ"]["Worked to make sure the unique, important capabilities of @usairforce's JSTARS fleet were protected in #FY18NDAA. More in @telegraphga: https://t.co/ldmOj3WvEd"]["Catch my interview w/ @CSPAN's #Newsmakers at 10:00 this morning. Taking questions from @ajconwashington &amp; @JoePWilliams31!"]["#TeamPerdue was honored to be at Veterans Day celebrations across Georgia today. Thank you to our veterans for your service! https://t.co/ZNSLvkECGo"]["Thank you to our veterans &amp; their families for your sacrifices &amp; unwavering dedication to our country. Those who wear the uniform represent the very best our nation has to offer. #VeteransDay https://t.co/Db7ZxEPndq"]["Read more about Jim &amp; Simba in @rollcall: https://t.co/zB3Swj1qK6 https://t.co/8norM87C1Q"]["Happy birthday, @USMC! Proud to have 2 outstanding Marines, Jim &amp; Simba, on #TeamPerdue. #SemperFi https://t.co/9dGIqK4pE8"]["We are on track to deliver results and fundamentally change this tax code. \n—&gt; https://t.co/ih8OlZRBcF https://t.co/knH2LuvReG"]["Great to see Maj. Gen. Bob McMahon from Warner Robins before his Senate confirmation hearing today. Bob's many years of public &amp; private sector experience make him uniquely qualified to join @DeptofDefense. https://t.co/Ci9jK5G8zm"]["Democrats have repeatedly made false claims about our efforts to change the tax code &amp; bring relief to working Americans. Even the Washington Post gave them 4 Pinocchios. https://t.co/74VOIbpL7Y https://t.co/E3KzaUPbgk"]["Always great to see @ColumbusState President Markwood. Thanks for the update on what CSU's working on. https://t.co/HwcieNS7Nx"]["Shared w/ Braselton Christian Academy students a lesson my dad taught me: \"always add value to whatever you're doing now.\" https://t.co/oXT0m5bc9d"]["Good read by @VP in @USAToday: \"The U.S. economy is making a comeback because @POTUS has taken decisive action to spur a new era of opportunity, prosperity &amp; growth.\" https://t.co/RHAZLo2DZZ"]["Enjoyed our meeting! https://t.co/aF3E5zByvp"]["ICYMI – Watch our tax event w/ @KellyannePolls &amp; @stevenmnuchin1 at https://t.co/LaxIVKFmc8 https://t.co/nMUbL9YoPD"]["Special thanks to @KellyannePolls &amp; @stevenmnuchin1 for participating in our tax event today. It's critical that we get this done this year. https://t.co/DcXx1z1xOb"]["Think @SenJohnKennedy said it best: changing the tax code is about putting more money back in the wallets of hard-working Americans. #gapol https://t.co/OU5RUpkqMm"]["President Trump is moving at a business pace, not a bureaucratic pace. The American people expect Congress to do the same."][".@SenJohnKennedy: Changing the tax code is about letting you keep more of your hard-earned dollars."][".@SenatorRounds: To tackle the national debt, we've got to grow the economy. That's what changing the tax code will do."]["Simplifying the individual code = relief to working Americans &amp; their families &amp; could mean a $4-9k increase in wage &amp; salary income."][".@SteveDaines: \"This is about a wage raise through tax cuts.\" https://t.co/CfLrPMa4BE"][".@SenTedCruz is right: changing the tax code is about creating more opportunity for American workers and families. https://t.co/sFtbOMdoK1"]["This will lead to investment, jobs, and higher wages."]["As @KellyannePolls said, getting rid of the tax on repatriated earnings will help free up more than $2T in American profits locked overseas. https://t.co/oEQSvBWMiR"]["As a former Fortune 500 CEO, I can tell you that a lower corporate tax rate, even of 20%, will directly impact American workers."]["We have a historic opportunity to change our tax code – to lift up families, defend American workers, &amp; unleash our full economic potential."]["About to start a tax event w/ @KellyannePolls, @stevenmnuchin1, &amp; other senators. Watch LIVE: https://t.co/2lfXzemuEn  #gapol https://t.co/50Xrkbgr9b"]["Holding a tax event w/ @KellyannePolls, @stevenmnuchin1, &amp; other senators at 11AM. Watch LIVE: https://t.co/2lfXzemuEn #gapol"]["I'll be live on @CNN @NewDay in about 5 minutes. Tune in! #gapol"]["#TeamPerdue met w/ folks in southwest GA today to help them solve issues w/ federal agencies. Thanks to Grady Co. Farm Bureau for hosting! https://t.co/hEOvGOHt77"]["Bonnie &amp; I join the entire country in praying for the victims in Sutherland Springs, their families, &amp; first responders."]["Enjoyed catching up w/ Maj. Gen. Wesley, Commanding General of the @USArmy Maneuver Center of Excellence &amp; @FortBenning. #gapol https://t.co/8Q16mLcNPH"]["Met w/ @Broadcom after they announced they're relocating from Singapore to the U.S. at the @WhiteHouse. Congrats and welcome! #gapol https://t.co/6wWn6ZR7qv"]["See for yourself: https://t.co/6cFuwc7kZ4"]["Did you know IRAN – the world's largest state sponsor of terrorism – was the 3rd highest recipient of Diversity Lottery visas in 2016?"]["The RAISE Act would eliminate the Diversity Visa Lottery &amp; move us to a merit-based system that’s pro-worker, pro-growth, &amp; proven to work."]["Yesterday’s tragic attack was the 5th terrorist incident involving a Diversity Visa Lottery recipient since 2001."]["The world’s largest supporter of terrorism, Iran, is the 3rd highest recipient of Diversity Lottery Visas. https://t.co/ds4X2uxf8u"]["Our immigration laws are outdated &amp; don’t meet our country’s needs. Modernizing them is a national security issue."]["I'll be on w/ @IngrahamAngle on @FoxNews at 10:05PM to talk about the RAISE Act. Hope you'll tune in! #gapol"][".@realDonaldTrump is right, the Diversity Visa Lottery is a problem and is plagued by fraud. The RAISE Act would eliminate it. #gapol https://t.co/7WdZVaTosu"]["The RAISE Act would end the Diversity Visa Lottery. It must be part of any Congressional solution to fix our country's immigration problems. https://t.co/fHaZkigQcP"]["The RAISE Act would eliminate the outdated Diversity Visa Lottery, which is plagued with fraud. Read more: https://t.co/U0HiE1sche https://t.co/t5E6Uc8TMq"]["Our deepest sympathies go out to all affected by the senseless terror attack in NYC. Grateful to first responders for their quick actions."]["Headed to the Senate floor to speak about the national debt. Listen live: https://t.co/IettNM8qZQ"]["The #1 state for business is at it again! 👊 @macontelegraph #gapol https://t.co/8Z3Xn4u5i2"]["The UN must hold Iran to a tougher nuclear inspection regime. \nRead more on my letter to @nikkihaley in @FreeBeacon:\nhttps://t.co/48SykWyDtg"][".@SenatorIsakson &amp; I enjoyed meeting with some great folks from Augusta this afternoon to talk about tax, health care, &amp; regulations. #gapol https://t.co/UyHdmCXvrf"]["The markets have built in the expectation that tax is going to get done this year. Congress must act w/ urgency. https://t.co/D8wWSCUGP5"]["I've competed w/ companies like Nike &amp; Walmart. In the real world, you have to get things done FAST to keep up. DC has to pick up the pace. https://t.co/PW7sMIBqQF"]["The government should not be picking winners and losers. We need to level the playing field. #gapol https://t.co/oYwhvRwVlE"]["In my experience as a CEO, the tax on repatriated funds kept my companies from investing where we wanted to invest – right here in the U.S. https://t.co/CSBMlY46VR"]["Enjoyed talking tax at @Heritage w/ @adamnmichel &amp; @BizRoundtable's Joshua Bolten today. Thanks for having me!"]["Just went live on Facebook w/ @DailySignal. Watch here: https://t.co/XzQKPgPmZy https://t.co/ekytApu0F6"]["You can’t borrow 1/3 of what you spend in your personal life or in business. The gov’t won’t be able to get away with this for much longer."]["Pulling back on regulations &amp; making our tax code competitive with the rest of the world will create economic opportunity for all. @Heritage"]["We can't just tax our way out of the debt crisis, and can’t just cut our way out of it. Growing the economy is the first step. @heritage"]["I've lived in Asia &amp; Europe &amp; can say that the America has the best workforce in the world. We've got to take the tax burden off of them."]["The sense of urgency in Washington is not the same as what I lived with for 40 years in the real world. @Heritage #gapol"]["Repatriation tax = tax on American workers. We need to get rid of it. @Heritage #gapol"]["Our uncompetitive tax system puts us at a tremendous disadvantage and prevents companies from investing in the U.S. @Heritage #gapol"]["We need to fix the tax code to grow the economy, put people back to work, &amp; ultimately help solve the debt crisis. @Heritage #gapol https://t.co/R257bz7kBo"]["LIVE NOW: Talking tax w/ @adamnmichel &amp; @BizRoundtable's Joshua Bolten at @Heritage. https://t.co/qyFmu27mbF … #gapol"]["Talking tax w/ @adamnmichel &amp; @BizRoundtable's Joshua Bolten at @Heritage at 10:30AM. WATCH LIVE: https://t.co/qyFmu27mbF #gapol"]["👏 https://t.co/xH8iZFK5Lt"]["My interview with @SteveHiltonx airs tonight on @FoxNews' @NextRevFNC. Tune in at 9PM! https://t.co/ilOKxqzF3w"]["ICYMI: Last night, the entire Senate agreed that the budget process is fundamentally broken. Now it's time to change it. #gapol https://t.co/n3AWBgQD7k"]["Joining @THEHermanCain in a few minutes to discuss the budget and tax. Listen live here: https://t.co/mWkQQo9Dq8"]["Let's be clear: This budget is a sham. It's not a real budget. The only reason we're doing it like this is to get tax done this year. #gapol https://t.co/XdxmZblRhe"]["Something we can all agree on: vote-a-rama is utter nonsense. #gapol https://t.co/di7YS9U89s"]["The government should be funded by a clean-page, politically neutral platform, not a vote-a-rama dog and pony show. https://t.co/CjTjyYdODc"]["Washington's budget process is totally broken. Today we're voting on the \"budget\" 19 days after FY18 began. Irresponsible &amp; unacceptable. https://t.co/KCfnq2X5ov"]["There's a lot of work to be done. Let's get to it. Read more —&gt; https://t.co/UJISrQ92UB #gapol"]["Leader McConnell has our full support to turn the Senate on 24/7. We pledge to be available for voting day &amp; night to keep us on track. https://t.co/MOyihWQPDm"]["Our conference must be willing to change how the Senate operates both by tradition and by rule to combat partisan obstruction &amp; get results."][".@SenWhitehouse &amp; I filed a bipartisan amendment to the FY18 budget to force the Senate to acknowledge Washington's broken budget process. https://t.co/Wsn0xZyRWI"]["Enjoyed sitting down with @SteveHiltonx today to talk about the RAISE Act. Catch the interview Sunday night on @FoxNews' @NextRevFNC. #gapol https://t.co/DXdXcFj1zS"]["Read more about the PROTECT Act:\nhttps://t.co/0pUSTblVyE #gapol"]["Today, I introduced a bill to protect Americans' credit by simplifying the credit freezing process &amp; safeguarding consumers' personal info. https://t.co/NxCud1Vs2v"]["Organizations that collect sensitive consumer data must store it properly. If not, the consequence could be severe, as we've just seen."]["This budget is a sham. The only reason we're doing it like this – 18 days after the fiscal year began – is to get tax done this year. #gapol https://t.co/fGMimvOAqU"]["Joining @SquawkCNBC in a few minutes to talk budget and tax reform. Hope you can tune in!"]["#TeamPerdue met Everett Williams, 2017 GA Farmer of the Year, at @sunbeltagexpo today. Congrats, Everett! https://t.co/wBJynOzloL"]["Congrats, @ProfThomas! Looking forward to working with you. https://t.co/pVb0MvKCLj"]["Happy 242nd birthday to the @USNavy! Grateful for all our sailors do \"not for self, but for country.\" #242NavyBday https://t.co/Io2TL1DJMB"]["Pres. Obama's dangerous deal gave Iran a road map to develop a nuclear weapon. We cannot allow that to happen. @POTUS is right to decertify. https://t.co/9wmALUN2Ap"]["Obamacare needs to be fully repealed. In the meantime, @POTUS' action will relieve millions of Americans who can't afford health insurance. https://t.co/xAigPCuUxw"]["Thanks for having my team in the studio this morning, Laura and Bill! @newsradiosav https://t.co/P3iWSzpzB1"]["To realize our full energy potential, we need a renewed commitment to domestic nuclear energy. https://t.co/RhSVymQcrR"]["Joining Steve Nichols on @ValdostaToday around 8:30AM.\nListen in: https://t.co/Gj0L6Rmh7t https://t.co/yQxQRtV1Kz"]["Had a great visit to Valdosta today! Catch my interview with Scott James on @talk921valdosta tomorrow at 7:10AM. \n—&gt; https://t.co/cCGPU092tE https://t.co/QJ6l8vw1tj"]["President Trump's immigration priorities are spot on. #gapol https://t.co/mesKX95Bkd"]["Wrote more about this in @realclearpolicy: https://t.co/CjTjyYdODc"]["Thanks for asking. Budget resolution should be a law. Include every dollar being spent in budget. Consequences for failure to fund on time. https://t.co/edoz8kkL5K"]["Team Perdue was on hand to officially welcome Sandler AG to Perry yesterday. Great to see companies investing in the #1 state for business! https://t.co/Rbn370awrJ"]["The greatest threat to our national security is our national debt. READ my plan to address this crisis in @USATODAY: https://t.co/UeUcL2313Z"]["That's right. Read more in @rollcall: https://t.co/sX7vjWPRYB https://t.co/bBv04SfQDZ"]["Was honored to introduce Judge Tripp Self from Macon in his @senjudiciary confirmation hearing today &amp; enjoyed meeting his family. #gapol https://t.co/5QpHPFtekq"]["Our hearts break for the victims in Las Vegas &amp; their families. Follow @LVMPD for updates &amp; info on locating loved ones."]["#PrayForVegas https://t.co/lsEB1I3okZ"]["Praying for the victims of the horrific shooting in #LasVegas and for the first responders and doctors working to save others."]["Congrats to the 9 GA schools that received a National Blue Ribbon this year! Thanks for going the extra mile to help students succeed."]["Great to hear about the impact @valdostastate is having on South Georgia from their new president, Dr. Richard Carvajal. https://t.co/g6VR95OCXj"]["Enjoyed telling some young folks visiting the Russell Senate Office Building today about the man it's named after, GA Sen. Richard Russell. https://t.co/BX0VHbEz8G"]["Washington's broken budget process has failed time &amp; again. We have to reinvent it. READ my op-ed w/ @RepDougCollins:https://t.co/CjTjyYdODc"]["It's time to act now on a tax code that will benefit American workers &amp; help us start solving our $20T debt crisis. https://t.co/GQDeHWZ4K6"]["We've lost our competitive edge w/ the rest of the world b/c of our tax code. We need a sense of urgency like never before to get it back. https://t.co/rQ3VY4ct8s"]["U.S. corporate tax rate = highest in world. Right now, American companies are better off doing business overseas. We've got to change that. https://t.co/kwJZ7ai8kn"]["RT if you agree: We have to overhaul the tax code to grow the economy, help middle-class families, and make America more competitive. #gapol https://t.co/1MWWgNjQ2v"]["Talking taxes with @hughhewitt at 8AM. Listen live: https://t.co/3UDLx2yuLD"]["What happened today in Washington was a failure. Georgians and Americans are fed up, and they should be. #gapol https://t.co/Be4V9oLYtk"]["So proud of the great work @PrincipalWelch does for @MeadowcreekHigh. Congrats on being named a finalist for National Principal of the Year! https://t.co/v9AhDptHTI"]["Joining @MariaBartiromo on @MorningsMaria at 7AM to talk about the importance of getting tax done. Tune in! #gapol"]["My team was honored to meet w/ leaders of the Syrian White Helmets today. Nearly 100k lives have been saved under their leadership. Heroes. https://t.co/lTJ2pi721b"]["Interested in attending a service academy? Applications for a nomination through my office are due Wednesday.\n—&gt; https://t.co/A1FoMjWFSK https://t.co/6gPdgAiGV1"][".@POTUS sent a loud message to financial institutions around the world: choose between doing business w/ the US or supporting a rogue regime"]["READ my op-ed on why it’s important to audit the Department of Defense in @RCDefense —&gt; https://t.co/Btb3A5ACsj"]["The provisions I secured in this year’s #NDAA are the biggest step Congress has ever taken to hold DoD accountable for its finances."]["The DoD – the largest single discretionary line item in the federal government’s budget – has NEVER been audited."]["As a CEO, if I refused to provide audited financial results &amp; cited complexity as an issue, I would’ve been laughed out of the boardroom."]["Great news for Georgia! https://t.co/JQSzWPVi72"]["Joining @IngrahamAngle in 5 minutes to talk about the RAISE Act, President Trump's UN speech, &amp; more. LISTEN LIVE: https://t.co/igBfao85NV"]["Had a great meeting today w/ South Korean Trade Minister Hyun-chong Kim to discuss trade &amp; economic relations between our countries. #gapol https://t.co/GIxlF2u4LU"]["Happy birthday to my good friend from South Carolina, @SenatorTimScott! https://t.co/tkbwR4as6x"]["As @POTUS said today, all sovereign nations must come together to counter North Korea's reckless behavior &amp; growing threats from Iran. #UNGA https://t.co/8EOH62jolC"]["Secured many priorities important to GA's military community in #NDAA: DoD audit, JSTARS, cybersecurity, &amp; more. \n—&gt; https://t.co/Frok3Sy0Yl https://t.co/e3psKNuBDH"]["This year's defense bill is a step in the right direction but our military needs more support from Congress. #NDAA #gapol https://t.co/LlLymyAilq"]["I met w/ our troops in Afghanistan. @POTUS &amp; Sec. Mattis have finally given them what they've asked for: leadership. https://t.co/wQzxiD65vC"]["Happy 70th birthday to the @usairforce! Thanks for all you do to protect our nation. Fly, fight, win! #AFBday https://t.co/XEQRLrEBRF"]["The RAISE Act is pro-worker, pro-growth, and proven to work. It should be included in any DACA solution. #gapol https://t.co/ry59ZQQJnF"]["Any Congressional solution to DACA should also include the RAISE Act, which @POTUS endorsed and has broad national support. @foxandfriends https://t.co/uMKoCaLUBY"]["I'll be live on @foxandfriends in about 10 minutes. Tune in!"]["The Constitution is and must always be the guiding hand for our great nation. #ConstitutionDay https://t.co/xJve91tuE7"]["You are not forgotten. #POWMIARecognitionDay https://t.co/8KWwlK1ei6"]["Talked with Evelyn from Blue Ridge about her experience in the US Senate Page program on Facebook Live today. WATCH: https://t.co/32yrzT8T3g https://t.co/IdHnp8hOUT"]["Thanks to the crews working hard to restore power across our state. Keep up the good work! https://t.co/zlz34qJWFz"]["Worked w/ @Sen_JoeManchin, @SenThomTillis, &amp; @MarkWarner to develop bipartisan recs. to grow Appalachia's economy. —&gt;https://t.co/scaRDIDrvq https://t.co/nY5lw4xqB2"]["Joining @Sen_JoeManchin, @SenThomTillis, @MarkWarner, &amp; @BPC_Bipartisan to discuss ideas for economic growth. WATCH: https://t.co/9CP6coclH0 https://t.co/mBDJWNefSE"]["Yesterday, our country's debt surpassed $20 trillion. Washington has got to wake up. FULL STATEMENT —&gt; https://t.co/AbFSZcQ3kz https://t.co/L27ED8QQJA"][".@RepLoudermilk Best wishes for a speedy recovery to you and Desiree!"]["As my team saw last month, JSTARS is a critical part of our military. @SenatorIsakson &amp; I are fighting to keep it. —&gt;https://t.co/WY2djEIZ15 https://t.co/OdQHLWmXHZ"]["Thanks to first responders working hard to get our communities up &amp; running again. Until local officials give an all-clear, stay off roads."]["9/11/2001: Out of one of our country's darkest days came the spirit of American resolve &amp; resilience. Thinking of victims &amp; families today. https://t.co/5JrGmoQDbR"]["One of the many stories of Georgians coming together to help others as we brace for #Irma. Thank you to everyone lending a helping hand. https://t.co/DE7kAaIvzy"]["What you can do now:\n–Build emergency kit\n–Charge devices\n–Get Ready Georgia &amp; FEMA apps\n–Remove dead trees &amp; hanging limbs\n–Monitor weather"]["Update from @NWSAtlanta on how #Irma may affect North &amp; Central Georgia: https://t.co/kkN38wsxSd"]["Update from @GovernorDeal: As #Irma shifts westward, evacuation in zones B&amp;C in Chatham Co. is now voluntary. I-16 contraflow stopping soon. https://t.co/uczo9285Lt"]["ALL I-16 lanes are now traveling westbound. @gohsgeorgia says to exit I-16 before Dublin to avoid I-75 traffic.\n---&gt; https://t.co/cB2Je3iuAG https://t.co/WVjNbjvc8z"]["#Irma is getting closer to making landfall in the U.S. Be prepared, stay safe, &amp; help your friends &amp; neighbors.\n---&gt; https://t.co/mxpSxiOqn8 https://t.co/57yf3S66CM"]["Please take #HurricaneIrma seriously. If you're in the evacuation zone, follow instructions from local authorities &amp; move to a safe area. https://t.co/jft7sdxqkU"]["Stopped for a selfie and quick conversation w/ @gnfcc on my way to preside over the Senate. https://t.co/KGb1LYVhE9"]["Congrats, Congressman Lt. Col. Collins! Awesome news and well-deserved. Thanks for your service. https://t.co/e86k2caDER"][".@POTUS has my full support as he continues to make America more competitive &amp; simplify our tax system. #gapol https://t.co/DocGxwOK1K"]["I'm watching #HurricaneIrma closely. Please be prepared and follow @GeorgiaEMA for updates."]["Had a great discussion w/ business owners &amp; community leaders from @CobbChamber today – talked about taxes, regulations, health care &amp; more. https://t.co/zRIUrNC6BH"]["The RAISE Act should be part of Congress' immigration solution. #gapol https://t.co/ruuRhnqJSp"]["Please join me in continuing to pray for TX &amp; LA as they recover &amp; rebuild. Thx to all who are donating &amp; volunteering. #NationalDayOfPrayer"]["President Trump was spot on today. https://t.co/Q54yMI8wqx https://t.co/QL5pOhNNt8"]["Wishing a happy birthday to my friend &amp; colleague, @SenThomTillis! https://t.co/tVkGDzePmD"][".@165thAW Thank you for going above and beyond the call of duty to help those in need. We're praying for you and everyone impacted. #Harvey https://t.co/fNJDaHvw5C"]["#TeamPerdue recently visited peanut farms in South GA – 50k+ Georgians work in this industry &amp; produce over half of our country's peanuts. https://t.co/kasdAgRsux"]["Glad to see @AnheuserBusch in Cartersville &amp; many other GA companies stepping up to help those impacted by #Harvey. https://t.co/hR5kCO6zI9"]["Behind the scenes at the 2017 Jim Blanchard Leadership Forum at @ColumbusState. #gapol https://t.co/D3uudqx4nI"]["Happy Birthday, @GovernorDeal! https://t.co/hZzx3DzYax"]["@LizSchrayer Enjoyed it. Thank you for having me!"]["Honored to speak on a panel about America's role in the world w/ Ret. @USAirForce Gen. Hawley &amp; @mgol1068 of @CocaCola. @USGLC #gapol https://t.co/KD4R7B5ZVW"]["Had a great conversation w/ @bluestein, @WalterJonesNTH, @AtlBizGovt, &amp; @ShaddiAbusaid this morning. Nice way to kick off the day! #gapol https://t.co/Oj9XPk0hov"]["My national security team visited @RobinsAFB_GA to learn about the incredible work @GA_JSTARS is doing for @USAirForce &amp; @USArmy. #gapol https://t.co/gYvwMfPY1T"]["Thanks for having me today, @BlairsvilleCofC! Enjoyed hearing about the great impact your local businesses are having on our state. #gapol https://t.co/PtJwRQb1QS"]["Stopped by @gtimes to talk about health care, tax reform, the RAISE Act, and more. #gapol https://t.co/6hu2ruUAEf"]["Great to catch up w/ folks at @sspchamber. Our state chambers deserve much credit for helping make GA the best state to do business. #gapol https://t.co/570DG1GUV2"]["Enjoyed speaking to law enforcement officers at POAG's annual conference. Thank you for your service &amp; dedication to our community! #gapol https://t.co/z0lu9luMva"]["When I met with Gen. Nicholson &amp; our troops in #Afghanistan last month, this is exactly the type of plan &amp; leadership they said they need. https://t.co/BLiDLirpbN"][".@POTUS &amp; Secretary Mattis outlined a clear way forward for American involvement in #Afghanistan. My full statement: https://t.co/k4MQy9Y5Jl"]["Tonight @ 9 p.m., @POTUS will address the nation to outline the United States' path forward in Afghanistan. Tune in: https://t.co/6QD0qhEukY"]["Tomorrow, a coast-to-coast solar eclipse will happen for the first time in nearly 100 years. \n\nCheck out these viewing tips from @NASA: https://t.co/bnALprjh7T"]["KKK, neo-Nazi, &amp; white supremacist groups spew bigotry &amp; racism. These groups &amp; their ideals are the antithesis of American patriotism."]["I've lived &amp; worked in Asia. We need to protect IP rights wherever they originate—they’re key to many economies. ---&gt;https://t.co/iacw2z92Lj"]["The violence we've witnessed today is not who we are as a country. Our thoughts go out all law enforcement working hard to keep the peace."][".@AUG_Chronicle: RAISE Act takes America's best interests into consideration. Read more ---&gt; https://t.co/mKDC7BPzq4 #gapol"]["The RAISE Act is pro-worker, pro-growth, &amp; proven to work. @politico / @morningconsult poll shows people agree. ---&gt; https://t.co/Smte3QNRKv https://t.co/7lFxbjV5LL"]["Georgia is a great place to do business! $400 million investment and 200+ jobs coming to @maconbibb. #gapol https://t.co/W2VwkUc1L2"]["The RAISE Act is pro-worker, pro-growth, and proven to work. Check out my op-ed w/ @SenTomCotton in @usatoday: https://t.co/YCgj24aIwP"]["In about 10 minutes, I'm joining @IngrahamAngle to discuss the RAISE Act, North Korea, &amp; more. LISTEN LIVE: https://t.co/AxoKElFl8W #gapol"]["Great news for Georgia! #gapol https://t.co/8umPZiYKCL"]["Last week, the Purple Heart Preservation Act passed the Senate by unanimous consent. #PurpleHeartDay \nRead more: https://t.co/UacGKvWWDO"]["I introduced legislation to protect the Purple Heart and stop dealers from profiting off of the sacrifices of our heroes. #PurpleHeartDay"]["Last April, I had the great privilege of presenting a Purple Heart medal posthumously to the family of 1st Lt. Snyder. #PurpleHeartDay https://t.co/UDbm7oVbOO"][".@SenTomCotton &amp; I joined @TuckerCarlson on Fox News earlier this week to talk about the RAISE Act. Watch here: https://t.co/1Ot2y5FQ6A"]["I'm joining @LouDobbs live on Fox Business shortly. Tune in!"]["The immigration system we are proposing is pro-worker, pro-growth, and it's been proven to work. Full @foxandfriends interview: https://t.co/UoxID0HEhT"]["Coming up on @foxandfriends! https://t.co/hMhuGjzZ21"]["I'm about to join @foxandfriends live on Fox News. Tune in!"]["Coming up with @SenTomCotton and @TuckerCarlson! https://t.co/lJfVWx8kgc"]["I'm discussing the RAISE Act with @SenTomCotton &amp; @TuckerCarlson on Fox News shortly. Tune in! #gapol"]["My full remarks at the @WhiteHouse today on the RAISE Act. https://t.co/9KlcRSOgOy"]["Joining @SenTomCotton in introducing the RAISE Act. Learn more here: https://t.co/U0HiE1sche #gapol"]["Great news for Georgia! #gapol https://t.co/JXcxbHYaTJ"]["Throughout this entire health care debate &amp; repeal process, we have witnessed everything that's wrong w/ Washington. Here are my thoughts: https://t.co/CCSS05Qj00"]["In 2014, the IRS – because of #Obamacare's individual mandate – fined nearly 8 million people almost $1.8 billion. https://t.co/wcQWjhecwI"]["Congratulations to Marietta Police Chief Dan Flynn for being named Chief of the Year! https://t.co/ARRXq0AGdA"]["I haven't seen a number come out of the CBO that I would depend on yet. Here's why: https://t.co/DWYcDr33Z2"]["Premiums in Georgia are going up 42% next year, and 96 of 159 counties only have one insurance carrier. That's under #Obamacare. https://t.co/EC6RjMziaR"]["Last night, I listened to a stream of misinformation on #Obamacare. This was my response: https://t.co/iUIuZKZYRY #gapol"]["Great to see @newsradiosav's Laura Anderson today and her daughter who is in 5th grade and in our nation's capital for spy camp! https://t.co/zgPfauNOBn"]["Congrats @USNavy on the commissioning of the first in class aircraft carrier #USSGeraldRFord https://t.co/Gj4cTDilSH"]["Ran into some former Georgians on a @uscapitol tour yesterday. Now current residents of Colorado &amp; fmr military. Thanks for your service! 🇺🇸 https://t.co/XzUszVZG2h"]["So proud of our @GAChamber. Well deserved! https://t.co/PuP0aAzl7g"]["John McCain is a true patriot. If anyone can tackle a challenge like this, it's him. He, Cindy, and the McCain family are in my prayers."]["Obamacare is collapsing. It's time to do something now before more people lose coverage. https://t.co/8w7ikshJwF"]["Coming from the business world, I've noticed self-interest too often trumps our national interest in Washington. https://t.co/qEfCcQYXuA"]["In a few moments, I'll be joining @MorningsMaria on @FoxBusiness. Hope you can tune in! https://t.co/VL8iLV1poW"]["Congrats to Atlanta-based startups @landinglion, @bloveitinc, @fraudmarc, &amp; @moqualityinc. @techstars #TechstarsATL https://t.co/AdEnRgoidv"]["Last month, the Senate overwhelmingly passed new non-nuclear sanctions on Iran. We need the House to act quickly &amp; do the same. https://t.co/USPLWGaZHf"]["…and Defense Sec. Mattis says Iran is still “the largest long-term challenge to Mideast stability.” https://t.co/6huYeUH8Yo"]["Iran’s influence &amp; aggression have continued in Iraq, Syria, Lebanon, and Afghanistan: https://t.co/DIs3CpxA7h"]["Iran is also still holding two Americans hostage: https://t.co/kDfLrayaje"]["Iran continues to blatantly violate UN Security Council Resolutions w/ its ballistic missile tests: https://t.co/CarrdOh8z4"]["From backing Hamas to Hezbollah, and more, Iran is still the world’s largest state sponsor of terror: https://t.co/Wal4oPwf0t"]["Today marks the 2 year anniversary of the Iran deal. Since then, this rogue regime has only continued its bad behavior."]["In a few moments, I'll be joining @BloombergTV. Hope you can tune in! https://t.co/4bR00iX6gJ"]["It's time to get results for the American people. RT if you agree. https://t.co/XYb9eCBL8t"]["In a few moments, I'm joining @SiriusXMPatriot to discuss Aug. recess delay &amp; Congress' work to pass a budget. Hope you can tune in! #tcot"]["Just hung up with Tim. Calling into @newsradiosav to talk with Laura and Bill. Tune in if you can! #gapol"]["I'm joining @WGAUradio in a few minutes to discuss the August work period postponement &amp; health care. Hope you can tune in!"]["Join me now on @MorningsMaria on @FoxBusiness. #gapol https://t.co/GcK2RLbffr"]["Now it's time for us to get to work."]["👍👍 #HillStaycation https://t.co/UbBl3utuC1"]["People back home won't tolerate the Washington gridlock. Congress must stay &amp; work through August to get real results for Americans. https://t.co/iSY8T8FXF3"]["This is a positive, constructive effort to get results for the American people."]["We're still live now discussing why we should cancel or heavily shorten August recess: https://t.co/Jy0ER82NrX"][".@SenThomTillis: Shortening or canceling August recess is \"pivotal\" to getting things done."][".@SenMikeLee: \"We have an enormous amount of work to do... it doesn't make sense to take the month of August off.\""][".@SenDanSullivan: \"We can create more time\" to deliver results."][".@SenatorStrange: \"We need to solve real problems that effect real people.\""][".@SenatorRounds: \"This process has worked just 4 times in 42 years.\""][".@SenJohnKennedy: The American people care about results."][".@SteveDaines: \"If you were getting failing grades, you better go to summer school, don't take a recess.\""]["We're live now. Tune in here: https://t.co/Jy0ER82NrX #gapol #HillStaycation"]["Less than 10 mins. out from our press conference on canceling August recess. Hope you'll tune in here: https://t.co/HCohaqh760 #gapol"]["I agree. A group of us are holding a press conference today at 12noon. https://t.co/XL2k50pWLC https://t.co/GolKmn5qRr"]["Check out three Team Perdue pups featured in @rollcall's Dogs of the Senate! 🐾 https://t.co/K4e3M7xlM8"]["Wishing our 43rd President George W. Bush a very happy birthday! https://t.co/107aKvJwkg"]["Great news! @Starbucks Augusta plant to nearly double in size &amp; create up to 100 new jobs. Check out pictures here: https://t.co/L3MgO6SlWh https://t.co/5cBgV3D8Cc"]["The Georgians serving in #Afghanistan are a true testament that America's best &amp; brightest are in uniform. Can't thank them enough. https://t.co/h8i5xHK6zE"]["I can't think of a better way to spend #IndependenceDay than with the women &amp; men fighting every day to defend our freedom. https://t.co/wsFsfdNHkc"]["Today we celebrate America's 241st birthday &amp; we remember the resolve of our founding mothers &amp; fathers who fought for independence. https://t.co/o3RUHx9hTs"]["Failure is not an option. Proud to be joined by 9 Senate colleagues in this effort: https://t.co/3GzX1BFArC (2/2)"]["If we haven't made progress on 5 key items by the end of July, we should cancel or shorten August recess: https://t.co/3GzX1BFArC (1/2)"]["Glad to see that #KatesLaw passed the House today. I look forward to voting for it in the Senate."]["Thanks for sharing, @RepMarkMeadows! #gapol https://t.co/GqCYFiviGe"]["RT if you agree! https://t.co/3RGdojyCBQ"]["@RobertBluey @IngrahamAngle @DailySignal Thanks for sharing!"]["Thanks, @freedomcaucus! We have to prioritize national interest over self-interest. https://t.co/fonKUbLpwu"]["Change is never easy, but Americans are expecting our full &amp; best effort. Failure is not an option. https://t.co/VWliLQ1YNa"]["If we haven't made progress by the end of July, we should pull the plug on August recess. RT if you agree: https://t.co/1RAJM9e7iO"]["The norms of DC—including recess—must never stand in the way of our efforts to act on the people’s priorities. https://t.co/1RAJM9e7iO"]["The only appropriate response is to pull the plug on August recess. Read my full thoughts here: https://t.co/1RAJM9e7iO #gapol https://t.co/2F1f6bczeh"]["One thing is totally clear: There isn’t time to deal with the issues that demand immediate attention."]["The Senate has just 35 working days left until the end of the fiscal year on September 30."]["SCOTUS reinstated much of @realDonaldTrump's EO. The world is a very dangerous place and the President is right to try to protect Americans. https://t.co/8aSJX2mvQL"]["Wishing the Georgia cadets good luck at #JLAB2017. You're making Georgia proud."]["Big win for #veterans today. Congrats to @SenatorIsakson for all his hard work to make sure our #vets get the care they deserve. https://t.co/EeKVZMTGGe"]["Here are my thoughts on the draft health care bill: https://t.co/kyRL76WR5c"]["Meet the 2 Georgia high school students who were presented w/ @theaward's Gold Medal today at @uscapitol. Full video avail on my @facebook. https://t.co/visaw243Gn"]["In celebration of #NationalSelfieDay, here are a few of my faves w/ Georgians visiting the @uscapitol #gapol https://t.co/uIRZku9vWM"]["Wow. Hoping everyone is safe in Augusta. https://t.co/boeqOLKvWb"]["Great news for our state, growing cybersecurity workforce, &amp; @AUG_University. Check out the new training facility: https://t.co/5tGJDq9Hla https://t.co/8UXE3QmaPa"]["Heartbreaking news. Keeping the Warmbier family in our thoughts, along w/the other innocent people unjustly jailed &amp; tortured in North Korea https://t.co/eNsfjPFer6"]["Congrats &amp; safe travels to our Georgia teachers headed to DC for @LibraryCongress' Summer Teacher Institute. @TeachingLC #LCTeachInst #gapol https://t.co/N0mpqp3O6P"]["The big issue is what you do w/ Syria once this is over? It's a non-state today. Here are my thoughts: https://t.co/OoMbyWqZqm"]["This action in Syria sends msg not only to Russia but also to Assad.No more chemical weapons&amp; we’re going to defend our people on the ground https://t.co/lv5IJOl6yc"]["On set w/ @SquawkCNBC this morning to guest co-host the show. I'm on until 8am &amp; 1 of our guests is @SecretaryRoss. Hope you can tune in! https://t.co/StrF98Cjxa"]["Happy Father's Day to all Dads &amp; Granddads out there. Proud of my 2 sons for being outstanding fathers to their children. https://t.co/KVTADMnaZB"]["On this day in 1777, a resolution called for an official flag of the United States. Today, we honor the Stars and Stripes on #FlagDay. https://t.co/eQ5gHAKWMt"]["Happy 242nd Birthday, @USArmy. Thank you for your great service to our country. https://t.co/kjoZJmRcVO"]["It is not said enough. Thank you to our @CapitolPolice for their heroism. Praying for all who were injured this morning. https://t.co/g0nXFAiv6t"]["Our heartfelt prayers go out to all of the members, staffers, and Capitol Police officers affected this morning."]["My staff and I are safe."]["In about 15 mins, tune in to @FoxBusiness @MorningsMaria. We're discussing nat'l debt &amp; Washington's broken budget process. #gapol"]["Having a great time welcoming our new group of interns. Glad to have you as a part of the team. https://t.co/TBKyzcNMB7"]["Joining @BloombergTV now to discuss our @BudgetGOP hearing w/Secretary Mnuchin today. Hope you can tune in!"]["Congratulations, @GeorgiaSwarmLAX - NLL Champions! https://t.co/iibVgedCem"]["Wishing President @GeorgeHWBush a happy birthday! #41 https://t.co/lHIzqS7xlO"]["Great news for Georgia! #gajobs https://t.co/wWL2cA3r9z"]["Sharing a few photos from this morning's breakfast honoring 20 Georgians nominated &amp; appointed to US Service Academies. Congrats to all! https://t.co/g1zKERtd7X"]["Join me now on @FoxNews w/ @BillHemmer. We're talking about #Comey hearing &amp; more. #gapol"]["Praying for all impacted by this tragedy. https://t.co/FTwiJF5DIM"]["Happy Birthday to a great leader and friend, @VP Mike Pence! https://t.co/RdGZ0MGkPo"]["Great to meet w/ Mayor DeLoach &amp; #Savannah community leaders this morning. #gapol https://t.co/RW1N8T509M"]["Today @POTUS chose to make a clean exit from the #ParisAgreement which was a perfect example of Obama-era overreach. https://t.co/THoEtjfmed"]["Keeping Army Spc. Murphy &amp; his loved ones in my thoughts &amp; prayers. GA is grateful for your service to our nation. https://t.co/38PY1Zc8Gq"]["Our nation’s best and brightest have served in uniform. Today we remember all those who made the ultimate sacrifice to protect our freedom. https://t.co/10BvA9pvjO"]["Happy to hear @GaPorts had busiest April on record. 334,950 tons handled, up 13% from last yr via @AtlBizChron. https://t.co/8uhxfu13D8"]["You can help re-name the @GwinnettBraves! Suggest a new name by following the link. https://t.co/z0JMHVLBY8"]["Every dollar Washington spends—every dollar we are debating here today—is borrowed money. #debt @BudgetGOP https://t.co/fbhKwVUn6T"]["#Budget process is absolutely broken &amp; it has only worked four times in 43 years. This is unacceptable and must be fixed. https://t.co/VYTCrO9LE2"]["Thank you to #OMB Director Mulvaney for addressing #debt in @BudgetGOP hearing today. Big gov't has failed our country. https://t.co/VojSPn2dkH"]["RT if you share the same concern w/ issues our country is facing today. @FoxNews https://t.co/9NQ4acrfyD"]["#Obamacare is collapsing under its own weight and doing nothing is not an option. #gapol https://t.co/CK1HQUmSDI"]["Team Perdue joined Pickens County Rotarians as they dedicated their peace pole in Jasper. #Georgia https://t.co/zZz9BKp2e0"]["Congratulations on @CobbChamber retirement, David. Best of luck on your next journey! https://t.co/YMRS1JK3Oh @AtlBizChron @mdjonline"]["GA continues to be a leading contributor to national security, building on our long &amp; proud military tradition. https://t.co/cW6Mjwm8Ye"]["Together, we will defeat those who commit these acts of terror. My heart is with victims &amp; families of the senseless attack in Manchester."]["Happy Birthday, @GwinnettChamber! https://t.co/OhsuLUxArU"]["Congrats to 1st Floyd Co. school to be #STEM certified. More via @romenewstribune. https://t.co/EZrW3hdnjg"]["Motivational story abt Gary Freeman working his way to success at @ColumbusState. Congrats, Gary! https://t.co/WCsE0P1oTa"]["Great read about @WellStarHealth's impact on GA's economy in 2016 via @AtlBizChron: https://t.co/JsNrpmX48N"]["Congratulations, Dante Blackmon! 1st NFL player from @kennesawstate. @kennesawstfb  @11AliveNews"]["Team Perdue was at the re-opening of the I-85 bridge this afternoon. Read my statement here: https://t.co/uXTrIjvC1X #gapol https://t.co/V5sXGNyCSH"]["Wanted to share some of my favorite highlights from meeting with Georgians this morning. Check… https://t.co/7XWYSuDknG"]["Obey the law or pay for the wall. Check out this article on a bill I just introduced w/ @SenatorStrange. https://t.co/Y1VaIlmuzA"]["Enjoyed seeing photos of Floyd Co. Cattleman's Assoc. showing appreciation for police officers. https://t.co/jEaW8kquNC @romenewstribune"]["Wishing Senator @maziehirono a speedy recovery during this challenging time. https://t.co/uSZLw7KwBU"]["Thank you to each of the great Georgians who came to meet with me this morning! #gapol https://t.co/KPwWRYqpMp"]["Glad to see you're doing well, buddy. See you soon. https://t.co/TYrscvzDhj"]["RT if you agree, border-adjustment tax doesn't have a place in tax reform package. #BAT #taxes"]["Join me now on @BloombergTV! https://t.co/aqdT5NwwAJ"]["5 days ago, Acting FBI Director McCabe said \"there has been no effort to impede our investigation.\" https://t.co/onsPBLq23s #FBI #Comey"]["#Cartersville is home to one of @AnheuserBusch's breweries. Great to see investment and positive economic impact in GA. https://t.co/O2Y9kPSw4L"]["Tune in to @FoxNews after the commercial break. I'm speaking w/ @TeamCavuto in a few minutes. #gapol"][".@SenatorStrange &amp; I want to stop #sanctuarycities from putting politics over safety &amp; security. More via @zpolitics https://t.co/9hkKg7suCv"]["Joining Georgians &amp; Americans in thanking our police officers for their hard work &amp; remembering our fallen heroes. #NationalPoliceWeek https://t.co/oxtPMyfoj5"]["Congratulations on becoming newest NCI-designated comprehensive cancer center, @WinshipAtEmory! Thank you for your outstanding work. https://t.co/bPR1Run5Ms"]["Washington is always running to latest distraction. There has been progress, but we've got some heavy lifting yet to come. @SquawkCNBC https://t.co/ATiFIMrLTk"]["Had a great time w/ @SenJohnBarrasso at @SquawkCNBC this a.m. Watch our full interview here: https://t.co/LAtr5EUDxx https://t.co/P8LnjsfkHZ"]["Today and every day, I have sincere gratitude for our women &amp; men in uniform and their families. Thank you for your tireless service. #USA https://t.co/zKfEnSNNo9"]["It's about time we break some eggs in Washington &amp; change the direction of our country. @SquawkCNBC #gapol https://t.co/HYUzG3L0l9"]["NOW: Tune in to @SquawkCNBC. We're talking about #healthcare &amp; #taxes. @SenJohnBarrasso https://t.co/VT6T0ZfAvd"]["In about 15 mins, join @SenJohnBarrasso and me on @CNBC @SquawkCNBC. https://t.co/VT6T0ZfAvd"]["Grateful for this wonderful wife, mother &amp; grandmother on this special day. Happy #MothersDay to all moms &amp; thanks for all you do. https://t.co/jJARSqCQir"]["Bonnie &amp; I are saddened about sudden loss of Oglethorpe Police Chief Cannon. Praying for his family &amp; friends. https://t.co/B9rWKhxXDf"][".@POTUS acted decisively &amp; within his authority. FBI is larger than 1 person. I'm confident a new director will be nominated, confirmed ASAP"]["Great conversation w/ Dr. Mary Campbell abt @SpelmanCollege's thriving #STEM education program. Excited to continue dialogue in the future. https://t.co/XYjT9yGf2s"]["Catching a quick break w/ my hardworking team. Great to have Georgians from Dahlonega to Sylvania on staff. Thank you for everything. #gapol https://t.co/k9OKY3FMX5"]["Great to meet w/ @GeorgiaTech President Bud Peterson. Proud to have a strong relationship with my alma mater &amp; Yellow Jacket community. https://t.co/pAxaotlL2d"]["Praying for Georgians affected by the #WestMims fire. Follow @GaTrees &amp; @GeorgiaEMA for updated information on the disaster. #gapol https://t.co/acoDxhjGZX"]["Happy #NationalTeachersDay to all of Georgia's excellent educators. Thank you for all you do to shape our students &amp; keep them safe. https://t.co/2xm4wuapXW"]["With the debt crisis &amp; the problems we have funding the military - we can’t take anything for granted. @telegraphga https://t.co/PSy2JSQ3KN"]["@jfuchko3 Thank you for your great service to our state and country."]["Good news for Houston Co - fire station No. 6 is coming close to being finished. Congratulations! @telegraphga https://t.co/BuhfVCnii8"]["It was great to meet with the General Aviation Manufacturers Association this week. #gapol https://t.co/TF6yJWXr2f"]["Great news for Georgia! Elixir Extrusions to bring 100 jobs to #Douglas. Read more via @AtlBizChron. https://t.co/RLZnkULbw0 #gapol"]["It is imperative to fix the broken budget process &amp; keep our eyes on the bigger picture. #gapol https://t.co/MTJv3ztdjk"][".@themobserver shares a great photo of Hamilton ES students w/ @VP Pence. #gapol https://t.co/JWEuceuf74"]["Congratulations to all @GaSouthwestern grads! https://t.co/tHfINtAz01"]["Congrats to GA's Small Business Person of the Year, Kevin Boykin - CEO of Path-Tec in Midland. @SBAgov #gapol https://t.co/J8gRxQ5UaM"]["Great news for Georgia! Proud of each person who is making I-85's transition as smooth as possible. #gapol https://t.co/5DKQRVwFgv"]["Keeping 1st Lt Weston Lee &amp; his loved ones in my thoughts &amp; prayers. GA is grateful for your service to our country. https://t.co/vtkcUny1nX"]["President Trump is fighting to significantly downsize the scope &amp; scale of the federal gov't. #gapol @POTUS https://t.co/R47OEdcwKF"][".@POTUS knows job one is to get economy growing again. His leadership in First 100 Days shows he is doing just that. https://t.co/A9yNH0gjqk https://t.co/onGajHvibM"]["Honored to be w/ students interested in our U.S. Service Academies today. Thank you for your willingness to serve. https://t.co/VdqyWTqaXn"]["Bonnie and I are keeping the family and friends of these heroes in our prayers. https://t.co/Wf1WBfPHnF"]["I had a great time at #NRAAM2017 today. Thank you, @NRA. #2A @NRATV https://t.co/oOmx6bAfFH"]["Successful turnarounds start w/ serious change in direction. Read my op-ed in @FoxNewsOpinion: https://t.co/6PJ53yFAqp"]["Member of my team was honored to attend the Nicholas Smarr &amp; Jody Smith Memorial Dedication at @GaSouthwestern in #Americus today. https://t.co/jywkpk47Pu"][".@GwinnettChamber brought a guest to our meeting w/ @SenatorIsakson for daughter in 2nd grade. Couldn't say no to #FlatStanley selfie. https://t.co/VY37B45Vhx"]["Tune in &amp; join me on @SquawkCNBC now. We're talking @POTUS' First 100 Days and tax plan. https://t.co/KKwPr9mmKW"]["North Korea is a rogue nation that must be reined in. Their threatening behavior will not be tolerated. https://t.co/32uVCsS0kf"]["Members of my staff recently visited farms w/ blueberries, pecans and olives in Lanier, Lowndes, Berrien &amp; Clinch Counties. #GeorgiaGrown https://t.co/U5tDn95fFi"]["People who are looking at results of @POTUS in First 100 Days are seeing hope. @NewDay @CNN https://t.co/wJ6jFymmC4"]["Honored to receive the \"Friends of Farm Bureau\" award from @GaFarmBureau. Thank you! #gapol #GeorgiaGrown https://t.co/ThPWFvNd3t"]["Great to speak at @GaFarmBureau this morning w/ my cousin @SecretarySonny. #GeorgiaGrown https://t.co/30qK2d9T3C"]["Join me now on @CNN New Day. #gapol https://t.co/tabeCP1YKd"]["Proud of our @USDA Secretary being sworn in this morning. Next step is to welcome @SecretarySonny to #Twitter. https://t.co/FWYVF4ft1R"]["Congratulations to my 1st cousin, Sonny, on being named the next Secretary of Agriculture. @USDA #gapol https://t.co/FAkTca1vfb"]["Expressing deep sadness &amp; respect for 6M Jewish people murdered during #Holocaust. #HolocaustRemembranceDay https://t.co/8cyGSwCsYV"]["Sharing a photo of Team Perdue &amp; Team @SenatorIsakson at @RobinsAFB_GA w/ Team #JSTARS for mission updates. https://t.co/G1vvartalL"]["Sharing a good story abt @POTUS honoring Rep. @ClaudiaTenney's son, Trey, who was deployed to Iraq on Saturday.\nhttps://t.co/GzxbH1DzXQ"]["Congrats, @CityStatesboro - @ABCommunities competition winner. Check out their winning #BoroBlueMile plan here: https://t.co/jIrxMZi0b5"]["#TBT to a member of my staff shaking the trees for #Pecan harvest at Pecan Ridge Plantation in Bainbridge. #GeorgiaGrown https://t.co/pkmaTVrUAA"]["Team Perdue had a great time at the @NGTC industrial tech center groundbreaking yesterday. https://t.co/P9iPMTGLME"]["Best of luck! https://t.co/k30Ha3FfqU"]["Last week, @GeorgiaTech's Shane Kimbrough made it back safely from space. Congrats &amp; welcome back! https://t.co/n8bLQashKd"]["Bonnie and I had a great time at the @Braves game at @SunTrustPark last Friday. #GoBraves #ChopOn https://t.co/8FBVqWSPdI"]["From my family to yours, have a happy and blessed Easter. https://t.co/3MENv93Mb8"]["I applaud each hero being honored by the @WhiteHouse today. You make Georgia proud! https://t.co/VsI7VUZyTU"]["Join me in about 5 mins w/ @THEHermanCain. Listen here: https://t.co/X8rCovCx2q #gapol"]["There is a longer-term strategy to re-engage on int'l global scene to support &amp; defend America's interests around the world. @FoxNews https://t.co/2pKJhlYj1q"]["In 5 mins, I'll be on @FoxNews w/ @marthamaccallum. Tune in now! #gapol https://t.co/TACFvImpQJ"]["My staff &amp; I had the pleasure of visiting @childrensatl Egleston campus. Thanks for having us! https://t.co/8wus0ImsNy"]["Dr. Johnson is passionate abt education &amp; equipping @CAU students w/ tools needed to become leaders of tmrw. Look fwd to cont'd partnership! https://t.co/ej9FNCaVLg"]["Saw I-85 damage 1st hand on the ground, I'm confident we will get our interstate up &amp; running again as soon as humanly possible. https://t.co/3an9w9ups3"]["After touring I-85 bridge repair, I'm very impressed by how quickly #Georgia got down to business to diagnose &amp; start reconstruction. #gapol https://t.co/uxUv9ORh9l"]["Job One is to get the economy growing &amp; we’re already making progress. @dekalbchamber @brookhavencc"]["As this evening's sundown begins, Bonnie and I wish the Jewish community around the world a #HappyPassover."]["Syria is a microcosm of many problems around the world we have to solve militarily &amp; diplomatically. Bashar al-Assad must go. https://t.co/zLxK8VY0km"]["Honored &amp; proud to confirm Judge Gorsuch. I'm certain he will continue to show remarkable leadership, integrity, &amp; evenhandedness on #SCOTUS https://t.co/gN4lMfFnnF"]["Assad's inhumanity in Syria will not be tolerated. https://t.co/JbfFbqsgcK"]["Judge Gorsuch's rulings will be just &amp; based on the letter of the law. https://t.co/AQ6Sp0kWKS"][".@Delta brought a great group of pilots, flight attendants, &amp; personnel to discuss federal issues impacting the airline industry. Thank you! https://t.co/25mvWExWaE"]["Partisan politics must not be standard operating procedure w/ #SCOTUS nomination. More @Albany_Herald: https://t.co/roUbF3JJjU"]["Good to be with KJ visiting from Douglasville w/ the National Down Syndrome Society. https://t.co/Kc9gdyciBg"]["Great to meet Glascock County Commissioner Jeffery Chalker &amp; his wife, Amanda. Thanks for stopping by. #gapol https://t.co/5FsLe4Ardl"]["Had fun w/ the Crozier Family visiting from Dudley today. Can you tell those three are triplets? https://t.co/e6ZrtCeAGK"][".@AUG_Chronicle shares why Judge Gorsuch is the best man for #SCOTUS. Read more: https://t.co/JzhzoggPCo"]["Thanks to @FVSU Cooperative Extension Program for sharing an update on your program &amp; education resources this morning. Go Wildcats! https://t.co/thIkfp6boM"]["College students are thinking abt impact of #nationaldebt on the future via @USAToday. Serious solutions needed. https://t.co/ZaoDaX8X4V"]["Be sure to tune in to your local news and radio as storms move through our state today. Stay safe and alert! https://t.co/B0jHnmX9SF"]["Great to speak w/ students visiting from Mountain Education Charter HS in Cleveland, GA this afternoon. Thank you! https://t.co/lTCGexyzWI"]["@SenatorIsakson &amp; I urge Senators on both sides of the aisle to confirm Judge Gorsuch w/o delay via @telegraphga: https://t.co/1U2sGFCDDv https://t.co/t277NhiSZ1"]["Proud that #Georgia is on the front lines of our country’s cyber defense. Read my op-ed in @AUG_Chronicle. #gapol https://t.co/h9weVo35Gl"]["Let's go, @Braves! Best of luck today. #ChopOn #OpeningDay https://t.co/WmFTTamoF2"]["My thoughts and prayers are with the firefighters and first responders on the scene at I-85."]["Enjoyed speaking w/ witnesses on @SASCMajority Readiness hearing panel to address health of DoD industrial base yesterday. https://t.co/O2gtW0xUHv"]["Sending a big thank you to the women &amp; men who work tirelessly to keep us healthy and safe. We appreciate you. #NationalDoctorsDay https://t.co/50pH9kbx9z"]["Congratulations, Jackets! #TogetherWeSwarm https://t.co/kkGaphtutX"]["RT if you agree: Judge Gorsuch must be confirmed as next Justice to the Supreme Court. #SCOTUS https://t.co/uNryS5PtaG"]["Great to meet w/ Jeff &amp; members of GA Assoc for Primary Health Care. Thanks for input on how to improve #healthcare for Georgians. #gapol https://t.co/Sl5pdOApHA"]["Thanks to the New Family from Byron for including me in your children’s learning experience today. I hope you enjoy the @USCapitol! https://t.co/QGmDCQrOxE"]["Met w/ Carson from Jasper today. We discussed his battle w/ overcoming life threatening illnesses. Thank you for sharing your story with me. https://t.co/2tUZmK99Yx"]["Join me on @CSPAN in about 5 mins. Speaking in support of Judge Neil Gorsuch as next #SCOTUS Justice. LIVE: https://t.co/yuRGXmAyWs"]["Enjoyed meeting today w/ Nancy from Atlanta &amp; hearing her story about surviving a brain aneurysm. Nancy, you’re an inspiration to us all. https://t.co/MnzA95cM4i"][".@POTUS prioritizes energy independence over political agendas w/ roll back of #CleanPowerPlan. https://t.co/Ufb6K6y799"]["Georgians from every corner mourn the loss of our dear friend, Jon. Sending heartfelt prayers to Jon's loved ones. https://t.co/HXVbsVNdOb"][".@WTVM shared my statement on @POTUS' approval of #KeystoneXL. Read it here: https://t.co/LlQXmUqS0d"]["Prepaid Card Rule is another example of a rule that hurts the people it intends to protect. Read my @Forbes op-ed: https://t.co/oMTDWX3KXp"]["Today in @BankingGOP, I had the chance to speak w/ #SEC nominee, Jay Clayton, about public companies. Check it out. https://t.co/em9WkqVNPw"]["In case you missed it, here are my opening remarks of support for my cousin, Sonny, to be the next Secretary of @USDA. #gapol https://t.co/kPnWxdkwPV"]["David Friedman is the right choice to be the Ambassador to @Israel. https://t.co/yOhBiDBnpc"]["My cousin, Sonny, is headed to his confirmation hearing to be the next @USDA Secretary. Join in here: https://t.co/RGTh9CueQJ https://t.co/GxK633ZRdz"]["Sending heartfelt prayers to London and the UK Parliament during this time. America stands with you."]["In a few moments, I'm joining a #wphalftime panel. Tune in: https://t.co/AyRwlP3Zmx #gapol https://t.co/4E2ysphIxH"]["Good to meet with great leaders from #Albany today. Thanks for coming by! #gapol https://t.co/2XcEVH1Jl3"]["Team Perdue attended the groundbreaking for the new Harris County Library. Congratulations to this great community! https://t.co/iOpVTMsXLf"]["Bonnie &amp; I join Georgians in lifting Jon, his family, and his friends up in prayer during this difficult time https://t.co/xoQgZZoEp6 #gapol https://t.co/r2OiZ3wcWM"]["Great read about @Georgia_AG's support for Judge Neil Gorsuch as our next Supreme Court Justice via @DeKalbNeighbor: https://t.co/dfRR4uNv2M"]["Grateful for all of Georgia's interns. Thank you! https://t.co/1OpHaRj9mQ"]["Lt. Gen. McMaster, a former @FortBenning Commanding General, is a great addition to @POTUS' cabinet. https://t.co/tJZtnYzY6X"][".@DanCoats is the right person to be the Director of National Intelligence. https://t.co/JIMw1pyieA"]["In a few moments, join me on @CNBC. #gapol https://t.co/eatuzL8AsK"]["Thank you to #Savannah Mayor DeLoach for speaking w/ me today. #gapol https://t.co/AqMAnSwhtV"]["Great to meet with leaders from #Rome last week. Thanks to all who came! #gapol https://t.co/wqC004GUAr"]["Talking w/ WTKS #Savannah now. Tune in: https://t.co/pT1xvPv96U"]["LISTEN LIVE: I'm speaking w/ @NewsRadio1067 shortly. https://t.co/XCdpz4nMEM #Atlanta"]["In about 5 mins, join me on @WRGA live. Listen here: https://t.co/UmOBG2Qsx6 #Rome"]["Congratulations! https://t.co/OOWYHKftcu"]["The Honey Shack in Clinch County and GA Olive Farms in Lanier County were just a few of the visits made by Team Perdue last week. https://t.co/mzVTgsY5ak"][".@POTUS' new Executive Order is meant to secure our country &amp; protect all Americans and refugees from our shared enemy. https://t.co/5GAgifv3GL"]["Congratulations, Coach! You make GA proud. @GTJoshPastner https://t.co/UeCZKBVtbm"]["I am proud to stand behind my friend, Attorney General @JeffSessions. https://t.co/Rv6BjYspNY https://t.co/OBUE9FdfwN"][".@GovernorPerry is a long-time advocate of American energy independence - proud to have voted for his confirmation. https://t.co/Wr13bkNhMG"]["Proud to confirm Dr. @RealBenCarson as the next @HUDEconDev Secretary. Look forward to working with you! https://t.co/kSjyhrXczV"]["Join me now @CNN w/ @ErinBurnett. #gapol #live https://t.co/hlVaNsBAOV"]["Joining @chucktodd on @MSNBC #MTPDaily now discuss @POTUS  #JointAddress. https://t.co/C9HtSmd6QI"]["Job #1 is getting the economy growing again. American consumer &amp; CEO confidence is on the rise w/ @POTUS' leadership. @SquawkCNBC https://t.co/1qeoS7pMAK"][".@SenatorFischer, I hope you have a great birthday. #HBD"]["Happy Birthday, @SenatorStrange! Welcome to the Senate - look forward to working with you. #HBD"]["In about 10 mins, join me on #BloombergDaybreak @business. https://t.co/aqdT5NwwAJ"]["NOW: Join me live on @CNBC @SquawkCNBC. #gapol https://t.co/gZDp9iqSe6"][".@POTUS' speech tonight clearly reaffirmed his heartfelt commitment to putting America first. #JointSession https://t.co/2rCVSwMx8V"]["American people were ready to put an end to \"politics as usual\" in Washington. @POTUS &amp; @VP fight to change the status quo. #JointAddress https://t.co/3CNaIxUeUv"]["Looking forward to hearing from @POTUS tonight at #JointAddress https://t.co/CqjjjmINCB"]["Our HBCUs play an important part in educating America’s next leaders. Proud of renewed colloboration w/ @WhiteHouse. https://t.co/0F9tPqktLQ https://t.co/2uhhlipHqG"]["Had fun interviewing w/ @wsbtv before #JointSession. Tune in at 6:00 PM. @JoeFloccari @CraigLucie https://t.co/I6xdTlyXb7"]["Great to speak w/ @OANN ahead of #JointAddress this evening. https://t.co/aWHcKEiYcC"][".@POTUS' EO to roll back the EPA's overreach is a resounding victory for #Georgia &amp; our country. #gapol https://t.co/ky3unQpTNo"]["Washington's budget process is broken. @POTUS is moving at a business pace, not a gov't pace, to fix it. https://t.co/zVyt1XJmiW"]["Looking forward to working w/ @WilburRoss to make America competitive again. @CommerceGov https://t.co/d50eF831tZ"]["Congratulations to @GeorgiaTech's Dean May. Best of luck in your new role at @ucdavis. https://t.co/EkPTPfCKeR"]["Great meeting w/ Atlanta Vietnam Veterans Business Assoc. Our vets deserve best care possible. Look fwd to working to hold VA accountable. https://t.co/rpwZYpxvmx"]["Informative meeting w/ GA doctors today. Doctors &amp; patients agree there is room for improvement re: healthcare for Georgians &amp; Americans. https://t.co/4N4xKCzgAf"]["Great to meet w/ Georgians @ the State Capitol today. #gapol https://t.co/mwCnh4SUKD"]["Lt. Gen. McMaster's proven track record &amp; extensive knowledge of our military will make him a great National Security Advisor. https://t.co/sBYXqhACro"][".@Albany_Herald shares why I am certain Judge Gorsuch is an outstanding choice for #SCOTUS &amp; the American people. https://t.co/1k6OXKTzEN"]["It is clear, the #CFPB should be subject to more Congressional oversight. It's past time to protect the American people. #gapol https://t.co/DChUGVyQDf"]["Look forward to working w/ @ScottPruittOK to return sanity to #EPA. #gapol https://t.co/7WZgYDIXQz"]["Working in #Senate @ 2:00 AM doesn't make for a good night's rest - necessary to ensure @POTUS' nominees get confirmed so we can get to work https://t.co/apmlNE2uTk"]["Great news for @FGPAO! @USArmy's 1st Security Force Assistance Brigade is bringing 500 new positions to #Columbus. https://t.co/YRwROC8mYn https://t.co/EObYW8g9Mn"]["The so-called \"Border-Adjustment Tax\" would hammer consumers &amp; economic growth. Last thing we need is bigger gov't. #gapol https://t.co/lx22D7v6eO"]["#CFPB must be held accountable for their actions. Time to limit size &amp; scope of big government. Read more @thehill: https://t.co/wTaXbuq9nH"]["Obama Admin’s attempt to prohibit law-abiding Americans from exercising their 2nd Amdt rights is blatant overreach. https://t.co/vmupxFNvFi https://t.co/gRPtMpNoqm"]["Happy Founders Day, @Morehouse College! #150Years #greatgaschools https://t.co/ni3DNcov5j"]["Linda McMahon has a history of creating #jobs &amp; is the right choice to lead @SBAgov. https://t.co/X4r3D9kYoy"]["We are well past the tipping point in our debt crisis. Steve Mnuchin has a deep understanding of what is good for Main Street America #gapol https://t.co/BPGtyii2IX"]["Happy Valentine’s Day to my beautiful wife, Bonnie – I don’t need a holiday to remind me how lucky I am to have you by my side. https://t.co/n1Im7SJ5ST"]["ICYMI: My op-ed in @WashTimes on why the “border adjustment tax” is a bad idea: https://t.co/V7ZuiAPnZv"]["After meeting w/ Judge Gorsuch, it's abundantly clear he's a principled jurist who will put Constitution &amp; rights of Americans first #SCOTUS https://t.co/1Qm9JmmaUr"]["Congratulations to my good friend, @RepTomPrice, our new Secretary of @HHSGov! There is no one more qualified to serve in this position."]["So-called “border adjustment tax” hammers consumers, shuts down econ growth &amp; is proven to grow gov’t: https://t.co/V7ZuiAPnZv @WashTimes"][".@USArmy is locating 2 new missions to @FGPAO, proving to be our nation's premier training installation. https://t.co/vswOxtpk8u #gapol https://t.co/jlu4CBJRry"]["Thank you, @SteveForbesCEO. https://t.co/DqYUH6QkhO"][".@RepBuddyCarter wrote a great opinion piece on why @RepTomPrice is best fit to lead @HHSGov. https://t.co/QvQrMPufEU #gapol"]["Border adjustment tax is a regressive tax that doesn't foster growth. Hear more via @YahooFinance below. https://t.co/qnSa1arq8g #gapol https://t.co/0QfgyHikr2"]["Proud that #Senate voted to confirm @jeffsessions as the next Attorney General of the U.S. https://t.co/N9xwqW6DM4"]["Thank you to Pres. Morehead &amp; @KirbySmartUGA for this surprise. Though a Yellow Jacket, I'm proud of all GA schools #GoDawgs @universityofga https://t.co/3UxWDc9ZUL"]["#Federaldebt is greatest threat to #nationalsecurity. Unacceptable to undercut women &amp; men in uniform w/ poor federal $ management. #gapol https://t.co/FdX8tZNGbp"]["In about 10 mins, I'm joining @YahooFinance All Market Summit. Watch here: https://t.co/Rft3CWaKVx #YahooAMS"][".@SenTomCotton &amp; I held a press conference to share rational changes to legal immigration. #RAISEAct https://t.co/0Kvze2wvuW https://t.co/N8LB3FbJ7q"]["Commemorating the life &amp; leadership of President Ronald Reagan on his birthday. #gapol https://t.co/5zDtRElslF"][".@SanfordBishop, Happy Birthday! Hope you had a great day!"]["Happy Birthday to my dear friend, @TomGravesGA14. Hope you had a great day!"]["Today’s action by the @WhiteHouse will finally begin to put pressure on #Iran, end provocative &amp; destabilizing behavior in the Middle East. https://t.co/DZU0ZPyNxM"]["Betsy DeVos is a tireless advocate for children &amp; I look forward to supporting her confirmation. https://t.co/qt5GY1YclG"]["Inspiring morning at the #nationalprayerbreakfast https://t.co/vFDAnYgE0k"]["Washington's broken budget process is a fraud on the #American people. It's time we deal w/ Budget Act that only worked 4 times in 42 yrs. https://t.co/Pi9mvYdmbv"]["Rex Tillerson will be instrumental in making bold changes to re-establish leadership &amp; credibility around the world. @StateDept https://t.co/UvHfTsw9Ub"]["If you are having an issue with a federal agency, Team Perdue is here to help. February Mobile Office Hours: https://t.co/vplSSAePTX https://t.co/qqhPBpmgy4"][".@RepTomPrice is #healthcare policy leader &amp; has common-sense plan to replace #Obamacare. More via @SenatorIsakson: https://t.co/AtO9DH1Lua"]["Had a great time meeting with Georgians &amp; discussing their concerns this morning. #gapol https://t.co/pk8TDLetMW"]["It was an honor to attend @POTUS' @WhiteHouse #SupremeCourt nomination ceremony for Judge Neil Gorsuch. https://t.co/mbTMprXsxq"]["Judge Neil Gorsuch has led a remarkable career. I look forward to confirming his nomination. #SupremeCourt #Justice https://t.co/EkkXt5Cn9Q"]["Having trouble getting in touch w/ my office? You can reach me via info shared below. I appreciate you taking time to share your thoughts. https://t.co/d4jRKDeIOt"]["Secretary Elaine Chao has the experience &amp; knowledge needed to provide @POTUS w/ sound advice on transportation. @USDOT https://t.co/5Ucs0y5oij"]["Like many Georgians, I have the utmost respect for Sally Yates, but I fully support @POTUS' action &amp; effort to protect Americans. #gapol https://t.co/OCYyRSE4Qm"][".@POTUS' recent action to #temporarily suspend refugee admissions to the U.S. directly deals with terror threats. https://t.co/PrKoVhLx4e"]["Proud of these fantastic young leaders from Moultrie. #ROTC #gapol https://t.co/Swq7aZMgik"]["Reflecting upon the tragic loss of so many on #HolocaustRemembranceDay. May we continue to strive for peace for generations to come."]["Congrats to my friend, @GeorgiaGrown Commissioner Gary Black, on being named @GeorgiaTrend's \"Georgian of the Year\" #gapol https://t.co/XPjppUGCCZ"]["In his 1st week, @POTUS is making #immigration policy a top priority. Great 1st step towards fixing the system &amp; focusing on nat'l security. https://t.co/KgvA2LSb2k"][".@POTUS is ready to hit the ground sprinting. Past time we break through gridlock &amp; distraction. More via @LifeZette https://t.co/ZyA0Mpbhdo"]["Jay knows capital formation. He wants to create a level playing field &amp; make things fair and efficient. I fully support his nomination (2/2) https://t.co/nxixgS9ZKW"]["Very Impressed by Jay Clayton &amp; excited to have someone who has worked in the free enterprise system. (1/2) https://t.co/eNc0wsHiSp"]["Proud to vote to confirm @nikkihaley as the Ambassador to the @UN. https://t.co/5vjkgIV44r"][".@SenatorIsakson &amp; I express our deepest sympathy and support for the people of #Georgia in the aftermath of last weekend's storms. https://t.co/e6O1P8GjMy"]["We finally have a @POTUS who has the guts to choose #American workers over special interests. #Keystone https://t.co/yv89VMc8HM"]["Vincent Viola is a talented businessman &amp; Army veteran who is ready to tackle the challenges facing our #Army. https://t.co/zTv54myHsq https://t.co/x2eO8dEfE2"][".@RedCross has a 24-hr shelter at Albany Civic Center. Those needing a ride to shelter, call Albany Transit 229-483-6226. #HelpAlbany"]["Congratulations, @AtlantaFalcons! #RiseUp https://t.co/2Hesh1EPuT"]["We must confirm key national security posts immediately. https://t.co/DXjjiwudyg https://t.co/jpVozWvOL6"]["Special thanks to heroes who came to DC from GA to protect our Capitol during #Inauguration. Grateful for Officers Garmon, Poston, &amp; Burt. https://t.co/uTNyqN7Umk"]["Congratulations to the next #POTUS &amp; #VPOTUS, @realDonaldTrump and @mike_pence."]["It is an honor to be at the #Inauguration this morning. Enormous moment of opportunity for our country. #USA"]["In about 10 mins, join me on @cspan for a preview of #inauguration &amp; future President @realDonaldTrump's priorities."]["NOW: Join me on @CNBC @SquawkCNBC. We're talking about #Inauguration!"]["Great to speak w/ @marthamaccallum on @FoxNews' @AmericaNewsroom re: President-elect @realDonaldTrump's cabinet. https://t.co/lrM9wYFAuP https://t.co/L0QJM2f7TK"]["TUNE IN: Speaking w/ @IngrahamAngle in about 15 mins. We're talking about #Inauguration. Listen #live here: https://t.co/X3Bslt0U0G"]["I could not be more proud of my cousin, Sonny, for being named the next Secretary of #Agriculture. #gapol #GeorgiaGrown https://t.co/gzAtoarUvt"]["#RexTillerson will bring a results-oriented focus to @StateDept &amp; diplomatic efforts around the world. https://t.co/tuCh3CKcWy"][".@AGScottPruitt teamed up w/ #Georgia to fight Obama’s unconstitutional #WOTUS rule. Glad he got nod from @RealDonaldTrump. #PruittHearing"]["Scott Pruitt has earned bipartisan respect &amp; recognition as OK Attorney General. Great pick to lead #EPA."]["In a few moments, I will be speaking with @THEHermanCain live. Tune in: https://t.co/CzcAiphuXU #gapol @wsbradio"][".@RepTomPrice will work to end #Washington's takeover of our health system. There is no doubt in my mind he is best to lead @HHSGov. https://t.co/JshxdbDRED"]["Excited to serve #Georgia through these new Banking Subcommittee assignments. https://t.co/soy1FUsyGy"]["It is my hope that we will continue to strive for the peace, justice &amp; understanding that Dr. King dedicated his life to. Happy MLK Day. https://t.co/rFAhAg0Omt"]["Congratulations to our @AtlantaFalcons! #RISEUP https://t.co/rld95v2Ycb"]["Gen. Mattis &amp; I agree #nationaldebt is greatest threat to #nationalsecurity. We must protect our country &amp; not leave debt for our children. https://t.co/dsfYjB0f0h"]["We are now one step closer to getting some real relief from this disastrous law. https://t.co/0asZZR0hR3 #Obamacare"][".@RepMickMulvaney is a great choice to lead us in a new direction as the Director of the #OMB. https://t.co/5VsstPM1MG https://t.co/ACEeNRgqdB"]["Seeking assistance with a federal agency? My office can help. Click on the link &amp; see January's Mobile Office Hours. https://t.co/uGcZSLfcMb https://t.co/5MbXFUhwIF"]["General Mattis will be absolutely essential in helping #America w/ its global security crisis. https://t.co/FjBg6ATkbP"][".@wjxt4 shares what #Georgia industry leaders are saying about my committee appts for the #115thCongress. https://t.co/eGEcZghPKq #gapol"]["Today, #Congress made it official. The Electoral College's ballots were certified for @realDonaldTrump &amp; @mike_pence. https://t.co/q9vLTD2okU"]["Joined @BillHemmer on @AmericaNewsroom via @FoxNews to preview @SASCMajority &amp; discuss foreign #cyber threats, hacking attempts. https://t.co/QoX43XiSv0"][".@RealBenCarson's heart for humanity is very impressive &amp; he will bring that commitment to this new responsibility. https://t.co/AjQV7417yf https://t.co/2PjhPoEJEd"]["Great to meet w/ @nikkihaley this afternoon. Read more about our visit here: https://t.co/wSrl6qnimb #UN https://t.co/gb8qMwS1Wl"]["Welcome to Twitter and the Senate, @SenJohnKennedy! Glad to be working together this year."]["Great news for #Georgia! @GovernorDeal announces @The_Linde_Group is investing $40M in Cook County. #jobs https://t.co/dlDKZAlTQE"]["Congrats to @SenatorIsakson on officially being sworn-in to the 115th Congress this morning. Look forward to continuing to work w/ you. https://t.co/iisNCVGO46"]["Friendly wager set with @McConnellPress on #TaxSlayerBowl. A @GeorgiaTechFB win over @UKFootball will be sweeter with #Kentucky @DerbyPie!"]["This election cycle &amp; its outcome sent a loud message to the #Washington establishment. https://t.co/9proFcLqm6"]["Congratulations, @SpelmanCollege! You make Georgia proud. https://t.co/Ksj34CC0MX"]["Happy Birthday to my dear friend &amp; colleague, @SenatorIsakson. I hope you have a wonderful day. https://t.co/t7REkZ2Jkl"][".@FGPAO's Cyber Command HQ is proving to be critical for #nationalsecurity &amp; development in #Augusta area. #gapol https://t.co/HkdydsrmtN"]["May your Christmas be filled w/ happiness &amp; hope. Let us not forget our women and men overseas. Merry Christmas from my family to yours. https://t.co/x0yarVYLqB"]["Wishing our friends in the Jewish community a safe and Happy Hanukkah this year. https://t.co/eJTqB3m58F"][".@telegraphga shares a touching story about 300+ Georgians gathering to honor our heroes for #WreathsAcrossAmerica. https://t.co/vadv6R71b4"][".@USPS at 2886 Sandy Plains Rd in #Marietta is designated as the “Marine Lance Corporal Squire ‘Skip’ Wells Post Office Building.” #gapol https://t.co/rqvFlG5zmS"]["Earlier this week, Sonny and I had great home cookin' at Forsyth Country Cooking. #goodeats https://t.co/XBhDcLPEQf"]["Our #veterans deserve the best care our country has to offer. #heroes https://t.co/oJge5VeXlF https://t.co/1iIEHFhuVf"]["Reauthorizing @FLETC1 is key to ensuring federal law enforcement officials &amp; first responders are adequately trained https://t.co/JEDok9C2CE https://t.co/xrR8ISmJFV"]["Looking fwd to hearing from Mr. Tillerson, examining goals for @StateDept &amp; learning more about his perspective on global security crisis. https://t.co/q4aBVohcWg"][".@NationalGuard, congratulations on 380 years &amp; thank you for your service to our great country. https://t.co/r9pHJ9WcmD"]["Congratulations @GraysonHigh, #Georgia's AAAAAAA Football State Champions via @GwinnettDaily https://t.co/OGM8IxxUSj"]["Thank you, @CongressmanHice."]["@RepSinema thank you!"]["@MikeCrapo thank you for the kind wishes."]["Happy Birthday, Senator! We hope you have a great day with your family and friends. Thank you for always being a great boss. -Team Perdue https://t.co/hgdifNdNty"]["#Water infrastructure is critical to our economic growth. #gapol https://t.co/dimkepd9m5"]["Here we go again...For the 19th consecutive yr, Washington has not funded fed gov on time. This is ridiculous. My thoughts on new #CR: https://t.co/4QESr9mlAF"]["Critical measures are being sent to @POTUS' desk to address our military's needs. We must support our troops &amp; their brave work. #NDAA https://t.co/Sd4ZUGUs1X"]["Heartbroken for @GaSouthwestern as they deal w/ the aftermath of today's tragedy. Lifting up these officers' family &amp; friends in prayer. https://t.co/ygNx55SgND"]["@ChrisMurphyCT Glad you like it! I hope you have time to #ShareACoke with your family over the holidays."]["21st Century Cures Act lays the foundation for next generation of cures &amp; treatment. #CuresNow https://t.co/ujDOBaoh1f"]["Today, we honor the lives lost on this day 75 years ago. We will never forget their service to our country. #PearlHarborRemembranceDay https://t.co/oFwXaHVAUj"]["Recent Defense Business Board study revealed possibility of saving $125 billion of unacceptable bureaucratic waste @ the #Pentagon https://t.co/oUPVUavv8N"]["Great news for #Atlanta, @Honeywell_Home, and Georgia business! https://t.co/5cjLVISE0E #gajobs"]["Congratulations, Petty Officer 2nd Class Otazo. Thank you for your selfless service to our country. @GwinnettDaily https://t.co/HN1WjMg7ZT"]["#Iran is a bad actor that cannot be trusted. More via @FreeBeacon https://t.co/pls8nyjkpN"][".@POTUS never should have waived key sanctions on #Iran. https://t.co/sOZTjVoErt"]["Proud to join w/ @RedCross to show appreciation for our women &amp; men in uniform for the holidays. #HolidaysforHeroes https://t.co/i47KrFdXlb"]["Congratulations to @USArmy on the new Armor Brigade Combat Team at #FortStewart #Georgia. https://t.co/G1ffDUIElK"]["Secretary Elaine Chao is the best choice to oversee modernization of our roads, airways, and bridges for @USDOT. https://t.co/mNGw2l9DBg"]["President-elect Trump's 100-day plan provides opportunity to work together to change the direction of our country. https://t.co/KWFsLRO1OG"][".@RepTomPrice is the right choice to lead @HHSGov. Congratulations to my friend &amp; fellow Georgian. #gapol https://t.co/11YdBh3SsG"]["Best of luck to @GeorgiaTech &amp; @universityofga as they head in to the next half. #UGAvsGT"]["From my family to yours, Happy Thanksgiving. https://t.co/6LeH54MKBo"]["Yesterday, I visited #GITMO detention facility. One thing is clear: it's positively irresponsible to release or transfer remaining detainees https://t.co/qx4LtxEyhj"][".@johnnyisakson @ChrisCoons &amp; I are calling for \"Driver Safe Sunday\" for Sunday after #Thanksgiving. https://t.co/IF1Z2rY70Y"]["National Geographic Traveler magazine named #Georgia a “Best of the World” destination. Read more via @AtlBizChron.\nhttps://t.co/tCM7kgRQt5"][".@SenatorSessions is a natural fit to lead our nation's Justice Department. My statement below: https://t.co/YCNpTyV287"]["Support your local @GeorgiaGrown farmers this weekend in #Atlanta! #agriculture https://t.co/gfMKi6R5P5"]["My wife &amp; I are continuously praying for Winston Hencely's speedy recovery. https://t.co/HiuRBB5nI7"]["Bonnie &amp; I send our heartfelt prayers to Peach County Deputy Daryl Smallwood &amp; family. Thank you for your service. https://t.co/N6lL896wqT"]["We stop today to reflect on the sacrifices our veterans &amp; their families have made. Happy #VeteransDay! https://t.co/E5DU3cm3Kr #USA https://t.co/y2jryNkRbG"]["Happy Birthday, @USMC! Thank you for your tireless service. #SemperFi https://t.co/w5Zk0UpYEv"]["Happy Birthday, @RepRickAllen. Hope you've had a great day. #HBD"]["Praying for the families of these fallen heroes. @ArmyTimes https://t.co/rSIVroOAAQ"]["It's past time we put patients back in charge of their health care decisions. #Obamacare @WSJopinion https://t.co/JdJNFM2ccI"]["#Obamacare has failed the very people this President claims to champion: the working women &amp; men of America https://t.co/tBN2zGoLDt @WTOC11"]["Great news from @RobinsAFB_GA via @telegraphga. #AirForce #nationalsecurity https://t.co/c0htpkFQQV"]["Don't miss this great @nytfoodfeed article about @oliverfarm in Pitts. Proud of #Georgia #agriculture. @GeorgiaGrown @GaFarmBureau https://t.co/sGlLY8oam7"]["#Georgia selected as #1 state to do business for the 4th year in a row! @AtlBizChron #gajobs https://t.co/Vii62wJiC6"]["Congratulations, #Shaw Industries! Flooring giant to open \"Create Centre\" in #Cartersville via @AtlBizChron. #gajobs https://t.co/bmK447259c"]["ICYMI: @DailySignal shares why Washington should focus on next generation instead of next election. https://t.co/7AOFms7f6y #TermLimits https://t.co/SdToLZYEtI"]["#HillarysEmails show she acted w/ extreme carelessness. This behavior cannot be allowed to continue. https://t.co/sZejHFjsQw"]["To break through #gridlock, Washington needs a politically neutral #budget process that works. https://t.co/jI1GnBST0V"]["Seeking assistance with a federal agency? My team is here to help. #gapol #VA #passports https://t.co/7KcOWLJpxC https://t.co/gCDpvXSOB5"][".@BreitbartNews highlights why I think #termlimits will break the vicious cycle of gridlock. https://t.co/Iwq3esANGi"]["Great news from @SavannahNow. Congratulations, @GeorgiaSouthern. #GoEagles https://t.co/Mu2IijtjJo"]["Georgians &amp; Americans are fed up w/ status quo in Washington. That's why I'm calling for #termlimits. https://t.co/duLII5wX0z @DailySignal"]["Congratulations, @DexterFowler! https://t.co/SYJLLfbPbK"]["Great news from Lithia Springs! @Medline to bring 200 new jobs to #Georgia according to @AtlBizChron. #gajobs https://t.co/py6ukBvNj0"]["Congrats to @GeorgiaTech's very own Shane Kimbrough for the safe arrival to #ISS for your mission. https://t.co/jAhXGBUW8w"]["Happy Birthday to my friend, Prime Minister @Netanyahu. I hope you have a wonderful day. https://t.co/MBw5ULVeWM"]["Had a great time at @sunbeltagexpo in Moultrie today. GA agriculture is 2nd to none. #GeorgiaGrown #Georgia https://t.co/Y4pmKrVQw3"]["Documents revealed #StateDept Under Secretary bribed &amp; pressured #FBI to protect then-Secretary Hillary Clinton - absolutely inexcusable. https://t.co/OXxvFWWlq9"][".@JohnnyIsakson @JohnCornyn @tedcruz @marcorubio &amp; I demand answers on aircraft sales to #IranAir w/ ties to terror. https://t.co/Xr5UDoC1Ww"]["@Kathleen0658 please contact my casework team at (404) 865-0087."]["Obama Admin's failure to notify top U.S. military officials abt $1.7B cash ransom payment to #Iran is unacceptable. https://t.co/m0wX75FnVc"]["Happy Birthday to my alma mater, @GeorgiaTech. Proud to be a Yellow Jacket. #TogetherWeSwarm https://t.co/TKk42qGsOP"]["Happy National Farmer's Day to all of #Georgia's excellent farmers. You make GA proud. @GeorgiaGrown @FarmMonitor #NationalFarmersDay https://t.co/B6kl77XhcJ"]["Seeking federal assistance? Take a look at Team Perdue's Mobile Office Hours for October. #Georgia #gapol https://t.co/OpncX3RiYY https://t.co/2V5xbQ75cg"][".@ajc: Today at noon, St. Simons Island residents are able to return home after #HurricaneMatthew. https://t.co/HXmZ9Jrta7"][".@TIME recently shared my thoughts on the crisis in #Syria. Read more: https://t.co/7DmUiq56Kb https://t.co/VcKCFD9nkN"]["As sundown approaches, my wife &amp; I would like to wish the Jewish community a healthy and happy #RoshHashanah. https://t.co/mvekrgLGT4"]["Happy Birthday, @RepHankJohnson. Hope you've had a great day. #HBD"]["Leading my colleagues on @SenateFloor to talk about fixing our broken #budget process. Watch here: https://t.co/yuRGXmAyWs"]["Happy Birthday, @BillCassidy! Hope you have a great day. #HBD"]["On 9/11, our country suffered a great loss &amp; no one understands this more than the families of the victims. https://t.co/A2ALldTxko #JASTA"]["Great to be with @GeorgiaSouthern's President, Dr. Jaimie Hebert. Thanks for meeting w/ me. #GoEagles https://t.co/Pioqg9fVQ0"]["#JSTARS is the premier battle-management command &amp; control asset used today. @RobinsAFB_GA https://t.co/JmMv7x9IlY"]["Team Perdue visited #Georgia Olive Farms in Lakeland to celebrate harvest season. https://t.co/Xbj09b6WVN"]["#MakingHistory with a true American hero at the opening of @NMAAHC. @JohnLewis, thank you for your leadership #gapol https://t.co/3LHzwJsMrT https://t.co/wZTc4G3lgr"]["Sharing a photo of my wife, Bonnie, and I from the @WhiteHouse's celebration for @NMAAHC. https://t.co/KEMaRhEMwj"]["Celebrating the opening of @NMAAHC w/ fellow Georgians at the @WhiteHouse. #gapol https://t.co/PgE1GGDeMg"]["Excited to have @RepTomGraves join the fight to help fix our broken #budget process. @Chattanoogancom https://t.co/gcJgcO8NDH"][".@RepTomGraves is committed to fixing Washington's broken budget process. Read more about his work to spur change. https://t.co/xdhv9uz4bJ"]["#Georgia is #1 state for peanuts, broilers, pecans, blueberries &amp; #2 in cotton. Regulation is GA farmers top issue. https://t.co/pK7ypoQ7EQ"]["Wanted to share this photo of our DC #intern for the fall. I'm grateful for each student's hard work! https://t.co/WboZ2FWDnw"]["Business as usual in #Washington looks like gridlock &amp; dysfunction to all of us on the outside. Full statement: https://t.co/bUURXbfCjt #CR https://t.co/Otsesx6hqB"]["Happy Birthday to my friend, @SenatorTimScott. I hope you have a wonderful day. #HBD"]["Great time speaking w/ @MatthewASwift @MorganOrtagus @LindseyGrahamSC @SenatorHeitkamp #GeorgeMitchell at @ConcordiaSummit. #Concordia16 https://t.co/ZBalWzM9Gl"][".@telegraphga shares details on Georgia's 1st #GoldStar Memorial unveiled in downtown Macon. https://t.co/xs95m2GIOB"]["May we never take our freedoms for granted. Happy #ConstitutionDay! https://t.co/wnPfvz54Eb https://t.co/owcqtkywFl"]["#Georgia businesses &amp; farmers rely on modern water infrastructure. #gapol https://t.co/z8mv2ZZZfh https://t.co/iCHgW2K0kO"]["1 year after the deal, #Iran is still the number one state sponsor of terrorism. Read my full op-ed via @fxnopinion https://t.co/HRLTYiBvDc"]["WATCH: Team Perdue had a great time celebrating the 30th Annual #Georgia Peanut Tour in Douglas today. @GeorgiaGrown https://t.co/CQ7tIJQvz9"][".@SenatorShaheen &amp; I share bipartisan support for #Lebanon's efforts to curb terrorism. https://t.co/UBjLpx1aAJ https://t.co/jbskdLIUd0"]["Happy #NationalPeanutDay! Georgia produced 57% of U.S. peanuts in 2015 - more than 1.7 million tons @georgiapeanuts https://t.co/FFk1MNOdRE"]["Great read from @MorganOrtagus &amp; @MatthewASwift about how #nationaldebt will impact #millennials via @huffingtonpost https://t.co/pUVafUrCHd"]["Congratulations, @Honeywell_Aero! Welcome to #Atlanta. #gajobs via @AtlBizChron. https://t.co/ULxVA0mAwU"]["Commemorating #September11 &amp; honoring the heroes who risked their lives in response. #NeverForget https://t.co/QOwwRVGFnp"]